[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid.",
    "timestamp" : "00:00-00:14"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:21-00:39",
    "text" : "Welcome back to the Pages Dynasty Podcast. You've made it to week 13. Well, we have. I'm not sure anybody's listening anymore. But we have a special guest with us today. But before we get to him, we have Mike and Greg on the show tonight. No, Steve. How are you boys doing?"
  },
  {
    "timestamp" : "00:40-00:43",
    "speaker" : "Mike Melo",
    "text" : "Doing I'm doing fantastic. Pretty darn well."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:44-00:47",
    "text" : "I should've I should have let one at a time. I knew better."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "00:47-00:47"
  },
  {
    "text" : "All right. Great. But also with us, we have uh Connor Ireland, who uh to me sounds like a name of uh Connor McGregor in an off-license MMA game, but I assure you he is not. Connor, how's it going, bud?",
    "speaker" : "Andy",
    "timestamp" : "00:47-01:05"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:06-01:27",
    "text" : "It's going well. I think my name kind of sounds like someone who grew up as an Irish kid who's cheered for the Patriots for their entire life back during the uh the Ben Coates Drew Blood, so who are those other guys? There's other guys. Um I uh I I cheered I cheered for those guys."
  },
  {
    "text" : "Huge fan.",
    "speaker" : "Andy",
    "timestamp" : "01:27-01:28"
  },
  {
    "timestamp" : "01:29-01:45",
    "text" : "Huge fan. Um Are you going to be able to do that? I don't know if Greg remembers this because he's just a a a wee one, but uh The Boston Globe used to do a poster of uh a a specific player every Sunday.",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that's right.",
    "timestamp" : "01:46-01:47"
  },
  {
    "text" : "And uh no one had been more Ben Coates posters on their walls um than I did. So, uh Greg, fuck with me when you can remember nineteen ninety six because I know I can.",
    "speaker" : "Connor Ireland",
    "timestamp" : "01:47-02:02"
  },
  {
    "speaker" : "Greg",
    "text" : "Well they used to hang 'em up at Market Basket. That's when you know that's right. Yeah. Coming up in market baskets. Yeah, up in the windows there.",
    "timestamp" : "02:02-02:12"
  },
  {
    "timestamp" : "02:13-02:18",
    "speaker" : "Connor Ireland",
    "text" : "Every s every Sunday there is a little poster in the back of the Sunday Globe."
  },
  {
    "timestamp" : "02:18-02:19",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "A specific player and I used to cut them out and tape them on my walls.",
    "timestamp" : "02:19-02:24"
  },
  {
    "speaker" : "Andy",
    "text" : "So Yeah, I think I had those up in my walls too. I remember those.",
    "timestamp" : "02:24-02:28"
  },
  {
    "text" : "Connor, have you ever seen my scrapbook, bro?",
    "speaker" : "Greg",
    "timestamp" : "02:28-02:31"
  },
  {
    "timestamp" : "02:34-02:39",
    "speaker" : "Andy",
    "text" : "I'm sorry the kid who had the uh the the Patriot shrine in his bedroom for uh completely serious."
  },
  {
    "speaker" : "Greg",
    "text" : "I scrapbooked this whole season. Yeah.",
    "timestamp" : "02:39-02:42"
  },
  {
    "timestamp" : "02:43-02:49",
    "speaker" : "Connor Ireland",
    "text" : "Let me guess, Greg. Your Patriot Shrine started in like what 2003, 2004?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "02:49-02:57",
    "text" : "Dude, it was pre-brady. Yep. I I scrapped Brady's first start."
  },
  {
    "text" : "He did it.",
    "speaker" : "Andy",
    "timestamp" : "02:57-02:58"
  },
  {
    "timestamp" : "02:58-03:00",
    "text" : "Okay. So don't come at me.",
    "speaker" : "Greg"
  },
  {
    "text" : "So 2000, 2001. Got it. Yep.",
    "timestamp" : "03:02-03:05",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "All right, so now that the dick measuring contest is over, how about we get to this football game, my boys? I didn't even join the dick measuring contest. Alright, you you would you would you like to chime in about how big your pager's dick is? Nah, there's time for that later. All right. Uh so yeah, this is like we said earlier, week thirteen of the two thousand one season. The Cleveland Browns coming to visit Foxboro Stadium with the gratuitous shots of CMGI fields in the background. Um Browns were actually uh good for the Browns this year, I guess. Uh coming into the game they were six and five, uh which was more wins than they had in the previous two seasons combined, where they went Two wins and then three wins. Uh unfortunately they would finish the season seven and nine, miss the playoffs. You know, typical brown shit. Um well they had Eric Crouch.",
    "timestamp" : "03:06-04:04",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "They had Eric Crouch. It's like the great, you know, what did he win a uh Heisman? He was like the great white hope for the Browns.",
    "timestamp" : "04:05-04:13"
  },
  {
    "text" : "Well they were talking about him as uh what the the Heisman winner or something in this game. But yeah, this was still this was pre-Crouch. This was um Tim Couch.",
    "timestamp" : "04:13-04:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "That's what I that's what I meant, Tim Tim Couch. Yeah, sorry.",
    "timestamp" : "04:25-04:28"
  },
  {
    "text" : "Yeah, he uh he I felt so bad for Tim Couch in this game. Well we'll get to that in a bit, but uh he he struggled. Uh he was sacked fifty-one times this season. I think yeah, we we touched on uh most sacked players in the in league history and I'm pretty sure this was on that list in like the top ten or twenty, whatever it was.",
    "speaker" : "Andy",
    "timestamp" : "04:28-04:53"
  },
  {
    "timestamp" : "04:54-04:56",
    "speaker" : "Mike Melo",
    "text" : "I don't know. It was some seventies on that list."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, it was uh what's his face was top of that list, far and away.",
    "timestamp" : "04:56-04:59"
  },
  {
    "timestamp" : "05:00-05:00",
    "speaker" : "Greg",
    "text" : "Car."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yes, yeah, yeah. Yeah.",
    "timestamp" : "05:00-05:02"
  },
  {
    "timestamp" : "05:03-05:06",
    "speaker" : "Greg",
    "text" : "It's like an expansion team thing, yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "That's true, yeah. Um so head coach was Bush Davis. Remember that which is a fucking fantastic name. Never never beat the Patriots. Uh the Pats went 2-0 against him. Some other notable coaches on this team though. There's actually like some who's who of uh future head coaching failures, I thought. Arian offense Bernader, yeah, yeah, Bruce Arians is probably the most successful of them all. Oh yeah. He was the head coach of the Cardinals for five years and is now currently the head coach of the Buccaneers. Uh him of Jameis Winston fame.",
    "timestamp" : "05:06-05:44"
  },
  {
    "text" : "I like I think he's a good coach.",
    "timestamp" : "05:44-05:47",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, but wasn't he the guy that talked about like he used to drink paint as a kid? Did I make that up?",
    "timestamp" : "05:47-05:52",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "05:53-05:54",
    "speaker" : "Greg",
    "text" : "I'll stat check."
  },
  {
    "speaker" : "Andy",
    "text" : "somewhere about him like either eating paint chips or like drinking paint as a kid.",
    "timestamp" : "06:00-06:04"
  },
  {
    "timestamp" : "06:05-06:13",
    "speaker" : "Greg",
    "text" : "Yeah? Bruce Arian said on Sirius today that he had to get his stomach pumped twice when he was younger. From drinking paint."
  },
  {
    "timestamp" : "06:14-06:17",
    "text" : "So not once, but twice.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, they said that in twenty seventeen.",
    "timestamp" : "06:17-06:19"
  },
  {
    "text" : "Yeah, yeah, I thought so. Uh secondary coach on this team was Todd Bowles, the uh old Jets head coach. Remember him?",
    "timestamp" : "06:19-06:27",
    "speaker" : "Andy"
  },
  {
    "text" : "Yep.",
    "timestamp" : "06:27-06:27",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh we liked playing against him. The pages were eight and one against Todd Bowles coach Jets teams. What happened on that loss? Um, I don't know off top of my head, but my guess it was probably like a week seventeen throw year uh backups in game. Yeah, you're probably right. Yeah. Or actually no, wasn't that uh I feel like Todd Bowles oh who was that Jets quarterback? After um after Sanchez. I think it was like the Virginia or Virginia Tech guy. Oh yeah. Oh, what's his name? Greg. I'll say Quincy Carter, but it's not Quincy Carter. Geno Smith, thank you. Yeah, I think it was Geno Smith Aaron. He had one. It was. Okay.",
    "timestamp" : "06:28-07:27"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "07:27-07:28",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "07:28-08:08",
    "speaker" : "Andy",
    "text" : "Close enough. Um Yeah, so I think that was during those days and uh those one game where Geno Smith just went off randomly and beat the Patriots. So that was probably that one win. I remember that. Um I'm assuming that was Todd Bowles, because I mean they've had a lot of dark moments, but Todd Bowles was one of the darker ones. And then the secondary coach was uh our old friend Chuck Bogano. Wow. Right, yeah. It was because he is the swinging gate. fake punt, Chuck Pagano, right?"
  },
  {
    "text" : "Oh yeah.",
    "timestamp" : "08:08-08:09",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "08:09-08:10",
    "speaker" : "Andy",
    "text" : "Okay."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "The greatest play in special teams history, I feel like.",
    "timestamp" : "08:10-08:13"
  },
  {
    "timestamp" : "08:13-08:27",
    "speaker" : "Andy",
    "text" : "Yeah. Oh, so hang on. Was Todd no, okay, never mind. I was gonna I was hoping that Todd Bowles was the coach of the butt fumble game, but that's that's uh can you hear me? Can you hear I can hear you now, yeah."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Okay, yeah, I just I I um j just hopped onto my uh Zoom meeting. My I my AirPods are connected to the Zoom meeting, so we're locked and loaded. Continue on with the show.",
    "timestamp" : "08:27-08:39"
  },
  {
    "timestamp" : "08:44-09:10",
    "text" : "We'll leave that in fuck it. That's what I'm saying. Um So I I took a quick look at the um the roster of this team, tried to put together a list of people that even like you may have heard of. And the only two people that I had heard of were Tim Couch and Phil Dawson, the kicker. The other names I d I didn't recognize.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "09:10-09:21",
    "text" : "You don't remember you don't remember Gerard Warren? the the defensive lineman that played for like twenty-seven years. You don't remember Earl Little, the the safety?",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Greg",
    "text" : "Nope. Then his Northcutt rang a bell when I Northcut for sure.",
    "timestamp" : "09:22-09:27"
  },
  {
    "timestamp" : "09:29-09:33",
    "speaker" : "Andy",
    "text" : "His bell rang. Kevin Johnson, I had no idea, but He was great."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "By the way, I just want to point this out. Um I have the zoom app because I use it for work Every time Greg talk it says Kelly Brown when he speaks. Yeah. So I just I just want that on I want that on record. Um Greg.",
    "timestamp" : "09:34-09:49"
  },
  {
    "timestamp" : "09:50-09:55",
    "speaker" : "Greg",
    "text" : "How do you feel about that, Greg? You know what? I'm a m I'm a modern man. And I'm"
  },
  {
    "text" : "He actually took her first name and she took his last name. So they're both Kelly Brown now. Holy shit, that is impressive.",
    "timestamp" : "09:57-10:04",
    "speaker" : "Andy"
  },
  {
    "text" : "It's fucking me up every time Greg talks that says Kelly Brown is speaking and you know, it it makes sense. Yep.",
    "timestamp" : "10:06-10:15",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "10:16-10:23",
    "speaker" : "Andy",
    "text" : "Uh I did recognize Corey Fuller, I think, but I don't know if that's just he had a good game in this game."
  },
  {
    "text" : "Or you're thinking of the core the wide receiver Corey Filler that was actually on the Browns a couple years ago.",
    "speaker" : "Connor Ireland",
    "timestamp" : "10:24-10:31"
  },
  {
    "timestamp" : "10:31-10:33",
    "speaker" : "Andy",
    "text" : "Um see that could be a two"
  },
  {
    "text" : "It's a different Corey Fuller.",
    "speaker" : "Connor Ireland",
    "timestamp" : "10:34-10:36"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "10:37-10:53",
    "text" : "Yeah. Apparently Jamar Miller was like a Pro Bowl first team all pro was he a linebacker. Um and he looked apart, but we still never heard of him. Don't remember him. And what it's just a who's who of just failures."
  },
  {
    "timestamp" : "10:54-11:09",
    "text" : "In terms of Brown's defense This is what bothers me, is there's a guy named Wally Raynor that had 13 tackles that game. I'm upset that I have never heard of a guy named Wally Rayner.",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "Nope. None of these guys. Because yeah, I'm putting in all the league lead the their leading running back was James Jackson. One, never heard of him. Two, he finished with five hundred and fifty-four rushing yards.",
    "timestamp" : "11:09-11:20"
  },
  {
    "timestamp" : "11:20-11:21",
    "speaker" : "Greg",
    "text" : "Yeah, never heard of him either."
  },
  {
    "timestamp" : "11:22-11:23",
    "speaker" : "Andy",
    "text" : "Leading rusher on this team."
  },
  {
    "text" : "So part of the reason, right, is because of the whole relocation, right?",
    "speaker" : "Greg",
    "timestamp" : "11:23-11:27"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes. So yeah, because that had just happened recently. Yeah, so the new Browns.",
    "timestamp" : "11:28-11:33"
  },
  {
    "text" : "The new Browns resume play in 1999. So they're two years back into their, you know, brand new franchise essentially.",
    "speaker" : "Greg",
    "timestamp" : "11:34-11:43"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "11:43-11:52",
    "text" : "I can't believe Bill it I can't believe Bill gave up on a franchise like this. It's really Blowing my mind."
  },
  {
    "timestamp" : "11:53-11:58",
    "speaker" : "Mike Melo",
    "text" : "They they gave up on him. Yeah. They did give up on him. He wanted to stick around. Yeah."
  },
  {
    "timestamp" : "11:59-12:02",
    "speaker" : "Greg",
    "text" : "And did you hear how it went down?"
  },
  {
    "text" : "I think so. I've heard a few different versions. I don't know what you've heard.",
    "timestamp" : "12:03-12:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "12:07-12:32",
    "speaker" : "Greg",
    "text" : "So Belichick makes the playoffs, right? That one year. Yeah. 11 and 5. The next year they're like, it's week five. And that's when Art Model, he like decides he's gonna announce that they're moving the team. The middle of the season. Right. Right. They win five games that year and then Belichick's gone."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "But then that also plays into the Jets situation because people shit on Belichick for bailing on the Jets position, but if people remember back then there was also an ownership change or it was at least Rocky, because they didn't know if they were gonna sell the team. And so I'm pretty sure Belichick didn't want to be a head coach for the second time and then have the team move or some janky crap happen. So, you know, it w it looked pretty bad, but if we if we look back at history Uh I I think it's a you know understandable move.",
    "timestamp" : "12:32-13:01"
  },
  {
    "timestamp" : "13:01-13:18",
    "text" : "Yeah. And I and I think you can also point out the fact that the last Coach uh to take the Browns to a playoff victory is still uh to this day Bill Belichick It's true. Beat beating our New England Patriots actually in that playoff game.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Imagine imagine this podcast like for the Browns.",
    "timestamp" : "13:18-13:22"
  },
  {
    "timestamp" : "13:28-13:32",
    "text" : "We should start that, Greg, just me and you, Browns on Browns.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. Oh I like that name.",
    "timestamp" : "13:32-13:34",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Just go back and just shit on the brown starting in two thousand one.",
    "timestamp" : "13:36-13:39"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "13:41-13:47",
    "text" : "Hey, you got the name of the podcast. It's called Shit Brown. There you go. Boom."
  },
  {
    "timestamp" : "13:49-13:50",
    "text" : "Beautiful.",
    "speaker" : "Andy"
  },
  {
    "text" : "Is that is that not insane though that you imagine being a Browns fan and you're like you you want to start a podcast. This one, I was like, oh my god, there's so much longevity to this. You start with Tom Brady's first game and you have 19 years. It's like we're gonna have a w we're gonna have a podcast forever. You do the Browns and you're like you're like, well, we're done. All right.",
    "speaker" : "Connor Ireland",
    "timestamp" : "13:50-14:13"
  },
  {
    "speaker" : "Andy",
    "text" : "So when do you even start with that?",
    "timestamp" : "14:14-14:16"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Thank thanks for coming back. You guys wanna cover uh some of those nineteen sixty Jim Brown games?",
    "timestamp" : "14:17-14:23"
  },
  {
    "text" : "Let's go play by play. Yeah. I mean I I feel like those games would be would be tough to cover because I don't think they had TV back then. So finding video of that Probably doesn't exist.",
    "speaker" : "Andy",
    "timestamp" : "14:23-14:34"
  },
  {
    "text" : "You can't look this up, but imagine Jim Brown breaking a tackle of a hundred and eighty-pound linebacker. that you've never heard of. Do you have the visual?",
    "timestamp" : "14:35-14:47",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Do you have the visual be a part time mechanic while also playing football? Yeah.",
    "speaker" : "Andy",
    "timestamp" : "14:47-14:52"
  },
  {
    "text" : "Autogram goes four for six through the air for 20 seconds.",
    "speaker" : "Greg",
    "timestamp" : "14:54-14:58"
  },
  {
    "timestamp" : "14:58-15:01",
    "speaker" : "Mike Melo",
    "text" : "Dude, this is sounding better and better by the second."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:04-15:11",
    "text" : "Oh, browns on browns, I'm telling you. Wait for that spin-off. I can feel it. We got something."
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "15:11-15:14",
    "text" : "That's how we expand our audience, Andy."
  },
  {
    "timestamp" : "15:15-15:26",
    "speaker" : "Andy",
    "text" : "Absolutely, yeah. But Browns fans and Patriots fans there. Two audiences ripe for the picking, I'm sure. Not that I think there's many Browns fans left, probably, but I don't know."
  },
  {
    "timestamp" : "15:26-15:29",
    "text" : "They do need a boost for those that are left.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "All right. So maybe maybe we'll bring our massive star power to the Browns as well. I can't wait. By the way, boys. Go ahead.",
    "speaker" : "Andy",
    "timestamp" : "15:29-15:39"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "15:39-15:51",
    "text" : "This is just a a side note. I got um Text confirmation, Talibanta Kane is ready to join the podcast starting in 2003. So we have some ground to make up."
  },
  {
    "timestamp" : "15:51-15:52",
    "speaker" : "Greg",
    "text" : "Yep."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "He did tell me that I would be allowed to ask him on air how big Tom Brady's dick is. So can we get to 2003 as soon as possible? Yeah. I'm interested in this.",
    "timestamp" : "15:53-16:05"
  },
  {
    "timestamp" : "16:05-16:06",
    "speaker" : "Mike Melo",
    "text" : "Alright."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:09-16:17",
    "text" : "I I've got some questions to ask Telly Bantacane about Kelly Brown, actually. Yep. So we yeah, we definitely need to have him on the podcast."
  },
  {
    "timestamp" : "16:18-16:19",
    "speaker" : "Greg",
    "text" : "Confirm the rumors."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:19-16:24",
    "text" : "Exactly, yeah. If he knows what uh uh what was it called? The credit card is?"
  },
  {
    "text" : "Yeah, the credit card switch.",
    "timestamp" : "16:24-16:25",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "16:25-16:31",
    "speaker" : "Andy",
    "text" : "Yeah, okay. So we'll we'll tease that for fucking two seasons from now."
  },
  {
    "timestamp" : "16:31-16:45",
    "speaker" : "Connor Ireland",
    "text" : "Well well well well Christian Fourier said that Tom Brady's nickname was Driftwood Tommy. And I want to know what exactly he means by driftwood. Like what are we talking here?"
  },
  {
    "timestamp" : "16:45-16:54",
    "text" : "Yeah, that's kind of ambiguous. You think that's gonna come out like when Brady retires? Is it cause it's soft and smooth? I don't I don't think so.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "16:54-17:02",
    "speaker" : "Connor Ireland",
    "text" : "No breaking news. Tom Brady's dick is the size of a log that has been out at sea for three years."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "He does have the what do they call that? That big dick energy? Is that what it is?",
    "timestamp" : "17:02-17:05"
  },
  {
    "timestamp" : "17:06-17:09",
    "speaker" : "Andy",
    "text" : "Oh, that's true, yeah. Yeah, he's got that big dick energy. Seems that way."
  },
  {
    "speaker" : "Greg",
    "text" : "Tommy Longcock.",
    "timestamp" : "17:09-17:11"
  },
  {
    "timestamp" : "17:14-17:48",
    "speaker" : "Andy",
    "text" : "Greg dresses him for uh for Halloween. God damn it. Alright, speaking of speaking of big dicks, uh let's talk about let's talk about our boy Tim Couch. I feel like we should probably start with him because for some reason I remember seeing highlights of this. I think it was like when I was putting together the website. And all the highlights are basically Tim Couch getting just absolutely the shit kicked in. It's Yeah."
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "17:53-18:00",
    "text" : "Yeah, it's Tim Couch running for his life. He went twenty for twenty-nine or twenty for thirty-nine in this game."
  },
  {
    "speaker" : "Andy",
    "text" : "His first pass attempt, like to set the tone of this game, uh second play from scrimmage, he drops back and I think it was um Teddy Bruske just puts his face mask right in his chest as he's throwing the ball and turns into a duck and he gets picked off like literally second play of the game. I think it was uh Tabuki Jones with that one. Yeah, exactly. And it went downhill from there. It was not great. And then he he actually had one drive that was good. And he got all the way down, like in the first quarter, got all the way down, and then threw a touchdown on third down, but that even that got overturned. So it was just not his day.",
    "timestamp" : "18:02-18:35"
  },
  {
    "text" : "Well, but I I don't know if it was necessarily his fault though because there were par parts of the game, man, he was looking like Steve Young running around and flinging it. The problem is is that he was getting smashed on every play. So it's hard to tell if it was like his fault or I mean the line didn't help for sure. But I don't know if that guy ever got like a fair shake in this game.",
    "speaker" : "Mike Melo",
    "timestamp" : "18:35-18:53"
  },
  {
    "timestamp" : "18:54-19:19",
    "speaker" : "Greg",
    "text" : "I don't think he's shaking his career. No, exactly. I mean he's drafted by an expansion team first overall, right? And then he only played five years in the NFL. Or only games in five seasons, all with the Browns. So he never even got that like, you know, every every you know first pick overall that bust always gets that second, third, fourth team. He never had them for him."
  },
  {
    "text" : "That's crazy. I never knew that. Yeah. That's true. Man, nice.",
    "timestamp" : "19:19-19:25",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Also, he was responsible for one, two, three Four um turnovers in that game, three picks and a forced fumble by uh my boy Tabucky. What a name, by the way.",
    "timestamp" : "19:26-19:38"
  },
  {
    "timestamp" : "19:39-19:41",
    "text" : "Well, I don't know if he was responsible for that though.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Uh maybe he recovered the fumble. I'm sorry.",
    "timestamp" : "19:42-19:44"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:44-19:48",
    "text" : "I Oh, you're talking about Tabuki Joe. I thought you were talking about um Tim Couch."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "No, Tim Couch was responsible for four Turn I mean he was involved in four turnovers in that game, three picks. Um and yeah, that's true.",
    "timestamp" : "19:49-20:03"
  },
  {
    "text" : "And then then he completed the pass that was then fumbled.",
    "speaker" : "Andy",
    "timestamp" : "20:03-20:06"
  },
  {
    "timestamp" : "20:06-20:11",
    "text" : "Yeah. R that's what it was. Tabucki had a pick and a force fumble in that game.",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:11-20:20",
    "text" : "Yeah. I mean the force fumble was uh was because Northcut literally got knocked the fuck out as he was like after he caught the ball."
  },
  {
    "text" : "You should have self-cut.",
    "speaker" : "Greg",
    "timestamp" : "20:20-20:21"
  },
  {
    "timestamp" : "20:26-20:38",
    "speaker" : "Andy",
    "text" : "Oh, that's so bad. I love it. Yeah, you should you should have you should have cut anywhere but north. You're absolutely correct. Hello for a second there. I thought you said self-cut and I thought that was That's what I thought."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "20:38-20:52",
    "text" : "I was like too early. No, but the guy's trying to make plays, so of course every once in a while it's gonna sail on him or whatever, but I mean he was pretty much the only playmaker on the field. They had nobody"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:52-21:07",
    "text" : "Yeah, there was nothing. Because I mean, even one of those interceptions, he hit the guy straight in the hands, he just bobbled it, and it was picked off by uh which defensive line was it? Answer Pleasant, I think, ended up with the interception. It was, yeah."
  },
  {
    "timestamp" : "21:07-21:09",
    "speaker" : "Connor Ireland",
    "text" : "It was Anthony Pleasant. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. For probably his only ever interception of his career, I have to guess. Oh wait, hmm.",
    "timestamp" : "21:10-21:17"
  },
  {
    "timestamp" : "21:22-21:55",
    "speaker" : "Connor Ireland",
    "text" : "There's so many names on this Pat's defense that just God, I fucking I love those early teams in terms like Anthony Pleasant. Uh we're we'll get to Roman Pfeiffer later. Uh maybe the most under Maybe the most underrated Patriots defensive player of like the early uh two thousands. But God, there's some great there's some fucking great man. Patrick Pass, who is what, our fullback? Had three tackles in that game. God, he must have just been doing work on either kickoff or punt."
  },
  {
    "text" : "Yeah, special teams. Yeah.",
    "timestamp" : "21:55-21:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Patch and pass. That's my fucking guy.",
    "timestamp" : "21:57-22:00"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "22:01-22:02",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:02-22:06",
    "speaker" : "Greg",
    "text" : "So Pleasant had two career interceptions. Two. Two."
  },
  {
    "speaker" : "Andy",
    "text" : "All right. Wow.",
    "timestamp" : "22:06-22:07"
  },
  {
    "speaker" : "Greg",
    "text" : "Eight career sacks. It's not bad.",
    "timestamp" : "22:07-22:10"
  },
  {
    "text" : "Yeah. Yeah. I mean, they say he's a defensive end, but he didn't feel like a defensive end. Yeah.",
    "timestamp" : "22:10-22:18",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Does this still happen Does this still happen where you have like your three main linebackers and they're all they all have like 10 plus tackles in a game. Does that still happen in the NFL or on the Patriots? Because I'm looking at Roman Pfeiffer, Mikey Vrabes, and and uh Teddy Ice Cold. And they all had ten plus tackles in this game. And it's like, does that even happen in the NFL anymore when you have three have three linebackers on a field anymore with how spread open things are",
    "timestamp" : "22:19-22:51"
  },
  {
    "speaker" : "Andy",
    "text" : "Like you'll have two and then you'll maybe have like a an extra safety come down of the box or something like that, you know? Like a Patrick Chung sort of thing with a with an extra D B on there.",
    "timestamp" : "22:51-23:00"
  },
  {
    "timestamp" : "23:01-23:22",
    "text" : "Yeah. Roman Pfeiffer was definitely one of those like hybrid outside linebackers like an Elvis Doomer like Doomerville or you know like not a not a traditional Linebacker, especially in today's day and age, but I'm looking at it right now and it's like Pfeiffer, Bruski, and Brabell. Uh 11 have a lot of people.",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "For a major.",
    "timestamp" : "23:26-23:26",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "23:28-23:28",
    "text" : "Yeah.",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "23:30-23:51",
    "text" : "Yeah. I did catch the uh when you were talking about underrated players on this defense, they uh the commentators at one point like, oh, I think one of the the most underrated players on this defense is Teddy Bruski. And I thought to myself, of all the all the people you can pick on this defense, I don't know if he's the one I'd I would have pulled out, but maybe he wasn't.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, but they were referencing that he was like a um he was a backup. Um before there were injuries. So I think he he was underrated.",
    "timestamp" : "23:51-23:59"
  },
  {
    "text" : "It was two thousand and one. It was two thousand and one Andy. He probably was an underrated, underused linebacker on the team. He probably didn't come into his own You didn't start seeing like Teddy Bruskey throwing up the snowballs during the snow game like into the like the 2003, 2004 What was you know, yeah, the 2003, 2004 era. Teddy Bruski wasn't like an everyday starter until then. Yeah.",
    "timestamp" : "23:59-24:26",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "24:26-24:30",
    "speaker" : "Mike Melo",
    "text" : "And I believe Twitter Johnson was like above 'em on the depth until he got like"
  },
  {
    "timestamp" : "24:32-25:09",
    "text" : "Uh that's what I thought until I'm just looking it up right this second. It was stat checking shit now these days. And ninety-nine two thousand both years you had 108 tackles. So I retract these guys. I know that but I mean that's what I thought too, especially the way they were talking about him, about how he's this this young up and comer. But I mean he'd been on the team since ninety six apparently. Didn't start any game Yeah, didn't start many games until ninety-nine. We started he started fourteen games and then sixteen games a year the year after or the year before this one. Oh, that's weird.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah. You're right. They were kind of it's almost like they never discovered him. I mean uh to be fair, the Patriots were obscure anyway. So maybe it was just that they were getting a little bit better and they noticed him. That's what I'm thinking, yeah. I mean, I will say Teddy Bruske, man, I don't know if there's been another linebacker that just flies around, tackle or no tackle, um usually not tackling, but he's just flying from off screen to somewhere. Um and I've never seen anybody else quite do it like him.",
    "timestamp" : "25:09-25:38"
  },
  {
    "timestamp" : "25:38-26:05",
    "text" : "Yeah, I think that's one of my favorite things to um to remember from from these teams is that that picture of Teddy Bruski just running at like on a blitz and just running at the guy the usually the the running back that steps up to to block him he just literally just tries to jump over him every time. Yeah. It's clipped in the legs but still just like his body hurdles into the into the quarterback and and just knocks him over like feet first or some bullshit.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "All right, you guys have two seconds to respond. What position where did Teddy Bruskey go to college and what position did he play?",
    "timestamp" : "26:05-26:14"
  },
  {
    "timestamp" : "26:14-26:16",
    "text" : "Arizona. Yes, he did.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "He was he he was a safety, wasn't he? He was a safety in Arizona, I'm pretty I'm pretty sure. Don't quote me on that, but it's on it's on air, it's on record. I'm pretty sure he was a safety at Arizona. With the point being though, he's massively undersized. He's always just been a fucking Bowling ball of hate apparent.",
    "timestamp" : "26:16-26:40"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:40-27:07",
    "text" : "Yeah, it's six one two forty-seven, which Not huge for I mean for well, I mean nowadays linebackers I think have kind of gotten smaller in general because they have to be quicker, but in this 2001 day and age where everybody was just Bigger in general, it seems like. I mean you look at the the tight ends of these games, and they all look like they're the same size as Rob Gragankowski. They're just basically an extra lineman with hands"
  },
  {
    "text" : "Yeah. Everybody looks lower too.",
    "timestamp" : "27:08-27:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. Yeah. Like just a little bit. Yeah. The the game wasn't about speed, it was about size. Because didn't um didn't Bill Parcells have some comment about Uh he he he built big teams because uh as the season goes on, fast teams get slower, but big teams never get any smaller or something like that. Yeah. But they also probably get slower. So this is true, but they start slow, so it doesn't matter. So that gap closes, right? But the size the size never changes. I guess that's true.",
    "timestamp" : "27:11-27:42"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "The best Parcell's quote is about being able to pick the groceries when he went to the Cowboys. It's like he's like, I wanna pick the groceries. And I couldn't it's like, amen. And that's one thing about Bill. That's why he's never leaving the pats. Bill gets to pick the groceries and fucking Robert Kraft signs the checks Bill builds his fucking like obscure team where people are like, how is this gonna work? And it's the same way that This is gonna really blow you guys' mind. The what the same way that Herb Brooks built the 1980 US Olympic team that built the Russians So like how is this gonna work and you just gotta you just gotta fuck with the vision. You gotta fuck with the vision and that's that",
    "timestamp" : "27:42-28:28"
  },
  {
    "timestamp" : "28:29-28:37",
    "text" : "Or you said you need to have a system. Yeah, that's I mean that I think that's a surprisingly apt analogy from someone like Connor.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And what do you that quote was about Uh, you know, he uh Parcellus was upset because he was forced to draft Terry Glenn.",
    "timestamp" : "28:37-28:45"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, and uh you know and speaking of Terry Glenn, he experienced this season. Nicely done. That was a hell of a segue. Yes, he he actually finally played in this game. Uh the Boston Globe had shit ton of articles. Thing was will he actually play or not because they settled their differences or some bullshit and he was kind of healthy But did you actually see they they showed the clip of we talked about it last week or the week before, um, about the interview that he gave where he basically said, uh Yeah, I'm hurt because I'm not getting paid. And I'm not getting paid, so I'm I'm gonna be hurt. Sort of bullshit.",
    "timestamp" : "28:45-29:28"
  },
  {
    "text" : "Right. He said I did want to be part of the Patriots. Yes. D I D did Oh, that's not clear.",
    "speaker" : "Mike Melo",
    "timestamp" : "29:28-29:36"
  },
  {
    "text" : "But his outfit on that was phenomenal. Dude, he is style. He is style. He had he had the cornrows. Which uh I'm assuming were a thing back in two thousand one. I'm just gonna guess.",
    "timestamp" : "29:40-29:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Because he was a stylish man, so ever heard of Alan Iverson, Andy?",
    "timestamp" : "29:53-29:58"
  },
  {
    "text" : "Yeah, good corn.",
    "speaker" : "Andy",
    "timestamp" : "29:58-29:59"
  },
  {
    "text" : "Yeah, I yes, I I'd say that cornrooms were a thing back in 2001. Yes.",
    "timestamp" : "30:00-30:05",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "30:05-30:34",
    "speaker" : "Andy",
    "text" : "I don't I don't follow Alan Iverson's uh hairstyle career. In terms of time tracking. That's all that's all we ever had? That doesn't work. Yeah, so he had he had the cornrows and then he had Those like I don't even know how you describe those sunglasses. They're almost like clear reflective sunglasses that were like wraparounds I don't even know if they were sunglasses."
  },
  {
    "timestamp" : "30:34-30:59",
    "speaker" : "Connor Ireland",
    "text" : "Let's honor the dead. Uh Terry Glenn and his son have uh passed on to the uh afterlife. Let's Let's uh not be too disrespectful. But my talking about how to do that. What a waste of talent. All right, I'll just dive in right now. Terry Glenn, what a fucking waste of talent. He could have been so good. I mean he was good."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:00-31:01",
    "text" : "He was when he was on the field, yeah."
  },
  {
    "timestamp" : "31:01-31:08",
    "text" : "He just like on the field. 96 to 98, he was probably like a top ten wide receiver.",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Greg",
    "text" : "He caught ninety balls as a rookie. Yeah. Eleven hundred yards.",
    "timestamp" : "31:09-31:14"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "What year was that, uh, Kelly?",
    "timestamp" : "31:14-31:17"
  },
  {
    "text" : "Ninety-six. Yeah. So there's a Super Bowl year, right? The first one?",
    "speaker" : "Greg",
    "timestamp" : "31:17-31:22"
  },
  {
    "timestamp" : "31:22-31:26",
    "text" : "It was, yeah. Yeah, as soon as you gave Drew Bledsoe a weapon, they they went to the Super Bowl.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:26-31:44",
    "text" : "Yeah, his pla his playing style matched up with Drew's perfectly 'cause Drew was so in love with his arm and he just did like the whole he just did the whole like fuck it, Terry's down there somewhere and Terry was like, you know, the perfect Terry would just be going long and Drew would just hit him.",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "But so similar to like uh Tom Tom Brady and Randy Moss.",
    "speaker" : "Andy",
    "timestamp" : "31:45-31:52"
  },
  {
    "timestamp" : "31:52-32:08",
    "speaker" : "Connor Ireland",
    "text" : "Yeah, or you've seen the Eli Moss you've seen like the Eli Manning meme where his eyes are closed and he's throwing the ball and he's like, fuck it. Uh Oh OBJ, OBJ, uh yeah, Manningham's down there somewhere. Yeah. Or something like that."
  },
  {
    "text" : "Exactly. Joe Flacco, jump ball Joe.",
    "speaker" : "Greg",
    "timestamp" : "32:09-32:13"
  },
  {
    "text" : "Yeah, say exactly the same idea.",
    "speaker" : "Andy",
    "timestamp" : "32:14-32:16"
  },
  {
    "timestamp" : "32:16-32:23",
    "text" : "Joe Flacco's best play was the throw it deep, get the defensive pass interference. That was by far his best play.",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Constantly. Oh, absolutely. Or let Bolden like body someone.",
    "timestamp" : "32:23-32:28",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "32:29-32:43",
    "text" : "Right, yeah. Okay, so week thirteen What do you think was the game changing play in this game? I I think everyone probably thinks it's the same one, but I I have one that's in mind. I just want to hear what other people think."
  },
  {
    "timestamp" : "32:43-32:48",
    "speaker" : "Andy",
    "text" : "Uh well I'm a Troy Brown stan, so I'm gonna go with uh his punt return touchdown."
  },
  {
    "text" : "That's the that's the only answer. One thing that well",
    "speaker" : "Connor Ireland",
    "timestamp" : "32:48-32:53"
  },
  {
    "text" : "I was gonna jump in with it's not a play, but the uh the two-minute drill before the half was a statement drill as well. That's not one play, so I'll give you that, but I I loved watching it and it I think it uh set the tone for the second half.",
    "speaker" : "Mike Melo",
    "timestamp" : "32:54-33:09"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:09-33:13",
    "text" : "Yeah, if NFL films are doing a turning point, I think it could be either of those situations."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh I agree, I agree.",
    "timestamp" : "33:14-33:15"
  },
  {
    "timestamp" : "33:16-33:45",
    "text" : "You know one thing that sticks out to me, like that's just a glaring difference between the early two thousand and like today's football? Lawyer Malloy, maybe our best overall defensive player, he had the game-changing block that freed Choi Brown up for that punt return. Do star def do star defensive players stay in on punt returns anymore? I feel like that's just like not a thing that happens anymore.",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Although I think uh Bill Belichick had had been I remember seeing something on one of those like uh documentaries that's been doing about Bill Belichick this offseason. And uh they were talking about how he Did the same thing in on the on in Cleveland on the Browns and had like all his top guys on there and it won them like a whole bunch of games, like literally on a punt return, like a walk-off punt return for a touchdown that won them the game. No, he he like that was part of his philosophy from day one, basically.",
    "timestamp" : "33:49-34:20",
    "speaker" : "Andy"
  },
  {
    "text" : "Isn't there wasn't there some stat from this year about how they were like paying Special teams players more than wide receivers. Yes.",
    "timestamp" : "34:21-34:28",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:28-34:44",
    "text" : "Like guys that only play special teams like Matthew Slater and But I think that's kind of like the evolution of having the starters on there to like literally just drafting guys who are starters on special teams now. Yeah, but that's such a beautiful strategy."
  },
  {
    "timestamp" : "34:45-35:17",
    "speaker" : "Connor Ireland",
    "text" : "I think that was my point. I feel like you just don't see it. You know, they have entire personnel changes when the punt returns when they know the team's punting. And like I was just reading up on it. It's like Richard Seymour, lawyer for boy. Um and and I think Vrabel, we're all out on punt return. And you know what could have been a major driver behind that. Do you remember when Gronk broke his forearm on a fucking extra point?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:18-35:20",
    "text" : "I was just gonna bring that out. Yeah."
  },
  {
    "text" : "Do you remember I I don't know if that in garbage time And he's been w I bet he probably still wears that fucking robot thing on his arm, even though he's not even play I I don't want to say that it was the major driver behind it, but like I feel like early two thousands Just a whole different animal. You had your best players out on your punt return. Oh, and on that punt return.",
    "speaker" : "Connor Ireland",
    "timestamp" : "35:20-35:49"
  },
  {
    "text" : "Um, to add to your point, that was a nasty Laura Malloy block, but then Richard Seymour, like you mentioned, was out there. He blasted the kicker on top of it.",
    "speaker" : "Mike Melo",
    "timestamp" : "35:50-35:59"
  },
  {
    "speaker" : "Andy",
    "text" : "That was that was gonna be my best. Watching six foot seven, three hundred and fifty pound Richard Seymour. Just basically just just walk right into the punter and the guy just falls over like he's been hit by a truck.",
    "timestamp" : "36:00-36:13"
  },
  {
    "timestamp" : "36:13-36:14",
    "text" : "It was fantastic.",
    "speaker" : "Greg"
  },
  {
    "text" : "He's actually got his hands up as he's doing it and the guy still falls over. Yeah, that's perfect.",
    "speaker" : "Andy",
    "timestamp" : "36:18-36:23"
  },
  {
    "text" : "Well, and to put it into perspective that oh go ahead.",
    "timestamp" : "36:23-36:26",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "No, you go ahead, Mike.",
    "timestamp" : "36:26-36:28"
  },
  {
    "text" : "I was just gonna say um to put it into perspective like game-wise, and correct me if I'm wrong because uh I slipped up last week, so whatever. But uh Uh at this point it was like uh ten ten in the second quarter. Um I think it was like four minutes left and the Troy Brown punt return touchdown for eighty-five yards um made it seventeen ten. So it was definitely a turning point in the game for those that are curious where we're at at this point, but uh uh go on Connor.",
    "speaker" : "Mike Melo",
    "timestamp" : "36:28-36:55"
  },
  {
    "text" : "No, I'll even add on top of that, I I think that we got the ball back at half and we scored right at half that punt return. actually turned into a a uh a sizable two score lead. And by sizable s two-score lead that makes no fucking sense because it's a two-score lead. But Oh that right sorry. Did they get the ball? Yes, that in that two minutes.",
    "timestamp" : "36:56-37:29",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "So yeah, so uh after the pun return, the Browns like drove straight down the field in like three plays. And then uh but then uh Tim Couch threw a pick to to Terrell Buckley. And then the Pats, they had the ball on their own like twenty or thirty uh with like um just over a minute left, but they actually drove down the field instead of and the the commentator the commentators actually made some comments about how It was a whole different philosophy 'cause Patriots in the past would have just like taken a knee and gone to halftime, but the Patriots actually drove down the field and had them Binateri kick the field goal with like a couple seconds left. So now they're up ten points going into into the half or up twenty to ten.",
    "timestamp" : "37:30-38:08",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "38:09-38:20",
    "text" : "It's actually even similar to the Super Bowl too. That's what I was thinking. It's definitely foreshadowing that, Greg. It's a minute 17. They have it on their own 30. Yep."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And they situational football baby.",
    "timestamp" : "38:21-38:23"
  },
  {
    "text" : "Troy Brown sets it up. And then they kick a few. It's almost like the sequencing is shit.",
    "speaker" : "Greg",
    "timestamp" : "38:29-38:36"
  },
  {
    "timestamp" : "38:37-38:40",
    "text" : "Can can I dive into that cliche even more?",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "38:41-38:42",
    "speaker" : "Andy"
  },
  {
    "text" : "Adam Benateri A Adam Venateri was the best player on that team. Obviously you're gonna fucking drive down the field no matter how much time is left. 'Cause you want to put the ball in your best players uh the best player on your team's hands. And that's not me saying that. That that's that's what Bill Belichick dude, that's what Bill Belichick was saying. He was saying Adam Vinateri, he was saying Adam Vinateri was the best player on that team. I swear to God, that is a direct quote. And this isn't from that year. I'm talking about years later, Bill Belichick thinking back to that team. He says that direct quote. Adam Vinateri was the best player on that team.",
    "speaker" : "Connor Ireland",
    "timestamp" : "38:42-39:24"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "So which is interesting because he even missed two kicks in this game. Yeah. What does that say?",
    "timestamp" : "39:24-39:31"
  },
  {
    "text" : "It's true.",
    "timestamp" : "39:32-39:33",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "And He hasn't been nearly as consistent uh throughout this season so far as I remember. 'Cause when you think of Adam Vinateri, you think of him just never ever missing kicks and always making the big ones. But This season especially, I thought he he hasn't been who I remember him to be.",
    "speaker" : "Andy",
    "timestamp" : "39:34-39:53"
  },
  {
    "text" : "I I'm pretty sure From what's it like week fourteen on I don't know this is not an absolute stat, but it's close. From week fourteen on, I don't know if Adam Venateri missed the field goal the rest of the year. It might maybe one. And this is the year familiar, yeah. And this is the year that we went on to win our first Super Bowl. I swear to God, maybe it was Not as cool as week fourteen, but I swear to God, he started a a week and he didn't miss a field goal the rest of the season and he was the best player on the team.",
    "timestamp" : "39:53-40:26",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Well, Connor, I'm interested in uh your take as we talked about this in uh previous um episode before, but um so You're saying that he got pretty automatic as the season went on, but obviously he was struggling um in the early part of the season. Same thing with uh Tom Brady. He had his bumps and bruises. There were some perfect games and then so far we've seen some kind of uh ducks thrown in um and all that. And uh Bill's philosophy at that time was, you know, ride those guys, right? Um he had faith in them. And I think nowadays he would have a little bit of a shorter leash for the same scenario with G Gaskowski or like some other guys. So what are your thoughts on his like departure of philosophy? Or is it the same philosophy and uh I'm misreading it?",
    "speaker" : "Mike Melo",
    "timestamp" : "40:26-41:07"
  },
  {
    "text" : "I I think you're right in the middle, because I don't think uh then it's Harry. I think from a I think week fourteen in two thousand one, maybe the rest of his care uh w rest of his career never had as bad of a stretch as Gustafsky has. I don't know you remember those games, Mike, Andy, Greg. When have you like a kick, like a 35 yard field goal have you ever during the Venatary era were you ever like, oh my god, I'm worried? Gustavo has missed Gustavo has missed those over and over again. He's so in like Venateri had a run where you knew no matter what it was automatic. 40 to 45 yards it was automatic. He hit most of the 50 plus yarders, but forty to five forty-five yards, you could just like you're like, I'm gonna go get some more chips and dip. Like you knew he was hitting it. Gustafsky, you're like Are we gonna lose this game because he can't kick a forty-yard field goal in a dome? Like it could be a dome. I'm telling you. But you know what, Mikey Mike, you're also right though, because I bet Bill Belichick's philosophy is the exact same But I don't think he ever got to the point with Venateri where he needs to start bringing in these fucking journeyman kickers. Like you do you remember fucking Bill Belichick having 57 year old Morton Anderson in for a trial cause Linarry was fucking unreliable? No",
    "speaker" : "Connor Ireland",
    "timestamp" : "41:07-42:40"
  },
  {
    "text" : "That's true, but yeah, they've not I agree they haven't had kickers they haven't had kickers in because Goskowski's unreliable is because he was hurt.",
    "timestamp" : "42:41-42:49",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, but what it was he like I don't know man was he hurt for three seasons",
    "speaker" : "Mike Melo",
    "timestamp" : "42:49-42:55"
  },
  {
    "timestamp" : "42:55-42:56",
    "text" : "No.",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "But it's all about it.",
    "speaker" : "Mike Melo",
    "timestamp" : "42:56-42:57"
  },
  {
    "timestamp" : "42:58-43:08",
    "speaker" : "Connor Ireland",
    "text" : "Did Vinitary miss an extra point in his entire career after like week fourteen, two thousand one? Granted It was from what? Twenty yards, twenty-five yards? I know it's thirty two."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:08-43:12",
    "text" : "It's not comparable at all. He actually has missed some, yes."
  },
  {
    "text" : "During During his during his dominant run with the pass",
    "timestamp" : "43:13-43:18",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Yes.",
    "speaker" : "Andy",
    "timestamp" : "43:19-43:19"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "43:20-43:21",
    "text" : "Which one?"
  },
  {
    "timestamp" : "43:21-43:28",
    "speaker" : "Andy",
    "text" : "Let's see. One, two. He missed three in one, two, three, five years."
  },
  {
    "text" : "All right, Connor.",
    "timestamp" : "43:28-43:28",
    "speaker" : "Greg"
  },
  {
    "text" : "F from the two yard line, the short kicks.",
    "speaker" : "Andy",
    "timestamp" : "43:29-43:31"
  },
  {
    "timestamp" : "43:32-43:36",
    "speaker" : "Greg",
    "text" : "Guess what his uh field goal percentage was in 2001."
  },
  {
    "timestamp" : "43:37-43:39",
    "speaker" : "Andy",
    "text" : "Me and Greg are looking at the same thing."
  },
  {
    "timestamp" : "43:39-43:43",
    "speaker" : "Connor Ireland",
    "text" : "No, no, no. Ask me what his field goal percentage was in 2004"
  },
  {
    "speaker" : "Greg",
    "text" : "Just answer the question. In 2001? The year we're talking about. Yes, 2001. 80%, Connor. You kicked 80% that year. That's not great. You're you have small brain syndrome. You only remember the kicks that were big.",
    "timestamp" : "43:44-44:02"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "44:02-44:05",
    "text" : "Which how many field goals? How many attempts?"
  },
  {
    "text" : "Pressure kick. How many attempts?",
    "timestamp" : "44:05-44:07",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "44:10-44:10",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "30 attempts, 30 field goals, and you made 24 of them.",
    "timestamp" : "44:11-44:14"
  },
  {
    "text" : "So name a kicker that's kicked uh attempted over 40 field goals and has had a better percentage. No, I want I want Benateri's best year. Not 2001 When he had a rocky start to the year. Andy, Mike both brought it up. He went on a run after week 14 and was the most reliable person on the team. Okay, you want to hear 48 yards in fucking three feet of snow?",
    "speaker" : "Connor Ireland",
    "timestamp" : "44:14-44:42"
  },
  {
    "text" : "So what they say is not clutch. 83. 8% Gostowski, 87. 4%.",
    "timestamp" : "44:44-44:52",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "44:53-44:56",
    "speaker" : "Andy",
    "text" : "Yeah. Interesting. Kostowski is more accurate technically."
  },
  {
    "timestamp" : "44:57-44:58",
    "speaker" : "Greg",
    "text" : "More accurate kicker."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Without a doubt. Yeah, but but to to Connor's point though, it's the eyeball test because if you remember, and I hate to bring this up and we'll talk about it later, but perfect season, right? Super Bowl, right before half, right before half. Gaskowski was given an opportunity, uh or there was an opportunity to kick. Belichick decided to go for some bullshit fourth and twenty or whatever it was instead of going for the kick. And if it was Vinatek I'm gonna Yeah, I know, I know, I'm sorry. But it's to prove your point, Connor. Uh Vinateri passed the eyeball test.",
    "timestamp" : "44:58-45:29"
  },
  {
    "speaker" : "Greg",
    "text" : "Well he was more clutch, right? We can agree on that.",
    "timestamp" : "45:29-45:32"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "I like yelling. All of the numbers Greg, Andy, all of the numbers for every statistic are inflated now. It is the score points league. Dude, we are talking about 2001. Tom Brady has the most It's like Dude, Tom Brady in this game.",
    "timestamp" : "45:33-45:53"
  },
  {
    "timestamp" : "45:55-45:56",
    "speaker" : "Andy",
    "text" : "How has kicking changed?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "45:57-46:07",
    "text" : "Connie, you're an idiot. If anything, they're lower because they move back the extra point. Kicking it hasn't changed. Outside of the the extra point rule ever."
  },
  {
    "text" : "And you know who has the record for most consecutive extra points kicked in a row?",
    "speaker" : "Andy",
    "timestamp" : "46:07-46:12"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yeah, it's not in the middle of the year. Yeah, w so w what was his rookie year? Two thousand seven?",
    "timestamp" : "46:12-46:22"
  },
  {
    "text" : "Not a bad time to thousand six. We're not we're not talking about totals here, we're talking about percentages, right? Yeah.",
    "speaker" : "Andy",
    "timestamp" : "46:22-46:31"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "So so you're telling me the uh Tom Brady, Randy Moss, Welk w West Welker days didn't put the kicker in a b better position uh position to hit field goals than the Tom Brady Fucking seventeen for twenty six, no touchdowns, two hundred and twenty yards and a couple of like game winning drives where Adam Venateri hit the field goal. Dude.",
    "timestamp" : "46:32-46:57"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I mean, alright, fine. Connor Connor makes another good point. He makes another point. In this game alone, he's right. I can't I can't uh disagree Um in this game alone, to be fair, uh the majority of his kicks that were attempt were around 50 yards. Yeah, but that's uh you got there's no",
    "timestamp" : "46:58-47:18"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Tom Brady threw 50 touchdowns in 2007. I don't know how many touchdowns total. You gotta add in fucking rushing touchdowns, defensive touchdowns, special teams touchdowns. Dude, Tom Brady was in the fucking red zone all game long. Gostowski had the easiest job in the game. I'm telling you. Vinateri with early pre-ACL injury, Tom Brady, was kicking 40 plus field goals all day long. Gostowski was in like the 30-35 range with the occasional 40 and like the ever magical I was like Greg, can we check that? Hey, hey, Greg, Greg, I don't need data I I've been watching the past since nineteen ninety-six. You were a fucking you were a fucking twinkle in your dad's eye in nineteen ninety-six. I've been watching the Patriots since nineteen ninety six.",
    "timestamp" : "47:20-48:18"
  },
  {
    "speaker" : "Greg",
    "text" : "You're a li a legitimate.",
    "timestamp" : "48:20-48:21"
  },
  {
    "text" : "I'm a yeah I'm a year I'm a year older. I'm a year older but I I'm a year older, but I know like his cognitive ability Like he probably didn't start to really get the enjoyment of the Patriots. Until the year after that, which is why I always have the apprehension.",
    "speaker" : "Connor Ireland",
    "timestamp" : "48:21-48:37"
  },
  {
    "text" : "Well, Greg, I'm more I'm I'm interested in the twinkle in your dad's eye if you'd like to talk about that for a little bit.",
    "timestamp" : "48:40-48:46",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "48:48-48:55",
    "speaker" : "Andy",
    "text" : "Or or perhaps we we go back to the Browns here, because I know people are fascinated by our kicker talk."
  },
  {
    "text" : "I'm gonna figure out the numbers on that. All right. Report back next week. Unless I'm wrong, then I won't.",
    "speaker" : "Greg",
    "timestamp" : "48:55-49:01"
  },
  {
    "text" : "I mean, uh, game-wise, I will say uh this was a weird one because it felt like both teams were kind of just mucking around. Um, you know, uh Brady had his mistakes, nothing was really like solid, um, especially in the first half, uh, but they they somehow made it work anyway. But it Throughout the game, no matter how, you know, one side sucked or another, it was pretty close to the end, which was surprising to me because th it was so sloppy.",
    "speaker" : "Mike Melo",
    "timestamp" : "49:02-49:30"
  },
  {
    "text" : "Yeah, and they were talking about how the uh the the Browns were like plus eight on the season in terms of turnovers, like turnover ratio.",
    "timestamp" : "49:32-49:41",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "49:41-50:02",
    "text" : "People forget like how turnover. People forget, dude. Earl Little was was a stud. Earl Little was a stud. He was a safety for the Browns. Gerard Warren in his Brown days was a menace on defense. Like the I mean, I uh they had a good def they had a good defense.",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "There's some names that were the other stat that they showed which makes that number even crazier is that In the the previous two games before this, the Browns had lost eight fumbles in those two games. Holy shit. Yeah, so that's a minus eight, and they're already, and there's still a plus eight on top of that.",
    "timestamp" : "50:02-50:20",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "50:20-50:28",
    "speaker" : "Mike Melo",
    "text" : "Dude, it's crazy though. They said up to this point, up to this week, they had twenty-five interceptions and thirty-one overall takeaways. That sounds like a shit ton."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. That's like one of those defenses that you expect to see at the top of the league that people talk about, but Because their offense was so bad. And they'd still won six games. And and you know the the commentators again kept coming back to us like this is how the Browns win games is their defense keeps them in it. And they they were talking about the the Cleveland Browns Ben don't break defense, which I thought was h hilarious. But and then hopefully the somebody will make a play at some point. Which I mean the Browns the the defense did. They scored The only touchdown? Yeah, they they s the Browns defense scored.",
    "timestamp" : "50:28-51:03"
  },
  {
    "text" : "Was it a pick six or a fumble? No, I think it was a pick six.",
    "timestamp" : "51:04-51:08",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "51:08-51:15",
    "speaker" : "Andy",
    "text" : "It was uh Yeah, it was Brady's it was Brady's first pass, was the was the pick six. It was a lob. Yeah, it wasn't great."
  },
  {
    "timestamp" : "51:15-51:57",
    "text" : "No, you know what Cory Folk and I agree with you, Andy, and then I think about some of those Pat's defenses, and I was a big Ben don't break. I was always like when people were like the pass defense is so bad the 30 second in the league and I was like a big bend don't break defense guy. Yards versus points. That was the same. Yeah. The passer putting up fifty points a game Obviously these offenses are gonna accumulate some yards and maybe score a point out to a point or two because they're they now have to throw fifty times a game to even try and keep up. And I was like I was ride or die on the bin, don't break defense, so watch it.",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. I I I think most most of us were. It's just funny just to listen to these guys talk about that uh from the Cleveland Browns standpoint.",
    "timestamp" : "51:57-52:04"
  },
  {
    "speaker" : "Greg",
    "text" : "It was brutal to watch though. Yes. Didn't feel like that was when they got and you're like, all right, now they're playing aggressive.",
    "timestamp" : "52:05-52:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "52:17-52:17"
  },
  {
    "text" : "It was like so refreshing to like watch a defense like make plays.",
    "timestamp" : "52:17-52:22",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, kind of like this this defense has been doing all year. This this 2001 defense. Yeah. But uh just the the level of violence that I thought this defense brought has kind of shocked me compared to because you we we're used to these Like all of these uh Steve Brown said it before too, where you y every play you look at like that's that's probably a penalty this nowadays.",
    "timestamp" : "52:23-52:46"
  },
  {
    "text" : "Like ever every though is it though? Because I was looking at that man, there like one of the best hits I've ever seen was on Tim Couch, uh delivered by Brewski like knocked his head off. And that was legal, man. 100%. And a lot of a lot of these hits, man, they it was like, you know, shoulder pads. They were just, I don't know if they were bigger, more aggressive. No idea.",
    "speaker" : "Mike Melo",
    "timestamp" : "52:46-53:07"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "53:07-53:15",
    "text" : "Uh it's I think a lot of it is the defenseless defenseless receiver stuff now. That was not a thing back then. And that's true."
  },
  {
    "speaker" : "Andy",
    "text" : "And I uh there's a lot of that in this game.",
    "timestamp" : "53:15-53:18"
  },
  {
    "timestamp" : "53:18-54:04",
    "speaker" : "Connor Ireland",
    "text" : "I I complete completely agree with Mike Mello though. I think back then because it was way more violent, you had to play smarter. And you had to like there was more I I don't know how to explain it. There was more shoulder to shoulder tackles back then when it was more like the violence was actually more. I don't know, I feel like these people the defenders especially are so afraid to play defense 'cause everything is a penalty now. They don't know what to do. So really they're just trying to like knock the guy's head off and just hope they stop him dead in his feet 'cause they don't know what legal and what's not anymore. That's defense has been g been getting screwed probably since the oh seven Brady Moss when they were like, all right, it's all about offense. Fuck the defense."
  },
  {
    "timestamp" : "54:05-54:12",
    "text" : "I was gonna say oh four when uh the Colts Yeah the Colts got the rules changed. Yeah the beginning at the end of DC.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "So that's when it was oh four",
    "timestamp" : "54:12-54:14"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "54:15-54:15"
  },
  {
    "timestamp" : "54:16-54:21",
    "speaker" : "Connor Ireland",
    "text" : "Okay. I said I said 07 because I thought we did it better than they did, which we did."
  },
  {
    "text" : "Well I well I think that was Belichick's way of being like, hey fuck you, you want to change the rules? Okay I'll exploit that one instead. And that's exactly what he did.",
    "speaker" : "Andy",
    "timestamp" : "54:22-54:30"
  },
  {
    "text" : "Agreed.",
    "timestamp" : "54:30-54:30",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "54:31-54:41",
    "speaker" : "Andy",
    "text" : "All right. Anybody else got any uh notes on this game? Greg, you want to bring up the score? Oh yeah. Haven't mentioned the final score in any of these games, I don't think, yet."
  },
  {
    "text" : "27-16.",
    "timestamp" : "54:41-54:43",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "There it is. All right. Good job, Scat Guy.",
    "timestamp" : "54:44-54:47"
  },
  {
    "timestamp" : "54:48-55:08",
    "speaker" : "Mike Melo",
    "text" : "Um, I will say though, man, like like I said, like the the Pats were were comfortable for a while, but Brady was just off. Now to his credit, To his credit, I mean he had the composure to like just keep going and he didn't fall apart, you know? But um there was no manning face on Brady's face in this He just doesn't get rattled."
  },
  {
    "speaker" : "Andy",
    "text" : "Right he'll throw a pick and you'll come back and They they were they were pointing it out that that um who's the offense coordinator, Charlie Weiss would would come out and the next three players would be just like, all right, chuck it, but not even just like short passes, like, all right, I want you to chuck it downfield 20 yards Right. Like they just seemed to have full confidence in him actually doing what he needed to do.",
    "timestamp" : "55:09-55:29"
  },
  {
    "text" : "Dude, but it was crazy because it was it was twenty to ten. And this is one of the worst interceptions I've ever seen Brady throw. And he might have been giving he might have been getting like Beletto tips a little bit too much during game. Brady basically launches a ball. As he's falling forward and both of his like legs are almost off the ground being like grabbed by like some defender. So he throws this nasty pick. They end up that leads eventually to uh a Browns field goal and it's 20 to 13 just like that. Yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "55:30-56:00"
  },
  {
    "text" : "By the way, Mike, that exact play. It was third and long. And did you see Tom Brady's quote in the paper the day after? It's something you would never hear you would never hear him well, luckily Andy uploads all the uh newspapers. Um like a goddamn you are a psychopath. Dude.",
    "speaker" : "Connor Ireland",
    "timestamp" : "56:01-56:28"
  },
  {
    "speaker" : "Andy",
    "text" : "What you don't know is I actually print these off and I have them up on my wall in my bedroom with the with all the pins connecting it. Beautiful. I believe this.",
    "timestamp" : "56:30-56:38"
  },
  {
    "timestamp" : "56:40-58:01",
    "speaker" : "Connor Ireland",
    "text" : "It looks like the wall of like the war room in and in the CIA. There's like all these strings with fucking tacks leading to like one another 'cause that's ins but Tom Brady in the paper goes, Sometimes I need to stay in there and take more hits. And this is like he's talking about it's third and long. He's like, it's better basically to get hit and take a sack than do what I did on that play, which is That was the horrible interception you're talking about. Could you imagine post H C L Tare Tom Brady when he changed his whole mindset on like health and what what's important, obviously, it's pliability. It's all about pliability. But he's like, I need to sta I need to stay in there and take more hits. That's just not something you would ever hear to post 2007 Tom Brady ever say and it just kind of speaks to how different his mindset was and honestly how different the game was. The game has changed so much like You quarterbacks don't get hit the way Tom Brady got hit back then and he's fucking tough as nails. He's tough he's one of the toughest ever And and I'll I'll I'm done talking for the rest of the podcast. But I like conference."
  },
  {
    "timestamp" : "58:01-58:51",
    "speaker" : "Mike Melo",
    "text" : "No, it's uh it that that makes sense. I mean it is funny. I like uh I'm a Brent Jones and Gus Johnson guy. I mean we talk about these announcers pretty frequently. And um, you know, I don't think there's a football or not football this week, guys. Uh I think I got most of it. But um but uh Jones goes, um, what did he say? He oh he said uh uh a player's name wrong. And then he was like, uh oh I I'm so sorry, it's actually this. Um and he goes up I'm I'm hearkening back to my playing days. And then Gus Johnson is like, ha ha ha ha ha ha. Six concussions, I understand. And then like Brett Jones is like, what was your name again? And then Gus Johnson. So like they're openly laughing about concussions back then. Yeah, about the fact that he made six concussions while definitely a different time."
  },
  {
    "timestamp" : "58:52-59:03",
    "speaker" : "Connor Ireland",
    "text" : "CTE, I don't think I don't think even think that acronym was even a thing. CTE was not a thing. Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:03-59:31",
    "text" : "Yeah, I mean we've talked about the uh talked about Drew Bledsoe and how like when he got hit against the Jets the first time, and they're talking to the the team trainer who was literally standing right there when he saw it happen. And he's like, Oh, I checked him out for concussion, but he seemed fine, so we put him back in the game. And then like the day after all the players were like, Yeah, he didn't actually know what play he was calling, so we told him he shouldn't be out here. So we Like the players actually sent him back off the field because he was so bad. Okay."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "59:34-59:48",
    "text" : "Um Uh also by the way, uh the announcers were talking about how the night before uh they had dinner with Kraft and uh Kraft paid for everything. And I was just wondering what else he paid for. No."
  },
  {
    "timestamp" : "59:49-01:00:34",
    "speaker" : "Andy",
    "text" : "Oh. See, that's not where I thought you were gonna go with that. I thought we were gonna go with um it's a slight take on your your football, not football. It's uh Hall of Famer, not Hall of Famer. Ooh. Ooh. Yes, Brent Jones. I know. I did. Yes, sir. He was they they were congratulating him because he was inducted into the Hall of Fame and I thought, you gotta be fucking kidding me, not another one. But it was actually the Division II Hall of Fame. And they showed a clip of his his uh speech and uh it sounded a little CTE. But his big joke was uh the fact that obviously the division two guys are smarter because you know what? We've got the playoffs. And that was his his uh bring down the house moment."
  },
  {
    "timestamp" : "01:00:35-01:00:50",
    "speaker" : "Connor Ireland",
    "text" : "Uh Andy, d do you think people didn't know that Drew Bledzo was concussed is because he was basically just a traffic arm uh a traffic cone with arms. Even when he was a happy."
  },
  {
    "speaker" : "Andy",
    "text" : "He was literally I'm a big fan of Drew Bledsoe.",
    "timestamp" : "01:00:51-01:00:53"
  },
  {
    "timestamp" : "01:00:55-01:01:34",
    "speaker" : "Connor Ireland",
    "text" : "Hey, boys. Um I'm thirty-three years old. I m the peak of my fandom might have been during the Drew Bledsoe days. I'm just saying he was a traffic cone with a right arm from his rookie year. That guy could not get out of the way of his I mean, he he probably had the work worse like Pocket aware. But he was one of those guys, his arm was so good, he thought he could make any throw on the field. I swear to God, Drew Bledsoe. Except for a swing pass. I was gonna say or a screen pass."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:01:35-01:01:37",
    "text" : "He's gonna be rifling that in regardless."
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:01:37-01:01:49",
    "text" : "Yeah, yeah, he's like what is a screen pass? I like You know what I do. I fucking throw rockets all over the field. It's like, what's this nice touch pass you're talking about?"
  },
  {
    "text" : "Oh, fuck that. Gun it in there. Amazing.",
    "speaker" : "Andy",
    "timestamp" : "01:01:50-01:01:53"
  },
  {
    "timestamp" : "01:01:53-01:01:54",
    "text" : "Greg? All right.",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "01:01:55-01:01:59",
    "speaker" : "Mike Melo",
    "text" : "Um is Greg Brown gone. Can I can I No I'm here."
  },
  {
    "text" : "He's here.",
    "speaker" : "Andy",
    "timestamp" : "01:01:59-01:02:00"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:02:01-01:02:03",
    "text" : "You're just listening to this uh this"
  },
  {
    "text" : "No, but what is your role what is what is your role on this podcast if you won't speak for fifteen minutes, Greg?",
    "timestamp" : "01:02:03-01:02:10",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:02:10-01:02:16",
    "text" : "Yeah, well when you run your mouth for fifteen it's kinda hard to get a word in"
  },
  {
    "timestamp" : "01:02:23-01:02:26",
    "speaker" : "Connor Ireland",
    "text" : "Well uh Greg, you're doing a fine job with the stats."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I really like what you're bringing in the game here.",
    "timestamp" : "01:02:26-01:02:28"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "And also, Greg, your br your brother is against you. I told him when you guys were talking about Tom Brady's looks, and Greg cut in and said, Would you bang him? It was laugh out loud, funny. And the fact that Andy didn't cut that up and put that on social media lets me know that he doesn't want you your career to take off. So um it's not on me, Greg. You need to talk to Andy.",
    "timestamp" : "01:02:28-01:02:51"
  },
  {
    "timestamp" : "01:02:52-01:02:58",
    "speaker" : "Greg",
    "text" : "I'm I'm here for the love of the game. You know? I'm not here for publicity, the likes, the shares."
  },
  {
    "timestamp" : "01:02:58-01:03:38",
    "speaker" : "Mike Melo",
    "text" : "All right. Speaking of banging and all that other stuff, I I let's try out a uh a football or not football quickly on Connor and see what he thinks. Um So these things have popped up week to week because I just don't understand football and Andy is smarter than I am and Greg is smarter than I am and Steve perhaps. So I like to rely on them uh to give me a little knowledge. So a Brent Jones did say, and I quote, Santiago has two hands on it and just couldn't hold on. Santiago had two hands on it and just couldn't hold on. What does that mean? Is that football or not football? I don't know. He had two hands on it and just couldn't hold on."
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:03:39-01:03:40",
    "text" : "Two hands on what?"
  },
  {
    "timestamp" : "01:03:44-01:03:46",
    "text" : "Yeah, Brent Jones is saying that",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "When was this? Is this are is this like a day in sports and around the same time as week thirteen uh No, this is during the game.",
    "timestamp" : "01:03:46-01:03:54",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:03:54-01:04:01",
    "text" : "You just had two hands on it. I'm kind of hazy on what that it is, and he just couldn't hold on."
  },
  {
    "timestamp" : "01:04:01-01:04:13",
    "speaker" : "Andy",
    "text" : "So I you know what I think it might be is uh he had two hands on the marijuana that he was um arrested for. When was that? In the paper there was uh I was surprised to actually see him."
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:04:14-01:04:48",
    "text" : "Are you talking about Greg are you talking about okay, are you guys fucking with We're not ta we're not talking about the Browns O lineman, Greg all right, Andy, because what you're saying is the Browns O lineman, Greg Robinson just got arrested with like a hundred and seventy pounds of weed and now you're talking about Some something that happened in the rock. Who is Santiago? Jose Santiago, go fuck him. Wait, Aaron, clarify your statement. Who the hell went to jail for this?"
  },
  {
    "text" : "I I would I would actually clarify if Connor would shut the fuck up.",
    "timestamp" : "01:04:49-01:04:52",
    "speaker" : "Andy"
  },
  {
    "text" : "Wait, OJ Simpson is a different player, guys.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:04:52-01:04:55"
  },
  {
    "timestamp" : "01:04:56-01:05:45",
    "speaker" : "Andy",
    "text" : "So in the in the Boston Globe, there was this tiny little sl little little blurb that caught my eye. It said warrants out for Santiago. A warrant was issued in Pittsburgh for the arrest of Cleveland Browns tight end O. J. Santiago for marijuana possession, the Cleveland Plain Deal reported yesterday. According to the paper. The warrant's connected to the November twentieth arrest of defensive tackle Gerard Warren, who faces a charge of carrying unlicensed firearm in his car during a search, police found marijuana, which they now believe belonged to Santiago. So the fact that San Santiago is actually allowed to play in this game surprised me. But so my guess is Ren Jones was talking about the fact that he was trying to hide his his marijuana. And uh so he was trying to get both hands on it but obviously couldn't, which is why he filed a warrant out for his arrest. That makes so much sense."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Brent Jones was trying to be clever and like that old fucking corny dad like corny joke way. Yes. And Gerard Warren, you've seen his hair, and I'm not stereotyping to obviously he smoked sweet. He looked like He looks like Afroman. You ever heard his song talk?",
    "timestamp" : "01:05:45-01:06:05"
  },
  {
    "timestamp" : "01:06:09-01:06:19",
    "text" : "All right, Andy, edit this out. All right. He just he just went, I'm not stereotyping, but he looks like Afro Man.",
    "speaker" : "Greg"
  },
  {
    "text" : "Well you know he's talking about the uh but it's not even like they actually they actually look alike Greg. That wasn't just a broad stat check that Greg please.",
    "speaker" : "Connor Ireland",
    "timestamp" : "01:06:21-01:06:31"
  },
  {
    "timestamp" : "01:06:31-01:06:55",
    "speaker" : "Greg",
    "text" : "Can you stack check that? Greg, can you get on that please? But I'll look up a picture. And I'll also say while he's looking, uh looks like Vince Wilfork. When he shaved it. What you that is wow. He looks exactly like Vince Wilfark when he has his head shaved. That's racist."
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:06:56-01:07:05",
    "text" : "Yes, he does. I am Greg, I'm obviously looking at pictures. Now look up Afro Man. It was not a good thing."
  },
  {
    "text" : "But he was like, Oh, this is gay at the five and then he's taken down at the thirty three yard line I don't know why he was saying that, but uh I I don't agree with that.",
    "timestamp" : "01:07:16-01:07:26",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:07:26-01:07:40",
    "text" : "Oh, that one I do know. What is it? Uh because the kick returner and uh you you can't make this up. His name was Ben Gay. I don't know if he was named after the um wasn't that like the Icy Hot stuff that you would write about himself?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Are you serious? So that was football.",
    "timestamp" : "01:07:41-01:07:43"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:07:44-01:07:44",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Uh my apologies to uh Brent Jones.",
    "timestamp" : "01:07:44-01:07:47"
  },
  {
    "speaker" : "Andy",
    "text" : "But uh you know the the the topical pain relief product Benge, which I remember because uh in soccer In high school, everybody used to rub it in other people's underwear and shit. So they're cheaper.",
    "timestamp" : "01:07:47-01:07:59"
  },
  {
    "timestamp" : "01:07:59-01:08:02",
    "text" : "What the fuck are you talking about, Andy?",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:08:02-01:08:04",
    "speaker" : "Andy",
    "text" : "That's all I know. Never happened to me."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I guess people thought I was Did you ever do it to anybody?",
    "timestamp" : "01:08:04-01:08:07"
  },
  {
    "text" : "No, I I couldn't afford Ben Game.",
    "timestamp" : "01:08:07-01:08:09",
    "speaker" : "Andy"
  },
  {
    "text" : "Did you ever watch somebody do it to anybody?",
    "timestamp" : "01:08:09-01:08:11",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:08:11-01:08:16",
    "text" : "And then go home later and do it to yourself? Answer the question.",
    "speaker" : "Greg"
  },
  {
    "text" : "I plead the fifth. You know, his name is literally Ben Gay, running back.",
    "speaker" : "Andy",
    "timestamp" : "01:08:19-01:08:25"
  },
  {
    "speaker" : "Greg",
    "text" : "Wow, all right.",
    "timestamp" : "01:08:25-01:08:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Well then I take it back, Brent Jones.",
    "timestamp" : "01:08:26-01:08:28"
  },
  {
    "timestamp" : "01:08:28-01:08:59",
    "text" : "You want to hear a funny story about people with the last name Gay? Where's this going, Greg? Well at UNH we were like we went to an away game on the soccer team and like They wouldn't get many fans but one game. I don't know where it was. They must have got a hold of like the rosters as they were walking in. Oh boy. Fifteen kids. There's a kid on my team named Pat Gay. And they just showed up and they were like, where is gay? 170 pounds of gay.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I don't this is I don't condone any of this.",
    "timestamp" : "01:09:01-01:09:03"
  },
  {
    "text" : "Uh so funny. This is just And so that this was your team.",
    "speaker" : "Greg",
    "timestamp" : "01:09:03-01:09:07"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:09:07-01:09:08",
    "text" : "I'm appalled by this."
  },
  {
    "timestamp" : "01:09:12-01:09:14",
    "speaker" : "Greg",
    "text" : "Dude, he d he didn't acknowledge it at all."
  },
  {
    "speaker" : "Andy",
    "text" : "I mean like at that point like what when you get to college, right? I'm sure you've heard all of that.",
    "timestamp" : "01:09:15-01:09:20"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:09:20-01:09:24",
    "text" : "Oh yeah. Oh yeah. Yeah. He see he thought it was funny. Yeah, oh of course, yeah."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Just a good idea. That's not good.",
    "timestamp" : "01:09:24-01:09:30"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay, Greg, that's well gay.",
    "timestamp" : "01:09:30-01:09:34"
  },
  {
    "timestamp" : "01:09:39-01:09:55",
    "speaker" : "Andy",
    "text" : "This is a shame. Well no, it's it's not as creative as the stuff Gregory would say. during his um uh I guess fandom if you will. Yeah. Remember we went to a uh Lowell Spinners game Honestly."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:10:05-01:10:08",
    "text" : "What did you say, Greg? And I'm I'm bracing myself."
  },
  {
    "speaker" : "Andy",
    "text" : "Well he tried to he tried to fight the the mascot at one point. I think that was dad's tipping point. He was heckling the mascot.",
    "timestamp" : "01:10:08-01:10:14"
  },
  {
    "speaker" : "Greg",
    "text" : "That's not bad. Once I started drinking, then it's not bad. How old were you?",
    "timestamp" : "01:10:15-01:10:19"
  },
  {
    "text" : "Greg Greg loves to start the fight and he's not one to finish the fight. I've noticed that about",
    "timestamp" : "01:10:19-01:10:27",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Shots fired there, Greg.",
    "timestamp" : "01:10:30-01:10:31",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "No, uh C C any Buffalo trip we've been on. He's got the biggest mouth in the entire group. He's got a anatom Anatomically correct size blow up of Tom Brady's dick strapped around his legs. And he's walking around Buffalo telling people Tom Brady. Tom Brady. This is an anatomically correct size of Tom Brady. Walking around Buffalo. And then people get pissed and guess who steps to the back of the line doesn't want to be a part of any of the physical altercation? It's Greg Bratt.",
    "timestamp" : "01:10:31-01:11:15",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Why is there physical altercation over there? That's just good clean fun right there. Yeah, we're just having fun, dude.",
    "speaker" : "Andy",
    "timestamp" : "01:11:15-01:11:20"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah. He's just playing off of his nickname apparently.",
    "timestamp" : "01:11:20-01:11:23"
  },
  {
    "text" : "Yeah. Yeah. I've had some I had some beers thrown at me. Like when I was up top of the camp.",
    "timestamp" : "01:11:23-01:11:29",
    "speaker" : "Greg"
  },
  {
    "text" : "Wait, what was uh Tom Brady's uh nickname again? Something Driftwood?",
    "timestamp" : "01:11:30-01:11:34",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Driftwood Tommy. Yeah.",
    "speaker" : "Connor Ireland",
    "timestamp" : "01:11:34-01:11:36"
  },
  {
    "text" : "There you go. There's proof right there.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:11:36-01:11:39"
  },
  {
    "text" : "My point being Greg is I mean, Andy, you know he's an all-time shit talker. Oh my god, yeah. It's in the blood. Then the blood Greg.",
    "timestamp" : "01:11:40-01:11:51",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "01:11:51-01:11:53",
    "text" : "I think it's a Brown family thing.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:54-01:11:59",
    "speaker" : "Connor Ireland",
    "text" : "I think you know what Greg's definitely got over Steve besides everything."
  },
  {
    "timestamp" : "01:11:59-01:12:01",
    "text" : "Um Jesus.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Uh delivery. Greg has a good delivery of his shit talk. Steve uh he's witty.",
    "timestamp" : "01:12:02-01:12:10"
  },
  {
    "timestamp" : "01:12:10-01:12:14",
    "speaker" : "Andy",
    "text" : "Steve's uh Steve's a bit too aggressive on his his delivery, I I think."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And I I also must admit to the uh to the whatever listener out there um that Greg does resemble a little tiny bit of don't do it Tom Brady. A little bit. I know. I know. What? That's the who? That's I I know. Never mind. Cut that out.",
    "timestamp" : "01:12:15-01:12:36"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "He resembles who?",
    "timestamp" : "01:12:38-01:12:39"
  },
  {
    "text" : "Uh dri Driftwood Tommy. I don't know in that department, but uh keep going, Mike.",
    "timestamp" : "01:12:40-01:12:45",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Greg Brown. He's almost there. W if we're not talking about like facial structure, right? Because I mean Tom Brady is infinitely no, Greg Brown looks nothing like Tom Brady, no.",
    "speaker" : "Connor Ireland",
    "timestamp" : "01:12:46-01:12:58"
  },
  {
    "text" : "I retract my statement and I apologize.",
    "timestamp" : "01:12:58-01:13:00",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I always said that I look like Tom Brady except I'm more athletic and I have a better looking uh wife.",
    "timestamp" : "01:13:00-01:13:07",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:13:09-01:13:11",
    "text" : "I like that. Are we gonna listen to this?"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Because that was pretty good. I just joked. I just joked. I just put my I just put my w Greg. And the better and the better looking life. Oh my god. You're out of your fucking mouth.",
    "timestamp" : "01:13:11-01:13:31"
  },
  {
    "speaker" : "Andy",
    "text" : "Shout out Kelly Brown right there. The more patient wife, that's for sure.",
    "timestamp" : "01:13:34-01:13:41"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "I'm sorry, I forgot we were on a podcast. When Greg said that I I was taking a swig out of my my water bottle and I literally joked on it.",
    "timestamp" : "01:13:42-01:13:51"
  },
  {
    "timestamp" : "01:13:51-01:14:02",
    "speaker" : "Mike Melo",
    "text" : "It's all right, it's all f it's all fair game. Oh Jesus. Uh shall we talk about the uh last big play of the uh fourth quarter to wrap this up Yeah."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yeah, I think that's I think that's what everyone wants to hear is the last big play of the fourth quarter game from uh two thousand and one.",
    "timestamp" : "01:14:02-01:14:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Well actually how about we do this? How about we do how about we do best and worse and Mike you can start with your",
    "timestamp" : "01:14:08-01:14:13"
  },
  {
    "timestamp" : "01:14:15-01:14:54",
    "speaker" : "Mike Melo",
    "text" : "I'm gonna have a the big play which is my best and then like a little best. Um so the uh the whole I wrote holy crap best right. Uh It was with uh eight minutes left. Um so it was third down the Patriots um there's a penalty for holding. And at this point they were in um they were in field goal range and instead of pushing them back and making them do it again, the Browns declined the penalties. It was fourth down. Um they they get into a uh field goal formation. It's a fifty-two yard attempt, and Uh, they hike the ball, they catch everybody off guard, Vinateri pooches it."
  },
  {
    "timestamp" : "01:14:54-01:14:58",
    "text" : "Yeah, they snapped it directly to Vinateri, which I thought was an impressive snap.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yep, I agree. I didn't even know what was going on. I had to play it back like three times. I was like, what just happened? But um uh yeah, and then it was downed by Jermaine Wiggins with like a crazy athletic play at the one. And I feel like that pretty much uh sealed the deal.",
    "timestamp" : "01:14:58-01:15:13",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "But you guys could uh Yeah, and I think um watching Jermaine Wiggins hustle forty yards downfield to to tap the ball from going into the end zone, like as he's kind of diving for it. made me realize how unathletic Jermaine Wiggins was to the point where I I would love to see him and Vince Wilfork Play one on one basketball 'cause I think Will Fork would fucking toast him.",
    "timestamp" : "01:15:12-01:15:36"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:15:37-01:15:39",
    "text" : "Go, it wouldn't even be toast."
  },
  {
    "text" : "Like I love Wiggy and he's he's a character and he's you know, he makes some big plays and you know, the snowball and such, but P And this is this was a phenomenal play, but not so much of an athlete that dude. He was he was like when we were talking before about how big these guys are, and the tight ends were just like uh actual linemen who can catch the this this it basically I was thinking of Jermaine Wiggins when I said that well I'll also say since we were talking about kickers and punters in the past",
    "speaker" : "Andy",
    "timestamp" : "01:15:41-01:16:11"
  },
  {
    "timestamp" : "01:16:12-01:16:25",
    "speaker" : "Mike Melo",
    "text" : "Um so Ken Walter this season, I guess he was averaging almost 40 yards a punt. Uh not the greatest. So they put it into Vinateri's hands. That's pretty bad."
  },
  {
    "text" : "And it was the perfect pun.",
    "timestamp" : "01:16:25-01:16:26",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:16:26-01:17:01",
    "speaker" : "Mike Melo",
    "text" : "It was awesome. Alright, so that was uh that was my best, I guess you could say. And then uh my other best of the game. was um a run up the middle by Mark Edwards, which is not a big deal. But then uh oh sorry man but I'll I'll let you take that one. I'll let you take that one. So I'll leave that alone. I'll tackle uh worst. Ooh gee So worst moment of the game, and I hate to shit on these kids, and it's probably their parents' fault. They're Patriots fans with face paint and it looked like the French flag. So I got a negative for that. A for effort, but negative execution. Sorry, A."
  },
  {
    "text" : "Yeah, that's tough. Yeah. Shit parents. Yeah, not great. Parents are probably Browns fans.",
    "timestamp" : "01:17:01-01:17:12",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:17:13-01:17:14",
    "speaker" : "Greg",
    "text" : "Like that French accent?"
  },
  {
    "timestamp" : "01:17:15-01:18:14",
    "text" : "Yeah, it was dead on, you nailed it. All right, so I'll I'll go next because Mike tried to steal my thunder. Um my best was Tom Brady's physicality. And so Mike was starting to allude to it, but there was, yeah, it was a uh Mark uh Mark Edwards fullback dive right by the end zone. And uh you know it was a bunch of pushing and shoving and somebody like one of the big defensive linemen tried to like push him and like bend him in half. And so Tom Brady came out of nowhere and just shoved this massive defensive lineman who then turned around and realized it's Tom Brady and started stomping towards him. And I I I haven't seen Brady move that quickly away from somebody, like even when he has the football. Did there was So, but there was that, but there was also the fact they they ran that reverse again that they've been running with David Patton. And Tom Brady was again the lead blocker, and he threw a legitimate lead block on this game. Did you guys catch this one?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:18:15-01:18:19",
    "text" : "Yeah, it might have been like a legal kind of, but it was It was it was a cut block.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "That was legal. You dove at the guy's legs. But I mean he he caught him and it was like it wasn't even like a defensive back, it was like a linebacker. Yeah, it was. Took the guy clean out of the play. And even I think it was Brent Jones who was commenting about how uh it's gonna suck to watch that tape because you never want to get blocked by a quarterback. So Tom Brady, and then I think uh you can tack on what Conor was saying about his his comments after the game about how he should take more hits in the pocket. So Just psycho psycho Tom Brady is my best in this game. Let's see my worst. Well, this game, I don't really have a real worst, but the this game had some commercials in it. I don't know if you guys skipped them or not, but oh I watched all of them. I had two favorites. Yeah. I I had two favorites. Um One was uh a commercial for the palm pilot. Who right? You remember the palm pilot So that was fantastic. It was just like top of the line technology and they were like 300 bucks. And I remember our mom having one of all because I think dad used to work for POM. So he he got some palm pilots for free. And mom used to love her palm pilot. Like the hype of palm pilots. Yeah, this yeah, and and that that uh that flame burnt. fast and strong and real quick.",
    "timestamp" : "01:18:19-01:19:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It was just like a it was just like a schedule calendar and Yeah, it was a digital calendar that didn't connect to the internet.",
    "timestamp" : "01:19:43-01:19:49"
  },
  {
    "timestamp" : "01:19:50-01:20:00",
    "speaker" : "Andy",
    "text" : "Yeah. Um and then the other the other commercial that I enjoyed was uh the one for Pepsi Twist. I remember drinking Pepsi Twist back then and thinking I was hot shit."
  },
  {
    "timestamp" : "01:20:00-01:20:05",
    "text" : "Yeah. I agree. Remember Surge though? Surge was the best.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:20:06-01:20:07",
    "speaker" : "Andy",
    "text" : "Yeah, that shit was cool."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah.",
    "timestamp" : "01:20:08-01:20:09"
  },
  {
    "speaker" : "Andy",
    "text" : "But yeah, because Surge they actually came to our school. And as school let out, they're just giving it away to all of us for free. Which I don't think they would probably do anymore.",
    "timestamp" : "01:20:09-01:20:17"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, what is up with that, dude? And we got pretty hooked. Yeah, of course. That was the best day. Get 'em hooked.",
    "timestamp" : "01:20:17-01:20:24"
  },
  {
    "text" : "Yep.",
    "speaker" : "Connor Ireland",
    "timestamp" : "01:20:24-01:20:25"
  },
  {
    "text" : "Same thing. Pretty weird, man. Um when I was going to school, like college, um, I would get like these pickup games. I don't know if you were there for one of these, Andy But there'd be people driving around with like um pedaling like Red Bull and giving that shit away for free. Oh really? Yeah, I'm like, what is this? Oh",
    "timestamp" : "01:20:26-01:20:43",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:20:44-01:20:50",
    "text" : "They're like Red Bull representatives at college that just give it out for free to anybody they could. Dude, this sounds suspect.",
    "speaker" : "Greg"
  },
  {
    "text" : "If somebody could do a deep dive on this.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:20:50-01:20:52"
  },
  {
    "text" : "Stats guy. All right, Greg, give us your uh your best and worst.",
    "speaker" : "Andy",
    "timestamp" : "01:20:54-01:20:59"
  },
  {
    "speaker" : "Greg",
    "text" : "All right.",
    "timestamp" : "01:20:59-01:20:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Um my best was",
    "timestamp" : "01:21:00-01:21:02"
  },
  {
    "speaker" : "Greg",
    "text" : "You've seen that uh Browns like jersey where they keep adding on all the quarterbacks.",
    "timestamp" : "01:21:02-01:21:07"
  },
  {
    "timestamp" : "01:21:08-01:21:08",
    "speaker" : "Andy",
    "text" : "Yes, yes."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:21:09-01:21:47",
    "text" : "Revisiting that whole thing and looking at all the names is the best. It's the best. Give us a quick rundown. Okay, we got uh Cooks, Kelly Holton, Jeff Garcia, Brent Dover, Charlie Flagg, Derek Anderson, Brady Quinn, Cole McCoy. Brandon Whedon, Thad Lewis, and RG3. Oh, there's some great names on there. And my worst was gonna be that I actually had a telehopan jersey, which I have no fucking clue why I had that. But I did, which is kinda kind of embarrassing."
  },
  {
    "text" : "You had a Kelly Holcomb jersey?",
    "speaker" : "Andy",
    "timestamp" : "01:21:48-01:21:50"
  },
  {
    "timestamp" : "01:21:50-01:22:17",
    "speaker" : "Greg",
    "text" : "Kelly Holcomb jersey. I feel like I'll be right back. Does that make sense? Why would I get a fucking Kelly Holk composer? Yeah, that's insane. As the podcast went on, my real worst is Connor's take. on kicking percentages. Just to look back a little bit, if you look at career 50 plus yard"
  },
  {
    "timestamp" : "01:22:19-01:22:21",
    "speaker" : "Connor Ireland",
    "text" : "Is there like instruction going on?"
  },
  {
    "text" : "Yeah, my worst is is Connor doing whatever the fuck he's doing in the background right now.",
    "timestamp" : "01:22:22-01:22:26",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:22:26-01:22:35",
    "text" : "I I had my uh fridge door had been open for too long and it was alerting me that Get out of the fridge, badass."
  },
  {
    "speaker" : "Andy",
    "text" : "It's making fuck out hot pockets over there.",
    "timestamp" : "01:22:35-01:22:37"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:22:38-01:22:46",
    "text" : "I'm making uh I'm making a chicken burrito with uh salsa verde it's green hot sauce."
  },
  {
    "speaker" : "Andy",
    "text" : "Thank God.",
    "timestamp" : "01:22:47-01:22:48"
  },
  {
    "timestamp" : "01:22:48-01:23:11",
    "speaker" : "Connor Ireland",
    "text" : "Yeah. Anyways. Congratulations, Greg, for uh for all your stats. Um I know you were too young to c I know you were too young to comprehend the games that were going on in 2001, but Adam Venateri was automatic and you never had to worry about him. I haven't been able to trust"
  },
  {
    "timestamp" : "01:23:24-01:23:25",
    "speaker" : "Greg",
    "text" : "He's gonna hit the rest of them."
  },
  {
    "timestamp" : "01:23:27-01:24:06",
    "text" : "Okay, do you do you remember the Greg, chill out do you do you do you remember and yes, you damn right it might be. Do you remember the games? When was the last time you I never worried about Adam Venateri from 2001 until whenever he left. And I bet these I bet these old farts I bet these old farts remember that too. You could always count on Adam Vineteria uh Vinateri. Steven Gustavsky has been missing bunnies. Maybe not the you know what his percentage is great his percentage is great because we score so often and we're in fucking scoring position All the time. But he's missing why is two percent better at 50 plus?",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "01:24:07-01:24:19",
    "text" : "Dude, let's be honest. All right, let's put this to rest. Let's be honest. Steven G Gaskowski was a great until that year in the playoffs against the Broncos. Where he missed that kick and he's never been the same since. All right.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "So Prime Vinatari, Prime the South Key. Who do you got? That or is it that you that you gotta go uh never thought of him",
    "timestamp" : "01:24:19-01:24:29",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "The same since.",
    "timestamp" : "01:24:29-01:24:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "No, he was not right after that game, man. I don't know. I mean look at the stats. Look at the fucking stats.",
    "timestamp" : "01:24:30-01:24:37"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:24:38-01:24:45",
    "text" : "Who do you want in um Who do you want in their prime? Answer the qu Venatari Kosowski, Prime. Who do you want?"
  },
  {
    "text" : "Either. Okay, you fucking metal.",
    "timestamp" : "01:24:46-01:24:50",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:24:50-01:25:09",
    "speaker" : "Connor Ireland",
    "text" : "Dude, that's what I'm saying. It doesn't matter. Oh my god. Would Gostowski hit the 48 would Gostowski hit the 48 yarder i in the snow? You know he wouldn't. Give me a fucking break, dude. Name one name one big name one big kick."
  },
  {
    "timestamp" : "01:25:10-01:25:13",
    "speaker" : "Andy",
    "text" : "He kicked a fifty-three yard to beat the Giants."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "In regular season. What was that? Week seventeen week seventeen?",
    "timestamp" : "01:25:13-01:25:18"
  },
  {
    "timestamp" : "01:25:19-01:25:21",
    "text" : "Exactly. Come on.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, you you do know. He knows.",
    "speaker" : "Connor Ireland",
    "timestamp" : "01:25:21-01:25:23"
  },
  {
    "timestamp" : "01:25:23-01:25:25",
    "speaker" : "Mike Melo",
    "text" : "And I remember that game exactly."
  },
  {
    "text" : "Of course, everyone does. We had that.",
    "speaker" : "Connor Ireland",
    "timestamp" : "01:25:25-01:25:27"
  },
  {
    "speaker" : "Andy",
    "text" : "All the field goals he kicked in the uh the last Super Bowl that he won.",
    "timestamp" : "01:25:28-01:25:31"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:25:31-01:25:38",
    "text" : "Rand Randy had that Long touchdown. Everyone remembers week seventeen and how it didn't fucking matter."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:25:38-01:25:40",
    "text" : "No, not not that game."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:25:40-01:25:49",
    "text" : "Well, I remember the other game that you might be alluding to with OBJ. Yes, that's the one. Oh, who oh it can't his big kick can't can't be in the regular season, man."
  },
  {
    "timestamp" : "01:25:49-01:25:56",
    "speaker" : "Andy",
    "text" : "There's a big kick 53 yard game winner Dude, give me a break. We're talking about who's the better kicker."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:25:56-01:26:04",
    "text" : "I believe it's uh the one that uh Belichick recently said, what's it what's his face? Um from the the Ravens, I believe."
  },
  {
    "text" : "Justin Tucker. Justin Justin Tucker. Yeah.",
    "timestamp" : "01:26:04-01:26:08",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "01:26:09-01:26:13",
    "speaker" : "Mike Melo",
    "text" : "I would say something else. Yeah. Um Connor, what's your best and worst, man?"
  },
  {
    "timestamp" : "01:26:14-01:27:33",
    "speaker" : "Connor Ireland",
    "text" : "All right, so it's limited, but I have two best. Um and it hasn't been talked about, but talk about Mr. Reliable Antoine. I you guys have talked about him in the past. What do you have? Two CDs this game, uh very pedestrian like Maybe seventy, eighty yards rushing. But he had a fucking nose for the end zone. I think he had two rushing TVs in this game. Uh my second seventy-six yards, yeah. My second best. Yeah. Barry Antoine Smith game. Uh My second best, like I already mentioned, was that fucking massive lawyer Malloy uh block to free Troy Brown on the front return Um still it just you don't see your s your best defenders out on punter terms like you did in like the early two thousands and stuff. Uh That that kind of stood out to me. Tom Brady just being a completely different person than that, like 2001 obviously his first year, but like those early years he was just completely different. And my worst might have been two Tom Brady plays. I think this is probably his worst game since he became starter Uh oh no."
  },
  {
    "timestamp" : "01:27:33-01:27:34",
    "speaker" : "Greg",
    "text" : "Yeah, there's one worse."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:27:35-01:27:37",
    "text" : "Yeah, Broncos game was an absolute nightmare."
  },
  {
    "speaker" : "Greg",
    "text" : "It's actually kind of typical this year.",
    "timestamp" : "01:27:37-01:27:40"
  },
  {
    "timestamp" : "01:27:40-01:27:42",
    "text" : "Yeah. Yeah this is yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:27:42-01:28:06",
    "speaker" : "Connor Ireland",
    "text" : "So would would you say that uh no, the two picks and the I think he lost the fumbles The i i I think he had games where he didn't score touchdowns but he drove him down the field and Antoine Smith or like a draw to Kevin Falk or some shit happened, but Uh what he ha I think he was responsible for three turnovers in this game. So it was one of his worst games."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:28:06-01:28:13",
    "text" : "Maybe not his worst, but I think it might be his second worst up to this point. We had one where it was a four pick game, maybe a couple of fumbles. Pretty rough."
  },
  {
    "timestamp" : "01:28:14-01:28:16",
    "speaker" : "Connor Ireland",
    "text" : "Yeah. Yeah, that's bad."
  },
  {
    "timestamp" : "01:28:16-01:28:51",
    "text" : "Um I will uh I will say this guys cause we didn't bring it up, but I thought it was very cool stat. Sorry, Greg. um jumping in your territory here. But uh I know. They were talking about um most consecutive games in a row um with 70% completion percentage or oh yeah. And they put up a, you know, a graphic and Joe Montana had eight games in a row. Um, Sammy Baugh had four, Steve Young had four, Troy Aikman had four, and Brady coming into this game had four in a row as well. Yeah. So that's pretty cool.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Two thousand one Tom Brady sure was prolific, huh?",
    "timestamp" : "01:28:53-01:28:56",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "01:28:57-01:29:36",
    "text" : "Yeah, right. And then um for the time, I guess so. I'll also say we didn't bring up Aaron Shea, um, because I mean he got hurt in the game anyway. But uh Aaron Shea was Brady's teammate at Michigan. They became very good friends And I don't know if you guys know this, but um this always stuck in my mind. He always saw greatness in Tom Brady because he was a hard worker and he was humble, and he knows he's humble. Because he wants to ask Brady, what would you do if you became famous and you had millions of dollars? And Brady said, I would buy a new pair of socks every day because I like how they feel.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "So when we have Tom Brady on this podcast, we're gonna ask him the first question we're gonna ask him is do you buy a new pair of socks every day?",
    "speaker" : "Andy",
    "timestamp" : "01:29:40-01:29:47"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, I I think that's a pretty good question.",
    "timestamp" : "01:29:48-01:29:50"
  },
  {
    "speaker" : "Andy",
    "text" : "That's definitely a baller move. I know he's like that's real to wash your own socks.",
    "timestamp" : "01:29:52-01:29:55"
  },
  {
    "timestamp" : "01:29:56-01:30:00",
    "speaker" : "Mike Melo",
    "text" : "Dude, exactly. He's like, oh it's real fucking humble. That's all he wants? Dude, that's a pretty big ask."
  },
  {
    "text" : "And then I mean it it definitely loses its novelty after what, like sixty times? Like a week.",
    "timestamp" : "01:30:01-01:30:07",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Maybe two weeks.",
    "timestamp" : "01:30:09-01:30:10"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:30:10-01:30:16",
    "text" : "Yeah, it's it's also because they're new, you know, and it's So that's a poor take from Tom."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and they still like the first couple of times you're wearing they still feel new, you know?",
    "timestamp" : "01:30:17-01:30:22"
  },
  {
    "timestamp" : "01:30:22-01:30:31",
    "speaker" : "Connor Ireland",
    "text" : "Yeah. And pre hair pre hair plugs, Tom He uh he had I I think he just had a different mindset."
  },
  {
    "text" : "See, I uh I'm glad he brought that up. I mean we could definitely uh that that'll be a nice teaser for future episodes because uh Um I've uh brought up and we've debated um when everybody uh sold their soul. So is it hairplugs or was it a deal with the devil?",
    "speaker" : "Mike Melo",
    "timestamp" : "01:30:32-01:30:47"
  },
  {
    "speaker" : "Greg",
    "text" : "What do you think is hairplugs?",
    "timestamp" : "01:30:48-01:30:49"
  },
  {
    "text" : "Oh for sure, dude. Come on.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:30:50-01:30:51"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "It was it was like two thousand and four or five he got hair plugs, yeah, and as they started to grow in.",
    "timestamp" : "01:30:52-01:30:59"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I would do it too, and I might have already. Thank you very much.",
    "timestamp" : "01:31:00-01:31:03"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:31:03-01:31:17",
    "text" : "Long long hair to long hair Tom Brady were some of my favorite years, and you know he was only wearing the long hair because he was just so happy. to just even be able to grow long hair after the hair plugs."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:31:19-01:31:24",
    "text" : "Alright, now he's dyeing his hair. Look, it's fine. Alright? He's a beautiful man."
  },
  {
    "text" : "Can do what he wants. He's earned it. Yes, I I think that's that's plenty. I can't believe I'm calling it. What is happening? I just can't believe we've talked as much about a random Browns game that I didn't even remember happened. I'm sure none of you remember happened, if we're being honest.",
    "timestamp" : "01:31:24-01:31:42",
    "speaker" : "Andy"
  },
  {
    "text" : "Um I do remember this game actually, but son of a bitch. Um but Uh Connor, if if you're ever back again, I mean this noise that you're making is fucking amateur hour, but you you've been good otherwise. Um Uh I hear you have a deep dive on, I believe, Roman Pfeiffer, so that could be uh a teaser for another time. Yes, I agree.",
    "timestamp" : "01:31:43-01:32:07",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yeah, we're we're not gonna get into that tonight. No.",
    "timestamp" : "01:32:08-01:32:11"
  },
  {
    "timestamp" : "01:32:13-01:32:18",
    "speaker" : "Andy",
    "text" : "We're two hours in at this point. I'm gonna have to cut half of this shit out anyway."
  },
  {
    "timestamp" : "01:32:18-01:32:30",
    "speaker" : "Mike Melo",
    "text" : "That's what you said, and then you said you released a two-hour episode. I haven't been paying attention, but yeah, I hear there's a two-hour one out there. Hour and forty-five, yes. I don't know. It came up as 115 on my end, bro."
  },
  {
    "text" : "Yeah. And let me come back. I'll I won't talk as much. That's my promise. I didn't know what to do. It was like uh I had so much to say. I promise you I will have nothing to say next week. I literally used all my cakes. I I use all my like I'm done.",
    "timestamp" : "01:32:31-01:32:49",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "That that was all your knowledge. That was it. Got it. All right. Well, until then, uh next week, the Patriots travel to Ralph Wilson Stadium of Greg Brown, Dick Fame, and uh go up against Buffalo Bills. So we'll see how that turns out. So hopefully if you've laughed this long, you'll join us next week and we will talk to you then. See you later, everybody. Bye-bye.",
    "timestamp" : "01:32:50-01:33:12"
  }
]