[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid. You still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:19",
    "speaker" : "Mom"
  },
  {
    "text" : "Alright, let's let's kick this off. Welcome to the Patriots Dynasty Podcast. This is episode five, I think, right? 2001 season.",
    "timestamp" : "00:25-00:36",
    "speaker" : "Andy"
  },
  {
    "text" : "recorded a few test runs, so I don't know you're the boss.",
    "timestamp" : "00:40-00:44",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, no, I'm I'm completely lost as well, and who knows how this is gonna actually end up, but uh Yeah, we'll call it for now tentatively. We'll pencil in it as episode five. Love it. Um and obviously with me again today is Mr. Mello. Mike, how are you doing? Um I'm doing pretty well.",
    "timestamp" : "00:44-01:04"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "How are you doing?",
    "timestamp" : "01:04-01:04"
  },
  {
    "text" : "Good. Oh, I'm living the dream, as always. I'm sitting here in my bedroom talking to you about the 2001 Patriots season.",
    "timestamp" : "01:05-01:12",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Fully glowed this time.",
    "timestamp" : "01:13-01:15"
  },
  {
    "timestamp" : "01:15-01:16",
    "text" : "For the most part, yes.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's beautiful.",
    "timestamp" : "01:16-01:17"
  },
  {
    "speaker" : "Andy",
    "text" : "I even got socks on today. It's cold here because it's officially winter in New England and it is 27 degrees at the moment.",
    "timestamp" : "01:17-01:25"
  },
  {
    "text" : "Ooh, I was gonna say I think it's probably like fifty-eight out.",
    "timestamp" : "01:25-01:29",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:29-01:32",
    "text" : "Oh, so you're probably as bundled up as I am, I'd imagine.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:33-01:35",
    "text" : "Um, you know, I've got a nice button up for something.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:36-01:43",
    "speaker" : "Andy",
    "text" : "You got the heat on? I don't actually know. Well you have the the the wildfires that are probably keeping you warm."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "They are. Love them.",
    "timestamp" : "01:43-01:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "01:45-01:45"
  },
  {
    "timestamp" : "01:45-01:57",
    "speaker" : "Mike Melo",
    "text" : "Nice. Just kidding. Just kidding. God damn it, you're already getting me in trouble. Um but yeah, no, things are fantastic, man. I was thinking about it and I don't say it enough, but it is a pleasure to be here with you."
  },
  {
    "text" : "Yeah, I look forward to doing these every week. Um but yeah it is just the two of us again. The brothers are off gallivanting as always. So I prefer frolicking. You can prefer whatever you'd like. Thank you.",
    "timestamp" : "01:58-02:12",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Hey Greg never uh he still never responded to my birthday wish from last week. So No?",
    "timestamp" : "02:12-02:17"
  },
  {
    "text" : "Oh well next time he's on we'll have to give him a bunch of shit for that. Yeah, I'm a little annoyed. All right, so speaking of annoying, coming into town this week, week five of the 2001 season, where the at the time San Diego Chargers, which they no longer are. Rest in peace.",
    "speaker" : "Andy",
    "timestamp" : "02:17-02:35"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "They could be the uh London Chargers at some point.",
    "timestamp" : "02:35-02:38"
  },
  {
    "text" : "That's true, yeah. Theoretically Yeah. Who who do you think, like just a quick sidebar, what top top three possibilities are to move to London? Well the franchises.",
    "speaker" : "Andy",
    "timestamp" : "02:38-02:51"
  },
  {
    "text" : "I've given this uh no thought whatsoever. So Yeah, me neither.",
    "speaker" : "Mike Melo",
    "timestamp" : "02:51-02:55"
  },
  {
    "timestamp" : "02:55-02:56",
    "speaker" : "Andy",
    "text" : "I just came up with this right."
  },
  {
    "text" : "So don't take anything I say uh as anything other than what I'm saying.",
    "speaker" : "Mike Melo",
    "timestamp" : "02:57-03:02"
  },
  {
    "speaker" : "Andy",
    "text" : "But it's gospel. It's it's on recording, so it's gospel now. We're gonna hold this.",
    "timestamp" : "03:01-03:05"
  },
  {
    "timestamp" : "03:06-03:23",
    "text" : "Well, I think I was thinking about this a lot recently, not about the London thing, but just in general. Okay. We have multiple teams in California. Fine, whatever. True. We have multiple teams in New York. We have multiple teams in Florida. That all makes sense. Texas. Why why Ohio? Huh.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Isn't that the isn't that kind of the birthplace foot? Isn't um the Hall of Fame in Ohio too? Yeah, but do you need two two teams in that area? I mean do you need one team in that area? Well that's what I'm saying. So ship them both. I mean, yeah. I like it. So so you you're gonna you're gonna move the Browns again. Yes. And you're gonna move the Bengals.",
    "timestamp" : "03:25-03:47"
  },
  {
    "timestamp" : "03:47-03:47",
    "speaker" : "Mike Melo",
    "text" : "Yes."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:48-03:51",
    "text" : "Which one goes to which one goes to England and which one goes to I'll say Portugal."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "03:53-03:58",
    "text" : "Yeah, that's right. I I I was gonna say China, isn't that like isn't that the plant?"
  },
  {
    "text" : "I think that's problematic, but yeah, all right. I'm sure they pay for teams. Yeah, that too, and freedom and such.",
    "timestamp" : "03:58-04:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh yeah, that whole thing. Um yeah, no, I think uh I feel like the uh I feel like London deserves the Browns. You know, they uh Yeah they could use a little bit of drama, but nothing too happy, nothing too um exciting, you know.",
    "timestamp" : "04:05-04:24"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I mean this is a country where it rains eighty percent of the time, so they do enjoy themselves some misery. Yeah, yeah. Um this is also a country that invented the game of soccer and hasn't won the World Cup since nineteen sixty-six. So I think the Browns would be a fitting franchise for them. But the Bengals aren't much better. I mean they've never won as much as well.",
    "timestamp" : "04:24-04:43"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. Well, I was going to say 'em if we ship 'em to Portugal, let's say, as you uh as you said, my uh my people from from the same mother. Um my other mother, I don't know what I'm trying to say. Whatever I'm trying to say is the Bengals would be perfect for the Portuguese because guess what? The Portuguese Don't watch football. They don't give a damn. And it would be perfect for the Bengals.",
    "timestamp" : "04:43-05:08"
  },
  {
    "speaker" : "Andy",
    "text" : "It would, yeah. Yeah, they not not much would change.",
    "timestamp" : "05:08-05:13"
  },
  {
    "timestamp" : "05:13-05:17",
    "speaker" : "Mike Melo",
    "text" : "Yeah. So I mean wa you y are you're on board? You have any thoughts on this?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, well I mean my initial thought was um force Dan Snyder to to sell the the Redskins and then just change them to the London the Washington Redcoats. Right. Okay. It still works out. I like that. And then just ship them over. Problem solved. And you probably have to change the logo slightly. But I think you could just you could just make the guy on the helmet paler. Okay. And it it would probably still work. So yeah, give them a little top hat or something. I don't know.",
    "timestamp" : "05:17-05:46"
  },
  {
    "timestamp" : "05:47-05:55",
    "speaker" : "Mike Melo",
    "text" : "Though these are not bad ideas. If somebody uh could get on this and tweet um whoever needs to be tweeted. It would be great."
  },
  {
    "text" : "Yeah, if if somebody can get in contact with Roger Goodell, um our our DMs are always open. He can uh hit us up and we'll we'll sell him these ideas for uh small money.",
    "timestamp" : "05:55-06:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "06:06-06:14",
    "speaker" : "Mike Melo",
    "text" : "Yeah, and I don't know if you know, but he's uh currently uh meeting with Antonio Brown, I believe. Oh, that was today, yes."
  },
  {
    "timestamp" : "06:14-06:16",
    "speaker" : "Andy",
    "text" : "Yeah, I can't wait to see what comes out of that."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah. So for all of you listening to this in the future, and this is old news, and I still haven't heard what happened to Antonio Brown, please let me know. Yeah.",
    "timestamp" : "06:17-06:27"
  },
  {
    "timestamp" : "06:27-06:39",
    "text" : "Please tweet at Mike Mello. Do you even have Twitter? I don't know. No, I guess. Although I my guess is your Twitter handle will be uh leave me low.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "06:41-06:44",
    "text" : "What was your That was uh yeah, I was going through stuff."
  },
  {
    "timestamp" : "06:45-06:54",
    "speaker" : "Andy",
    "text" : "But it was Milo in the middle, but it was Leave Me Lone. Right. Which I thought was super clever. Yeah, no, I'm I'm a big fan of wordplay and I was I was always I was impressed with that one."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "You know, but I those are darker times and we're here we're talking football. Yeah.",
    "timestamp" : "06:54-06:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Life couldn't be better. Sunny, you know, it's warm, at least in my imagination. Right. At least inside this conversation, it's beautiful. It is. You know what else is beautiful? Well what else is beautiful? The New England Patriots. Yes. Well let's yeah, let's talk about these charges. Speaking of warm.",
    "timestamp" : "06:59-07:18"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Alright, fine.",
    "timestamp" : "07:18-07:19"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:19-08:12",
    "text" : "So this was I thought an interesting group of of players in in general. The head coach was Mike Riley, who I had never heard of, still never heard of. I mean it's not a name that I remembered. I don't know about you. I d uh not really. Doesn't really well. Not even a little bit. I saw a picture of him. Like I looked him up and everything. Not not a fucking clue. I think he may have coached at Nebraska because he's wearing Nebraska stuff even on his like football like NFL like profile, but good for him. Apparently only coaching NFL for three years. all with the um the chargers from ninety nine to two thousand one. He went eight and eight the first year, one and fifteen the second year, and then five and eleven, and he was never invited back. At least they had coaches in the NFL."
  },
  {
    "timestamp" : "08:13-08:15",
    "speaker" : "Mike Melo",
    "text" : "Chargers haven't done much better since."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:15-08:36",
    "text" : "I mean they had a couple of good runs, but Yeah, they have, but every time they have a good run they fire their coach, so I mean those thoughts the Marty Schottenheimier where didn't they go like fourteen and two when you still got fired? Whatever the hell it was. Because I think the Patriots had something to do with that."
  },
  {
    "text" : "I think so as well.",
    "timestamp" : "08:36-08:37",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "08:38-09:47",
    "speaker" : "Andy",
    "text" : "Yeah, but this uh this Chargers team led by the well-renowned Mike Riley uh actually started the season 3-0 um before losing their game before this one to the Browns, I think it was. So three and one coming into this game and actually started the season five and two and ended it five and eleven. So uh I'm not quite sure what happened because you know I'm I'm not a Chargers fan, thank God. But like that's just the wheels falling the fuck off. That that's very Buffalo Bills esque it felt. Right. Which uh made sense because there are some ties here to the Buffalo Bills. I think the biggest tie would be their starting quarterback, Doug Flutie. Doug Wheelie's box fluity, yeah. Of um and if you if you didn't know before watching this game, the announcers would beat it over the fucking head for you that he is from uh Massachusetts. No played at BC. Get the fuck out of here. Right. Did you know that? Did did you know that after the game?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I I I did, yeah.",
    "timestamp" : "09:47-09:50"
  },
  {
    "timestamp" : "09:50-10:04",
    "text" : "Oh, it was nauseating. It was it was the 2001 version of uh Did You Know Um this tight end played basketball in college sort of thing, you know? Did you know Patrick Mahomes used to play shortstop?",
    "speaker" : "Andy"
  },
  {
    "text" : "Well it's funny that you bring him up because I was actually thinking correct me if I'm wrong is f is Flutie the original Patrick Mahomes?",
    "speaker" : "Mike Melo",
    "timestamp" : "10:04-10:12"
  },
  {
    "text" : "Ooh. Okay. Because he's Because he has an arm. I mean Bill Mary, all that. They have I mean they have had mobile quarterbacks before him because we've got Randall Randall Cunningham and Warren Moon and that lot and Steve Young. Yeah. Um so maybe Steve Young may have been the first Patrick Mahomes. Are you saying that 'cause uh Fluty's short? I'm saying that 'cause they're all short, yeah. They're all short and mobile. Is Steve Young short? He's not that big, I don't I mean he uh he's not uh Doug Flutie short. Doug Flutie's five's nine.",
    "timestamp" : "10:14-10:52",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "10:52-10:59",
    "speaker" : "Mike Melo",
    "text" : "Yeah, and that's what I'm getting at. That's why he couldn't be Patrick Mahomes. Way to go, man. How tall is Patrick Mahomes?"
  },
  {
    "timestamp" : "10:59-11:08",
    "speaker" : "Andy",
    "text" : "I have no idea. Steve Young is six two. See? He's taller than I am. So yeah, he's he's my height, which Wow. Okay."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I just said taller than I am. You have to trump me by stating your height. Wonderful.",
    "timestamp" : "11:09-11:14"
  },
  {
    "speaker" : "Andy",
    "text" : "Sorry. Well, I mean you're not exactly I mean what are you, six feet? Yeah.",
    "timestamp" : "11:14-11:18"
  },
  {
    "timestamp" : "11:18-11:20",
    "speaker" : "Mike Melo",
    "text" : "Well I think I'm like a quarter of an inch off."
  },
  {
    "timestamp" : "11:20-11:27",
    "speaker" : "Andy",
    "text" : "Whatever. We'll call it six feet. I don't mind rounding up. I'm like six one and seven eighths, so six two and you're six feet."
  },
  {
    "timestamp" : "11:28-11:28",
    "speaker" : "Mike Melo",
    "text" : "All right."
  },
  {
    "speaker" : "Andy",
    "text" : "Patrick, what do you think how tall do you think Patrick Mahomes is comparatively? I don't know.",
    "timestamp" : "11:28-11:32"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "He seems tall and lanky, so I gotta think he's like I wanna say well I think he's probably like six feet. He's 6'3. Damn.",
    "timestamp" : "11:32-11:42"
  },
  {
    "text" : "Right? See that guy was built for this. I guess so. What about and Tom Brady's actually 6'4. So he's actually about Tom Brady's size, which I always felt like he was much shorter. Interesting. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "11:42-11:57"
  },
  {
    "timestamp" : "11:57-12:20",
    "speaker" : "Mike Melo",
    "text" : "But uh yeah, Flutie, I don't know. I mean, I say that because he had a rocket arm, he was uh, you know, he was pretty good at scrambling, running a lab. I mean I guess he didn't do the crossbody stuff. I don't really know who does that other than maybe Favre. But yeah. But you know, I'm saying it right here. Doug Footy, the original Patrick Mahomes. Yeah, no, I think there's a lot of structure."
  },
  {
    "speaker" : "Andy",
    "text" : "Right, yeah, and I think he was a bit before his time for this.",
    "timestamp" : "12:21-12:23"
  },
  {
    "text" : "I agree.",
    "speaker" : "Mike Melo",
    "timestamp" : "12:24-12:25"
  },
  {
    "timestamp" : "12:25-12:41",
    "text" : "But he did um He did have a good year this year, even though they went five and eleven. Uh because the whole controversy, like that's why I was bringing up the Bills, was that the Bills had Doug Flutie and Uh uh whoever they went with. Was it Todd Collins maybe?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "12:41-12:45",
    "speaker" : "Mike Melo",
    "text" : "Wait, where? The Bills? Was it uh Rob Johnson?"
  },
  {
    "timestamp" : "12:45-13:22",
    "speaker" : "Andy",
    "text" : "That's who it was, yeah. And it was one of those I don't even know. I don't even know what to call him anymore, but just the the plethora of um fucking awful Bills quarterbacks. But yeah, it was Rob Johnson. So so they had both of those in the prior year. They were like switching back and forth between them. And um let's see, I have it here. Uh Rob Johnson started 11 games, went four and seven. Doug Flutie started five games and went four and one."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "13:23-13:40",
    "text" : "Well and it's funny because uh Tom Donah Donahue, I think, was the uh the Bills GM at that time. And he said that they decided to get because for salary salary cap reasons they couldn't keep both of them or whatever. Right. So they picked Rob Johnson because he is more talented. That is a quote. Yeah."
  },
  {
    "timestamp" : "13:41-13:52",
    "speaker" : "Andy",
    "text" : "No, it's it's a hundred percent correct. And uh yeah, because they they basically I think Rob Johnson struggled, so they ended up putting flute in at the end of the year and he won as many games as Rob Johnson did in half as many starts."
  },
  {
    "text" : "Right.",
    "timestamp" : "13:53-13:53",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:53-14:40",
    "text" : "Because that's kind of what Flutie did. It was never particularly pretty, but he always found a way to do it and had that like fourth quarter magic that the commentators in this game are gushing all over him. But they yeah, because there was even a thing in the Boston Globe talking about how uh basically the Bills had made the wrong choice sticking with Rob Johnson because he went In 2001, because yeah the the w t uh chargers who were one fifteen the year before got uh flutey and started off the season five and two and Rob Johnson on the other hand started the season one and seven Before he was benched for Alex Van Pelt of all people."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh nice. Yeah, everyone was uh fantastic.",
    "timestamp" : "14:40-14:43"
  },
  {
    "text" : "Yeah, and he finished he finished season two and six, so he was one game better than Rob Johnson, who they paid a bunch of money for.",
    "speaker" : "Andy",
    "timestamp" : "14:43-14:49"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "He is more talented.",
    "timestamp" : "14:50-14:51"
  },
  {
    "timestamp" : "14:52-15:17",
    "text" : "Apparently, just barely. Yeah, so Flutie has like the age thing though. I mean, yeah, I think Flutie was getting up in age at that point. Um Rob Johnson was 28 in 2001. And let's see how old Flutie was. He was probably significantly older. He was thirty-nine.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:17-15:28",
    "text" : "So which is a hundred and the GM could have just basically said, you know, it's an age thing and we're trying to groom Rob Johnson, but instead he went with the talent uh",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah. And that that came to back to bite him a little bit. Um but yeah, so Flutie had a decent year. He threw for almost thirty five hundred yards, fifteen touchdowns, but he also threw eighteen picks. So kind of up and down, which I think we saw a little bit of in this game. He was he was actually pretty good in this game, but not as effective in the red zone.",
    "timestamp" : "15:28-15:51",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:51-15:58",
    "speaker" : "Mike Melo",
    "text" : "Uh he also finished with he's twelve and one all time um before this game at Foxborough."
  },
  {
    "text" : "That's true, yeah, but most of those games were f for while playing for BC. But he had already done a stint with the Patriots before this. Right. Which was interesting. Because I remember when he came back when he was like in his forties.",
    "speaker" : "Andy",
    "timestamp" : "15:58-16:15"
  },
  {
    "text" : "Hell yeah. Yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "16:16-16:17"
  },
  {
    "text" : "And he had the drop kick for the extra point.",
    "timestamp" : "16:17-16:21",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "16:21-16:22",
    "text" : "Exactly.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "But I didn't realize he kind of Yeah, he started in Chicago back in the eighties, came to New England for a couple years, didn't really play much. No, he started a few games actually. In eighty eight he actually started nine games and went six and three. Yep. But they didn't stick with him. Then he went to Buffalo and then San Diego and then back to New England for that one year.",
    "timestamp" : "16:22-16:44"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "16:44-16:59",
    "text" : "Well and um I mean Belichick had a lot of respect for him because uh I mean I I'm At the end of the game, he sought him out, gave him a hug. Again, that was before he sold his soul, which we established was circa two thousand four. Right. Right, right, right."
  },
  {
    "text" : "Well did you catch when uh and this jumping ahead a little bit, but when Brady threw his last touchdown right at the end. He they they showed a shot of him celebrating and his face like no smile, nothing. He just threw his hands up in the touchdown celebration. Yeah. That was it. And then he was done. Yeah. Uh it's good. Yeah, but um the one other thing that they didn't actually mention at all in this game. But uh I found when I was doing research on the Chargers was um the backup to Doug Flutie and was sitting on the bench was uh a rookie Drew Brees.",
    "speaker" : "Andy",
    "timestamp" : "16:59-17:37"
  },
  {
    "timestamp" : "17:37-17:38",
    "speaker" : "Mike Melo",
    "text" : "That's right."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, who didn't see the game at all. Um and would I think he I think from what I remember Drew Brees actually kind of struggled a bit at San Diego.",
    "timestamp" : "17:38-17:49"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "17:49-17:49"
  },
  {
    "text" : "Bef and then he he got hurt and then He did, yeah. And then they moved on and we all know what happened. I will say though, uh one of my notes about Doug Flutie was I haven't seen anybody put as much effort into throwing a football since Drew Brees as Doug Flutie. He puts 120% effort in throwing that football. It looks like he's gonna like tear his top half of his body off his bottom half.",
    "timestamp" : "17:50-18:16",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:16-18:18",
    "text" : "Yeah, he does zip him in there though.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Oh, he does. But even like any sort of it doesn't matter what it is, he's just he's just slinging it. It's amazing. So what you're saying is he's not the original Patrick Mahomes. He's he is uh he is the the top of the the family tree, you know, if if you're to do like almost like a coaching tree but with quarterbacks. He's the top and coming off of him one side is Patrick Mahomes and the other side is Drew Brees. Wow. So it all starts with Flutie. I love it. It does, yeah. That that is the beginning of both of those guys' careers. Doug Flutie behaved that way.",
    "timestamp" : "18:18-18:54",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:55-19:00",
    "speaker" : "Mike Melo",
    "text" : "But he threw a uh a Hail Mary pass at um Boston College."
  },
  {
    "text" : "It was complete. Yeah, to to beat like uh like undefeated Miami team or something like that, right? That's right. The the number one ranked team at the time.",
    "timestamp" : "19:03-19:13",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, I don't know who it was. Yeah. I just uh remember the uh celebration videos.",
    "timestamp" : "19:13-19:18"
  },
  {
    "timestamp" : "19:18-19:47",
    "text" : "Oh yeah, absolutely where he's wearing the uh cutoff shirt. Yeah, hell yeah, the cutoff, yeah. Yeah. Oh god. Um speaking of rookies on this Chargers team, uh their running back. You may have heard of them, Ladanian Tomlinson. This was his rookie season. Hell of a rookie season, might not. Yeah, yeah, he ran for twelve hundred yards and ten touchdowns this year. And at this point in the season was actually the leading rusher going into this game.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well and that was insane too because they were pointing out that at this point, week five, you had seven touchdowns, and the previous year the Targers had seven rushing touchdowns. Total.",
    "timestamp" : "19:47-19:57"
  },
  {
    "timestamp" : "19:57-19:59",
    "speaker" : "Andy",
    "text" : "Yeah, and he already had it in week five."
  },
  {
    "timestamp" : "19:59-20:06",
    "text" : "Yeah, it was a pretty big uh upgrade. Although now that we talk about it though, week five you had seven touchdowns. He finished the year with ten touchdowns.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so Um I I my guess is that either teams figured him out or they just figured that offense out because I mean they stopped winning games. So my guess is they got behind and had to just start chucking the ball and got away from actually running it. Because even this game they they tried to stick with the run, but LT finished 24 carries, 74 yards. So it's not great. I mean he had a touchdown, but as long as Ron was 14, it's not like he was blowing things up in this game. He I mean he looked good and he had some pretty strong runs. Yeah. But the pages actually kept him surprisingly bottled up. for how much the uh the commentators were talking him up. I thought it was gonna be a bigger deal.",
    "timestamp" : "20:06-20:49"
  },
  {
    "text" : "He also made me think of you because um correct me if I'm wrong, but wasn't he one of your favorite players of all time?",
    "timestamp" : "20:50-20:56",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:56-21:09",
    "text" : "No, no, it was exactly the opposite. I've hated him ever since he came out. No. Yeah."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "You want to admit it to the public?",
    "timestamp" : "21:10-21:11"
  },
  {
    "text" : "I don't I don't I don't buy non patriot actually I well I do buy non-patriot jerseys, but they're of um usually failures. My favorite is uh Maurice Clorette jersey. Oh, that's a sore subject. Hey. It was a cheap jersey, I'll tell you that. I got it for like 15 bucks. Like whatever that Marshall's is in Lawrence.",
    "speaker" : "Andy",
    "timestamp" : "21:11-21:33"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh yeah.",
    "timestamp" : "21:33-21:34"
  },
  {
    "speaker" : "Andy",
    "text" : "That sells like yeah, all the the jerseys with like I've got a couple of ones. I think I have one that's like Tim Couch.",
    "timestamp" : "21:34-21:40"
  },
  {
    "text" : "I've got one that uh Are they like legit though or are they like slightly wonky?",
    "speaker" : "Mike Melo",
    "timestamp" : "21:40-21:45"
  },
  {
    "timestamp" : "21:46-21:54",
    "text" : "No, uh well these ones are actually pretty legit. I have one that's um I can't remember who it was. Some Bill's receiver, but the the name was put on upside down.",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh yeah, yeah. I had a Dave Meggett where the numbers were off center by quite a bit.",
    "speaker" : "Mike Melo",
    "timestamp" : "21:55-21:59"
  },
  {
    "text" : "Yeah, so we probably shopped at the same place then.",
    "timestamp" : "22:00-22:02",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "22:02-22:03",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "22:03-22:08",
    "speaker" : "Andy",
    "text" : "Yeah. And I had uh who was the uh the Raiders quarterback? Aaron Aaron Brooks was it?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh Aaron Brooks, yeah.",
    "timestamp" : "22:08-22:09"
  },
  {
    "timestamp" : "22:10-22:17",
    "text" : "Yeah, so I got one of those. So I was giving those away as uh Christmas gifts back in college. So I don't actually have them anymore, but they're out there.",
    "speaker" : "Andy"
  },
  {
    "text" : "Well, all right. If you don't want to admit to being the hugest, not hugest, but top five. biggest fans of Latin and then we can move on. But I not I think I don't know.",
    "speaker" : "Mike Melo",
    "timestamp" : "22:17-22:29"
  },
  {
    "text" : "I think I I think you may be confusing me with one of my brothers.",
    "timestamp" : "22:29-22:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "So we'll have to ask them when they give it a lot of I don't know I'm going we're going on the record That you're a Libanian fan, the biggest. Alright.",
    "timestamp" : "22:32-22:39"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "22:39-22:40",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "22:40-22:47",
    "text" : "Oladin Stan, if you will. Yeah. Oh boy. No, he sucks."
  },
  {
    "speaker" : "Andy",
    "text" : "Um he's having Patriots.",
    "timestamp" : "22:47-22:50"
  },
  {
    "timestamp" : "22:51-23:05",
    "speaker" : "Mike Melo",
    "text" : "Well yeah, he wasn't such a blowhart. Actually he wasn't even Blower heartache and anything. He was uh he was a kind of a pansy and he whined a lot. But anyways he has up and dead him and Marshall Falk. They hate the Patriots of the patch and I'm sick of it. Oh they do."
  },
  {
    "timestamp" : "23:05-23:08",
    "speaker" : "Andy",
    "text" : "And um Mark Brunell of all people."
  },
  {
    "timestamp" : "23:08-23:11",
    "speaker" : "Mike Melo",
    "text" : "And Mark Brunel. Yeah, he was crying over Deflate Gate. I don't know if you remember that."
  },
  {
    "text" : "Legitimately crying on television. Come on. Some people. Jerry Rice.",
    "timestamp" : "23:12-23:17",
    "speaker" : "Andy"
  },
  {
    "text" : "He was mad because he lost the AFC Championship against them.",
    "speaker" : "Mike Melo",
    "timestamp" : "23:17-23:19"
  },
  {
    "text" : "Yep.",
    "timestamp" : "23:20-23:20",
    "speaker" : "Andy"
  },
  {
    "text" : "Yep. Jerry Rice, yeah. Mr. Stick'em, love the guy, but he admits to to cheating himself. Which I would say. Deflated or not, intentional or not. Who gives a crap about one PS tie? But if you got glue in your hands, that probably has a good contribution to certain parts of the game. You would think, wouldn't it? But hey, who am I? Yeah. Can we carry Rice on here?",
    "speaker" : "Mike Melo",
    "timestamp" : "23:20-23:45"
  },
  {
    "timestamp" : "23:47-23:50",
    "speaker" : "Andy",
    "text" : "I guarantee he'd come on right now to defend his honor."
  },
  {
    "text" : "Yeah, so let's do that because",
    "speaker" : "Mike Melo",
    "timestamp" : "23:51-23:52"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:54-24:22",
    "text" : "Oh yeah, I'll have I'll have our people talk to his people, see what we can set up. Make it happen, man, because I'm furious. All right. Speaking of wide receivers though, um had you heard of any of the These uh charges wide receivers, because here's the list that I have. I have Curtis Conway who was their leading receiver. I didn't. Uh Jeff Graham, who if you had told me the name Jeff Graham, I would have thought he was like a stand-up comedian."
  },
  {
    "text" : "He is. He's fucking hilarious. His uh his uh stand-up special came out two months ago. I highly recommend you watch it. I think it's on Netflix. I'm not sure.",
    "timestamp" : "24:23-24:32",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Oh okay, all right. I'll I'll keep an eye out for that when I'm browsing Netflix. Yeah, he's really good. Um And then the only name I actually did recognize was Tim Dwight. Tim Dwight was good, solid Turner. He eventually played for the Patriots. When was that? I vaguely remember that. Uh I don't remember. It was like end of his career and he didn't last very long. I think he was just there to do punt returns. in I think he was supposed to spell either Welker or Edelman at Punt Returns and he didn't think well. Gotcha gotcha. But uh he was good in this game. He the Pages couldn't stop a a wide receiver slant where they just didn't want to. And they they apparently forgot how to tackle on special teams. Oh yeah, kickoffs were um an adventure to say the least. For for both sides, I feel like.",
    "timestamp" : "24:32-25:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "25:22-25:26",
    "text" : "Yeah, look, I mean, I've been a champion of Lee Johnson"
  },
  {
    "speaker" : "Andy",
    "text" : "Um oh we'll get to Lee Johnson. Just you wait. Uh oh, I got a big old section on Lee Johnson to talk about.",
    "timestamp" : "25:26-25:33"
  },
  {
    "timestamp" : "25:34-25:35",
    "speaker" : "Mike Melo",
    "text" : "Okay, I'll I'll hold off."
  },
  {
    "text" : "I mean championing this guy and that's the problem with putting yourself out there. Yeah, you shouldn't have done it. But um the defense actually has some even bigger names, I thought. Um some names that's Pats fans will also recognize because both Rodney Harrison and Junior Seo, who made the Pro Bowl this year, uh ended up playing for the Patriots. Mm-hmm.",
    "speaker" : "Andy",
    "timestamp" : "25:36-25:58"
  },
  {
    "text" : "Like 2019?",
    "speaker" : "Mike Melo",
    "timestamp" : "25:58-25:59"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:59-26:02",
    "text" : "No, 2001. This year that we're talking about."
  },
  {
    "text" : "Oh, okay.",
    "timestamp" : "26:02-26:02",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "The reason for this podcast, Mr. Mellon.",
    "timestamp" : "26:02-26:04"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I thought you were saying okay, got it. Yeah, I don't think no, he's I don't think he's making any Pro Bowls this year.",
    "timestamp" : "26:04-26:09"
  },
  {
    "text" : "Right. I thought you were being insensitive. No. Oh okay. Junior Sale. Rest in peace, bud.",
    "speaker" : "Andy",
    "timestamp" : "26:10-26:15"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "26:15-26:17",
    "text" : "Yeah, exactly. He was awesome."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he was he was the heart and soul of the team. It was. Yeah, so they between it was those two and also Marcellus Wiley on the defensive line. And I guess uh Ryan McNeil, the cornerback, went to the Pro Bowl this year as well.",
    "timestamp" : "26:17-26:32"
  },
  {
    "text" : "Those four were all Pro Bowls on defense.",
    "speaker" : "Mom",
    "timestamp" : "26:32-26:34"
  },
  {
    "timestamp" : "26:34-26:58",
    "speaker" : "Andy",
    "text" : "Yeah. So, setting the stage there. I think talking about how good this defense was, we should actually start talking about the pages offense. Because and especially Tom Brady because this to me was the first game that Brady actually was the reason the Patriots won. Like in his career."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well way to way to you know bring that up so quickly before we even talk about it. Give it a little suspense, man. Now, you know, no one remembers the outcome of these games.",
    "timestamp" : "26:58-27:08"
  },
  {
    "timestamp" : "27:10-27:13",
    "text" : "We've given this game fucking 20 years of suspense.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:13-27:42",
    "text" : "No, no. We gotta all right fine. They won, guys. They won this game. Um no, I actually uh I think this is uh me being serious here. I think that this game, outside of any championship or playoff games Um it's probably and it's one that you don't even think about, but it's probably like one of the top 20 regular season games of the dynasty. And it's definitely worth a rewatch if uh anyone has access to it.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I a hundred percent I cause I was I was watching the game today and it got like I think it was eight minutes left in the fourth quarter. I knew what the outcome was. Yeah. I'm still sitting there I I had a moment of doubt of like wait they They do win this game, right? Like how I'm not quite sure how it's gonna happen because they're down ten points with eight minutes left and going against this ridiculous defense.",
    "timestamp" : "27:42-28:05"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. And I highly recommend like not knowing the uh results going in and because I didn't. And I was like, whoa, this is pretty cool. I feel like I'm reliving like everything all over again.",
    "timestamp" : "28:06-28:18"
  },
  {
    "timestamp" : "28:19-28:50",
    "text" : "See that cause that's how you've been watching the games, but I I knew because you know I've been for my website, I've like been in this, like all these stats and everything and and the results and all that for a while now. So I yeah, I've kind of like I know like n from numbers wise and win-loss wise like how the season went on. Yeah. But I I don't actually remember watching this game. Like I don't remember and like I remember a couple I remember Brady throwing his first touchdown. Like that that plays is in my mind. And then the the game winner that he threw to Wiggins.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "28:50-29:26",
    "speaker" : "Mike Melo",
    "text" : "Well, you know what's sad about this? I I think I didn't miss a Patriots game for I think until like 2007, to be honest. Yeah. Me too. So it was probably like, you know, I don't know, 15, 20 years, you know, 15 years of like straight football. And I I didn't want to miss a game. It was very important to me and I, you know, love watching the Patriots. It's a good time. But looking back, I'm like, I don't remember a damn thing about anything that I watched. And I I made sure to watch every one of them. So maybe they're all bleeping together. But I feel like looking back, I'm like, man, uh, maybe I shouldn't have uh tried to catch every single one."
  },
  {
    "speaker" : "Andy",
    "text" : "But no, I I I just feel like because it's it's also been 20 years.",
    "timestamp" : "29:28-29:32"
  },
  {
    "text" : "I know, I know. And at the moment you're all you know you're experiencing it you know as it happens, so it's one thing, but I'm like I do not remember most of this. So it's great to to watch it again.",
    "speaker" : "Mike Melo",
    "timestamp" : "29:32-29:42"
  },
  {
    "timestamp" : "29:41-30:29",
    "text" : "It really is. Yeah. I was thinking the exact same thing. It's like this for like how like the all the the feelings that I remember this season, like the bits and pieces that I remember, I I thought I remembered more than I actually did. Because all of these games that I watched, with the exception of the Jets one where Blood So went down, uh I I remembered almost nothing of any of these games. Mm-hmm. And so it is almost like part of it is watching it for the first time. Yeah. But you know how it's gonna end up, which is kind of cool. And you and there's also that added thing of like getting to see Tom Brady like you know, as a young fool taking his first steps for being born, knowing what that's gonna turn into. And like just just hearing all the the commentators talking about like, oh, this young kid might be something one day.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "30:29-30:52",
    "speaker" : "Mike Melo",
    "text" : "Right, right. The game itself was awesome to watch, but yeah um but the game before, you know, he sort of got crapped on by by Miami. So they they everyone was just writing them off like we talked about and you know they're like, oh what controversy, whatever. And after this game it sort of like reinvigorated everything."
  },
  {
    "timestamp" : "30:52-30:53",
    "speaker" : "Andy",
    "text" : "Uh I think it did, yeah."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "30:53-30:54"
  },
  {
    "text" : "Yeah, no, yeah, I think this was the beginning of the uh the actual quarterback controversy for the Patriots in this year.",
    "speaker" : "Andy",
    "timestamp" : "30:54-31:01"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "31:01-31:02",
    "text" : "Yeah, I agree. Yeah."
  },
  {
    "timestamp" : "31:03-31:25",
    "speaker" : "Andy",
    "text" : "But um Yeah, because like you said, uh like the the pages, it felt like they had been written off because they're one and three at this point. Uh and when I was putting together all like the Boston Globes like sports pages for the day of and then the day after uh like pre and post game, the the front page of the sports section, the day of the game, didn't have anything about the Patriots on it."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "31:26-31:26",
    "text" : "Oh yeah, that's right."
  },
  {
    "timestamp" : "31:27-31:41",
    "speaker" : "Andy",
    "text" : "Just just wasn't there. Um, and it wasn't like the Red Sox, I think the Red Sox had been eliminated from the playoffs. They're just talking about like it was all just baseball playoffs, basically. And some hockey stuff, but there was no mention of the Patriots."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "31:41-31:46",
    "text" : "I mean that's pretty interesting that it's uh it's been what almost 20 years since uh they were an afterthought."
  },
  {
    "text" : "Yeah, yeah, because uh it wouldn't happen again. This is when they kind of started winning and it didn't really stop for the next night.",
    "speaker" : "Andy",
    "timestamp" : "31:47-31:57"
  },
  {
    "text" : "Well, and the the other incredible thing about this is like um And I don't know if I mentioned this last last week, but watching this team kind of grow from the 2000 season until now and then eventually what they became, it's almost as if Like you were watching like the Bengals, right? So the Bengals, you know, they they crap themselves every year, and then one year there's this kid you know, like the Minshew guy or all these new kids and they take the team by storm and they never let it up, right? So You know, they don't lose their job, they w and it just continues from that point on. So imagine the Bengals just becoming a powerhouse for the next twenty years tomorrow. That's what happened basically.",
    "timestamp" : "31:57-32:41",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "32:41-33:15",
    "text" : "Yeah. When they're when they're um hundred million dollar starting like franchise starting quarterback goes down and they're like, you know what? Fuck it, we're gonna start this random dude who nobody's ever heard of. Yeah, like a Gardner Minshew. Yeah, if you if he had just taken them and just won the rest of the games and won the Super Bowl and then stuck around for the next twenty years. Yep Like that's that's that's really hard to imagine. Even if you want to put like Patrick Holmes in that list, it's like, yeah, they they got rid of a gr a solid quarterback in Alex Smith and now all of a sudden this kid that nobody really knew about, even though he was drafting the first round."
  },
  {
    "timestamp" : "33:15-33:16",
    "speaker" : "Mike Melo",
    "text" : "Right."
  },
  {
    "timestamp" : "33:16-33:39",
    "speaker" : "Andy",
    "text" : "Taking the world by storm. But even he's like struggling and he didn't he didn't win a Super Bowl as far as you were like, what the fuck? Right, right. MDP. Yeah. But the one thing I noticed about The Patriots offensive game plan this was that it seemed like they were gonna be trusting Tom Brady in the game, even against this defense."
  },
  {
    "timestamp" : "33:39-33:47",
    "speaker" : "Mike Melo",
    "text" : "Right. I mean that's interesting. You think that they had that going in because the run game was not working from the beginning."
  },
  {
    "timestamp" : "33:47-34:04",
    "text" : "That's true. But I mean like they they started the second drive like inside their own ten yard line. Uh the first play was yeah, five yeah five wide, zero running back, like empty backfield, and letting Tom Brady throw out of his own end zone. Like Yeah, you're right.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:04-34:08",
    "speaker" : "Mike Melo",
    "text" : "I mean I also like so he threw for over fifty passes in this game, which is insane."
  },
  {
    "timestamp" : "34:08-34:15",
    "speaker" : "Andy",
    "text" : "He did. This is actually I I was looking it up. It's the Well the kind of eleventh most passages I've ever thrown."
  },
  {
    "timestamp" : "34:16-34:46",
    "speaker" : "Mike Melo",
    "text" : "That's crazy. Yeah, right off the bat. But I I was also wondering because I mean that that defense was like brutal. I mean it was uh you know, they're fast, they're big, um and they blitz a lot. Um, especially with Rodney and Junior. So um so do you think that part of it was, especially when the run game just crapped itself, do you think that uh Delicek was like, you know what, we're gonna give this kid experience and whatever happens, happens. Or do you think it was more of uh we're gonna win this by doing it this way?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:47-35:16",
    "text" : "I mean I think I I I don't know. Uh it felt like they were like, yeah, no, this kid can do what we ask of him. I and I don't think they were asking a ton, because there was a whole lot of like bubble screens and basically It seemed like they told him, you know, if one of your wide receivers, if the defensive back plane against him is off him for ten yards, just like catch the ball and chuck it at him. And let them get that eight, nine yards, you know, before the guy can get to him. Because they did that a bunch of times."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "So what you're saying is that the uh Tom Brady game plan hasn't changed for 20 years.",
    "timestamp" : "35:16-35:20"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:22-35:27",
    "text" : "Well, I mean he was still throwing down the ball. He he could throw a beautiful out route."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "He could, but his deep ball, man, like I wrote that that was like one of the weaker um you know the weaker spots in his game. was his deep ball and I know he's never been like a perfect deep ball guy anyway, but um in this game I it looked like it needed to be worked on. Like I yeah, he was precise, he was accurate, his decision making was great. But like yeah, his deep balls were a little off.",
    "timestamp" : "35:27-35:50"
  },
  {
    "text" : "I thought he had a couple that were like right in the money, but they were dropped. I can remember one specifically from Patton down the sideline. But But yeah, I it was it was surprising to see him overthrowing deep balls.",
    "timestamp" : "35:50-36:03",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I don't know. I mean, uh obviously you need timing down with those guys.",
    "speaker" : "Mike Melo",
    "timestamp" : "36:03-36:07"
  },
  {
    "text" : "Yeah. But you don't ever really see him overthrow anybody anymore. Like that's he can't. Just kidding, guys. Uh But yeah, so this game he did uh throw his first ever touchdown pass to the vaunted Terry Glenn, who had a what I felt was a very Terry Glenn game.",
    "timestamp" : "36:07-36:32",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:32-37:01",
    "speaker" : "Mike Melo",
    "text" : "Yeah, I mean I i I agree. And before we even get into that, like, do you find it odd? Um compared to maybe now even. Do you find it odd that Belichick, after suspending from a year, then he got reduced to four games and then he was forced to come back. He didn't have to play them. So didn't you find that it was odd that once the suspicion got reduced, that he was this active in the first game that he was back?"
  },
  {
    "timestamp" : "37:01-37:33",
    "speaker" : "Andy",
    "text" : "No. Uh for a couple reasons. One, uh the main reason is because Belichick always says, uh I'm doing what's best for the team. And what's best for the team is to have that talent on the field. And especially because it was this defense. And because they knew I I'm guessing they knew they were gonna have to throw it. And so to give Brady that option because I don't remember how many catches he had in the first half, Terry Glenn, but I think it was like nine. Yeah, and he went for like 97 yards and a touchdown."
  },
  {
    "timestamp" : "37:33-37:35",
    "speaker" : "Mike Melo",
    "text" : "Or maybe it was like six, actually. But yeah, it was up there."
  },
  {
    "timestamp" : "37:35-37:45",
    "speaker" : "Andy",
    "text" : "Yeah, something like that. Yeah, but he was kind of the the main option for Brady throwing balls kind of at the sideline that Terry Glenn would make these diving toe-tapes."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Amazing. Which I mean if social media was like prominent Um around that time. That would be he might be like the the next Odell Becham based off team's catches alone.",
    "timestamp" : "37:46-37:57"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:57-38:06",
    "text" : "Yeah, he was he was making a ton of them. I mean he I think he had one catch in the second half. But so it was very Terry Lunge like disappeared immediately when the game actually starts."
  },
  {
    "text" : "How about dude he he had uh I think three back to back sideline grabs and they were all like one of them he went dead leg He basically caught the ball and as he was flying out of bounds, his legs drop, and I I don't know how this is humanly possible, but they drop. Um he did another one that was very similar and then the third time. Uh he d he definitely caught a sideline catch and they called it incomplete and you know anyway or whatever. But that was a beautiful catch as well. So uh it was incredible to watch, but yeah, he fell he disappeared in the second half for whatever reason.",
    "timestamp" : "38:07-38:39",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yep. Yeah, yeah. It's just typical Terry Glenn. Like But I mean we're we're talking before we he we he his entire career with the Pagets he never had. uh multiple touchdowns in a game.",
    "timestamp" : "38:39-38:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right.",
    "timestamp" : "38:52-38:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Which is mind blowing for how good of a player he was.",
    "timestamp" : "38:52-38:56"
  },
  {
    "timestamp" : "38:57-39:01",
    "speaker" : "Mike Melo",
    "text" : "Well, um did I say that Randy Moss never had one either?"
  },
  {
    "timestamp" : "39:02-39:08",
    "text" : "I believe you made that claim. Yeah. So I mean I believe it was quickly debunked, but yes.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "39:09-39:46",
    "text" : "Well if you want to stick with that, you're more than welcome. Okay. I'm just saying that you know great players don't necessarily have that. Uh uh but no, I I was correlating this to things like um like remember when Wes Walker was like, you know, making a couple of foot jokes with uh uh What's his face? Um Red Ryan. So Belichick, even though it wasn't the greatest thing for the team, he benched them for the first quarter of that game and they lost. So I'm like w why where where's the double standard unless he just didn't like West, which I know that that is sort of rumored anyway, but Yeah"
  },
  {
    "timestamp" : "39:47-40:04",
    "speaker" : "Andy",
    "text" : "Uh yeah, I don't know. I mean, I wonder if we would know more if this like you said, this was happening today in the the age of social media and You know, if it would be more along the lines of seeing what Antonio Brown has been putting out there, it would have been similar to that"
  },
  {
    "text" : "Yeah, I don't know, but Wes was like such a quiet dude anyway. Um except for that one moment he got punished I thought fairly severely. I mean wasn't that a playoff game? Mmm I think it was.",
    "speaker" : "Mike Melo",
    "timestamp" : "40:04-40:17"
  },
  {
    "timestamp" : "40:17-40:18",
    "text" : "Was that the playoff game?",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't remember. Yeah, I'm pretty sure it was a playoff game and he was bad for the first quarter.",
    "timestamp" : "40:18-40:21",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "It may have been, yeah. That was just a bad game all around.",
    "speaker" : "Andy",
    "timestamp" : "40:22-40:25"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "So I don't know. Now here's a uh you know maybe it's an out there question. I don't know, you can tell me. But um Do you think that we could get Belichick on here at some point and have him discuss that?",
    "timestamp" : "40:25-40:39"
  },
  {
    "timestamp" : "40:40-41:01",
    "speaker" : "Andy",
    "text" : "Uh after he retires, yes. Oh, you think we should I I think that would yeah, because by the time we've actually caught up to modern day patriots in in 19 years or however long it'll take us to do that. He will hopefully have eventually retired at that point if he's still alive. And then we will have him on because we will be the preeminent uh Patriots podcast."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "41:02-41:04",
    "text" : "Dude, in like 20 years, I'm gonna hold you to this."
  },
  {
    "timestamp" : "41:04-41:06",
    "text" : "Okay. All right.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "41:06-41:08",
    "text" : "If I remember. Yeah."
  },
  {
    "text" : "If either of us is still alive in 20 years, let's be honest. It's a long time. Yeah. Um, all right. So going back to Brady, the one other note I had on here was um Well a couple, but the one that I want to talk about next is I s uh noticed that there was a whole lot of hard counts from Tom Brady. And I think that was in direct correlation to what the Chargers defense was doing. Mm-hmm because it felt like every single play At least junior say if not both middle linebackers would run up and pretend to try time the snap count. Yeah. And both of them kind of like jumped on either side of the uh the the center there. And I think even on the first drive they had uh Oh yeah, I had it written down somewhere, but they the fur I think it was the first drive they had uh two off sides penalties trying to time that. Yep. that jump and at least one of them was on Junior Seao. And then again, like towards the end of the game, even Rodney Harrison got into it. It was like trying to time that with like jump over. And they actually s on occasion actually managed to get back",
    "speaker" : "Andy",
    "timestamp" : "41:08-42:20"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah on sides before the the the ball was actually snapped, but it was very like that that was sort of a knock on them at that time in their careers as well though because I think they they were very sharp and aggressive, but then at the same time they were also very emotional. Yeah. Um and so, you know, if one or two things goes awry or you know, you hurt your team, I mean they might be overcompensating and that that sort of creates a whole different issue with the defense. So",
    "timestamp" : "42:20-42:45"
  },
  {
    "text" : "Oh, absolutely. So yeah, yeah, I think they had I I know the Chargers ended this game with like twice as many penalties as the Pages had. The vast majority of those were on on the defense for things like jumping off sides or just getting a bit too, like you said, emotional.",
    "timestamp" : "42:47-43:07",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. Well, and I I also thought it was interesting. Um in what what Brady was doing and I think it was foreshadowing the rest of his career. But I mean this kid's a young kid. He's you know third game in and the defense was aggressive and he was willing to you could already see him throwing footballs that like people's feet on screens. Yes. So he was willing to give up that play, uh which he never lost, but that's a That's pretty unique for a young kid. And I don't necessarily remember thinking about that back then. Right. Um, but yeah, looking back, I mean, he was pretty good at avoiding that kind of uh stuff and being aware of what was happening um with the defense.",
    "timestamp" : "43:08-43:46"
  },
  {
    "timestamp" : "43:46-43:49",
    "speaker" : "Andy",
    "text" : "Yeah, it was like the antithesis of uh Drew Bledsoe."
  },
  {
    "timestamp" : "43:49-43:51",
    "speaker" : "Mike Melo",
    "text" : "Yeah, it really was, man. I know."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:52-44:01",
    "text" : "Yeah, trying to chuck that ball like no look pass over the over his shoulder as he's getting sacked, which is usually picked off in return for a touchdown."
  },
  {
    "text" : "Yeah, no, so and and I also like, you know, uh Belichick was already throwing out different types of defense and and and uh whatnot on the other side of it. So yeah there were there were you could see little bits of both of them kind of coming together, which was I thought pretty cool. Yeah.",
    "timestamp" : "44:01-44:20",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so let's talk about the pages, even that's a good segue. Because I thought they balled out in this game. They this was the prototypical Ben don't break defensive like showcase. Because the charges were I think the best team in the red zone, I think they showed us that early on. Yep. Or like, I don't know, top three or whatever it was, like in scoring red zone touchdowns. Yeah. Which I'm assuming most of those were Ladanian Tomlinson runs because he already had seven up to that point in the season. But um the Patriots defense held the Chargers to, I think it was at least two, maybe three red zone stops. Where like the Chargers had, I think, first and goal from the one or the two and couldn't score In the first quarter.",
    "timestamp" : "44:20-45:09"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And that was in the first quarter, yeah. So it was three three at that point. But I think that was a major turning point just to kind of prove what they could do. Exactly.",
    "timestamp" : "45:09-45:17"
  },
  {
    "text" : "And then they did it again at the end of the half, too. Yep. Um and I think that actually ended in a miss field goal.",
    "speaker" : "Andy",
    "timestamp" : "45:17-45:26"
  },
  {
    "timestamp" : "45:28-45:38",
    "speaker" : "Mike Melo",
    "text" : "Right, yeah, yeah. They uh well no the uh the Wasn't that wasn't the end of the half a miss by Vinitaria actually? Oh that's right."
  },
  {
    "timestamp" : "45:38-45:43",
    "speaker" : "Andy",
    "text" : "Yeah, okay, yeah. So so it was uh Yeah, it was actually to begin the the second quarter."
  },
  {
    "text" : "Right, right, yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "45:44-45:45"
  },
  {
    "text" : "Yeah, no you're right, yeah, because then The Chargers drove all the way down and then kind of went three and out in the like inside the ten-yard line, like first and goal. Missed the field goal. And then the Patriots actually like from there march all the way down the field and Brady scored his first touchdown.",
    "timestamp" : "45:45-46:05",
    "speaker" : "Andy"
  },
  {
    "text" : "Well and to piggyback off of that, I know we're talking defense, but It was funny because Tom Brady throws his first touchdown. Yeah. Pinateri misses the extra point. Yes. And then they're they're running the two-minute drill. Uh the Pats are in the second quarter. Um Terry Gwen, another beautiful sideline catch. Brady driving it like pretty pretty well executed, two-minute drill. And then Penateri misses the field goal. So that was that could be enough to just crush a team right there.",
    "speaker" : "Mike Melo",
    "timestamp" : "46:06-46:35"
  },
  {
    "timestamp" : "46:35-46:43",
    "text" : "Yeah, and just uh you d you don't ever remember Vinitaria ever missing field goals. And I th apparently these were the first that he ever he missed this season too.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:43-46:46",
    "speaker" : "Mike Melo",
    "text" : "Oh yeah, he was like six for six and always like extra points."
  },
  {
    "text" : "Yeah, but he would always have one of these games every once in a while. The commentaries kept saying, Oh, he's never missed a kick indoors in his however many years of playing. And he missed like four in that game before he kicked the game winner in overtime against a team they should have blown the doors off of.",
    "speaker" : "Andy",
    "timestamp" : "46:46-47:03"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right, right. Yeah, yeah. So I mean it was uh I mean they had a lot of different things working against them, but we could go back to the defense and tackle those later.",
    "timestamp" : "47:03-47:11"
  },
  {
    "timestamp" : "47:17-47:32",
    "text" : "That two minute offense I think should be called out as well. Because if it was a whole I I think two minute Tom Brady was still there, but the offense itself It was like a slow-mo version of what they do now.",
    "speaker" : "Andy"
  },
  {
    "text" : "Mm-hmm.",
    "speaker" : "Mike Melo",
    "timestamp" : "47:32-47:32"
  },
  {
    "text" : "And he was still trying to do trickery, but he wasn't good at it. Because you can see him like the the fake spike play. Yeah. Where you can see he's he's he's calling routes to the receivers, but then he's doing like, oh, I'm gonna spike, I'm gonna spike it. And like nobody fall for that. Except for the the commentators like, oh, I can't believe he threw them all there. It looked like a fake spike. Like he was calling a play before he said he was gonna do his fake spike. It took him like 45 seconds to get it off, too.",
    "speaker" : "Andy",
    "timestamp" : "47:33-47:59"
  },
  {
    "text" : "Yeah, and uh the awareness of just like timeouts and things like that. Like I I made a note towards the end of the game as well. Um You know, he executed the way he was supposed to, but I think he left like 30 seconds on the clock. And I just know that at some point Brady would never let that happen.",
    "speaker" : "Mike Melo",
    "timestamp" : "47:59-48:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Oh yeah, I bet he looks back on that now and be like, oh, what the fuck was I thinking? Right.",
    "timestamp" : "48:16-48:20"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "48:20-48:24",
    "text" : "And it almost came back to haunt them too. So 30 seconds is a pretty big deal."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:24-48:50",
    "text" : "Yep. Yeah. Um yeah, yeah, we now that I wanted to make sure we talk about that, but yeah, let's let's go back to the uh Pages defense. Right. Because there was one stat at the beginning of the game that I thought Uh felt a little bit like this season, kind of, where um they mentioned that the Patriots defensive backs had scored more touchdowns than pages wide receivers by a margin of two to one."
  },
  {
    "text" : "Yeah, that's scene. Which is brutal. It is very reminiscent of today though. A little bit. I mean not not quite to the same extent. No, no. But yeah. That was uh I mean and to your point, I mean that's that's sort of why Terry Glenn was brought back, I guess.",
    "timestamp" : "48:50-49:09",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "49:09-49:31",
    "speaker" : "Andy",
    "text" : "Exactly, yeah, because it it had been Uh what I think a lot of commented's favorite word is when talking about offense like this, it had been anemic. Right. It had yeah, there hadn't been much. Um I mean if we're gonna do a bit of a crossover, Brian Cox, who's been, I think, probably the defensive player of this season so far up until this point."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, playing like an animal. And you know, he's the energy behind that defense too. So I mean fighting the guys are just throwing their bodies around.",
    "timestamp" : "49:31-49:39"
  },
  {
    "timestamp" : "49:40-50:06",
    "speaker" : "Andy",
    "text" : "Yeah, and they're feeding off of him. You can you can feel it from from watching the game. But uh I think his big play of this game actually came on offense when he lined up his fullback on a third and one. You know, and then they threw it to him and he caught it and got a first down. That was pretty awesome. That was beautiful. Like, oh my god, a linebacker catching passes from Tom Brady. This is this is some trickery. I'm like, oh, just you wait. Vrabels time is coming."
  },
  {
    "text" : "I mean Brayball, I mean yeah Yeah, we we don't need to touch on that now, but man, his numbers as a tight end are phenomenal. They really are. They're out of control.",
    "speaker" : "Mike Melo",
    "timestamp" : "50:07-50:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Um the other the other quote I had uh related to the offense actually here, I'm jumping all over the place, was um tight end has been really absent from the passing game. This is where they miss a player like Ben Coates. Which you could replace Ben Coates with uh Rob Gronkowski this year and it feels again very familiar in the red zone.",
    "timestamp" : "50:17-50:37"
  },
  {
    "timestamp" : "50:37-51:02",
    "speaker" : "Mike Melo",
    "text" : "Yeah, it's a good point. I mean uh the there was talk of like, you know, the present day Patriots sort of resembling the two thousand three and two thousand four Patriots, where it was solid defense, um, you know, the these sort of shorter plays, yeah. uh relying on passing backs or receiving backs. So you might be right. I don't know if that has to do with Brady's age. I don't think so, because I don't think his play has fallen that much. I think it's just a structure of the team at this point."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh I I think this year it's mostly just injuries to all the the big beef on the offensive side of the ball. Yeah.",
    "timestamp" : "51:03-51:11"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "51:11-51:30",
    "text" : "Yeah. But you know, in in 2001, I guess it was just building a foundation that this uh Well, i I mean I was gonna say Brady can kind of build off of and you know have a security blanket, but I guess with a guy like Bledsoe, you probably would want a security blanket if he could pick up that concept as well."
  },
  {
    "timestamp" : "51:31-51:46",
    "speaker" : "Andy",
    "text" : "And I don't think he ever did, obviously, but yeah, no, I don't think so either. Um I think uh one of the bright spots I I noticed on defense was every time Laurie Malloy blitzed."
  },
  {
    "timestamp" : "51:46-52:08",
    "speaker" : "Mike Melo",
    "text" : "Because his timing was impeccable. Yeah, the uh the I wish that we could show this play But uh which one? There was a couple. Well, there's one that he blasted Flutie and he was like, it was just it was just Molloy and him and uh He he and Floody to his credit, I mean he he tried to kind of get away, but uh he did not."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:08-52:28",
    "text" : "And he did not have a chance. Yeah. But yeah, because it was one of those ones where he came from his safe position and just timed it perfectly. So he hit the line and just came through unblocked. And he did it once um on a running play too and caught LT in the backfield and just like lit him up. That man could he could lay the wood like no other."
  },
  {
    "timestamp" : "52:29-52:33",
    "speaker" : "Mike Melo",
    "text" : "Right. Or deliver the wood as we learned last week on football against football."
  },
  {
    "timestamp" : "52:33-52:53",
    "speaker" : "Andy",
    "text" : "That is correct, yes. Yeah. Um speaking of uh football or not football, let's get to uh your boy Lee Johnson. Because what he's doing out there could be considered either football or not football. I don't I uh did you like that? Yeah that was a segue right there, bud."
  },
  {
    "text" : "It was great. And you're absolutely right. I don't know what the hell was going on with this guy. You know it's funny too, before we even get into what happened in this game with this guy. At the end of the game, they interviewed him and they were basically like, you know, what if what if you get cut? What happened? And he basically said, I've killed us enough. That's a direct quote. I've killed us enough. If it happens, it happens. He was forty years old. Yeah, he was forty years old. He finished the game because of like one of his plays with negative nineteen rushing yards. So all in all, I and this I don't know. Maybe this was his last game, we'll find out.",
    "speaker" : "Mike Melo",
    "timestamp" : "52:53-53:27"
  },
  {
    "text" : "But uh I'm not sure actually.",
    "timestamp" : "53:27-53:29",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "53:29-53:35",
    "speaker" : "Mike Melo",
    "text" : "He admitted that uh he has been sucking and he was okay with being cut essentially."
  },
  {
    "timestamp" : "53:35-54:42",
    "text" : "I mean this this was bad. His first punt was awful. And his second punt was really bad, but he got a good bounce off of it. But the last punt Uh it felt like your typical Patriots way of losing the game where he got he got the I think He got the he was standing on his own ten-yard line, got the ball, and went to go punt it. It was taking forever, and a free rusher came in. So he tried to like take the ball and like put it round his back. I think he was gonna try to sidestep the guy and then kick it. But the guy caught him. So he kind of had it in his like he was holding onto the end of the ball with his fingers and he was getting spun around. And the ball just like flew out of his hand backwards. So now the ball's sitting on the five yard line. The guy that tackled him gets up, picks up the ball. Lee Johnson gets up and just kind of like watches him and then realizes, oh fuck, this play is still going, and goes to try to tackle him and gets lit up by some other guy who's come and knocked his head off all the other all the And guy who recovered the fumble just waltz in for a touchdown who was a backup fullback. He wasn't even like some sort of role player on this team.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:43-55:18",
    "text" : "Right. Well, you know and you know why he did that? Uh which doesn't make any sense to me, but he has been in the league for so long at this point that he said he had seen this Um, you know, he's been rushed by a million guys. And so he feels that like because they're all full steam ahead, you could sort of like, you know, fake them out and then get the ball off. But he said that even when he was in the grasp of the defender He he felt confident that he could still get the kickoff. And if anybody can see this play, he is holding it out like I I I can't even like give a proper analogy of this, but he's he's basically holding it out so that anybody can grab it.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I feel I'll I'll I'm gonna see if I can uh cap that play and we'll put it online and listen.",
    "timestamp" : "55:18-55:24"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "55:25-55:28",
    "text" : "If that happens nowadays, that guy is cut tomorrow. Oh my god."
  },
  {
    "text" : "It's it's on Sports Center's not top ten for weeks as well. Oh, yeah. Brutal. And this was to put the Patriots down by 10 points with eight minutes left in the game.",
    "timestamp" : "55:30-55:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, and at this point, uh because again I didn't know the score or anything uh going into it, so I was just like, oh wow, well they blew this one. And then I was also thinking",
    "timestamp" : "55:41-55:51"
  },
  {
    "text" : "Go ahead. No, I was gonna say this this is exactly the point where I thought, wait, they they win this one, right? Like they're they're running out of time real fucking fast here.",
    "timestamp" : "55:51-56:00",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "56:00-57:20",
    "text" : "That's funny. Well, I was thinking, man, like uh this is going through my head a lot where and uh again I didn't know what the score was gonna be. So I was like, man, are they gonna start off the season like one and four? Like this is insane. And then I was thinking, you know, you see there's it's like the butterfly effect, right? So you see one Bletso is like coaching up Brady, they're all like best friends. Yes, yeah, yeah, yeah. basically holding hands and like you know sharing secrets and then and then uh you know he he's also riding high Belichick is you know giving them opportunities And of course, you know, he wins this game and things change as the season goes on, right? Maybe Borzo's demeanor changes a little bit, Belichick stands by him, whatever. But if they lose this game coming and of course it wasn't Brady's fault, but if they lose this game after Miami So now they're they're one in four. One in four, right. And then eventually Bletko within a week or two comes back. It could definitely change the course of everything. I mean, Belichick might at that point decide to go with the backup anyway to see what he has, but Um everything could be different. And remember how he said with these rules nowadays, and if Balenzo stayed with the greatest coach of all time, he could very well be the GOAT. Okay? Let's be honest, he could be the GOAT. Yes he could. Just be honest with yourself."
  },
  {
    "speaker" : "Andy",
    "text" : "No, he would have been good. I don't know if he would have been the goat. He would have been the goat. He him he Just just remember we're talking about Drew Bledsoe in fourth quarters of games here.",
    "timestamp" : "57:20-57:29"
  },
  {
    "text" : "Hey, he would he would go. He would have learned how to throw uh uh He would have put up numbers Yeah, but he would learn how to dink and dunk, right? Belichick would beat it into him. Um and we would be talking about Bletto potentially having twelve Super Bowls right now. But instead, uh Brady, which I think he with like six at the moment, but um potentially seven, who knows? But Uh we might get to 12, you never know. We might we I'm not saying we might be uh better off with Bletto, but things would have been different.",
    "speaker" : "Mike Melo",
    "timestamp" : "57:30-58:02"
  },
  {
    "text" : "Yes, I think so.",
    "speaker" : "Andy",
    "timestamp" : "58:02-58:04"
  },
  {
    "text" : "So thank God. And thank God for for Lee Johnson. Uh because Brady can thank him probably for a spot because he became the hero. Without Lee Johnson, maybe there's no heroics at the end. Maybe not this level of heroics. You know what though? I'm gonna retract my statement on Lee Johnson. Fuck it. I like him.",
    "speaker" : "Mike Melo",
    "timestamp" : "58:04-58:23"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I agree. He was uh he was the character that this team needed. Definitely a glue guy.",
    "timestamp" : "58:23-58:30"
  },
  {
    "text" : "Is that like a um Batman reference like it was the he was the villain that the hero needed Sure. All right. But anyways, yeah, he was the villain that the Patriots needed, man. I hope he sticks around for the rest of the year. I I don't know what happened.",
    "timestamp" : "58:30-58:45",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:46-58:52",
    "text" : "Yeah, me too Yeah. So yeah, so I mean that that sets up this the pages down by ten with eight minutes left. Right."
  },
  {
    "timestamp" : "58:56-58:57",
    "speaker" : "Mike Melo",
    "text" : "No, it's great."
  },
  {
    "timestamp" : "58:57-59:11",
    "speaker" : "Andy",
    "text" : "But they uh they get the ball back. They drive down the field and get inside the 10, but then kick a field goal because they ran out of time. Or they they ran out of like they got on fourth down and they decided to kick a field goal instead. So now is that."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right, which I thought it was funny because the announcers, again, fantastic. They're going, look, what do you think? What what do you think happens? I think you gotta go for a touchdown. You're this close, fourth down, you gotta go for a touchdown. And then when they bring out the uh the uh field goal unit, uh they're like, this is a smart play. You gotta kick the field goal here.",
    "timestamp" : "59:11-59:28"
  },
  {
    "speaker" : "Andy",
    "text" : "You're you're down by two anyway. You're down by two scores anyway, yeah. But they were also saying that on they're like, oh they they definitely should go for it here. It's uh like they they I'm I'm I'm not surprised they're leaving the offense on the field. Uh they they they should be going for touchdown here, that makes sense because um it was third down.",
    "timestamp" : "59:28-59:45"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "59:46-59:47",
    "text" : "Right, okay, yeah, yeah, yeah."
  },
  {
    "timestamp" : "59:47-01:00:14",
    "text" : "Yeah, so they didn't get it then. And and Brady's running completion, and then the fourth down comes and they they trot the field goal, like, oh actually, yeah, no, the the field goal here makes a lot of sense. So yeah, so they they kick the field goal and there's like four minutes left in this game with Ladanian Tomlinson and Doug Flutie in his fourth quarter magic, which we had heard about. Um pretty much for the the previous three hours I'd say.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:00:14-01:00:15",
    "text" : "Mm-hmm."
  },
  {
    "timestamp" : "01:00:15-01:00:45",
    "text" : "Uh but the page is holding a three and out barely. The fur the first the The first play of that drive was an eight-yard run by LT to get them the second and two. Right. And we're we're getting towards the two-minute war and I'm like, they no, they they do win this, right? That was that was the second one. But then they they held him two more runs, held him got to the I think the two-minute warning or something like that. Called a couple timeouts. Get the ball back and Troy Brown. Troy Brown has a ridiculous punt return.",
    "speaker" : "Andy"
  },
  {
    "text" : "He does. And even before that, they it was before the two-minute warning. They uh it was um after that that eight-yard run It was a second and two and a third and one with about two twenty-three left.",
    "timestamp" : "01:00:46-01:00:58",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that that sounds right.",
    "timestamp" : "01:00:59-01:01:00"
  },
  {
    "text" : "Yeah, so yeah, Trey Brown gets the punt return. And even with that penalty that gets called, it's still A sizable return.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:01:00-01:01:06"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because his return brings it to like the forty San Diego San Diego forty. Yeah, like it was a ridiculous return. It's like your typical Troy Brown return, but then got Call back for holding, put them back on their own 40, which is still great field position.",
    "timestamp" : "01:01:06-01:01:20"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:01:20-01:01:20",
    "text" : "Yeah."
  },
  {
    "text" : "And then Brady.",
    "speaker" : "Andy",
    "timestamp" : "01:01:21-01:01:21"
  },
  {
    "timestamp" : "01:01:24-01:01:37",
    "speaker" : "Mike Melo",
    "text" : "From this point forward in the rest of the game. It was like, and I'm talking defense, offense, everything. It was probably one of the better games I've watched. In a long time."
  },
  {
    "timestamp" : "01:01:37-01:02:00",
    "text" : "It was yeah, it was like I I was super excited. I'm sitting there yelling at my my TV, even though I I know what happened at the end. Right. I'm like, there's no way he caught that Because it was, you know, the typical it was basically Brady and Troy Brown at the end of the game on that last drive, it felt like. Yeah, although David Brown got uh yeah, twenty-six yards yard line Yep, that's true.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:00-01:02:14",
    "speaker" : "Mike Melo",
    "text" : "Uh like that then I like so it was forty seconds left when they're on the three, and this is what I'm talking about. They had one timeout left. Yes. And basically like Brady burns it with 30 seconds left. There's no way they do that now. They'd probably wait till about 25 seconds, maybe."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I was gonna say 17. Yeah. Enough to run three plays and that's it. Exactly. That's what you're gonna do. You're gonna keep running plays until you either run out of time or well, you're gonna run four plays and you're gonna do it as quickly as possible. So leave yourself just enough time to do that. Yeah. And that's it. But yeah, you know, you're right. And then The uh the commentators were gushing over the play, which is basically just a play action, like a heavy run play action passing to. uh Jermaine Wiggins in the back corner of the end zone who was a lot bigger than I remember him being.",
    "timestamp" : "01:02:14-01:02:46"
  },
  {
    "text" : "Yeah. And a hefty boy, that one. But also like pretty like Shifty too. He's uh you know, he had a little bit of agility to him, but I think that's a good thing.",
    "timestamp" : "01:02:46-01:02:55",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Well he was definitely not uh a receiving option that the charges were at all worried about because he was wide the fuck open.",
    "timestamp" : "01:02:55-01:03:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:03:02-01:03:06",
    "text" : "Yeah, but I feel like this was foreshadowing basically the whole playoff run. Yeah."
  },
  {
    "timestamp" : "01:03:06-01:03:07",
    "speaker" : "Andy",
    "text" : "I agree."
  },
  {
    "timestamp" : "01:03:07-01:03:12",
    "speaker" : "Mike Melo",
    "text" : "We'll talk about but Jermaine Wiggins wasn't a household name, but I mean he's near and dear to my heart."
  },
  {
    "timestamp" : "01:03:12-01:03:28",
    "speaker" : "Andy",
    "text" : "Yeah. So yeah, so that that ties it up with a few seconds left, like thirty something seconds left. Pagers kick it off and the Chargers had a ridiculous return again on a kickoff like they they they basically start the forty yard line every drive."
  },
  {
    "timestamp" : "01:03:28-01:03:34",
    "speaker" : "Mike Melo",
    "text" : "Right. Um and then But wasn't that the one that Tabucky Jones laid out the returner?"
  },
  {
    "text" : "Oh, that's right. Yeah, no, that one was, yeah. Yeah. That and that was a that was a l tu uh uh Lloyd Malloy-esque hit and he just put his shoulder in the guy's shoulder and knocked his ass over.",
    "speaker" : "Andy",
    "timestamp" : "01:03:34-01:03:43"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "The tackling and the and the the kickoffs and and all that, from that point on everything was just spectacular. It was like almost like too much.",
    "timestamp" : "01:03:44-01:03:51"
  },
  {
    "text" : "Oh yeah, it was oh yeah, everything was perfect. Um so yeah, obviously the Chargers don't score. They they almost got into field goal range and there was some like fuckery with Uh Doug Fluty tried to spike the ball.",
    "timestamp" : "01:03:52-01:04:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:04:08-01:04:09",
    "text" : "I don't think I've ever seen this before.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "No, but he so other than when I was watching this game originally. Yeah, so he pulled the ball up to to like pulled his arm back to spike it and the ball fell out of his hand and then he like tried to spike it but missed and the pages recovered it but be the ref said because they blew the whistle When he when the ball hit the ground, they still got the ball back, but it moved the field goal back five yards. Yeah. So instead of being like a fifty-two yard or fifty seven yarder And the kicker came up like three yards short.",
    "timestamp" : "01:04:09-01:04:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well, and it that was a big controversy, not in that game, but like for a couple of years, where was that whole thing where can you challenge something that has been whistled down? And there were enough of these plays that they eventually turned it over to what it is today. Um, where you can pretty much challenge everything and w overturn it. But yeah, because the whistle blew There's nothing that Belichick could do about it.",
    "timestamp" : "01:04:37-01:04:59"
  },
  {
    "timestamp" : "01:04:59-01:05:17",
    "speaker" : "Andy",
    "text" : "Right, 'cause that was the rule back in that that time. Right. Um but yeah, so I mean even that because uh if you saw the replay, you could see a bunch of the sideline for the charges run onto the field thinking the guy hit the field goal because it was straight down the middle, he just missed it short by a couple of yards. Right."
  },
  {
    "timestamp" : "01:05:18-01:05:23",
    "text" : "So then I think the uh the uh kickoff that you were talking about was the the one in overtime.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, yes, you're right. I got them mixed up because the Chargers actually won the toss.",
    "timestamp" : "01:05:24-01:05:27"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right.",
    "timestamp" : "01:05:28-01:05:28"
  },
  {
    "timestamp" : "01:05:28-01:05:33",
    "speaker" : "Andy",
    "text" : "Um yeah, and returned the ball to the 40-yard line. So they didn't need many yards."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Vinateri could never kick into the end zone.",
    "timestamp" : "01:05:37-01:05:40"
  },
  {
    "speaker" : "Andy",
    "text" : "No, not until they move the uh the kickoff up.",
    "timestamp" : "01:05:40-01:05:46"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:05:47-01:05:53",
    "text" : "Right. And it's not even like the uh um Gustavsky thing where like he could like boot it high up in the air and travel that far."
  },
  {
    "timestamp" : "01:05:53-01:05:56",
    "text" : "Put it at the one. No, he's put it at like the 13-yard line.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, man. I'm like, what the hell is going on?",
    "timestamp" : "01:05:56-01:05:58"
  },
  {
    "timestamp" : "01:05:58-01:06:03",
    "speaker" : "Andy",
    "text" : "Yeah, it was it was not a a position of strength for this team at this point."
  },
  {
    "text" : "Right.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:06:03-01:06:04"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:04-01:06:38",
    "text" : "Um, but yeah, so the Chargers get the ball at their own forty, need basically, what, twenty, twenty-five yards to go. Yep. Um and they had actually been driving like late it in the second half of this game. They the Patriots defense felt like they were kind of wearing down a bit, but uh In this particular instance, they they held. The Chargers went three and out. Had to punt the ball back to the Patriots. Uh first play from scrimmage, Brady throws a bomb down the right side of the field to Uh Patton, I believe it was. David Patton."
  },
  {
    "timestamp" : "01:06:38-01:06:51",
    "speaker" : "Mike Melo",
    "text" : "Yeah, but the crazy thing about this play is that it was an all-out blitz by San Diego, and he he stood in the pocket, he kind of did his little dance in there. And threw it up for classic like PI."
  },
  {
    "timestamp" : "01:06:51-01:06:54",
    "speaker" : "Andy",
    "text" : "Yeah, and it it was like it was a blatant past appearance."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "It was, yeah.",
    "timestamp" : "01:06:54-01:06:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. So Patton got dragged down by uh molden who had a whole section the the next day's paper talking about how he didn't think it was an actual legit call. But uh he obviously didn't watch the replay because it was pretty blatant. He he got The ball was thrown a little bit too inside and he was playing inside technique. And so Patton tried to cut back inside to him and he just fucking straight up tackled his ass. Yeah. And uh I've never seen anybody celebrate harder. for getting a pass interference called than David Patton on that play. He was dancing like a motherboard. He was doing like a legitimate jig.",
    "timestamp" : "01:06:55-01:07:30"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:07:30-01:07:47",
    "text" : "Well, and it's funny too, because their uh their celebration after this game was reminiscent of every team that I think we hate. Like you remember when like the Broncos with like with Daniel the pass he's like freaking it was like the Super Bowl for them. This one"
  },
  {
    "timestamp" : "01:07:49-01:07:55",
    "text" : "Yeah, it's like the even the Ravens beating the Pagers this year with Lamar Jackson where they're taking the team photo after the game.",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh yeah, yeah. Come on.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:07:55-01:07:56"
  },
  {
    "timestamp" : "01:07:57-01:07:59",
    "speaker" : "Andy",
    "text" : "It's like this is this is the Pagers Super Bowl at this point."
  },
  {
    "text" : "Yeah, it's so funny, but of course it ends on a Vinateri field goal.",
    "timestamp" : "01:08:00-01:08:06",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:08:07-01:08:09",
    "speaker" : "Andy",
    "text" : "Alright, hang on a second. I gotta relocate for a second."
  },
  {
    "timestamp" : "01:08:10-01:08:19",
    "text" : "Oh boy. Well, this is embarrassing. Um, I apologize. No, you leave it in. Don't be a bitch.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Don't you tell him how to live my life? Yeah, that was fine.",
    "timestamp" : "01:08:20-01:08:22"
  },
  {
    "timestamp" : "01:08:25-01:08:35",
    "speaker" : "Mike Melo",
    "text" : "There's nothing wrong with technical difficulties. I don't know if you're grabbing a snack or something, what you're doing. I mean, I don't know where your hands are right now. I can't really see them."
  },
  {
    "text" : "I'm shifting to the living room. Shifting what? My whole setup to the living room so there I can go to bed. Could you hear me yell at you? No, but I'll make it.",
    "timestamp" : "01:08:36-01:08:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:08:48-01:08:58",
    "text" : "Okay, that's probably good. Uh we gotta keep this. We gotta keep some of this. You can't cut it out because that's that's BS. You gotta listen back to it. If it's too aggressive, cut it. But some of it could be good."
  },
  {
    "text" : "All right. Well, I I th I just didn't want to um skip over the fact that you were trying to just like end this game without talking about Brady on the next third down because I think this was probably well, I don't want to say the biggest Brady play, but it was kind of very Uh I don't know how to put it. This was kind of like me through it. It was a it was a third down. It's like third and three or something. It's like after the the pass interference. And the charges brought pressure from both sides. So it's a guy coming unblocked right into Brady's face. Another guy coming on his blind side who caught him like below the knees. And then the other guy like chopped him over the top. And he just like floated the ball over the the rusher to him and hit the ball. Oh you're right. Yeah.",
    "timestamp" : "01:08:59-01:09:45",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, it was a nice touch pass.",
    "timestamp" : "01:09:45-01:09:46",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because they were like right on the border of field goal range. Yeah. And Brady just like stood there and just waited to the last possible second, just like lofted it over the guy so that Falk could get the first down, and now they're like well within like middle of field goal range is like a forty something yard instead of like a fifty like a long fifty yarder. You are correct. And so that was just like the like the that beginning inkling of oh this Brady kid like he he doesn't get rattled at all like that just imagining like watching Drew Bledsoe in those situations for all these years",
    "timestamp" : "01:09:47-01:10:21"
  },
  {
    "text" : "Yeah, the greatest.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:10:21-01:10:22"
  },
  {
    "text" : "He would have handled that. Yeah, how how he would have handled that versus this kid who's what is this his second official start? This third game. Yeah. So it's just that kind of like this was I think the it's just those little plays like that where you think, oh, this this kid might be all right.",
    "speaker" : "Andy",
    "timestamp" : "01:10:22-01:10:42"
  },
  {
    "timestamp" : "01:10:43-01:10:55",
    "speaker" : "Mike Melo",
    "text" : "But yes, that ended up not being uh so bad. There's all that whole 10-year gap where we didn't win anything, and I'm really pissed off about that, which maybe Bledsoe could have closed the gap. Yeah, I don't know. But maybe he's all right."
  },
  {
    "timestamp" : "01:10:56-01:11:02",
    "speaker" : "Andy",
    "text" : "Uh but yeah, so that does lead to the field goal you so desperately want to get to."
  },
  {
    "text" : "Yeah, man, Vinateri all the way.",
    "timestamp" : "01:11:02-01:11:04",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Redeems himself. Money. And they also kicked the field goal on third down, if you remember.",
    "timestamp" : "01:11:04-01:11:11"
  },
  {
    "timestamp" : "01:11:12-01:11:18",
    "speaker" : "Mike Melo",
    "text" : "They did. Yeah. Just in case. It was another tactic by Bill. And the announcers were crapping themselves over."
  },
  {
    "speaker" : "Andy",
    "text" : "They had no idea what to do about it. They're like, Well, it's kicking off third down. What is going on here? Then they didn't obviously understand why.",
    "timestamp" : "01:11:19-01:11:27"
  },
  {
    "text" : "Well, you know what's funny? Like it's in in the um You know, those those newspaper columns where they would have like sort of like who's better on what side of the ball for everything. The Patriots were always negative on everything except for coaching. And it was always edge Patriots. And I feel like because at that time Belichick wasn't outside of being a defensive guy for the Giants, I mean he was okay. Yeah. Um but he always won the edge, and now I'm realizing it's because nobody knew what the hell he was ever doing. So it must be true.",
    "timestamp" : "01:11:28-01:11:54",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:11:54-01:12:23",
    "speaker" : "Andy",
    "text" : "So true, yeah. Yeah, he always comes up to this like one r like bullshit thing that everybody's like, What well what is he doing here? Oh my god, it's the genius of Belichick again. 'Cause he like he really hadn't proven himself at this point. He had had that stint with the Browns where he'd done okay and then he had his uh defensive game plan for the Super Bowl when he was on the Giants as the defensive coordinator in the uh football hall of fame, but as a head coach he wasn't like this He didn't I don't think he had that genius label yet."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "No. And I mean he went, yeah, the five and eleven. I mean, it it shouldn't really garner that much. Yeah. He uh he definitely uh he always edged them out according to the announcers in the uh the media, um which I guess was smart for once. Yeah, no, it was a hell of a game, man. Uh I enjoyed it. Um and it was also weird that going into the game And I guess after this game, so the going into the game, they had a nine game winning streak versus the Chargers dating back to nineteen seventy. Yes. So Chargers of all teams. I know, it's so funny. And they they kept it going, so ten straight. So that was pretty great. Yeah, eat that's San Diego.",
    "timestamp" : "01:12:24-01:13:09"
  },
  {
    "text" : "Yeah, San Diego is you've got your weather, but we've got our ten game winning streak, you fuckers.",
    "timestamp" : "01:13:10-01:13:17",
    "speaker" : "Andy"
  },
  {
    "text" : "All right, yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:13:17-01:13:18"
  },
  {
    "timestamp" : "01:13:18-01:13:21",
    "speaker" : "Andy",
    "text" : "I mean it's a toss up."
  },
  {
    "timestamp" : "01:13:24-01:13:45",
    "speaker" : "Mike Melo",
    "text" : "Now uh you know we we've reached the end of the game here and we did not really talk about I mean we we talked a little bit about it, but we haven't really pointed out the announcers as opposed to um previous games and I thought they were so professionally boring. that they were tolerable but I was annoyed that I couldn't get anything out of them."
  },
  {
    "timestamp" : "01:13:46-01:13:54",
    "speaker" : "Andy",
    "text" : "Yeah, I had one quote and that was it. But um the one thing I'd like to start off by saying is, buddy, your name is Ian, not Ian."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I know, Ian Eon, I wrote it as I. 'Cause uh I you know, I want to be accurate here. No, but it's spelled Ian. It is spelled Ian. Ian Eagle and Solomon Wilcotts. Yes.",
    "timestamp" : "01:13:55-01:14:06"
  },
  {
    "text" : "Which is Solomon Wilcotz is a fantastic name. Every time I see that name, I think apricots, and I don't know why, but I feel like like I was I just I I picture How do you pronounce that apricots?",
    "timestamp" : "01:14:07-01:14:21",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:14:22-01:14:23",
    "speaker" : "Mike Melo",
    "text" : "Apricots, huh?"
  },
  {
    "text" : "How do you pronounce it?",
    "speaker" : "Andy",
    "timestamp" : "01:14:24-01:14:24"
  },
  {
    "text" : "It's a bold, bold.",
    "timestamp" : "01:14:24-01:14:25",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:14:26-01:14:26",
    "speaker" : "Andy",
    "text" : "Apricots?"
  },
  {
    "text" : "I go with apricots.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:14:27-01:14:28"
  },
  {
    "text" : "Do you?",
    "timestamp" : "01:14:28-01:14:29",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. Apriot sounds a little pretentious.",
    "timestamp" : "01:14:29-01:14:31",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, growing up, 'cause m you know, my parents from England, so they always pronounce things funny. So like it was it was yogurt instead of yogurt, and I got a whole bunch of shit for that. It's cool.",
    "timestamp" : "01:14:31-01:14:42"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh yeah. Apricots is like at least reasonable.",
    "timestamp" : "01:14:42-01:14:46"
  },
  {
    "timestamp" : "01:14:46-01:14:55",
    "speaker" : "Andy",
    "text" : "That's what I I I yeah, I gotta go with the long A's and the long vowels because that that's usually more American. So I don't actually know it. I'm I legit don't know if you're fucking with me or not."
  },
  {
    "timestamp" : "01:14:57-01:15:01",
    "speaker" : "Mike Melo",
    "text" : "I think I'm very well maybe apricots. I don't know."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:15:01-01:15:02",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:15:02-01:15:06",
    "speaker" : "Mike Melo",
    "text" : "I'm not Apricots. My parents are Portuguese, so I mean I'm not doing much better in this form."
  },
  {
    "timestamp" : "01:15:07-01:15:17",
    "speaker" : "Andy",
    "text" : "That's fair. But Apricot sounds too like This is how the English pronounce it, and you're gonna get shit on in third grade for saying it incorrectly. So I'm going with apricots. Okay. Fair enough."
  },
  {
    "text" : "Go on.",
    "timestamp" : "01:15:17-01:15:17",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "But uh I had one comment from them. They were talking about uh meeting Ladanian Tomlinson for the first time. I don't know which one it was that said it. Um, but he said, I was very surprised with the size of his lower body. Oh. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:15:18-01:15:33"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I feel like that could be a football football term. But I do know what that one means. So it wouldn't be a question for you, but bringing that up.",
    "timestamp" : "01:15:33-01:15:41"
  },
  {
    "timestamp" : "01:15:42-01:15:46",
    "speaker" : "Andy",
    "text" : "I I think he he did eventually clarify that he was talking about his his thighs."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Cleaner.",
    "timestamp" : "01:15:46-01:15:47"
  },
  {
    "timestamp" : "01:15:48-01:15:50",
    "speaker" : "Andy",
    "text" : "What? Yes. Yes."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, his like groin region.",
    "timestamp" : "01:15:50-01:15:52"
  },
  {
    "text" : "Yeah, okay, just the lower body in general. It was all very big.",
    "speaker" : "Andy",
    "timestamp" : "01:15:52-01:15:56"
  },
  {
    "text" : "Yeah. Oh, oh, I see. Okay, so that was football. I I thought he meant it the other way, which is kind of weird because the other guy was laughing too. I don't know. But that does bring me um to the next thing where I didn't think I was going to have enough terms that I didn't understand, but I got a couple. Oh you did, okay. You know, for a little bit of and you know, I'm assuming we're gonna run out of these things that I don't know because I I usually know a lot.",
    "timestamp" : "01:15:56-01:16:21",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "But you're learning, yeah. So you'll you'll know them from here on out.",
    "timestamp" : "01:16:21-01:16:24",
    "speaker" : "Andy"
  },
  {
    "text" : "So I don't know if this is ever gonna come back, but for now we got another football and out football going on here. Um And let me uh you know like I said, I'm gonna throw out a couple of things that I don't quite get. I did get the lower body thing. Well, I've thought that I did until you clarified, but Um if you could just clarify these things for me, explain it to the people out there. Um typical terms, but um so The first one is carrying the load. Carrying the load.",
    "timestamp" : "01:16:24-01:16:55",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:16:57-01:17:01",
    "speaker" : "Andy",
    "text" : "That Is technically football, yes."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Okay, so what does that mean?",
    "timestamp" : "01:17:01-01:17:02"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:17:03-01:17:20",
    "text" : "I th I think it's um oftentimes when running backs tend to get uh a higher workload. Uh and and that the team is kind of running through them and they're getting into a rhythm. The the running back is said to be carrying the load Oh, I see. Carrying the team on their back, sort of thing. Gotcha."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh, so wait, could a quarterback carry the load as well, or does that not apply?",
    "timestamp" : "01:17:21-01:17:25"
  },
  {
    "timestamp" : "01:17:25-01:17:37",
    "speaker" : "Andy",
    "text" : "It probably could, but it's it tends to be used in um with running backs for some reason. Okay. Probably because they're dragging people around on their backs as well. So it's also like a physical carrying of a load. Gotcha."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:17:37-01:17:46",
    "text" : "Um all right, so that makes sense. Um next one here is um taking it right up in there. Oh"
  },
  {
    "speaker" : "Andy",
    "text" : "I can see how that could be confused as a football term.",
    "timestamp" : "01:17:50-01:17:53"
  },
  {
    "text" : "Okay. Wait, so you're saying it's not football on this one?",
    "timestamp" : "01:17:54-01:17:57",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:17:59-01:18:01",
    "text" : "I'm more on the fence with this one."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:18:01-01:18:02",
    "text" : "Taking it right up in there."
  },
  {
    "speaker" : "Andy",
    "text" : "I think I wasn't sure. I think there's some context around that that would probably be pretty valuable.",
    "timestamp" : "01:18:02-01:18:08"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well that's that's true. I didn't write down what came before or after, so I'm not really sure. It just kind of threw me off because I hadn't heard of the term before.",
    "timestamp" : "01:18:08-01:18:15"
  },
  {
    "timestamp" : "01:18:15-01:18:29",
    "text" : "I I'm wondering if you had the wrong tab open for that one. Oh. No, no. Well, what do you mean by that? Um I mean I I think that um you may have been on a site that was uh a black background with some yellow yes I was.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:18:29-01:18:49",
    "text" : "Yeah Yeah. But I don't know. So we're gonna say not football on that one. Yeah, we're yeah, we're that's a gray area, I think. We're we're gonna yeah. Put that somewhere in the middle. This one I'm pretty certain of what it is, but the next one was getting excited every time he touches the ball. And like, I think that's football."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:18:49-01:19:07",
    "text" : "Well, who are they talking about? I can't I don't know. I gotta do a better job about this because Because because that I I think that would um greatly explain whether it was or wasn't f football. Because if we're talking about let's say Doug Flutie, then that's probably football. But if we're Talking about um Drew Blood."
  },
  {
    "text" : "So in this case, then maybe not.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:19:08-01:19:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:19:09-01:19:09"
  },
  {
    "timestamp" : "01:19:09-01:19:40",
    "text" : "Oh, I see. Yeah, I gotta I gotta do it better with the with the context because I I'm not sure on that one. So we'll I don't know, that's if So um I got two more on this one. One of them is about Ladanian I wrote so we can context. Tomlinson only has one goal. one hole to go through. So Tom Lin's only has one hole to go through. And I think we were talking about last week Well what's it gaping holes and whatnot?",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Gaping holes and yeah and and squeezing through them or something.",
    "timestamp" : "01:19:41-01:19:43",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:19:44-01:20:00",
    "text" : "The tight holes or something. So I'm guessing, and this is like you said, just learning as we go. Um He only has one hole to go through is when the linemen aren't doing that great of a job or something. And like yeah, you walk me through this one. I think it's something like that.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:20:00-01:20:08",
    "text" : "No, I th I think you're on the right track. And it it might even be like uh play call specific as well where There's only one specified hole that's trying to be blocked open.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh, okay. So it it was designed that way.",
    "timestamp" : "01:20:09-01:20:12"
  },
  {
    "text" : "Yes, and I I and I don't think it's um anything to do with whoever he's Izzor isn't dating as well and and how she feels about that sort of stuff.",
    "timestamp" : "01:20:12-01:20:20",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:20:21-01:20:28",
    "text" : "Oh. In this case. What do you think he's into? Like in that respect. If we're talking about that, I don't know. I don't know if you've ever talked to you.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:20:29-01:20:32",
    "text" : "Uh humiliation sort of things."
  },
  {
    "timestamp" : "01:20:32-01:21:00",
    "speaker" : "Mike Melo",
    "text" : "So just just a wild guess. What? Uh he's on the receiving end of this? I could see that, yeah. Okay. All right, yeah, I don't know. That's not here nor there, but I think it's a a lineman issue thing. And then finally, um this one the announcer said, and again, I don't have context on what the hell he was talking about, so I apologize. Well we'll try to figure it out anyway All right, he says, I want to be one of the eight men in the box."
  },
  {
    "timestamp" : "01:21:00-01:21:02",
    "speaker" : "Andy",
    "text" : "Oh boy."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And that that one that really like perked my ears up a little bit. So is that football or not football?",
    "timestamp" : "01:21:02-01:21:08"
  },
  {
    "timestamp" : "01:21:08-01:21:20",
    "speaker" : "Andy",
    "text" : "You listen to these games different than most people. I'm just curious. Um I I I there is a box in football."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Okay.",
    "timestamp" : "01:21:20-01:21:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Um and there do happen to be men in that box. So I think in this case that would be football. There can be up to eight, yes.",
    "timestamp" : "01:21:20-01:21:27"
  },
  {
    "timestamp" : "01:21:27-01:21:27",
    "speaker" : "Mike Melo",
    "text" : "Oh."
  },
  {
    "timestamp" : "01:21:27-01:21:33",
    "speaker" : "Andy",
    "text" : "It's usually how many defenders are are in that box, which is with within a few yards of the line of scrimmage."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:21:34-01:21:38",
    "text" : "Oh, I gotcha. Okay. And then towards the alignment again."
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, yeah. Oh yeah. A lot of these are uh the trenches, as they call it. Yes, exactly.",
    "timestamp" : "01:21:38-01:21:43"
  },
  {
    "timestamp" : "01:21:44-01:21:51",
    "speaker" : "Mike Melo",
    "text" : "Okay. No, that makes sense. So that's all I got. I'll try to have more context if any of these things pop up in the future. That'd be beautiful."
  },
  {
    "text" : "Yeah. Yeah, that's a great that's a great segment. I love it. Well thank you. I uh I I'm learning a lot. Good. Good. That's that that's what we're here for. We want to uh share our knowledge of football and our love of football with with the greater population. So I appreciate you bringing these these things and being so vul vulnerable and you know saying that you don't know things and and bringing that to the the forefront.",
    "timestamp" : "01:21:51-01:22:12",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:22:12-01:22:15",
    "text" : "Yeah, it's not my forte, but I'm I'm trying to work on it."
  },
  {
    "timestamp" : "01:22:15-01:22:16",
    "speaker" : "Andy",
    "text" : "So I appreciate that."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:22:17-01:22:18",
    "text" : "I appreciate that as well."
  },
  {
    "text" : "All right. So so with that being said, how about we get into our best and worst to wrap this up?",
    "timestamp" : "01:22:18-01:22:23",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "All right.",
    "timestamp" : "01:22:23-01:22:24"
  },
  {
    "text" : "That sounds good to me. Did you want to go first?",
    "timestamp" : "01:22:24-01:22:27",
    "speaker" : "Andy"
  },
  {
    "text" : "Um well uh I also wanted to uh talk a little bit about um just the little thing that I found out about Troy Brown and Terry Glenn. Before we get into that. Um and it was basically, well, Terry Len, I don't know if he says things to be abrasive or not, but it's just interesting the the little sound bites that like you know I I found. But When after the game he was talking about braiding and they were like, you know, how do you think he did or whatever? And he said, he's young and wants to prove himself. That's an advantage for us. Uh he might not have tried some of the plays that he did if he was eight or nine years in. I was wondering, is that a shot at Drew? I don't know. I mean it's I don't think he would say that, but it it just kinda came off as like you're kinda throwing him on the bus a little bit.",
    "timestamp" : "01:22:28-01:23:16",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "I think it was more as like he's too stupid to know better is what it feels like.",
    "timestamp" : "01:23:16-01:23:20"
  },
  {
    "text" : "Okay, yeah, I wasn't trying. I think he was trying to say the right thing and it came off a little bit weird. Yeah. Um, and then the other thing that I thought was funny was that apparently uh Terry Glenn threw his uh you know Tom Brady's first touchdown pass, the football, into the stands. Of course he would. Right. So it's shows you uh both personalities there. But yeah, best of the worst here. Yeah. Um I mean we've talked quite a bit about everything. Um, but I would say one thing that we did not talk about is uh Antoine Smith didn't have a great game. I think he had like 30 or 40 yards rushing or whatever, but he did have a touchdown. It was in the the third, it was on uh the goal line. And um, you know, he was running up the middle basically. And Junior Seao, it was one of those that he timed perfectly like you were talking about. Yeah. And he he just pops. uh Antoine Smith. Um head off. Yeah, and he falls back like two or three yards. And then somehow ducks under a couple of people flying at him. And then dives for the touchdowns.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:23:20-01:24:26"
  },
  {
    "timestamp" : "01:24:27-01:24:39",
    "text" : "Yeah, it doesn't fall over on that Seo hit, which I don't think has ever happened. Like, did you see Seo's reaction? He was like, how the hell did that guy knock? Yeah. Yeah. He was He was celebrating that he tackled him for a two-yard loss and he ended up scoring a touchdown from it.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, no, that was pretty badass.",
    "timestamp" : "01:24:39-01:24:41"
  },
  {
    "timestamp" : "01:24:41-01:24:43",
    "text" : "Um that was actually gonna be my best as well.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh really? Oh that's why um and then the uh Uh well, I mean then I guess that my second best was uh Lidanian's Fumble recovered by Brian Cox because fuck him. Um and uh my worst is Uh and I'm gonna have to change this one because it was everything that Lee Johnson did, but now that we established that he he made Brady the hero that he is, I'm gonna I got no worst.",
    "timestamp" : "01:24:44-01:25:12"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:25:14-01:25:17",
    "text" : "I love it. Always looking on the bright side. That's that's beautiful."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. I like it.",
    "timestamp" : "01:25:17-01:25:18"
  },
  {
    "text" : "All right. Uh my best was um Well, I guess I'm gonna switch it up uh to an observation that I that I noticed that um Doug Flutie throwing a football to Tim Dwight. That has got to be the the shortest connection in the history of football, correct?",
    "speaker" : "Andy",
    "timestamp" : "01:25:19-01:25:38"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:25:39-01:25:41",
    "text" : "Do you mean height-wise?"
  },
  {
    "text" : "Yes. They're both 5'9. And I don't I can't think of Unless Drew Brees is but no we already established Drew Brees is super tall.",
    "speaker" : "Andy",
    "timestamp" : "01:25:41-01:25:50"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Kyler Murray maybe throwing to some I mean Russell Wilson is what 5'11 I think so Yeah yeah he's Yeah five nine.",
    "timestamp" : "01:25:50-01:25:59"
  },
  {
    "text" : "I mean I mean two five nine two five nine white guys connecting on a on a uh a successful forward pass in the NFL two thousand one, I think is",
    "timestamp" : "01:25:59-01:26:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I have no commentary. I don't know what what um I mean uh I don't even know what to say about that. Look, I you know I have no comment on height, I have no comment on",
    "timestamp" : "01:26:11-01:26:21"
  },
  {
    "timestamp" : "01:26:22-01:26:31",
    "speaker" : "Andy",
    "text" : "Yeah, I just I um it's just something that you don't see very often. You don't see it. We we we got the anomaly."
  },
  {
    "text" : "We can agree, we can agree that it is an anomaly.",
    "timestamp" : "01:26:31-01:26:35",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "I okay. Well I'll take that.",
    "timestamp" : "01:26:35-01:26:37"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I like that. Okay. That makes sense.",
    "timestamp" : "01:26:37-01:26:39"
  },
  {
    "timestamp" : "01:26:39-01:27:14",
    "speaker" : "Andy",
    "text" : "That was my best just being able to see that. Um and my worst is um watching the Chargers kickoff team uh celebrating as if they've won the game making a tackle on a kickoff that got returned back to the 35-yard line. It's just so typical Chargers. And I was like getting pissed off that the Patriots are doing sack dance. on your field at the end of the game after beating you when they shouldn't have."
  },
  {
    "text" : "Oh yeah. That is uh classic. It's just yeah you know wasn't that the uh game that he was also like riding the bike for like half the game I feel like it I've got to do.",
    "timestamp" : "01:27:14-01:27:24",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:27:24-01:27:42",
    "text" : "No, that was two thousand cards. Yeah, that was two thousand seven where he he went in and him and uh Whoever the quarterback was. I think it was Philip Rivers at the time, wasn't it? It was Philip, yeah, actually. Yeah. And both of them were injured and Ladanian Thomas had one rush and then sat the rest of the game out like under his like big jacket because it was too cold for him."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's right. Yeah, yeah. So different. But yeah, they're all every L you know, Ladanian Thomason game with the Chargers and the Patriots ended pretty much the same way. It sure did. That's right.",
    "timestamp" : "01:27:43-01:27:54"
  },
  {
    "timestamp" : "01:27:55-01:28:02",
    "speaker" : "Andy",
    "text" : "So yeah, but I think this is a quality game so far on our list of games to watch. This is probably number one for me of the ones we've watched so far."
  },
  {
    "text" : "I would definitely uh recommend",
    "speaker" : "Mike Melo",
    "timestamp" : "01:28:03-01:28:05"
  },
  {
    "text" : "Yeah, I mean I think this this goes on the board of should watch.",
    "timestamp" : "01:28:06-01:28:11",
    "speaker" : "Andy"
  },
  {
    "text" : "Hey, put it up. All right.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:28:12-01:28:13"
  },
  {
    "timestamp" : "01:28:13-01:28:14",
    "speaker" : "Andy",
    "text" : "But uh"
  },
  {
    "text" : "You know, if you find the a copy even with uh commercials, just sit through the early two thousand.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:28:14-01:28:19"
  },
  {
    "text" : "They were interesting, weren't they?",
    "timestamp" : "01:28:20-01:28:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "They're fantastic. Subject of the entertainer, baby. Someone buttalizer will be.",
    "timestamp" : "01:28:22-01:28:27"
  },
  {
    "timestamp" : "01:28:27-01:28:34",
    "text" : "By shaking them up by dancing because he's got a girl in his living room and then when she opens it, it sprays in her face.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's right. And then it's uh I I remember a few other Cedric commercials, so hopefully we get to see those too. Yeah.",
    "timestamp" : "01:28:34-01:28:41"
  },
  {
    "timestamp" : "01:28:43-01:28:53",
    "speaker" : "Andy",
    "text" : "All right. Well, I think that uh about wraps it up for week five of the 2001 season. Thanks for being here, Mike. It was a a joy to share this with you."
  },
  {
    "text" : "Yeah, it was really it was really fun. Like I said, I I'm I'm trying to be more vulnerable and open up and just say, you know what, man. appreciate you as a human being and while my time could be used for other things, it's not the worst thing in the world.",
    "timestamp" : "01:28:53-01:29:11",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "I agree. Yeah. And it's uh always a pleasure to to be able to to shoot the shit with you.",
    "timestamp" : "01:29:11-01:29:17"
  },
  {
    "timestamp" : "01:29:17-01:29:22",
    "speaker" : "Mike Melo",
    "text" : "So all right. See you went genuine. I was kind of I veered awful about working on it. But yeah, it's a good thing."
  },
  {
    "text" : "I disagree. It felt genuine to me, so I'll take it. Okay. All right. Well, until next week. What is next week? I don't even know. What are we looking forward to? Do you want to know? I don't wanna know. I'll I'll get off and you can tell them, but I'm I'm done. Uh the pages go visit the Indianapolis Colts. God damn. That's what you gotta look forward to. The Colts that they blew the doors off recently. That's true. Two weeks before.",
    "speaker" : "Andy",
    "timestamp" : "01:29:22-01:29:51"
  },
  {
    "timestamp" : "01:29:51-01:29:59",
    "text" : "I mean is Peyton Manning playing or Do you want me to tell you? No, I don't. You passed the test, buddy.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I got you. Yes, he is playing. Oh fuck. All right. That'll do it for this episode. We'll see everybody next week if you're still with us. All right.",
    "timestamp" : "01:30:00-01:30:11",
    "speaker" : "Andy"
  },
  {
    "text" : "Sounds good. See you later, man.",
    "speaker" : "Mom",
    "timestamp" : "01:30:11-01:30:13"
  },
  {
    "speaker" : "Andy",
    "text" : "Bye. Bye.",
    "timestamp" : "01:30:13-01:30:14"
  }
]