[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid. Stupid. You still want to listen? Go right ahead. I am not your mother.",
    "speaker" : "Mom",
    "timestamp" : "00:00-00:19"
  },
  {
    "timestamp" : "00:21-00:47",
    "speaker" : "Andy",
    "text" : "Alright, welcome back to the Pagets Dynasty Podcast. Uh this isn't really this is a bit of a departure from what we've been doing normally. It's the bye week in 2001 for the Patriots, so we thought we would do our own little bye week episode. So uh we still have everybody with us today. Gentlemen, how are you how are you handling? How are you holding up with everything going on right now in the world?"
  },
  {
    "timestamp" : "00:47-00:50",
    "speaker" : "Greg",
    "text" : "I'm sitting pretty. I'm a lobby."
  },
  {
    "text" : "Yeah. Well you sounding pretty.",
    "timestamp" : "00:50-00:52",
    "speaker" : "Andy"
  },
  {
    "text" : "I wish we could quarantine all the time.",
    "speaker" : "Greg",
    "timestamp" : "00:52-00:56"
  },
  {
    "text" : "Yeah, so who knows when this is coming out? Probably Maybe. Still in quarantine.",
    "speaker" : "Andy",
    "timestamp" : "00:57-01:03"
  },
  {
    "text" : "Should we predict when the quarantine will end?",
    "speaker" : "Greg",
    "timestamp" : "01:06-01:08"
  },
  {
    "text" : "Yeah. Yeah. And as well if this is in in the future. Date today is March 20th.",
    "speaker" : "Steve",
    "timestamp" : "01:08-01:14"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, so this is it we as you can probably hear in our voice is still the beginning. This is the first week of quarantine for most of us, I think. We still have hope left. So Steve, what is your prediction for when this will end?",
    "timestamp" : "01:14-01:27"
  },
  {
    "text" : "I'm gonna say May 12th.",
    "timestamp" : "01:27-01:31",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:33-01:39",
    "text" : "Yeah, right. Seems like you put some some thought into that. I was just gonna pick a uh number at random, but alright.",
    "speaker" : "Andy"
  },
  {
    "text" : "So I did I just picked the number at random.",
    "speaker" : "Steve",
    "timestamp" : "01:39-01:41"
  },
  {
    "text" : "Oh okay.",
    "timestamp" : "01:42-01:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Like longer than I think, but before my birthday. All right, all right.",
    "timestamp" : "01:43-01:47"
  },
  {
    "speaker" : "Greg",
    "text" : "So you think we're going back to work on a Wednesday, Steve? Fucking idiot.",
    "timestamp" : "01:47-01:53"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:54-01:56",
    "text" : "All right, Greg, your turn then."
  },
  {
    "text" : "I'm saying uh July sixth. So after the fourth, we're all coming back.",
    "speaker" : "Greg",
    "timestamp" : "01:56-02:02"
  },
  {
    "text" : "You think so?",
    "timestamp" : "02:03-02:03",
    "speaker" : "Andy"
  },
  {
    "text" : "Yep. That's a long time. Sure is, dude. All right. We gotta flatten the curve.",
    "timestamp" : "02:04-02:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "02:10-02:14",
    "text" : "That's true. That's what they say. Yeah."
  },
  {
    "timestamp" : "02:14-02:16",
    "text" : "I've been reading a lot of internet.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Mike, what do you think?",
    "timestamp" : "02:20-02:22"
  },
  {
    "text" : "Well, um it depends, you know, because they have the uh they have this vaccine now, I think, for malaria that's supposedly doing some things, but I hear on the low that there's some side effects. So if they started injecting people with this stuff and then like two weeks later other stuff is happening, that will definitely sway things. So I'm guessing Nine weeks from now. Whatever that is. Alright.",
    "speaker" : "Mike Melo",
    "timestamp" : "02:23-02:48"
  },
  {
    "timestamp" : "02:49-02:51",
    "speaker" : "Greg",
    "text" : "What are the side effects, Mike? Do you know?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I think it's increased heart rate and having like if you have some type of heart condition or something, it's pretty much not good.",
    "timestamp" : "02:52-02:59"
  },
  {
    "text" : "And if you have an erection for more than four hours, you should probably call a doctor.",
    "timestamp" : "03:00-03:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "03:04-03:09",
    "text" : "They have said that, but I don't know if it's common knowledge."
  },
  {
    "timestamp" : "03:09-03:11",
    "speaker" : "Andy",
    "text" : "Oh that's that's a different drug?"
  },
  {
    "text" : "Uh it might be the same. I don't know what the fuck is that. Does that f fight off the corona maybe? I bet you they haven't even tried.",
    "timestamp" : "03:11-03:19",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:20-03:21",
    "text" : "It fights off a lot of things."
  },
  {
    "text" : "Alright. Well, somebody should tell Trump to give it a shot. Oh, he's tried it.",
    "timestamp" : "03:22-03:28",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "It might be a good time to try boner pills, you know? You stuck it on.",
    "speaker" : "Greg",
    "timestamp" : "03:30-03:34"
  },
  {
    "text" : "Lotta babies.",
    "speaker" : "Mike Melo",
    "timestamp" : "03:35-03:36"
  },
  {
    "text" : "Yeah. Or just yank it off if you're single. I don't know. Yeah.",
    "timestamp" : "03:37-03:40",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "03:41-03:47",
    "text" : "You think that this is gonna be another like boom, like a a baby boom? Two to three months of lockdown."
  },
  {
    "speaker" : "Greg",
    "text" : "Well, here's the other side is if you're stuck with your significant uh other for all day, could get sick of them. Might have the op might have the opposite effect.",
    "timestamp" : "03:47-03:57"
  },
  {
    "timestamp" : "03:58-04:04",
    "speaker" : "Steve",
    "text" : "Spike in divorces. Divorces and think about that."
  },
  {
    "text" : "Man, what's gonna happen to the the our society? Alright, who else has got some dates?",
    "timestamp" : "04:04-04:13",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I think we're not going to have this lifted until November 2020. What?",
    "speaker" : "Andy",
    "timestamp" : "04:13-04:21"
  },
  {
    "text" : "Oh boy.",
    "speaker" : "Mike Melo",
    "timestamp" : "04:21-04:23"
  },
  {
    "timestamp" : "04:23-04:24",
    "speaker" : "Andy",
    "text" : "Monday, November second."
  },
  {
    "text" : "Dude, this fine Damn",
    "speaker" : "Mike Melo",
    "timestamp" : "04:25-04:27"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:29-04:38",
    "text" : "And I'm only saying that because I'm still bitter about the Tom Brady news. And if that happens, if it's November, then I think the football season will have been canceled. So"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "04:39-04:49",
    "text" : "What are the odds that we finish this podcast, the whole dynasty, before the quarantine's over? Um 83%. Thousand to one odds."
  },
  {
    "timestamp" : "04:50-04:53",
    "speaker" : "Andy",
    "text" : "The whole the whole thing? Every season? Yep."
  },
  {
    "text" : "Oh. Well, we just discussed there's no end of the Patriots dynasty yet, so who knows? And if there isn't full of the case, we've got to be able to do that.",
    "timestamp" : "04:54-05:01",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:03-05:13",
    "text" : "Wait, did we decide it isn't it hasn't ended or it has? I think it was it was a split decision. It has not. I don't know. I don't know."
  },
  {
    "timestamp" : "05:13-05:22",
    "text" : "But if if football doesn't come back being recorded because Stidum wins the Super Bowl, we can go back here and you'll have egg on your face, brother.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "05:23-05:26",
    "text" : "This is true. When this gets released in November 2020.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Hey, it's in the archives, man.",
    "timestamp" : "05:26-05:28"
  },
  {
    "speaker" : "Andy",
    "text" : "So there are 361 games so far. in this since uh imagine if at some point if we get desperate we'll go back to the 2000 season. So three hundred and sixty-one games. So we could record an episode every day. And be here this time next year. Still releasing episodes.",
    "timestamp" : "05:28-05:48"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I was talking to you guys. That's a no for me. Yeah. Me too.",
    "timestamp" : "05:50-05:54"
  },
  {
    "timestamp" : "05:55-05:57",
    "text" : "I'll think about it.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "05:58-06:01",
    "text" : "Well I'll be here because fuck you guys",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "06:03-06:07",
    "speaker" : "Mike Melo",
    "text" : "I don't know what it would sound like with uh you doing everything. Just me? Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:08-06:09",
    "text" : "It would it wouldn't be great. I don't think it's a good thing."
  },
  {
    "text" : "It could be. I mean you have a lovely voice. I've often said that.",
    "timestamp" : "06:09-06:12",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "06:12-06:16",
    "speaker" : "Andy",
    "text" : "ASMR. It it would probably turn into that, yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "You got a real face for radio, Andy. Oh boy.",
    "timestamp" : "06:16-06:19"
  },
  {
    "timestamp" : "06:20-06:21",
    "speaker" : "Andy",
    "text" : "Good job we're related."
  },
  {
    "timestamp" : "06:23-06:25",
    "text" : "Well he has a different face, Andy. But I see where you're where you're getting.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "It's not a better face.",
    "timestamp" : "06:26-06:27",
    "speaker" : "Andy"
  },
  {
    "text" : "I didn't say it was.",
    "timestamp" : "06:28-06:29",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I'm just saying. I know. I'm just I'm just letting everybody else that that hasn't met us know it's not a better face. I think we've already decided weeks ago that the only person that doesn't have a face for radio was Mike and his beautiful haircut.",
    "speaker" : "Andy",
    "timestamp" : "06:29-06:45"
  },
  {
    "timestamp" : "06:46-06:58",
    "text" : "Well. Oh, right, right. I'm the pretty one of the family. Pretty ugly. Dude, Mike told me he looked like Tom Brady. That's true. On air. That's on record. Guilty.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but I think it's on PCP though, so I don't know about that.",
    "timestamp" : "06:58-07:03"
  },
  {
    "timestamp" : "07:04-07:08",
    "text" : "I believe that may have been scratched from the record, Andy. We'll have to talk about that.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I didn't know you like to get wet.",
    "timestamp" : "07:11-07:13",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I don't know what that means, so next topic.",
    "timestamp" : "07:14-07:17"
  },
  {
    "text" : "All right. So um Because this is the the bye week, I kind of wanted to do a little bit of, you know, what the patrons would do. Wanna look internally, just briefly, kind of do some self-scouting as it were. So a couple things I just want to bring to your attention for our analytics. Which may only be exciting to us, but uh in all transparency, we have officially gone over a hundred listens for an episode. It happened this week, so a single episode? One episode has a hundred and six. The first episode has a hundred and six listens.",
    "speaker" : "Andy",
    "timestamp" : "07:18-08:02"
  },
  {
    "speaker" : "Greg",
    "text" : "Wow.",
    "timestamp" : "08:02-08:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. One of them's not even me. It drops off every time.",
    "timestamp" : "08:03-08:07"
  },
  {
    "text" : "Yeah, I don't know if uh this is the best topic to go on air with, but uh you do you, man. Well they made it this far, dude.",
    "timestamp" : "08:10-08:18",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "That's what I'm saying, yeah. And so uh so congratulations for that. We've hit a hundred. Um and I've also been kind of generally keeping track of when we say stupid shit we don't know the answer. So I went back and tried to look some of that shit up. Um I know it's not complete because I only did it sometimes when I felt it was super egregious, but um Some of the things that we have said, uh I have in here, I think we already debunked this, but Aaron Glenn is not in the Hall of Fame.",
    "timestamp" : "08:18-08:54"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Allegedly. We don't know.",
    "timestamp" : "08:55-08:56"
  },
  {
    "timestamp" : "08:57-08:57",
    "text" : "Aaron Glenn?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Terry Glenn.",
    "timestamp" : "08:58-08:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Terry Glenn is the first time. Yeah, lucky off he's not. Oh okay.",
    "timestamp" : "08:59-09:12"
  },
  {
    "timestamp" : "09:12-09:13",
    "speaker" : "Mike Melo",
    "text" : "It was worth a shot."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:13-09:22",
    "text" : "Wow, that was quick. Yeah. Um I believe we were also going back and forth on whether or not Terry Glenn got a Super Bowl ring. He did not."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "09:22-09:23",
    "text" : "What?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh give him one.",
    "timestamp" : "09:23-09:24"
  },
  {
    "timestamp" : "09:25-09:26",
    "speaker" : "Steve",
    "text" : "Confirmed, huh? Yeah, confirmed."
  },
  {
    "text" : "Oh my goodness.",
    "speaker" : "Mike Melo",
    "timestamp" : "09:27-09:28"
  },
  {
    "timestamp" : "09:28-09:36",
    "text" : "How'd you figure that out? Uh somebody told it to me, so I looked it up. And uh yeah, he did not get. I don't know where I found it, but he did not get one.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "09:36-09:39",
    "text" : "The fabric of the world just fell apart right now. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh we talked about Curtis Martin and his.",
    "timestamp" : "09:40-09:42"
  },
  {
    "timestamp" : "09:49-09:51",
    "text" : "You just like went underwater, yeah, and disappeared.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "My internet just oh really? Because I've been talking for ages.",
    "timestamp" : "09:54-09:57",
    "speaker" : "Andy"
  },
  {
    "text" : "Kelly, we're live. Oh what's the Sorry. Unbelievable. Unbelievable. This is what I'm talking about. We're not gonna make it. Kelly just walked in on a fucking happy hour live chat. Craig Brown's buck ass naked.",
    "speaker" : "Greg",
    "timestamp" : "09:57-10:14"
  },
  {
    "timestamp" : "10:17-11:24",
    "speaker" : "Andy",
    "text" : "What is it? Butthole naked? Wasn't that it? But something wild. What is that from? That's from uh incomito. No, it was uh Gronk. Oh, so it wasn't Gronk. It was uh what's his name? The wide receiver from the Ravens. Oh yeah, Smith. Yeah, yeah. Saying somebody was butthole wide open. I don't remember what I'm saying. Yeah, he's the best. Yeah. Um you can tell I've been editing the Christmas one for too long. Because it's all on there. Uh let's see what else we talked about. We talked about Curtis Martin and his poison pill and his contract. And we did a horrendous job explaining it. So I looked it up a bit more. Basically, the poison pill was a clause in the contract that stated that Curtis Martin would become an unrestricted free agent after one year if the Patriots matched the offer. And the patrons would have been forced to pay like a $3 million roster bonus, which they wouldn't have been able to fit into the cap. So that was why they couldn't bring them back. That seems a bit more clear that time."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And now what was the is that what you were gonna say last time before you went underwater? Yes. Okay, cool.",
    "timestamp" : "11:24-11:31"
  },
  {
    "text" : "Um and also just a side note on that while I was looking that up, uh the Jets general manager Mike Tannenbaum. is regarded uh in many circles as the guy who fathered the idea of the poison pill. So of course it was a Jess invention.",
    "speaker" : "Andy",
    "timestamp" : "11:31-11:47"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean it's a smart move.",
    "timestamp" : "11:47-11:49"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "11:49-11:49",
    "text" : "It is"
  },
  {
    "text" : "That's a Belichick move too, you know? Yeah. You're so you're showing your bias again, Andy. You'd be like it's genius.",
    "speaker" : "Greg",
    "timestamp" : "11:50-11:58"
  },
  {
    "timestamp" : "11:58-12:04",
    "speaker" : "Mike Melo",
    "text" : "Of course, and I mean he exploits everything. So yeah, that definitely sounds like him. What are you talking about?"
  },
  {
    "text" : "They'd be like, oh the rules are the rules.",
    "timestamp" : "12:04-12:06",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Wait, Andy, can you just admit that Belichick has cheated before? Can you say that?",
    "timestamp" : "12:06-12:11"
  },
  {
    "text" : "Sure yeah. Well yeah, alright.",
    "speaker" : "Andy",
    "timestamp" : "12:12-12:14"
  },
  {
    "timestamp" : "12:14-12:18",
    "speaker" : "Mike Melo",
    "text" : "Alright, now we're on the same page. So he's growing. Okay. Whoa, okay."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, there you go.",
    "timestamp" : "12:20-12:21"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Alright, we're all on the same page. You're growing.",
    "timestamp" : "12:21-12:23"
  },
  {
    "speaker" : "Andy",
    "text" : "All right. Um in week four, I think it was just me and Mike talking about uh Sachs versus Tom Brady and the the leaders in that.",
    "timestamp" : "12:24-12:33"
  },
  {
    "timestamp" : "12:33-12:39",
    "speaker" : "Mike Melo",
    "text" : "And we talked about how um What uh what an episode that was, might I add."
  },
  {
    "text" : "Yeah, I think that was the Dolphins one, wasn't it?",
    "speaker" : "Andy",
    "timestamp" : "12:39-12:41"
  },
  {
    "timestamp" : "12:41-12:42",
    "text" : "I don't remember.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "12:42-12:46",
    "text" : "That was the game that we talked about how we would never watch that game again.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "12:46-12:50",
    "speaker" : "Mike Melo",
    "text" : "Oh, something just happened. Is everyone okay?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:51-13:13",
    "text" : "I think Steve now has coronavirus. Oh boy. So yeah, so we we fucked up some of the the numbers in that too. I'm not gonna bother correcting it. Steve, chill out. Right? What the fuck are you doing, Steve? God damn it Steve. You making a fucking pizza back there? No. I'm getting another beer. Cool. You want to make a little bit more noise while you do it?"
  },
  {
    "timestamp" : "13:14-13:15",
    "speaker" : "Steve",
    "text" : "You could hear that?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I was all there in my kitchen. Yeah, we can hear that. Andy thought you came down with something.",
    "timestamp" : "13:15-13:20"
  },
  {
    "text" : "Pretty sure you have coronavirus now.",
    "timestamp" : "13:21-13:23",
    "speaker" : "Andy"
  },
  {
    "text" : "Had it, already beat it. There it is.",
    "timestamp" : "13:24-13:27",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "13:27-13:35",
    "text" : "Oh boy. But Mike, in that episode we were talking about uh the number of people who lost their jobs due to the Patriots, if you recall.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "13:35-13:36",
    "text" : "Oh yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "And I came up with a real rough back of the envelope number. Did a little bit of research and I came up with in terms of coaches and quarterbacks in the AFC East, about 58 of them have lost their job due to the ongoing Pages dynasty. That's amazing. That's a lot.",
    "timestamp" : "13:37-13:57"
  },
  {
    "timestamp" : "13:57-14:00",
    "speaker" : "Mike Melo",
    "text" : "You think that Belichick feels bad about that?"
  },
  {
    "timestamp" : "14:03-14:05",
    "text" : "No comment. Okay.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "14:06-14:11",
    "text" : "Hey, I have something I have a quote from Terry Glenn about the ring. Did you see that?"
  },
  {
    "speaker" : "Andy",
    "text" : "No, let's hear it.",
    "timestamp" : "14:11-14:12"
  },
  {
    "timestamp" : "14:12-14:30",
    "speaker" : "Greg",
    "text" : "Twenty nine this is in twenty nineteen. He said, if they offer me one, I'll certainly accept it and keep it in my archives. It would be nice it would be nice to get one. Yeah. Wait, he said that in twenty nineteen? Oh, that's when the article was written. Oh no, never mind. Two thousand two. Yeah, I think I read that."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I was I was gonna say, I mean we're not gonna ruin that surprise, but yeah, we'll talk about Terry Glenn in a bit.",
    "timestamp" : "14:30-14:36"
  },
  {
    "timestamp" : "14:37-14:42",
    "speaker" : "Mike Melo",
    "text" : "That's some bullshit. So Putin gets a Super Bowl ring and Terry Glenn doesn't"
  },
  {
    "timestamp" : "14:43-14:45",
    "speaker" : "Andy",
    "text" : "Is that confirmed Putin has one?"
  },
  {
    "text" : "I I thought so.",
    "timestamp" : "14:45-14:46",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "14:46-14:54",
    "speaker" : "Andy",
    "text" : "I believe Putin kind of took it Right. Story. I think classic. Yeah, shocking."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "14:54-14:58",
    "text" : "I think it was an accident, Andy. I think it's a miscommunication language barrier."
  },
  {
    "timestamp" : "14:59-15:03",
    "speaker" : "Andy",
    "text" : "Perhaps. I'm guessing it probably wasn't. It was just blamed on that."
  },
  {
    "text" : "Do you think that's how your Glenn should have gotten one?",
    "speaker" : "Mike Melo",
    "timestamp" : "15:04-15:05"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:09-15:24",
    "text" : "Yeah, we'll talk about that in a minute. Uh the last thing that I had was When we had Connor on and we were talking all about kickers, he wanted to know kicker accuracy by distance and basically Goskowski is the more accurate kicker."
  },
  {
    "timestamp" : "15:25-15:28",
    "text" : "Ouch. That's what I said.",
    "speaker" : "Greg"
  },
  {
    "text" : "And then uh in the playoffs, they didn't have it broken down by distance, but Vinateri was a less accurate kicker in the playoffs too. Surprising. Really? That's surprising. Sure. He made 70s just over 76% of his field goals. Really? And Graskazis made 88%. Minateri didn't miss an extra point, but they were also from the two-yard line. You never missed one? Nope. Not in the playoffs. Oh, gotcha. He was 367 of 374 in the regular season, 98. 1%. Which is still just very slightly lower than Goskowski's 98. 3%. So Koskowski more accurate kicker just in general.",
    "speaker" : "Andy",
    "timestamp" : "15:28-16:17"
  },
  {
    "timestamp" : "16:19-16:20",
    "speaker" : "Steve",
    "text" : "In your face, Connor?"
  },
  {
    "speaker" : "Andy",
    "text" : "Indeed. So that's all I had. I just wanted to clear those things, get the uh just get some transparency here. We're not perfect. But we're working towards being so.",
    "timestamp" : "16:21-16:33"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "16:34-16:35",
    "text" : "No, we're not."
  },
  {
    "text" : "And if any of no we're definitely not. And if any of our listeners have anything else they want to talk about, um, Greg's email address is G D brown, something or other. You're gonna throw my email? Yeah. Yeah. If you have an issue with the podcast, email Greg.",
    "speaker" : "Andy",
    "timestamp" : "16:35-16:52"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "16:53-17:04",
    "text" : "Now, keep in mind that at R8, by the time you send us a question, it might take us three months to answer it on air, but hey, it'll be answered."
  },
  {
    "timestamp" : "17:04-17:09",
    "speaker" : "Andy",
    "text" : "Yeah. Or you can you can hit up Mike Mello on Twitter at, I don't know, Leave Me Alone."
  },
  {
    "timestamp" : "17:10-17:15",
    "speaker" : "Mike Melo",
    "text" : "Yeah, that's what it is. Just the old the old Twitter."
  },
  {
    "timestamp" : "17:19-17:45",
    "speaker" : "Greg",
    "text" : "Oh can I s can I sneak peek my uh Incognito, Jonathan Martin. I have a re I have relevant text from that. Sure. Jonathan Martin says, what's your address? To which incognito responds, one, two, three, four, go fuck yourself, place. He went with place. Yeah, how distinguished. One, two, three, four is the best part."
  },
  {
    "text" : "So yeah, so the set the second part of this was gonna be we're gonna do some deep dives. Because I think that's kind of also what the Patriots would do. They would take a a deeper look into their their own stuff. So this is one that I had set up. We have talked a lot about Terry Glenn, but we haven't really gotten into Terry Glenn, the person, the man, the myth, the legend. So I thought we would do a bit of a deep dive on him next. So Terry Glenn, Terry, Tyree Glenn, which I feel like is foreshadowing his middle name.",
    "speaker" : "Andy",
    "timestamp" : "17:48-18:24"
  },
  {
    "speaker" : "Steve",
    "text" : "Is that his middle name? His middle name is Tyree and his first name is Terry. Yes. Yeah, just verifying.",
    "timestamp" : "18:24-18:31"
  },
  {
    "timestamp" : "18:31-18:59",
    "text" : "Yes. Terry Tyree Glenn. That's tough. Born July 23rd, 1974, in Columbus, Ohio. That will come back to be important later. Um we talk a lot about I think football players coming from rough upbringings. I think we talked about you know, David Patton and Troy Brown like being super poor and having to like work the fields and stuff to to make ends meet for their family, things like that. Wait, what?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:59-19:10",
    "speaker" : "Mike Melo",
    "text" : "I thought he was like shipping coffee. Yeah, it's not he's not working on the fields. What are you talking about?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:10-19:11",
    "text" : "Troy Brown was."
  },
  {
    "text" : "Oh it wasn't. Yeah. Oh he wasn't. Yeah. Alright, cool.",
    "speaker" : "Mike Melo",
    "timestamp" : "19:12-19:15"
  },
  {
    "text" : "Greg, we have you ever farmed coffee? No. It's not as glamorous as you would think.",
    "timestamp" : "19:16-19:21",
    "speaker" : "Greg"
  },
  {
    "text" : "He was unloading trucks, man. What are we talking about?",
    "speaker" : "Mike Melo",
    "timestamp" : "19:21-19:25"
  },
  {
    "speaker" : "Andy",
    "text" : "Troy Brown?",
    "timestamp" : "19:26-19:26"
  },
  {
    "timestamp" : "19:27-19:30",
    "speaker" : "Mike Melo",
    "text" : "I don't know. Uh the other guy. David Patton. David Patton, yeah."
  },
  {
    "timestamp" : "19:31-19:32",
    "speaker" : "Andy",
    "text" : "He was loading coffee on the truck."
  },
  {
    "text" : "Wait, Greg, while this guy's yapping away about nonsense, can you look that up, please? What do you want me to look up? Just Troy Troy Brown um before football job. Alright. Thank you. Did he write it?",
    "timestamp" : "19:32-19:51",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Uh it sa it sounded like he wrote it, yeah. Hmm. We had a really like how come I've never heard of this? Uh because you haven't read the book.",
    "timestamp" : "19:51-20:00",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I guess you're not a real Troy Brown fan. Guess you're not a real fan of the Browns.",
    "timestamp" : "20:01-20:04",
    "speaker" : "Steve"
  },
  {
    "text" : "I'm not and I never admitted to that.",
    "timestamp" : "20:05-20:07",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "This is true. In fact, he's admitted multiple times he's not a fan of of these Browns.",
    "timestamp" : "20:07-20:12"
  },
  {
    "timestamp" : "20:12-20:14",
    "speaker" : "Mike Melo",
    "text" : "I do love Troy Brown though."
  },
  {
    "timestamp" : "20:14-20:18",
    "text" : "Alright. Yeah, I'll uh I'll get you a copy of the book.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm giving I'm giving up on the stat check because uh apparently there's a Troy Brown in the MBA too.",
    "timestamp" : "20:19-20:24"
  },
  {
    "timestamp" : "20:25-20:31",
    "speaker" : "Mike Melo",
    "text" : "Yeah, it's really good. I don't take your word for it. Just seems like a little bit made up on your end."
  },
  {
    "timestamp" : "20:31-20:34",
    "speaker" : "Andy",
    "text" : "Alright, next next bye week we'll uh we'll do a deep dive on Troy Brady."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Before they made it.",
    "timestamp" : "20:35-20:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Ooh. Yeah.",
    "timestamp" : "20:37-20:38"
  },
  {
    "timestamp" : "20:38-20:41",
    "speaker" : "Mike Melo",
    "text" : "Did you know that Kurt Warner was uh was a bad boy?"
  },
  {
    "text" : "Yeah, did you did you know that Fitzpatrick went to Harvard?",
    "timestamp" : "20:41-20:45",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "20:46-20:46",
    "text" : "I didn't.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Wait, did he really? Didn't Antonio Gates play basketball? Really? I think so. Break breaking news. So anyway, back to Terry Glenn. This deep dive has gotten really deep so far. We know his middle name and when he was born. But uh his His his mom was um on welfare as far back as he can remember, apparently, and his father left when he was two.",
    "timestamp" : "20:46-21:16",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:16-21:20",
    "text" : "Dude, we're laughing here and you just come with that right after? Jesus.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh no, it gets it gets a little worse before it but it doesn't really get better. Um we'll see what you guys can do with this Uh so he never knew his father, and when Terry was thirteen years old, his mother was beaten to death by a man she had recently met. Holy shit. Wow. Yeah, so here's where yeah, here it is. Um she'd been killed on October 8th, 1987, beaten to death by a casual acquaintance who had been stalking her. Terry didn't need a judge or jury to tell him who was responsible. He knew. That damn fat man. Kenneth Adams, now 33, was sentenced to 10 to 25 years after pleading guilty to involuntary manslaughter. So he didn't mean to. Terry Glenn says he liked her and she didn't like him. I guess that's why he did it. According to the article I found on people. com. So yeah, Glenn was 13 years old. He had a younger sister too, because he Like from uh it was like a stepsister, I think, uh, because he considered suicide, but then thought that uh there would be nobody to take care of his sister, so he didn't. So his sister went to live with her biological dad. Uh Terry Glenn bounced around between aunts and uncles and stuff for a few years before finally one of his friends' parents took him in. Um and it would they were like, you know, friends and play football together and stuff like that. And uh basically was raised by these people and he says that football saved his life because otherwise like a lot of his friends are dead and stuff like that. So like dude had a rough a rough upbringing. I think he was obviously good at football. I think that's pretty pretty apparent by the rest of his career. But um He actually walked on at Ohio uh Ohio State, the Ohio State University. I think he got some other scholarships to play at like smaller places, but decided he was just gonna walk on there And at the time, um there was a guy who went on to play for the Oilers, who then turned the Titans, Chris Sanders. Uh another name you might recognize, Joey Galloway, for the starting. Wide receivers at Ohio State that you decided to just walk on at. Far key right Joey Galloway for I remember one Joey Galloway play. And it's a good one.",
    "timestamp" : "21:20-23:48"
  },
  {
    "speaker" : "Greg",
    "text" : "Did he even make it out of training camp?",
    "timestamp" : "23:48-23:50"
  },
  {
    "timestamp" : "23:50-23:55",
    "speaker" : "Andy",
    "text" : "He did, yeah. He made it a couple weeks into whatever the season that was. I want to say 06."
  },
  {
    "timestamp" : "23:55-24:00",
    "speaker" : "Mike Melo",
    "text" : "It was those dark years of can't make that team. I don't know."
  },
  {
    "speaker" : "Andy",
    "text" : "That's what I'm saying. Yeah. But it was uh I just remember Joey Galloway. I think he ran the wrong route and Brady just like tore into him the entire time they were walking off the field.",
    "timestamp" : "24:01-24:10"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "How many times is that gonna happen with his new teammates? Oh Too soon. We'll see. I know. I'm sorry. Soon. I can't help myself.",
    "timestamp" : "24:10-24:20"
  },
  {
    "timestamp" : "24:20-24:23",
    "speaker" : "Greg",
    "text" : "So can I give you a factoid real quick?"
  },
  {
    "timestamp" : "24:23-24:24",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Uh, because I was like, Columbus Ohio, is that even like a high crime rate? Apparently. Uh Columbus has one of the highest crime rates in America compared to all communities of all sizes.",
    "timestamp" : "24:24-24:36"
  },
  {
    "text" : "What really? Can you check on Lawrence Massachusetts please? Thank you.",
    "timestamp" : "24:36-24:40",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "24:45-24:52",
    "speaker" : "Andy",
    "text" : "It it's it's I'm sure it's on the list. So Mike, so you this is your brethren here, I guess. What you're saying, I I don't know."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "He seems like he's had a uh A harder life than than some. I will say that.",
    "timestamp" : "24:53-24:58"
  },
  {
    "speaker" : "Greg",
    "text" : "It saw uh it's it's lower than Columbus. Saw a fifteen percent decline in twenty seventeen.",
    "timestamp" : "24:58-25:06"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "It's getting better, Mike. Yeah. I'm really proud of it. I just want to thank everybody involved for cleaning out the community. Um I always knew that it was a beautiful place. Um and I'm just really happy to hear that, Greg. Thank you.",
    "timestamp" : "25:06-25:21"
  },
  {
    "text" : "I'm perfectly as it got better once Mike left",
    "timestamp" : "25:21-25:25",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:26-25:34",
    "speaker" : "Mike Melo",
    "text" : "Yeah, it was slowly uh you know getting better. I I think it was what was that, 20 years ago? Uh yeah, no, it's great to see that."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:35-25:37",
    "text" : "I was just blaming you for being shitty."
  },
  {
    "text" : "I know. But I've also like helped out in the community, but I don't like to brag about that, so I I have two. Lawrence?",
    "speaker" : "Mike Melo",
    "timestamp" : "25:37-25:45"
  },
  {
    "timestamp" : "25:45-25:51",
    "text" : "Yeah, I I purchased drugs from Lawrence as recently as five years ago. Oh right, man.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "25:52-25:54",
    "speaker" : "Steve",
    "text" : "Once Greg stopped purchasing drugs, boom."
  },
  {
    "timestamp" : "25:55-25:57",
    "speaker" : "Andy",
    "text" : "Yeah, see, yeah. Those numbers seem to correlate."
  },
  {
    "text" : "Dude, the La Town Brown.",
    "speaker" : "Greg",
    "timestamp" : "25:58-26:00"
  },
  {
    "timestamp" : "26:01-27:33",
    "text" : "Jesus. So yeah, back to back to our old friend Terry Glenn. Uh so he walked on Ohio State and then uh in his junior year all he did was set school records with 64 catches. hundred uh fourteen hundred yards and seventeen touchdowns, which is pretty phenomenal. Yeah, especially back then. Yeah, exactly. Uh and like his numbers were outrageous. Like his best game came against the University of Pittsburgh. Uh nine catches, 253 yards, which is a school record. I don't know if it still is. Can we fact check that, Greg? And his average was 28. 1 yards per catch. Four touchdowns. Oh, and a two-point conversion. So he was hot shit coming out. Who was throwing him the ball? Um it didn't say, but I bet we could Google it. I don't think it matters at Ohio State. Do they have they ever had a a real quarterback come out of Ohio State? Yeah, not really. I feel like they're all just like He said a real quarterback. Yeah, so I guess no is the answer. So that was uh that was his his college career. He was, you know Uh he did eventually get his um his degree from Ohio State. I don't know what in it didn't say, but um after his junior year he decided to declare for the the draft and he was drafted seventh overall. By your Michael New England Patriots back in 1996.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:33-27:43",
    "speaker" : "Greg",
    "text" : "Yo, I got a name for you. All right, give it to me. Ohio State quarterback, Tom Tupa. Which constantly 84 to 87."
  },
  {
    "text" : "Yep, and I didn't say anything, but uh when we get to Tom Tupa, I know that we'll we'll go over that nugget.",
    "speaker" : "Mike Melo",
    "timestamp" : "27:43-27:50"
  },
  {
    "text" : "Also like Tom's Zach.",
    "timestamp" : "27:51-27:52",
    "speaker" : "Greg"
  },
  {
    "text" : "All right. Also on the pack?",
    "timestamp" : "27:54-27:55",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "27:56-27:59",
    "text" : "Kirk Herb Street. He's an Ohio State guy."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:59-28:00",
    "text" : "The quarterback?"
  },
  {
    "timestamp" : "28:00-28:04",
    "speaker" : "Mike Melo",
    "text" : "Yeah. Wait, are these like literally like the biggest names?"
  },
  {
    "timestamp" : "28:04-28:12",
    "speaker" : "Andy",
    "text" : "Yeah, because none of these guys played with Terry Glenn. Who was it who was the quarterback in the early nineties? Does it say?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "28:12-28:18",
    "text" : "What is early nineties? 92 to 95? Yeah. Bobby Hoying."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh Bobby Hoyne. Yeah yeah.",
    "timestamp" : "28:18-28:20"
  },
  {
    "text" : "So that was probably who's wrong on the ball then. Right, Bobby.",
    "speaker" : "Andy",
    "timestamp" : "28:22-28:26"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "28:26-28:31",
    "text" : "Because he came out in ninety six, so Right. You know, he was good."
  },
  {
    "timestamp" : "28:31-28:59",
    "speaker" : "Andy",
    "text" : "Yeah. So Glenn coming out of school, drafted seventh overall by your New England Patriots, 96. By Robert Kraft, not by Bill Parcells, as we all know. Let's see. Apparently Parcell was outspoken of his desire to draft a defensive player. And he was also outspoken about how he was overruled by team management, which we all remember. Something about don't ask me to cook the dinner if I can't buy the groceries, wasn't that the saying?"
  },
  {
    "timestamp" : "28:59-29:01",
    "text" : "Yeah. Great line.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "29:01-29:14",
    "speaker" : "Andy",
    "text" : "Yeah, that's it's It's one of the top Bill Parcells lines, I think. Wait, if didn't we figure out what Bill Parcell's uh actual name was? Greg, didn't you have that?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "29:14-29:16",
    "text" : "Bill Parcell's actual name."
  },
  {
    "speaker" : "Andy",
    "text" : "It's not William? No. I remember this. That's what happens when you listen to our episodes after we release them. Oh yeah, it's Dwayne. Dwayne Charles Parcells.",
    "timestamp" : "29:16-29:30"
  },
  {
    "speaker" : "Greg",
    "text" : "That's right.",
    "timestamp" : "29:30-29:30"
  },
  {
    "speaker" : "Andy",
    "text" : "And I'm pretty sure the reason he goes by Bill is because in school he was um confused with another guy whose name was Bill, so he just started going by Bill because it was easier. Insanity.",
    "timestamp" : "29:32-29:45"
  },
  {
    "text" : "That's how nicknames get made, right? Yeah.",
    "speaker" : "Greg",
    "timestamp" : "29:45-29:48"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:49-29:57",
    "text" : "Oh, your nicknames are never ones you want to have. Because those don't stick. The ones you want to have don't stick. Right, Milo?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Um yeah, I could take it over. Exactly.",
    "timestamp" : "29:58-30:03"
  },
  {
    "text" : "So yeah, and then uh so there was all that uh shit with Parcell and Terry Glenn who obviously didn't like them. He made his displeasure known, referring to Glenn as she after he pulled it after Glenn pulled a hamstring two weeks in training camp. And that forced well quote unquote forced him to miss the rest of training camp and the season open against the Dolphins.",
    "timestamp" : "30:04-30:23",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "30:24-30:31",
    "text" : "Now we've all heard of that part, but did uh Terry Glenn ever comment on Parcell's disdain for him?",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "30:32-30:34",
    "text" : "He did. He wasn't too bothered by it, to be honest.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "30:34-30:36",
    "text" : "Oh really? Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh because uh I think the quote, I don't have the exact quote here, I don't think, but it was something along the lines of um I've been through a lot growing up, so that really didn't bother me. That makes sense. Yeah. Exactly. Yeah. As soon as I read that like, oh, all right, yeah.",
    "timestamp" : "30:36-30:51"
  },
  {
    "timestamp" : "30:51-30:59",
    "text" : "That that uh do we know the the player that he wanted Instead of Glenn?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh, that's a good question.",
    "timestamp" : "31:00-31:01"
  },
  {
    "timestamp" : "31:01-31:03",
    "speaker" : "Steve",
    "text" : "Yeah, who was like drafted like right after him?"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm I'm looking I'm looking at the draft right now. Alex Molden, a cornerback, is the next defensive player. Regan Upshaw, the end. There's no one really of name here.",
    "timestamp" : "31:03-31:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Who did the Patriots draft? Uh like what positions did they draft other than Terry Glenn that year? Because that would probably give you an idea of what Parcells was looking for.",
    "timestamp" : "31:17-31:27"
  },
  {
    "text" : "Well but that is a good uh Lawyer Mulloy. Oh yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "31:27-31:32"
  },
  {
    "timestamp" : "31:33-31:33",
    "speaker" : "Andy",
    "text" : "Right."
  },
  {
    "timestamp" : "31:33-31:38",
    "text" : "But Greg makes a good point though. If there's no other names, then it's not the worst uh pick in the world.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean I guess you have to especially seven overall.",
    "timestamp" : "31:38-31:41"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Right, exactly. Yeah.",
    "timestamp" : "31:40-31:42"
  },
  {
    "speaker" : "Greg",
    "text" : "This was a stacked uh wide receiver draft too, though.",
    "timestamp" : "31:42-31:46"
  },
  {
    "speaker" : "Andy",
    "text" : "Was it? Who else is in this?",
    "timestamp" : "31:46-31:47"
  },
  {
    "text" : "Keyshawn Johnson, Marvin Harrison, Eric Molds. Mushin Muhammad.",
    "timestamp" : "31:48-31:56",
    "speaker" : "Greg"
  },
  {
    "text" : "That was a stack though. Yeah. Who went one over?",
    "speaker" : "Steve",
    "timestamp" : "31:56-31:59"
  },
  {
    "speaker" : "Greg",
    "text" : "Sorell Owens.",
    "timestamp" : "31:59-32:00"
  },
  {
    "text" : "Damn. Good lord.",
    "speaker" : "Steve",
    "timestamp" : "32:01-32:03"
  },
  {
    "text" : "Yeah. Joe Horn. Who went one overall on the staff? Keyshawn.",
    "timestamp" : "32:03-32:08",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "32:09-32:51",
    "speaker" : "Andy",
    "text" : "Oh he did. Okay, yeah, that makes sense. So, um but I think Glenn held his own against all those wide receivers. Because in his rookie season he recorded ninety catches for eleven hundred yards and six touchdowns. And at the time, uh those nine receptions were the most ever in a single season by a rookie in the in NLFL history. And it was actually in Patriots' history was second most ever behind Ben Coates, I think at ninety-four or ninety-six. So that's all he did. Yeah. And that was uh his rookie year was the the year the Patriots went to Super Bowl thirty one. Against the Green Bay Packers."
  },
  {
    "text" : "Now can I interject here again with man, par Parcells is kind of like a douche though then, huh? Because the guys ripping on Glenn. He basically helps the team go to the Super Bowl and then he records. Yeah. And then he bails on the team with his disdain because Robert Kraft made him pick Terry Glenn in the first place.",
    "timestamp" : "32:52-33:14",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Which turned out to be the right decision.",
    "timestamp" : "33:14-33:16"
  },
  {
    "text" : "Right.",
    "timestamp" : "33:16-33:16",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. That's pretty awesome. Yeah.",
    "timestamp" : "33:17-33:20"
  },
  {
    "text" : "That's spiteful. Jeez.",
    "timestamp" : "33:21-33:23",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "33:23-34:10",
    "speaker" : "Andy",
    "text" : "A little bit, yeah. Um So then uh was ninety-six, that was his rookie year. Uh Not much really happened until 99. In 98 he set the Patriots receiving record with 193 yards against the Steelers. So that's three years, two years into his his career. 99, he led the team again with receptions with 69. Nice. Nice. 1100 yards and four touchdowns in 14 games. I think, you know, injury troubles again. And then on October 30, he set the franchise records with 13 receptions for 214 yards against the Cleveland Browns. Damn. So I remember him being good. I don't remember him being this good."
  },
  {
    "text" : "Well I believe I was a Terry Glenn proponent there back in the day, and um you told me that he sucked. So I believe you even said that he didn't have the capability of catching two touchdowns in a game. I think that was your direct quote.",
    "timestamp" : "34:10-34:24",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "34:24-34:27",
    "text" : "No, he has not caught two touchdowns. Well he never caught two touchdowns in a game.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, but you said he didn't even have the ability to catch two touchdowns.",
    "timestamp" : "34:27-34:30"
  },
  {
    "text" : "Now you just put words in my mouth.",
    "speaker" : "Andy",
    "timestamp" : "34:30-34:31"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's a tough look, Andy. Yeah, I know. What the hell?",
    "timestamp" : "34:32-34:34"
  },
  {
    "text" : "Put war in my mouth. I never said that.",
    "timestamp" : "34:34-34:36",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "34:36-34:41",
    "text" : "No, no, I heard that's what I heard. I was like, no, I know he's never caught two, but he could."
  },
  {
    "speaker" : "Andy",
    "text" : "You know, I heard a lot of things.",
    "timestamp" : "34:41-34:43"
  },
  {
    "timestamp" : "34:43-34:43",
    "text" : "Okay.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:44-34:45",
    "text" : "I heard it too. Sure you did so."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "34:46-34:48",
    "text" : "Thank you. See all right. Hey, enough of that."
  },
  {
    "speaker" : "Steve",
    "text" : "I mean, I'm on Team Andy. How do you have two hundred and thirteen yards and only one touchdown?",
    "timestamp" : "34:48-34:52"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh okay, you guys. Yo fuck you, Steve. I know.",
    "timestamp" : "34:52-34:56"
  },
  {
    "timestamp" : "34:56-35:04",
    "speaker" : "Andy",
    "text" : "This is So how about this Steve? You ready for this one? You're gonna you'll probably like this too. Uh Terry Glenn. is the Drew Bledsoe of wide receiver."
  },
  {
    "timestamp" : "35:05-35:13",
    "speaker" : "Mike Melo",
    "text" : "Okay. See and I've said this frequently, both of them could be in the Hall of Fame given a couple of things here or there that might have been different."
  },
  {
    "timestamp" : "35:13-35:14",
    "speaker" : "Andy",
    "text" : "Given each other?"
  },
  {
    "text" : "Hey. Could be",
    "speaker" : "Mike Melo",
    "timestamp" : "35:14-35:16"
  },
  {
    "timestamp" : "35:17-35:19",
    "speaker" : "Andy",
    "text" : "Because I mean they had their chance."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, and they did pretty well. Now give them a bunch uh more time. Because obviously Terry Glenn hated Tom Brady. I mean that was a given. He didn't even want to play with them So Is that what happened? Yeah. So if uh that's what I'm told.",
    "timestamp" : "35:19-35:31"
  },
  {
    "text" : "So uh your sources, huh? Somebody that had sex with both Terry Glenn and Tom Brady.",
    "speaker" : "Andy",
    "timestamp" : "35:31-35:38"
  },
  {
    "text" : "Yeah. Andrew Bloods though. Yeah, I'm just I'm saying what I hear guys.",
    "speaker" : "Mike Melo",
    "timestamp" : "35:38-35:44"
  },
  {
    "timestamp" : "35:44-35:48",
    "text" : "So it could have been curious where these voices are coming from.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "35:52-35:54",
    "text" : "We we don't know what could have been."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:55-36:00",
    "text" : "This is yeah, it's true. I've seen that argument pop up lately now that uh Tom Brady has gone."
  },
  {
    "timestamp" : "36:00-36:09",
    "text" : "Also, this is another tidbit that people didn't talk about back then. But Terry Glenn used to uh stay at Drew Blezzo's house. And they they would build a relationship together.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "What do you mean?",
    "timestamp" : "36:09-36:10",
    "speaker" : "Andy"
  },
  {
    "text" : "Just like hang out, bodies, yeah, sleepovers.",
    "timestamp" : "36:11-36:13",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:13-36:15",
    "text" : "Slumber parties, pillow fights, you know."
  },
  {
    "timestamp" : "36:15-36:28",
    "speaker" : "Mike Melo",
    "text" : "So they w they supported each other as a beautiful thing. You know, and now that now when Brady does that with Antonio Brown, people are like, oh, he it's so great. But nobody's talking about Bletto back then. That was a humanitarian for crime."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:28-36:41",
    "text" : "So the sources I have said that uh when when Terry Glenn and and Drew Bledsoe were were having their sleepovers, what they were actually doing is they were buying a case of surge, the soda surge. Okay. And they were going on AOL chatrooms at the time, pretending to be lesbians."
  },
  {
    "timestamp" : "36:42-36:53",
    "speaker" : "Mike Melo",
    "text" : "What that is very specific. Playing NFL Blitz. I don't know what wow, that's great. Sounds familiar."
  },
  {
    "text" : "Huh. Imagine that. ASL question mark?",
    "timestamp" : "36:55-36:58",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's right. Man, those are interesting times Allegedly. Allegedly, right.",
    "timestamp" : "36:59-37:06"
  },
  {
    "timestamp" : "37:06-37:10",
    "speaker" : "Andy",
    "text" : "Allegedly, yeah. I'm sure I'm sure both Drew Bledsoe and Terry Glenn learned a lot."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Did they mention something about like cybering? Is that what it was called? Cybering.",
    "timestamp" : "37:11-37:15"
  },
  {
    "text" : "Just moving on. Moving on. Made what up? The cyber chat thing. I think it sounds pretty real. That blood source. I just need to know. Allegedly. Allegedly, yeah. I don't want to hear allegedly. Just is there anything even alleging it? No.",
    "speaker" : "Greg",
    "timestamp" : "37:17-37:45"
  },
  {
    "timestamp" : "37:46-37:58",
    "speaker" : "Mike Melo",
    "text" : "Okay. I I'm gonna have to like look back on that, but I'll I'll let you know next time. Is that football or not football? Whoa. It's totally football."
  },
  {
    "timestamp" : "38:00-38:48",
    "speaker" : "Andy",
    "text" : "It's definitely not football. 100% football. So uh 99 is also when uh Terry Glenn's off-the-field stuff started uh to kind of catch up to him. He was sighted for speeding, was three hours late for practice. One die. That's why he was speeding. I mean, three hours late's tough look. Uh, he was also later accused of inappropriate inappropriately touching a woman outside a nightclub the previous night. the previous night of his speeding ticket. And then after missing the game against the Buffalo Bills because of the flu, he was suspended for the season finale the season finale by head coach Pete Carroll for failing to show up for treatment. Which um is a hardbringer of things to come, I think."
  },
  {
    "speaker" : "Steve",
    "text" : "Well, it's supposed to quarantine. Yeah, you would think, right?",
    "timestamp" : "38:48-38:52"
  },
  {
    "timestamp" : "38:52-38:53",
    "speaker" : "Andy",
    "text" : "But I mean"
  },
  {
    "timestamp" : "38:53-38:57",
    "speaker" : "Mike Melo",
    "text" : "I'm I'm surprised that Pete Carroll actually disciplined. So that's that's Yeah, right?"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true. Yeah. Pete Carroll is laying down the law. You know you've fucked up. But it was also, I think, the last game of the season. So then so 2000 more issues. He tested positive for marijuana and entered the NFL substance abuse program.",
    "timestamp" : "38:57-39:14"
  },
  {
    "timestamp" : "39:16-39:17",
    "text" : "Such an abusive substance.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "39:18-39:20",
    "speaker" : "Andy",
    "text" : "Right? He also Although think about that."
  },
  {
    "timestamp" : "39:20-39:27",
    "text" : "If you can function and catch balls and touchdowns and all this other stuff high. You're doing pretty good, man.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Look at Josh Gordon. Yeah, that's what I'm saying.",
    "timestamp" : "39:28-39:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Uh you know, I probably not, because I don't know what that feels like.",
    "timestamp" : "39:37-39:44"
  },
  {
    "timestamp" : "39:45-39:48",
    "speaker" : "Steve",
    "text" : "How are you? No. Allegedly."
  },
  {
    "text" : "We'll talk to you later.",
    "speaker" : "Mike Melo",
    "timestamp" : "39:48-39:49"
  },
  {
    "text" : "You think Terry Glenn got it from La Town?",
    "speaker" : "Steve",
    "timestamp" : "39:51-39:53"
  },
  {
    "text" : "It's a very good change possibility. Wasn't he more into the uh the Molly?",
    "timestamp" : "39:55-40:00",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "40:02-40:04",
    "speaker" : "Greg",
    "text" : "I think it was called Back to C back then."
  },
  {
    "timestamp" : "40:05-40:27",
    "speaker" : "Mike Melo",
    "text" : "I think we'll get there. Wait, here's a question though. So now with the CBA, I think there's more lax like marijuana laws and I'm sure That'll probably evolve over time. So I wonder like how many wide receivers that wouldn't have to contend with that would have been phenomenal given that they weren't in the uh the uh program. We'll never know like Randy Moss."
  },
  {
    "timestamp" : "40:28-40:29",
    "speaker" : "Andy",
    "text" : "Yeah, that's true too. Yeah."
  },
  {
    "timestamp" : "40:29-40:31",
    "speaker" : "Mike Melo",
    "text" : "Terry Glenn could have been the Hall of Fame."
  },
  {
    "timestamp" : "40:31-40:33",
    "speaker" : "Andy",
    "text" : "Randy Moss was phenomenal anyway."
  },
  {
    "text" : "True.",
    "speaker" : "Mike Melo",
    "timestamp" : "40:33-40:34"
  },
  {
    "speaker" : "Andy",
    "text" : "So yeah, so he tested positive marijuana and I think that came back, I think we actually talked about a little bit in 2001, if you remember. because he got all pissed off about how the page like he I guess that came out the information that he tested positive and and he was in the substance abuse program. It got leaked somehow. And so he tried to, I think, sue the league. And the Patriots like never really supported him was his was his thing. So that's kind of why he was sitting out at the beginning and the whole Uh I'm hurt, but I'm not getting paid, and so I'm not getting paid, so I'm hurt, sort of thing.",
    "timestamp" : "40:36-41:14"
  },
  {
    "text" : "I think it's more about money, because if he like he said, he's gone through worse. I'm pretty sure he doesn't give a crap if Bill Belichick stands by him or not.",
    "timestamp" : "41:15-41:22",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, maybe. Um but uh speaking of money, in 2000 he signed a six-year $50 million contract extension with an eleven and a half million dollar signing bonus. So that's pretty hefty for back then. Right. So there was that plus the the Drew Bledsoe ten-year, $100 million signing. You thought these two would be the cornerstone of your offense for the next however long.",
    "timestamp" : "41:22-41:46"
  },
  {
    "text" : "Imagine what that would look like again.",
    "timestamp" : "41:47-41:49",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Um yeah, it would look like the Dallas Cowboys. Mmm how do you figure No?",
    "speaker" : "Andy",
    "timestamp" : "41:51-41:58"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Honey figure.",
    "timestamp" : "41:59-42:00"
  },
  {
    "speaker" : "Andy",
    "text" : "That's where they both ended up",
    "timestamp" : "42:00-42:02"
  },
  {
    "timestamp" : "42:02-42:07",
    "speaker" : "Mike Melo",
    "text" : "No, I don't buy it. With both parcels. Greg, can you check that? Bill Parcell."
  },
  {
    "text" : "Yeah. Yeah, I just checked it. They're right.",
    "speaker" : "Greg",
    "timestamp" : "42:08-42:09"
  },
  {
    "timestamp" : "42:10-42:25",
    "speaker" : "Mike Melo",
    "text" : "Yeah, but here's the thing. That was at the tail end, man. So I don't know. He was a the they were different people back then. You know? They were in a spry. I mean Poleto was what? Almost he was 36 or something by that point."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:26-42:30",
    "text" : "Come on. Yeah, I've never seen a 36-year-old quarterback perform at a high level."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "So you're you're onto something. Yeah, well we're we're it's the first time we've ever seen it, Andrew. So bite your tongue.",
    "timestamp" : "42:30-42:36"
  },
  {
    "speaker" : "Greg",
    "text" : "36 year old? Yeah. True True Breeze is 39. Nope.",
    "timestamp" : "42:36-42:40"
  },
  {
    "text" : "We don't believe it.",
    "timestamp" : "42:40-42:41",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "42:41-42:42",
    "speaker" : "Greg",
    "text" : "How old are we?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Nope. Sorry.",
    "timestamp" : "42:43-42:45"
  },
  {
    "text" : "How how old was Joe Montana?",
    "timestamp" : "42:45-42:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh he actually he was pretty young.",
    "timestamp" : "42:47-42:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Joe Montero's from like twenty eight when he retired.",
    "timestamp" : "42:49-42:50"
  },
  {
    "text" : "He No, I I think he was like thirty uh he was early thirties. Yeah. Yeah, but wait a minute. This this current trend outside of yeah, like the Warren Moons or the test of verdict, but like starting starting quarterbacks, uh that hasn't really happened until recently with the Rivers and Eli Mannings and all that kind of stuff. So There you go, Andy. Boom.",
    "timestamp" : "42:50-43:10",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh you showed me.",
    "timestamp" : "43:10-43:12"
  },
  {
    "text" : "Thank you.",
    "timestamp" : "43:12-43:13",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "But going back to what you were saying about uh Molly, Mike, uh in 2000. Yeah, yeah I think we may have touched on this too. They were given uh he was given permission with Tyla and Troy Brown to stay in Buffalo after a game up there because uh they didn't want to fly in the bad weather because it's fucking Buffalo. Um, but they were given permission to do that on the condition that the three were back in Foxboro the next day for a team meeting. The players were later seen in a strip club in Canada and Tylaw was arrested for possession of ecstasy and they were also late getting to the Monday meeting. So um that was also in Troy Brown's book, if you want to read it. He was probably the only apologetic one, I would imagine, out of all three of those players. You'd imagine Troy Brown was on that list, yeah. It was Troy Brown Strip Club Ty Law And Terry Glenn.",
    "timestamp" : "43:14-44:08"
  },
  {
    "timestamp" : "44:08-44:10",
    "text" : "Wow. That would have been an awesome night to be on.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Imagine that? Can you imagine?",
    "timestamp" : "44:11-44:13"
  },
  {
    "timestamp" : "44:14-44:15",
    "speaker" : "Steve",
    "text" : "It's always the quiet ones."
  },
  {
    "text" : "That's like us Brown brothers, really. Going out for a night. I would probably be the the Troy Brown, if we're being honest.",
    "timestamp" : "44:15-44:22",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "44:26-44:27",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Because Greg Brown's the one getting arrested for possession of ecstasy at the Canadian border.",
    "timestamp" : "44:27-44:32"
  },
  {
    "timestamp" : "44:32-44:34",
    "speaker" : "Steve",
    "text" : "I guess I'll be the diva."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh so that was 2000. Pretty uh pretty entertaining. 2001. Uh we've kind of talked about it this season. He was arrested for assaulting the mother of his son. So that's not great. Um and then was eventually, you know, we've kind of talked about it through this season. Didn't play hurt. Hurt maybe not hurt, maybe just being hurt because he's not getting paid and all that shit. eventually gets uh traded after this season, spoiler alert, to the Green Bay Packers in exchange for A fourth round pick, which turned into Jarvis Green, and a 2003 conditional pick, which turned into somebody called Bryant McNeil. Yeah, I didn't think you'd heard of him either. Nope. And as part of that deal, Glenn dropped a series of grievances against the Patriots, which I think were kind of building throughout the season that we've talked about a bit and ones that Bill Belichick just kind of dismissed. Um so he Didn't play much because he had some injuries, some knee injuries. Um In 2002, but then 2003 was traded to Dallas Cowboys, like we talked about in exchange for a 2004 sixth round draft choice.",
    "timestamp" : "44:36-45:59"
  },
  {
    "timestamp" : "45:59-46:03",
    "text" : "Right, so he did play in Dallas.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "46:03-46:11",
    "speaker" : "Andy",
    "text" : "Imagine that. How about them Cowboys? Right. He was reunited with his former head coach Bill Parcells, Dwayne Charles."
  },
  {
    "timestamp" : "46:12-46:52",
    "text" : "And oh it gets better. Wait, wait, wait, wait, wait, wait, wait, wait. You're you're can I ask this? Alright, but how come he like gets in trouble with the law and I'm looking at like like nowadays with like Tyreek Whoa but but like Tyreek Hill nowadays, like he's gotten into more trouble than that. Um, I think some of the same stuff, but um that was confirmed too when he was getting out of college. How come he gets a pass? Remember his kids stuff too? No, but he's like to present day have gotten like a pretty good pass from the Chiefs, the NFL. What is it? Well I don't give him a pass. I hate that guy.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "He runs it for two forty.",
    "timestamp" : "46:52-46:54",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, that's why. That's why.",
    "timestamp" : "46:54-46:56"
  },
  {
    "speaker" : "Greg",
    "text" : "And they can catch a football. He puts up mad points in fantasy.",
    "timestamp" : "46:57-47:00"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, he does. But I I can't believe that the uh in this day asses in seats. I guess because the Chiefs uh cut ties with one guy, they get a pass for the other guy. Who do they cut ties with? Um the uh Kareem Hunt.",
    "timestamp" : "47:00-47:15"
  },
  {
    "text" : "Yeah, Kareem Hunt. Who was now playing for the Browns Browns, and I think he just got a new deal. He did. Oh really? Yeah. So so be fast and strong and solved. So yeah, so he was reunited, Terry Glenn reunited with his former head coach Bill Parcells. The other starting wide receiver for that uh Dallas Cowboys team. Anybody want to guess?",
    "speaker" : "Andy",
    "timestamp" : "47:16-47:41"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:42-47:43",
    "text" : "Joey Gallery."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:43-48:02",
    "text" : "Oh, Greg Brown nailed it in one. I got it. Nice. Yes. So playing with his old uh Ohio State teammate, Joey Galloway. Terry Glenn would lead the team with 52 catches 750 yards, five touchdowns. Not too bad. He contributed to the team making the playoffs for the first time since 99."
  },
  {
    "text" : "Now, what did uh Parcellos have to say about him after that?",
    "speaker" : "Mike Melo",
    "timestamp" : "48:03-48:06"
  },
  {
    "timestamp" : "48:10-48:17",
    "text" : "He said if I can't pick the groceries, I don't cooking. And then he left them for the Eagles.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:21-48:26",
    "text" : "All right, so uh and then 2005, guess who else he was reunited with Michael?"
  },
  {
    "text" : "Um",
    "timestamp" : "48:27-48:27",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I'll give you a hint, it's a quarterback.",
    "speaker" : "Andy",
    "timestamp" : "48:30-48:31"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "48:32-48:35",
    "text" : "It's true bloodzo. What?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, true bloodzo. And get this. He had uh 2005 reunited with his boy Drew Bledsoe. 63 catches, 1100 yards, which was since 1999.",
    "timestamp" : "48:35-48:46"
  },
  {
    "timestamp" : "48:47-48:47",
    "speaker" : "Mike Melo",
    "text" : "Yep."
  },
  {
    "text" : "Seven touchdowns.",
    "speaker" : "Andy",
    "timestamp" : "48:47-48:48"
  },
  {
    "timestamp" : "48:48-48:50",
    "speaker" : "Mike Melo",
    "text" : "Okay. And what did I say?"
  },
  {
    "timestamp" : "48:50-48:53",
    "text" : "18. 3 yard per case average, which was first in the NFC.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:54-49:09",
    "speaker" : "Mike Melo",
    "text" : "Yeah, of course it was first. Wait a minute. How dare you skim over this and not apologize for putting me down about 10 minutes ago and in other episodes? I want an apology, man, because For what? If they stayed together that whole time in their prime, they would have been the Hall of Famers."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:09-49:15",
    "text" : "Hey Greg, can we get a stat check on how many picks Drew Bledsoe threw that year? Yeah. That's fine."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:15-49:23",
    "text" : "2005. Or just just how many picks do you throw since he left the Patriots? After you left the Patriots."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Look, it's a system too, you gotta keep that in mind. If you're gonna tell you what. Same system.",
    "timestamp" : "49:23-49:28"
  },
  {
    "speaker" : "Greg",
    "text" : "All right. He threw fifteen, two thousand two, then twelve, sixteen, seventeen.",
    "timestamp" : "49:30-49:37"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Okay. Well, again, we don't know. Belichick. Look, I'm an apology, Andy. This is bullshit. I don't accept this.",
    "timestamp" : "49:37-49:46"
  },
  {
    "speaker" : "Andy",
    "text" : "2003, eleven touchdowns, twelve interceptions.",
    "timestamp" : "49:46-49:49"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "49:50-49:55",
    "text" : "Oh. Right, but he's older, man. Come on. Parcel doesn't know how to run an offense."
  },
  {
    "timestamp" : "49:55-49:59",
    "speaker" : "Greg",
    "text" : "Dude, 11 touchdowns in 16 games. That's kind of brutal."
  },
  {
    "timestamp" : "49:59-50:24",
    "speaker" : "Mike Melo",
    "text" : "Dude. You know why that happened? Wait, let's double back. You know what was going on? Dude, he he was feeling depressed that the that year. And I don't even want to go into it. You guys are just brushing it over like at least give 'em some respect. Crying out loud. Drew Bledsoe is depressed? Yeah, he was feeling down that year. And I can't really go into it, but you guys should know about it as Patriots fans. Jesus."
  },
  {
    "timestamp" : "50:25-50:26",
    "text" : "Oh boy.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "50:26-50:27",
    "speaker" : "Mike Melo",
    "text" : "So anyways, let's move on."
  },
  {
    "text" : "I love it when Mike makes up facts.",
    "timestamp" : "50:27-50:29",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "50:32-50:34",
    "speaker" : "Mike Melo",
    "text" : "All right. Well, take it as you will."
  },
  {
    "text" : "So yeah, he had a great year in 2005 on the field. Off the field he uh had another issue. He was arrested for public intoxication and Public urination in a jack-in-the-box parking lot? Who hasn't done that? Well that's what yeah, I mean it's tough to judge that one.",
    "timestamp" : "50:34-50:51",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "50:58-51:31",
    "text" : "Uh 2009. Without the public urination, but yeah. Really? Intoxication, yes. It was a perfect storm. It was like sat Saturday night we got home late from a side away game. It was uh There was a Snoop Dogg concert on campus. Oh, that's weird. And it was game seven of Bulls and Celtics. Oh they relaxed. That series is unbelievable. So it was a perfect storm.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "51:31-51:33",
    "text" : "Yeah, the the cop didn't let it go.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "51:33-51:36",
    "speaker" : "Greg",
    "text" : "Right, and I don't hold myself accountable."
  },
  {
    "speaker" : "Steve",
    "text" : "Do you even remember getting arrested Greg?",
    "timestamp" : "51:36-51:38"
  },
  {
    "speaker" : "Greg",
    "text" : "No. But I was apparently like me and my roommate were like wrestling in the street. Well, it only takes one ride. Yeah. It was a wild ride in the morning, I tell you what.",
    "timestamp" : "51:39-51:51"
  },
  {
    "text" : "Oh yeah, d yeah. I I feel like you've told me about the the drive home to campus. From the police station next morning. What did you tell the police officer?",
    "timestamp" : "51:51-52:00",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "52:02-52:04",
    "speaker" : "Greg",
    "text" : "Uh I don't remember."
  },
  {
    "timestamp" : "52:04-52:26",
    "speaker" : "Andy",
    "text" : "So from what you told me, you were in the back of the cruiser. You you were off campus at the the police station, he was driving you back to campus, and uh he was hammered down in the the passing lane. Oh yeah there was a guy in front of you that wouldn't pull over or something So you banged on the uh the divider. I got plenty of room back here."
  },
  {
    "text" : "Because he had one of those chargers too, and he was he was bombing. Greg Brown, ladies and gentlemen. What a bunch of misfits. I got to do that, you know, when they put you in the glass with the telephone thing. Oh yeah to do that? I got to do that, yeah.",
    "speaker" : "Greg",
    "timestamp" : "52:27-52:45"
  },
  {
    "text" : "Oh that's awesome.",
    "timestamp" : "52:45-52:46",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "text" : "Who would you talk to? My roommate, he came to pick me up and I like put my hand on it and I was like I was like put put your hand on the window Taking him seriously.",
    "timestamp" : "52:47-52:57"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "We don't condone any of that.",
    "timestamp" : "53:01-53:03"
  },
  {
    "timestamp" : "53:05-53:07",
    "text" : "We don't condone anything Greg does, really.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "53:07-53:12",
    "speaker" : "Steve",
    "text" : "The only arrest in the Brown family, that's why he's Ty Law getting busted with the E pills. Oh perfect. That's true."
  },
  {
    "speaker" : "Andy",
    "text" : "Nailed it, yeah. Greg Brown apparently is the black sheep of this family. Who knew?",
    "timestamp" : "53:13-53:18"
  },
  {
    "text" : "Oh, we all knew. Fair enough. Should have had a clue when that cop brought him home, had a little talk with him and mom on the dining room table. What?",
    "timestamp" : "53:18-53:30",
    "speaker" : "Steve"
  },
  {
    "text" : "We'll cut this part.",
    "speaker" : "Greg",
    "timestamp" : "53:30-53:32"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:35-53:40",
    "text" : "Oh. Oh, was that for when you mounted the Chewy on the snowbank?"
  },
  {
    "text" : "No comment. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "53:41-53:43"
  },
  {
    "timestamp" : "53:43-53:43",
    "speaker" : "Andy",
    "text" : "Okay."
  },
  {
    "timestamp" : "53:44-53:47",
    "speaker" : "Steve",
    "text" : "Had a nice little chat about the decisions Greg's making in life."
  },
  {
    "text" : "Hmm. Yeah, I remember having to fucking deal with that decision by digging the goddamn van off of a snowbank. All right, so Terry Glenn.",
    "timestamp" : "53:48-53:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "53:57-53:59",
    "text" : "You've learned a lot since then though, right?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:00-54:22",
    "text" : "Speaking of bad decisions, um there wasn't much that happened after 2005 on the fields. He didn't play much after that. 2009, he was arrested again for public intoxication and possession of marijuana. 2010, he was arrested for auto theft of a rental car. I don't know how that works. Is that what happens if you don't return it? Yeah."
  },
  {
    "timestamp" : "54:23-54:25",
    "speaker" : "Greg",
    "text" : "I've always thought that. I guess."
  },
  {
    "speaker" : "Andy",
    "text" : "I thought they just charge you the the price of the car like they do with library books, but then again, I'm the the Troy Brown in this situation, so I have no idea.",
    "timestamp" : "54:26-54:34"
  },
  {
    "speaker" : "Greg",
    "text" : "See, I heard a stand-up comedian say that one time he was late for a flight and he just like drove up to the terminal and just left it there and called the called the place to was like, oh if you want your car, it's at terminal C That seems and I was pretty smart.",
    "timestamp" : "54:34-54:52"
  },
  {
    "timestamp" : "54:52-54:54",
    "speaker" : "Andy",
    "text" : "I was gonna give you a ship for that, but that's actually pretty clever."
  },
  {
    "text" : "Yeah, you said you like to get in trouble for it, so I was like, I should try that. Keys are in it or what? Yeah, I guess. I mean it was a stand-up bit, so he could be just making it up. That's true, yeah.",
    "timestamp" : "54:54-55:05",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh so yeah, so and then uh sadly 2017, Terry Glenn died at the age of forty-three. Following a one-vehicle rollover traffic accident in 2017 in Irving, Texas, near Dallas, which left his fiance slightly injured, so she was in the car. Um Belichick though when when finding out about it said I think he was deep down inside a good person with good intentions and a good heart. Obviously it's very unfortunate passing. I mean it's just sad. It's a sad day. It's sad news. So kinda rough. He uh turns out there was, as you can probably imagine, uh both alcohol and marijuana in his blood when that happened. So didn't really learn his lessons of the rest of the the times he was arrested for all that shit. Did he have uh kids?",
    "timestamp" : "55:06-56:00"
  },
  {
    "timestamp" : "56:01-56:01",
    "speaker" : "Mike Melo",
    "text" : "Did you say?"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, it's funny you bring that up. I was just about to get that. He has seven children.",
    "timestamp" : "56:02-56:06"
  },
  {
    "text" : "Whoa.",
    "speaker" : "Mike Melo",
    "timestamp" : "56:06-56:07"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Um five women. Not particularly happy either. Um because When was this? Yeah, December 3rd, 2019. Uh Terry Glenn Jr. , his son, uh died of an apparent accidental overdose at the age of 22.",
    "timestamp" : "56:07-56:28"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "56:29-56:32",
    "text" : "Why did you think this was a good idea to to explore?"
  },
  {
    "timestamp" : "56:32-56:48",
    "speaker" : "Andy",
    "text" : "Because we needed to talk about Terry Glenn because he's such a big part of this. And I wanted you I know we've given a lot of crap, so I kind of want to just kind of shed a human light on him. I know we get try to be funny a lot of times, but like some of this shit like he went through some some rough stuff. So"
  },
  {
    "text" : "Did you find in any of all the uh research that there was like a consistent person trying to help him out throughout all this?",
    "timestamp" : "56:48-56:55",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "56:55-57:29",
    "text" : "Um his girlfriend it seemed like was his his person for that. Um they what is she? She was a Dallas County law enforcement officer, I think. Um and they started several like nonprofits together that would target like uh domestic violence awareness and and things, which I think probably stemmed from the stuff that he had going on back in like two thousand one when he was arrested for assaulting Where his mom getting killed.",
    "speaker" : "Andy"
  },
  {
    "text" : "I mean, that's D V right there.",
    "timestamp" : "57:29-57:30",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "57:30-57:34",
    "text" : "I mean that too, yeah. So I mean a lot of it kind of followed him throughout all this stuff.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "57:35-57:55",
    "text" : "Well that's a thing too. I mean it's uh such a horrible start to life, you know. So uh I don't know, it's a tough thing to shake. Yeah. Especially with all the tragedy that I mean, yeah, so I don't know. I mean, I wonder if he tried to get help. I I don't know what do you try to do, but that's extremely unfortunate.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:56-58:07",
    "text" : "Yeah, that wasn't a lot of about him talking about his personal life. He was he was pretty uh buttoned up about that. He just like was not a guy who would open up. He would try once a while, but it didn't really."
  },
  {
    "timestamp" : "58:07-58:50",
    "speaker" : "Mike Melo",
    "text" : "I mean uh Andy and I kind of went over a little bit of the uh mental health aspect of you know sports and then and now. And I uh you know, so I won't go into it too much, um, unless you guys, you know, want to share anything or chime in. But uh I will say that hopefully things are a little bit better for players to reach out without having the stigma or um issues that stem from that and just address some of the stuff. Because also on top of like dealing with a tragic past and you know, you have all this money and opportunity that you might not have not had before. Um I gotta imagine that it's tough to navigate alone, never mind, with um you know, issues stemming from childhood and whatnot. Yep."
  },
  {
    "text" : "Can you imagine if a coach called one of his players she in this day and age?",
    "speaker" : "Steve",
    "timestamp" : "58:52-58:57"
  },
  {
    "text" : "Yeah, that's a rough one. That's what I'm saying. Hopefully, you know Things are a little bit better for players to reach out and get the help that they need.",
    "speaker" : "Mike Melo",
    "timestamp" : "58:57-59:07"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I mean the whole mental health thing is definitely better these days, right?",
    "timestamp" : "59:07-59:12"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I'd hope so. I mean I don't know if we're all the way there, but yeah, definitely better than it was like fifteen years ago.",
    "timestamp" : "59:12-59:19"
  },
  {
    "timestamp" : "59:19-59:26",
    "text" : "I didn't research about it too. Even things like CTE, like just understanding what it is and concussions and how they affect people.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "59:26-59:36",
    "speaker" : "Greg",
    "text" : "Well the guy from the Cavs just came out and said he had uh anxiety. Yeah. And like he he got a pretty good reception. Kevin Love. Kevin Love."
  },
  {
    "timestamp" : "59:36-01:00:03",
    "speaker" : "Mike Melo",
    "text" : "Oh, that's right. Yeah Yeah, that's a good point. And I gotta I just gotta thank all that celebrity and you're going through shit. Like I don't know. I know that people I mean it's easy to say like these guys make millions of dollars and whatever, and we all have problems in our own way, but I can't imagine like having a camera in my face following me around, um, having all the money in the world to do whatever I want and then restrain myself uh when you know things don't feel that great. It's tough."
  },
  {
    "speaker" : "Steve",
    "text" : "I think it comes with its own unique set of problems for sure. Yeah. And like you feel like no one understands it either, right? Everyone's like, oh, you're super rich. Why are you upset? Right. True.",
    "timestamp" : "01:00:03-01:00:13"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And then yeah, I mean how I don't know how comfortable people are with reaching out to teammates and stuff too, because there's that like bravado stuff.",
    "timestamp" : "01:00:13-01:00:20"
  },
  {
    "timestamp" : "01:00:21-01:00:48",
    "text" : "Yeah, that lock them mentality of especially with football too, of all the sports. So that'll do it for this deep dive bye week episode. Next week we are going to be traveling to Carolina to visit the Panthers. The not very good Panthers, so this I think will have a lot of garbage time in it. But we will find out next week on the Pages Dynasty Podcast. See you then",
    "speaker" : "Andy"
  }
]