[
  {
    "timestamp" : "00:00-00:19",
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid. Stupid. You still want to listen? Go right ahead. I am not your mother."
  },
  {
    "timestamp" : "00:21-01:21",
    "speaker" : "Andy",
    "text" : "Welcome back to part two of a very special episode. The Super Bowl episode. We thought this was such a special one. And because Match had him talk for as long as he did, we thought we'd split this into two episodes. So this is episode two of the Super Bowl, 2001 Super Bowl. So thanks for coming back to us. We're going to take you to Sunday, February 3rd, 2002, in Louisiana Superdome. This is pre-Katrina. This is the old Superdome. You're New England Patriots. are facing the greatest show on turf for the second time this season. The first one didn't go the Patriots' way. And because of that, these Patriots are 14-point underdogs. The biggest underdogs, I think, in Super Bowl history. Wrong. Uh oh that's true. They're not the biggest underdogs. They are the biggest underdogs. Who's the biggest underdogs? Not this time. Yeah, Greg. Who was the biggest underdogs?"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't know. I looked I looked it up and it was some old one. It was 18.",
    "timestamp" : "01:21-01:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Really?",
    "timestamp" : "01:26-01:27"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:27-01:28"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh the uh was that the Joe Namath one?",
    "timestamp" : "01:28-01:30"
  },
  {
    "speaker" : "Greg",
    "text" : "It might have been. I'll look it up.",
    "timestamp" : "01:31-01:33"
  },
  {
    "speaker" : "Andy",
    "text" : "Guaranteed a victory. I know the biggest blowout was, but I don't think the spread was the I was talking about upsets.",
    "timestamp" : "01:33-01:39"
  },
  {
    "timestamp" : "01:40-01:43",
    "speaker" : "Greg",
    "text" : "Yeah, Jets Colt Super Bowl three, 18 point spread"
  },
  {
    "timestamp" : "01:44-01:47",
    "text" : "Wow. Didn't they only score like 18 points a game back then too?",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, six final score was sixteen to seven.",
    "speaker" : "Greg",
    "timestamp" : "01:48-01:51"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:52-02:26",
    "text" : "Well we're not gonna ruin the final score of this one. We're not even gonna tell you who won. Uh so we've already talked about the Rams really, because we saw them in week 10. Talked about how great their offense is. They have a solid defense. Yada yada yada. Nothing uh huge in that, so I think. We should probably just get into this game because this was a game that I felt like I had watched more recently than I had, but I there was a bunch of plays in here that were big plays that I completely forgot."
  },
  {
    "text" : "Wait, can we sorry can can we talk about Kurt Warner first? Yeah. Go tea. Because I I I went down a Kurt Warner rabbit hole.",
    "speaker" : "Greg",
    "timestamp" : "02:26-02:36"
  },
  {
    "text" : "Oh, all right. I love your rabbit holes. Let's hear it.",
    "speaker" : "Andy",
    "timestamp" : "02:36-02:38"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "02:42-02:48",
    "text" : "Ridiculous. It's crazier than Brady's, without a doubt. Really? Oh yeah."
  },
  {
    "text" : "All right, let's hear it.",
    "speaker" : "Andy",
    "timestamp" : "02:48-02:49"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "02:49-03:02",
    "text" : "Just his rise. Like he He was a third string quarterback at the University of Northern Iowa. The Power C, yeah. Yeah, Matt Chatham's. Uh I think the same conference."
  },
  {
    "timestamp" : "03:03-03:04",
    "speaker" : "Andy",
    "text" : "I think they were, yeah. I think he told them."
  },
  {
    "timestamp" : "03:04-03:25",
    "text" : "So one double A. Um, he goes undrafted in nineteen ninety-four, goes to the gets picked up in the for the Packers training camp, competing with Brett Favre, Mark Brunel, and Ty Detmer. Jesus. Uh the coaches, Mike Holmgren, Steve Mariucci, and Andy Reed.",
    "speaker" : "Greg"
  },
  {
    "text" : "God damn, that's a fucking powerhouse. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "03:25-03:27"
  },
  {
    "timestamp" : "03:28-03:55",
    "speaker" : "Greg",
    "text" : "All three agree he sucks. They cut him. So then famously after he gets cut. Yeah, yeah. He's stalking shells at a grocery store for $5. 50 an hour in Cedar Falls. Oh boy. Can you imagine anything more depressing? Yeah, cleaning pools. Hey. That was like $8 an hour. Doing it during a pandemic. Yeah."
  },
  {
    "timestamp" : "03:55-03:57",
    "speaker" : "Andy",
    "text" : "Oh, Jesus."
  },
  {
    "timestamp" : "03:58-04:31",
    "speaker" : "Greg",
    "text" : "So then he goes to uh the arena league and so in college too, as soon as he played his senior year, lit it on fire. He goes to the arena league, lights it on fire. He like wins two arena bowls. He's like first in the league in yards and touchdowns, all these stats. Um, he gets a tryout with the Bears. Mm-hmm. And before he goes, he goes on his honeymoon before training camp, gets bit by a spider. What? And can't compete at camp."
  },
  {
    "text" : "Where did he go in his honeymoon?",
    "speaker" : "Steve",
    "timestamp" : "04:32-04:33"
  },
  {
    "timestamp" : "04:35-04:39",
    "speaker" : "Andy",
    "text" : "Australia. Gotta be Australia. Yeah. Something fuck off spider business."
  },
  {
    "speaker" : "Greg",
    "text" : "I see sneaky, I think. You know how he was super religious. This is just a theory, but he wasn't, you know, he's saving himself from marriage. I don't even know if that's true. But as soon as he busted a nut, instead of that like you know that like two minute moment of clarity you have? Yeah. He just had like a six month one. I was like just skip the bears. Yeah, he's like, fuck this, dude. What am I doing? I can just watch more with my life. That's my theory. And then a third. So then he goes to NFL Europe, plays for the Amsterdam Admirals with his backup Jake Delome. Didn't know that either. Didn't know that. Yeah. Um He lights it on fire in Europe as well. So everywhere he goes, he's just been tears it up, yeah. Tears it up. Um he ends up with the Rams. They pick him up as their fourth string quarterback. And they put them up for the NFL expansion draft when the the Browns were expansion. They were like, nah, we don't want them. And then he somehow ends up being the backup because they like traded Tony Banks and Louise Steve Bono. Yeah. Uh-huh. And then Trent Green. Towards ACL, and all of a sudden your starter is Kurt Warner, 1999. Yeah. And what does he do? He throws for 4300 yards, 41 touchdowns. 65% completion percentage. Four 14 touchdowns in his first four games.",
    "timestamp" : "04:40-06:20"
  },
  {
    "text" : "Back then too. That's crazy.",
    "timestamp" : "06:21-06:23",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Wins. wins the MVP, wins the Super Bowl, and the Super Bowl MVP, all in his first season in the NFL. Just a ridiculously meteoric rise.",
    "timestamp" : "06:23-06:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "How old was he when he first got a shot? Because I mean he went forty-five.",
    "timestamp" : "06:36-06:40"
  },
  {
    "text" : "Yeah, I mean he graduated college in ninety-three. So six years after that, twenty-seven ish. Yeah. Graduated twenty-one, late twenties.",
    "timestamp" : "06:41-06:53",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "06:53-06:54"
  },
  {
    "text" : "And then signs a seven year contract right after that year. Imagine his wife, she must be like, God Damn, I hit the jackpot.",
    "timestamp" : "06:55-07:03",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "07:04-07:05",
    "speaker" : "Steve",
    "text" : "Finally, all that was worth it."
  },
  {
    "speaker" : "Greg",
    "text" : "This time last year, you were making $5.",
    "timestamp" : "07:05-07:07"
  },
  {
    "timestamp" : "07:07-07:09",
    "text" : "50 an hour, and I was a breadwinner in this house.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "07:09-07:32",
    "text" : "Yeah, for real. And then uh the rest is kind of history. I mean back to back MVP or two out of three years MVP. I mean he lit it up in 01. So this is his third year in the league, and he's just been This is like I think the height of his career. Yeah. Yeah. Spoil. I mean he falls kind of he falls apart after this game."
  },
  {
    "text" : "But this is injured more than anything, right?",
    "timestamp" : "07:32-07:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Actually funny enough, it was a lot to do with the thumb. So we you get the thumb injury in this game. And I I think that carried him for like four years.",
    "timestamp" : "07:36-07:46"
  },
  {
    "text" : "I remember I don't even think he got it in this game. I think he got it at the beginning of the season. Yeah, that's what they were saying on the broadcast. Because in the in the last game of the game.",
    "timestamp" : "07:47-07:54",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "07:54-07:54"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:54-08:06",
    "text" : "And it's he's still having issues with it here, they're talking about him uh like having some like grabby thing that he's always squeezing so that he can like try get the thumb up but he's like it'll it'll maybe just never get better."
  },
  {
    "text" : "Yeah. I don't I strangely I know what you mean when you say grabby. Yeah.",
    "timestamp" : "08:06-08:13",
    "speaker" : "Greg"
  },
  {
    "text" : "It was John Madden, so I'm I'm pretty sure he actually said grabby thing. That may have been verbatim.",
    "speaker" : "Andy",
    "timestamp" : "08:14-08:18"
  },
  {
    "text" : "I'm gonna go on record and say John Madden was a better commentator than I remember.",
    "timestamp" : "08:19-08:23",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "08:23-08:24",
    "text" : "Loved him. I had some."
  },
  {
    "speaker" : "Andy",
    "text" : "I wrote that down too. Yeah, let's go there. John Madden, Pat Summerall. This was actually Pat Summerall's last ever game that he did. Good. Well it's good.",
    "timestamp" : "08:24-08:32"
  },
  {
    "timestamp" : "08:32-08:41",
    "speaker" : "Steve",
    "text" : "Bats from Raw was terrible. Yeah. Batsham Roll. He was awful. Well he would like start a sentence and just not finish it. And you're like, are you gonna say something?"
  },
  {
    "speaker" : "Andy",
    "text" : "Was that he would fall for every trick play that any team ran. Yeah. Because the Patriots did what they've been doing all season with a direct snap to to Kevin Falk. He's like, oh, it's a high snap and the ball goes over, Brady. Oh, wait, no.",
    "timestamp" : "08:42-08:57"
  },
  {
    "timestamp" : "08:58-09:08",
    "speaker" : "Greg",
    "text" : "Well, he's so like monotone too. And that that one play was the one where you could tell he was actually surprised because he actually had some emotion in his mind."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:08-09:23",
    "text" : "He did, yeah, exactly. Yeah, it was rough, but I I agree with Steven. I thought John Madden was a lot better than I remember. Because you remember just like all the stupid shit that he says? Yeah. But when you actually listen to him, like a lot of it is really good and really informative stuff. And you can see why he laughs at you."
  },
  {
    "timestamp" : "09:24-09:39",
    "text" : "I remember mom saying that she liked him because when she was learning the game, he would explain it. And he sometimes he would, like he'd dumb it down. So like stuff that like I'm like, yeah, no shit. But then I remembered that comment mom must have made years ago where she loved him because he would explain to her when she had no idea what the hell was going on.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Right, absolutely.",
    "timestamp" : "09:39-09:40"
  },
  {
    "timestamp" : "09:41-09:56",
    "speaker" : "Greg",
    "text" : "And he like jokes around too. Yeah. Yeah, he was having a great time with it. When the rest are talking about that holding call and the guy like held his hand for like ten seconds. Did you see that part? Yeah. He's like, he must got a good one. Look at his eyes."
  },
  {
    "text" : "The referee was like, he had the point in which way he was gonna do it. He's like Well he doesn't know which way it's going, but he you can tell by the look in the referee's eyes that he's got a good one because they're wide open.",
    "speaker" : "Andy",
    "timestamp" : "09:59-10:09"
  },
  {
    "text" : "He was too. They gotta stand there with his eyes wide open, just holding his fist. Oh yeah. He did.",
    "speaker" : "Greg",
    "timestamp" : "10:10-10:14"
  },
  {
    "speaker" : "Andy",
    "text" : "He was he was very quotable.",
    "timestamp" : "10:15-10:16"
  },
  {
    "timestamp" : "10:16-10:37",
    "speaker" : "Steve",
    "text" : "Well, I mean my impression coming away from it, because I've watched that final drive a ton is him like saying they shouldn't go for it and then doubling down, right? And you're like, ah, John Madden doesn't know anything. But You look at it from the big picture, he's got a point where like they're on the 17, they had no time or whatever, and some change left. Brady's a rookie. See his logic now."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, they just gave up a touchdown in like a big thing.",
    "timestamp" : "10:37-10:39"
  },
  {
    "text" : "And then halfway through, he he switches. He's like, you know what? Never mind. I'm on board with this. Yeah. Like, all right, give a bit when he's wrong. Yeah, no, no, listen to him back now. 20 years later. I have changed my time. I'm sure I know he said some like silly things, but they're never like stupid. They're never wrong like you'd say for like a Dan Fouts.",
    "speaker" : "Andy",
    "timestamp" : "10:39-11:00"
  },
  {
    "text" : "But they're not super biased either. He didn't seem to be like crazy biased.",
    "speaker" : "Steve",
    "timestamp" : "11:01-11:04"
  },
  {
    "timestamp" : "11:04-11:16",
    "speaker" : "Andy",
    "text" : "No, it was more just like excited to watch a football game. Kind of like you see with Tony Romo these days. We're just excited to see great football being played. Love that too. Yeah. It had that that like joyful feeling to it to me."
  },
  {
    "speaker" : "Steve",
    "text" : "Also, this is the best Super Bowl logo of all time, in my opinion. I like Super Bowl logos, I don't even remember them really, but this one was awesome.",
    "timestamp" : "11:17-11:25"
  },
  {
    "timestamp" : "11:25-11:34",
    "speaker" : "Andy",
    "text" : "Oh, this was the peak. And then they They were kind of same-y after this one and then eventually they all got standardized and all the same thing every year."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. I don't know why they do that either. It's stupid. Yeah. Yeah, I couldn't tell you. Apparently it was supposed to be something different too. What do you mean? Yeah, they had a different logo and they were like they they had sold some merchandise with the old logo and then obviously the uh the 9-11 thing. There's a lot of patriotic themes around this Super Bowl, so they ended up changing it.",
    "timestamp" : "11:34-11:58"
  },
  {
    "text" : "That makes sense. Oh, I see what you mean. Yeah, yeah. Oh yeah, just Google it. Yeah, if you go. Like a very New Orleans theme looking logo. Yeah, I like the yeah, I like the the one they went with. better.",
    "speaker" : "Andy",
    "timestamp" : "11:59-12:09"
  },
  {
    "timestamp" : "12:10-12:14",
    "text" : "Yeah. Look who did some research this week. Fuck yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "Didn't watch the game but did some research.",
    "timestamp" : "12:14-12:16",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "12:17-12:20",
    "text" : "Wikipedia. Greg's like",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:21-12:29",
    "text" : "He's like the rain man of Patriots football. He just remembers it. He doesn't have to watch him. Son of a bitch."
  },
  {
    "speaker" : "Greg",
    "text" : "Shout out Matt Chatham for putting me onto the LA Kiss. Television. Oh yeah, have you have you started watching that? Dude, I watched like five episodes last night. Yeah, and it's worth watching. Dude, I say I'm gonna tell you something that It doesn't make me proud. K Kelly cried. Excuse me? Kelly cried in uh in episode three",
    "timestamp" : "12:29-12:56"
  },
  {
    "speaker" : "Steve",
    "text" : "Tears of like joy, tears of sadness, like what Tears, tears of joy.",
    "timestamp" : "12:56-13:00"
  },
  {
    "timestamp" : "13:00-13:13",
    "speaker" : "Greg",
    "text" : "When BJ Bell, the underdog, made the team so he could play with his brother. Kelly Kelly was the it's a it's a clear sign you're on quarantine. It was messed enough. Yeah, it really is."
  },
  {
    "text" : "Oh I can hear her in the background yelling at you.",
    "timestamp" : "13:14-13:16",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh yeah. Yeah. She she's a bit cussing from downstairs.",
    "timestamp" : "13:16-13:20",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "It was tears of happiness.",
    "timestamp" : "13:20-13:21"
  },
  {
    "text" : "Tears of happiness.",
    "timestamp" : "13:21-13:22",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "13:22-13:33",
    "speaker" : "Andy",
    "text" : "All right, still tears. Over a KISS football team. Yeah. All right, that's Excel. So we may have to in the future do a uh like a bi week episode. or something."
  },
  {
    "speaker" : "Greg",
    "text" : "It's worth it. There's there's enough to talk about there to unpack, as they say.",
    "timestamp" : "13:33-13:38"
  },
  {
    "timestamp" : "13:39-13:43",
    "speaker" : "Andy",
    "text" : "We could do like a mini series of like we'll review each episode. Yeah."
  },
  {
    "text" : "Well maybe not that much.",
    "speaker" : "Greg",
    "timestamp" : "13:43-13:45"
  },
  {
    "timestamp" : "13:46-13:46",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "13:47-13:48",
    "speaker" : "Greg",
    "text" : "Even better."
  },
  {
    "timestamp" : "13:48-13:52",
    "speaker" : "Andy",
    "text" : "Alright, do you have any more uh I had some some Kurt Warner notes actually."
  },
  {
    "timestamp" : "13:52-13:53",
    "speaker" : "Greg",
    "text" : "What do you got?"
  },
  {
    "text" : "So I'd noticed it in the last game, but they didn't talk about it. But he had this like he had that big long face mask, kind of like similar to Drew Bledsoe's. Yeah. But then it had like an extra loop at the bottom. Yep. I'm like, why the fuck does he have this? I just like. to hang his his tie on or something. I I don't understand why it's that extra thing. But they actually talked about it in this game where apparently his vocal cords got injured somehow? They didn't explain how it happened. I'm guessing he just got like a shot to the the neck or something. But he could stay tight. It's post not clarity. Um but so they they put that there while it was healing so it wouldn't Come because he apparently lost his voice for like a week or not a great thing. No. So they they had it there for that and then they left it there so it wouldn't give Fucking crazy injury to get.",
    "timestamp" : "13:54-14:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Does that even extend far enough down?",
    "timestamp" : "14:46-14:49"
  },
  {
    "timestamp" : "14:49-15:06",
    "speaker" : "Andy",
    "text" : "No. I think it did because he took a shot like directly in that spot from Willie McGuinness at one point. Oh yeah. He stayed in there late and just like I think he actually ended up throwing the ball away, but Like William McGill's top of his dome was like right in his right in his chin. So maybe it did help."
  },
  {
    "speaker" : "Steve",
    "text" : "You do get a lot of shots in this game.",
    "timestamp" : "15:06-15:08"
  },
  {
    "speaker" : "Andy",
    "text" : "He he took a lot of shots in this game. At one point they said it was 11 11 hits through like three quarters or something. And uh he was also at the point at this point he um he was second in NFL history in attempts without an interception in the Super Bowl with 60. And then proceeds to throw two interceptions in the next 11 attempts. You know, spoiler alert. But I'm I'm assuming that's been broken since because people just actually throw more passes in games in general. But yeah, there was I I took a bunch of screenshots because there was a bunch of like Steps that they put up on the on the chevron at the bottom and there was some didn't make a lot of sense.",
    "timestamp" : "15:08-15:58"
  },
  {
    "timestamp" : "16:00-16:27",
    "text" : "Yeah, it's I I actually found a video when I was YouTubing this of um home video reactions to this game from like yeah some people in like these Boston fans And like the quality is what you'd expect, but one of one of the things they brought up was like, where the fuck are they pulling these stats from? I swear to God they're just throwing anything up there.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "16:28-16:45",
    "text" : "It's true. Let me just give you a taste of some of them So at the beginning, uh, you know, when the the Rams started the ball, they showed um the the rankings of the offense and defense. The Rams' offense was best in the NFL. The Patriots defense somehow 24th in the NFL. Yeah, I'll be able to do that.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yards? Probably.",
    "timestamp" : "16:47-16:49",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:49-16:50",
    "text" : "Maybe."
  },
  {
    "text" : "Even that, I don't know.",
    "timestamp" : "16:51-16:52",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "16:52-17:33",
    "text" : "Yeah, 24 seemed real low even for yards. Not sure what that was. Um but then moments later they showed the Patriots defense have Allowed uh one opening drive touchdown in the last 26. That's a pretty good stat. Well versus J right. Yeah. But there's a 24th ranked defense. And then on the opposite side of the ball, this was also surprising. They showed the same stat but reverse. Patriots offense 19th in the NFL, which feels about right. Yeah. Uh you know, middle of the road kind of Rams defense. Anybody want to guess? Were they ranked in the NFL? Like fifth. Higher.",
    "speaker" : "Andy"
  },
  {
    "text" : "Really?",
    "speaker" : "Steve",
    "timestamp" : "17:33-17:34"
  },
  {
    "speaker" : "Andy",
    "text" : "The third in the NFL.",
    "timestamp" : "17:34-17:36"
  },
  {
    "text" : "Yeah, they gotta be using yards then, because I don't know. It's gotta be something like that.",
    "timestamp" : "17:36-17:40",
    "speaker" : "Steve"
  },
  {
    "text" : "I don't yeah, I don't know what it is. So not not great. There was a lot of uh I mean we'll we'll I'll do some more later, but there was a lot of oh this was one other one. Uh the the Patriots defense in the postseason, they were showing that the defense of special teams who scored three touchdowns. And the Pagers offense had also scored three touchdowns.",
    "timestamp" : "17:40-17:58",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "17:58-18:00",
    "text" : "Yeah. Yeah, that makes sense."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:00-18:03",
    "text" : "That does goes back to our uh"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "18:04-18:18",
    "text" : "Our three phases of the game. Defense wins championships. Yep. Can you can you name the five Hall of Famers that started for the Rams in this game? Yep."
  },
  {
    "speaker" : "Andy",
    "text" : "Warner?",
    "timestamp" : "18:18-18:19"
  },
  {
    "timestamp" : "18:19-18:20",
    "speaker" : "Greg",
    "text" : "Yep."
  },
  {
    "speaker" : "Andy",
    "text" : "He's in Hall of Fame. Who's a left tackle? Rando Pace?",
    "timestamp" : "18:20-18:24"
  },
  {
    "text" : "Yep.",
    "timestamp" : "18:24-18:25",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "18:25-18:29",
    "speaker" : "Andy",
    "text" : "Wow. Fuck. Yes."
  },
  {
    "timestamp" : "18:30-18:32",
    "speaker" : "Greg",
    "text" : "Wow. Well done, guys. I didn't think you'd get that."
  },
  {
    "speaker" : "Andy",
    "text" : "I don't think we'd get any of those though. We got all five.",
    "timestamp" : "18:32-18:34"
  },
  {
    "timestamp" : "18:34-18:39",
    "speaker" : "Greg",
    "text" : "Also, the white Defensive back hall of fame or Adam Archuletta."
  },
  {
    "timestamp" : "18:39-18:40",
    "speaker" : "Andy",
    "text" : "Yeah. Oh yeah, he was."
  },
  {
    "speaker" : "Greg",
    "text" : "Just taking snaps gets you in the white defensive backall of fame.",
    "timestamp" : "18:41-18:44"
  },
  {
    "timestamp" : "18:44-18:48",
    "speaker" : "Andy",
    "text" : "Him and Jason Seahorn are well Dre Bly was sick too."
  },
  {
    "speaker" : "Steve",
    "text" : "I love Dre Bly. Yeah, Black was good in this game. They had a good secondary.",
    "timestamp" : "18:48-18:53"
  },
  {
    "speaker" : "Andy",
    "text" : "That's a pretty dope name too.",
    "timestamp" : "18:53-18:55"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "18:55-18:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Because if he went by like Andre, then not as cool. Like Andre Black.",
    "timestamp" : "18:56-19:00"
  },
  {
    "timestamp" : "19:04-19:07",
    "speaker" : "Steve",
    "text" : "Yo Murphy? Yeah, yeah, yeah."
  },
  {
    "timestamp" : "19:07-19:14",
    "speaker" : "Greg",
    "text" : "I need to hear Berman. I tried to look up, see if Berman had a uh like a prime time for this and I couldn't find it."
  },
  {
    "text" : "Yeah, I was looking for it too, and I yeah, I couldn't find it either.",
    "speaker" : "Andy",
    "timestamp" : "19:15-19:18"
  },
  {
    "text" : "Because a couple of my favorite Berman nicknames are in this. Ricky Prohl, remember Prel Shampoo? And he used to be like Ricky Prol shampoos this way for a first down. Or Azaheer Hakeem. What do you say?",
    "speaker" : "Greg",
    "timestamp" : "19:18-19:35"
  },
  {
    "timestamp" : "19:41-19:43",
    "text" : "Oh, fuck you didn't.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "19:43-19:45",
    "speaker" : "Greg",
    "text" : "My favorite permanence."
  },
  {
    "text" : "Oh. They're all my favorite. Like a genius. It really is, yeah. Well, all right. I mean should we talk about this game a little bit?",
    "timestamp" : "19:45-19:54",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I guess.",
    "timestamp" : "19:54-19:54"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:55-19:59",
    "text" : "Yeah, all right. So opening quarter. The Rams actually took the lead, which I forgot."
  },
  {
    "timestamp" : "20:00-20:02",
    "speaker" : "Greg",
    "text" : "It's the only lead they'd have. Spoiler."
  },
  {
    "text" : "Picked a 50 yard field goal, which at the time was the third longest field goal. It was only the third field goal of over 50 yards.",
    "speaker" : "Andy",
    "timestamp" : "20:03-20:09"
  },
  {
    "timestamp" : "20:09-20:23",
    "text" : "Oh, they put up a whole bunch of stats upon that. Like, yeah. That's the third longest field goal. And you look out. That's one of three 50 yard field goals. Well no shit. If it's the third longest field goal and it's 50 yards, then the other two are gonna be at least 51 or more.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "20:23-20:50",
    "text" : "Uh and then uh that was kind of all that had the bats didn't they started a bit slow, I thought. Antoine Smith, um I kept like remembering him as more of a a game changer in this season. But it felt like every game he would start off averaging like two yards a carry in the first half and then wear the team down and w would eventually end up averaging four yards a carry.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, he got 92 yards and 5. 11 per carry. Yeah.",
    "timestamp" : "20:50-20:54"
  },
  {
    "speaker" : "Andy",
    "text" : "And I feel like this game was the same thing. Like he started off the first like probably quarter and a half.",
    "timestamp" : "20:54-20:59"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "20:59-20:59"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:59-21:23",
    "text" : "Averaging like a yard a carry. And then started. wearing them down and and breaking bigger runs. Sat Derrick Henry effect. Yeah, exactly. Same idea. Or even Corey Dylan. Yeah. Yeah. Yeah, Legarblund as well Um second quarter was probably the most of eight. Rams actually to open the th the second quarter missed a uh longer field goal, 52 yards."
  },
  {
    "speaker" : "Steve",
    "text" : "Wait, wait, wait, wait. We're not doing best and worse for quarters?",
    "timestamp" : "21:23-21:26"
  },
  {
    "speaker" : "Andy",
    "text" : "We're gonna do it by the half. Oh, geez. What you got a best and worst for every goddamn quarter? Yeah, of course. All right, you know what? Fuck it, let's do it.",
    "timestamp" : "21:26-21:34"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:34-21:37",
    "text" : "Oh good. I don't have any."
  },
  {
    "speaker" : "Andy",
    "text" : "I mean neither. Fuck it for sure. Bullshit.",
    "timestamp" : "21:38-21:40"
  },
  {
    "text" : "There's a you said we didn't do nothing in that first quarter. We set the tone. There's back plays where can where Tabaki like absolutely laid lumber.",
    "timestamp" : "21:41-21:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "21:49-21:49",
    "text" : "Oh yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "That one's like where they overthrew him a little bit.",
    "timestamp" : "21:49-21:53"
  },
  {
    "timestamp" : "21:55-22:10",
    "speaker" : "Steve",
    "text" : "Love laying lumber on the crossover, right? They threw like a crosser, like a shallow crosser to Bruce, and like Love was right there and just like whipped him down. I don't know, they were like they came out and they were just hitting people everywhere. And the worst was first kick of the game was a 40 yard return."
  },
  {
    "text" : "Yeah, that's how the Rams started. The Rams won the opening toss. The elected to receive the football and then took the opening kickoff out to the football.",
    "speaker" : "Andy",
    "timestamp" : "22:11-22:18"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "22:18-22:22",
    "text" : "And then they punted it to like R1. Or three actually, yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "22:22-22:44",
    "text" : "That was my best was um Tom Brady's first snap in a Super Bowl was from his own three-yard line and they decided to go empty backfield and had him throw a quick slant to Uh who else? Troy Brandt. Yep. And that was his first ever play from Scrimmage. Yeah, it was pretty sweet. Yeah. You gonna best, Greg?"
  },
  {
    "text" : "Well, I do I didn't I I was kind of scared there for because I don't remember either of those plays that you just mentioned. So I don't know if I just like zoned out for a bit, but um I don't know if this is in the first quarter, but Madden or uh Summerall asked him asked Madden if he had prowled Bourbon Street earlier in the week. Yeah. He's like, I don't know if prowl is the right word. But yes, I made a stop there on Tuesday.",
    "speaker" : "Greg",
    "timestamp" : "22:45-23:18"
  },
  {
    "timestamp" : "23:19-23:20",
    "speaker" : "Steve",
    "text" : "Monday and Tuesday."
  },
  {
    "text" : "Yeah. Even better. I think that's all I had written down. We'll call it best and worst. The worst. The question was the worst. Answer was the best.",
    "speaker" : "Greg",
    "timestamp" : "23:20-23:33"
  },
  {
    "text" : "Love it. All right, Steve, do you have a worst? Did you do a worst?",
    "timestamp" : "23:35-23:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah, a worst is the uh the four. Yeah, just ridiculous to for to yo. You can't get right to yo.",
    "timestamp" : "23:38-23:43"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, also they came out as a team. They kind of set that whole bar. I think most people remember that, but Yeah. I have a note here.",
    "timestamp" : "23:43-23:51"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "23:52-23:54",
    "text" : "When did the Crazy Train intro start?"
  },
  {
    "text" : "It was in place at the I think.",
    "speaker" : "Andy",
    "timestamp" : "23:54-23:55"
  },
  {
    "text" : "Were they playing Crazy Train on the intro in the Super Bowl?",
    "speaker" : "Steve",
    "timestamp" : "23:56-23:58"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:59-24:00",
    "text" : "Yeah."
  },
  {
    "timestamp" : "24:00-24:03",
    "text" : "I don't know. Apparently I didn't watch the first quarter.",
    "speaker" : "Greg"
  },
  {
    "text" : "Well the the YouTube one that we I thought they came out to Crazy Train. In my mind they did. Uh we'll fact check it. Also it's a Super Bowl episode, some things never change.",
    "timestamp" : "24:04-24:18",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, there's some c there's some controversy about when this game was to be played, as Matt kind of mentioned in the interview.",
    "timestamp" : "24:18-24:27"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "24:27-24:28"
  },
  {
    "text" : "Just because of the nine eleven they pushed everything back and it I guess they didn't do two weeks back then in between the conference game and the Super Bowl.",
    "timestamp" : "24:28-24:38",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "24:38-24:40",
    "speaker" : "Andy",
    "text" : "I didn't think so."
  },
  {
    "text" : "Cause I was thinking, why wouldn't they just make the two weeks one week and then keep it the same day? But they actually had to move this game back a week.",
    "timestamp" : "24:41-24:49",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. That's what I thought. Really?",
    "speaker" : "Andy",
    "timestamp" : "24:49-24:51"
  },
  {
    "text" : "Yeah. So they must have only been doing one week at this point. And apparently there's all sorts of discussions around whether whether they should like make the playoffs more compact, like play games midweek.",
    "timestamp" : "24:51-25:06",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "25:06-25:07",
    "speaker" : "Andy",
    "text" : "Oh no shit."
  },
  {
    "timestamp" : "25:07-25:19",
    "text" : "Like cut out a week of the season. Um because they cause there was like some automobile show already booked and yeah. in the stadium for that that weekend.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because I remember like right after nine eleven happened in the in the Boston Globe. There was articles talking about how like even directly after this happened, they were already like NFL was already on the phone with like the people like I think it was the Metrodome people. Um Uh Superdome rather. Yeah. And uh they were like trying to convince them to push the the the auto show huge thing. And uh it's a fucking Super Bowl. Yeah, exactly.",
    "timestamp" : "25:20-25:49"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "25:49-25:51",
    "text" : "But tell them to beat it, you know?"
  },
  {
    "text" : "Apparently they did. It was literally like like a few days later they were talking about this, and it was just like so conf Yeah, so apparently they um",
    "timestamp" : "25:51-25:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:00-26:13",
    "speaker" : "Greg",
    "text" : "They gave them financial considerations and also they let them run free ads during the Super Bowl. Oh shit. I I don't know if it's for the cars or the show."
  },
  {
    "timestamp" : "26:13-26:15",
    "text" : "Gotta be in the car manufacturer.",
    "speaker" : "Andy"
  },
  {
    "text" : "If you gave me a chance to do a free ad during the Super Bowl. Oh god damn It would be so inappropriate.",
    "timestamp" : "26:15-26:23",
    "speaker" : "Greg"
  },
  {
    "text" : "What would that look like?",
    "timestamp" : "26:23-26:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, it'd be awful. I know that. Yeah, I think tone deaf is probably would probably be a good way to describe it.",
    "timestamp" : "26:24-26:37"
  },
  {
    "timestamp" : "26:39-26:41",
    "speaker" : "Steve",
    "text" : "Half your beard is shaved."
  },
  {
    "text" : "Yeah, exactly.",
    "speaker" : "Greg",
    "timestamp" : "26:41-26:42"
  },
  {
    "text" : "Greg Brown wearing a uh a thong that that has uh an elephant trunk at the front and you're just swinging it around in a circle for 30 seconds. Man.",
    "timestamp" : "26:43-26:51",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:51-27:00",
    "text" : "Yeah, I Googled the Crazy Train thing. There's a blog post by the guy who used to work for the Patriots that did all this. He said he did it in 98. Yep.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So it started it did start before that, yeah.",
    "timestamp" : "27:01-27:03"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "27:03-27:06",
    "text" : "They used to come out to jock jams. Are you ready for this?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "27:08-27:23",
    "text" : "It does not ring a bell. Also, did you know that Janet Jackson was supposed to perform halftime? Really? But they pushed it. Yeah. And they pushed you too. Come on, you know that."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:23-27:25",
    "text" : "Yeah. I don't."
  },
  {
    "text" : "It's a beautiful day.",
    "timestamp" : "27:25-27:27",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "27:28-27:31",
    "speaker" : "Andy",
    "text" : "And they had all the name scrolling on the big sheet in the middle."
  },
  {
    "text" : "You remember that, Steve. Come on. Steve's just trying to be like too cool for pop culture right now.",
    "timestamp" : "27:32-27:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Nah, Steve was in the bathroom taking a shit at this point. I just looked up who did Crazy Train.",
    "timestamp" : "27:36-27:41"
  },
  {
    "speaker" : "Greg",
    "text" : "Are you kidding me? Ste I mean, imagine if this was are they doing all this America stuff and then And then Justin Timberleck rips off and it checked. What a tribute. Everyone just like saluting around them.",
    "timestamp" : "27:42-28:03"
  },
  {
    "speaker" : "Andy",
    "text" : "Holy shit. Tone deaf, you know? That seems to be the theme of this podcast episode. I expected this one to go, not gonna lie.",
    "timestamp" : "28:06-28:19"
  },
  {
    "text" : "All right, second quarter. Roman Pfeiffer playing safety and laying lumber literally on the first play.",
    "speaker" : "Steve",
    "timestamp" : "28:20-28:27"
  },
  {
    "text" : "Yep.",
    "speaker" : "Andy",
    "timestamp" : "28:27-28:27"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:28-28:33",
    "text" : "And Kurt Warner taking absolute shot. Well they were playing a big zone, looks like he got like a really deep drop."
  },
  {
    "timestamp" : "28:34-28:43",
    "text" : "Yeah, it's almost like a tamper tooth depending where he dropped in that night. Yeah, he he looked out of place back then. Even next to the the likes of Laura Malloy. He was still towering over.",
    "speaker" : "Andy"
  },
  {
    "text" : "What an athlete though, huh?",
    "timestamp" : "28:43-28:45",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:45-28:46",
    "text" : "Right? Yeah."
  },
  {
    "timestamp" : "28:46-28:49",
    "speaker" : "Greg",
    "text" : "Also Grant Windstrom. Looked pretty good."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:49-28:51",
    "text" : "He did. That dude was a monster."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I had forgotten about him, but he was a good player.",
    "timestamp" : "28:52-28:54"
  },
  {
    "speaker" : "Steve",
    "text" : "He like they did like a zone blitz where he like dropped into coverage and covered Kevin Falk.",
    "timestamp" : "28:55-28:59"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. It covered pretty well, yeah. Yeah.",
    "timestamp" : "29:00-29:02"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:02-29:19",
    "text" : "Yeah. Well I thought there was uh it was Richard Seymour was out there running down Marshall Falk. Yeah. On one of those pass plays. Where it looked like he was actually supposed to be in coverage too, because Marshall Falk came out of the backfield and the guy that peeled off to cover him was Richard Seymour, which doesn't seem particularly."
  },
  {
    "speaker" : "Steve",
    "text" : "I mean, he still got beat for like ten yards, but he's definitely got a big thing.",
    "timestamp" : "29:20-29:22"
  },
  {
    "text" : "Yeah, but he still ran his ass down.",
    "timestamp" : "29:22-29:23",
    "speaker" : "Andy"
  },
  {
    "text" : "He looked good doing it.",
    "speaker" : "Greg",
    "timestamp" : "29:24-29:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh although I will say if we're if we're gonna give him some shit, we gotta give him some props for um his sack on he literally takes the right guard and throws him aside like the guy's just a child. And then just runs straight after he's like a cartoon.",
    "timestamp" : "29:27-29:44"
  },
  {
    "text" : "He is, yeah. Car cartoon monster or something.",
    "timestamp" : "29:44-29:47",
    "speaker" : "Greg"
  },
  {
    "text" : "He's just bigger than everybody else. He he just looks like he's playing with like younger kids. It's like Gronk, that same sort of like it's just too big to be what's going back to this second quarter. So um Greg, you wanna do your best?",
    "speaker" : "Andy",
    "timestamp" : "29:47-30:01"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "30:01-30:02",
    "text" : "You wanna do your best for this quarter?"
  },
  {
    "text" : "Oh I think. I think we'll leave that until we get to it because I think it's going to be Greg's. Um the uh The Rams miss a 52 yarder and the Pats get the ball at their own 41, which is by far the best starting field position because The two drives before that they started their three and at their own ninth. So this is like their their first chance to actually get somewhere. And they don't. They don't do dick. It's a patent, right? That probably should have been picked off. Yeah. But that was on third down, but the there was a defensive holding call on it, so They got another chance and then didn't do deck with that as well. They punted. I don't know if you noticed, but this was the the combined tackle on the punt. It was actually a great tackle too. Held it pinned the uh The Rams deep, but to start the Rams starting deep was uh tackled by Mike Frabel and also our friend Matt Chatham. Cox on coverage.",
    "timestamp" : "30:03-31:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:12-31:27",
    "speaker" : "Steve",
    "text" : "This I only I would only notice was we talked to him, but when you talk about how Brian Cox was like on plan on one foot, and he's like, yeah, I can't cover. And then like literally it was like Cox on coverage. Yeah, it's some weird stuff where he's like he goes out into like the white the cornerback spot on the card."
  },
  {
    "text" : "Yeah, he was out covering somebody out like out past the numbers.",
    "timestamp" : "31:28-31:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:31-31:36",
    "text" : "And then it was like a falk run and he almost like chased him down from behind. And I was like, Jesus"
  },
  {
    "text" : "Yeah, no, he was in there for more plays than I remember because I was keeping an eye out for him too. And he was in there for a lot of like short running plays and he made some tackle.",
    "timestamp" : "31:36-31:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "But it's like those things like you don't you wouldn't that play would not have registered at all for me without that sort of Knowledge.",
    "timestamp" : "31:44-31:50"
  },
  {
    "timestamp" : "31:50-32:09",
    "speaker" : "Andy",
    "text" : "Oh yeah. Yeah, you that that's that's kind of why I wanted to do it, because you kind of you're able to watch these games in a different light because I thought that I would be cooler headed watching these games. And I think in in some spots I am and I'm recognizing things like that. But I don't know about you boys, but I'm still like tensing up"
  },
  {
    "text" : "During some it's almost like I'm not a physical reaction. I'm gonna be I'll be honest with you, Andy. I'm not.",
    "timestamp" : "32:09-32:16",
    "speaker" : "Greg"
  },
  {
    "text" : "Really?",
    "timestamp" : "32:16-32:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Well you know what happens, dude.",
    "timestamp" : "32:17-32:19"
  },
  {
    "text" : "I know, but it's still like I can't help myself doing it. Like every time the the Rand got the ball and and they got the ball into Fox's hands, uh like my whole body would kind of tense like tackle him, tackle him Even though I know how this goes and I've seen this play before.",
    "timestamp" : "32:19-32:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Is that on you, Steve? I'm with Andy here. Really? I've been getting worked up on these games for sure.",
    "timestamp" : "32:33-32:38"
  },
  {
    "speaker" : "Andy",
    "text" : "I can't help myself.",
    "timestamp" : "32:39-32:40"
  },
  {
    "timestamp" : "32:40-32:48",
    "speaker" : "Steve",
    "text" : "And then even some of the other games we've done earlier season, like I don't remember them at all. Yeah. So it's like watching a brand new game for me is great."
  },
  {
    "speaker" : "Andy",
    "text" : "But yeah, I and I thought I thought that too, and I thought it would kind of like tone down as I start remembering these games more and more, but just it hasn't. I don't know why. Well these ones are just reaction. Yeah.",
    "timestamp" : "32:50-32:59"
  },
  {
    "speaker" : "Steve",
    "text" : "And there are parts of them I don't remember too.",
    "timestamp" : "33:00-33:01"
  },
  {
    "timestamp" : "33:02-33:06",
    "speaker" : "Andy",
    "text" : "Well let's talk about the part we do remember. Greg Brown, do you want to uh walk us through this?"
  },
  {
    "text" : "Yeah, well uh you mean the greatest play. In Patriot's history. Possibly the greatest like 10 seconds of my life up to that point.",
    "timestamp" : "33:07-33:18",
    "speaker" : "Greg"
  },
  {
    "text" : "There's no possible about that.",
    "speaker" : "Steve",
    "timestamp" : "33:19-33:21"
  },
  {
    "text" : "Yeah. So obviously we're talking about the tie law pick six. Did they're uh down three nothing, right, at the time? Yeah, three nothing. Yeah. Maybe like halfway through the second quarter. Actually looking back, it was it was very similar to the high tower sack strip against Atlanta. I thought that too. Where you just saw Varabel coming off the side and you're like, dude, no one touched him. And you just saw it. Yeah. Yeah, and then Warner just kind of floats one up there and Ty catches it in stride and does the infamous like hand up as he's crossing and then Like the dusting of the ground celebration. Yeah. Oh absolutely iconic. I used to do that after every good thing I did.",
    "timestamp" : "33:21-34:17",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I can see you making the bed. Takes a walk in the room and he's like he's dusting the floor.",
    "timestamp" : "34:19-34:24"
  },
  {
    "timestamp" : "34:25-34:49",
    "speaker" : "Greg",
    "text" : "Dude, I won I once did that after um intercourse with Kelly and she was like, what the fuck are you doing? Like I was doing it to be funny that she didn't get the joke. Because remember the shrine I used to have? Yeah. Well there's a there was like a tie law corner of the shrine."
  },
  {
    "speaker" : "Andy",
    "text" : "Of course I was.",
    "timestamp" : "34:49-34:50"
  },
  {
    "speaker" : "Greg",
    "text" : "And we just like we did it in there because it was funny to do. And then after I started like doing the dance and doing the floor, and she's like, What are you doing? Oh my god. I was like, you wouldn't understand",
    "timestamp" : "34:50-35:02"
  },
  {
    "text" : "Does she understand now?",
    "timestamp" : "35:04-35:06",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, no, she gets it now.",
    "timestamp" : "35:06-35:07"
  },
  {
    "text" : "A better question, does she listen to this podcast?",
    "speaker" : "Andy",
    "timestamp" : "35:08-35:10"
  },
  {
    "timestamp" : "35:11-35:12",
    "speaker" : "Greg",
    "text" : "Probably not."
  },
  {
    "speaker" : "Andy",
    "text" : "Lucky for you.",
    "timestamp" : "35:13-35:14"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "35:15-35:18",
    "text" : "So yeah, that was a big part of my childhood that play."
  },
  {
    "speaker" : "Steve",
    "text" : "It's still a big part, clearly. Yeah.",
    "timestamp" : "35:20-35:21"
  },
  {
    "timestamp" : "35:21-35:40",
    "speaker" : "Greg",
    "text" : "Being a Ty Law fan and for him to get a pick six in the Super Bowl. Yeah. You know, on the biggest stage. It was just it was and then he was so swaggy about it too that it was like because that's what you loved about Ty Law is that confidence and it was pretty special."
  },
  {
    "speaker" : "Steve",
    "text" : "Huge momentum play.",
    "timestamp" : "35:40-35:42"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "35:42-35:42",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "But I do have a note here. That's a personal foul these days.",
    "timestamp" : "35:43-35:46"
  },
  {
    "text" : "That's true. The hit is.",
    "timestamp" : "35:47-35:48",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:53-35:57",
    "text" : "That right tackle just totally blew it too. I forget who it was. And then he goes out for us."
  },
  {
    "text" : "I think it was just well that was the right tackle who was their backup because their original one had got hurt earlier No, this was his last play, they said.",
    "timestamp" : "35:58-36:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "This is his last play.",
    "timestamp" : "36:05-36:06"
  },
  {
    "timestamp" : "36:06-36:09",
    "text" : "Oh that's right, yeah. Oh no, you're right, you're right, you're right.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:09-36:20",
    "text" : "But like if you watch the replays, you can see him turn inside and then he turns and looks at him going and crushing the quarterback and he like claps his hands together like, ah shit. Fuck that one up. Yeah, yeah, yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "36:21-36:22",
    "text" : "Been there before.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "36:23-36:25",
    "speaker" : "Andy",
    "text" : "Bear with me, I'm looking something up real quick."
  },
  {
    "speaker" : "Greg",
    "text" : "And then Pat Summaral was like, interception. Return for a touchdown. Ty. Jesus, Pat.",
    "timestamp" : "36:26-36:35"
  },
  {
    "timestamp" : "36:36-36:40",
    "text" : "Go. Six celebration. Pat Summer on the other hand fucking blows. Yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "It's like fucking wake up, dude. Yeah. Game going on. Yeah. If you don't get hype for a pick six in a super bowl, like what are you doing? You know?",
    "timestamp" : "36:40-36:49"
  },
  {
    "timestamp" : "36:50-36:54",
    "speaker" : "Andy",
    "text" : "That was the second ever pick six in a Super Bowl."
  },
  {
    "timestamp" : "36:54-37:00",
    "text" : "Ooh, can we is the first one something we'd know? Um maybe.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "It happened the year before.",
    "timestamp" : "37:00-37:02"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh that the Ravens Giants Super Bowl. I don't really remember that too much. It is.",
    "timestamp" : "37:03-37:08"
  },
  {
    "text" : "Yeah, me either. Oh, there's the one year after too, right? Because that dude from the Tampa Bay. Oh yeah. Did he win ever?",
    "timestamp" : "37:08-37:15",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he won MVP. There were three.",
    "timestamp" : "37:15-37:18"
  },
  {
    "speaker" : "Greg",
    "text" : "The year after. Jesus. Yeah.",
    "timestamp" : "37:19-37:22"
  },
  {
    "text" : "So was Kerry Collins got picked sixth by Dwayne Starks? I vaguely remember. And then the year after, Rich Gannon threw three interceptions at work, uh, two by Dwight Smith. And one by Derek Brooks.",
    "timestamp" : "37:22-37:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:39-37:42",
    "text" : "Wait, who won the MVP on the Bucks that year?"
  },
  {
    "timestamp" : "37:43-37:44",
    "text" : "It's gotta be Dwight, right?",
    "speaker" : "Greg"
  },
  {
    "text" : "You would think of Dwight's.",
    "timestamp" : "37:44-37:45",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "37:48-37:52",
    "speaker" : "Andy",
    "text" : "Um does it tell us? Where would I left? See if it's on profile bar reference. I'm not seeing it."
  },
  {
    "speaker" : "Steve",
    "text" : "Dude, actually.",
    "timestamp" : "37:55-37:56"
  },
  {
    "speaker" : "Greg",
    "text" : "Baltimore won the Super Bowl the year before against the Giants. Yeah. I have no recollection of that.",
    "timestamp" : "37:57-38:03"
  },
  {
    "text" : "Yeah, it was like the boring most boring game of all time.",
    "speaker" : "Steve",
    "timestamp" : "38:03-38:06"
  },
  {
    "text" : "That was that was the one uh where they had that historic defense. Yeah. Trent Dilfer. That's the one, the one that everybody had the worst quarterback ever.",
    "timestamp" : "38:06-38:15",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "38:16-38:21",
    "text" : "Is Ed Reed around? He's not, right? Nope, not yet. Not yet. Ray Lewis was though, yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "38:21-38:23",
    "text" : "I think that was his Lewis's rookie year, maybe."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, is this like Brian Bollower era? Is that a name?",
    "timestamp" : "38:23-38:29"
  },
  {
    "text" : "No. You think of Kyle Bowler?",
    "speaker" : "Steve",
    "timestamp" : "38:29-38:31"
  },
  {
    "timestamp" : "38:31-38:34",
    "speaker" : "Greg",
    "text" : "No, Bullaware, the linebacker?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "38:34-38:37",
    "text" : "Oh, yeah. I think that makes sense."
  },
  {
    "speaker" : "Greg",
    "text" : "Okay. Rod Woodson, right? That's what Rod Woodson or Oh yeah.",
    "timestamp" : "38:38-38:42"
  },
  {
    "timestamp" : "38:42-38:45",
    "speaker" : "Steve",
    "text" : "Well at least we finally got an exciting Super Block for that snooze fest here."
  },
  {
    "speaker" : "Andy",
    "text" : "Steve was right though. Dexter Jackson, the safety, was the MVP of Super Bowl 37. Fuck is Dexter Jackson and why was he the VP?",
    "timestamp" : "38:46-38:55"
  },
  {
    "speaker" : "Greg",
    "text" : "I think we maybe screwed up here first. Three pick sixes in a Super Bowl? Mm-hmm. No, it's true. And a guy and a guy who had two of them didn't win the MVP.",
    "timestamp" : "38:56-39:07"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:07-39:11",
    "text" : "This is correct. I mean Dexter Jackson also had two interceptions."
  },
  {
    "timestamp" : "39:12-39:14",
    "speaker" : "Greg",
    "text" : "Steve, can you can you stat check Andy's stat check?"
  },
  {
    "timestamp" : "39:15-39:29",
    "text" : "What we what what do you think the odds were for Dexter Jackson Super Bowl MVP? Oh outrageous. Outrageous. I can't think of another like safety, maybe uh I think a defensive player won the Ravens one as well, but like not since then.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "39:30-39:41",
    "speaker" : "Greg",
    "text" : "He he he'll just fall into the category other Yeah, Ray Lewis is all one. They don't even put those they don't even put up numbers on those dudes. Yeah, no, I know."
  },
  {
    "timestamp" : "39:43-39:46",
    "speaker" : "Andy",
    "text" : "Yeah, you gotta call to get to get odds on."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "39:48-39:56",
    "text" : "All right, so Pat's up seven three now. Yep. Things are looking good. This is how we wanted it to go."
  },
  {
    "text" : "Yeah, and this the defense in this quarter was unjust shit stomped. I don't know.",
    "speaker" : "Andy",
    "timestamp" : "39:56-40:01"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:01-40:06",
    "text" : "I thought they were getting chunk plays, but We were making some solid ones, but it's not easily."
  },
  {
    "speaker" : "Andy",
    "text" : "Just absolutely just perfect for getting it. And then the next play, Laura Malloy almost got his own pick.",
    "timestamp" : "40:15-40:23"
  },
  {
    "timestamp" : "40:23-40:28",
    "text" : "Yeah, but they also on that drive had that fumbled snap that they turned into like 15 yards.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:28-40:41",
    "text" : "Oh yeah, Kurt Warner was cool, calm, and collected. He just snap, picks it up, everybody like the entire offense and defensive line just stopped. And then like he had all the time in the world and just completed a pass. No problem."
  },
  {
    "timestamp" : "40:41-40:44",
    "text" : "I wonder if anyone's ever tried to fake that. It's fumble roosky.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Ballsy thing to do. What do you think that's fumble snap? Yeah. Fake a fumbled snap.",
    "timestamp" : "40:44-40:51"
  },
  {
    "timestamp" : "40:51-40:57",
    "speaker" : "Greg",
    "text" : "Well you just have it you just have the guy the center keep it and go. That's what the fumble rooski is, isn't it?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but it's not like a f a fumble. Like you're not putting the ball in the ground, are you?",
    "timestamp" : "40:58-41:02"
  },
  {
    "text" : "Well, I think they ch didn't they change the rules where you actually have to like exchange possession? I think so people couldn't do that.",
    "timestamp" : "41:02-41:09",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, that that sounds familiar. Makes sense.",
    "speaker" : "Andy",
    "timestamp" : "41:09-41:11"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "41:12-41:17",
    "text" : "Uh so then they pump it away. Troy Brown calls fair catch with like nobody within fifteen yards of him."
  },
  {
    "text" : "Troy Brown. Uh he would make up for it later though.",
    "speaker" : "Andy",
    "timestamp" : "41:18-41:24"
  },
  {
    "text" : "Then I got it like a football or not football. I wasn't quite sure. Oh, okay.",
    "speaker" : "Steve",
    "timestamp" : "41:24-41:28"
  },
  {
    "timestamp" : "41:28-41:32",
    "speaker" : "Greg",
    "text" : "I don't know which if this it has to be the one I'm thinking of too."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "41:33-41:40",
    "text" : "They said I think it was John Madden. He said throw a guy a bone and then you throw him two bones in a row."
  },
  {
    "text" : "It's actually not the one I was thinking of.",
    "timestamp" : "41:41-41:44",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "No, not the one I was thinking of either.",
    "timestamp" : "41:44-41:45"
  },
  {
    "speaker" : "Greg",
    "text" : "You I mean Andy, you have to have the one I have written down. I'll say it.",
    "timestamp" : "41:46-41:50"
  },
  {
    "timestamp" : "41:50-41:51",
    "speaker" : "Andy",
    "text" : "All right, you say it."
  },
  {
    "timestamp" : "41:51-41:57",
    "speaker" : "Greg",
    "text" : "When he said, what do you think Tyla thinks when he sees 270 pounds of meat coming at him?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:59-42:01",
    "text" : "I had something else actually. What?"
  },
  {
    "timestamp" : "42:02-42:06",
    "speaker" : "Greg",
    "text" : "I heard that and I was like, there's no way anybody missed that."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:06-42:19",
    "text" : "That was I I don't even know his name because they were talking about the Rams fullback. And man goes, his nickname is meat. Yeah. I've never heard anybody more excited about a nickname. Yeah, that was the same play."
  },
  {
    "timestamp" : "42:20-42:20",
    "speaker" : "Greg",
    "text" : "Yeah, I mean that's a great"
  },
  {
    "timestamp" : "42:23-42:44",
    "speaker" : "Andy",
    "text" : "Now m Matt was talking about I don't even remember the situation. I d I think I uh something to do with um having his his fingers moving under there or something like that. I think it I think it had to do with um with uh Kurt Warner getting his his thumb hurt. It's like, oh, you know, when you when you have your fingers under there, things can happen. Oh fuck."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "42:44-42:57",
    "text" : "Shimp. But to answer his question, I bet Ty Law was thinking, well, that's not gonna fit. I'd written that down too."
  },
  {
    "timestamp" : "42:59-43:04",
    "text" : "I don't know. I think I think Ty Law has enough swag to think that it would fit. I can make this work.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:04-43:09",
    "text" : "Yeah, I can handle it 270 pounds of meat, no problem. They did make the tackle too.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "43:09-43:13",
    "speaker" : "Greg",
    "text" : "Yeah, solid. Meat. That's an old school football name."
  },
  {
    "timestamp" : "43:14-43:18",
    "text" : "It's such a nickname for a fucking fullback. If your fullback's not name meat.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:19-43:28",
    "speaker" : "Steve",
    "text" : "So then we go what? Stalled out with the Brady on that stunt sack, which you had no chance on. Punt it back. They're in like their two minute drill, if I remember right."
  },
  {
    "timestamp" : "43:28-43:46",
    "speaker" : "Andy",
    "text" : "Yeah, they s yeah, because this is getting towards the end of the second. quarter. So they start moving the ball a bit and then Warner hits Ricky Prohl, who he is obviously the guy who made the comment about um dynasty is born. That's him."
  },
  {
    "speaker" : "Greg",
    "text" : "People were talking about it. What? Them being a dynasty.",
    "timestamp" : "43:47-43:52"
  },
  {
    "timestamp" : "43:52-44:08",
    "speaker" : "Andy",
    "text" : "I know, but he's the one before the game even starts turns to the camera and goes, tonight a dynasty is born. Ooh. Yeah. And then like every time he'd catch a ball, he would fucking celebrate a whole lot for the fucking four-string wide receiver."
  },
  {
    "timestamp" : "44:08-44:10",
    "speaker" : "Greg",
    "text" : "Oh, it sounds like Andy doesn't like Ricky Pearl."
  },
  {
    "speaker" : "Steve",
    "text" : "Well, I'd always thought that I hated Ricky Pearl because he killed us in this game and re-watching it. I'm like, no. I must have been thinking about Hakeem, because he killed us in this game.",
    "timestamp" : "44:11-44:20"
  },
  {
    "text" : "No, you were thinking Ricky Pearl because he scored the game tying touchdown.",
    "speaker" : "Andy",
    "timestamp" : "44:20-44:23"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "44:23-44:31",
    "text" : "That's how I think I'd say maybe it was a Carolina game too. I remember him pretty pretty good in there, but either way, he definitely hates the Patriots."
  },
  {
    "text" : "Yeah, no, I think we'll get to that later because I think he does a score against the Patriots in the Super Bowl when he's with the Panthers as well.",
    "speaker" : "Andy",
    "timestamp" : "44:32-44:38"
  },
  {
    "text" : "But in this quarter he fumbled the fucking ball like a joke.",
    "speaker" : "Steve",
    "timestamp" : "44:39-44:41"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he did. Fumbled it because of our boy Antoine. Antoine Harris, baby. Yep, shout out. The most underrated uh MVP candidate on this team?",
    "timestamp" : "44:42-44:56"
  },
  {
    "speaker" : "Greg",
    "text" : "He's made a couple big plays lately. He's a lot better than Terrence Shaw. That's the thing.",
    "timestamp" : "44:57-45:02"
  },
  {
    "text" : "Back-to-back weeks. Well, yeah.",
    "timestamp" : "45:02-45:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Who got injured, right? Didn't Shaw get injured on that Roman Pfeiffer hit in the first quarter? I'm pretty sure it was Shaw.",
    "timestamp" : "45:04-45:13"
  },
  {
    "text" : "Yeah, I think they're only playing all these guys because they're going with that five. D B.",
    "timestamp" : "45:13-45:19",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Oh my god. Uh there's a stat here somewhere that where is it? So here we go. So the Patriots defense tonight, this is halfway through the third quarter. How many times they've played different amounts of defensive backs on the field? So your normal four defensive backs, you know, two cornerbacks, two safeties, they did that 12 times. Five defensive backs, which is a nickel. uh 10 times, six defensive backs, which is a dime, which you don't see very often. They've done that 15 times. And they've even rolled out seven defensive backs three times. Halfway through the third quarter. Like that was obviously their game plan was just put nothing but uh pass defenders out there and then as soon as somebody catches the ball, fucking light them up. And that and it worked.",
    "timestamp" : "45:19-46:06"
  },
  {
    "timestamp" : "46:06-46:10",
    "text" : "And they were so tight in the line everywhere. They're jamming them every single time.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. Uh my one of my but there was one play where I saw it was a screenplay to the tight end or something, but Marshall Falk was lined up in the backfield and he ran kind of like an out. Um and Willie McGuinness, you could tell his assignment was Marshall Falk. So he he saw Marshall Falk going out and he just ran straight at him to the point where the uh the left tackle, like went out to go block him and realized like he couldn't because uh Willie McGuinness was running away from him. And Willie McGuinness probably like 10 yards in the backfield just lit the fuck into Marshall Falk. And knocked him like 10 yards back and then came back to me.",
    "timestamp" : "46:10-46:48"
  },
  {
    "timestamp" : "46:48-46:49",
    "speaker" : "Greg",
    "text" : "That's all you gotta do."
  },
  {
    "text" : "Yeah. Yeah. And that was the game plan. But and and it it worked all the way through, but it was like you could just see immediately. He just made a beeline straight to Marshall Falk. knocked his ass over and then came back to get to make the play. It was fantastic.",
    "timestamp" : "46:49-47:02",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. I and I think like I mean it's part part of the reason this is a 14 point spread, but that turf Makes a huge difference. It does. Like obviously it's I mean it's part of their team nickname f for God's sake. So That this team is built. Yeah, this team is built to play on this surface. And the Patriots are coming off like, yeah, coming off two wins to get there that are like Slug fest. So you can kind of understand where that spread came from.",
    "timestamp" : "47:02-47:33",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. Especially since when they played in the Patriots uh Yep. Looks sloppy doing it, but they still pulled away at the end, no problem.",
    "timestamp" : "47:33-47:45"
  },
  {
    "timestamp" : "47:45-47:49",
    "speaker" : "Steve",
    "text" : "I didn't notice that like everybody was bleeding though. Probably from falling on that turf."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. Oh yeah. Did you ever play on that stuff? No. Oh play indoor on it. Indoor soccer for a while back in the day. Yeah. It's fucking terrible.",
    "timestamp" : "47:49-47:59"
  },
  {
    "timestamp" : "47:59-48:06",
    "text" : "It was just like a thin layer of like carpet with like covering concrete",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "48:06-48:08",
    "speaker" : "Andy",
    "text" : "It's green carpet on concrete, yeah. It's it's awful."
  },
  {
    "timestamp" : "48:09-48:13",
    "text" : "The stuff they got now is great though. Little rubber pellets. A lot better.",
    "speaker" : "Greg"
  },
  {
    "text" : "Although you find rubber pellets in places you didn't even know you had, like three days later.",
    "timestamp" : "48:13-48:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "But uh but from a visual standpoint, the the turf is pretty cool.",
    "timestamp" : "48:18-48:22"
  },
  {
    "speaker" : "Andy",
    "text" : "That young green turf. Oh yeah.",
    "timestamp" : "48:22-48:24"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Like the Pat's field doesn't look great on TV now at Gillette. But It w the colors were popping in this game.",
    "timestamp" : "48:24-48:33"
  },
  {
    "text" : "It's true. The blue jerseys on the green grass.",
    "speaker" : "Steve",
    "timestamp" : "48:33-48:36"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "48:38-48:42",
    "text" : "Dude, imagine if the Rams had their old school Oh, like yellow and blue."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:44-48:55",
    "text" : "Yeah. That would have been cool. Yep. Or even the Patriots red. Oh yeah. Now we're done. Yeah. Anybody else got an erection?"
  },
  {
    "text" : "Yeah, that sound you heard was me unzipping my pants.",
    "speaker" : "Greg",
    "timestamp" : "48:55-48:58"
  },
  {
    "timestamp" : "49:01-49:03",
    "text" : "Should I wear sweatpants of these?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:06-49:08",
    "text" : "Uh who wears pants?"
  },
  {
    "text" : "It's true.",
    "timestamp" : "49:09-49:09",
    "speaker" : "Greg"
  },
  {
    "text" : "I got nowhere to go.",
    "speaker" : "Andy",
    "timestamp" : "49:10-49:11"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "49:11-49:21",
    "text" : "I'll do also. I went down, you know, I went down the LA Kiss rabbit hole. I found the most disgusting pair of sweatpants ever."
  },
  {
    "speaker" : "Steve",
    "text" : "For sale?",
    "timestamp" : "49:21-49:22"
  },
  {
    "timestamp" : "49:22-49:28",
    "speaker" : "Greg",
    "text" : "Yeah, yeah. It's just like a full size Gene Simmons face."
  },
  {
    "text" : "The fuck was like Oh yeah, I just did it Well I got the kiss where like their faces are right above your dick.",
    "speaker" : "Steve",
    "timestamp" : "49:28-49:37"
  },
  {
    "timestamp" : "49:38-49:44",
    "speaker" : "Greg",
    "text" : "Oh yeah. They have some of the tackiest shit ever. I heard like a animal moaning."
  },
  {
    "timestamp" : "49:44-49:45",
    "text" : "Oh, that was my stomach.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "49:45-49:54",
    "speaker" : "Greg",
    "text" : "Oh, really? That's not true. Yes, it was. Jeez. Stevie getting hungry. Right."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:57-49:58",
    "text" : "It's the the poob brewing."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "49:59-50:00",
    "text" : "Oh good"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, let's move this along a bit. I think this part.",
    "timestamp" : "50:03-50:06"
  },
  {
    "speaker" : "Steve",
    "text" : "So that first, once they get that fault ball back from Ricky Pearl, drop it on the ground like a loser. That first like Troy bubble screen. Yeah. And that again is where I was like, John Madden's sweet. He's talking about his first step quickness and like what makes him a good screen receiver, makes him a great punt returner. And again, I was like, man. Sean Mans knows the stuff. Yeah. But that was a huge play there.",
    "timestamp" : "50:08-50:32"
  },
  {
    "speaker" : "Andy",
    "text" : "It was massive. But I thought uh an even bigger play, this is gonna be my I think it's third and one, and the page is like just outside field goal range. And Kevin Falk takes like the toss sweep out of the shotgun around left tackle. And the the left tackle is the guy that Matt Light got injured. And this guy had just come in for this drive. And I don't even recognize his name.",
    "timestamp" : "50:32-50:57"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, me neither. Williams. Something Williams.",
    "timestamp" : "50:58-51:00"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:00-51:13",
    "text" : "Williams. Yeah, something Williams. And uh He pulled out and he blocked two guys on that one play and sprung Falk not only for the first down, but was it he was able to get out of bounds."
  },
  {
    "timestamp" : "51:13-51:15",
    "speaker" : "Steve",
    "text" : "Can get down with the five, yeah."
  },
  {
    "timestamp" : "51:15-51:26",
    "speaker" : "Andy",
    "text" : "Yeah, and and then like two plays later what the braided Patton touchdown in the corner there. Shades of the week before blood soda patent in that back corner falling away."
  },
  {
    "timestamp" : "51:27-51:34",
    "text" : "My best was like the in like the live broadcast that's on YouTube, they had like a different camera angle. For that?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "51:34-51:38",
    "speaker" : "Andy",
    "text" : "Oh they did, yeah. They like from the corner straight on the long scrimmage like usual."
  },
  {
    "text" : "It was from like the corner of the end zone.",
    "timestamp" : "51:38-51:40",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "51:40-51:40",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "And it was like set up perfectly to watch like Brady's throw to him.",
    "timestamp" : "51:40-51:44",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "51:44-51:47",
    "text" : "Oh yeah, it was the perfect angle for that play goal. You're absolutely right.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:48-51:55",
    "text" : "Like, I don't know, you see it from the replays, you think it puts a lot more air under it, but it wasn't. It was kind of a bullet."
  },
  {
    "timestamp" : "51:55-51:56",
    "text" : "Oh yeah, he hooked it in there.",
    "speaker" : "Andy"
  },
  {
    "text" : "It was a tough catch though. Yeah. I think it's a better catch than it was a throw.",
    "timestamp" : "51:56-52:01",
    "speaker" : "Greg"
  },
  {
    "text" : "I agree. Yeah, I agree with that. And it was an awesome route. Like from the top.",
    "timestamp" : "52:01-52:05",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:05-52:11",
    "text" : "Oh yeah. Out and up from the five line. Gave him those wiggle hips, you know."
  },
  {
    "timestamp" : "52:12-52:14",
    "speaker" : "Steve",
    "text" : "See you later. Brady pumped it too."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:15-52:15",
    "text" : "Yeah."
  },
  {
    "timestamp" : "52:15-52:21",
    "speaker" : "Andy",
    "text" : "Yeah, that was that out and up. Fake the out, get the guy to bite, and then get behind him. It's perfect. Yep."
  },
  {
    "text" : "David Patton's only catch of the game.",
    "timestamp" : "52:21-52:23",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh sure it was. Mm-hmm. Yeah, because Patton had another play. But it wasn't a game. That's true. He had the reverse. Yep. Tom Brady out front lead quote unquote blocking. They did that like dance his way through the getting in the through the fray. Not great, Tom. Not great.",
    "timestamp" : "52:23-52:43"
  },
  {
    "timestamp" : "52:43-52:49",
    "speaker" : "Steve",
    "text" : "They had a stat where this is the uh Rams first time trailing by more than eight points all year."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, they had two stats at at the end of this at the end of the half. Uh one was that that was uh Tom Brady's first touchdown pass in the last 83 attempts. A bum. Not great, but you know, timely. Uh yeah, this is the first time that the Rams have trailed by more than eight points this season at all. And then uh right on the ensuing kickoff for this, it was the biggest Super Bowl fact, the biggest halftime deficit overcome is seven points. Oh yeah, they loved the covering out 14 to 3. Which, you know, is great and kind of sets a table for, you know, year 20 of this podcast. But",
    "timestamp" : "52:50-53:30"
  },
  {
    "text" : "Well, also that I mean that fumble is huge. Like I don't think people really talk about that play much. The the Antoine Harris fumble, but I mean Massive. Four 14-3. If the if the Rams go down and score there, I mean you're talking about being down at half. This is a whole different Yep, having don't.",
    "speaker" : "Greg",
    "timestamp" : "53:31-53:52"
  },
  {
    "timestamp" : "53:53-53:55",
    "speaker" : "Andy",
    "text" : "It's still 7-3 and it's anybody's game. Yeah."
  },
  {
    "timestamp" : "53:56-54:01",
    "speaker" : "Greg",
    "text" : "For 14-3, you you go into that locker room thinking we can win this fucking thing, you know?"
  },
  {
    "speaker" : "Andy",
    "text" : "And especially since the pages getting the ball back, like to have to be able to do that like score and then get the ball back and try again. Like that's that's yeah, it's a whole momentum.",
    "timestamp" : "54:01-54:10"
  },
  {
    "timestamp" : "54:10-54:17",
    "speaker" : "Steve",
    "text" : "And even like I don't know, the offense hadn't done anything, and even this whole game that offense doesn't really do much until the last drive."
  },
  {
    "timestamp" : "54:18-54:29",
    "speaker" : "Greg",
    "text" : "It's true, yeah. Yeah. Every single whole season. Yeah, whole season. Never mind this game. I can't think of a game this season where I've been like, wow, this this offense is a wagon."
  },
  {
    "speaker" : "Andy",
    "text" : "The only one was the uh game.",
    "timestamp" : "54:29-54:33"
  },
  {
    "timestamp" : "54:33-54:40",
    "text" : "Yeah, no watch any of the games. been a wagging at all.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "54:40-54:43",
    "speaker" : "Greg",
    "text" : "Based on what you guys have been telling me."
  },
  {
    "timestamp" : "54:44-54:53",
    "text" : "No, Bray looked good in the uh the game again and he rallied him down from a lot and they basically said fucking go sling it. And he threw it like fifty something times. So",
    "speaker" : "Andy"
  },
  {
    "text" : "Sling it Tommy.",
    "timestamp" : "54:53-54:54",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, exactly. It's just one of those like typical games. Um But speaking of underrated plays in this game, I thought the ensuing kickoff was huge. Yeah, I bet that's not 30 seconds left in the half still. And um you know it's it's the Rams and we've seen them do this to the pages last time they played. What are they right before the half just went down and uh completed plays of like at least twenty yards, a bunch of 'em and I I think they either kicked a field goal or score a touchdown like right to right before the half. Um typical what you see the Patriots do these days. Great. And they actually sent um Marshall Faulk back to return the kick too. Instead of Yo Murphy. And Vinateri kicks it away from Falk. Like right on the sideline so that When he when Falk catches it, his momentum takes him out of bounds at the six.",
    "timestamp" : "54:54-55:48"
  },
  {
    "timestamp" : "55:49-55:51",
    "speaker" : "Steve",
    "text" : "Which he could have just let it bounce and it probably going out of bounds."
  },
  {
    "text" : "Exactly. It was a super ballsy kick to do in the fucking Super Bowl. Because if he if he lets that bounce out of bounds, the rank's gets the ball to 40 and it's a it could be completely different things. It's now 30 seconds left instead of being at your own six and they just take a knee and going a half. So two plays. Change this whole uh shape of this the Super Bowl.",
    "speaker" : "Andy",
    "timestamp" : "55:52-56:09"
  },
  {
    "text" : "Yeah, I don't think Marshall Falk was comfortable doing that.",
    "speaker" : "Greg",
    "timestamp" : "56:10-56:14"
  },
  {
    "text" : "No, I don't think he returns kicks very often.",
    "timestamp" : "56:14-56:16",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:16-56:21",
    "speaker" : "Greg",
    "text" : "I think it's just you know what? Someone needs to tell Mike Marts, do your job."
  },
  {
    "timestamp" : "56:23-56:25",
    "speaker" : "Steve",
    "text" : "And yo Murphy was good."
  },
  {
    "timestamp" : "56:25-56:26",
    "speaker" : "Greg",
    "text" : "He was a good return guy."
  },
  {
    "timestamp" : "56:26-56:31",
    "speaker" : "Steve",
    "text" : "He had that 40-yard return to open the game and I thought he actually provided him a pretty good spark."
  },
  {
    "timestamp" : "56:31-56:42",
    "speaker" : "Greg",
    "text" : "And that's that's the the whole theory behind it all is, right? Is like don't change things just because this is an important game. Just do your job. And Mike March is going, oh God. We need to do something here."
  },
  {
    "text" : "We're down 143. We need a spark?",
    "speaker" : "Steve",
    "timestamp" : "56:42-56:44"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. No, don't do that. Just do your job.",
    "timestamp" : "56:44-56:49"
  },
  {
    "text" : "You want to hear a quote from John Madden?",
    "timestamp" : "56:50-56:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "56:53-56:53"
  },
  {
    "text" : "This Patriots defense has done their job. Yeah.",
    "timestamp" : "56:54-56:58",
    "speaker" : "Andy"
  },
  {
    "text" : "Why did you write that down?",
    "speaker" : "Greg",
    "timestamp" : "56:58-56:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh because it would be a fucking quote later on from Bill Balichek.",
    "timestamp" : "57:01-57:05"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay. All right. I thought you were just writing down everything you heard.",
    "timestamp" : "57:05-57:08"
  },
  {
    "timestamp" : "57:08-57:10",
    "speaker" : "Andy",
    "text" : "For the next like 20 fucking years."
  },
  {
    "text" : "How many pages you got over there, Andy?",
    "speaker" : "Greg",
    "timestamp" : "57:11-57:13"
  },
  {
    "timestamp" : "57:13-57:19",
    "speaker" : "Andy",
    "text" : "Uh notes I have four pages and then I have all the screenshots so it turns out to be 12."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "57:19-57:22",
    "text" : "I know you s send us your show notes. I never read them."
  },
  {
    "speaker" : "Steve",
    "text" : "I never read them either. I don't even know I take my own notes. I have two and a half pages.",
    "timestamp" : "57:22-57:29"
  },
  {
    "speaker" : "Greg",
    "text" : "I have a half a page on Kurt Warner and then nothing else.",
    "timestamp" : "57:30-57:34"
  },
  {
    "text" : "And somehow you're contributing.",
    "timestamp" : "57:37-57:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "57:39-57:42",
    "speaker" : "Steve",
    "text" : "God damn it. Rain, man."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Exactly. It's a good job you're good at this.",
    "timestamp" : "57:42-57:45"
  },
  {
    "text" : "It's the only thing I am good at.",
    "timestamp" : "57:45-57:46",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "57:46-57:51",
    "text" : "Yeah, that's where I we had our own little spark on the uh second half kickoff. Patrick Pass.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:52-57:54",
    "text" : "Hell yeah. Returning that kickoff to the 30."
  },
  {
    "timestamp" : "57:54-57:57",
    "speaker" : "Steve",
    "text" : "Yeah, well he was like dead to rights in the 15."
  },
  {
    "timestamp" : "57:58-57:59",
    "speaker" : "Andy",
    "text" : "Yeah, he just squirted out."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. That's something I've learned this year, like this season. He was a better kick returner than I ever imagined. Yeah. And this is a fullback too, right?",
    "timestamp" : "58:00-58:08"
  },
  {
    "timestamp" : "58:09-58:16",
    "speaker" : "Andy",
    "text" : "Technically. Was he? I thought he was a halfback. I think he was a running back, yeah, but he was he was big. He was built like a brick shit house."
  },
  {
    "speaker" : "Greg",
    "text" : "Is that what a halfback is? Somewhere between uh running back and a fullback?",
    "timestamp" : "58:16-58:22"
  },
  {
    "speaker" : "Andy",
    "text" : "I think halfback was just originally uh a running back Yeah, it was sh it was that position like they back in the Which never made sense.",
    "timestamp" : "58:22-58:30"
  },
  {
    "timestamp" : "58:31-58:36",
    "speaker" : "Greg",
    "text" : "Why is that? Well I just I just invented a fucking perfect description, didn't I? Love it."
  },
  {
    "timestamp" : "58:36-58:36",
    "speaker" : "Steve",
    "text" : "Sure."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "58:37-58:53",
    "text" : "He's somewhere between a fullback and a running back, right? Patrick Pass, halfback. Why don't you call him a half a halfback? He's a quarterback. Oh, I see what you did there, Steve. Yo, your mom, so dumb, she thought a quarterback was a refund."
  },
  {
    "speaker" : "Andy",
    "text" : "Cool. God damn.",
    "timestamp" : "58:55-58:57"
  },
  {
    "timestamp" : "58:57-58:59",
    "speaker" : "Greg",
    "text" : "That was my go-to joke when I was a kid."
  },
  {
    "text" : "Uh yeah, shocking.",
    "timestamp" : "58:59-59:01",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "59:01-59:05",
    "text" : "It doesn't really work when I say it's my brothers, but you know."
  },
  {
    "timestamp" : "59:06-59:13",
    "speaker" : "Andy",
    "text" : "You get the point. Luckily we know mom doesn't listen to this, even though we've been shouting around every fucking episode."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "59:15-59:21",
    "text" : "Then they come out with uh a ton of Antoine. He was this is uh some of his best friends of the game here"
  },
  {
    "text" : "Yeah, and then they actually I thought they were going for the dagger because Brady tried to hit Patton deep and Patton had like two steps on the guy and Brady just missed him.",
    "timestamp" : "59:21-59:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, Madden called it too. Called that play.",
    "timestamp" : "59:30-59:32"
  },
  {
    "text" : "This is like Tony Romo. Yeah, he did. This is the time where you take a shot and that's exactly what happened. And I don't think if Brady hit the tap in there and scores a touchdown, this game's over as a as a comment.",
    "timestamp" : "59:32-59:41",
    "speaker" : "Andy"
  },
  {
    "text" : "I feel like it killed the momentum. I feel like they could have just kept grinding it with uh Um David Patton. Fuck was that? Mom's trying to video me.",
    "timestamp" : "59:42-59:53",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "She she knows. She knows.",
    "timestamp" : "59:54-59:57"
  },
  {
    "text" : "You know I'm a damn podcast, right? Yeah. What are you doing? She won't come on and answer.",
    "speaker" : "Andy",
    "timestamp" : "59:57-01:00:03"
  },
  {
    "timestamp" : "01:00:03-01:00:04",
    "text" : "Answer it.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I can video her if you want.",
    "timestamp" : "01:00:05-01:00:06"
  },
  {
    "timestamp" : "01:00:07-01:00:23",
    "text" : "You decline mom. I just let her go to voicemail. Yeah. Mom, we do this at the time, don't we? Mom! Mom. Oh what the Oh, she can't figure out the phone.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Can't figure out technology. That's a shocker. I can't hear you very well.",
    "timestamp" : "01:00:23-01:00:29"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:00:29-01:00:41",
    "text" : "Oh, you're in the middle of the oh you're doing your thing. Hi mom. Hi mom. Oh my goodness, you're you're in the middle of it. Yeah, we were just talking about you, Mom. So are you, Mom."
  },
  {
    "speaker" : "Andy",
    "text" : "You're in the middle of it too now.",
    "timestamp" : "01:00:42-01:00:43"
  },
  {
    "text" : "You're just talking about how you never listen to us because you don't care. You keep saying you will, Mom.",
    "speaker" : "Steve",
    "timestamp" : "01:00:44-01:00:51"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:51-01:01:04",
    "text" : "You keep saying you will. She'll figure out podcasts in the next 20 years. It'll be worth it. This is riveting radio."
  },
  {
    "text" : "Thanks, Mom.",
    "speaker" : "Steve",
    "timestamp" : "01:01:04-01:01:05"
  },
  {
    "speaker" : "Andy",
    "text" : "I love you, Mom.",
    "timestamp" : "01:01:06-01:01:07"
  },
  {
    "text" : "Bye mom.",
    "timestamp" : "01:01:08-01:01:09",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Bye mom.",
    "timestamp" : "01:01:09-01:01:10"
  },
  {
    "timestamp" : "01:01:11-01:01:12",
    "speaker" : "Steve",
    "text" : "That's great."
  },
  {
    "text" : "God damn. Finally got her on the podcast. Four months. How often do you call your mother, Steve?",
    "timestamp" : "01:01:12-01:01:20",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh calls him all the time.",
    "timestamp" : "01:01:20-01:01:23"
  },
  {
    "speaker" : "Steve",
    "text" : "Once every ten days maybe.",
    "timestamp" : "01:01:24-01:01:26"
  },
  {
    "timestamp" : "01:01:27-01:01:32",
    "speaker" : "Greg",
    "text" : "Oh. She calls me like every like three days and complains about you, so I figured it's a good idea."
  },
  {
    "text" : "She was just calling me to tell me how much of a good good boy I am. That's the direct quote.",
    "timestamp" : "01:01:34-01:01:38",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:01:45-01:01:50",
    "text" : "Well, all right. All right. Where were we? Antoine Smith just pounding the rock. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "But I feel like they kill the momentum by taking that shot there. I don't know.",
    "timestamp" : "01:01:51-01:01:54"
  },
  {
    "timestamp" : "01:01:54-01:02:08",
    "speaker" : "Greg",
    "text" : "I think that's a good idea. I kind of go for the daggone. Yeah, I liked uh Uh his rationale. What's his name? John Madden. John Madden. You know, you're you're already up. They're expecting you to ground and pound. You're in good field position."
  },
  {
    "text" : "Grounding and pounding was working. Yeah, they're just shot. They do like a soft play to J. R. Edmund that loses three yards. Now it's third and thirteen and like they're not even in field goal range and they end up punting it away.",
    "speaker" : "Steve",
    "timestamp" : "01:02:09-01:02:20"
  },
  {
    "text" : "Yeah, but if he hits that that was open. It was the right play call.",
    "timestamp" : "01:02:20-01:02:23",
    "speaker" : "Greg"
  },
  {
    "text" : "He just missed it. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:02:25-01:02:27"
  },
  {
    "timestamp" : "01:02:28-01:02:33",
    "speaker" : "Greg",
    "text" : "Brady sneaky has been bad at the deep ball. This season."
  },
  {
    "text" : "You got way better at that than Yeah, even like only a couple seasons later, we'll see it in Pittsburgh.",
    "speaker" : "Andy",
    "timestamp" : "01:02:33-01:02:40"
  },
  {
    "text" : "Well you guys crucified me on the Brady Emergency episode by saying he was never a great deep ball thrower.",
    "timestamp" : "01:02:40-01:02:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true. He becomes a great deep ultra.",
    "timestamp" : "01:02:45-01:02:47"
  },
  {
    "timestamp" : "01:02:48-01:02:54",
    "text" : "Maybe he's oh he's that's never been the strength. I thought he was like he becomes decent and pretty good, but that was never his game.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:02:55-01:03:00",
    "speaker" : "Greg",
    "text" : "You fucking listen here, Steve. How dare you"
  },
  {
    "speaker" : "Steve",
    "text" : "We have another Chatham fighting right after this.",
    "timestamp" : "01:03:06-01:03:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes. Um not one of his better things because he only gets called for fair catch interference. And pleads voraciously with the referee.",
    "timestamp" : "01:03:09-01:03:20"
  },
  {
    "text" : "He didn't. It was very, very close though.",
    "timestamp" : "01:03:20-01:03:23",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:03:23-01:03:47",
    "speaker" : "Andy",
    "text" : "It was real close to to that not being a didn't, but yeah, he uh got away with it So the Rams start at their own 15 instead of further down the field than that. And this is where Warner just starts taking shots. Like they they were still driving the ball, but I think they made to about midfield and then he took three like real shots in a row."
  },
  {
    "timestamp" : "01:03:47-01:03:49",
    "speaker" : "Steve",
    "text" : "Yeah, Big Rich got him real good on one."
  },
  {
    "text" : "Yeah, that was the one, yeah, that that was the one where he uh he just tossed the the guard aside like he wasn't there.",
    "speaker" : "Andy",
    "timestamp" : "01:03:49-01:03:55"
  },
  {
    "text" : "Then like the next play, Pfeiffer does that delayed safety blitz and just absolutely blows him up again. Yeah.",
    "timestamp" : "01:03:56-01:04:01",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "He's a tough son of a bitch, Warner.",
    "timestamp" : "01:04:02-01:04:04"
  },
  {
    "speaker" : "Steve",
    "text" : "He really is, yeah.",
    "timestamp" : "01:04:04-01:04:05"
  },
  {
    "timestamp" : "01:04:05-01:04:10",
    "text" : "Oh yeah, he was and he was just standing there taking it the whole time. He was bleeding from the chin, all sorts of shit.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:04:13-01:04:14",
    "speaker" : "Steve",
    "text" : "Yeah, how I liked him too. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "I want him to be the new Monday uh Monday night guy. I'd be easy to He does the radio. Oh, does he? For Monday night, yeah. He's pretty good.",
    "timestamp" : "01:04:15-01:04:24"
  },
  {
    "text" : "I bet he'd be good at that, yeah. Yeah, he's certainly better than a good grasp of how the game works, you know? Or Brett Favre. Maybe.",
    "timestamp" : "01:04:25-01:04:35",
    "speaker" : "Andy"
  },
  {
    "text" : "Dude, he's a good old boy. You can't tell me Brett Favre isn't charismatic.",
    "speaker" : "Greg",
    "timestamp" : "01:04:36-01:04:40"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:04:40-01:04:41",
    "text" : "That's probably true."
  },
  {
    "text" : "Everybody loves Brad Fav.",
    "speaker" : "Greg",
    "timestamp" : "01:04:42-01:04:43"
  },
  {
    "timestamp" : "01:04:44-01:04:49",
    "speaker" : "Steve",
    "text" : "Yeah, but he's gonna ad lib the whole thing. Yeah. Yeah, he would."
  },
  {
    "timestamp" : "01:04:49-01:04:52",
    "speaker" : "Andy",
    "text" : "He's gonna get a bunch of shit wrong too, but he also got a bunch of shit right."
  },
  {
    "text" : "Yeah, it's gonna use gunslinger. Oh, he's he just shows up. Oh god.",
    "timestamp" : "01:04:55-01:05:05",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:05:06-01:05:10",
    "text" : "He's not he doesn't wear a suit, he just comes in his blue jeans."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:12-01:05:14",
    "text" : "The blue jeans tuxedo"
  },
  {
    "timestamp" : "01:05:15-01:05:16",
    "speaker" : "Steve",
    "text" : "Canadian tuxedo Andy."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, whatever. Denim tuxedo. What the fuck you want? We don't tuxedo shame here. That's true.",
    "timestamp" : "01:05:16-01:05:22"
  },
  {
    "speaker" : "Steve",
    "text" : "They're beaten up on the wide receivers, too. There's that one play, like it was weird, like I guess it was part of their thing, but like the wide receivers had hit the ground before they got tackled.",
    "timestamp" : "01:05:22-01:05:31"
  },
  {
    "timestamp" : "01:05:32-01:05:39",
    "speaker" : "Andy",
    "text" : "Yeah. Madden even called that out. He's like, yeah, they they do the thing where they get as far as they can, then they just fall over. Like it's smart, I don't care."
  },
  {
    "text" : "Malloy just blows him up instead of like tapping him down.",
    "timestamp" : "01:05:40-01:05:44",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I wrote that down, yeah. It wasn't like and I'm pretty sure that's illegal now too.",
    "timestamp" : "01:05:44-01:05:48"
  },
  {
    "timestamp" : "01:05:48-01:05:48",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "And then it probably was illegal then, but the it was a Super Bowl, so you don't call it. Yeah, that was great.",
    "timestamp" : "01:05:49-01:06:03"
  },
  {
    "text" : "Well that that's the whole thing. Like I think they're getting in their heads by just being like overtly physical with the receivers.",
    "speaker" : "Steve",
    "timestamp" : "01:06:04-01:06:10"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. And I think it was getting in Warner's head too because all the timing is thrown off and he was he was running for his life at this point.",
    "timestamp" : "01:06:10-01:06:16"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:06:17-01:06:23",
    "text" : "I mean he had time a bunch too, but he couldn't find people open, so it wasn't like I think that timeless really thrown off."
  },
  {
    "timestamp" : "01:06:24-01:06:32",
    "speaker" : "Andy",
    "text" : "Yeah, and then the rush would eventually get to him and then he was hanging there as long as he could to like so hopefully somebody would get open and he would just start taking shots."
  },
  {
    "text" : "And you gotta think like those corners that they're just flooding the field with all play pretty well. It's a tough ass. That's probably why Hakeem did so well is you're asking Wheatley and Shaw and our boy to kind try and cover 'em.",
    "timestamp" : "01:06:33-01:06:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:06:48-01:06:56",
    "text" : "Well that's their that's always been the patrons' defensive game plan. Is take away your best options and have you beat them with your third guy, right?",
    "speaker" : "Andy"
  },
  {
    "text" : "But I mean the third guy is awesome on this team too. It's true, yeah. I mean you could even make a case for Ricky Prol, as much as I hate good wide receiver. Trunk candidate had like eight touchdowns Right. Yeah. I read your notes, Andy. Just now. I read them. I was just giving you a hard time. I read them sometimes, but not often.",
    "timestamp" : "01:06:56-01:07:18",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:07:18-01:07:21",
    "text" : "If you read them, you'd know you had six sessions, but that's okay.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07:21-01:07:23",
    "text" : "Six? That's still a lot. For a backup running back.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:07:24-01:07:24",
    "text" : "Yeah. Yeah."
  },
  {
    "timestamp" : "01:07:24-01:07:30",
    "speaker" : "Greg",
    "text" : "And he um something about him being like a Kiefer Kiefer Sutherland. character."
  },
  {
    "text" : "Yeah his his name sounds like a bad Fox TV drama if you want to keep it suddenly.",
    "speaker" : "Andy",
    "timestamp" : "01:07:30-01:07:34"
  },
  {
    "text" : "The drunk candidate Tuesday nights at nine.",
    "speaker" : "Greg",
    "timestamp" : "01:07:36-01:07:39"
  },
  {
    "speaker" : "Andy",
    "text" : "Only on Fox.",
    "timestamp" : "01:07:43-01:07:43"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, yeah. So yeah, this team is just a a wagon, right? You have a you have to have a perfect game. Not only uh I mean you under you you see the game plan and I bet it's not that crazy to think of, right? Get physical with them. A lot of a lot of teams probably thought that. But this is like perfect execution, right? Yeah. You get turnover, opportunistic turnovers. You scored points on defense. You're hitting them at every opportunity. I mean, they're still gaining a decent amount of yards, but you've held them to three points through three quarters. It's Yeah. About as good as you can ask for.",
    "timestamp" : "01:07:44-01:08:20"
  },
  {
    "timestamp" : "01:08:20-01:08:29",
    "text" : "You can run the ball. Yeah. Turn turn the clock a bit. Yeah. I mean, like Chatham said, if they hadn't played him early in their year, I'd I bet they lose this game. Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:08:29-01:08:38",
    "speaker" : "Andy",
    "text" : "I said that too. I uh in that game I said it was the most important loss of the Patriots dynasty. And I was laughed out of the room by Greg and Mike."
  },
  {
    "timestamp" : "01:08:38-01:08:39",
    "speaker" : "Steve",
    "text" : "Yeah, it's fair."
  },
  {
    "speaker" : "Greg",
    "text" : "Well, I just disagree with anything you say.",
    "timestamp" : "01:08:40-01:08:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Really? I hadn't noticed. That hasn't been going on for fucking 30 years.",
    "timestamp" : "01:08:45-01:08:51"
  },
  {
    "timestamp" : "01:08:52-01:09:02",
    "speaker" : "Greg",
    "text" : "I'm just I'm just testing you to see how strong your convictions are, Andy. That's all. Uh-huh. Like any good brother would do. Uh-huh."
  },
  {
    "text" : "Uh speaking of tests and convictions. Uh the next Bram's drive. Kurt Warner has picked off again by OTIS.",
    "timestamp" : "01:09:05-01:09:16",
    "speaker" : "Andy"
  },
  {
    "text" : "Otis. I had forgotten about this interception to be honest.",
    "timestamp" : "01:09:16-01:09:20",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:09:20-01:09:22",
    "text" : "I always forget about this one every time I watch it.",
    "speaker" : "Andy"
  },
  {
    "text" : "This is like the the sleepy turnover, like the you know, everyone remembers the Ricky Pearl fumble and the obviously the Tylap Pix.",
    "timestamp" : "01:09:23-01:09:30",
    "speaker" : "Steve"
  },
  {
    "text" : "Mm-hmm.",
    "timestamp" : "01:09:31-01:09:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "But without this, you know, Patriots are driving to tie the game and not to win it.",
    "timestamp" : "01:09:32-01:09:37"
  },
  {
    "text" : "Right. Yeah. Because this turns into well this was the uh the direct snap to Falk that basically fooled uh Summerall. But even before that, the play before that, or two plays before that, they tried um a running back pass with Kevin Falk, which I had completely forgotten about. Didn't run this play at all. And Falk, the the pressure was so great that he just had to like pull it down and eat it.",
    "timestamp" : "01:09:38-01:10:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:10:01-01:10:02",
    "text" : "Smart and get the pass off.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Well he's covered anyway, so you see that angle No. Oh yeah. Oh yeah. The guy was like stride for stride with the receiver.",
    "timestamp" : "01:10:02-01:10:09"
  },
  {
    "text" : "And then whoever that defensive end is, what was his name? He was he blew his block up and was right on fault too. Yeah, what was his name, Greg?",
    "speaker" : "Steve",
    "timestamp" : "01:10:10-01:10:16"
  },
  {
    "timestamp" : "01:10:16-01:10:18",
    "speaker" : "Greg",
    "text" : "Oh dude, um space and two."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, you're the he's the one that brought him up earlier as well.",
    "timestamp" : "01:10:18-01:10:20"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:10:21-01:10:22",
    "text" : "Uh Winstram."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:22-01:10:24",
    "text" : "Yes, yeah, yes, Winstrom."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:10:24-01:10:25",
    "text" : "Yeah, he will uh play up as well."
  },
  {
    "text" : "Uh but yeah, it leads to uh a military field goal. So now we're at 17-3 going into the fourth quarter. So yeah, without that. Moram scored two touchdowns be down, which is exactly what happened. But I mean I don't know if there are any more things to talk about in the third quarter to do best and worse unless you guys have some.",
    "speaker" : "Andy",
    "timestamp" : "01:10:25-01:10:43"
  },
  {
    "speaker" : "Steve",
    "text" : "I blew on my best with that summer. I'll get in foiled by that direct snap.",
    "timestamp" : "01:10:43-01:10:47"
  },
  {
    "speaker" : "Andy",
    "text" : "I know now it's my favorite. Marty Chocks. Yeah, the running back.",
    "timestamp" : "01:10:47-01:10:52"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, let's jump into the fourth quarter. Yeah, because this is this is where it gets good.",
    "timestamp" : "01:10:53-01:10:57"
  },
  {
    "speaker" : "Steve",
    "text" : "Well the random start kind of figuring it out.",
    "timestamp" : "01:10:58-01:11:00"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, yeah, alright, so good. I mean it it it ends good, but it starts Does it? Well it starts really good. Because the Rams drive all the way down and they're going for it on fourth and goal from the three.",
    "timestamp" : "01:11:01-01:11:13"
  },
  {
    "text" : "Even before that, dude, he almost threw two picks back to back plays. Lawyer almost had a pick that he didn't see at all. Ty almost had a pick.",
    "timestamp" : "01:11:14-01:11:23",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, on the on the third down to try to fade and tie low is the only one we got his hands on it. And then surprised they went for it. He kind of had to at this point.",
    "timestamp" : "01:11:23-01:11:33",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:33-01:11:34",
    "speaker" : "Greg",
    "text" : "Yeah, I guess."
  },
  {
    "text" : "Was it what, ten minutes left or so? It was kind of early. Yeah, it was right it was right at the beginning of that the quarter, but you're down two touchdowns?",
    "speaker" : "Andy",
    "timestamp" : "01:11:34-01:11:40"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:11:41-01:11:50",
    "text" : "Yeah, ten and a half. In this day and age, you probably keep a field goal because there's a lot more scoring, but I think back then might have been a different calculation."
  },
  {
    "timestamp" : "01:11:50-01:11:51",
    "speaker" : "Greg",
    "text" : "That's true."
  },
  {
    "text" : "Maybe. But there's also a lot of scoring on both ends. So I think you go for that. Yeah, but fourth and fourth and goal from the three. Warner drops back to pass. Nobody's open. Mainly because Willie McGuinness has Form tackled Marshall Fault coming out of the backfield.",
    "timestamp" : "01:11:51-01:12:08",
    "speaker" : "Andy"
  },
  {
    "text" : "Within five yards. Oh God, here we go.",
    "speaker" : "Steve",
    "timestamp" : "01:12:09-01:12:12"
  },
  {
    "timestamp" : "01:12:13-01:12:18",
    "text" : "There we go. Can't actually tackle, I don't think. Welcome to this bins.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:12:18-01:12:21",
    "text" : "Dude, he tried mauled him.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:12:21-01:12:24",
    "text" : "Yeah, he baulled him, but he's within five yards. You can do whatever you want."
  },
  {
    "timestamp" : "01:12:24-01:12:30",
    "speaker" : "Greg",
    "text" : "John Matt called him earlier in the. You can't hold people though, Steve. You can make contact. You can't hold them."
  },
  {
    "timestamp" : "01:12:30-01:12:36",
    "speaker" : "Steve",
    "text" : "They didn't call holding. Yes, they did. Yeah, they called holding. No, holding. Yeah."
  },
  {
    "timestamp" : "01:12:37-01:12:42",
    "speaker" : "Andy",
    "text" : "But the result of the play is Warner scrambles. Tries to die for the touchdown."
  },
  {
    "text" : "If you want to call it scrambles. I'm slow as Warner.",
    "speaker" : "Greg",
    "timestamp" : "01:12:43-01:12:48"
  },
  {
    "timestamp" : "01:12:49-01:12:51",
    "speaker" : "Steve",
    "text" : "Who's faster, Brady or Warner?"
  },
  {
    "timestamp" : "01:12:51-01:12:56",
    "text" : "Oh Jesus. Who's faster, Brady Warner or Greg Brown?",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, I'm faster.",
    "timestamp" : "01:12:56-01:12:58",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:12:58-01:13:08",
    "speaker" : "Steve",
    "text" : "Well, I don't know. We keep trying to get a guy at work to do a 40-yard dash to see if he can beat Brady's combine time. You should make him do the triple jump."
  },
  {
    "speaker" : "Andy",
    "text" : "Like, we can do the shuttle. He's a triple pages only care about the three cone anyway.",
    "timestamp" : "01:13:10-01:13:16"
  },
  {
    "speaker" : "Greg",
    "text" : "If you want to make a non-athletic person look really non-athletic, make them do the triple jump. Oh yeah. It's like the least intuitive athletic thing ever So you just look like a fucking idiot.",
    "timestamp" : "01:13:17-01:13:30"
  },
  {
    "text" : "Maybe we should maybe we should have combine stats. I'll do it. We'll see if we can figure that out.",
    "timestamp" : "01:13:31-01:13:36",
    "speaker" : "Andy"
  },
  {
    "text" : "We'll do it when we're in uh North Carolina summer.",
    "timestamp" : "01:13:36-01:13:38",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:38-01:13:40",
    "text" : "Yeah, maybe the next time we're all together."
  },
  {
    "timestamp" : "01:13:40-01:13:44",
    "text" : "But that's bullshit ass flag. Should've been touchdown. Should have been game over.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "At the goal line, and runs it all the way back for a touchdown. It would have been 24 to 3. And then the game again is over.",
    "timestamp" : "01:13:47-01:13:53"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:13:54-01:13:55",
    "text" : "Yeah. Ten minutes left."
  },
  {
    "timestamp" : "01:13:56-01:14:13",
    "speaker" : "Andy",
    "text" : "Huge swing. 14-point swing. Rams get the ball back in a first down at basically the one-yard line. Two plays later, Kurt Warner, QB sneak, goost them. Like we talked about. Yeah. Goosted down there and just ran straight up the middle. Scores a touchdown and now it's a little bit close."
  },
  {
    "speaker" : "Greg",
    "text" : "And Pat Summerall's like, what just happened? Didn't realize it was a touchdown for like five seconds.",
    "timestamp" : "01:14:13-01:14:20"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:14:21-01:14:32",
    "text" : "Which definitely let uh let John Madden go on about goosing. And then this is where the the Patriots offense they go three and out. Pretty much every drive basically."
  },
  {
    "speaker" : "Steve",
    "text" : "I feel like that always happens, right? Well like, I don't know. The playground gets super conservative and they just try to grind clock and they just go three bounds and out, three and out, three and out, three and out.",
    "timestamp" : "01:14:33-01:14:42"
  },
  {
    "text" : "Not just with the pages, but just in general, I feel like.",
    "timestamp" : "01:14:42-01:14:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:14:44-01:14:45",
    "speaker" : "Steve",
    "text" : "Yeah, no, yeah, in football."
  },
  {
    "speaker" : "Andy",
    "text" : "It's momentum, baby. Yeah, I think that has something to do with it.",
    "timestamp" : "01:14:46-01:14:50"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:14:50-01:14:52",
    "text" : "Yeah, once your beehole starts clenching."
  },
  {
    "text" : "Yep. You start getting conservative in the play calling and you start getting conservative in just like how you're running the plays.",
    "timestamp" : "01:14:53-01:14:58",
    "speaker" : "Andy"
  },
  {
    "text" : "Even like execution, right? You're like you don't want to make the play that blows it.",
    "timestamp" : "01:14:59-01:15:06",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. But I mean the past D kept playing him pretty well though.",
    "timestamp" : "01:15:06-01:15:11"
  },
  {
    "text" : "Okay Well playing defensively is pretty instinctual, right? You just like run around. But if you're uh tight window here. Do I just let it rip or do I check down? You know?",
    "timestamp" : "01:15:12-01:15:22",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:15:23-01:15:27",
    "text" : "Right. Yeah. And so you in this game, this is where Brady would be checking down. Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:15:27-01:15:29",
    "text" : "Well until the last drive he would.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:15:29-01:15:39",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. But then at that point you're not you're you're tie game. You're not trying to contain that lead. You're just Yeah see what you can do on this last drive and then whatever happens happens."
  },
  {
    "timestamp" : "01:15:39-01:15:48",
    "speaker" : "Steve",
    "text" : "But there's still that thing that Greg just said where you don't want to make that fatal mistake either. John Matt's point of taking me. Because you don't make that fatal mistake."
  },
  {
    "text" : "That's true they didn't. Nope. And yeah, because that's what I was doing. Like we're going out, we're gonna fucking sling it be",
    "timestamp" : "01:15:48-01:15:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:15:56-01:16:04",
    "speaker" : "Steve",
    "text" : "But if like Otis hadn't made that pick and they hadn't got that three points, right? But of course Perry's gonna sling it. But it's me even more impressive that he's slinging it to win it."
  },
  {
    "timestamp" : "01:16:05-01:16:11",
    "text" : "Yeah. But yeah, I mean back to your point, I think the defense does do a a decent job in this, but you can tell they're getting gassed.",
    "speaker" : "Andy"
  },
  {
    "text" : "Well dude, they like blew Kurt up again.",
    "timestamp" : "01:16:12-01:16:14",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because they uh Page Go three now they punt and the Rams I think had a holding called and moved them back to their own seven. So literally started this seven yard line drive down the field, but not in like a typical Rams way where they're just like Where Warner has a bunch of time and he's standing back there just picking you apart. Like he was running for his life, completing passes, like you you're kind of half expecting him to be like shovel passing it left-handed. But still managed to drive almost within field goal range, so we're getting kind of close until Willie McGuinness comes out and puts a stop to the drive with uh a huge sack. Huge sack. Forcing the ramps to punt. Paige got the ball.",
    "timestamp" : "01:16:14-01:16:54"
  },
  {
    "text" : "Well, Willie's celebration there too. It was you could tell was exhausted defensive player. He just lay on his back at the ceiling.",
    "timestamp" : "01:16:55-01:17:04",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, that's amazing. Yeah, he knew that that was getting them off the field and getting them. Exactly. Yep. It wasn't much. Paz got the ball at their own 20 with three and a half left. And basically I thought they were gonna run three running plays, but they didn't.",
    "timestamp" : "01:17:04-01:17:18"
  },
  {
    "timestamp" : "01:17:18-01:17:21",
    "speaker" : "Steve",
    "text" : "And then they like burned a stupid timeout too."
  },
  {
    "timestamp" : "01:17:22-01:17:49",
    "text" : "Oh yeah, yeah. Like by the by this point no neither team had any timeouts left. Yeah. Which is baffling to me. They're just using them like whenever the f fuck they want. Yeah. There was some stat where the uh the Rams led the league in delay of game panel for such a what you would expect to be a well-oiled machine. You wouldn't expect them to have that many delayed game calls. But it did feel like a little disjointed all the way through. Uh but the punt was probably Ken Walter's worst punt of the season, can we say?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:17:49-01:17:51",
    "text" : "Absolutely awful punt."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:17:51-01:17:53",
    "text" : "I think they said it went 30 yards."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:17:53-01:18:07",
    "text" : "And then they cut to Brad Sealy and he's like, what the fuck is that? The reps or the Lee? Like both. Because that was the uh wide-eyed holding call on the Patriots, but yeah."
  },
  {
    "timestamp" : "01:18:08-01:18:12",
    "speaker" : "Greg",
    "text" : "Well I mean they they had to uh would they re-kick it or not, right? I think I'm gonna do it."
  },
  {
    "speaker" : "Andy",
    "text" : "Well I I think nowadays you can just take that five yards. But I don't think it's a good idea. Well the rents start at their own forty-five, which is ridiculous. Ridiculous. And then I'm gonna understand. What?",
    "timestamp" : "01:18:12-01:18:26"
  },
  {
    "timestamp" : "01:18:27-01:18:28",
    "text" : "Minute fifty one left.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:18:29-01:18:41",
    "text" : "Yeah. Yeah, because they they the pat's managed to run it down to Yeah. So They have the ball at 345 a couple of plays later. I'm just gonna go out and say it. Illegal offensive pass interference on this player is picked up.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:18:41-01:19:00",
    "speaker" : "Greg",
    "text" : "Oh of course you are. Are you are you guys kidding me? They called it a little pick. Dude, it's only Madden even called it a pick. It's only a pick. It's a rub. You tell me, dude, you mean to tell me If the Patriots ran that play on offense, you'd be saying the same thing."
  },
  {
    "text" : "Yeah. I'd be I'd only celebrated the touchdown because it didn't get called, but I'd be like, it's only a pick if they like",
    "timestamp" : "01:19:00-01:19:06",
    "speaker" : "Andy"
  },
  {
    "text" : "actively get in the way of the player.",
    "timestamp" : "01:19:07-01:19:08",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:19:08-01:19:10",
    "speaker" : "Andy",
    "text" : "He did. He ran and grabbed it."
  },
  {
    "timestamp" : "01:19:11-01:19:15",
    "speaker" : "Steve",
    "text" : "No. It was it was blatant. Ricky Trill was all alone."
  },
  {
    "text" : "So much so that the Yeah because it was a bad play by Terrence Shaw.",
    "speaker" : "Greg",
    "timestamp" : "01:19:15-01:19:19"
  },
  {
    "timestamp" : "01:19:20-01:19:23",
    "speaker" : "Andy",
    "text" : "There was, but it was still an illegal pick play."
  },
  {
    "timestamp" : "01:19:23-01:19:36",
    "speaker" : "Greg",
    "text" : "No. I fucking I can't ble I can't even believe you guys are bringing that up Usually usually I can tell when you're gonna be like the Patriots got shaft get on this one. That one never even crossed my mind."
  },
  {
    "timestamp" : "01:19:36-01:19:38",
    "text" : "Yeah, that's that's the thing.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:19:38-01:19:39",
    "text" : "No, I just bad deep."
  },
  {
    "timestamp" : "01:19:40-01:19:43",
    "text" : "Maddie called out. He called it a little pick. Yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Like, wow that's a pick play.",
    "timestamp" : "01:19:43-01:19:44"
  },
  {
    "text" : "Well he didn't say a little rub. It did. Well, he would have called it what it is. Was that illegal? A penalty. I don't know.",
    "timestamp" : "01:19:44-01:19:54",
    "speaker" : "Greg"
  },
  {
    "text" : "He might have even said got away with a little pick.",
    "speaker" : "Steve",
    "timestamp" : "01:19:54-01:19:57"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:19:57-01:20:06",
    "text" : "Yeah, I feel I feel like I feel like it was illegal, but it wasn't as um as focused on back in the day."
  },
  {
    "speaker" : "Greg",
    "text" : "This shit never got called.",
    "timestamp" : "01:20:06-01:20:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's so I mean it it's a touchdown and it counted so fuck it. Patriots will battle through that. But yeah, Ricky Prohl, the uh He of Dynasty fame scores a touchdown.",
    "timestamp" : "01:20:08-01:20:20"
  },
  {
    "text" : "Shampoos his way into the end zone. Shampoo.",
    "timestamp" : "01:20:20-01:20:23",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "That's right. Prolls his way into the end zone. And uh now we we've got our Celsi game with how much time left? Under a minute?",
    "timestamp" : "01:20:23-01:20:32"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:20:32-01:20:34",
    "text" : "Yeah, no, one 137."
  },
  {
    "timestamp" : "01:20:35-01:20:38",
    "speaker" : "Andy",
    "text" : "Because when they scored the touchdown? It took yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "It took them a total of like twenty-four seconds to score that touchdown.",
    "timestamp" : "01:20:38-01:20:45"
  },
  {
    "timestamp" : "01:20:46-01:20:47",
    "speaker" : "Andy",
    "text" : "And three plays."
  },
  {
    "text" : "Three plays, eighteen, eleven, and then twenty-six. So that that kind of puts in context what you're thinking of when Madden's like, uh, maybe they shouldn't be doing this. Yeah. Like you throw three incompletions. And then punt. They don't even need to get a touchdown in four seconds. Yeah. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:20:47-01:21:04"
  },
  {
    "text" : "Yeah, exactly. But like flip side to that is like if you go to overtime, like what's gonna happen there too, right? Right, exactly.",
    "timestamp" : "01:21:04-01:21:10",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that makes sense. 'Cause it's like you just got you gotta win it now. You put your you you did everything right to get it to here. You put yourself in a position to win this game. You can't Like back down now, you know?",
    "timestamp" : "01:21:11-01:21:22"
  },
  {
    "timestamp" : "01:21:23-01:21:29",
    "speaker" : "Steve",
    "text" : "Yeah, and I had a I had a football or not football because he talked about that and he said, Do you have you have to let them all hang out?"
  },
  {
    "timestamp" : "01:21:29-01:21:33",
    "text" : "Mm. Well that is we all know what that means.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That's a real one. Yeah. I'll let them all hang on over to the stuff. Does that mean that's what what we're talking about there, right?",
    "timestamp" : "01:21:33-01:21:39"
  },
  {
    "text" : "Yeah, no, he's little John Madden said you just gotta flop your cock and let's go.",
    "speaker" : "Steve",
    "timestamp" : "01:21:39-01:21:43"
  },
  {
    "speaker" : "Greg",
    "text" : "Just let him hang, baby. But why uh uh I've never really under whenever I hear that term, I think like saggy titties in my head.",
    "timestamp" : "01:21:43-01:21:52"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:52-01:21:55",
    "text" : "Is that not what it Well I mean yeah that's the female thing."
  },
  {
    "speaker" : "Greg",
    "text" : "Well them hang out, I mean your balls. Yeah. Is that But then w w what are you doing?",
    "timestamp" : "01:21:56-01:22:02"
  },
  {
    "speaker" : "Andy",
    "text" : "You just pull them around your cock and Well no, you let everything hang out, but it's it's mainly focused on the ball so they can swing. Because I'll do that.",
    "timestamp" : "01:22:02-01:22:08"
  },
  {
    "speaker" : "Steve",
    "text" : "If that means the Patriots are gonna win, I'll do it.",
    "timestamp" : "01:22:10-01:22:13"
  },
  {
    "text" : "I'll do anything for a win.",
    "timestamp" : "01:22:14-01:22:15",
    "speaker" : "Andy"
  },
  {
    "text" : "Did I ever tell you about that time that before Kelly and I were dating when I was at her apartment when she wasn't there? Because we were friends, obviously. No. And she had left her laptop open. And I I pulled my nutsack out of my jeans and like it threw the zipper. And I took a photo with her computer and made her background just a full-size picture of my nuts hanging out. So she opened her computer in class. Oh no. And was just staring at my big old bag of nut. Oh your little old squirrel brain there. Oh man. And then we found love and we got married. Which is not false. So back to the biggest drive of yeah of Brady hanged it off right?",
    "timestamp" : "01:22:16-01:23:15",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:23:16-01:23:31",
    "text" : "Well before that, um we gave Mike March shit about putting um Falk back there for well the page do the exact same thing with Troy Brown. We're trying to kick off. Oh back to the 17 yard line."
  },
  {
    "text" : "Yeah, and he basically nine seconds just running around. Yeah, coaching. Yeah.",
    "timestamp" : "01:23:31-01:23:35",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:23:35-01:23:39",
    "text" : "Oh, all right. You're just gonna go out there. Well, you do not agree.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I mean, like I said, Patrick Pass, surprisingly a good return. It wasn't like they weren't getting nothing out of the return game.",
    "timestamp" : "01:23:39-01:23:45"
  },
  {
    "speaker" : "Greg",
    "text" : "Right. Or Or if you're gonna do something like that, have a play in your back pocket. Like maybe I may I don't know, maybe there was something like Troy handles punts, right?",
    "timestamp" : "01:23:45-01:23:56"
  },
  {
    "speaker" : "Steve",
    "text" : "And he's got that short ear quickness, like That makes more sense than taking Marshall Falk and be like, all right, we need a spark Marshall. Go out there and return this kick. Like, what? For the first time.",
    "timestamp" : "01:23:57-01:24:07"
  },
  {
    "speaker" : "Greg",
    "text" : "I wasn't there a play in a an important game where the Pats tried this and they did like a one of those reverse ones? Sounds vaguely feeling. Maybe we'll get to that somewhere down the road. But the I expected that to be coming and then it like failed miserably Which is yeah. Yeah. So I mean this is similar, but it's I looked at it I didn't seem like they had a plan, you know?",
    "timestamp" : "01:24:12-01:24:34"
  },
  {
    "text" : "Yeah, yeah. Marshall Falk returned one punt in two thousand, one in two thousand four. No, one kick. Yeah.",
    "timestamp" : "01:24:35-01:24:43",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "What about for the Colts?",
    "timestamp" : "01:24:44-01:24:46"
  },
  {
    "timestamp" : "01:24:46-01:24:49",
    "speaker" : "Steve",
    "text" : "No, this is entire career stats. Three returns."
  },
  {
    "timestamp" : "01:24:50-01:24:57",
    "text" : "What about in college? San Diego State. He's an Aztec. He was.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I had his football card.",
    "timestamp" : "01:24:57-01:24:58"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know. I'm on pro football focus or pro football reference.",
    "timestamp" : "01:24:58-01:25:02"
  },
  {
    "timestamp" : "01:25:02-01:25:03",
    "speaker" : "Andy",
    "text" : "They have a college one."
  },
  {
    "speaker" : "Greg",
    "text" : "They do not have an arena football one. I learned that the other night too.",
    "timestamp" : "01:25:03-01:25:08"
  },
  {
    "timestamp" : "01:25:08-01:25:11",
    "speaker" : "Steve",
    "text" : "Andy, it sounds like you're gonna do it."
  },
  {
    "text" : "What am I gonna do?",
    "timestamp" : "01:25:11-01:25:12",
    "speaker" : "Andy"
  },
  {
    "text" : "Um he had Two kick returns in college.",
    "speaker" : "Steve",
    "timestamp" : "01:25:13-01:25:17"
  },
  {
    "timestamp" : "01:25:20-01:25:27",
    "speaker" : "Andy",
    "text" : "Sorry, so maybe this wasn't his thing. Yeah. So when John Madden said he'd done it before, he meant once. Yes."
  },
  {
    "speaker" : "Greg",
    "text" : "John Mann just got stat checked 20 years later. That'll teach him.",
    "timestamp" : "01:25:28-01:25:34"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:25:34-01:25:39",
    "text" : "But I'm with you, Greg. I feel that it was overthinking it, right? Just put Patrick Pass back there. He's done a good job. That's what he does every day."
  },
  {
    "text" : "It was a surprise. Or if you're gonna have a something like have a have something like unique, you know?",
    "timestamp" : "01:25:40-01:25:45",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:25:45-01:25:46"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:25:46-01:25:47",
    "text" : "Like a Frank Wy check."
  },
  {
    "timestamp" : "01:25:49-01:25:53",
    "speaker" : "Steve",
    "text" : "Falk started on the six, Troy started on the seventeen, it's eleven yards better. That's right."
  },
  {
    "text" : "And one super. So what's your favorite play on this last drive?",
    "timestamp" : "01:25:54-01:25:59",
    "speaker" : "Andy"
  },
  {
    "text" : "We all know the favorite play.",
    "speaker" : "Steve",
    "timestamp" : "01:25:59-01:26:00"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:26:01-01:26:05",
    "text" : "Well, all right, what's your second favorite players obviously Troy Brown? What's your second favorite?"
  },
  {
    "speaker" : "Greg",
    "text" : "The intentional grounding they didn't call. Yeah.",
    "timestamp" : "01:26:05-01:26:09"
  },
  {
    "text" : "He was out of the pocket. I knew you'd say that. I don't know if he was. It was a receiver in that general vicinity. Yeah. There was somebody running a go route down there, but he wasn't that close.",
    "timestamp" : "01:26:10-01:26:23",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "It was 41 seconds. They're on the 30. Like it's getting like he don't have a lot of light there. And then he dumps it again to JR for the third time in a row. And this is the one where he like makes a guy miss and like barely gets out of bounds and like fumbles it as he's getting out of bounds after the first down. Yeah. Yeah. He stays in bounds there, like we're kind of fucked. Like on the 40 and the clock is ticking. Yeah. Yeah.",
    "timestamp" : "01:26:24-01:26:48"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. And like you You'll see that like type of play maybe like once a season at like just randomly in college or NFL. And every time I see it, I go, that's the JR Redman play.",
    "timestamp" : "01:26:49-01:27:01"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:27:02-01:27:03",
    "text" : "Got out of bounds."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:27:03-01:27:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Or more often you'll see the guy doesn't get out of bounds, like tries to get a couple more yards and gets like three more yards, but wastes 30 seconds doing it.",
    "timestamp" : "01:27:05-01:27:12"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. But it is a smart move to do that little like Think if you think you can get back out of bounds, because that player, that defense is playing you right thinking you're walking out.",
    "timestamp" : "01:27:12-01:27:22"
  },
  {
    "text" : "Right. Oh yeah, yeah. Allow them to get out of bounds.",
    "timestamp" : "01:27:22-01:27:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, it was a smart move.",
    "timestamp" : "01:27:25-01:27:26"
  },
  {
    "timestamp" : "01:27:27-01:28:15",
    "text" : "Yeah. Yeah. So I do that twice because Troy Brown did the same thing on that deeper cross. Gets the ball, gets as many yards as you can going forward, then just steps out of bound. Yep. But always running towards. Um, I thought a sneaky big play was the one after that though, because they're I think that puts them at the 36 after Troy Brown's catch. Yeah. Uh So now I think it would have been a fifty-two or fifty-three yard field goal, Madden was saying, or something. And uh so then they still run one more play. Brady finds Wiggins, his redemption, because he dropped a big one earlier. Yes, he did. That almost got picked. He batted it straight up. Scared the shit out of me. Uh so Wiggins for six yards down to the 30, and then the uh iconic Brady spiking the ball and catching it with one hand and just holding it there.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:28:16-01:28:18",
    "text" : "Or great commentating from John Madden there."
  },
  {
    "speaker" : "Greg",
    "text" : "Yes. Yes. Iconic commentary too.",
    "timestamp" : "01:28:18-01:28:21"
  },
  {
    "speaker" : "Steve",
    "text" : "Yep. Walk me through it. Uh he said like what Brady did just gave me chills or something like that.",
    "timestamp" : "01:28:21-01:28:26"
  },
  {
    "text" : "Oh yeah, it gave him goosebumps. That gave me goosebumps. It actually did. It gave me goosebumps when you said that. I think he said something like what that kid right there just did. Yeah. Yeah. Because he was. He's a kid. Yeah.",
    "timestamp" : "01:28:26-01:28:42",
    "speaker" : "Greg"
  },
  {
    "text" : "He was, yeah. And then there's only one more play left.",
    "timestamp" : "01:28:42-01:28:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "And that's an iconic call. It that's got made in Gil Santos. Dude, I have it up right now Oh, I'm through my headphones though.",
    "timestamp" : "01:28:46-01:28:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, no, I'll uh I'll I'll plug it in here and post.",
    "timestamp" : "01:28:56-01:28:59"
  },
  {
    "speaker" : "Greg",
    "text" : "Can we do our best impression?",
    "timestamp" : "01:28:59-01:29:01"
  },
  {
    "speaker" : "Andy",
    "text" : "Give it to me. It's good! It's good. Kick is on the way and it is gone. It's gone And then they're all just like laughing maniacally in the background. Dude, his voice uh disappeared. Set to go. Snap all down. Kick is on the way and it is gone! It's gone! It's gone! That of the Terry! Move to forties, eight-yard field goals! And the game is over. And the Patriots are superman. The Patriots are super valid. The Patriots are Super Bowl champions!",
    "timestamp" : "01:29:01-01:29:51"
  },
  {
    "timestamp" : "01:29:52-01:29:53",
    "speaker" : "Steve",
    "text" : "So electric."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I just got Google again.",
    "timestamp" : "01:29:53-01:29:55"
  },
  {
    "timestamp" : "01:29:55-01:30:02",
    "speaker" : "Greg",
    "text" : "The like the First part of that like brings me back to childhood, like listening to games in the car."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:30:02-01:30:03"
  },
  {
    "text" : "We used to always call out the hash mark. Yeah, maybe it's be like left or right, or you know, like the best radio commentator I remember.",
    "timestamp" : "01:30:03-01:30:10",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:30:10-01:30:15",
    "text" : "Oh yeah. He would paint that picture immediately. I mean just like visualize it when you're not watching it.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I never like paid any attention to it.",
    "timestamp" : "01:30:16-01:30:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:30:19-01:30:24",
    "text" : "I always did. You? Yeah. Because I always used to try picture in my mind."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh.",
    "timestamp" : "01:30:24-01:30:24"
  },
  {
    "text" : "I never really paid attention either, Greg. Yeah.",
    "timestamp" : "01:30:24-01:30:27",
    "speaker" : "Steve"
  },
  {
    "text" : "I mean it was cool like filler noise that like now looking back is nostalgic, but I never was like, all right, okay, it's on the near hash, left or right. Okay. You know, I never did it.",
    "timestamp" : "01:30:27-01:30:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:30:36-01:30:50",
    "text" : "But I I never realized I did it until He retired and the new guy with Society started doing it and he doesn't do that. And it started driving me nuts. I'm like, what what's going on? Like where's the ball? I don't understand. What down is it? How like what's the down and distance?"
  },
  {
    "timestamp" : "01:30:51-01:31:02",
    "speaker" : "Greg",
    "text" : "It's sneaky cool like starting a game on the radio and then like you get to your house and you start watching it on TV. Yeah. I'm being like this is what not what I have pictured in my head at all."
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly.",
    "timestamp" : "01:31:02-01:31:03"
  },
  {
    "speaker" : "Steve",
    "text" : "It's all like Some games where we would mute the TV and put the radio in front of it.",
    "timestamp" : "01:31:03-01:31:08"
  },
  {
    "timestamp" : "01:31:09-01:31:10",
    "speaker" : "Andy",
    "text" : "Ah, so much better. Yeah."
  },
  {
    "timestamp" : "01:31:10-01:31:18",
    "speaker" : "Steve",
    "text" : "Also, and aga again I saw this on that YouTube video I just watched on the Gil and Gino call. Charles Johnston, not even excited."
  },
  {
    "text" : "Oh yeah, he was flight to the city.",
    "timestamp" : "01:31:18-01:31:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:31:26-01:31:43",
    "text" : "Well he was listening to Pat Summerell's call, so it wasn't that And it is good. The Patriots are Super Bowl champions. Unbelievable. He he did say unbelievable, but like in the least in the most believable tone you could imagine."
  },
  {
    "text" : "Oh good Lord.",
    "timestamp" : "01:31:45-01:31:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I think that was a thing though, wasn't it? Like the monotone uh play-by-play people. Probably, yeah. Yeah. 'Cause I I think uh let's Joe Buck is trained in similar fashion, you know, where they're supposed to like maintain, like not do what's going on.",
    "timestamp" : "01:31:47-01:32:04"
  },
  {
    "text" : "Supposed to report what's going on, yeah. Right. And the color guy.",
    "timestamp" : "01:32:04-01:32:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:32:08-01:32:24",
    "speaker" : "Greg",
    "text" : "Not Gil Santos though, huh? I mean he had it together. Yeah. The best part is like he has it for like the first 10 seconds of that. And then he's like Fuck this. I'm solid, maybe. Yeah. You can just go ahead."
  },
  {
    "speaker" : "Steve",
    "text" : "And you're right, the people in the background just go nuts like in the studio with them. F",
    "timestamp" : "01:32:26-01:32:30"
  },
  {
    "timestamp" : "01:32:30-01:32:36",
    "speaker" : "Andy",
    "text" : "Yeah. Oh yeah, that was the best part. You can hear everybody in the background. So good."
  },
  {
    "timestamp" : "01:32:37-01:32:40",
    "speaker" : "Greg",
    "text" : "And Wani Packs, him runs down, does the snow angel."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. It just bring you right, Greg. It brings right back. I remember like standing up and and punching the ceiling so hard that I like shredded my knuckles on the the popcorn ceiling. I think dad did the same thing.",
    "timestamp" : "01:32:40-01:32:51"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:32:52-01:32:52"
  },
  {
    "text" : "Because every time I talk, he's still that's still the first thing he's he talks about is scraping his usual.",
    "speaker" : "Andy",
    "timestamp" : "01:32:52-01:32:56"
  },
  {
    "timestamp" : "01:32:57-01:33:00",
    "text" : "Fucking set of balls on Adam and Atari, huh? Dude.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:33:02-01:33:05",
    "text" : "48 yarder, that could have been a 50 something."
  },
  {
    "text" : "Yeah. With uh with a stat on the screen that says has never missed a field goal in a dome. Yeah. And he just says, fuck you, buddy.",
    "timestamp" : "01:33:05-01:33:15",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:33:16-01:33:17",
    "speaker" : "Andy",
    "text" : "God damn right I haven't."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:33:17-01:33:21",
    "text" : "And then they bring that setup every single time it kicks in the dumb, too. Yeah."
  },
  {
    "timestamp" : "01:33:21-01:33:34",
    "text" : "Yeah. Oh, another stat that uh I forgot was um The New England Patriots, uh early in the fourth quarter, they showed a stat their eleven and oh record when leading after three quarters. So the Patriots were twelve and oh.",
    "speaker" : "Andy"
  },
  {
    "text" : "After leading in season in the in the their franchise history. I think it was that season.",
    "timestamp" : "01:33:34-01:33:41",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:33:43-01:33:45",
    "speaker" : "Andy",
    "text" : "Well it may hard to tell."
  },
  {
    "text" : "I think I thought I heard him say that Brady was the youngest quarterback to win a Super Bowl at that point.",
    "timestamp" : "01:33:45-01:33:50",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:33:50-01:33:52",
    "text" : "He was the third youngest to play.",
    "speaker" : "Mom"
  },
  {
    "text" : "Well talk about how times have changed, huh?",
    "timestamp" : "01:33:52-01:33:55",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:33:55-01:33:55",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:33:55-01:33:57",
    "text" : "I don't think that's the st on the other. Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "He's got that and the oldest, right?",
    "speaker" : "Steve",
    "timestamp" : "01:33:57-01:33:58"
  },
  {
    "timestamp" : "01:34:01-01:34:09",
    "text" : "Oh he doesn't have it. Yeah, he doesn't anymore. He's definitely the oldest. I think it's Big Ben now. To win? The youngest to win a Super Bowl.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh really?",
    "timestamp" : "01:34:10-01:34:11"
  },
  {
    "text" : "Yeah. That's a pretty sick uh like book end to your career though, right? The youngest quarterback to win a super bowl at the time and then the oldest to win a super bowl at the time. Like that that kind of speaks to Brady's legacy, right? And it's still going if we're on it. It's 2020.",
    "timestamp" : "01:34:11-01:34:27",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:34:29-01:34:29",
    "speaker" : "Steve",
    "text" : "Fuck him."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he was twenty-five when he He had barely raped his first woman at that point. God damn. We'll cut that part. I just like my mind instinctively goes to rape when I hear the name Ben Roth isburgh.",
    "timestamp" : "01:34:30-01:34:46"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:34:47-01:34:48",
    "text" : "Jeez."
  },
  {
    "speaker" : "Andy",
    "text" : "All right, so let's do some best and worst. Greg, what are your best and worst of this game?",
    "timestamp" : "01:34:49-01:34:55"
  },
  {
    "speaker" : "Greg",
    "text" : "Um Can I phone a friend?",
    "timestamp" : "01:34:56-01:34:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes.",
    "timestamp" : "01:35:00-01:35:00"
  },
  {
    "timestamp" : "01:35:01-01:35:07",
    "speaker" : "Greg",
    "text" : "Andy, what are your best? Let me you guys go first. I haven't thought of I haven't."
  },
  {
    "text" : "All right. All right. Um and we've talked about most things. Uh a couple of my favorite small things. Uh Troy Brown, when David Patton scored his touchdown, was so busy celebrating. They showed a picture of Troy Brown going and getting the football. And like carrying it back to the sideline for uh for Patton so we could keep it. Which just feels like such a typical Troy Brad. And then also uh they did the halftime interview with Bill Belatrac Like so uh what what second half adjustment do you do you think we need to make? It's like uh stay out of long yardage on offense. And that was it.",
    "timestamp" : "01:35:07-01:35:43",
    "speaker" : "Andy"
  },
  {
    "text" : "Ron Pitts. That was one of those interviews where he's like, I know this is gonna suck. I'm gonna ask him one question and then send it right back up. Yeah.",
    "timestamp" : "01:35:43-01:35:52",
    "speaker" : "Greg"
  },
  {
    "text" : "Well Bat Summerall said he's gotten easier to talk to. Yeah. Billy Felic has gotten easier to converse with. That was legit. Jesus.",
    "timestamp" : "01:35:52-01:36:00",
    "speaker" : "Steve"
  },
  {
    "text" : "And then my worst was um The T the broadcast, the the little ihnography in the corner, whenever it was fourth down, the fourth the the down and distance marker would show as yellow. Hmm. So it showed up every after every third down play, it showed up as yellow, which is exactly where they put the flag on the field marker as well, in yellow.",
    "timestamp" : "01:36:01-01:36:20",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:36:21-01:36:52",
    "text" : "So every third down play I thought there was a Oh that's that's that's good lead in to my my worst is is like that feeling When your team like this is the Tobaki Jones in in reference to that, the the touchdown call back, that feeling when your team makes a huge play and you hear the announcer go, Oh, there's a flag in the field and you're just like, fuck. You know, there's nothing it's really the worst feeling ever. Because you go from the highest of highs down to the lowest of lows, you know",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:36:52-01:36:53",
    "speaker" : "Andy",
    "text" : "So true, yeah."
  },
  {
    "timestamp" : "01:36:53-01:37:06",
    "speaker" : "Greg",
    "text" : "And you're just like sitting there hoping and praying that it's not against your team. And you're like yelling at the TV, like, just tell us what the fuck it is. You know, like you're losing patience immediately. Like it's been two seconds, you're already yelling at the reps. Like"
  },
  {
    "text" : "Figure it out.",
    "speaker" : "Andy",
    "timestamp" : "01:37:07-01:37:08"
  },
  {
    "timestamp" : "01:37:10-01:37:18",
    "text" : "And look, let me see this replay. Let me see this replay. You're like preemptively mad at me. Dude, that was within five yards.",
    "speaker" : "Greg"
  },
  {
    "text" : "Exactly. Oh fuck.",
    "speaker" : "Andy",
    "timestamp" : "01:37:20-01:37:22"
  },
  {
    "text" : "All right. And my best. Um it's just the image seared in my mind. I think this is Antoine Smith. Yes. When they show that back screen and he's like high stepping onto the field with his helmet in his hand, I always that that's like burned in my mind, in my memory. Yeah, it's just I don't know. It's just a cool, unique reaction. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:37:23-01:37:46"
  },
  {
    "speaker" : "Andy",
    "text" : "And Belichick hugging Lawyer Malloy and his daughter.",
    "timestamp" : "01:37:46-01:37:49"
  },
  {
    "speaker" : "Greg",
    "text" : "Pretty cool. Yeah. Yeah. There were there were a lot of images that were like seared in my memory from this game. You know? Oh god, yeah. Like obviously him catching the ball with the one hand. Yep. You know, even Kil Santos's call, like those certain like things that just you'll probably never forget, right? Oh yeah. Yeah. Never. I mean if I haven't forgot it in 20 years, I can't imagine.",
    "timestamp" : "01:37:52-01:38:15"
  },
  {
    "timestamp" : "01:38:16-01:38:17",
    "speaker" : "Andy",
    "text" : "Never happening. Yeah. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Although I've done a fair amount of drugs, so I mean you're the one really working against it, so you still don't remember it.",
    "timestamp" : "01:38:17-01:38:25"
  },
  {
    "text" : "All right, Steve, what's your best and worst?",
    "timestamp" : "01:38:25-01:38:27",
    "speaker" : "Andy"
  },
  {
    "text" : "My worst. Outside of listening to Pat Sumraw was you can never tell how many timeouts are left on it either. Yeah. Right? So you never because like everyone's just throwing timeouts around willy-nilly and you're like, well, well, what number timeout was that? And like nowadays, all like the on-screen graphics will tell you how much timeouts they have left. Yep. Yeah. This one's played it out and distance. All season it wasn't like that. Like none of them just had like timeouts left.",
    "speaker" : "Steve",
    "timestamp" : "01:38:27-01:38:51"
  },
  {
    "timestamp" : "01:38:51-01:38:53",
    "speaker" : "Andy",
    "text" : "Yeah. Yep. No, I agree."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:38:54-01:39:12",
    "text" : "And then the best is just like rewatching the game. Like if you got two hours, a little under two hours, it's definitely worth it. Just cause there's so many little pieces in there I was like man if that had gone differently or if that'd gone differently this whole thing would have been different and it's just awesome to like Experience the whole thing again."
  },
  {
    "text" : "Yeah, it's better than highlights because you get like that feeling of the flow of the game. Like even the way the announcers are talking about things where they're like, Oh The Rams, you know, they could get back into this game and you're like, I remember feeling that anxiety at the time.",
    "speaker" : "Greg",
    "timestamp" : "01:39:12-01:39:26"
  },
  {
    "speaker" : "Steve",
    "text" : "We've all watched that last drive, right? So I can you everyone knows play by play on that last drive, but to like watch all the other plays leading up to it's definitely worth it.",
    "timestamp" : "01:39:27-01:39:34"
  },
  {
    "text" : "Yeah. It really is, yeah. J yeah, just sir just to remember the feeling before that that last drive. Yeah. Makes it just feel that well, I think we've done a uh a solid job on this two part Super Bowl special episode.",
    "timestamp" : "01:39:34-01:39:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yep, covered it like Tylaw covered Isaac Bruce.",
    "timestamp" : "01:39:48-01:39:51"
  },
  {
    "timestamp" : "01:39:52-01:39:55",
    "speaker" : "Andy",
    "text" : "Oh girl. All the way to the end zone."
  },
  {
    "timestamp" : "01:39:56-01:40:16",
    "speaker" : "Greg",
    "text" : "There was one play there when he like broke on Bruce's round. He ended up tripping, but it looked like he knew what uh Bruce was running before he did. And the the the filming practice thing did cross my mind at that time. I was like, there's no way anybody's that good."
  },
  {
    "text" : "Ty law.",
    "timestamp" : "01:40:18-01:40:19",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:40:19-01:40:22",
    "speaker" : "Greg",
    "text" : "It's Ty Law, yeah, so I'm gonna give him the benefit of the doubt."
  },
  {
    "speaker" : "Andy",
    "text" : "And Dre Bly did that earlier uh later on in the game too.",
    "timestamp" : "01:40:22-01:40:25"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:40:26-01:40:28",
    "text" : "Yeah, on that crosser or that slant."
  },
  {
    "text" : "We knew what was coming. So maybe, maybe it's the other way around. Maybe Marshall Falk is so upset about this because he knows that Guilty Concepts actually did film it. it.",
    "timestamp" : "01:40:29-01:40:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It's like those like pastors that like preach about hating gays and then they're banging, you know choir boys on the side. Yeah.",
    "timestamp" : "01:40:41-01:40:49"
  },
  {
    "timestamp" : "01:40:49-01:40:52",
    "text" : "The Matten's bathroom with their stance too wide.",
    "speaker" : "Andy"
  },
  {
    "text" : "He hoff Doth protest too much, me says, or some shit like that. I definitely butchered that.",
    "speaker" : "Greg",
    "timestamp" : "01:40:52-01:40:59"
  },
  {
    "speaker" : "Andy",
    "text" : "You guys know it? Yeah, yeah. No, I think you're close enough.",
    "timestamp" : "01:41:00-01:41:04"
  },
  {
    "timestamp" : "01:41:04-01:41:11",
    "text" : "The the lady Doth protest. Something. Steve, you got it? Nope. You know what I'm talking about.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:41:12-01:41:16",
    "speaker" : "Andy",
    "text" : "I know what you're talking about, but I don't know what it was. Cool. I think you're close enough."
  },
  {
    "speaker" : "Greg",
    "text" : "I just butchered that.",
    "timestamp" : "01:41:16-01:41:18"
  },
  {
    "text" : "Uh I'll tag it.",
    "speaker" : "Andy",
    "timestamp" : "01:41:21-01:41:23"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, we'll put it in post edit. Yeah.",
    "timestamp" : "01:41:23-01:41:25"
  },
  {
    "timestamp" : "01:41:26-01:41:30",
    "speaker" : "Andy",
    "text" : "Something like that. Is this a royal way you're gonna do this for me?"
  },
  {
    "timestamp" : "01:41:31-01:41:59",
    "speaker" : "Greg",
    "text" : "You're right. I have no I I say this all the time. Like cut that out. I have no control over what's getting cut. Andy does it all. Yeah. And since this is the end of the season, shout out Andy Brown. For the organizing all the editing, all the internet database, the whole fucking nine yards Social media tweeting at Matt Chatham doing everything. Yeah, this isn't possible without you, Andy. And I've thoroughly thoroughly enjoyed it."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh good. I'm glad you guys enjoyed it.",
    "timestamp" : "01:41:59-01:42:01"
  },
  {
    "text" : "Yeah, it's been awesome.",
    "speaker" : "Steve",
    "timestamp" : "01:42:01-01:42:02"
  },
  {
    "timestamp" : "01:42:02-01:42:05",
    "text" : "And that's the only nice thing I'll say to you this year.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Well luckily the game's done, boys. I'll take it. Uh all I asked of you was six last a whole lot longer than I think any of us air. This is only the beginning, I think.",
    "timestamp" : "01:42:07-01:42:19"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:42:20-01:42:25",
    "text" : "Yeah, on to on to next year. Yeah. No days off. No days off."
  },
  {
    "text" : "Except for maybe wasn't two season.",
    "speaker" : "Andy",
    "timestamp" : "01:42:26-01:42:28"
  },
  {
    "text" : "We should just do some stupid episodes. Oh dude. I got some stuff down the rabbit hole last night of just kiss kiss merchant merchandising in general.",
    "timestamp" : "01:42:29-01:42:43",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Save it. Save it for 2002, baby. All right. All right, gentlemen, it's been a pleasure, and we will see you next season on the Patriots Dynasty Podcast.",
    "timestamp" : "01:42:44-01:42:53"
  },
  {
    "timestamp" : "01:42:53-01:42:59",
    "text" : "All right. See ya. See ya later. All right, let's play us out with It's a Beautiful Day.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:43:02-01:43:06",
    "speaker" : "Andy",
    "text" : "Then LaDuty Dirty. I bet you two would probably cut"
  }
]