[
  {
    "timestamp" : "00:00-00:19",
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid. You still want to listen? Go right ahead. I am not your mother.",
    "speaker" : "Mom"
  },
  {
    "text" : "Welcome back, to all of you who are still with us, and welcome for the first time if this is your first episode. If it is, that's kind of weird that you're starting at week 10, but we forgive you. Uh like I said, this is week 10 of the 2001 NFL season bestowed upon us by our Lord and Savior Thomas Patrick Edward Brady Jr. Did I get that right? I can never remember the order of the middle of that. I think so.",
    "timestamp" : "00:22-00:46",
    "speaker" : "Andy"
  },
  {
    "text" : "I I feel like you should be the third. It just sounds better.",
    "timestamp" : "00:46-00:50",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "00:50-00:59",
    "speaker" : "Andy",
    "text" : "Yeah. Thomas uh the third. Wasn't there a player who's who is the second? Yeah, uh Garden Minshew, the second."
  },
  {
    "timestamp" : "00:59-01:01",
    "text" : "Yes. And Philip Dorcette, right?",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:02-01:04",
    "text" : "I thought he was the third.",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:04-01:05"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05-01:17",
    "text" : "I think he's the third. Which makes sense, but you don't often see the second. But apparently it's because Uh it it's not his father's name, it's his grandfather's name. So he's technically not a junior, but he is a second."
  },
  {
    "speaker" : "Greg",
    "text" : "Hmm. Yeah.",
    "timestamp" : "01:17-01:19"
  },
  {
    "text" : "That's from the block. Yes, that's right. That's where I learned it from. So uh yeah, if you want to learn more about Gardner Flint Minshew, is that right? Mill name Flint? Uh you can go to brownbrosports. com and read Gregory's perusings about it. Loved it. But today we're going to be talking about what I'm going to posit as the most important loss of the Patriots dynasty.",
    "speaker" : "Andy",
    "timestamp" : "01:19-01:46"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:46-01:48",
    "text" : "Whoa, that's a bold statement."
  },
  {
    "timestamp" : "01:50-02:49",
    "speaker" : "Andy",
    "text" : "That's right. Coming out to shoot hot boys. Why do you say that? No. Um because This game, uh, we hadn't actually introduced the uh against where the greatest show on turf visited old Foxboro Stadium. Uh coming in red hot eight and one against the Pats who are just over five hundred at five and four. Uh this was the game I think that gave the Patriots the confidence that they could compete at a high level. Even though they didn't win the game, I think they took away from it that they were able to hang with the elite of the NFL. You disagree, Greg? Yep. Why? Well, what about that one? Well the the after what the fuck I meant the postgame locker room stuff. But definitely not congratulating them for losing this game."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "But Greg, do you remember the Kansas City game where the team uh basically lost their spirit. And then that last drive where Gronk got a touchdown and whatnot turned the whole season around because Belichick said that he saw fire in the team. That was a good loss.",
    "timestamp" : "02:49-03:06"
  },
  {
    "timestamp" : "03:06-03:09",
    "speaker" : "Andy",
    "text" : "The we're onto Cincinnati game. That's a good one too."
  },
  {
    "text" : "Yeah. Oh bullshit. Okay, I agree, but Let's let's give it to the listeners, okay?",
    "timestamp" : "03:09-03:16",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "03:16-03:21",
    "text" : "It's all hindsight, you know, because there's plenty of teams over the years that have lost terribly.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "03:21-03:32",
    "text" : "Oh okay, fine. Every loss sucks. Jesus Christ. Forget about story. Every loss sucks.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:34-03:36",
    "text" : "Oh, you are in a rare mood. Good God."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I know I told you. Sorry, guys.",
    "timestamp" : "03:36-03:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:39-03:42",
    "text" : "Do I have a mute button for Mike? I do, okay, just checking."
  },
  {
    "text" : "You should use it frequently today, I feel like.",
    "timestamp" : "03:42-03:44",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "I might. Guys, let's talk about the Rams then who I will still I'm I'm gonna I'm gonna stick with my take out of the bat. I think this was uh a positive in the long run in terms of the direction of the pages dynasty. So put them on the right direction So what?",
    "timestamp" : "03:45-04:07"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm sticking with my tape too, but your take is stupid.",
    "timestamp" : "04:08-04:11"
  },
  {
    "speaker" : "Andy",
    "text" : "Well that's fine.",
    "timestamp" : "04:11-04:12"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Nobody really cares what you I mean I I like the story of it, but uh Greg won me over every last blows, and there's no good that can come from it ever.",
    "timestamp" : "04:12-04:20"
  },
  {
    "speaker" : "Andy",
    "text" : "What about um people that lose in life?",
    "timestamp" : "04:20-04:23"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, they're losers.",
    "timestamp" : "04:23-04:25"
  },
  {
    "speaker" : "Andy",
    "text" : "Was it uh 2004-ish? Oh, actually, here's a better one. The Patriots uh lose in 06 in the AFC championship game to the Colts. And that opens up opens the eyes of the coaching staff that Brady needs help. And they go out and get Welker and Moss and light the league on fire.",
    "timestamp" : "04:26-04:50"
  },
  {
    "text" : "And accomplish nothing at the same time.",
    "speaker" : "Mike Melo",
    "timestamp" : "04:51-04:53"
  },
  {
    "speaker" : "Andy",
    "text" : "Was well, I wouldn't say nothing. You just accomplish exactly everything.",
    "timestamp" : "04:53-04:58"
  },
  {
    "timestamp" : "04:59-05:03",
    "speaker" : "Mike Melo",
    "text" : "Sour spot there. See again. Scratch this from the uh podcast, man."
  },
  {
    "speaker" : "Andy",
    "text" : "I'm just gonna delete your entire audio from this one. I think it's gonna be.",
    "timestamp" : "05:04-05:07"
  },
  {
    "timestamp" : "05:07-05:10",
    "text" : "Yeah, it's fine. Can I just hang back and drink my rum?",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:11-05:11",
    "text" : "Do it."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "05:12-05:12",
    "text" : "Okay."
  },
  {
    "text" : "Uh so yeah, speaking of the Rams, uh, they will finish the season fourteen and two. Uh first in the NFC West, obviously. Uh their only only losses this season were to the seven and nine Saints randomly in week seven. And then against the nine and seven Bucks. In week 11, which is directly after this game. So I think this may have also led to the uh loss directly after this. this game just because of how hard it was played and how close it was. I'm sticking with it too.",
    "speaker" : "Andy",
    "timestamp" : "05:12-05:46"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I'll give you that. That makes sense to me unless uh Greg can sway me on that.",
    "timestamp" : "05:47-05:52"
  },
  {
    "timestamp" : "05:53-05:54",
    "speaker" : "Andy",
    "text" : "I'm sure he'll try."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "05:54-05:57",
    "text" : "Were those divisional games? What division were they in?"
  },
  {
    "text" : "NFC West. Um That's a good question, because that was before the realignment.",
    "timestamp" : "05:57-06:03",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "06:04-06:10",
    "speaker" : "Greg",
    "text" : "Yeah, because I feel like I don't know why I always think they're in the same division as the Falcons."
  },
  {
    "text" : "So they yeah, so the NFC West back then was Rams, 49ers, Saints, Falcons, Panthers. And so the final standings, Rams obviously 14 and 2, like we said. 49ers 12 and 4. And then nobody else above 500. Saints were 7-9, Falcons 7-9, Panthers 1-15. Which we will see them later in the podcast.",
    "timestamp" : "06:11-06:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah. Yep.",
    "timestamp" : "06:34-06:35"
  },
  {
    "speaker" : "Andy",
    "text" : "So this uh was like we touched on before, part of the greatest show on turf era. Uh they the offense would score 503 points this year, which was seventh most all time at the time. Um which was I think more impressive because this was before the explosion of offensive production. Uh you can see, you know, rookie quarterbacks these days throwing for fifty touchdowns, but back then that was unheard of So um, but as part of this, you know, Greater Show on Turf, the reason it was called that is because the year before this they put up five hundred and forty points, which was third all time at the time. And the year before that, in 99, they put up 526 points, which was fourth all-time at the time. So they're putting up top ten all-time scoring numbers every year for three years in a row. And uh as part of that, in this, it was alluded to by one of the commentators that the Rams had scored coming into this game 31 touchdowns, and they had only punted 23 times on the season coming into the game. And so I went down a bit of a rabbit hole today at lunch and forgot to eat lunch because of it. But I decided that I would look up um how many times teams have finished with more touchdowns than punts on a season. And there were there were 34 of them, believe it or not. And I'm pretty sure you could probably name maybe half of them off the top of your head. But in terms of the punt differential, the punt touchdown differential, if you will, how many more touchdowns and punts there were. Uh who would you guess would be at the top of that list?",
    "timestamp" : "06:36-08:23"
  },
  {
    "speaker" : "Greg",
    "text" : "With the most punts or the least amount of punts?",
    "timestamp" : "08:26-08:28"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:28-08:34",
    "text" : "No, the the the most uh more touchdowns and punts, like the biggest positive difference."
  },
  {
    "text" : "Patriots, oh seven.",
    "timestamp" : "08:38-08:40",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "08:40-08:40"
  },
  {
    "text" : "Is that correct?",
    "timestamp" : "08:41-08:42",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "08:42-09:15",
    "speaker" : "Andy",
    "text" : "That is correct. They had Seventy-five touchdowns, which is I think second all time to that, was it 2013 Broncos, was it? Uh yeah, 2013 Broncos had 76 touchdowns on the year. The 07 Pats had 75. But the difference in punting was that that Broncos team punted 66 times that year. So they're only plus 10. The Patriots in 07 punted 45 times. So they were a plus 30 on the season in terms of touchdowns to punts."
  },
  {
    "text" : "Mike, thoughts on punters?",
    "timestamp" : "09:16-09:18",
    "speaker" : "Greg"
  },
  {
    "text" : "I love them. Um so I'm I'm just enjoying my my oak heart rum and listening to this fabulous conversation about a lot. Beautiful. What was that? Is that a free plug? Um, it can be. I mean we can work it out. Tell me about OPAR It's not bad. It does. It goes out. You can sip it. You can chug it if you really want to. I would I don't recommend that. And um, you know, you can find it for like ten, twelve bucks. It's not too bad.",
    "speaker" : "Mike Melo",
    "timestamp" : "09:18-09:48"
  },
  {
    "speaker" : "Andy",
    "text" : "Does it help ease the pain?",
    "timestamp" : "09:48-09:50"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "It's making this show go a lot better.",
    "timestamp" : "09:51-09:53"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh boy. You say that now, but we're not even halfway done.",
    "timestamp" : "09:55-09:59"
  },
  {
    "text" : "I know. Here's a hot take. In uh in ten years, they were that number's gonna skyrocket more teams in the NFL. Then not will have more touchdowns and punts.",
    "timestamp" : "09:59-10:10",
    "speaker" : "Greg"
  },
  {
    "text" : "So yes, I think you're right because to that point, um of the top four Uh two of those were this were uh the last two years. Kansas City number two last year with a plus twenty-six, and Baltimore this year, plus twenty-three.",
    "timestamp" : "10:11-10:28",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, the analytics say you shouldn't bunt.",
    "timestamp" : "10:29-10:31"
  },
  {
    "timestamp" : "10:31-10:31",
    "speaker" : "Andy",
    "text" : "Yep."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:31-10:35",
    "text" : "Yeah, because I think uh way more infrequently than they do."
  },
  {
    "timestamp" : "10:35-10:43",
    "speaker" : "Andy",
    "text" : "Yeah. Actually both teams in this uh upcoming Super Bowl The Chiefs and the 49ers are both on this this list."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yep. Now this will not be upcoming by the time you listen to this, y'all, so if we say anything stupid or inaccurate, well Tweet at us if we have a Twitter, then we do. Sweet. I didn't even know that.",
    "timestamp" : "10:43-10:56"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah. Yeah, I'm going.",
    "timestamp" : "10:57-10:58"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "10:59-11:00",
    "text" : "You're going to the Super Bowl?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "11:00-11:01",
    "text" : "I'm going to Miami."
  },
  {
    "timestamp" : "11:02-11:12",
    "text" : "Oh, well that's almost cool. I mean I was gonna say that you're you're big ballin' because the Super Bowl tickets are going for like nine grand at the moment. I know, what is that all about?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "11:13-11:35",
    "text" : "We got the Airbnb like around the time of Antonio Brown being signed. And then it didn't quite work out, but it was like on a round trip flight for 150 bucks, so might as well spend a weekend in my air. That sounds pretty good. Love it. I mean it'd be awesome if the Pats were playing, but it would be, but they're not.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "11:35-11:40",
    "speaker" : "Andy",
    "text" : "But that would that would have been a whole lot more expensive because uh you can't go down there and not go to the Super Bowl."
  },
  {
    "timestamp" : "11:40-11:43",
    "speaker" : "Greg",
    "text" : "No. That was a major concern of mine."
  },
  {
    "timestamp" : "11:45-11:47",
    "speaker" : "Andy",
    "text" : "Take out that second mortgage. It's all it's all good."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, exactly. Um Andy, was one of the uh teams that you're mentioning the Peyton Mannings Colts? Because I remember one year they that they it was a running gag that that punter just never did anything.",
    "timestamp" : "11:48-12:00"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:01-12:20",
    "text" : "Do you remember that yeah? There are the Colts are on here a couple times. Number 14 with a plus twelve in 2004. And then let's see where else. Uh the 28 and 29 back to back seasons of 07 and 06. They're both plus two."
  },
  {
    "timestamp" : "12:20-12:21",
    "text" : "Oh, alright.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "12:21-12:29",
    "speaker" : "Andy",
    "text" : "Oh, and they're also 32nd with a plus one. So they're on here a bunch. Yeah, they they definitely score more touchdowns than punts often."
  },
  {
    "text" : "That's punts. In the manning era. Punts",
    "speaker" : "Mike Melo",
    "timestamp" : "12:29-12:32"
  },
  {
    "timestamp" : "12:33-12:41",
    "speaker" : "Andy",
    "text" : "Punts. Alright, I'm glad you boys found that as fascinating as I did. That was definitely worth a a lunch break. Cool."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "12:42-12:44",
    "text" : "Well, I can tell that you didn't eat lunch."
  },
  {
    "speaker" : "Andy",
    "text" : "You can what?",
    "timestamp" : "12:45-12:46"
  },
  {
    "timestamp" : "12:46-12:48",
    "speaker" : "Greg",
    "text" : "I can tell that you didn't eat lunch."
  },
  {
    "timestamp" : "12:48-12:49",
    "speaker" : "Andy",
    "text" : "Oh, thanks."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "12:50-12:52",
    "text" : "I said that I enjoyed it. Thank you very much for sharing that."
  },
  {
    "timestamp" : "12:53-12:58",
    "text" : "You're very welcome. I I know how much you like uh punters and punt sets, so Put that together just for you.",
    "speaker" : "Andy"
  },
  {
    "text" : "Thank you. And I I loved it. Every minute of it. Every second of it. For all the people that are still listening, um, let us know how you feel about that whole conversation.",
    "timestamp" : "12:59-13:08",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "13:08-13:12",
    "speaker" : "Andy",
    "text" : "Yeah, Fogg, you can tweet us at uh Pat's Dynasty Info on Twitter. There you go."
  },
  {
    "text" : "Ooh.",
    "timestamp" : "13:13-13:13",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "That's sexy.",
    "timestamp" : "13:13-13:14"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "13:14-13:16",
    "text" : "Especially that info part."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:16-14:01",
    "text" : "Come get us, yeah. All right, uh the Rams, the architect of this greater show on turf, Mike Martz. Uh Mike He was pretty good. It was six seasons as the head coach from 2000 to 2005. Um so he was k he wasn't really the architect of this, I guess, now that I'm saying that. Um because this was already in place when he took over, wasn't it? So that's great. Um he was uh he kind of like drove this team to the ground a little bit. So he was fired after week five in two thousand five. So he didn't make it through the full season."
  },
  {
    "timestamp" : "14:02-14:29",
    "speaker" : "Mike Melo",
    "text" : "Um and uh I can add to that uh probably a reason why he petered out because I wrote down that he had a uh comment that They haven't uh the Rams hadn't faced a team like the Patriots with as speedy of receivers as they have. And I love Troy Brown, I love David Patton, but If if that's what you're putting out into the world, um it makes sense that you might be out of a job soon."
  },
  {
    "text" : "Yeah, I mean that's that's a great point. He yeah, he wasn't uh Uh but was that something that he said? I thought that was uh more on the defensive coordinator.",
    "speaker" : "Andy",
    "timestamp" : "14:30-14:41"
  },
  {
    "timestamp" : "14:41-14:47",
    "text" : "Oh, I thought it was him. I re I take back everything I just said if it was the defensive coordinator.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "14:47-14:51",
    "speaker" : "Andy",
    "text" : "Everything I apologize for that. I had that written down as uh a lovey smith quote."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "No, no, no. I say Mart said they had now I was kinda half paying attention, so I'm not sure, but I'm pretty sure. Uh Greg, could you uh look that up please? I'm on it.",
    "timestamp" : "14:51-15:02"
  },
  {
    "text" : "Yeah, it was the uh the the quote was Patriots wide receivers present the biggest challenge of the season, according to Levy Smith and this deep.",
    "timestamp" : "15:03-15:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "15:09-15:15",
    "text" : "Oh see, because the quote that I had was uh that they hadn't faced a team with receivers like the Patriots yet."
  },
  {
    "text" : "Yeah, yeah, I think they yeah, I think that was the continuation of the quote. Yeah, and how fast they were and said it, okay?",
    "speaker" : "Andy",
    "timestamp" : "15:15-15:23"
  },
  {
    "text" : "Maybe they both said it.",
    "speaker" : "Mike Melo",
    "timestamp" : "15:23-15:24"
  },
  {
    "speaker" : "Andy",
    "text" : "Maybe neither of 'em said it. Maybe we were lied to you by Joe Thysman. I mean he could yeah. I mean you never know. He doesn't look where they go.",
    "timestamp" : "15:24-15:33"
  },
  {
    "speaker" : "Greg",
    "text" : "I can't find it. I'm looking on Google, you know. Um",
    "timestamp" : "15:33-15:39"
  },
  {
    "timestamp" : "15:40-16:15",
    "speaker" : "Andy",
    "text" : "Alexa said the following quote. Uh So yeah, those are the only notable coaches, I think. There was Ken Zampezi, who was only really he was the wide receiver coach, only really Notable in air quotes because he's the son of the former Patriots offensive coordinator, Ernie Zampezi, back in ninety-eight-ninety nine. So I don't know how much of an effect he had on that. Although these commentators were all about this this wide receiving core."
  },
  {
    "text" : "Oh Andy. What the Rams? Yeah. What happened? Greg's chiming in.",
    "speaker" : "Mike Melo",
    "timestamp" : "16:16-16:20"
  },
  {
    "timestamp" : "16:21-16:27",
    "text" : "Well, if Andy's about to go on his fucking weekly rant about the uh commentator. I really like that.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I like the look, you know what? I think it's this is a rarity, but I don't have a football or not football because I think I got everything that they were talking about.",
    "timestamp" : "16:28-16:35"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I thought it was Mike Patrick, uh Paul McGuire, and Joe Thisman. And I thought Joe Thizeman was the original Tony Romo. Like his points were a big point. He was pointing things up before they happened",
    "timestamp" : "16:36-16:51"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "A little fun.",
    "timestamp" : "16:52-16:52"
  },
  {
    "timestamp" : "16:53-16:56",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, he was at yeah, he was having a good time with people."
  },
  {
    "text" : "That's what that's what makes a good commentator is like Just having fun.",
    "speaker" : "Greg",
    "timestamp" : "16:56-17:01"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but also knowing the game too. Like it it's not like listen to Dan Deerdorf being like, I can't understand why they're throwing a flag. Like Joe Thysman actually knew the rules and could explain them to you in real time as it's happening instead of twenty minutes later when he's been told by you know, whatever research staff he has, the Greg Browns of the world.",
    "timestamp" : "17:01-17:19"
  },
  {
    "timestamp" : "17:19-17:25",
    "speaker" : "Mike Melo",
    "text" : "I mean, um the only thing I had was that he sticks him right between the two and the eight and I kinda figured that what that meant pretty quickly."
  },
  {
    "speaker" : "Andy",
    "text" : "You figure that out? Did you like the c the comment about the the the referees having those East German surplus microphones that aren't working again?",
    "timestamp" : "17:26-17:33"
  },
  {
    "text" : "No, I missed that.",
    "speaker" : "Mike Melo",
    "timestamp" : "17:33-17:34"
  },
  {
    "speaker" : "Andy",
    "text" : "What's going on there? Well, you did you not hear the referees? Because neither did anybody else because everybody cutting in and out.",
    "timestamp" : "17:34-17:42"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's right.",
    "timestamp" : "17:42-17:43"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:43-17:50",
    "text" : "Yeah. I mean they'd say that Bledzo throws a more catchable ball. How do you feel about that as a Bledzo stand?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Uh uh well, I mean They also said this so I we can debate how good they actually were because uh one of the quotes was um Brady just ripped off and I say ripped off because he looked like he was actually running But it was like a 10-yard run for first down. And one of the announcers says that's one element that Brady adds to the offense that you won't see with Bledsoe, the ability to gain first downs running the football. I don't know what kind of statement that was.",
    "timestamp" : "17:52-18:17"
  },
  {
    "timestamp" : "18:18-18:28",
    "speaker" : "Andy",
    "text" : "Is that a shot at New Bledsoe for getting injured instead of getting a first down and a sheer blood vessel in his eye? I didn't take it that way, but that's some shade."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That is funny. In retrospect. Now that we know that blood says, okay, in retrospect, pretty hilarious.",
    "timestamp" : "18:28-18:35"
  },
  {
    "timestamp" : "18:35-18:49",
    "speaker" : "Andy",
    "text" : "Hell yeah. So if we want to talk about the uh the presentation, this is really the first uh primetime game of of the Patriots dynasty And it was the first appearance of the yellow first downline."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, and you you basically took my best of the game because I didn't even Uh no that I I wrote down, is this the first time we've actually seen this? I wasn't sure, but I guess it is.",
    "timestamp" : "18:49-18:59"
  },
  {
    "text" : "W with these pages, yeah, because apparently it was owned by I think ESPN actually put it together. I have a quote here somewhere. Yeah, so this is the here it is. Oh CBS rather, excuse me. You knew immediately it wasn't the usual third or fourth string AFC Telecast on CBS when the ball was spotted after the play and the yellow first and ten line appeared for the first time this season on the telecast of a Patriots game. It's usually reserved for the key national games because of the twenty five thousand dollar per game expense.",
    "speaker" : "Andy",
    "timestamp" : "18:59-19:31"
  },
  {
    "text" : "That is some foresight. Yeah, so run up in twenty-five G is for a lion.",
    "speaker" : "Mike Melo",
    "timestamp" : "19:33-19:38"
  },
  {
    "timestamp" : "19:38-19:40",
    "text" : "Yeah, but now everybody uses it.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, but now how do you feel about because I love that yellow line because I'm a lazy viewer. Um but um and plus it creates like great conversations in bars and at friends' homes. But Um, how does it compare with the remember the hockey puck that used to like glow and it was like on fire? Why did that number stick?",
    "timestamp" : "19:40-19:59"
  },
  {
    "timestamp" : "20:00-20:14",
    "text" : "Well cause real because like, you know, hockey fans are like macho like, oh hockey. That was for the casual fan who hockey fans hate.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "20:17-20:21",
    "speaker" : "Andy",
    "text" : "It's like saying like casual lacrosse fans. That's not a thing. Yeah."
  },
  {
    "text" : "They were offended by the the glowing puck, yeah. I can see that, yeah. It filled them free.",
    "speaker" : "Greg",
    "timestamp" : "20:22-20:28"
  },
  {
    "text" : "So but yeah, I mean On that note, touch uh watching games now, I realize the things that I think when they first came out I used to hate, but I don't anymore. Like when they actually put the down and distance like they displayed on the field, you know, with that like arrow below the where they all line up. And I kind of missed that because I can never quite find it in time on these telecasts. Because they only show it like before the game and then it goes away when the play happens. I'm like as soon as the play ends, I I look up to find out like what down that was because I've already forgotten because I have ADD and I have no idea what down or distance it is.",
    "timestamp" : "20:28-21:02",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh, that doesn't happen to me. That sounds like a personal problem.",
    "timestamp" : "21:02-21:05",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Well that's what I mean we I watch the games though.",
    "timestamp" : "21:06-21:08"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh, shots fired there. But let's go back to the greater issue here.",
    "timestamp" : "21:08-21:12"
  },
  {
    "timestamp" : "21:13-21:17",
    "speaker" : "Greg",
    "text" : "Um and no, I'm watching the game as we speak. I know."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "You might get to the end of the game by the time we finish the podcast. I mean we'll see. But not at this rate. But that that that is also something to talk about maybe for another time. But you throw around A D. Is this uh uh what do you mean by that? Is it a flippant remark or are you talking about actual problems here. Because if that's the case, then we're good. But if not, don't throw that shit around, Andy.",
    "timestamp" : "21:19-21:42"
  },
  {
    "speaker" : "Andy",
    "text" : "It's both. I can say it because I have it.",
    "timestamp" : "21:42-21:44"
  },
  {
    "timestamp" : "21:44-21:45",
    "speaker" : "Mike Melo",
    "text" : "Okay."
  },
  {
    "speaker" : "Andy",
    "text" : "I can joke about it because I am one.",
    "timestamp" : "21:45-21:47"
  },
  {
    "text" : "All right, now your tone makes me feel bad.",
    "timestamp" : "21:47-21:50",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:50-22:04",
    "text" : "So I can joke about it because I abuse Prescription drugs that I'm not prescribed to. Oh. All right. Uh sorry I brought it up."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I don't know what to say",
    "timestamp" : "22:04-22:05"
  },
  {
    "text" : "Well I gotta how about this one? Yeah. This just comes to my head. What do you think about if they were to like come up with technology to make that line visible to the players.",
    "timestamp" : "22:07-22:19",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "22:23-23:05",
    "text" : "So I th I well alright so I'll run with this. That's a good question. I think No, here you go. Here's what you need to do. It can't just be because I think you'd if it's gonna be that it's gonna be like lasers and shit, right? Right. So that yeah. So if you're gonna be doing lasers and shut in the field, you may as well just get rid of the the sticks and just uh like laser measure Like you know, put a chip in the ball or some bullshit like that, and then have both the um the line of scrimmage be like laser etched on the field or whatever and the or laser displayed, but you're probably not gonna be etching anything. But then also the first down is exactly ten yards away to the millimeter. And so when they put the ball down, as long as as long as the it breaks the"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I gotta cut you off.",
    "timestamp" : "23:08-23:09"
  },
  {
    "text" : "The first down.",
    "timestamp" : "23:09-23:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "23:10-23:31",
    "text" : "You can't talk about this now. No, no, no. What you gotta do is you gotta keep it under wraps. And this is why. I want you to patent this idea. I want you to I don't know how to do all that shit, but you just do it. And then you go into Shark Tank. And then you pitch this shit and then you license it."
  },
  {
    "text" : "Okay.",
    "timestamp" : "23:32-23:32",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "23:32-23:36",
    "speaker" : "Mike Melo",
    "text" : "Because that's what what they tell me, because I've been watching it recently."
  },
  {
    "timestamp" : "23:36-23:38",
    "speaker" : "Andy",
    "text" : "I would need a name for this company though."
  },
  {
    "timestamp" : "23:39-23:42",
    "speaker" : "Mike Melo",
    "text" : "Uh it's gotta be something hip."
  },
  {
    "timestamp" : "23:42-23:49",
    "speaker" : "Andy",
    "text" : "Yeah, that's what I mean. That could also be translated to like classrooms and like laser lines but with no vowels."
  },
  {
    "timestamp" : "23:49-23:51",
    "text" : "Or like a hashtag laser like that.",
    "speaker" : "Greg"
  },
  {
    "text" : "L Z R L Y N.",
    "speaker" : "Andy",
    "timestamp" : "23:51-23:53"
  },
  {
    "timestamp" : "23:54-23:54",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "23:56-24:01",
    "text" : "Done. All right. So anybody's listening, don't yeah don't patent this.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, it's a really good fucking idea.",
    "timestamp" : "24:01-24:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:09-24:11",
    "text" : "I won't have patented it by it by then."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "24:11-24:38",
    "text" : "What about like here's another idea? It's a little out of left field, but maybe maybe it works. I don't know. I just thought of it. What if you get tackled, the ball hits the ground, and then the grass like self-paints itself? So that like a like a this line gets painted real time on the the field. You know what I mean? And then like and then you and then it like paints itself green again. Like you need a lot of paint for this idea, but like It seems more reasonable."
  },
  {
    "timestamp" : "24:39-24:54",
    "text" : "What about let let's let's play off of that then. Uh if instead of the grass pending itself, because I feel like that'd be a lot of effort to ask on on grass. Uh we just hire like homeless children with paint rollers. to run out and just paint lines every time there's a first down.",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh boy.",
    "timestamp" : "24:55-24:55",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "24:55-25:00",
    "speaker" : "Andy",
    "text" : "That was my original thought when this whole thing was children, but I was like"
  },
  {
    "text" : "I don't know where this is going. This is going to hell in a handbasket and I'm out of rum.",
    "timestamp" : "25:04-25:08",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "25:10-25:23",
    "speaker" : "Greg",
    "text" : "The technology already exists. I mean you see tennis and they do that zoom in thing. Hell yeah. And then we got like old dudes carrying chains. It's a billion dollar league."
  },
  {
    "speaker" : "Andy",
    "text" : "But it's probably ten-ish yards apart. As long as there's no kinks in the chain and as long as it's straight and as long as it's put down in the correct spot initially.",
    "timestamp" : "25:23-25:31"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "This is a pretty basic system now either m we bring this up. Yeah. Yeah.",
    "timestamp" : "25:31-25:35"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "25:36-25:37"
  },
  {
    "text" : "But do you think it adds to the intrigue?",
    "timestamp" : "25:37-25:40",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "I think it adds an old timey charm. Just like with the referees wearing hats. And the they're like stirrups or whatever that shit is on their little baseball players who got lost.",
    "timestamp" : "25:41-25:52"
  },
  {
    "text" : "Right.",
    "timestamp" : "25:52-25:53",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "text" : "All right, well I think we oh go ahead. There is a certain skill to it, like as far as can the the player see it. Some players do have that like internal I know where the line is, like the Kevin Fox and the Troy Brick.",
    "timestamp" : "25:54-26:09"
  },
  {
    "timestamp" : "26:09-26:09",
    "text" : "Yep.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Where they'll catch it and they'll fall forward Exactly where they need to. That's true. So you don't want to get rid of that skill, you know?",
    "timestamp" : "26:10-26:17"
  },
  {
    "timestamp" : "26:18-26:21",
    "speaker" : "Mike Melo",
    "text" : "And as Andy pointed out, Dribletto did not have that skill."
  },
  {
    "text" : "No. Well that wasn't me. That was uh your quote, bud.",
    "timestamp" : "26:22-26:24",
    "speaker" : "Andy"
  },
  {
    "text" : "Dude, I don't know what I has been said so far, but I will say this. They mentioned that um half of the blood in Bletto's body bled out.",
    "timestamp" : "26:25-26:32",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Did they use his blood? I have no idea.",
    "timestamp" : "26:45-26:47"
  },
  {
    "timestamp" : "26:49-26:53",
    "speaker" : "Mike Melo",
    "text" : "I just I just remember Belichick saying he might be out for like one or two weeks."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he was out a little bit longer than that, but that's okay.",
    "timestamp" : "26:55-26:57"
  },
  {
    "timestamp" : "26:58-27:01",
    "text" : "Man, half the blood in his body. That's fantastic. Modern medicine.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "27:02-27:32",
    "speaker" : "Andy",
    "text" : "Yeah. Oh, so actually um speaking of blood so's injury, they had um an article in the Globe this this week before that talking about what the injury actually was. And the quote is what he did have was a sheared blood vessel that led to a condition known as hemothorax, in which blood, not air, enters the lungs. Jesus fucking Christ. In due time the blood was removed via tube from the lungs and redirected back into his system. Honestly, the things you can learn."
  },
  {
    "timestamp" : "27:33-27:43",
    "text" : "That's insane. So he was like part fish for a little bit. Like he was like breathing blood as opposed to air. That's like some superhero shit Yeah.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I love him. So I mean I'm assuming it's only happened in w one of his lungs, right? Oh, how does that work? Maybe it was both.",
    "timestamp" : "27:45-27:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well I mean Rick, can you look it up for us please?",
    "timestamp" : "27:53-27:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Fact check.",
    "timestamp" : "27:56-27:57"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Heartfish syndrome? I think it's uh yeah, lung fish.",
    "timestamp" : "27:59-28:04"
  },
  {
    "text" : "So and on top of that, I know we talked about it at the beginning about um like when it happened. We're talking about whether or not he had a concussion. And there was another quote in this same article talking about that you probably did. Said uh the Bledsoe case is interesting because it demonstrates the limited ability of even the most trained doctors to make accurate judgments in a hurry. doctor Sarens, was their doctor at the time, was standing just a few feet away from where Bloodsow was hit. He examined Bloodsoe immediately for any signs of a concussion and decided there were none. It continues. But Bledsoe did last just one more series before Belichick pulled him when it was obvious he wasn't in full command of his faculties. I had communication with some of my teammates, and based on that, they went to Bill and said, maybe I should go out, Bledsoe explained. What concerned his teammates, Damon Hewitt and Mark Edwards, was that their quarterback didn't really know what plays he was running.",
    "speaker" : "Andy",
    "timestamp" : "28:07-29:00"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "29:01-29:03",
    "text" : "Sounds like a confession."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:05-29:12",
    "text" : "That his that the team doctor who literally was standing a few feet away from when he got hit couldn't diagnose correctly."
  },
  {
    "text" : "Oh, probably this guy's bell rung. Yeah. I will say this. I will say this. And I I don't want to bring the mood down, but it has to be addressed because this was just released and people listening to this will have a little bit more time to take it in. Um But in in talking about getting your bell rung, which we've all seen like concussions and whatever in our playing days, is you know, previous listeners will know my playing days.",
    "speaker" : "Mike Melo",
    "timestamp" : "29:12-29:37"
  },
  {
    "timestamp" : "29:37-29:39",
    "text" : "Um all three of them.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "29:39-31:07",
    "text" : "Right. Um but they were mean and I was playing cornerback slash linebacker. Don't get me started. Um but Yeah, with concussions becoming like a bigger thing. There was the Aaron Hernandez documentary, which I think a lot of it is already common knowledge. But we also see the Antonio Brown stuff kind of escalating pretty quickly since the last few episodes. And then Uh also in one of the articles that you posted, it was talking about Leon Gray, who kind of, you know, withered away and passed in his like apartment, which I think he was in his forties. Um and there were some suspicions about what led to that. There's uh another player who passed homeless um on the street by himself. And then I was looking at an article on Antonio Brown and the Steelers. There was like, you know, a Hall of Fame center. forget his name, but uh he uh passed sort of homeless and had problems and they were uh they were just uh the teams kind of turned their back on them. So what do you think about all that? I mean, i and seeing something like that happen to Bleto, that could have probably you know, or at least like it could have changed his life a bit like it did I think for Antonio Brown. Uh what do you think about like 'cause I think we've talked about concussions a little bit, um in this season alone. It kind of seemed like it was already popping up a little bit more frequently."
  },
  {
    "text" : "Yeah, I I think you're right, and I think I noticed even in this game, um I think they they because they they flash up uh a list of all the injuries that had happened in this game to the Rams alone. And I believe Aeneas Williams was on that list. As having suffered a concussion, but then like a few plays later, he was in there making the tackle. Or he was in there on the blitz putting his his helmet in Tom Brady's chest.",
    "timestamp" : "31:08-31:39",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, that's right. Yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "31:40-31:40"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:41-32:10",
    "text" : "Yeah. Like so he's still out there leading with his head even after he had been diag diagnosed with a concussion. They let him back in there to continue playing. So I think it's like just looking back at it now from what we know is going on these days with the with the information that we have and like how much more research has been put into it, especially with CTE and everything. It does have a different tone to it than just like, you know, rub some dirt on it and get back out there."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right.",
    "timestamp" : "32:10-32:10"
  },
  {
    "timestamp" : "32:11-32:12",
    "speaker" : "Andy",
    "text" : "Seems like that's what it used to be."
  },
  {
    "text" : "Oh, it definitely was. I'm wondering, I mean, obviously they're taking steps to kind of prevent some of the stuff. Uh maybe this year they're talking about removing kickoffs altogether and whatnot. And you know, I don't know if that's good or bad. But Do you think that it's just prevalent to this? And I know that it's like guys banging their heads against each other, but like I hear like soccer players have this. So is it like inherently a sports thing, or do you think it's primarily like and obviously we don't know at the moment, but",
    "speaker" : "Mike Melo",
    "timestamp" : "32:13-32:37"
  },
  {
    "timestamp" : "32:38-33:42",
    "speaker" : "Andy",
    "text" : "Um, I think I mean obviously I'm just making shit up now, but I I think that it's probably prevalent in the majority of sports, because like they say you can get this like they're seeing CTE and soccer players from heading the ball and shit like that. Um, which is a big part of soccer. But I think that you're I've I feel that sports like football and probably to a certain extent maybe like rugby and things like that. those collision sports, hockey, those sorts of things. I think you'll see it like worse cases of of CTE in the future. Like I think you'll see it in in all sports. But it'll be more severe in the ones where there's like collisions all the time. Like I've uh offensive and defensive line, that's kind of what they do every play. They just dash heads with each other. So I don't know how you fix it either because hitting is part of the game. And it's not like it it has to be these big hits that you take, it's it's all the hits that kind of pile up is what it seems to be where the research is is going with this."
  },
  {
    "timestamp" : "33:43-33:55",
    "text" : "Right. True. The amount of money that they make when you're not doing that right now. Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "33:55-33:58",
    "speaker" : "Andy",
    "text" : "Especially with with the money that they're making hand over fist."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "33:58-34:09",
    "text" : "It's not like they can't afford it. The teams don't give a shit once they cut you, you know? So like make that require them to give them health insurance."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:09-34:09",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "For basically sacrificing their body so you can make all that money. Like that's an easy solution that doesn't take any doctors or research or anything, right?",
    "timestamp" : "34:10-34:17"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true. And continues the sport too.",
    "timestamp" : "34:17-34:20"
  },
  {
    "speaker" : "Greg",
    "text" : "Because I think it shows respect to the players.",
    "timestamp" : "34:20-34:24"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. But I I I mean I think there's the I don't know if how true it is or what the numbers are, but there's been stories out there how youth football and participation in it is declining rapidly. Right. So does it get to a point where you just don't have the same pool of players to choose from?",
    "timestamp" : "34:24-34:41"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "34:42-35:29",
    "text" : "Yeah, I mean I think there is something to that. I mean obviously it's always gonna offer an opportunity for for anybody who doesn't have any other way to like make an income or make a big splash like that. And it can kind of provide opportunities. But yeah, I th I think it does affect I mean that's a good idea. I've always been on the camp of like We probably didn't ha know all this info, you know, years past, but you know that banging your head against somebody else is not the greatest thing, inherently. Um but and it's their choice. But uh like Greg said, maybe that would, you know fix something. Um obviously the these people are putting their body through the ringer in their minds, but you know, I think a lot of them do that for their families and it's a conscious decision. But at least make it a little bit more humane while we're trying to clean it up a little bit."
  },
  {
    "timestamp" : "35:29-35:33",
    "speaker" : "Andy",
    "text" : "Mm-hmm. Yeah, we'll see how it goes."
  },
  {
    "timestamp" : "35:33-35:39",
    "speaker" : "Mike Melo",
    "text" : "I don't know, and for anybody who's listening, we didn't solve shit with that conversation and I don't want to hear it."
  },
  {
    "timestamp" : "35:40-35:42",
    "text" : "So you can tweet at Mike.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:45-35:46",
    "speaker" : "Mike Melo",
    "text" : "No Twitter, thank you."
  },
  {
    "text" : "No Twitter? All right. Yeah, that asked. Yeah, no social media. All right. So Oh yeah I was gonna try to pull a Drew Bledsoe quote out of my thing, but the only comment I have on Drew Bledsoe is that he bled out half the blood in his body.",
    "timestamp" : "35:46-36:02",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:03-36:08",
    "speaker" : "Mike Melo",
    "text" : "All right. Well glad I derailed everything."
  },
  {
    "text" : "That's not true. Um so uh well I think we can get to it in a little bit, but um So what did you what were your kind of initial thoughts on this game? Because Mike, I know you were a bit more down on it than I was. Talking to you before we started this.",
    "timestamp" : "36:08-36:24",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:24-36:56",
    "text" : "Right. Um, I mean, it was interesting because I thought that the first half, you know, overall speaking, we can get into it, but the first half it kind of seemed like It was a little bit more competitive. Defense was, you know, holding their own. Um and then sort of in the second half. Um, which I still understand why they would be encouraged after this loss, allegedly. Um but it kinda seemed like it became the Marshall Fox show and it was just run it down their throats every single play until time ran announced.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:56-37:19",
    "text" : "Yeah. So let's just touch on a little bit. So first quarter uh the Patriots on their first drive Brady throws an interception deep in his own territory. He basically hits Falk in the hands, Kevin Falk in the hands with a heater and bounces off and he gets picked off. So the Rams start on like inside the 20 and score a touchdown three plays later."
  },
  {
    "timestamp" : "37:20-37:40",
    "text" : "Right. And um I will say it started off pretty well because the game opened with like two bad balls that Kurt Warner threw. And then all of a sudden in the third play throws a 35-yard pass to Isaac Bruce. And it was like really well covered by Ty Law. Uh so even though it's a good start for the deed because they stopped him on that drive, uh it was tough sledding the whole game.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, yeah, but I think the the Pats defense definitely gave Warner trouble. I think this this game especially was one that uh the Patriots brought pressure more than I can ever remember Which against a team with this firepower seems really ballsy to me. But they were it seemed like they were bringing at least five or six guys every every defensive play. From all over the place too.",
    "timestamp" : "37:41-38:09",
    "speaker" : "Andy"
  },
  {
    "text" : "So, talking about fact team, we haven't like gone over the the roster like we usually have, but just true. Looking at it like Tory Holt, Isaac Bruce, Ricky Parole, uh Trunk Candidate, which was like super fast, Marshall Fawkes, and that's Like uh offense, but defense, like Dre Bly, Aeneas Williams, London Fletcher, Leonard Little, like this team was stacked.",
    "timestamp" : "38:09-38:30",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:30-39:47",
    "text" : "Yeah. Oh, they yeah, they had some some big fucking names. Uh And uh like all those people you just mentioned went to the Pro Bowl. Kurt Warner, Tori Holt, Isaac Bruce, Marshall Falk, they were all Pro Bowlers. Falk and Kurt Warner were first team all pros. Um and Marshall Falk was basically a video game at this point. Was this the year he was on the cover Madden? It was around this time. May have been like 99, 2000. Yeah, so so yes, this is probably on 2000 be my guess. Greg Statek? But this was I mean talking about punts versus T D's this is another rabbit hole I went down. Um Marshall Falk in this season outscored the kicker. 128 points, 127, which is Hard to do because the kickers get, you know, a point every time you score a touchdown, plus all the field goals and all that jazz. So the out of the top 20 scores of all time in the league, 15 of those are are kickers. Wow. Which, yeah. Which doesn't seem right. And I would tell you who they were if this page would load, but um"
  },
  {
    "timestamp" : "39:49-39:51",
    "speaker" : "Greg",
    "text" : "Two thousand three. Madden cover."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:51-41:01",
    "text" : "Really? All right. So quite a way to do that. Yeah. But yeah, that so the only uh top twenty The only players who aren't kickers are actually running backs, surprisingly. So Uh Ladanian Thomlinson in terms of uh points in a single season, like points scored, Lydanian Thomlinson first place in 2006. That was the year he had 31 rushing touchdowns. Yeah, that's unbelievable. Was it rushing touchdowns? I don't know if they were all rushing touchdowns, but yeah, he had like some ridiculous amount. Yeah. But uh so he scored 186 points. Second. Sean Alexander on there. He's second in 2005 with 168 points. So it's he's a distance second. He scored 28 touchdowns. Wow. Um and then it's kickers, uh David Akers, Gary Anderson, Jeff Wilkins. Uh Priest Holmes in sixth place. He scored twenty-seven touchdowns. Uh Mark Mosley, who I don't actually know who the fuck Mark Mosley is. He doesn't have a position marked here. He is also a kicker."
  },
  {
    "timestamp" : "41:02-41:13",
    "speaker" : "Mike Melo",
    "text" : "Let's uh let's edit that one out and just like pretend that like like do the research and then pretend that we knew what we were talking about. Who was that uh oh Mosley?"
  },
  {
    "text" : "Yeah, Mark. Oh, obviously. Yeah, yeah, yeah. Yeah, you know him. He was uh sixty-two of sixty three on field goals. Oh no, extra points.",
    "timestamp" : "41:13-41:21",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Ark Mosley Jr.",
    "timestamp" : "41:22-41:23"
  },
  {
    "timestamp" : "41:23-41:33",
    "speaker" : "Andy",
    "text" : "Oh sorry. But then uh in eighth place was this year's Marshall Falk with 160 points. Which is out of control. That's beast. He's pretty good."
  },
  {
    "speaker" : "Greg",
    "text" : "He's pretty good.",
    "timestamp" : "41:33-41:34"
  },
  {
    "text" : "Yeah. So yeah, he would like you said, I mean, this is why he the the second half looked like the Marshall Falk show because the whole season was the Marshall Falk Show.",
    "speaker" : "Andy",
    "timestamp" : "41:34-41:45"
  },
  {
    "timestamp" : "41:46-42:36",
    "speaker" : "Mike Melo",
    "text" : "Yeah, I also like made the note and I don't know if there's any correlation, but the way that uh Marshall Falk was used in this game, it's sort of very much beat up the Patriots. And this was before the the Patriots um incorporated the scat back. Uh so it was pretty much just like, you know run up the middle, run up the middle, kind of beat people down. Do you think that playing a guy like Marshall Fox sort of like changed his philosophy? Because I feel like as the years continued, the Patriots now are sort of known for those like flexbacks. um that are good at doing a million things, everywhere you know, sh uh Vareen, um, all the way to like James White. So do you think that like Yep, exactly. So do you think that like I was thinking about it, I'm like did this game maybe introduce that into his mind, or at least like facing him a couple of times?"
  },
  {
    "timestamp" : "42:36-42:40",
    "speaker" : "Andy",
    "text" : "Um maybe a little bit, but I think they already had Kevin Falk on the team."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I know, but he was like it was basic, I think.",
    "timestamp" : "42:41-42:43"
  },
  {
    "timestamp" : "42:44-43:06",
    "speaker" : "Andy",
    "text" : "Yeah, I th I think this was uh and I think this happened with not just the Patriots where because again it's a copycat league and now I think people started to to make their wide receivers be more of a receiving threat. But having said that, I mean the Patriots from week one have been splitting their fullback out wide in five wide receiver sets."
  },
  {
    "timestamp" : "43:07-43:24",
    "speaker" : "Mike Melo",
    "text" : "Yeah, that's true. I mean, right. I mean I feel like that's more gimmick than anything, but it is the start of something. I mean, so who is uh who is the originator of that? Does it go back to, I don't know, like the West Coast offense when it was instilled or like who started that like SCAP Act thing?"
  },
  {
    "speaker" : "Andy",
    "text" : "That's a great question. I don't know.",
    "timestamp" : "43:25-43:27"
  },
  {
    "timestamp" : "43:27-43:32",
    "text" : "All right, again, we're gonna pause. We're gonna get our information straight and we'll come right back.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "43:33-43:46",
    "speaker" : "Andy",
    "text" : "We'll just we'll just have uh our our listeners tell us on Twitter because Nobody loves to tell you uh when you're wrong like Twitter does. So Okay. If you know the answer, tweet at Mike Mello."
  },
  {
    "timestamp" : "43:46-43:51",
    "text" : "I don't have Twitter, man. That's how I I that's how I escape this bullshit. No social media.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "So well here's what we're going to do. So you can you can tweet at our Pat's Dynasty info, but but make sure it's it's made out to Mike Mello.",
    "timestamp" : "43:51-44:00",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And I won't read it, because I don't give a damn.",
    "timestamp" : "44:00-44:02"
  },
  {
    "timestamp" : "44:03-44:05",
    "speaker" : "Andy",
    "text" : "Oh yeah, well we'll read it to you, so don't worry about it. It's cool."
  },
  {
    "text" : "I won't listen. I'm barely paying attention now. So live reactions. Live reactions. Yeah, maybe eventually we will be live and then maybe I'll I'll give a damn. Maybe if somebody calls in eventually and we get that whole thing set up, maybe I'll care. That's some human human contact.",
    "speaker" : "Mike Melo",
    "timestamp" : "44:06-44:25"
  },
  {
    "text" : "We have the technology. Alright. We'll do that just for you.",
    "speaker" : "Andy",
    "timestamp" : "44:26-44:29"
  },
  {
    "text" : "So eventually when these become live shows.",
    "timestamp" : "44:30-44:32",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "44:33-44:38",
    "speaker" : "Andy",
    "text" : "If we get Lee Johnson on, would you Would you would you listen to him?"
  },
  {
    "timestamp" : "44:39-45:02",
    "speaker" : "Mike Melo",
    "text" : "You know, I don't I'll give him the benefit of the doubt. I did I was a big, big fan. Uh way back. I mean his career started before I was born. I was still a fan. I was in the womb kind of pulling for the guy. So I bet you were. I would be I would be into having that conversation. I'm trying this like mustard sauce. That was him, right?"
  },
  {
    "timestamp" : "45:02-45:35",
    "speaker" : "Andy",
    "text" : "I think so. Fuck, I don't remember. Was that Kim Walter? It was one of the punters. Alright. Is it even a Pages punter? I don't remember. I don't know, moving on. It's sausage too ya. Um, all right, so yeah, so I think you're right about the this being a game of two halves. The Patriots hung in in the first half because they had two interceptions in the first quarter off of Warner. Uh it was a pick six by Terrell Buckley. Which I don't know why I didn't remember that play happening, but it was a legit. A legit play. It was definitely the highlight of the game, I think. Oh yeah."
  },
  {
    "timestamp" : "45:36-45:47",
    "speaker" : "Greg",
    "text" : "I mean it even I mean it was seven-seven at that point. It's it's because they lost. I have I'm having that I have way more distinct memories of wins. Oh losses. It's so true."
  },
  {
    "timestamp" : "45:48-45:49",
    "speaker" : "Andy",
    "text" : "Yeah, you could just put it out of your mind and you move on."
  },
  {
    "text" : "Yeah, just erase it and I probably didn't watch any highlights or you know, like Your team loses, you just ignore it.",
    "speaker" : "Greg",
    "timestamp" : "45:50-45:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, you don't you don't watch the Pat's fifth quarter or anything like that. You just kind of turn the TV off and walk away.",
    "timestamp" : "45:56-46:00"
  },
  {
    "text" : "I've noticed that on a few times.",
    "timestamp" : "46:01-46:03",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah, me too. Although I uh going back to the shit on Annie episode um from a few weeks ago, I think this is one of the first games that I think I was still at home for. Either I come home for Christmas break or I had stayed home for Christmas. So so I do actually remember watching this game.",
    "timestamp" : "46:03-46:23"
  },
  {
    "text" : "I will say that the the pick sixes that you're talking about, I mean, Warner threw one to Terrell Buckley, like you said, and then the next drive. Warner threw a pick to Teddy Bruske at like the Rams 40. So you would think that would be um a uh game-defining moment. But it was like yeah.",
    "timestamp" : "46:25-46:43",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Well, I think it's just because it was early. It's like watching the Falcons Pat Super Bowl. Like the the Rams were driving up and down the field the entire time. Almost like the Colts game earlier in this. Well, both Colts games earlier in this season where Manning and the Colts could drive all the way up and down the field, but then they'd stall and miss field goals or go for the fourth down and not get it, sort of thing. And I think that was happening in the first half. Um Because yeah, the the Rams threw two picks in the first quarter, um, punted once in the first on their opening drive. Uh missed a field goal in the second quarter, but then the pat they missed the field goal. Pats drive down inside the five, going to to take a um like a 17-7 lead. Instead, Antoine Smith fumbles the ball. Rams get the ball on their own, was it three-yard line, something like that, two, three-yard line? Yeah, I think two, yeah, something with two minutes left in the half and drive ninety-seven yards for a touchdown. Averaging like two yards a play.",
    "speaker" : "Andy",
    "timestamp" : "46:43-47:45"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, that was incredible. That like, I mean that swung everything obviously in poor Antoine Smith at the time. That sucks, but um that two-minute drill was flawless. It was it was nasty.",
    "timestamp" : "47:45-47:57"
  },
  {
    "speaker" : "Andy",
    "text" : "It didn't even look like they were trying they weren't huddling up between plays and shit and taking timeouts at random times, but they still like it didn't matter. It just felt like the Patriots had done so well up until this point with how much pressure they were getting on Warner and then as soon as a two-minute warning hit, they backed off and Warner just carved them to pieces.",
    "timestamp" : "47:57-48:17"
  },
  {
    "timestamp" : "48:17-48:51",
    "speaker" : "Mike Melo",
    "text" : "Well, I think that the uh the announcers could sense that because I wrote a couple of things like around this time that they were kind of bringing up. And one is that they went into this whole mm story about Antoine Smith and uh how nice of a guy he is. It is a pretty crazy story. But apparently he turned down a scholarship to Auburn. Uh he put off college for three years to take care of his parents, who I think his grandfather had cancer, his grandmother was going to dialysis. Yeah. And he worked at a factory for three years doing this, put everything off, and then got a scholarship to Houston and, you know, continued on his path. But that's that's pretty crazy."
  },
  {
    "text" : "Yeah. Yeah. It's kind of similar to the uh Uh well Troy Brown has kind of a similar story and also uh David Patton who was they didn't actually mention this game, but they mentioned a f a few games talk about him. Chucking around bags of coffee beans, sacks of coffee beans.",
    "speaker" : "Andy",
    "timestamp" : "48:51-49:08"
  },
  {
    "timestamp" : "49:08-49:37",
    "speaker" : "Mike Melo",
    "text" : "Well I I choose to remember Antoine Smith in this game for his loving heart and not the fumble. Brutal fumble. And man, I thought this was uh pretty hilarious, but there was a uh they they were talking about how Brady was the first Patriot quarterback. to have over sixty-five percent completion uh passing in uh four straight games. So in the history of the Patriots, they never had a quarterback over sixty-five percent in four straight games That is unbelievable."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:37-49:41",
    "text" : "Including Drew Bledsoe, who was like the savior of the franchise."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. That's unbelievable.",
    "timestamp" : "49:41-49:42"
  },
  {
    "speaker" : "Andy",
    "text" : "And they did say that like two of those games he was at like seventy something percent and the other two he wasn't.",
    "timestamp" : "49:42-49:48"
  },
  {
    "text" : "Right, right. But I still thought it was funny. I mean the guy played like what six or seven games at this point. He's already making some kind of records. Yeah. Um I also thought around this time it was funny. Not to shoot on Bletto, but hey, he did it to himself. Um The 90 so from 93 to like 2000, he only missed seven games and he uh the Patriots were one and six without him. Yeah. 2001 with Brady, at this point they were five and two. So that's pretty amazing.",
    "timestamp" : "49:49-50:19",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "50:19-50:27",
    "speaker" : "Andy",
    "text" : "Yeah, it is. Can you name the one win? And the the one and six? You name the quarterback?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Dude, I want to say it was Zolak.",
    "timestamp" : "50:27-50:28"
  },
  {
    "text" : "I believe it was.",
    "timestamp" : "50:29-50:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "50:30-50:34",
    "text" : "And it was like he was like pointing to the gods and uh I think"
  },
  {
    "speaker" : "Andy",
    "text" : "I want to get the 49ers maybe.",
    "timestamp" : "50:36-50:38"
  },
  {
    "text" : "Was this a Bletto finger thing or was Zolak the one with the finger? Was that around that time?",
    "timestamp" : "50:38-50:43",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "50:44-50:44",
    "speaker" : "Andy",
    "text" : "With the finger?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, it was like a broken finger or something like that.",
    "timestamp" : "50:45-50:47"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:47-50:49",
    "text" : "Oh Bledsoe played through a broken finger."
  },
  {
    "text" : "Oh, okay. I don't remember, but I do remember this game and Zolak was like freaking out and you know hilarious.",
    "timestamp" : "50:49-50:55",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, Zolak's a uh he's a bit of a nutcase.",
    "timestamp" : "50:56-50:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Did that one game set him up for like the rest of his career, I think",
    "timestamp" : "50:59-51:02"
  },
  {
    "text" : "As a commentator anyway. I think well just being a backup to Drew Bledsville, I think.",
    "timestamp" : "51:03-51:08",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:09-51:11",
    "text" : "But he had that one sick game.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "51:11-51:52",
    "text" : "He did have one sick game. He's got that win, an NFL win under his belt, which is more than any of us can say. So I'll give it to him. Um all right, let's go to the second half. Uh I thought the third quarter was actually okay. Patriots still in it. Um it ended 17-10 Rams and it was 14-10 at the half. So the Rams got a field goal. There was out of eight drives, no one really went anywhere. Um it was kind of sloppy that the Warner f had the fumbled snap. Near midfield. He just dropped the snap and the pages were covered. Uh the very next play, Tom Brady under pressure off his back foot, chucks an interception to the middle linebacker, whoever the hell that was.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:53-52:02",
    "speaker" : "Mike Melo",
    "text" : "And again, I'm I'm surprised that Bill kept with them. It's not very bill-like. But again, the alternative is, you know. Plateau."
  },
  {
    "timestamp" : "52:02-53:19",
    "speaker" : "Andy",
    "text" : "Yeah, well, uh yeah. Well, we'll get to that in a second because I have some thoughts on that. Um so yeah, so but going into the fourth quarter, the ram Rams have the ball driving into the third, into the fourth. And uh they basically just walk down the field and score that touchdown. Warner the the Warner was getting no pressure on him at this point. I think the defense was a bit gassed because they've been on the field for so long and he Threw a touchdown to his fullback, which was the fullback's first touchdown. I didn't even write it down his name because I didn't care at this point. Um, so that makes it 24-10 Rams. And at this point, you're thinking it's over. But Brady immediately responds with I think they all six plays were passing plays. Like they just spread it out wide, five wide, and just start chucking the ball over the yard. And Brady drives him down with uh touchdown to Patton in the back of the end zone, which kinda had uh a feel of that same Touchdown to patent that he would throw in the Super Bowl. Kind of that back of the end zone fade, but to the other corner this time. Um, but then like The the next Rams drive was the last drive of the game. Because I think they had they got the ball back with like six or seven minutes left."
  },
  {
    "text" : "Before even getting into that though, I feel like the announcers touched on this and it was, to be fair, the first time that the Patriots sort of opened up the playbook a little bit and allowed Brady to throw more than like a five-yard pass. Um so in in getting his first opportunity to sort of do that, even after like, you know, his interceptions or whatever. Um Pretty impressive drive, very quick.",
    "timestamp" : "53:20-53:43",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "53:44-53:55",
    "speaker" : "Andy",
    "text" : "It was, yeah. It it felt very Brady-esque of what you know of him now. Whereas some of the earlier mistakes, like the interceptions that he was throwing. didn't feel like the guy that we we know and love at this point."
  },
  {
    "timestamp" : "53:55-54:04",
    "text" : "Well and they put up like the stat where it was like, you know, to prove that point where They had no big plays because they were dinking and dunking, you know, maybe that's Yeah.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "It was uh plays of over ten yards or something like that. And the Rams had twenty-two, I think, and the Pages had four.",
    "timestamp" : "54:04-54:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yep.",
    "timestamp" : "54:10-54:10"
  },
  {
    "text" : "And this was halfway through the fourth this was before this fourth quarter drive by Brady. And he I think almost all of the plays on that drive, like all six of them were over ten yards. For the most part.",
    "timestamp" : "54:11-54:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, so that was interesting.",
    "timestamp" : "54:22-54:24"
  },
  {
    "timestamp" : "54:24-54:36",
    "speaker" : "Andy",
    "text" : "Yeah. But like you said, the Rams got the ball back and the Patriots defense just can't get off the field on third down. I think the Rams converted to like three or four maybe on the drive. And just kept the ball for the last six minutes of the game. Six minutes."
  },
  {
    "timestamp" : "54:37-54:39",
    "text" : "I thought it was like seven and a half, almost eight.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:39-54:48",
    "text" : "It may have been even longer than that, yeah. Um I have the the log here. Let's see when they got the ball. They got the ball back with seven and a half minutes left. 737."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "54:48-54:50",
    "text" : "Yeah, and it was brutal."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:50-55:14",
    "text" : "Yep. Yeah, let's see. Marshall Falk, seven-yard run, Marshall Falk, four-yard run. Trunk candidate, one yard run. Uh Kurt Warner to Marshall Falk for two yards. Kurt Warner, Marshall Falk for 18 yards. Marshall Falk run for eight yards, minus one yards, nine yards. Kurt Warner runs for no game, fumbles it, but recovered by Trump Candidate."
  },
  {
    "timestamp" : "55:14-55:21",
    "speaker" : "Mike Melo",
    "text" : "Andy, you're gonna put the listeners to sleep as I was about to when I was watching this damn game."
  },
  {
    "speaker" : "Andy",
    "text" : "Couldn't get off the field. And then I think the backbreaker was third and four, two twenty-two left. Uh like you still have the two-minute warning to stop you, to stop the clock. You can get the ball back. Third and four, Marshall Falk up the middle for six yards, game over.",
    "timestamp" : "55:21-55:36"
  },
  {
    "timestamp" : "55:37-55:40",
    "text" : "Yeah, and it was 24-17. So yeah.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "55:40-55:49",
    "text" : "So it was still a touchdown lead. But I mean, well the Rams at that point were in field goal range, so they could kick the field goal. True, true. But it took three knees and and that was the game.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "55:50-55:53",
    "speaker" : "Greg",
    "text" : "It's definitely a different defensive approach than the Super Bowl though."
  },
  {
    "text" : "Yeah, and I think that's that kind of goes back to my point that I started with is that the what the Patriots learn from this game as well, being able to one kind of judge what they were getting themselves into. Two know that they can kind of keep pace with this team and and give Kurt Warner problems because all the stats that they were showing were that um this offensive production was way under what it it it usually is. Like all all the averages were were way lower playing this Page's defense. So the Page's defense knew that they could hang in there. And it's just up to the Brady and the offense to stop making these mistakes, stop fumbling it within inside the five. So you felt like you were kind of right there on the doorstep. But you also were able to figure out what else you you needed to do to s to to stop things like martial fault going off.",
    "timestamp" : "55:54-56:44",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know. I think I kind of feel differently. I think it shows that I think the Rams made a lot of mistakes, made turnovers, and this game could have been a blowout. And they were like, whoa, I think we need to try something different if we're gonna and that's at home on the grass. We're slowing down. You get them in a curve. New Orleans they said, all right, let we gotta slow down these, you know, backs coming out of the thing by hitting 'em, getting up in the receiver's face on the line, like like actually slow 'em down.",
    "timestamp" : "56:45-57:17",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "57:18-58:25",
    "speaker" : "Andy",
    "text" : "Well, yeah, I think I mean I w I'm sure we'll get to it when we get to the Super Bowl, but I I feel like I remember I know three games of glory or something like that where they talk about the first game their defensive game plan was to get pressure on Kurt Warner and and and throw off his timing that way. And then when they realized that wasn't gonna work because they couldn't get to him in the second half of this game and he started carving him to bits, it was to disrupt the timing by hitting the receivers instead and and chipping Marshall Fark wherever he went and making sure there was somebody there to take away that outlet too. Allegedly. Yeah, this this is the first this is the first half of that. But you're right, because they did show a stat where this um greater show on turf, like turf is actually a big part of that because the offense as a whole is actually a a TD worse, a touchdown worse in production. Uh, because they averaged this this is mind-blowing me, they averaged 35 points per game on turf Oh like since ninety-nine and uh they're only averaging twenty-eight points per game on grass."
  },
  {
    "timestamp" : "58:26-58:33",
    "speaker" : "Greg",
    "text" : "Which oh seven pats played on turf That would be nasty. That would be so awesome."
  },
  {
    "text" : "Oh god. That would be unfair, I think. I mean it was unfair. It scored 75 touchdowns that year.",
    "speaker" : "Andy",
    "timestamp" : "58:33-58:40"
  },
  {
    "timestamp" : "58:41-59:15",
    "speaker" : "Mike Melo",
    "text" : "Um I I will say I I thought this was a good bill ism. Um but they're talking about that, you know, leading up to this game and I'm sure after that uh Bill had the scout team face uh, you know, w when they're facing each other, the uh the receivers were lining up at um three yards ahead of the ball just to give uh to spot that sort of speed that they uh don't have on the paths to replicate that. But I thought it was funny that he's you know, thinking that far ahead where he's creating these like weird parameters with the scout team."
  },
  {
    "timestamp" : "59:15-59:16",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "59:16-59:17",
    "text" : "I know that was pretty cool.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:17-59:50",
    "text" : "Yeah, I I and I yeah, uh that's just one of those stories you always hear that makes you realize that Belichick is just like further ahead than his his coaching counterparts, I think. Because he does. He he tries to make his it feels like he tries to make his starters practice at a disadvantage so that when they actually get to the game, they're either prepared for it or Um it's it comes easier to them because they've been playing at such a disadvantage all week."
  },
  {
    "timestamp" : "59:50-01:00:01",
    "text" : "Right. Makes sense. Yeah. Seems like a basic principle. You know, kind of surprised that more coaches aren't like ahead of the curve on things.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean maybe they are and we just don't hear about it just because this is you know, Belichick's been here for so long and so all these stories finally come out after guys retire sort of thing, you know.",
    "timestamp" : "01:00:01-01:00:10"
  },
  {
    "text" : "That's what I think is like half of Belichick's success is like culture driven rather than him being genius. Like half of being a good coach is getting player buy-in. So success like this early on. You're basically setting yourself up for future success.",
    "timestamp" : "01:00:10-01:00:26",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh yeah, absolutely.",
    "speaker" : "Andy",
    "timestamp" : "01:00:27-01:00:27"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:00:27-01:00:28",
    "text" : "That's a good point."
  },
  {
    "speaker" : "Andy",
    "text" : "I mean I still think there is some genius in there. I mean he's got his",
    "timestamp" : "01:00:28-01:00:33"
  },
  {
    "speaker" : "Greg",
    "text" : "But I think a lot of companies have genius that may not make it because they have a one two year span and show improvement or else.",
    "timestamp" : "01:00:33-01:00:40"
  },
  {
    "text" : "Yeah, I I think it's a difference of being a really good uh like offense or defensive coordinator. and being a really good head coach. Because head coach, you have to build that that whole system of a team as well instead of just focusing on one or the other.",
    "timestamp" : "01:00:41-01:00:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, it's probably circumstances too, right? You get a good owner that like gives you authority to make decisions or you know you kind of hit on a Brady late in the draft and you Turns out to be a gem. Yeah.",
    "timestamp" : "01:00:56-01:01:07"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:01:07-01:01:10",
    "text" : "Like or Russell Wilson or something, yeah."
  },
  {
    "timestamp" : "01:01:10-01:01:15",
    "speaker" : "Greg",
    "text" : "Exactly. Out of your hands, but you gotta take those things and run with them."
  },
  {
    "timestamp" : "01:01:14-01:01:47",
    "speaker" : "Mike Melo",
    "text" : "Well, and I think there's something to be said for him being a genius because along with the culture, um, you know, he cheats. And he does it in a way that is actually brilliant because he'll cheat for however many years until it like doesn't work anymore and then he'll get caught And you think, oh my god, these guys again. But then if you look at it the next year, like it motivates the crap out of the team because it's done against the world. So the guy uses cheating to his advantage and then gets caught and uses it again. That's fucking genius."
  },
  {
    "text" : "Once he's done with it, he's like, all right, yeah, we can get caught doing this.",
    "timestamp" : "01:01:47-01:01:50",
    "speaker" : "Andy"
  },
  {
    "text" : "Right. It's fucking great.",
    "timestamp" : "01:01:50-01:01:52",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:01:53-01:02:00",
    "text" : "It helped him beat the the Bengals this year. It's like, oh yeah, we we we should send a film crew to the Bengals game.",
    "speaker" : "Andy"
  },
  {
    "text" : "Dude, he was meeting up with like Alex Cora uh a few times. I don't know. If it if it's as big a deal in the future when you guys are listening to this, you'll you'll you can chime in. But we'll just leave it at that.",
    "timestamp" : "01:02:01-01:02:13",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Man, that that's that's a hot take. I like it. Mike's bad.",
    "timestamp" : "01:02:16-01:02:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh, I yeah, I don't know. Yeah, the uh I'm feeling good, baby.",
    "timestamp" : "01:02:19-01:02:23"
  },
  {
    "text" : "Nice All right, do you boys have uh anything else you want to touch on? Anybody else you want to talk about?",
    "timestamp" : "01:02:23-01:02:32",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:33-01:02:36",
    "text" : "Well, I mean we never really talked about Kurt Warner at all.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "No",
    "timestamp" : "01:02:36-01:02:37"
  },
  {
    "text" : "I mean he's a pretty pretty amazing story when you think of it. It's true.",
    "speaker" : "Greg",
    "timestamp" : "01:02:37-01:02:41"
  },
  {
    "timestamp" : "01:02:42-01:02:45",
    "speaker" : "Mike Melo",
    "text" : "You wanna share that story? Because I do think it's pretty pretty badassed."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I mean he was bagging groceries for $5. 50 an hour. And then like six years later, he's like Running the best offense in the NFL for three years straight.",
    "timestamp" : "01:02:46-01:02:58"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:02:59-01:03:07",
    "text" : "I gotta say though, even in um uh an NFL uniform, he still has that like grocery bagger look to him."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:03:09-01:03:16",
    "text" : "Yeah, he just like his stance or I don't want to offend the grocery baggers out there, so can you elaborate on that please?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:16-01:03:41",
    "text" : "I don't know if it's like his stance or what or just like his posture or just the way he moves, but like he doesn't look like a world class athlete to me. Maybe it's the fact that he has no chin and he tries to wear that like tiny little chin strap that Brett Favre used to wear. You know what I'm talking about? It's like bit it's just like a piece of like a flap of leather underneath. I don't know what it is, but he's not sure. He does not look like an athletic dude."
  },
  {
    "text" : "It just doesn't look cool. There is a definitive coolness factor for like athletes like Sam Bradford, not cool. True. Mahomes, he's cool.",
    "speaker" : "Greg",
    "timestamp" : "01:03:41-01:03:50"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Um and but also like yeah, he was he was bagging groceries, his you know, arena football, he was in NFL Europe when that was a thing, all that stuff. But if Trent Green doesn't go down with an injury, same thing. There's no Kurt Warner. Yeah. So that's crazy. And that was like early.",
    "timestamp" : "01:03:52-01:04:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Kurt Warner, there's there's no There's no Patriots Super Bowl win in theory.",
    "timestamp" : "01:04:10-01:04:16"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Started the dynasty, but it might have been Trent Green.",
    "timestamp" : "01:04:19-01:04:23"
  },
  {
    "speaker" : "Andy",
    "text" : "It might have been.",
    "timestamp" : "01:04:23-01:04:24"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well, fucking it.",
    "timestamp" : "01:04:25-01:04:26"
  },
  {
    "text" : "Alright. Well that's a good thing.",
    "timestamp" : "01:04:26-01:04:27",
    "speaker" : "Andy"
  },
  {
    "text" : "That's what I like about talking to you guys. We're always learning. Wasn't it uh Ronnie Harrison that hurt Trent Green too?",
    "timestamp" : "01:04:27-01:04:34",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:04:34-01:04:35",
    "speaker" : "Andy",
    "text" : "Was it?"
  },
  {
    "text" : "Oh I don't know. We've gotta look that one up.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:04:35-01:04:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:41-01:04:44",
    "text" : "Are we all Googling right now? This is great radio."
  },
  {
    "timestamp" : "01:04:44-01:04:46",
    "speaker" : "Mike Melo",
    "text" : "Um It was."
  },
  {
    "text" : "In nineteen ninety nine.",
    "timestamp" : "01:04:46-01:04:47",
    "speaker" : "Andy"
  },
  {
    "text" : "Are you serious?",
    "speaker" : "Mike Melo",
    "timestamp" : "01:04:47-01:04:48"
  },
  {
    "timestamp" : "01:04:49-01:04:59",
    "text" : "Acc according to Google, here we go. In nineteen ninety nine, Green was slated to be the starter for the Rams. but suffered a gruesome season ending knee injury in a preseason game on a hit by Rodney Harrison of the Chargers.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:00-01:05:08",
    "text" : "Wow. That's why everyone says he's the dirtiest player in the league. Remember he kept getting forward. Well what about Bernard Pollard? That guy sucks.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:05:08-01:05:09",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:05:12-01:05:15",
    "speaker" : "Andy",
    "text" : "Yeah, fucking hell, yeah. This is all on Wikipedia."
  },
  {
    "timestamp" : "01:05:15-01:05:19",
    "speaker" : "Mike Melo",
    "text" : "Wow, so Rodney Harrison started the Patriots dynasty."
  },
  {
    "timestamp" : "01:05:19-01:05:20",
    "speaker" : "Andy",
    "text" : "Oh wow."
  },
  {
    "text" : "Somebody uh tweet that out to him because that's unbelievable.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:05:20-01:05:24"
  },
  {
    "timestamp" : "01:05:24-01:05:27",
    "speaker" : "Andy",
    "text" : "I'm gonna let you do it because I'm scared of shit of Ronnie Harrison."
  },
  {
    "timestamp" : "01:05:27-01:05:34",
    "text" : "Dare I say, God bless. Oh, you like two of them? What?",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Oh you like tubing? Say what? What? You haven't seen that commercial? No. I missed it. Oh, you like tubing? Oh.",
    "timestamp" : "01:05:35-01:05:51",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:05:53-01:05:58",
    "speaker" : "Andy",
    "text" : "No, you're gonna have to post that for us. I'll put it in the show notes because that sounds amazing."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Imagine if Rodney can knock the ball out of, you know, you know, a wedge between a hand and a helmet. He would be the greatest.",
    "timestamp" : "01:05:58-01:06:06"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he would yeah.",
    "timestamp" : "01:06:06-01:06:07"
  },
  {
    "text" : "That's for another day.",
    "timestamp" : "01:06:07-01:06:09",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, I think it is. The Rod Pod, excuse you?",
    "timestamp" : "01:06:10-01:06:16",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:06:16-01:06:18",
    "text" : "Kurt Warner's in this commercial."
  },
  {
    "timestamp" : "01:06:18-01:06:20",
    "text" : "Jesus. Oh you're right.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, yeah.",
    "timestamp" : "01:06:21-01:06:21"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:06:21-01:06:22",
    "text" : "I know what you're talking about."
  },
  {
    "timestamp" : "01:06:22-01:06:25",
    "speaker" : "Andy",
    "text" : "I don't. I have no idea."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, he builds his own little uh man cave and he calls it the Rod Pod. Yep. Oh you're right. So they're both players uh man. Well although that would make sense that Kurt Warner would be hanging out with him.",
    "timestamp" : "01:06:25-01:06:35"
  },
  {
    "speaker" : "Andy",
    "text" : "Mike, uh football or not football, Rod Pod.",
    "timestamp" : "01:06:35-01:06:38"
  },
  {
    "timestamp" : "01:06:39-01:07:02",
    "speaker" : "Mike Melo",
    "text" : "Rod Pod. I actually this one is very easy for me because I I did see the commercial and what he's talking about is like, you know, with the money that he has, he created this environment where it's kind of like a man cave. Um, so it's the rod pod. Um what's the rod in this situation? The rod is uh it's Rodney. It's Rodney."
  },
  {
    "text" : "Oh, it's his nickname.",
    "speaker" : "Andy",
    "timestamp" : "01:07:02-01:07:03"
  },
  {
    "text" : "Oh, okay, all right. I could water uh make some joke about like a Hall of Fame jacket or something and eats chips or something. I don't know man. It it's definitely it's definitely football or not I don't know man. It's whatever I did.",
    "timestamp" : "01:07:03-01:07:17",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "text" : "Do your commentary? What was that? Warner does the I think he does the Monday night radio call or Monday night Yeah he does something like Westwood One or something, right?",
    "timestamp" : "01:07:21-01:07:32"
  },
  {
    "timestamp" : "01:07:33-01:07:37",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah I've heard I've come across it randomly every once in a while."
  },
  {
    "timestamp" : "01:07:37-01:07:41",
    "text" : "He's better than the guys that got running the ESPN broadcast.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Well yeah.",
    "timestamp" : "01:07:41-01:07:42"
  },
  {
    "text" : "And he seems to be a Patriots fan, unlike Marshall Falk and those guys that were part of that team. So I can respect him.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:07:42-01:07:49"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true. Yeah.",
    "timestamp" : "01:07:49-01:07:50"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:07:51-01:07:53",
    "text" : "Oh yeah, you hit martial fault, don't you, Andy?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes. Um but all right, this is a great segue. You ready for this? Speaking of douchebags on the Rams, how about Leonard Little? That was pretty good, right? Did either of you go down the rabbit hole I did?",
    "timestamp" : "01:07:53-01:08:06"
  },
  {
    "speaker" : "Greg",
    "text" : "No, because you were doing it, so that's not what you watch.",
    "timestamp" : "01:08:06-01:08:09"
  },
  {
    "speaker" : "Andy",
    "text" : "So Leonard Little is grade A douchebag. Uh I don't even know a kind of let's say a less successful Tyreek Hill, um, but worse. Uh go on.",
    "timestamp" : "01:08:09-01:08:25"
  },
  {
    "text" : "And by that you mean the enabling of domestic violence with pregnant girlfriends and beating kids and threatening women.",
    "timestamp" : "01:08:25-01:08:34",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "But worse.",
    "timestamp" : "01:08:35-01:08:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:08:36-01:08:41",
    "text" : "Oh wow. So um shame on you, Kansas City, by the way. Shame on you."
  },
  {
    "text" : "Uh yeah. So When he was um a rookie, his rookie season, Leonard Little, he went out I don't know if it's after a game or something, but he went out went out something and he was drinking and was driving home drunk and um collided with another car. of a mother who was going to pick up her son from a a concert and killed her.",
    "timestamp" : "01:08:41-01:09:10",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:09:11-01:09:11",
    "text" : "Oh.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, drunk driving. Um And the quote that I found of him talking about it at the time said uh it was the family's deepest wish that Little, a twenty-four year old twenty-four-year-old rookie be taken away to prison for a substantial period of time. It didn't seem an outrageous wish. This was a man who, according to the police report, was so indifferent at the time of the accident that he said of Susan Guttweiler, the the lady that he killed. The expletive ran a yellow light and hit me wrecking my forty-five thousand dollar expletive car.",
    "timestamp" : "01:09:12-01:09:44"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "All right. That's pretty douchebaggy. Anyway, looking.",
    "timestamp" : "01:09:47-01:09:50"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh yeah. So uh he pleased it.",
    "timestamp" : "01:09:51-01:09:55"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh man, do we should we have like an episode where we're just like outing every fucking douchebag? So that like it's on the record that they are giant pieces of shit and we don't support them whatsoever?",
    "timestamp" : "01:09:56-01:10:05"
  },
  {
    "text" : "Because that sounds fun and Yeah, we'll do we'll do that during the bye week.",
    "timestamp" : "01:10:05-01:10:08",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh, okay.",
    "timestamp" : "01:10:09-01:10:10"
  },
  {
    "timestamp" : "01:10:10-01:10:12",
    "speaker" : "Andy",
    "text" : "I've been looking for a bi week topic, so there it is. Oh, yeah."
  },
  {
    "timestamp" : "01:10:18-01:10:21",
    "text" : "Or was eight days.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Little pleaded guilty to involuntary manslaughter and was sentenced to 90 days in the city workhouse, four years probation and a thousand hours of community service.",
    "timestamp" : "01:10:21-01:10:30"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Doesn't this kind of like sound a little bit like um Dante Stalwarts um issue? I mean obviously I don't think he was a douchebag, but I mean yeah.",
    "timestamp" : "01:10:30-01:10:39"
  },
  {
    "timestamp" : "01:10:40-01:11:11",
    "speaker" : "Andy",
    "text" : "Yeah it was Drunk dri I mean drunk driving is sadly a a common occurrence in America for a variety of reasons. But I think just the the fact that you're not Um trite about it, I think, is is not great. But the other part of this is that um This was not his only drunk driving offense."
  },
  {
    "speaker" : "Greg",
    "text" : "Wait, did you start a backtrack, but did you say $45,000 car?",
    "timestamp" : "01:11:13-01:11:18"
  },
  {
    "timestamp" : "01:11:18-01:11:19",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "Is that expensive?",
    "timestamp" : "01:11:20-01:11:22",
    "speaker" : "Greg"
  },
  {
    "text" : "No, it was some massive SUV as well. It was like a Lincoln something or other. Um so yeah, and he his uh blood alcohol content was 0. 19, which is well over the 0. 08 in the state of Missouri. So yeah, he was suspended for eight games in that 1999 season. Um and then Other things that he uh he had on his record on January 18th, 2003, according to Wikipedia. Little was charged with communicating threats and making harassing calls. Um to his former girlfriends after um the girlfriend ended their relationship And then on April 24th, 2004, he was arrested again for, surprise, surprise, driving while intoxicated after being stopped by the police for driving 78 and a 55. At the time he had red eyes, smelled of alcohol, and failed three roadside sobriety tests. He later admitted that he drank alcohol to the police. But uh he was convicted of a misdemeanor speeding, but acquitted of DUI basically because uh the police, I don't know, screwed something up and there was a loophole. But he was uh prohibited from drinking any sort of alcoholic beverage for his probation.",
    "speaker" : "Andy",
    "timestamp" : "01:11:22-01:12:45"
  },
  {
    "timestamp" : "01:12:45-01:12:47",
    "speaker" : "Mike Melo",
    "text" : "How long was this probation?"
  },
  {
    "speaker" : "Andy",
    "text" : "Um two years.",
    "timestamp" : "01:12:48-01:12:50"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:12:51-01:12:52",
    "text" : "No chance."
  },
  {
    "text" : "No, oh absolutely not. So right. Douchebag of the week. Goes to level a little.",
    "timestamp" : "01:12:52-01:13:00",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's a good point. You can afford a forty-five thousand dollar car, whatever that means. You can't get a driver. I mean, call a cab. Yeah. Invent the Uber.",
    "timestamp" : "01:13:01-01:13:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:10-01:13:21",
    "text" : "So the uh The article that I found was interviewing the the dead mom's son, and that's basically what he said. He's like, why the fuck aren't you just renting a limo every time you go out?"
  },
  {
    "timestamp" : "01:13:23-01:13:23",
    "speaker" : "Mike Melo",
    "text" : "Wow."
  },
  {
    "text" : "Which can argue with that.",
    "timestamp" : "01:13:23-01:13:24",
    "speaker" : "Andy"
  },
  {
    "text" : "Hey, you know what I'm realizing? I'm realizing that in talking about football, there's a lot of dark moments on this podcast.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:13:26-01:13:33"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:33-01:13:34",
    "text" : "Yeah."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And",
    "timestamp" : "01:13:34-01:13:34"
  },
  {
    "text" : "But all right, we're not going to be able to do that.",
    "timestamp" : "01:13:35-01:13:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "This is true. You don't know shit. I I think I can spot a a piece of shit when I see one, but you never know.",
    "timestamp" : "01:13:43-01:13:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. So on I don't know if a lighter note's the right term, but on a karmic note In the aforementioned list of Rams players that got injured, on there was Leonard Litter, Leonard, Leonard Little, who had sprained his MCL in this game. Patriots are karma for that shit. Fuck. Try to drive him with a sprained MCL, bitch.",
    "timestamp" : "01:13:49-01:14:14"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:14:14-01:14:15",
    "text" : "Yeah, fuck you."
  },
  {
    "speaker" : "Andy",
    "text" : "All right.",
    "timestamp" : "01:14:16-01:14:17"
  },
  {
    "speaker" : "Greg",
    "text" : "Go ahead. I know it's scumbag when I see it.",
    "timestamp" : "01:14:19-01:14:22"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. I was just jumping on on your uh passion, Greg. So There you go. I mean we could take it again. You start. What am I starting? Just anything. Like uh how do you feel about Leonard Little?",
    "timestamp" : "01:14:23-01:14:34"
  },
  {
    "text" : "Fuck that guy.",
    "timestamp" : "01:14:35-01:14:35",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, he's a fucking piece of shit. Yeah. I felt I felt pretty good about that.",
    "timestamp" : "01:14:35-01:14:41"
  },
  {
    "timestamp" : "01:14:42-01:14:43",
    "text" : "Yeah, you sounded like you felt pretty good.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:14:44-01:14:44",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "All right. Um I think it's about time we wrap this up. Does any of you want to do your best and worst?",
    "timestamp" : "01:14:45-01:14:51"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I don't have any. That's a surprise. Um I will say my worst, and usually I love this, but it was a little silly in this game. Uh Teddy Bruski was just throwing his body around for the hell of it, even when It wasn't near the football. So there's like one play where Marshall Falk is, you know, cutting back into his run or whatever, and Bruce is just seen launching himself off screen.",
    "timestamp" : "01:14:52-01:15:17"
  },
  {
    "text" : "This flash of white off to the corner.",
    "timestamp" : "01:15:19-01:15:21",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:15:21-01:15:22",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Legless Teddy Brisky.",
    "timestamp" : "01:15:22-01:15:23"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "So I don't know if that was that great. And then the uh the best for me was seeing the um the silver painted head fan guy.",
    "timestamp" : "01:15:24-01:15:31"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yes. And and somebody had written on the top of his head, um, like coming up next Monday night countdown or something like that.",
    "timestamp" : "01:15:31-01:15:38"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I didn't see that.",
    "timestamp" : "01:15:39-01:15:40"
  },
  {
    "timestamp" : "01:15:40-01:15:46",
    "speaker" : "Andy",
    "text" : "That's uh yeah, like like they came back from a commercial and it was like just showing the top of his head and it said that and he lifted it up."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh, I see.",
    "timestamp" : "01:15:46-01:15:47"
  },
  {
    "timestamp" : "01:15:47-01:15:49",
    "speaker" : "Andy",
    "text" : "Sketchy look on his face, yeah."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, I don't know that guy's name, but props to you. Unless he's a piece of shit, and then I take that back.",
    "timestamp" : "01:15:49-01:15:54"
  },
  {
    "text" : "Yeah, well the most famous picture is a mugshot.",
    "timestamp" : "01:15:54-01:15:58",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:15:58-01:16:04",
    "text" : "What? So wait, is that actually him? The guy with the tattooed head? Wait, he has a mugshot?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh man. See I knew it. I mean I don't know. I can't pull for anybody anymore.",
    "timestamp" : "01:16:04-01:16:09"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:16:09-01:16:15",
    "text" : "Yeah, is he's got a Patriots helmet like tattooed on his head too. It's bald. Is that the same guy though?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I don't know.",
    "timestamp" : "01:16:16-01:16:16"
  },
  {
    "text" : "I don't know.",
    "timestamp" : "01:16:16-01:16:17",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh.",
    "timestamp" : "01:16:17-01:16:17",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:16:17-01:16:25",
    "text" : "Well we're talking about the guy that painted his whole head silver. They looked at it. Kinda similar, so it might be the same."
  },
  {
    "timestamp" : "01:16:25-01:16:35",
    "speaker" : "Mike Melo",
    "text" : "Look, I'll make the statement. I don't know him. I don't agree with anything that he's ever done in his life. It was just it was I've seen him before in games and it was it was nice to see him again."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, it was a blast from the past. All right. That's great. Greg, so you say you don't have a best on worse? You're not gonna pull one out of your ass?",
    "timestamp" : "01:16:36-01:16:42"
  },
  {
    "speaker" : "Greg",
    "text" : "Now that you guys mentioned the fans, there was one like I don't want to body shame people, but he was a guy guy. Like and his head was just big. And he had one of those little like old school, not like quite leather helmet, but the no mask. Yeah.",
    "timestamp" : "01:16:43-01:16:59"
  },
  {
    "timestamp" : "01:17:06-01:17:24",
    "speaker" : "Andy",
    "text" : "So it looked like Ben Rothesburger. Or no, who was it that uh Uh not not the duck dude, but the the other quarterback they started this year. Yeah, where uh he got the concussion and they had to take his face mask off. And you had that that head that looked like you had to pour into the helmet in the first place. Yeah."
  },
  {
    "timestamp" : "01:17:25-01:17:26",
    "speaker" : "Mike Melo",
    "text" : "It just looks horrible."
  },
  {
    "text" : "That's fine. Nobody cares.",
    "timestamp" : "01:17:29-01:17:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:17:30-01:17:32",
    "text" : "I actually kind of look down on it a little bit."
  },
  {
    "text" : "I'm gonna I'm gonna cut that out that you said that anyway, so don't worry about it.",
    "timestamp" : "01:17:32-01:17:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "No fine.",
    "timestamp" : "01:17:35-01:17:36"
  },
  {
    "text" : "Say that again, Greg?",
    "timestamp" : "01:17:38-01:17:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:17:40-01:17:50",
    "speaker" : "Greg",
    "text" : "I was saying if it was like the same situation as Rudolph, but it was Big Ben with that face like spilling out of the helmet, that's what Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh boy. All right. Um my best for this game was the uh live interactive polls on the challenges. Did you see this? Every time there was a coach's challenge, you know, they'd show the referee like watching the game, they'd do the the box like the the shots of both head coaches and stuff. But then when they came back from the challenge, they the I apparent I I'm guessing you could like text in or something. It doesn't actually say. But it was the viewers' votes of let the place stand or overturn it and it would show you the percentage, like how many people voted. So for I think this was the screenshot that I have is of the The Antoine Smith fumble. And out of 39,006 votes, 57% said overturn it, and 43% said let the place stand. And why the fuck that isn't still a thing is amazing to me.",
    "timestamp" : "01:17:51-01:18:46"
  },
  {
    "timestamp" : "01:18:46-01:18:48",
    "speaker" : "Greg",
    "text" : "It should definitely still do that."
  },
  {
    "timestamp" : "01:18:48-01:19:02",
    "speaker" : "Andy",
    "text" : "Right? Because you oh, you could get so much like sports talk fodder out of that, especially if they get something egregiously wrong, like last year's um NFC championship game where it should have been passing their fairness. Like that sort of shit."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh maybe let him decide. Let him make the call.",
    "timestamp" : "01:19:02-01:19:05"
  },
  {
    "text" : "Yeah, but maybe that's uh like yeah, that that voting should be what what results in the actual play. Yeah, but now that you bring that up",
    "speaker" : "Andy",
    "timestamp" : "01:19:05-01:19:12"
  },
  {
    "text" : "I mean, remember the show Playmakers, how it was out for a season and then the NFL squashed that. And then like then there was a NFL Blitz, the video game, where like, you know, you can do all kinds of messed up shit and then they squashed that. And then now we even in Madden like they they're pretty tight on certain things. So maybe for that reason actually, they're like, you know what? Fuck this.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:19:12-01:19:31"
  },
  {
    "timestamp" : "01:19:32-01:19:57",
    "text" : "Don't want to make your referees look bad. You might be right. That's a good point. All right, so that was my best. Um, and my worst was uh our our old friend Shank, Dan Shaughnessy. The day after the game is real immediate, just firing up that QB controversy machine. And I'm gonna leave you with this quote from Dan Chaughnessy.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:19:57-01:20:01",
    "text" : "Well then I'm gonna I'm gonna piggyback on this quote as well. All right."
  },
  {
    "text" : "Leave the Cadillac in the garage. The Toyota takes you around town and it gets better gas mileage. Talking about Brady versus leaving Drew Bledsoe on the sidelines in a close game against a good team.",
    "timestamp" : "01:20:02-01:20:15",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:20:15-01:20:18",
    "speaker" : "Greg",
    "text" : "Yeah, who who is he who's who in that?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:20:18-01:20:21",
    "text" : "Uh Drew Bledsoe is the Cadillac."
  },
  {
    "timestamp" : "01:20:22-01:20:23",
    "text" : "Shanks such a fucking idiot.",
    "speaker" : "Greg"
  },
  {
    "text" : "So maybe we'll tweet this at him too. Will you still stand by this, you fucking mora? Yeah.",
    "timestamp" : "01:20:25-01:20:30",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:20:33-01:21:28",
    "speaker" : "Mike Melo",
    "text" : "Well and uh to piggyback on that, I thought I was kinda led down by this. But you know how like Brady even throughout most of this, you know the opportunity, he's been very confident. Everything that he says is like basically I'm the best. I'll learn from this, uh whatever. So um Boletto, uh he had a quote where he was just talking about, you know what happens with playing time or whatever and he says I intend to make it very hard for Brady to stay on the field. But if he's playing better than I am, he'll keep playing. I was like what kind of alright, I'm not gonna go crazy, but what kind of shit is that? Like convince me that you want the time. Don't play PC That wasn't PC. Yeah, well, it's like, yeah, if he's playing better than me, then he'll keep playing. No, don't don't say that shit. Say I'm gonna I'm gonna get the job. I'm gonna get the job. No. What"
  },
  {
    "text" : "I'm with Andy. It's he's being realistic.",
    "timestamp" : "01:21:28-01:21:31",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:21:31-01:21:34",
    "text" : "Yeah. All right. And he's also like not shitting on Tom Brady too.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, but here's the thing. All right. My uncle told me this this once and I don't know if it's true, but it doesn't matter because it still makes my point. Uh there's this soccer player one time, he kicked a goal from from midfield, right? And then he did it again. He did two he he shot two goals from midfield, won the game, and after the game they said Um, hey man, like how did that happen? And then he said, uh, you know, it was luck, it can happen to anybody. And you know who that guy was? No. No one knows because no one fucking remembers him. So you gotta ham it up, baby. PR. That's such a typical Portuguese like story. Don't bring this into it, okay?",
    "timestamp" : "01:21:35-01:22:25",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "You know it's true.",
    "timestamp" : "01:22:26-01:22:27",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:22:27-01:22:28",
    "text" : "What do you say, Greg?",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Can't hear you, Greg. Say that again.",
    "speaker" : "Andy",
    "timestamp" : "01:22:31-01:22:33"
  },
  {
    "timestamp" : "01:22:33-01:22:37",
    "text" : "It's the same. It's very Portuguese, you know, like the I'm right, you're wrong.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh right. Whatever, man. I'm American baby. So on that note, see you next week. Uh love talking to you guys. It's always a pleasure, even when it's not.",
    "timestamp" : "01:22:37-01:22:47"
  },
  {
    "text" : "Hell yeah. I love it. Thanks for thanks for walking us out. What do we have to look forward to next week, Mike? Tell me about it.",
    "timestamp" : "01:22:47-01:22:55",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:22:55-01:23:09",
    "speaker" : "Mike Melo",
    "text" : "Dude, you we're gonna they're gonna the Patriots are playing this team and that team i they they're Guns are out and they're just firing on all cylinders. So if that's not a teaser for you, I don't know what is."
  },
  {
    "speaker" : "Andy",
    "text" : "They're coming marching in if that helps.",
    "timestamp" : "01:23:10-01:23:12"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:23:13-01:23:15",
    "text" : "Sure. Easier."
  },
  {
    "speaker" : "Andy",
    "text" : "Saints are coming marching into Foxboro Stadium.",
    "timestamp" : "01:23:15-01:23:18"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right, right, right.",
    "timestamp" : "01:23:18-01:23:19"
  },
  {
    "speaker" : "Andy",
    "text" : "The only team so far this year to have beaten the Rams that we just lost to. So we'll have that to look forward to next week on the episode of the Patriots Dynasty Podcast. Greg, what?",
    "timestamp" : "01:23:19-01:23:33"
  },
  {
    "timestamp" : "01:23:34-01:23:38",
    "speaker" : "Greg",
    "text" : "One last thing. This is the last time that the Patriots have lost to the Rams."
  },
  {
    "text" : "Oh wow. That's pretty good. That was worth stopping it. And now for the fourth attempt at exiting this podcast. Great hearing from you guys. Love ya. Take it easy.",
    "timestamp" : "01:23:39-01:23:48",
    "speaker" : "Mike Melo"
  }
]