[
  {
    "timestamp" : "00:00-00:19",
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "speaker" : "Mom"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:23-00:55",
    "text" : "Alright, shall we just uh jump right in, shall we boys? Alright. Don't sound too excited, Jesus. All right, welcome to the Pages Dynasty Podcast. The in-person Pages Dynasty podcast this week. Woo woo! We are here in New Hampshire, in the sticks of New Hampshire. This probably won't be aired at Christmas, but it is Christmas for us. So we are all together in the same room for the first time in Fucking years, I would think."
  },
  {
    "text" : "And I gotta say, this really drives home the point that we're all people for radio, you know? Looking at how ugly you guys are.",
    "speaker" : "Greg",
    "timestamp" : "00:55-01:03"
  },
  {
    "timestamp" : "01:03-01:08",
    "text" : "I don't know I don't know. I th m Mr. Mel's got a man has a face for cheating I didn't know.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh that's a that's adorable. I think it was a joke, but it's better than the pro. It's not like a man bun, it's like a man ponytail.",
    "timestamp" : "01:08-01:18"
  },
  {
    "text" : "Well pony. I was thinking of putting it up. I didn't know I didn't know what the family was gonna say. I didn't know what your parents would have you know, I wanted to be respectful.",
    "timestamp" : "01:18-01:27",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "You came with the with the last samurai look, got it. Oh so you can turn that into a fro if you wanted.",
    "timestamp" : "01:27-01:33"
  },
  {
    "text" : "Oh yes, yes. I uh I I hate to admit it, but uh it was recently straightened. So I know. Well Los Angeles guys, you know. At least I don't support the Rams. So",
    "speaker" : "Steve",
    "timestamp" : "01:33-01:47"
  },
  {
    "text" : "The Super Bowl hangover. Yeah. And I I this is this has nothing to do with the Patriots, but I heard it today. It was a stat that I heard that I've already told Steven, but I I I need to share with as many people as possible. So I heard a stat today. uh for Jameis Winston and the games where he has thrown a is his record in games where he's thrown uh an interception on the first drive. He is four and two in those games. Wow. That uh makes sense. Two things. One, he's done it six times this year.",
    "timestamp" : "01:52-02:28",
    "speaker" : "Andy"
  },
  {
    "text" : "Right. Enough to track it.",
    "timestamp" : "02:29-02:30",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:30-02:33",
    "text" : "Two, he's got a winning record. Good for him."
  },
  {
    "timestamp" : "02:33-02:35",
    "text" : "What about all the other times?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Other times what?",
    "timestamp" : "02:35-02:36"
  },
  {
    "text" : "What's the record? I I don't know where they're at right now. They're eight and eight?",
    "timestamp" : "02:36-02:39",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:39-02:45",
    "text" : "Uh I think they're like eight and eight. Oh okay. Maybe so. But they still have another week to go. He's got time to set this record and own it.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, they're they're they're Supremely mediocre, but right.",
    "timestamp" : "02:45-02:49"
  },
  {
    "timestamp" : "02:49-02:52",
    "speaker" : "Greg",
    "text" : "He could he could join the 30-30 club too."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Because he's I think is he leading the league in both touchdowns and interceptions? Definitely.",
    "timestamp" : "02:52-02:57"
  },
  {
    "timestamp" : "02:57-02:59",
    "text" : "Maybe not touchdowns.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I think Jackson is, but he's top three touchdowns in far and away at the league.",
    "timestamp" : "02:59-03:04"
  },
  {
    "text" : "He'd be the first ever thirty thirty guy. That's impressive.",
    "speaker" : "Greg",
    "timestamp" : "03:05-03:08"
  },
  {
    "text" : "Call thirty for thirty.",
    "speaker" : "Andy",
    "timestamp" : "03:10-03:12"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "03:13-03:17",
    "text" : "He's tied, right? With uh the NFL record on pick sixes."
  },
  {
    "timestamp" : "03:17-03:20",
    "text" : "On pick sixes in the season, yes. With did anybody know this?",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, as the Houston Texans did.",
    "speaker" : "Steve",
    "timestamp" : "03:20-03:22"
  },
  {
    "timestamp" : "03:23-03:47",
    "text" : "No, you would think. Eli Manning. Very close, but no. Yes. With six in one season. And I haven't actually looked it up which season it was, but it wouldn't surprise me if it was the one we're talking about this week or this year. Because he threw two against the Patriots. In the first time the Pats by the Colts one to Tylaw and one two O T I S O to Smith.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "So how is that in debate? Um for GOAT status between Peyton and Brady going these days.",
    "timestamp" : "03:48-03:53"
  },
  {
    "timestamp" : "03:53-04:00",
    "text" : "Yeah, if Peyton is tied with Jameis in any interception category all time, gotta be a ding.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "That that's a black mark for sure. Uh all right, that's all I want to talk about. But I mean we'll stay in the where are they the NFC South? Is that where the Buccaneers are? Yep. With the Atlanta Falcons going down to the ATL. A we actually made it halfway through the season, boys. I I was I didn't think that would happen.",
    "timestamp" : "04:00-04:22"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I mean it only took us Like most of a regular NFL season though.",
    "timestamp" : "04:22-04:26"
  },
  {
    "text" : "Got there, guys. We got there. Round of applause. Round of applause.",
    "speaker" : "Steve",
    "timestamp" : "04:26-04:30"
  },
  {
    "timestamp" : "04:32-04:57",
    "text" : "All right, so week week eight Coming in this game, Pats are three and four. Falcons are three and three. So battle of mediocrity, in theory, at least at this point of the season. The um Let's see the Falcons will finish this season um mired in mediocrity. They'll finish season seven and nine. Fourth in the NFC West. So when I said NFC South, you all agree with me? Fuck all of us.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "05:00-05:05",
    "text" : "But in the NFC West, it's like San Fran, the Rams, Cardinals, right?"
  },
  {
    "timestamp" : "05:05-05:12",
    "speaker" : "Andy",
    "text" : "Well they this is pre-2002 when they shifted everything, so we both may be right. Oh boy. I'm not about to look it up again."
  },
  {
    "timestamp" : "05:12-05:14",
    "speaker" : "Steve",
    "text" : "Am I the guy looking things up again?"
  },
  {
    "text" : "Because that ended very well. Why would you put Indy in the East? Yeah, why would you put Miami in the East?",
    "timestamp" : "05:14-05:20",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. So yeah, who would it be in the in the AFC East? Who would you put if you realign them? Patriots Quebec Bills. Um the Quebec whatever. Jets. I don't know if you want to put both Qu New York teams in the same each other all the time.",
    "timestamp" : "05:20-05:40"
  },
  {
    "text" : "Yeah, but that would be pretty cheated.",
    "speaker" : "Steve",
    "timestamp" : "05:40-05:41"
  },
  {
    "text" : "Oh, Pittsburgh Steelers.",
    "timestamp" : "05:42-05:44",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. Yeah. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "05:44-05:45"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:46-05:57",
    "text" : "Next closest, and that would be a hell of a rivalry. Well, it wouldn't have been. Everybody in the AFC North would think so, but um the Patriots have owned the Steelers over those years."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. Steelers fans will know that.",
    "timestamp" : "05:57-05:59"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:00-06:01",
    "text" : "Deep down they do, but they won't admit it."
  },
  {
    "text" : "Think about it. Oh, we'll make the playoffs and then we'll win the first round game and then we'll go to New England and beat the Patriots with Duck Hodges. I'm just like, okay, even you don't know.",
    "timestamp" : "06:01-06:11",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Quack, quack. Uh yeah, but uh so the Falcons would win three in a row after this game. That was the longest winning streak of the the season. But they would follow that losing five of the last six games to finish uh out of the playoff hunt, we'll say, to be polite. Head coach Dan Reeves. I remember Dan Reeves.",
    "timestamp" : "06:12-06:37"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "06:37-06:37"
  },
  {
    "text" : "Coach coach for twenty-three years. I didn't realize he coached that line.",
    "speaker" : "Andy",
    "timestamp" : "06:37-06:40"
  },
  {
    "speaker" : "Greg",
    "text" : "What? What? And and was paralyzed. Oh my god.",
    "timestamp" : "06:42-06:48"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "06:49-06:53",
    "text" : "A skiing, Greg. And now the guy who played Superman."
  },
  {
    "timestamp" : "06:54-07:01",
    "speaker" : "Greg",
    "text" : "I know, I was being slightly facetious. I don't remember that guy's name is that. R I T."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:01-07:25",
    "text" : "They may be related. We don't know. I mean, I won't say uh I'd like to force a a Dan Reeves played retired against the Pages, but this is his only game. So that joke doesn't really work. That would have been great though. Was his only game against Belichick? Was this ever Uh uh at least when Belichick was in the Patriots, yeah."
  },
  {
    "text" : "Even though He coached twenty three years and only played us once.",
    "timestamp" : "07:25-07:29",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "This is kinda towards the end of the the his tenure because he did twelve years of the Broncos for the Giants and then finished with seven years with the Falcons. So this he he only coached till two thousand three. It was eighty-one to two thousand three, so This was like his Twilight era.",
    "timestamp" : "07:30-07:44"
  },
  {
    "text" : "He must have played Belichick when he was in the Browns, maybe.",
    "speaker" : "Mike Melo",
    "timestamp" : "07:44-07:46"
  },
  {
    "text" : "Maybe you would think, yeah. Um Although NFT even maybe even with the Giants when he was uh defensive coordinator, but so they're what three years removed from their Super Bowl year? Is that right? No, 90 98 was the dirty birds where they went fourteen and two.",
    "timestamp" : "07:47-08:04",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "08:05-08:06",
    "text" : "Oh man, I love that team.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "08:06-08:08",
    "speaker" : "Andy",
    "text" : "That was ninety-eight, so three years removed."
  },
  {
    "text" : "Jamal Anderson.",
    "timestamp" : "08:08-08:09",
    "speaker" : "Greg"
  },
  {
    "text" : "Yep. But after that, so that so they went fourteen-two that year. NFC champions made the Super Bowl. Didn't win it.",
    "speaker" : "Andy",
    "timestamp" : "08:10-08:16"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Who did they get rocked by? Somebody.",
    "timestamp" : "08:16-08:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:18-08:49",
    "text" : "Broncos, yep. That was bad. Um wait. No, it's f it was 49ers. No, never mind. I'm thinking of somebody else. Right on the yeah, yeah, yeah, yeah. Sign up. Um fourteen and two uh that year, ninety-eight, ninety nine the their Super Bowl hangover lasted uh one, two, three. Three years. And they went five and eleven, four and twelve, and then this year was seven and nine. Before they went. Wow."
  },
  {
    "speaker" : "Greg",
    "text" : "The five wins. Yeah.",
    "timestamp" : "08:50-08:52"
  },
  {
    "speaker" : "Andy",
    "text" : "And then four wins the year after.",
    "timestamp" : "08:52-08:54"
  },
  {
    "text" : "Well, I mean, I literally recognize nobody on this team. I have in my notes here. I don't recognize anybody. Oh shit, Algie Crumpler. And then ooh, I spotted Mike Vick on the sidelines. Like that's literally how my thought process went. There were a couple of defenders that were pretty nasty. I knew nobody.",
    "speaker" : "Mike Melo",
    "timestamp" : "08:54-09:12"
  },
  {
    "text" : "Keith Brooking. Keith Brooking, I recognize his name, but I didn't realize how well he was.",
    "speaker" : "Andy",
    "timestamp" : "09:12-09:16"
  },
  {
    "text" : "I mean he was like the Earl actor type, not just because he's white, thank you, Greg. I know you're gonna say that.",
    "timestamp" : "09:17-09:22",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "09:26-09:28",
    "text" : "He also reminds me a lot of Sean Lee."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, uh so I had um he was the only pro bowl on defense. He had 125 tackles that year. Three and a half sacks, two picks, two fumble recoveries. Like the guy was an absolute he was I think he basically was the defense. He was a bit of a Shawn Lee as the defense, as he goes, the defense goes. Um maybe without the injury problems. Uh other big names I had were Ray Buchanan. Yep. Cornerback. I don't remember him. He was uh was he number twenty four? I forgot to look it up before this, but we're just gonna assume he was because",
    "timestamp" : "09:36-10:07"
  },
  {
    "timestamp" : "10:07-10:10",
    "text" : "All the best call on XY 24. Exactly.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:11-10:15",
    "text" : "That's right. Science. Ashley Ambrose."
  },
  {
    "timestamp" : "10:16-10:27",
    "text" : "Well they both they they co-led the team with five picks. Um and then Patrick Kearney was the uh defensive end who led the team with 12 sacks. I don't remember him.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "10:28-10:31",
    "text" : "He was pretty good. Literally nine guys. Maybe Ray Buchanan is it.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I remember Ashie Ambrose. I don't remember Patrick Curry first.",
    "speaker" : "Andy",
    "timestamp" : "10:31-10:34"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "10:34-10:35",
    "text" : "There was nobody else."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "10:36-10:52",
    "text" : "Wait a minute. Offense. Sean Jefferson guys. Sean Jefferson. That was like the Vincent Brisbane days. Was it? Oh yeah. Yeah. He was playing opposite him to the old two and eighty four, I believe. That's the same guy. Yeah. That was the same. Yeah, same guy."
  },
  {
    "timestamp" : "10:52-11:01",
    "speaker" : "Andy",
    "text" : "Yeah, because he played for the Patriots. It was ninety six. Ninety-six to ninety-nine. Yep. Before that he was a Charger."
  },
  {
    "text" : "So got such a generic name I didn't put two and two together.",
    "timestamp" : "11:02-11:05",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Well, did you know there's a Sean the guy on LSU right now, Sean Jefferson Jr. Is it his son? Not his son. Not related at all. I got so excited when I was watching them play and then I looked it up and I'm like, well, just not related.",
    "timestamp" : "11:05-11:20",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "11:20-11:35",
    "text" : "That's kind of like we talked about Jim Mora earlier. I'm not sure if that's like the the later Jim Morris son or not. I think we just kind of assumed that they were that they were just named the same, but we never actually put together. I think it might be.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "11:35-11:40",
    "speaker" : "Steve",
    "text" : "Didn't we figure that out? Nope. I don't know where my phone is or else I would uh go down the Google rabbit hole."
  },
  {
    "text" : "Not not in the moment we didn't. Okay Uh but yeah, so offensive players, uh Chris Chandler, who led the team in fumble recoveries with four.",
    "timestamp" : "11:41-11:51",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "11:51-11:52",
    "speaker" : "Mike Melo",
    "text" : "Cool."
  },
  {
    "timestamp" : "11:52-11:59",
    "text" : "Pretty great. Uh also Uh not as great since they were his own fumbles, which he also led the team in with eight.",
    "speaker" : "Andy"
  },
  {
    "text" : "Eight is not bad.",
    "timestamp" : "12:00-12:01",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:02-12:03",
    "text" : "A Keely Smith style."
  },
  {
    "speaker" : "Steve",
    "text" : "She's pretty uh a pretty stationary guy.",
    "timestamp" : "12:04-12:06"
  },
  {
    "text" : "Um but he actually went uh he went six and eight, but I remember there was some stat in the game. I I think I wrote it down. Of his win-loss record when he actually finished the game was really good. He just didn't often finish games.",
    "speaker" : "Andy",
    "timestamp" : "12:07-12:27"
  },
  {
    "timestamp" : "12:28-12:30",
    "text" : "Oh yeah. Something like he's always injured.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, like constantly injured.",
    "timestamp" : "12:30-12:31",
    "speaker" : "Andy"
  },
  {
    "text" : "This is the quarterback we're talking about, right? Again. Yes. For no name.",
    "speaker" : "Mike Melo",
    "timestamp" : "12:32-12:38"
  },
  {
    "timestamp" : "12:38-13:02",
    "speaker" : "Andy",
    "text" : "He went to a Super Bowl. So forget it. He also threw three interceptions in the Super Bowl. 2800 yards, 16 touchdowns, 14 picks. But the bigger story of the quarterback for the Falcons this year was their first overall draft pick. Rookie Michael Vick."
  },
  {
    "timestamp" : "13:02-13:03",
    "speaker" : "Mike Melo",
    "text" : "Was he number one overall?"
  },
  {
    "speaker" : "Steve",
    "text" : "Michael Vick.",
    "timestamp" : "13:03-13:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Number one overall.",
    "timestamp" : "13:04-13:05"
  },
  {
    "speaker" : "Steve",
    "text" : "Wait, when did he start going by Mike Vick?",
    "timestamp" : "13:06-13:08"
  },
  {
    "text" : "I don't know. Was that a thing or I mean we're we're pretty uh early. No, well well I think it just in this podcast in general we we tend to use full names, so I'm gonna call him Michael Vick.",
    "timestamp" : "13:09-13:18",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Okay.",
    "timestamp" : "13:19-13:19"
  },
  {
    "text" : "But he was Michael. Like I call you Michael Mello?",
    "timestamp" : "13:19-13:20",
    "speaker" : "Andy"
  },
  {
    "text" : "Yes. Yeah, Michael Mello. It's a beautiful name.",
    "timestamp" : "13:21-13:22",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:22-13:26",
    "text" : "He did start I think it was after prison maybe, maybe that was his prison name."
  },
  {
    "text" : "Was it? I am sure it was when that switch happened. 'Cause it was Mike and then he made a statement where he wanted to be known as Michael, be like respectable.",
    "timestamp" : "13:27-13:36",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "13:36-13:40",
    "speaker" : "Andy",
    "text" : "I think it was when he was like hanging out with Oh he said we went from Mike to Michael, not the other way around. Oh I thought it was the other way around."
  },
  {
    "speaker" : "Greg",
    "text" : "I don't know. I mean you'd think if you wanted more respectable, you'd go to Michael and I'm going to go. You would think, yeah, you want the full.",
    "timestamp" : "13:43-13:48"
  },
  {
    "text" : "you know, non- Yeah.",
    "timestamp" : "13:51-13:54",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I I imagine the the Google results for uh Mike Vick were probably not in his favor. So maybe he's like, you know what?",
    "timestamp" : "13:54-14:00"
  },
  {
    "timestamp" : "14:00-14:01",
    "speaker" : "Greg",
    "text" : "I'm a trillion."
  },
  {
    "speaker" : "Andy",
    "text" : "So so they put a whole bunch of SEO effort into Michael",
    "timestamp" : "14:03-14:05"
  },
  {
    "speaker" : "Steve",
    "text" : "PR one oh one baby Nobody'll remember if I just slightly tweaked PR one oh what you start fresh remember what woof woof what what are you what are you talking about",
    "timestamp" : "14:07-14:18"
  },
  {
    "text" : "I think his nickname was Big Dog maybe? Something like that? Is that what we're talking about? I think I'm missing something.",
    "timestamp" : "14:23-14:29",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:29-14:34",
    "speaker" : "Mike Melo",
    "text" : "Wow. Yeah, I don't know. I guess I missed all this. I'm trying to play at PC so doesn't get f fired later."
  },
  {
    "speaker" : "Steve",
    "text" : "So the record I don't condone whatever you want to talk about. You never do.",
    "timestamp" : "14:35-14:39"
  },
  {
    "timestamp" : "14:40-14:42",
    "speaker" : "Mike Melo",
    "text" : "Okay, we got Jonas Gray to condone it."
  },
  {
    "text" : "So at wide receiver, they had four guys who seemed to be carving copies of each other. They're four guys with just about five hundred yards receiving, uh, which is hugely mediocre. Uh Terrence Mathis, who I recognize the name but couldn't pick his face out of a lineup. Tony Martin, the aforementioned Sean Jefferson. And he's Greg's favorite Brian Finn, because of the color of his skin.",
    "speaker" : "Andy",
    "timestamp" : "14:44-15:10"
  },
  {
    "timestamp" : "15:10-15:16",
    "speaker" : "Steve",
    "text" : "Wow. Come on man. See that I mean I don't know. Is this what we're doing? Is this what we're doing?"
  },
  {
    "text" : "I mean well I I'm the college failure, so I I figured we'd just start something. About Gregory Hab, he's the racist of the group.",
    "speaker" : "Andy",
    "timestamp" : "15:17-15:23"
  },
  {
    "text" : "You do have a degree, Andy. Don't put yourself down.",
    "timestamp" : "15:25-15:27",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "15:27-15:44",
    "speaker" : "Andy",
    "text" : "I do. But you know what my favorite joke is when it gets cold like this, now that you guys are are here in New Hampshire? Because when it gets down, well if I turn on my car and it says it's it's zero degrees Fahrenheit, I'll text my wife and I'll say, you know what, uh the the the weather today and my time at Penn State have in common? Zero degrees."
  },
  {
    "speaker" : "Steve",
    "text" : "Wow.",
    "timestamp" : "15:45-15:46"
  },
  {
    "text" : "You didn't even laugh at the first time, which is why I keep sending it.",
    "speaker" : "Andy",
    "timestamp" : "15:46-15:49"
  },
  {
    "timestamp" : "15:50-15:51",
    "speaker" : "Mike Melo",
    "text" : "Persistence of fee, Andy, for sure."
  },
  {
    "timestamp" : "15:52-15:57",
    "speaker" : "Andy",
    "text" : "That's what I'm saying. No, it's the opposite actually."
  },
  {
    "speaker" : "Greg",
    "text" : "Well, if I'm a rapist, Steve touches kids. I also don't condone any of this.",
    "timestamp" : "15:58-16:04"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I didn't go to Penn State. Andy did.",
    "timestamp" : "16:05-16:07"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "16:08-16:15",
    "text" : "And I apologize for insinuating that you might have enabled his behavior. I assume you didn't know that that was going on, Andy."
  },
  {
    "speaker" : "Andy",
    "text" : "I was not on a first name basis with any of the uh the Penn State coaching staff.",
    "timestamp" : "16:16-16:21"
  },
  {
    "speaker" : "Steve",
    "text" : "At all?",
    "timestamp" : "16:21-16:22"
  },
  {
    "text" : "No, no.",
    "timestamp" : "16:22-16:23",
    "speaker" : "Andy"
  },
  {
    "text" : "Hot take. He didn't even do it. I'm gonna put that out there.",
    "speaker" : "Greg",
    "timestamp" : "16:26-16:30"
  },
  {
    "text" : "Who didn't do it? Dandosky.",
    "speaker" : "Andy",
    "timestamp" : "16:30-16:33"
  },
  {
    "timestamp" : "16:33-16:36",
    "speaker" : "Greg",
    "text" : "Oh, yeah? Why don't you read the transcripts?"
  },
  {
    "timestamp" : "16:36-16:37",
    "text" : "Transcripts, Rob.",
    "speaker" : "Andy"
  },
  {
    "text" : "Alright, go into that script.",
    "timestamp" : "16:37-16:39",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Is the phone call perfect? Dude, they're they're key witness. He's all over the place. He's a kid. One day remembers this thing, one day remembers that thing. No one actually saw anything.",
    "speaker" : "Greg",
    "timestamp" : "16:39-16:49"
  },
  {
    "text" : "Well some people did. They were just children.",
    "timestamp" : "16:49-16:52",
    "speaker" : "Andy"
  },
  {
    "text" : "For the record you didn't see anything either.",
    "timestamp" : "16:54-16:55",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "16:55-16:57",
    "text" : "I I did not see anything, no.",
    "speaker" : "Andy"
  },
  {
    "text" : "Okay. No.",
    "speaker" : "Greg",
    "timestamp" : "16:57-16:57"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "16:57-16:59",
    "text" : "That's uh that's a red hot thing."
  },
  {
    "text" : "I did read an article that said that. But I don't know enough about it.",
    "speaker" : "Greg",
    "timestamp" : "17:00-17:03"
  },
  {
    "text" : "Save it for later. That's that's gonna be the the teaser for the podcast.",
    "speaker" : "Andy",
    "timestamp" : "17:12-17:15"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I mean that's PR one oh one. Just a little sound clip. Greg, Jerry Sandusky not guilty. Podcast to find out more.",
    "timestamp" : "17:20-17:27"
  },
  {
    "speaker" : "Steve",
    "text" : "The witness is all over the place.",
    "timestamp" : "17:28-17:29"
  },
  {
    "timestamp" : "17:30-17:42",
    "speaker" : "Andy",
    "text" : "You don't like your job, right, Greg? Uh speaking of no, I I can't even I I can't tie that in. We're just gonna talk about the running backs Um Boris."
  },
  {
    "timestamp" : "17:44-17:49",
    "text" : "I was going to speak of kitty touchers or something, but LG Crumpler.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "17:50-17:52",
    "text" : "That's actually not bad, see. Alright, we'll go tie that.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, that is pretty good.",
    "speaker" : "Steve",
    "timestamp" : "17:53-17:55"
  },
  {
    "text" : "Oh, yeah. Algie Cum Algie Crumpler, who yeah, Cumpler apparently.",
    "timestamp" : "17:55-17:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Rookie ear. I feel like he's ancient. Yeah. He played with the pats eventually, didn't he? Yes.",
    "timestamp" : "17:59-18:06"
  },
  {
    "speaker" : "Andy",
    "text" : "He did, yeah.",
    "timestamp" : "18:07-18:07"
  },
  {
    "timestamp" : "18:07-18:12",
    "speaker" : "Mike Melo",
    "text" : "Uh like That's four or five years, I think."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:12-18:15",
    "text" : "Twenty ten. Relatively recent years ago."
  },
  {
    "timestamp" : "18:15-18:16",
    "speaker" : "Mike Melo",
    "text" : "Ten years ago."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:16-18:20",
    "text" : "Yeah, fuck. It's middle of the dynasty. We'll get to the case."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "He was pretty much done.",
    "timestamp" : "18:23-18:24"
  },
  {
    "text" : "That was his last season.",
    "timestamp" : "18:24-18:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And this was his rookie season, which means Brady was already a year older than him.",
    "timestamp" : "18:25-18:29"
  },
  {
    "text" : "Fuck.",
    "timestamp" : "18:30-18:30",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:31-18:33",
    "speaker" : "Mike Melo",
    "text" : "That was what struck me. I was like, Well let's see."
  },
  {
    "text" : "Um LG Crumpler. You know. Algie Crumpler's forty two. But his birthday today. He was born December twenty-third, nineteen seventy seven. Happy birthday, Algie. This is going out to Algie Crumpler. We're gonna dedicate this to him. I'm sure he'll love it. Same guy. I met him once.",
    "timestamp" : "18:33-18:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I got it. No. Stupid. I thought somebody should have a story there.",
    "timestamp" : "18:52-18:56"
  },
  {
    "timestamp" : "18:56-18:58",
    "speaker" : "Andy",
    "text" : "No, that was just that was just a fun guy joke."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well he's the only guy run out of the Falcons team from 2001 if that makes me feel um they were talking about his like forty speed though.",
    "timestamp" : "18:58-19:04"
  },
  {
    "text" : "And I I don't know if i it to me it sounded like they were like Man, he's athletic, he's huge, he's he ran a 492. What the hell? I'm looking at it and it's like like this year's class, like 2019, like Noah Fant ran like a Four, five. I was gonna ask four, six, five.",
    "timestamp" : "19:04-19:22",
    "speaker" : "Steve"
  },
  {
    "text" : "So we didn't talk about and he's not known for being fast. That's a different era. Well yeah, that that was fast in the tight ending.",
    "speaker" : "Andy",
    "timestamp" : "19:22-19:29"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah. And I don't want to spoil the fourth quarter, but when like Mike Vick was in there and he just looked like today's speed versus all of you know people super slow like gigantic Wearing those huge shoulder pads and just lumbering around and Mike Vick was just a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little",
    "timestamp" : "19:30-19:43"
  },
  {
    "text" : "Oh it was like a video game though, because you're right. He is like comparable to today. But no one else was caught up to him.",
    "timestamp" : "19:43-19:50",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "19:50-19:55",
    "speaker" : "Andy",
    "text" : "This is like Oh When you bought Madden this year and you weren't allowed to play as the Falcons 'cause it was cheating. Yeah."
  },
  {
    "timestamp" : "19:55-20:00",
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. But it was fair because it was actually like that. Yeah."
  },
  {
    "text" : "Oh yeah, no, it was perfectly accurate.",
    "speaker" : "Andy",
    "timestamp" : "20:01-20:02"
  },
  {
    "text" : "It was just unfair to play it.",
    "timestamp" : "20:03-20:04",
    "speaker" : "Steve"
  },
  {
    "text" : "Same idea. Oh yeah, 100%. Not as fast, but he's so quick though.",
    "timestamp" : "20:06-20:11",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "20:11-20:22",
    "speaker" : "Greg",
    "text" : "Yeah, he's shifty, yep. Yeah. I think he's quicker than Vic, but not straight line fast. Yeah, I would agree. Because that was Vic is like you get him on a straight line and he's just like"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:25-20:41",
    "text" : "I thought with the ease that he does it is like watching um Randy Moss just outrun like Randy Moss throwing up his hand when he's like ten yards in front of the the defensive back knowing he's gonna beat him. But he doesn't look like he's trying. He doesn't jogging past the guy and the guy's jogging whole effort into it."
  },
  {
    "text" : "I mean it was fun watching him too, because it part of the like You know, dog stuff aside. But just for your bases. I mean he had great vision too. He'd be duke and running all over the place, but always ended with like him breaking the leg or something. So it would have been fun to kinda see where that w w would have gone. But I mean, Mahomes is kind of in that territory, so",
    "timestamp" : "20:42-21:09",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, that's what I've been I've been saying this about all the all those mobile quarterbacks like since RG three and that knee injury that he had.",
    "speaker" : "Andy",
    "timestamp" : "21:12-21:20"
  },
  {
    "text" : "running decoys everywhere.",
    "speaker" : "Steve",
    "timestamp" : "21:29-21:31"
  },
  {
    "text" : "So I mean it it might not work the second year, but I still feel like I mean every game that you watch Yeah, if you if you look at it, you s there's at least one hit a game, you're like, oh shit, I'm glad my quarterback's not taking that hit. He's taking that quarterbacks are taking that hit though.",
    "speaker" : "Andy",
    "timestamp" : "21:31-21:47"
  },
  {
    "timestamp" : "21:47-21:48",
    "text" : "Just sitting in the park.",
    "speaker" : "Greg"
  },
  {
    "text" : "You know it's not the same, I don't think though.",
    "timestamp" : "21:48-21:51",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:51-21:58",
    "text" : "Mike Vick took some hits in this game. Oh yeah, I mean I I guess we'll touch on that. Actually all of all the Falcons quite.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, all right, so let's get moving on the roster. The same guy from The Simpsons.",
    "speaker" : "Greg",
    "timestamp" : "21:59-22:07"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "You may remember me from such films, as what's that guy's name? Like Hank Azaria or something like that.",
    "timestamp" : "22:09-22:13"
  },
  {
    "speaker" : "Greg",
    "text" : "No, that's the guy the actor that does the voice. Isn't it like Randy McClure?",
    "timestamp" : "22:14-22:18"
  },
  {
    "timestamp" : "22:18-22:21",
    "text" : "It's something McClure. Troy McClure, yes, yes, yes, yes.",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh no, I forgot. I thought you th I thought that was his real name and he went from the Falcons to the Simpsons.",
    "speaker" : "Mike Melo",
    "timestamp" : "22:22-22:28"
  },
  {
    "speaker" : "Andy",
    "text" : "That's a hot take, I think. I'm not sure.",
    "timestamp" : "22:30-22:32"
  },
  {
    "text" : "What's older, The Simpsons or Tom Brady's dynasty?",
    "timestamp" : "22:34-22:37",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "The Simpsons have been around for like 40 years.",
    "timestamp" : "22:37-22:38"
  },
  {
    "speaker" : "Mom",
    "timestamp" : "22:39-22:41",
    "text" : "Yeah, they're just in season thirty."
  },
  {
    "text" : "Um Jay Feely guys. The old Dolphins kicker.",
    "timestamp" : "22:41-22:44",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "22:44-22:45",
    "speaker" : "Andy",
    "text" : "I did have him on the list."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "22:45-22:48",
    "text" : "Remember him. Three three players."
  },
  {
    "timestamp" : "22:49-22:53",
    "text" : "Something. Sure. I did I did no research.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "22:53-22:56",
    "text" : "Wasn't he uh uh eventually an Eagles race?"
  },
  {
    "text" : "Oh he maybe I did I I'm not gonna lie, I did no research on J. Feely",
    "timestamp" : "22:56-23:01",
    "speaker" : "Andy"
  },
  {
    "text" : "Well okay. Chris Moore ended up being an actor slash comedian after. Yeah. Fantastic. Oh, it's Jay Moore.",
    "timestamp" : "23:01-23:11",
    "speaker" : "Greg"
  },
  {
    "text" : "Alright, before we get to the game though, I want to talk about um the week leading up to this, because I think this was when the Terry Glenn shit came to a head. Yeah. Because literally every every uh Boston Globe sports section this week leading up to the game was all about basically Terry Glenn. Uh he was fined for not practicing. On I think the day after the the previous week's game.",
    "timestamp" : "23:18-23:45",
    "speaker" : "Andy"
  },
  {
    "text" : "Well it was kinda like uh LeBron last year in the finals. Maybe maybe the year before, but when he's like he loses the game and he comes to the thing with a uh cast on his wrist and this video of him doing push-ups in the locker room before the game, it's like dude for real?",
    "speaker" : "Greg",
    "timestamp" : "23:45-24:02"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:02-24:30",
    "text" : "Yeah, it feels that way. Um, but there's actually uh an article on the Wednesday about um Sean Jefferson talking about Terry Glenn. And Sean was saying he loves Terry Glenn like a brother, and he tried to mentor him when they played together. So he said, uh Jefferson wanted to show his support, he said. And that meant telling Glenn, get your butt to camp. There are guys depending on you, screw what the media or what Bill Belichick think. Get back out there for your teammates."
  },
  {
    "timestamp" : "24:30-24:31",
    "speaker" : "Steve",
    "text" : "That's fair."
  },
  {
    "timestamp" : "24:32-24:32",
    "speaker" : "Andy",
    "text" : "It is."
  },
  {
    "text" : "It's not a money thing, it's not a Belichick thing, it's how Belichick handled things. So I don't know what Wayne he's a little bit of a miser. So he is.",
    "timestamp" : "24:33-24:47",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "24:48-25:06",
    "text" : "Yeah. Oh yeah. I mean he probably sucks And if you don't this is two thousand and one, so if you don't have the clout of of one all these championships and you're a one shit, like you get fired including What what makes you think you can do that? Like you didn't have the respect at this point, you know?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, and I oh by the time this air This it might not be a big deal, but Antonio That guy, he's now getting it involved from like celebrity. I'm gonna say, step away from social media, take a break, man, clear your butt uh But he isn't. Hopefully it doesn't end the way that Terry Grant that he uh his album man uh no w no more white women 2020. He's making all the right decisions.",
    "timestamp" : "25:07-25:35"
  },
  {
    "timestamp" : "25:36-25:38",
    "text" : "I'm doing the same. No more white women.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh boy. Does she know about this?",
    "timestamp" : "25:40-25:41"
  },
  {
    "timestamp" : "25:47-25:51",
    "speaker" : "Mike Melo",
    "text" : "So did Terry Glenn ever play another snap after this?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:51-25:53",
    "text" : "Oh yeah. Yeah he played the Cows. Played for the Cowboys for a bunch of years."
  },
  {
    "text" : "Oh shit. With Bloodsoe.",
    "timestamp" : "25:54-25:57",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Bloodsow. And Parcells. Alright, yeah, so Terry Glad being a little bitch. Um William Guinness is healthy again. Uh I think the only reason I put that in there is because just to mention the fact that he wore a t-shirt that said silent but violent. Yeah, that one we're gonna make down. Are you kidding? We're gonna sell those fuckers on this on Patriots Dynasty website? Oh hell yeah",
    "speaker" : "Andy",
    "timestamp" : "25:57-26:22"
  },
  {
    "text" : "Well we should make it hashtag silent to violent, you know?",
    "timestamp" : "26:22-26:24",
    "speaker" : "Greg"
  },
  {
    "text" : "I mean silent the violent back in two thousand one for me was talking about farts. Yeah, definitely.",
    "speaker" : "Andy",
    "timestamp" : "26:25-26:29"
  },
  {
    "timestamp" : "26:29-26:32",
    "speaker" : "Greg",
    "text" : "No. Oh what, because you were like fifteen years old? W Yeah."
  },
  {
    "timestamp" : "26:32-26:45",
    "speaker" : "Andy",
    "text" : "Well silent but deadly. Well I was old now, but yeah, thanks for being generous. Very charitable, very Christmasy up. Silent but violent, why not? That's that's some assassin shit."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Even though he does it for a living now, hell Yeah, ironically now he's doing postgame.",
    "timestamp" : "26:49-26:53"
  },
  {
    "text" : "Yeah, right. Yeah, he's he's decent. Steve Smith is a lot of things. Man, he's no but he is like He's off the cuff, man. Like he doesn't care. Yeah. He said they were talking about uh I don't know someone not throwing open receivers and he's like you gotta throw the ball when he's Butthole naked.",
    "timestamp" : "26:53-27:13",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, I saw that.",
    "timestamp" : "27:13-27:14"
  },
  {
    "timestamp" : "27:14-27:21",
    "speaker" : "Greg",
    "text" : "It didn't even make sense. I think he tries to- Oh, thank you. Does it even make sense? Butthole naked? No, butt naked."
  },
  {
    "text" : "I don't understand what he meant. I just like that he said it. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "27:22-27:26"
  },
  {
    "speaker" : "Andy",
    "text" : "No, I get it.",
    "timestamp" : "27:26-27:27"
  },
  {
    "speaker" : "Steve",
    "text" : "I get it.",
    "timestamp" : "27:27-27:27"
  },
  {
    "speaker" : "Andy",
    "text" : "You you're you're so naked that you can bend over and spread your cheeks and people see a butthole.",
    "timestamp" : "27:27-27:31"
  },
  {
    "timestamp" : "27:31-27:33",
    "text" : "But why did he say that",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "27:36-27:43",
    "speaker" : "Mike Melo",
    "text" : "You gotta throw him the the ball when he's so naked that he can bend over and spread his butt cheeks and you can see his brown eye. Come on!"
  },
  {
    "speaker" : "Andy",
    "text" : "So think about this. No, here you go, think about this. When w how how Away from other people do you have to be to be that comfortable to be naked enough to bend over and spread your cheese. You could you fucking kitty toucher, but I don't know if I could.",
    "timestamp" : "27:45-28:04"
  },
  {
    "speaker" : "Steve",
    "text" : "Hey, maybe that's what he meant. Can we call him up?",
    "timestamp" : "28:04-28:07"
  },
  {
    "text" : "I think Michael Jackson is that right.",
    "timestamp" : "28:07-28:09",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "28:10-28:13",
    "speaker" : "Greg",
    "text" : "Remember he used to kiss buttholes? Speaking of buttholes."
  },
  {
    "timestamp" : "28:15-28:27",
    "speaker" : "Steve",
    "text" : "No, he was! Sully the man's name. Yeah, I don't think it was like touching but all the time. Yes it was, dude It's in the documentary."
  },
  {
    "text" : "Is this another hot take, Mike?",
    "speaker" : "Mike Melo",
    "timestamp" : "28:28-28:30"
  },
  {
    "text" : "I don't know.",
    "timestamp" : "28:30-28:30",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Did you read an article that said Michael Jackson didn't do it?",
    "timestamp" : "28:31-28:33"
  },
  {
    "speaker" : "Steve",
    "text" : "I can't confirm word tonight. Look. I just know I don't think he's digging. No, he wasn't.",
    "timestamp" : "28:34-28:37"
  },
  {
    "timestamp" : "28:38-28:45",
    "text" : "There was two separate children that had the same story of him. He would pull their butt cheeks of cart and kiss them on the butt.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "28:46-28:55",
    "speaker" : "Mike Melo",
    "text" : "I'm going on record. You cannot call me the kid dealer when both of these guys, Greg defended Jerry Sandusky. And Mike's over here loving Michael Jackson."
  },
  {
    "speaker" : "Steve",
    "text" : "I think I don't think he was kissing buttholes.",
    "timestamp" : "28:56-28:58"
  },
  {
    "text" : "Bill Cosby is guilty.",
    "timestamp" : "28:59-29:01",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, he's a piece of shit. Um but yeah, Michael Jackson, I'm not I'm not a big fan of that man. Um and I think he did it. I just don't think he was kissing buttholes. But maybe he was. I didn't watch the documentary. That could be",
    "speaker" : "Steve",
    "timestamp" : "29:03-29:13"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "29:16-29:22",
    "text" : "That guy Google Google Michael Jackson butthole kissing."
  },
  {
    "text" : "Just make sure you're in incognito mode. Google that shit?",
    "speaker" : "Greg",
    "timestamp" : "29:23-29:26"
  },
  {
    "timestamp" : "29:27-29:28",
    "speaker" : "Andy",
    "text" : "Hundred percent not Google that on our computer."
  },
  {
    "timestamp" : "29:29-29:30",
    "speaker" : "Steve",
    "text" : "Incognito VPNs."
  },
  {
    "text" : "Yeah, that's that's rough.",
    "timestamp" : "29:31-29:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:33-29:44",
    "text" : "Regardless, Michael Jackson. Piece of shit? Yes. Okay. Yes. Okay. I checked. It was after the first one."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:45-30:01",
    "text" : "He's trying to rehab his energy. Try to segue here, you motherfuckers. Speaking of buttholes, Dan Neal, the offensive lineman for the uh Denver Broncos the week before, who broke Brian Cox's leg. He's a butthole."
  },
  {
    "timestamp" : "30:01-30:04",
    "speaker" : "Steve",
    "text" : "Did you hear what uh good segue, Andy?"
  },
  {
    "speaker" : "Andy",
    "text" : "Pretty good segue, you like that? Um yeah, but he was finding uh for his block on Brian his illegal block on Brian Cox that these commentators in this game actually I don't I The game our our feeds started a little late, so it you didn't actually get to catch the first abs first few drives. So I don't know who they were I thought they're fucking terrible. Their commentations are not going to be a little bit more than a little bit. I like them.",
    "timestamp" : "30:05-30:34"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I like the commentators.",
    "timestamp" : "30:35-30:36"
  },
  {
    "timestamp" : "30:36-30:39",
    "speaker" : "Andy",
    "text" : "They were well they were defending the chop block."
  },
  {
    "text" : "That was maybe one. But they're also calling out Terry Glenn for being a biggity biggity bitch. They're like they're like I don't care good Terry Glenn. They were they're told me all the Sean Jefferson lines say get the fuck out there your teammates.",
    "timestamp" : "30:40-30:53",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but they were defending the chop block, which is like the most illegal thing dude on offensive linemen can possibly do.",
    "timestamp" : "30:53-30:59"
  },
  {
    "timestamp" : "31:01-31:05",
    "speaker" : "Greg",
    "text" : "Andy, think about this. If one of the Patriots players did it, you would defend them"
  },
  {
    "speaker" : "Andy",
    "text" : "Not if it was a chop block, no. Andy, you'd be like, dude, it wasn't homework.",
    "timestamp" : "31:05-31:10"
  },
  {
    "text" : "Right? That's not what the chop block was. I'm just saying, Andy. You spin zone everything. You do.",
    "speaker" : "Greg",
    "timestamp" : "31:13-31:20"
  },
  {
    "speaker" : "Andy",
    "text" : "I'll spend all a lot of things. Well, I'm sorry I'm a fan, go fuck me, right? Hey, there's a lot of things. Do you know what fan is short for? Fucking fanatic. I'm sorry that I'm fanatically fanatically inclined.",
    "timestamp" : "31:21-31:33"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "31:34-31:46",
    "text" : "Uh they also had a good point where Troy Brown should have let a punt bounce into the end zone and fair caught it on like the three-yard line. And they're like, why are you fair catching that? And I was like. They're right. They were right. I agree."
  },
  {
    "timestamp" : "31:47-32:17",
    "speaker" : "Andy",
    "text" : "No, that that was after the chop blocks, everything they said was wrong to me. So I will not agree with that. So well no I I have apologizes in quotes. Uh, 'cause he said, I need to apologize because in my frustration I told him I was gonna blow out his knee. I don't want to see anybody injured in that capacity. They have children and other people they'll talk they're taking care of."
  },
  {
    "text" : "Dude, they compared Terry Glam to a 12-year-old and said he was worse than Ryan Lee. Come on, that's awesome. Brian Cards probably deserved it.",
    "timestamp" : "32:17-32:29",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "32:28-32:34",
    "text" : "I'm trying to get to the I'm trying to get the mile out of here because I wanna Yo isn't Brian Cox a dirty player?",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. He wasn't not dirty. Not like not as bad as Romanowski, but like similar. He was very fiery. I mean he was he was good for us, but you hate him when he was on the jets for sure.",
    "timestamp" : "32:34-32:45",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "32:47-32:48",
    "text" : "So was was Rodney Harrison dirty?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "32:48-32:49",
    "text" : "Yes.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "32:49-33:02",
    "text" : "Okay then. Then yes, Ryan Harrison. He was as dirty as Rodney Harrison, I think. But the comment that he was apologizing for, which we didn't actually touch on last week, because you were too busy shitting on me, was wait, were we Oh 100%."
  },
  {
    "timestamp" : "33:06-33:10",
    "speaker" : "Steve",
    "text" : "I was saying I think we needed a rapport episode, and that's just what happened."
  },
  {
    "text" : "At my expense. I love it. But yeah, so we did actually touch on Brian Cox's comment after the game was, to be honest, I don't care if it takes the rest of my career. If I ever play that guy again, he's gonna have a blown-out knee, and I don't care who knows it. Because he just does that sort of expletive all the time, Cox said, his voice a low growl. He cuts me like that and then has the expletive audacity to ask me if I'm right. If I ask me if I'm alright. No, I'm not expletive alright. Fucking alright. I'm not gonna put words in his mouth. I like that. That's what the Boston Globe reported.",
    "speaker" : "Andy",
    "timestamp" : "33:12-33:46"
  },
  {
    "text" : "He's still dirty, but I like that. I like that statement.",
    "speaker" : "Steve",
    "timestamp" : "33:46-33:48"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so he kinda walked it back, but not really.",
    "timestamp" : "33:50-33:52"
  },
  {
    "speaker" : "Steve",
    "text" : "But then we lost him for the year, right?",
    "timestamp" : "33:52-33:54"
  },
  {
    "timestamp" : "33:55-33:58",
    "text" : "Broken leg, I don't remember. Yeah. I don't remember him playing again.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:58-34:03",
    "speaker" : "Mike Melo",
    "text" : "You know who I don't remember playing this year? Who I keep seeing all the time is Matt Stevens, a safety."
  },
  {
    "timestamp" : "34:03-34:05",
    "speaker" : "Greg",
    "text" : "Oh yeah. Yeah."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I don't remember him at all.",
    "timestamp" : "34:05-34:06"
  },
  {
    "speaker" : "Greg",
    "text" : "Well I do because he was white.",
    "timestamp" : "34:07-34:08"
  },
  {
    "text" : "Like no white guys on the defense and then all of a sudden I keep the we're we're eight weeks in, it keeps popping up and I'm like And I was like, we're eight weeks in, I was like, who I don't remember this guy at all.",
    "speaker" : "Mike Melo",
    "timestamp" : "34:11-34:21"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "34:21-34:23",
    "text" : "Yeah, I don't remember him at all either."
  },
  {
    "timestamp" : "34:23-34:32",
    "text" : "He was like one of our best safety for a while. I haven't seen him make-like Super Bowl 1v? Yes, Mike. Yes he was.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "text" : "Mike is intentionally disrailing our conversation. Is he the Hall of Fame?",
    "timestamp" : "34:36-34:41"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "34:44-34:54",
    "text" : "I mean we have done two minutes on Matt Stevens. No, he's the guy that drove over that uh last week. Remember like he siever went down to get He jumped on the guy."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh no, he hasn't been good. So don't be surprised he's just bench.",
    "timestamp" : "34:54-34:57"
  },
  {
    "text" : "Yeah, so my guess is he's not hurt. He's he got Lee Johnson to be my guess.",
    "timestamp" : "34:57-35:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:01-35:06",
    "speaker" : "Mike Melo",
    "text" : "Well he's a third safety, so he kee he comes on in those like sub packages. Yeah, I think so."
  },
  {
    "speaker" : "Andy",
    "text" : "Who's your second safety?",
    "timestamp" : "35:06-35:07"
  },
  {
    "timestamp" : "35:11-35:11",
    "speaker" : "Mike Melo",
    "text" : "Who's your second safety?"
  },
  {
    "timestamp" : "35:12-35:16",
    "speaker" : "Greg",
    "text" : "It says lawyer Malloy and Tabucky Jones playing safety. They were starting to be able to do that."
  },
  {
    "speaker" : "Andy",
    "text" : "So he was you nickel safety? Nickel safety. How does that work? Week one he was the he was well when they when they I think he was starting earlier, but I think he was. This is where he starts getting phased out.",
    "timestamp" : "35:18-35:29"
  },
  {
    "text" : "Yeah, he's just listed as defensive back, so maybe he played a little bit of both.",
    "timestamp" : "35:30-35:35",
    "speaker" : "Greg"
  },
  {
    "text" : "Well that's generous, but okay. Should probably talk about this game, huh?",
    "timestamp" : "35:35-35:40",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I was trying, but you guys like turned on me over there.",
    "timestamp" : "35:40-35:43"
  },
  {
    "text" : "Alright, talk to me. What what jumped out of you about this game?",
    "timestamp" : "35:43-35:47",
    "speaker" : "Andy"
  },
  {
    "text" : "Things first, um you know um I will say that it was a poor start for the Falcons. That stuck that stuck out of me. Um I have here the the first three Falcon drives netted, I think it was negative seven yards.",
    "speaker" : "Steve",
    "timestamp" : "35:48-36:04"
  },
  {
    "text" : "Yeah, I had negative six, but in the ballpark.",
    "timestamp" : "36:04-36:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:07-36:12",
    "speaker" : "Steve",
    "text" : "Yeah, so that's pretty crazy and like the defense was like falls out, like pass D the whole game."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh god. The commentators were touching on it too, how they had instead of sitting back in in like zone coverage and stuff like that, they were actually playing a lot more men, blitzing a lot more from spots that the Falcons weren't expecting it. Uh the commentators actually showed the uh defense rolling from like a cover two to a cover one late, which you kind of see a lot more recently now with with this twenty nineteen defense where they they're hiding something or even Last year's Super Bowl they had kind of almost two calls where you see the one look and you shift late to that second look. Um so they're doing a lot of like cover two to cover one on run plays, so you have that extra guy in the box. And the Falcons just had no fucking thing.",
    "timestamp" : "36:13-36:52"
  },
  {
    "text" : "Ooh, that's true. But what a tactic. I mean, I wish the Pats would have thought of that. Maybe they did. But uh Chris Chandler The call they played in the zone. Um Chris Chandler at the at the end of the game too was like saying that they were flipping between 3-4 and 4-3, which I think that was the start of that too. Um, where he he was basically like, you know, does this and and they own that all year. Yeah. Uh so it's interesting. I mean I point to like bring all that up mid season when you're like sort of hey we we could do this, you got a game plan forever.",
    "timestamp" : "36:56-37:28",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it felt like it was I mean nowadays it it seems more pronounced, but the those first four or six weeks of the season are almost like an extended preseason for the Patriots where they're still kind of getting everybody on the same page. Um and then once you start getting in the middle of the season, they they actually start doing some more interesting things like that because everybody's on the same page and there's so much communication that goes on, especially with the offense as well, I think, nowadays with the way Brady runs things, but the defense especially, that they're all kind of they all have to be on the same page. They all have to know what the looks are and they I think they're um The responsibilities shift a lot, like even during the play.",
    "timestamp" : "37:29-38:12"
  },
  {
    "text" : "I remember um Gilmore, we thought he was a boss",
    "timestamp" : "38:12-38:16",
    "speaker" : "Greg"
  },
  {
    "text" : "21st assignments, but even a couple of weeks ago I remember seeing um some replay of I don't even remember what kind of play it was. I think it was against the the Cowboys where the Cowboys sent a guy in motion and they were trying to do something like moving everything to one side. But because of the like as the motion was happening, the the two linebackers were were literally like in real time switching off responsibilities because of the the I I'm assuming because the the offensive play had shifted to where the like that needed to happen, but they did it like instantaneously with no conversation happening, no like talking. They just knew that as soon as this guy moved over here the entire like defensive responsibilities for everybody to change. And so like everything just kind of shifted and Dak Prescott had like he thought he had something and completely didn't because Like every so I think there's a lot of that sort of stuff happening. I think once you get to like, you know, week eight against uh even what was supposed to be an explosive Falcons team. all of a sudden you see that all start to click a little bit because they've actually had all this time together to that's a good point though.",
    "timestamp" : "38:15-39:26",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "39:26-39:47",
    "speaker" : "Steve",
    "text" : "Like when you bring a guy in like Gilmore, because he had all offseason to like get acclimated and whatever, and it was a disaster. And obviously he's amazing now and doing his thing, but You think that 'cause the first Belichick year with the Pats was like all like rookies and new guys and like it was kind of this young mess. Then they brought in all these like older guys. So how do you think that like they got it to gel that quickly"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, I I think it's that's why they brought in the older guys is that you they know enough about like",
    "timestamp" : "39:50-39:55"
  },
  {
    "timestamp" : "39:55-39:58",
    "speaker" : "Mike Melo",
    "text" : "Because if you if you have the technique, yeah, they they got they know that they'd dummy."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "39:59-40:00",
    "text" : "Yeah, but Gilmore was like a vet at that time."
  },
  {
    "timestamp" : "40:00-40:29",
    "text" : "Yeah, but if you have those young guys, like they they're still learning, you know, the speed of the NFL and like just everything about the new system whereas the guys that have been the league 'cause I mean we talked about at the beginning of this this um this season where Uh they they didn't just bring in vets, they brought in guys who'd been in the league for like 12-15 years. So they knew like the ins and outs of like football on Sundays. So it was a matter of just like making sure they're all on the same page, I think, more than anything.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "40:29-40:42",
    "text" : "So you think Gilmore's problem was just that maybe he hadn't been exposed to something like that and everybody else on on the team did? 'Cause he had played five years.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "40:43-40:48",
    "speaker" : "Greg",
    "text" : "Yeah, I mean probably they probably just stuck them in man in Buffalo and we're like, Hey, just do what it is. Yeah, cover this guy."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:50-40:57",
    "text" : "The man's man, but but if this guy does this, you have to you have to recognize this and then responsible to switch off and that sort of stuff."
  },
  {
    "timestamp" : "40:59-41:02",
    "speaker" : "Steve",
    "text" : "That's fair. That's true. He's still being a probable, but"
  },
  {
    "text" : "Yeah. He was just that good, which we're seeing now.",
    "speaker" : "Andy",
    "timestamp" : "41:02-41:05"
  },
  {
    "text" : "Right. And I I I also to cap this, but like the whole Malcolm Butler thing, and we were like, hey, which guy like why don't they give him the contract? Why are they bringing this guy in? Well, I guess that is explained.",
    "timestamp" : "41:05-41:17",
    "speaker" : "Steve"
  },
  {
    "text" : "Well, I don't know. I mean, can you I mean not not uh Gilmore versus Butler, but I gotta think that Butler would have been better staying here than he really.",
    "speaker" : "Greg",
    "timestamp" : "41:18-41:29"
  },
  {
    "text" : "I mean he started off rough season. He played better in the middle.",
    "timestamp" : "41:33-41:36",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Well, he had he had a rough first half of the season when he first went there, but then second half of the season was actually one of the better cornerbacks in the league.",
    "speaker" : "Andy",
    "timestamp" : "41:36-41:45"
  },
  {
    "text" : "Right. I'm a butler stand up. I love a butler.",
    "timestamp" : "41:45-41:48",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "41:50-41:58",
    "text" : "I still can't wait to find out what happened in the Super Bowl because that's such bullshit. I mean not to talk about that, but Yeah, I mean we're that's always gonna haunt us.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Hey we'll we'll we will get there in in twenty years of episodes. We'll we'll eventually get to that. Yeah.",
    "timestamp" : "41:58-42:10"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "42:12-42:21",
    "text" : "Dude, yeah. Oh, we'll get there too. Jets, man. He had some great years there. Ten picks in one year, I think. So freaking Belichick. That sucks."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Moves on too early before too late though.",
    "timestamp" : "42:21-42:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:25-42:45",
    "text" : "Well isn't the most recent uh I actually saw it today, the most recent uh argument for Bellowchek the um the drafter or whatever whatever you call team builder um screwing Belichick the coach was letting uh Chandler walk"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah.",
    "timestamp" : "42:46-42:46"
  },
  {
    "timestamp" : "42:46-42:52",
    "text" : "Because he's four three or four sacks away from s the the record this year.",
    "speaker" : "Andy"
  },
  {
    "text" : "Right. Yeah, man. Like that whole thing worked perfectly though because it sort of like needed to happen for the team to build around like what they had. And if you think about it, like the the Malcolm Butler year that like he didn't play, like we yeah, they lost that one. But then like we kind of made up for it and more I think. So it's like it is what it is, right? Like as Belichick would say, but um yeah, Handler's doing fine, but he was also on like synthetic weed, like naked running in like a cop slug station.",
    "speaker" : "Steve",
    "timestamp" : "42:52-43:20"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That was awesome. I forgot about that.",
    "timestamp" : "43:20-43:22"
  },
  {
    "text" : "Yeah, it's a crazy thing.",
    "timestamp" : "43:22-43:23",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "43:24-43:29",
    "text" : "And the only reason I'm not saying about Trey Flowers is Trey Flowers hasn't had a big year this year. Otherwise I'd be saying the same thing.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "text" : "That synthetic weed does put you in a weird place though.",
    "timestamp" : "43:32-43:34"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:35-43:41",
    "text" : "Way weird, yeah. What the most I remember about this this game was that it was uh it was college year. See I'm saying too much."
  },
  {
    "speaker" : "Greg",
    "text" : "I've had nail no what else yeah.",
    "timestamp" : "43:41-43:44"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "43:45-43:45",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "43:45-43:47",
    "speaker" : "Greg",
    "text" : "So this guy's got his finger in my ass, right?"
  },
  {
    "speaker" : "Steve",
    "text" : "Watching the game. Okay. Or Jerry Sandusky, apparently those guys. I remember this game the night before it it was the first time that I ever like really drank. And I was hanging out with some some older people. At the time I think I was, I don't know, young young in in college, whatever. Yeah. And so um we had played uh like some card games or so I don't know what it was, maybe it was an asshole. I have no idea. They basically like destroyed me. They thought it was hilarious, I didn't think it was so funny. And I remember I had like some assistants walking upstairs. I think I threw up all over the bed. It was a great initiation to drink. Yeah. But the next day was this game. And I remember like like laying down on this like chair, the game was going on in the background and like the announcers were making me nauseous. It was like a wild nearby that every smell was coming in there, I was throwing up like with every like Patriots play I mean, uh I remember that. So I don't know if you don't know if you guys have memories like that, but this one is very vivid in my mind.",
    "timestamp" : "43:48-44:51"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:52-44:55",
    "text" : "We've talked about my memories of Penn State. Or lack thereof."
  },
  {
    "text" : "Well, yeah, you talked about taking off a shirt. I mean, you you already like admitted to not being a part of that whole thing. It's not much story.",
    "timestamp" : "44:55-45:05",
    "speaker" : "Steve"
  },
  {
    "text" : "That was about it.",
    "timestamp" : "45:05-45:06",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "You didn't drink till college? I didn't, no.",
    "timestamp" : "45:06-45:08"
  },
  {
    "text" : "Me neither.",
    "timestamp" : "45:09-45:09",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:10-45:18",
    "text" : "Really? Man. Greg, what was your first like beer outside of mom and dad's purview? Uh Probably got sophomore in high school.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "45:19-45:38",
    "text" : "Well it wasn't so really yeah. First time I smoked weed and drank was the same night. Whoa, really? Jeez. For house sitting for something And ate a dog and I was so stoned and I couldn't get it to be looked at the one and I really got really got in my head. So you don't like dogs, mouth? Dog's a cop.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "45:40-45:48",
    "speaker" : "Mike Melo",
    "text" : "Fucking mark. Mine was with uh Andrew and Nick he like got a We're just outing a whole bunch of motherfuckers."
  },
  {
    "timestamp" : "45:48-45:49",
    "speaker" : "Andy",
    "text" : "I may have to cut this shit."
  },
  {
    "text" : "Six pack of Core's original. put underneath the wheelbarrow in his yard. As you do. Warm course banquet. Do you have any fun first first stories?",
    "timestamp" : "45:53-46:03",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "46:03-46:06",
    "speaker" : "Andy",
    "text" : "Uh First beer, I don't fucking know."
  },
  {
    "timestamp" : "46:07-46:24",
    "text" : "Yeah, because I mean like I remember the first time I blacked out and not realizing that like Oh. You always thought like, oh, I didn't remember anything last night. You're like, yeah, yeah, yeah, yeah, me either. And then I actually blacked out and I remember looking at texts that I had sent and being like Oh my god. I don't remember that at all.",
    "speaker" : "Greg"
  },
  {
    "text" : "Like blacking out is very- as he got older, that didn't get any better, so it pretty much uh I stay away from",
    "timestamp" : "46:24-46:30",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "From that nowadays, but uh So the next thing you know you're getting picked up on root one, right guy? Yeah, don't ever drink.",
    "timestamp" : "46:31-46:38"
  },
  {
    "text" : "Don't drink? Don't ever drink probably Yeah, that's a no-no. Make sure you ask before you do.",
    "timestamp" : "46:38-46:46",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "If you're in that situation, just talk yourself.",
    "timestamp" : "46:46-46:47"
  },
  {
    "timestamp" : "46:50-46:51",
    "speaker" : "Steve",
    "text" : "Or call Friendly."
  },
  {
    "timestamp" : "46:52-46:56",
    "text" : "Yeah, call your mom when you're taking a channel. When in doubt, call your mom.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "47:00-47:03",
    "text" : "Because it is. And don't play in the NFL while on PCP because that ends poorly."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:04-47:09",
    "text" : "Well, I mean he did pretty good. Speaking of Pro Bowl, is Tom Brady in this game? How'd you think he did?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:09-47:11",
    "text" : "Well I didn't watch it, so I'm not entirely sure."
  },
  {
    "timestamp" : "47:17-47:19",
    "speaker" : "Andy",
    "text" : "Brent did not watch his game"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "For the record they're in the end of the at the end of the first half the commentators are all a Brought Brady theory. Like he's the and I was lapping it up.",
    "timestamp" : "47:19-47:27"
  },
  {
    "timestamp" : "47:27-47:45",
    "text" : "He was precise. I mean he was, he's good. The thing that I I thought was crazy about this game and very unveloch like is like he Brady was actually lights out, but like there were a lot of great plays that were called back for penalties. It's it was happening all the time. Steve, they were on uh on that as well, where they're like, what the hell is going on?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "47:45-47:46",
    "text" : "They were pissed",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:47-47:49",
    "speaker" : "Steve",
    "text" : "A minute a minute has gone by, no penalties. Imagine that."
  },
  {
    "text" : "Oh no, I I have the quote. I wrote the quote down. Uh it was uh haven't seen a flag in a minute or two. And then the other guy's like, they're gonna need umbrellas down there. Love it. For all the flags.",
    "timestamp" : "47:49-48:02",
    "speaker" : "Andy"
  },
  {
    "text" : "And there's even like weird ones like a a fade pass to Kevin Falk in the end zone. That was a nice throw. Yeah, great throw, but like who called the thing. Kevin Falk running the fade route, yeah.",
    "timestamp" : "48:02-48:11",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "48:11-48:42",
    "speaker" : "Steve",
    "text" : "It's like great about that play, and that's like another Belichick thing that he was toying with. He so Brooking was like kind of like we can have it. And so they sent out like Kevin Fuck wide to like isolate him with like Brooking and the like the outside. And the the announcers were like again all over Belichick, like, oh my god, there's going on right now, whatever. And uh And uh it worked to per perfection, but it was like I guess that wasn't a thing to kind of isolate You know, linebacker with like running back. Yeah, yeah, yeah. So that's pretty cool."
  },
  {
    "timestamp" : "48:42-48:52",
    "speaker" : "Mike Melo",
    "text" : "I mean I don't I like the isolation, but like a fade route to Kevin Falk, that seemed weird to me. I don't think I've ever seen that again. I don't know if I've ever seen Tom Brady throw a fade to a running back."
  },
  {
    "text" : "He must have thrown one to James White.",
    "speaker" : "Andy",
    "timestamp" : "48:52-48:54"
  },
  {
    "timestamp" : "48:54-48:58",
    "speaker" : "Greg",
    "text" : "Was it a fade fade though, or was it kind of just like uh fade, like fade like hard."
  },
  {
    "timestamp" : "48:58-49:03",
    "speaker" : "Steve",
    "text" : "It was like right over the top of the guy's like Kevin Bogg is five foot eight."
  },
  {
    "timestamp" : "49:03-49:04",
    "text" : "He's he's great.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:06-49:19",
    "text" : "I don't know, but to their credit, he wasn't even looking. So Part of the the what I've enjoyed about this uh this season is that I have no recollection of why. So for me it's a little bit of a treat So just that's true."
  },
  {
    "timestamp" : "49:20-49:21",
    "text" : "I had no idea what to expect with this game.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Steve",
    "text" : "Exactly.",
    "timestamp" : "49:21-49:21"
  },
  {
    "text" : "I'm like, oh shit, I re a few people, Mike. We just went over this.",
    "timestamp" : "49:22-49:26",
    "speaker" : "Greg"
  },
  {
    "text" : "this week.",
    "speaker" : "Steve",
    "timestamp" : "49:33-49:33"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:34-49:53",
    "text" : "Yeah, I think going to Steve's point, um, it looked like and I think there was uh something in in the paper the day after about how like the offensive game plan was because the corners were so good for the Falcons that they were basically just gonna give them that and just throw to like backs and tight ends the whole game."
  },
  {
    "speaker" : "Steve",
    "text" : "Right.",
    "timestamp" : "49:53-49:53"
  },
  {
    "speaker" : "Andy",
    "text" : "And I think that was part like the Kevin Falk touchdown was part of",
    "timestamp" : "49:53-49:56"
  },
  {
    "text" : "Yeah, but you know what's funny is that like in commentators again were like pointing it out, Brady was like picking on Ray Bannon the whole game.",
    "timestamp" : "49:56-50:02",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "He really he was actually picking on Ray Bucannon.",
    "timestamp" : "50:02-50:04"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "50:05-50:17",
    "text" : "He was insane. Yeah. Dude, did you see like at the end of the game like Brady waited for him to like kind of just like congratulate him and tell him like you know obviously good job or whatever even though it wasn't."
  },
  {
    "timestamp" : "50:19-50:20",
    "speaker" : "Andy",
    "text" : "That's why I was telling him."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, yeah.",
    "timestamp" : "50:20-50:20"
  },
  {
    "timestamp" : "50:20-50:25",
    "speaker" : "Andy",
    "text" : "I gotta say like 2001 Brady confidence is my favorite thing about the season so far."
  },
  {
    "text" : "He was like abnormally confident",
    "speaker" : "Steve",
    "timestamp" : "50:25-50:27"
  },
  {
    "text" : "Two plays back to back. The first play was they tried a flea flicker and Brady got sacked, I think. Yeah, he did, which is which I don't think I've ever seen in my life a sack on a flea flicker.",
    "timestamp" : "50:29-50:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "No, maybe a pick or something like that, but not a sack",
    "timestamp" : "50:38-50:41"
  },
  {
    "timestamp" : "50:41-50:49",
    "speaker" : "Andy",
    "text" : "Or uh even an incomplete, but yeah, never I've never seen anybody get sacked. But then the next play he comes back and throws like a thirty yard dime to Patton. Like the next play."
  },
  {
    "timestamp" : "50:52-50:58",
    "text" : "Oh, I mean he'd do that that Uh Troy Brown Bomb in the second quarter, he just hung in there and just stood that's okay.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh my god, yeah.",
    "timestamp" : "50:58-50:59"
  },
  {
    "text" : "Launched it. That's when the real dick sucking for Tom Brady from the point about the announcers. They were loving Tom Brady. They thought he was the best.",
    "speaker" : "Mike Melo",
    "timestamp" : "50:59-51:08"
  },
  {
    "speaker" : "Steve",
    "text" : "During this portion of the game, Vinateri though, there was a stat where it said something like he'd never miss at this point in the dome up until that point I think it was like twenty-two for twenty-two, field goals twenty-one for twenty-one, extra points, something like that. He didn't miss it all. He kept it going. And I believe pretty much on Vinitaria's way.",
    "timestamp" : "51:09-51:26"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:27-51:35",
    "text" : "I believe you and me were at the game where he started missing The first game he missed uh a field goal indoors."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh really?",
    "timestamp" : "51:35-51:36"
  },
  {
    "speaker" : "Andy",
    "text" : "You were hung over again, so maybe No No I was not. Now you're going over We're at Ryan's stories and we watched It was against the Texans.",
    "timestamp" : "51:37-51:44"
  },
  {
    "speaker" : "Steve",
    "text" : "You weren't at the game.",
    "timestamp" : "51:45-51:46"
  },
  {
    "text" : "No, God.",
    "timestamp" : "51:46-51:46",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, okay. We watched the game together though.",
    "timestamp" : "51:47-51:48",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:49-51:50",
    "text" : "We watched a game together."
  },
  {
    "text" : "Are you sure you weren't black out drunk? I mean I don't remember stories parties. I don't know. It happens. I would stay up arguing about politics and you would be hammered, I if I remember correctly.",
    "timestamp" : "51:50-51:57",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "51:57-52:01",
    "text" : "I was pretending to argue politics. Just to get on your nerves.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "So you want to talk about that uh brown touchdown?",
    "timestamp" : "52:01-52:04"
  },
  {
    "speaker" : "Andy",
    "text" : "I think we probably should. If we're talking about Tom Brady, like this is so there was talk about what to call this play Michael Smith in the Boston Globe the next day. The OG right in front of me.",
    "timestamp" : "52:04-52:16"
  },
  {
    "speaker" : "Greg",
    "text" : "What do they end up with?",
    "timestamp" : "52:19-52:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Um the so the quote is the immaculate reception is already taken, so rather than violate any unwritten copyright laws. What should Patriots fans call yesterday's moment of divine intervention at the Georgia Dome, and here are the options? The clean catch? The spotless snatch.",
    "timestamp" : "52:20-52:36"
  },
  {
    "text" : "W My personal fave.",
    "timestamp" : "52:36-52:37",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Stainless snare or the pure puck. The pure puck puck?",
    "timestamp" : "52:37-52:41"
  },
  {
    "timestamp" : "52:41-53:00",
    "speaker" : "Steve",
    "text" : "Snatch was like a thing back then, right? Like Wait, but Snatch was like slang for some. Let me see if I can snatch. Right. So he knew that that like the spotless snatch spotless snatch, I feel like it fits this podcast. That was a suggestion by a"
  },
  {
    "timestamp" : "53:00-53:04",
    "text" : "It was a suggestion by a a Boston Globe writer.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Wow. All right. Let me see your clam. Um Spotless Nan, okay.",
    "timestamp" : "53:04-53:11"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "But he threw that into triple coverage. That should have been a pick. Ten times out of ten.",
    "timestamp" : "53:11-53:15"
  },
  {
    "timestamp" : "53:15-53:21",
    "speaker" : "Andy",
    "text" : "It droited off of someone's throw by Brady. Well dude, the uh the It was a confident throw by Brady."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Okay. It was a fine line. And I felt that Droit Brown actually struggled in this game pretty heavily. I didn't think so.",
    "timestamp" : "53:22-53:28"
  },
  {
    "timestamp" : "53:29-53:49",
    "speaker" : "Steve",
    "text" : "I mean I think he made a few heads-up plays. There were like five receptions, I think, for like ninety-nine yards and a touchdown. Something like that. I mean he did his thing. But on that play though, what was funny is like So Brady almost throws a pick, it bounces in Detroit Brown's hands, he he runs it in for what? 25 30 yards and a touchdown. 50 yards?"
  },
  {
    "text" : "No, that was like 50 yards.",
    "timestamp" : "53:49-53:50",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "There you go. Plus some buffer yards in the back there. So he ran it in. The commentators were going nuts. Yeah. And then they're pointing out, they're like, uh Blitzo was thinking, why doesn't that ever happen to me? Which I'm like, so many interceptions, you know, he never got one of those. But then they close up on him for you. And then they close up on Brady, it's like Look at his reaction, even he can't believe it.",
    "speaker" : "Steve",
    "timestamp" : "53:53-54:13"
  },
  {
    "timestamp" : "54:14-54:24",
    "speaker" : "Andy",
    "text" : "And it's like Brady basically like hands on his head, looking at Bletso as if like that's not apologizing with body language."
  },
  {
    "speaker" : "Steve",
    "text" : "I'm like, oh poor guy. Bledsoe class act man.",
    "timestamp" : "54:24-54:27"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:27-54:37",
    "text" : "Well Bledsoe's face on that. That was all that was gonna be my best actually. Yeah we didn't talk about it was Bledsoe's face. He's like you gotta be shitting me."
  },
  {
    "text" : "It was amazing. Throwing the those a bad throw into triple coverage. There's three guys there. It was like double coverage, and a safety coming over the top, the linebacker underneath the corner on the guy, and it's just like, what are you doing? Oh",
    "timestamp" : "54:37-54:49",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Steve",
    "text" : "I d I don't think I've ever seen anything like that again. But yeah, it poor Bledsoe, man. Like uh I think he was a class act. I mean, he was pretty much like a mentor throughout the season, right? Yeah. And no commenters talk a lot about that. So I mean I those good commentators. Brady has been open, I think, about like not open, but I mean people have talked about how he's not the most helpful guy.",
    "timestamp" : "54:50-55:13"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "55:13-55:21",
    "text" : "Well he I think yeah from what I've heard he doesn't like to give up Snaps in practice and stuff, yeah."
  },
  {
    "timestamp" : "55:21-55:24",
    "speaker" : "Mike Melo",
    "text" : "Because he saw what happened when he got the opportunity."
  },
  {
    "text" : "To be a really good athlete, I bet you gotta be kind of a prick. And maybe Bledsoe lacked that. He's actually like a flawless guy.",
    "timestamp" : "55:29-55:36",
    "speaker" : "Greg"
  },
  {
    "text" : "That's a fair point. Yeah. I mean uh and it he doesn't have to be like the hugest dick, but enough to like secure a spot. Right. Right. That's true.",
    "speaker" : "Steve",
    "timestamp" : "55:36-55:48"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:51-55:53",
    "text" : "Hot take. Brady's a dick."
  },
  {
    "speaker" : "Andy",
    "text" : "So anything else you guys want to talk about in this game?",
    "timestamp" : "55:57-55:59"
  },
  {
    "text" : "There's a lot, dude. Scott Chandler's face after that.",
    "timestamp" : "55:59-56:04",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Third quarter first drive sack because just his face, the way he looked, he's like, You can tell Steve does didn't recognize the guy because he called him Scott Chandler instead of Christian Chandler.",
    "timestamp" : "56:05-56:12"
  },
  {
    "speaker" : "Steve",
    "text" : "He did get destroyed.",
    "timestamp" : "56:12-56:13"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "56:13-56:16",
    "text" : "I mean I I even wrote down Scott Chandler."
  },
  {
    "speaker" : "Steve",
    "text" : "I I wrote down like Richard Seymour, like got a sack in there. You know.",
    "timestamp" : "56:18-56:22"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, Richard Simon sacked was a grown ass man. He just bodied that whoever that blocker was, just threw him out of the way like he was like Chris Chandler, he got sacked like six times.",
    "timestamp" : "56:22-56:32"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah. In like three quarters, like he got sacked so much he had to leave the game.",
    "timestamp" : "56:33-56:38"
  },
  {
    "text" : "Dude, yeah. So he he left the game walking sideways.",
    "timestamp" : "56:38-56:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And the visual, if anybody wants to look that up It is like there's not anything like exactly wrong with him, but no, but he's bent over side he can't stream. It's like it's like it's like it's kiddious.",
    "timestamp" : "56:42-56:52"
  },
  {
    "timestamp" : "56:53-57:01",
    "text" : "It's not good. I don't know what it was. There was no like reports on it or anything, so I don't I don't know what it was. At least not in the Boston papers, but it didn't look good.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "57:02-57:07",
    "text" : "I think Otis Smith laid out absolutely one after another in this game. I mean, um He did."
  },
  {
    "speaker" : "Andy",
    "text" : "Otis Smith uh He he came in so fast that the commentator actually yelled out, Watch it!",
    "timestamp" : "57:07-57:14"
  },
  {
    "speaker" : "Steve",
    "text" : "It's coming in on the blue. And Tabucky Jones had a few good ones.",
    "timestamp" : "57:14-57:18"
  },
  {
    "text" : "Scott Chandler did not look like he was having fun after that first drive sack and then Otis made sure of it.",
    "timestamp" : "57:21-57:28",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Especially when people were like, I think this is the third quarter and people were like yelling for Michael Vick.",
    "timestamp" : "57:31-57:35",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, they're chanting for Vic.",
    "timestamp" : "57:35-57:37"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I mean when Vic came in, that changed the game. Oh, it did. But before that, I'd wrote down because this is amazing, but like um Brady was running the two-minute drill and time's going off the clock, commentators are getting a little nervous.",
    "timestamp" : "57:37-57:50"
  },
  {
    "speaker" : "Mom",
    "text" : "He has it under control.",
    "timestamp" : "57:50-57:51"
  },
  {
    "speaker" : "Steve",
    "text" : "Um I wrote amazing time management because um he killed everything, bullet passed to like Mark Edwards, and then like there's about 15 seconds left on the clock to give them all. So that's when they were talking about They were talking about how like the Patriots were like nobody for a long time and then how they were coming up. A couple other teams that were no names are coming up and they're talking about the parody of the NFL I thought it was funny because they were right, but it sort of like wasn't right for like the next 20 years.",
    "timestamp" : "57:51-58:17"
  },
  {
    "timestamp" : "58:19-58:28",
    "speaker" : "Andy",
    "text" : "Exactly. Yeah, I also like that um my favorite part of the two-minute drill at the end of the half was Tom Brady doing the hard count at the beginning of the two-minute drill."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, that was good.",
    "timestamp" : "58:28-58:28"
  },
  {
    "timestamp" : "58:29-58:30",
    "speaker" : "Andy",
    "text" : "Like nobody does it anymore."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Again, the commentators are all over that. These are great commentators in this game.",
    "timestamp" : "58:30-58:34"
  },
  {
    "text" : "There were but but they did uh one glaring issue. Fe Feely misses a field goal, right?",
    "timestamp" : "58:35-58:40",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "58:40-58:40",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "They're like the announcer's like the field goal is uh wide left, the other announcer is like furious. He's like the kicker didn't miss wide left, the offense missed wide left. Yeah, if they were if they got fifty more yards, it wouldn't have been this. Yeah, no, they had a they had a dumb penalty though.",
    "timestamp" : "58:41-58:57"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "58:57-59:04",
    "text" : "They had like a dumb penalty. Like a false start or something like again in this pointless if you kick it five yards closer, it doesn't matter."
  },
  {
    "speaker" : "Steve",
    "text" : "But he was a little too furious, or I'm like, nah, I think it was the kicker's fault. What was",
    "timestamp" : "59:05-59:07"
  },
  {
    "text" : "Well to be fair, he missed from fifty-eight and fifty, so it's not like he was missing chip shots.",
    "timestamp" : "59:08-59:12",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh man, alright.",
    "timestamp" : "59:12-59:13",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "59:19-59:30",
    "text" : "Before we get to Vic's debut, I think that um last pass touchdown where they went up like twenty-four to ten or something like that. Where like when Vic came in, it was kind of out of hand already."
  },
  {
    "timestamp" : "59:30-59:31",
    "speaker" : "Andy",
    "text" : "Yeah, 24-7, yeah."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Was uh Tuan had a huge dry starter. Like they didn't do nothing in the whole second half. And then he had a like a fat run. I think he got a screen pass or something.",
    "timestamp" : "59:31-59:40"
  },
  {
    "speaker" : "Steve",
    "text" : "Cause he fumbled early too. He did, yeah. And uh Mark Edwards did too at some point.",
    "timestamp" : "59:41-59:45"
  },
  {
    "timestamp" : "59:45-59:51",
    "speaker" : "Mike Melo",
    "text" : "I think that was right before that crazy Troy Brown touchdown. Yeah, it wasn't that that started the drive."
  },
  {
    "timestamp" : "59:51-01:00:00",
    "speaker" : "Andy",
    "text" : "No, it was the same drive, right? He had like two or three big runs in that drive, and then it was the Troy Brown."
  },
  {
    "text" : "He had 8817 in the second half. Yeah, and like probably forty of those were in the in the in that one drive on like a run and a catch. And if he doesn't do those, then they don't have that thing, and then it's not twenty-four-seven when Vic comes in because Vic changed that game.",
    "timestamp" : "01:00:01-01:00:16",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:17-01:00:20",
    "text" : "It is funny though because Antoine Smith was like kind of campaigning, I guess."
  },
  {
    "text" : "What was that?",
    "timestamp" : "01:00:22-01:00:22",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "By managing a field goal in the fourth quarter.",
    "timestamp" : "01:00:23-01:00:25"
  },
  {
    "text" : "Well they got into the got red zone with Mike Vick back there and then ran it with a running back three times in a row.",
    "timestamp" : "01:00:25-01:00:31",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:00:31-01:00:41",
    "speaker" : "Andy",
    "text" : "So I have I I wrote down the stat that um Chris Chandler going into this game, he had more touchdowns and incompletions in the red zone this season. He had four touchdowns and two incompletions."
  },
  {
    "speaker" : "Steve",
    "text" : "That's great. You say Vic? But he was hurt.",
    "timestamp" : "01:00:42-01:00:45"
  },
  {
    "timestamp" : "01:00:46-01:00:50",
    "speaker" : "Andy",
    "text" : "Chandler. If he had finished the game, they if he had finished the game, this is gonna be a good one."
  },
  {
    "timestamp" : "01:00:50-01:01:04",
    "speaker" : "Mike Melo",
    "text" : "It comes in the fourth quarter. Maybe it comes in with that fourth quarter, hits that slant. Right, that quick slant that turns into like a six yard gain. Yeah. Where one of the DBs on the Patriots literally like dodged him. Dodge the guy instead of tapping guy."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah, it was Lawyer Malloy, I think.",
    "timestamp" : "01:01:04-01:01:06"
  },
  {
    "text" : "Yeah, it was he just d dove dove he's come across from like the boom tower hit and just like Yeah and I think he blocked one of the patch guys. Like oh step by turns his body.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:01:06-01:01:15"
  },
  {
    "text" : "Doesn't care what color their jersey is.",
    "speaker" : "Andy",
    "timestamp" : "01:01:16-01:01:18"
  },
  {
    "timestamp" : "01:01:18-01:01:38",
    "text" : "Hit anybody. He literally like goes out of his way to not hit anybody. Which is super frustrating. So they're inside the red zone, inside the 10, I think, and then they got a Mike Vic back there. And they just call three straight running plays of the running back. Like, I don't know. Yeah, but you didn't know what you had really, right? Uh you drafted the guy at number one overall, you know he's like.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:01:41-01:01:51",
    "text" : "Well they they actually talked about that, how they did like Michael Vick was still learning the playbook and he was like Ways away from being able to run an offense, but they're gonna put him in anyway."
  },
  {
    "text" : "I have here like nasty drive. Mike Vick, um 35 yard run, right? Okay, then same drive, 15 yard run, right? Yeah. And then like it peters out. And then it was like Lauren Malloy sacks. Otis Smith crushes him.",
    "timestamp" : "01:01:53-01:02:08",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:02:10-01:02:13",
    "speaker" : "Mike Melo",
    "text" : "They get a they get a penalty, but they take him down by the face mask. Yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:02:14-01:02:18",
    "text" : "Yeah. He like lunges at his head and rips it off the head."
  },
  {
    "timestamp" : "01:02:18-01:02:24",
    "text" : "They're just corner blitzing him to death. They just kept bringing the corner blitz over and over. That's how they knocked uh Scott Chandler out of the game.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, was bringing those those defenses.",
    "timestamp" : "01:02:23-01:02:25",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:31-01:02:32",
    "speaker" : "Mike Melo",
    "text" : "Michael Big to the ground."
  },
  {
    "text" : "But even outside of that, like I I I was like basically it's written down that it was like a meaning a meaningless like Antoine Smith like run the fourth uh inside like the two minutes so like they were just killing clock. Yeah. I'm like I think it was Wiggins, like just like blast some dude for a block, right? So even on offense, they were just destroying people. I think this is like the craziest like blocking tackling like game I've ever watched.",
    "timestamp" : "01:02:32-01:02:56",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:02:56-01:03:03",
    "text" : "And maybe maybe it's a game plan to beat Lamar Jackson too. Just blow people up and like screw the penalties.",
    "speaker" : "Greg"
  },
  {
    "text" : "I mean I I don't disagree with that. I don't know.",
    "timestamp" : "01:03:03-01:03:07",
    "speaker" : "Andy"
  },
  {
    "text" : "I mean that does that even fly in today's NFL though? They'd get torn to shreds if you just committed to that.",
    "timestamp" : "01:03:08-01:03:12",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:03:13-01:03:14",
    "text" : "I don't know. But then again, like against the case.",
    "speaker" : "Steve"
  },
  {
    "text" : "They can only call so many penalties, right?",
    "speaker" : "Andy",
    "timestamp" : "01:03:15-01:03:16"
  },
  {
    "timestamp" : "01:03:16-01:03:29",
    "text" : "Right. Wasn't that the Legion of Booms idea? Yeah. Well and like the Bengals like this year against them like the coach was basically like the wide receivers got manhandled. So I it might be a little bit of like how they used to play the Colts.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:03:29-01:03:29"
  },
  {
    "text" : "So I'm like if you can set the tone early Maybe it works. I don't know.",
    "timestamp" : "01:03:29-01:03:34",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:03:34-01:03:36",
    "speaker" : "Andy",
    "text" : "Break their will early and they're just not gonna try."
  },
  {
    "speaker" : "Steve",
    "text" : "But yeah, I know, but like I I probably it probably wouldn't be a good idea to kind of lunge Elamar Jackson with way more physical back then",
    "timestamp" : "01:03:36-01:03:46"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:03:45-01:03:55",
    "text" : "Yeah. You have players that are like athletic. They're not like guys that are gonna light you up like Brian Cutter. True."
  },
  {
    "speaker" : "Andy",
    "text" : "You don't you don't think Dante Hightower wants to light somebody up?",
    "timestamp" : "01:03:55-01:03:58"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, neither is K.",
    "timestamp" : "01:04:03-01:04:03"
  },
  {
    "speaker" : "Andy",
    "text" : "Lauren's guy though. He's he's a Fucking grown ass man. That guy that guy arm tackles running backs as he's getting blocked.",
    "timestamp" : "01:04:05-01:04:10"
  },
  {
    "timestamp" : "01:04:10-01:04:12",
    "speaker" : "Steve",
    "text" : "Yeah, Van Noy will dish out some."
  },
  {
    "text" : "Van Noyle, yeah, he'll throw some throw some heat.",
    "timestamp" : "01:04:12-01:04:15",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know. But yeah, you're right. Maybe I don't think that would form.",
    "timestamp" : "01:04:15-01:04:17",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, they don't have that like lawyer Malloy sort of safety who's gonna come up and just try to knock somebody's head off.",
    "timestamp" : "01:04:18-01:04:22",
    "speaker" : "Andy"
  },
  {
    "text" : "Well there is a there's a moment on like Vic's third or fourth drive. And he'd been corner blitzed to death and they like dropped out and like he just did the old Sam Darnold saw it ghosts and like saw that pass rush and he like threw it and like immediately ducked and like there was like four yards away from him. Like it wasn't even close.",
    "timestamp" : "01:04:23-01:04:42",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:04:43-01:04:54",
    "text" : "Like he was clearly seeing like Pressure everywhere. But it was like textbook tackle like every time. It was like waste, driving to ground. Yeah, that I mean that penalty notes. Yeah, actually.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:04:54-01:04:54",
    "speaker" : "Mike Melo",
    "text" : "Probably, yeah."
  },
  {
    "timestamp" : "01:04:54-01:04:55",
    "speaker" : "Andy",
    "text" : "Yeah, actually."
  },
  {
    "text" : "I have a note on here. Survivor is the only thing older than Brady. They're like, 'cause we usually don't have the commercials in it.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:04:56-01:05:04"
  },
  {
    "timestamp" : "01:05:04-01:05:06",
    "text" : "Yeah, there were some in this.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. And I was like, Survivor Africa. And I was like, well, if they're on Survivor Africa, that means it can't be the original season. I also have they're talking about two years in college football as like a short time for Mike Vick. Oh, you only played two years in college and it's now it's",
    "speaker" : "Mike Melo",
    "timestamp" : "01:05:06-01:05:23"
  },
  {
    "text" : "You look at his junior year kind of, yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:05:23-01:05:26"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, in twenty years they're gonna be like, you only spent two years at the XFL.",
    "timestamp" : "01:05:26-01:05:29"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well, like Joe Burroughs are gonna come out like real quick and everyone sees it come out. Just immediately in college.",
    "timestamp" : "01:05:31-01:05:37"
  },
  {
    "timestamp" : "01:05:37-01:05:40",
    "speaker" : "Greg",
    "text" : "I mean it makes sense, right? You gotta get money."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. What was that dude that kind of like messed that whole thing up? Was it Maurice Cloret?",
    "timestamp" : "01:05:40-01:05:45"
  },
  {
    "text" : "Maurice Clorette, I have his jersey.",
    "timestamp" : "01:05:46-01:05:47",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, yeah, that whole thing.",
    "speaker" : "Steve",
    "timestamp" : "01:05:47-01:05:48"
  },
  {
    "timestamp" : "01:05:52-01:05:54",
    "speaker" : "Andy",
    "text" : "He got a fifteen bucks."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:05:54-01:05:54",
    "text" : "I remember that."
  },
  {
    "text" : "Yeah, whatever that plays with in Lawrence.",
    "speaker" : "Andy",
    "timestamp" : "01:05:54-01:05:56"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Cool. That's dope. I also have they're like, oh well you can't play can't pay two starting quarterbacks seven million dollars a year each. I thought that two like seven million seven. Yeah. Yeah.",
    "timestamp" : "01:05:58-01:06:12"
  },
  {
    "text" : "You can't pay one third quarterback 14 million a year.",
    "timestamp" : "01:06:12-01:06:16",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That was crazy. Jared Goff making thirty. Jesus Christ. Yeah. Rex Burkhead's probably making five. Yeah.",
    "timestamp" : "01:06:19-01:06:27"
  },
  {
    "timestamp" : "01:06:27-01:06:36",
    "speaker" : "Steve",
    "text" : "So many players. Oh, they need too much ego. Or it's like one and they all want to start. It was like, yeah, there's just not enough money to go in each."
  },
  {
    "timestamp" : "01:06:35-01:06:36",
    "speaker" : "Mike Melo",
    "text" : "And like that's the top end."
  },
  {
    "text" : "So like what are the guys like just getting their heads torn off making he Bledzo signed what, like ten year, a hundred million dollars? Ten million a year, right?",
    "timestamp" : "01:06:37-01:06:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:06:47-01:06:50",
    "speaker" : "Steve",
    "text" : "Ten million, yeah, but like you would say like maybe some of those years were like void."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah. I'm I'm sure it was all back loaded and shit like that.",
    "timestamp" : "01:06:51-01:06:53"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:06:53-01:07:00",
    "text" : "So you're saying two so it'd be like fourteen for your quarterback. Yeah. I don't know. I don't know what the salary capital was back then, but."
  },
  {
    "text" : "Yeah. I mean these are $2,000. Yeah, exactly.",
    "timestamp" : "01:07:01-01:07:04",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Steve",
    "text" : "Um I had written that like uh Antoine Smith had been campaigning for like twenty plus carries a game. Like that was his thing, which it's unfortunate that you need a back that has to have that many, but I guess it's getting the groove. I mean, I I think Adrian Peterson was like the same way, but Yeah.",
    "timestamp" : "01:07:05-01:07:19"
  },
  {
    "timestamp" : "01:07:19-01:07:22",
    "text" : "Um I mean back then that was a big thing.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah. And I have that uh they mentioned that it was the first Pats runner that reached a hundred yards since the 99th. Yes. That's crazy.",
    "speaker" : "Steve",
    "timestamp" : "01:07:22-01:07:30"
  },
  {
    "speaker" : "Andy",
    "text" : "That's crazy Yeah, who was who was the running back?",
    "timestamp" : "01:07:30-01:07:32"
  },
  {
    "timestamp" : "01:07:33-01:07:37",
    "text" : "I I wrote it down, but I don't Oh, it was Terry Allen. I have no idea. Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:07:38-01:07:41",
    "speaker" : "Andy",
    "text" : "Terry? Yeah, I've never even heard that name. Terry Allen."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah, he was uh Marky Sounds cousin retarded brother, yeah. Uh that's not a retard shame.",
    "timestamp" : "01:07:41-01:07:50"
  },
  {
    "text" : "Yeah, come on, Terry A Terry Terry is listening to the brother. I know all about. Terry is listening. Shout out to Terry.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:07:50-01:07:57"
  },
  {
    "speaker" : "Andy",
    "text" : "No, I mean Terry. Yeah. Wasn't he in the same era as the Marion Butts? I think he's on Cameo.",
    "timestamp" : "01:07:57-01:08:04"
  },
  {
    "timestamp" : "01:08:04-01:08:05",
    "speaker" : "Steve",
    "text" : "I don't remember Marion Butts."
  },
  {
    "timestamp" : "01:08:05-01:08:06",
    "speaker" : "Andy",
    "text" : "He's not up checked."
  },
  {
    "speaker" : "Steve",
    "text" : "I don't remember Terry Allen.",
    "timestamp" : "01:08:06-01:08:08"
  },
  {
    "text" : "I remember Terry Allen. Briefly.",
    "speaker" : "Andy",
    "timestamp" : "01:08:08-01:08:09"
  },
  {
    "timestamp" : "01:08:10-01:08:12",
    "text" : "Did uh did Jonas Gray ever get back to you? Natron means?",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "It expired. You get five days, and if they don't, you get your money back.",
    "timestamp" : "01:08:13-01:08:17"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:17-01:08:22",
    "text" : "What you gotta try again. What can you really do nowadays? I can go as trying out for the XFL, believe it or not."
  },
  {
    "text" : "I got a list of other guys All right, all right, who else we got who can potentially do our intro? Where'd they go?",
    "speaker" : "Mike Melo",
    "timestamp" : "01:08:22-01:08:29"
  },
  {
    "text" : "Um my top list, uh Marshall Newhouse. Oh, big, yeah, I'm in on that. Dominic Easley",
    "timestamp" : "01:08:29-01:08:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Well he's just a nobody.",
    "timestamp" : "01:08:40-01:08:42"
  },
  {
    "timestamp" : "01:08:42-01:08:55",
    "text" : "Yeah, Joe Smay was unless you're listening, then I'm Marshall Newhouse, I'm a big Newhouse guy. Because he's beloved because he was put in a tough spot. He wasn't he was he's not good. It's like he's not hated. It feels right.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:08:56-01:08:59",
    "speaker" : "Steve",
    "text" : "He's not hated like flashing things about him. Exactly"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:09:00-01:09:02",
    "text" : "What about uh Ross Ventrone?"
  },
  {
    "timestamp" : "01:09:02-01:09:20",
    "text" : "Dude, that guy uh I went a little uh Jonas Craig like deep dive, man. And That dude like Belichick ruined his life. Okay. That was great. Really? Yeah, dude, like He uh I guess like he had that huge game. Well what was it, two hundred yards, four touchdowns against the Colts.",
    "speaker" : "Steve"
  },
  {
    "text" : "Two oh one baby. No, two oh one 'cause he he does it in his thing. He says it's a two oh one club.",
    "timestamp" : "01:09:20-01:09:24",
    "speaker" : "Andy"
  },
  {
    "text" : "And so I guess what happened is like he set his alarm on his phone, the phone died, and he went to the to practice late or whatever. So he he was in the Belichick Doghouse and then he tweeted It's kind of like one of the first tweets that was really like controversial. I remember this, yeah. Where it was like they turn your back on you so quickly or something like that, and then basically Yeah. I mean he was never allowed to play again. Like it said like they'd give him a couple of like, you know, carries here or there. He was actually on the Patriots, I think, for the next season as well. They basically just like they're like, nah, you're not gonna play. And then they shipped him out, I think, to like the Dolphins or something like that. Yeah. I think he was like trying to get to the XFL man. He like You know, he didn't get picked up.",
    "speaker" : "Steve",
    "timestamp" : "01:09:25-01:10:02"
  },
  {
    "text" : "I'm like, I feel bad for the guy because I just ruining his life though.",
    "timestamp" : "01:10:02-01:10:06",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Steve",
    "text" : "No, and now he's doing cameos for twenty bucks. Like I just I gotta think I mean obviously like Belcher Clark saw some other things in practice or whatever, but I just gotta think like if like his alarm went off or whatever the case may be if like it was Uh I don't know man. No. I've said that to a coach, and I was lying. Oh really? Yeah. Okay. Well then I retract. What'd you say to a coach? Just I took it for face value.",
    "timestamp" : "01:10:06-01:10:32"
  },
  {
    "text" : "I got drunk and I slept through the alarm and missed the bust a bucknell.",
    "speaker" : "Greg",
    "timestamp" : "01:10:33-01:10:36"
  },
  {
    "text" : "Well to be fair. All right, to be fair, young guy, huge game. Maybe he was celebrating. I have no idea.",
    "speaker" : "Steve",
    "timestamp" : "01:10:37-01:10:43"
  },
  {
    "text" : "I have no idea. Yeah. Would you like miss your car keys or something, Greg?",
    "timestamp" : "01:10:43-01:10:46",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "text" : "No, I just you know, the whole team.",
    "timestamp" : "01:10:46-01:10:48"
  },
  {
    "text" : "Yeah, you don't need you don't even have khakis.",
    "timestamp" : "01:10:49-01:10:50",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:10:51-01:11:04",
    "text" : "You only got jeans. Uh shout out to my coach he didn't realize till halfway to New York. He only figured out when I called him. He's like, oh, you're not on the bus.",
    "speaker" : "Greg"
  },
  {
    "text" : "So you boys haven't been here for this, but um when it's been me and Mike, he's had a segment",
    "speaker" : "Andy",
    "timestamp" : "01:11:06-01:11:12"
  },
  {
    "text" : "But I think he wants to introduce here Well to the rest of you. I mean basically what I found in doing this is that I didn't know as much about football as I thought I did. And sometimes the announcers say some terms or some things that I Have trouble understanding if it's football or not football. And so I sort of bring to Andy it's been, 'cause he knows more about football than I do. And so, you know, he can explain to me is it football or not football.",
    "speaker" : "Steve",
    "timestamp" : "01:11:13-01:11:36"
  },
  {
    "timestamp" : "01:11:36-01:11:36",
    "speaker" : "Mom",
    "text" : "Okay."
  },
  {
    "timestamp" : "01:11:36-01:11:49",
    "speaker" : "Steve",
    "text" : "So maybe you guys can help with this. Like last week I thought that I was kind of like learning about these terms and whatever because nothing popped up and we kind of discussed it and I was like no dude I think I I got this but threw me for a loop again."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Do we need to bring in should we I feel like we should bring mom in for this one.",
    "timestamp" : "01:11:49-01:11:52"
  },
  {
    "text" : "She'll tell too you know nope. Uh yeah, let's see what you guys think first and then we'll uh we'll address this. I mean so these guys were saying, um there's a few that I can rattle off here. Um so Ambrose said, and then this is what they were quoting him as I like things a little tighter. Ray likes it a little looser. Is that football or not football?",
    "timestamp" : "01:11:52-01:12:15",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:12:16-01:12:16",
    "speaker" : "Mike Melo",
    "text" : "Who said that?"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh Ambrose, cornerback. And who is he talking about? Ray. Ray, his like uh probably Ray B. His butt oh he likes her, but then Ray likes it. Oh well what? What was that?",
    "timestamp" : "01:12:17-01:12:30"
  },
  {
    "speaker" : "Greg",
    "text" : "No, go ahead, go ahead, finish.",
    "timestamp" : "01:12:31-01:12:33"
  },
  {
    "text" : "All right, so yeah, so he likes it a little tighter and Ray likes it a little looser, and I don't know what that meant.",
    "timestamp" : "01:12:33-01:12:37",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well, I mean, let's ask the uh Jerry Sandusky expert.",
    "timestamp" : "01:12:38-01:12:41"
  },
  {
    "text" : "I think I think it has to do with uh coverage would be my guess.",
    "speaker" : "Andy",
    "timestamp" : "01:12:41-01:12:45"
  },
  {
    "text" : "Wait, wait. Well I'll I'll I'll hit you with another similar analogy. Different strokes for different folks.",
    "speaker" : "Greg",
    "timestamp" : "01:12:45-01:12:51"
  },
  {
    "speaker" : "Steve",
    "text" : "Okay. Oh okay, yeah. But is that football or not football?",
    "timestamp" : "01:12:52-01:12:55"
  },
  {
    "timestamp" : "01:12:55-01:12:55",
    "text" : "I don't know.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:12:55-01:13:07",
    "speaker" : "Mike Melo",
    "text" : "You tell me. I mean it could be both, but I but when he's talking, he's probably talking about like Where Ray gets right up on the the receiver and like runs with him. Oh whereas the other guy gives him a little cushion and he likes to get physical."
  },
  {
    "text" : "So it it's tighter coverage versus looser coverage but playing off of the line as opposed to on the line.",
    "speaker" : "Andy",
    "timestamp" : "01:13:07-01:13:12"
  },
  {
    "timestamp" : "01:13:15-01:13:15",
    "text" : "a little bit.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Gotcha. The other guy likes to kind of see where what things are happening. Let the other person be dominant and and dictate the off. On my face, sorry. Next one. When you're a hot quarterback, things happen to you. He's talking about Brady, and this is when you were kind of like really on on him a little bit. When you're a hot quarterback, things happen to you.",
    "timestamp" : "01:13:15-01:13:37"
  },
  {
    "timestamp" : "01:13:38-01:13:41",
    "text" : "So you happen to you or happen for you?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:13:41-01:13:45",
    "text" : "I see because you had written it as happened for you and maybe I just I heard happen to you."
  },
  {
    "text" : "I mean you could be right.",
    "timestamp" : "01:13:46-01:13:47",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know. Maybe it's happened for you. I mean it changes it, right? Yeah, and that's what I was wondering because I'm like, what are they talking about? What does that mean?",
    "timestamp" : "01:13:47-01:13:56"
  },
  {
    "text" : "I think I I think the message is still the same. I mean, I think in that same little Soloquay they were talking about they said if you have like Dan Marino and Dan Founce or whoever crap quarterbacks that were on the bench, you're starting the hot hands.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:13:56-01:14:06"
  },
  {
    "text" : "No sir, no sir. That was another part, but I know what you're talking about. And all five Backstreet Boys were on the bench, you go with the hot hand. Which again, that could play on that.",
    "timestamp" : "01:14:06-01:14:18",
    "speaker" : "Steve"
  },
  {
    "text" : "I don't know what he's talking about, hot hand, is it like basketball term where the guy's ballot? a little out of well I mean but think about the think about the term. Two thousand one Backstreet Boys they were they're hot in the streets. They're hot in the streets.",
    "timestamp" : "01:14:18-01:14:36",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Steve",
    "text" : "Backstreet boys what is happening here?",
    "timestamp" : "01:14:37-01:14:38"
  },
  {
    "timestamp" : "01:14:38-01:14:42",
    "speaker" : "Andy",
    "text" : "They're hot in the streets. I I mean it must be that he's attractive, right? 'Cause I mean that that's the Backstreet Boys."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, but Dan Reno, ugly as shit.",
    "timestamp" : "01:14:43-01:14:45"
  },
  {
    "timestamp" : "01:14:45-01:14:50",
    "speaker" : "Greg",
    "text" : "These are handwritten notes, but he has bolded hot hand underlying exclamation point."
  },
  {
    "text" : "I'm just wondering. I mean are they talking about football?",
    "timestamp" : "01:14:52-01:14:54",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:14:55-01:15:04",
    "speaker" : "Andy",
    "text" : "I don't think so. In that one I I would say no. We usually we get to yes it's football, but I think in this case, no. Yeah, so I think they're just talking about the Tom Brady so beautiful that one he's running high."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:15:06-01:15:10",
    "text" : "I disagree because Dan Marino's ugly. I saw him in Ace Centura, he was not not attracting."
  },
  {
    "text" : "Both studs. Studs.",
    "timestamp" : "01:15:13-01:15:14",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "John Elway, literally. And the Backstreet Boys aren't studs?",
    "timestamp" : "01:15:14-01:15:17"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:15:18-01:15:20",
    "text" : "No, they are too. That's what I'm saying. I don't know what the chorus is."
  },
  {
    "text" : "Studs of the boy band music scene at the time.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:15:20-01:15:22"
  },
  {
    "timestamp" : "01:15:23-01:15:24",
    "speaker" : "Steve",
    "text" : "I mean they're talking about something else then obviously."
  },
  {
    "timestamp" : "01:15:24-01:15:25",
    "speaker" : "Mike Melo",
    "text" : "Yeah, I think so."
  },
  {
    "timestamp" : "01:15:25-01:15:27",
    "text" : "I think that might that might be slightly sexual, which is weird.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:15:28-01:15:37",
    "text" : "They're ahead of their time because Brady this was like pre haircut. That's true. Yeah, with the bowl cut. Yeah. Yeah. All right. All right, not football."
  },
  {
    "text" : "But do you think he was hot back then? That's what I'm saying. I think he's aged like a fine wine. Was he is that before? I mean obviously he's hot now. Everybody knows that. Right, right, right.",
    "timestamp" : "01:15:38-01:15:48",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:15:48-01:15:52",
    "text" : "Was he hot then? He had the he had the the butch in Which I find attractive.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:15:52-01:15:57",
    "text" : "He did, but he was also didn't he run like a five five or something? Like five.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:15:58-01:16:06",
    "text" : "I thought he was cute. Now he saw it. Yeah. Well, this day and age I can't view him through the 2001 lens without viewing him through the 2019 lens. That's also a good point.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "That's a good point. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:16:06-01:16:07"
  },
  {
    "timestamp" : "01:16:08-01:16:08",
    "text" : "So yeah.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he suffers from getting better.",
    "timestamp" : "01:16:08-01:16:10"
  },
  {
    "text" : "Um so then I have another one doubling back on the soft hands because that one's double underlined right here. Um it says he goes, boy, can't control big soft hands in order to pull in a ball that goes that fast. I'm like what the what the what does that mean?",
    "speaker" : "Steve",
    "timestamp" : "01:16:11-01:16:27"
  },
  {
    "text" : "Who is it do you know who that was about?",
    "timestamp" : "01:16:27-01:16:28",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:16:35-01:16:37",
    "speaker" : "Steve",
    "text" : "Welcome to the segment. Well, I just I don't get it."
  },
  {
    "speaker" : "Greg",
    "text" : "like a transcript of the game is control F hot.",
    "timestamp" : "01:16:38-01:16:41"
  },
  {
    "timestamp" : "01:16:44-01:16:46",
    "text" : "We don't want you guys all have to tell me it doesn't matter.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "We can move on, but like no so so do we know who this is about? Sounds like a a larger gentleman though.",
    "timestamp" : "01:16:46-01:16:53"
  },
  {
    "text" : "I think it might have been. I again you told me to like put context into these things and like I didn't. Oh you don't.",
    "speaker" : "Steve",
    "timestamp" : "01:16:53-01:16:59"
  },
  {
    "speaker" : "Andy",
    "text" : "That's fine. Big soft hands.",
    "timestamp" : "01:16:59-01:17:00"
  },
  {
    "timestamp" : "01:17:01-01:17:03",
    "speaker" : "Steve",
    "text" : "Right? Boy. And he goes, boy Oh boy."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:17:03-01:17:30",
    "text" : "Boy. Oh oh three of the boy. So big soft hand, I mean soft hands on this. Yeah, because tight ends aren't really known for that. So if it happens, like with Algie Crumpler running a a four nine, it's one of those things where it's it's unusual for him to have big soft like supple hands right as opposed to the big gnarly lineman hands."
  },
  {
    "speaker" : "Steve",
    "text" : "So big soft hands in the future means. And he catches football.",
    "timestamp" : "01:17:32-01:17:36"
  },
  {
    "timestamp" : "01:17:36-01:17:37",
    "speaker" : "Andy",
    "text" : "I think is is what they missed out on."
  },
  {
    "text" : "So this one I did write context was about Maurice Smith. He's a big back, not as strong and bruising. He's a little faster hitting the hole. So he's a he's a back not as strong and bruising, which I think I get what that means. Like he's he and he's a little faster hitting the hole. Football or not football.",
    "timestamp" : "01:17:37-01:17:56",
    "speaker" : "Steve"
  },
  {
    "text" : "So he's a twink.",
    "timestamp" : "01:17:57-01:17:58",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:17:59-01:18:03",
    "text" : "Yeah, yeah. Well I don't jeez. You caught me off guard there. I don't know about that."
  },
  {
    "timestamp" : "01:18:03-01:18:23",
    "speaker" : "Andy",
    "text" : "I think uh when they're talking about whole end uh to talk about Another one of Mike's keyword control F. Twink. Uh I I I I want to make the point that I think Maurice Smith is actually Antoine Smith. He just changed jerseys. First of all."
  },
  {
    "speaker" : "Mom",
    "timestamp" : "01:18:23-01:18:24",
    "text" : "Oh, I think it's the same people."
  },
  {
    "timestamp" : "01:18:25-01:18:26",
    "speaker" : "Andy",
    "text" : "Same person, yeah, same person."
  },
  {
    "text" : "They run the same way.",
    "timestamp" : "01:18:26-01:18:27",
    "speaker" : "Mom"
  },
  {
    "timestamp" : "01:18:27-01:18:30",
    "speaker" : "Mike Melo",
    "text" : "I didn't watch so. I had no idea who Maury Smith was."
  },
  {
    "speaker" : "Andy",
    "text" : "He's Antoine Smith. He just changed his name and and swapped jerseys at halftime.",
    "timestamp" : "01:18:30-01:18:34"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, well into us with like the big breathe right strip, so that would have been annoying to change on and off all the time.",
    "timestamp" : "01:18:33-01:18:38"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean he he makes football money. I he goes through piles of them. But talking about I think we've we've touched on this a bit before was Right you've mentioned gaping holes before wasn't it? I think it's similar. I think it's um we talk about hitting a hole, right? That's how fast a running back gets into the hole like that that hole that the lineman creates.",
    "timestamp" : "01:18:40-01:19:00"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:19:01-01:19:06",
    "text" : "Are we talking all the way all the way into the hole or like how quickly he enters the hole."
  },
  {
    "text" : "Usually how quickly he enters the hole. Okay.",
    "speaker" : "Andy",
    "timestamp" : "01:19:07-01:19:09"
  },
  {
    "timestamp" : "01:19:09-01:19:13",
    "text" : "Yeah. Between getting the handoff and getting to the offensive lineman.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, the the hole created in the in the defensive line by the offensive lineman.",
    "timestamp" : "01:19:13-01:19:17"
  },
  {
    "timestamp" : "01:19:17-01:19:46",
    "text" : "Oh, okay. Yeah, he's a big guy who shouldn't say. Okay. So then that like leads into the next one where it's um he hits the hole hard and drags the fenders in, which Oh, I'm trying to be serious in this whole thing I just cheating and killing. So moving on.",
    "speaker" : "Steve"
  },
  {
    "text" : "So dare I ask what did you think that meant?",
    "speaker" : "Andy",
    "timestamp" : "01:19:47-01:19:49"
  },
  {
    "text" : "How exactly would you drag defenders into other holes? I just I told you I don't know what to do. That sounds like a Jerry Sandusky thing right there. And then the the last remaining two Um so Who's six of these? Oh no, six two? Oh man. Let's reset here. Okay. Deep breath. All right, we uh we have a lot of excitement down there. And this is about Mike Vic. I was wondering not for ball. I was wondering if they were talking about Ron Mexico.",
    "speaker" : "Steve",
    "timestamp" : "01:19:53-01:20:30"
  },
  {
    "text" : "Couldn't even get through it. Couldn't get through it. Well you see the the commentators watch it from the press box, which is above the field, so they're talking down there and all the fans and you know.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:20:35-01:20:42"
  },
  {
    "text" : "Oh boy. No That's not what I was thinking, but that's along the lines of what it could be. And I I didn't know that. Did you not see Michael Vick's erection? No. See, I'm glad I brought this to you guys because it's a lot better. So am I. Um which this threw me off off guard, but like then I looked into some other stuff. So um eight different receivers Brady has hooked up with today. And I was like, oh shit, that's a lot. What does he mean by that? And then I figured like, okay, how many receptions or whatever? What do you consider hooked up? Right, right. But then I was like, wait a minute, like at first I was like thinking, whoa, if you hooked up with like that many people, like Was he dating anybody at the time or whatever? I don't know.",
    "timestamp" : "01:20:48-01:21:34",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:34-01:21:36",
    "text" : "And so I mean Giselle wasn't in the picture."
  },
  {
    "text" : "It was like his first year, so what was he doing?",
    "timestamp" : "01:21:38-01:21:40",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Uh Mike, were you jealous?",
    "timestamp" : "01:21:41-01:21:43"
  },
  {
    "timestamp" : "01:21:43-01:21:54",
    "speaker" : "Steve",
    "text" : "I mean Why would you not make you feel like that? How did it make you feel? I just come to terms of the fact that Brady doesn't give a crap about me. All those letters they went unanswered, did they?"
  },
  {
    "timestamp" : "01:21:54-01:21:57",
    "speaker" : "Andy",
    "text" : "Huh? All those letters you wrote him, they went unanswered."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:21:57-01:22:37",
    "text" : "Uh he did write a few, but it kind of didn't seem like his handwriter. Yeah. Well, that one was uh Fun fact, Brady uh was dating in 2001 um uh Layla Layla Lobberitz, nineteen ninety-seven Playmate of the Year. Ooh. Yeah, this is it says after the Super Bowl though. So I don't know when that relationship starts. Yeah, Layla Roberts, 1997 Playmate of the Year. That's the Atlanta game. I doubt it though. Well dude, well yeah, I don't know about like at the game though. Uh I know this is around the time he was hanging out with Trump and doing that like whole stuff. Like Was it? Yeah."
  },
  {
    "timestamp" : "01:22:37-01:22:37",
    "text" : "At that point?",
    "speaker" : "Mom"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:22:37-01:22:48",
    "text" : "Yeah, yeah. I think so. So and then in two thousand two, so that relationship ended, he started dating Tower Reed, which I think we all know about. But at that point she had done American Pie, she done the Globowski."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, she was a big name.",
    "timestamp" : "01:22:48-01:22:49"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, so then he broke up with her and I was wondering, I just watched uh Sharknado 6. And she's in a big player in this game. And I'm just wondering if he regrets that and if he likes the movies. So if we have him on, then that'll be the first question we have.",
    "timestamp" : "01:22:50-01:23:05"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:23:06-01:23:07",
    "text" : "made us six. No."
  },
  {
    "timestamp" : "01:23:10-01:23:11",
    "text" : "That's a great question.",
    "speaker" : "Steve"
  },
  {
    "text" : "So Tom, now that we finally got you on this podcast after 10 years, we need to ask you the question that everybody wants an answer to. Have you seen Sharknado 6 and what did you think of it?",
    "speaker" : "Andy",
    "timestamp" : "01:23:11-01:23:23"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And there's probably Sharknado 7 by this point, too.",
    "timestamp" : "01:23:23-01:23:25"
  },
  {
    "text" : "There's rumors that has not happened yet.",
    "speaker" : "Steve",
    "timestamp" : "01:23:27-01:23:29"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:23:29-01:23:31",
    "text" : "By the time we get there, it'll be Sharknado 12."
  },
  {
    "speaker" : "Steve",
    "text" : "Fingers crossed. Dude, Scar Reed's like if I mean spoiler alert, but you guys should have watched it by now. I mean Reed is like a cyborg by the 6-1, so it just check it out. Yeah, yeah, yeah.",
    "timestamp" : "01:23:31-01:23:41"
  },
  {
    "timestamp" : "01:23:42-01:23:43",
    "speaker" : "Andy",
    "text" : "Have you actually watched it?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:23:43-01:23:43",
    "text" : "It's fantastic."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:23:44-01:23:44",
    "text" : "Nicely done."
  },
  {
    "text" : "I've seen one in two.",
    "speaker" : "Steve",
    "timestamp" : "01:23:44-01:23:45"
  },
  {
    "text" : "It's something. So we're just plugging other podcasts, other movies.",
    "timestamp" : "01:23:47-01:23:50",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:23:50-01:24:09",
    "text" : "Sharknado, yeah. Um look, we're showing that we're well-rounded people, right? Uh-huh. Um but then Um so uh well documented uh split 2004 to 2006, Bridget Moynihan, um, Coyote Ugly, all that other stuff. Uh had a kid with her at was a little, whatever."
  },
  {
    "speaker" : "Andy",
    "text" : "Didn't she name him his initials are Jet?",
    "timestamp" : "01:24:09-01:24:12"
  },
  {
    "text" : "Was it? No.",
    "timestamp" : "01:24:12-01:24:14",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:24:16-01:24:24",
    "text" : "No. Uh Yeah, their kid. It's like Jason Edward Thomas something more. Are you serious?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:24:25-01:24:28",
    "speaker" : "Steve",
    "text" : "What a dig. I didn't know this is a hot take on a coincidence."
  },
  {
    "text" : "I thought it was like a Tom Brady named up his first captor himself.",
    "timestamp" : "01:24:28-01:24:32",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "text" : "Who gets naming rights?",
    "timestamp" : "01:24:31-01:24:32"
  },
  {
    "text" : "Probably Bridget, I think.",
    "speaker" : "Steve",
    "timestamp" : "01:24:32-01:24:34"
  },
  {
    "timestamp" : "01:24:34-01:24:36",
    "speaker" : "Mike Melo",
    "text" : "Yeah, I don't know. Uh keep going."
  },
  {
    "timestamp" : "01:24:37-01:24:43",
    "speaker" : "Greg",
    "text" : "So well, so can I add something to it? I'm curious what Ali was gonna find. Yeah, I just uh looked her up for research."
  },
  {
    "timestamp" : "01:24:43-01:24:47",
    "speaker" : "Andy",
    "text" : "John Edward Thomas Moynihan. Jet."
  },
  {
    "speaker" : "Greg",
    "text" : "Wow. That's a dig if I've ever heard one. Jet him. Um during that time when he dated her. Yeah. Also linked to Vin Diesel. Get out of here. Who was?",
    "timestamp" : "01:24:47-01:24:57"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Tom Brady.",
    "timestamp" : "01:24:57-01:24:58"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:24:58-01:24:59",
    "text" : "Layla. Tom Brady."
  },
  {
    "text" : "I'm like, what are you talking about? Now we're talking. This is some New York property. And Diesel Tom Brady. Um and then um for a brief stint before Giselle, he apparently allegedly dated a Patriots cheerleader who ended up I don't know if she's married to him, but I think she's still with him, Lonnie Paxton. Oh nice tying it back to your boy.",
    "speaker" : "Steve",
    "timestamp" : "01:25:01-01:25:26"
  },
  {
    "text" : "My boy Alani.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:25:26-01:25:27"
  },
  {
    "text" : "So if we're gonna tie this all or not, Kevin Euclid is married to Tom Brady's sister.",
    "speaker" : "Andy",
    "timestamp" : "01:25:28-01:25:34"
  },
  {
    "text" : "He is, yeah. So I don't know if that's informative to anybody out there or anybody cares, but Here we are.",
    "timestamp" : "01:25:34-01:25:40",
    "speaker" : "Steve"
  },
  {
    "text" : "All right. And coincidence never mind. No, go ahead.",
    "timestamp" : "01:25:41-01:25:44",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "We can edit it.",
    "timestamp" : "01:25:44-01:25:45"
  },
  {
    "text" : "We can edit it at all. We're gonna have to cut it out anyway at this point. Yeah.",
    "timestamp" : "01:25:45-01:25:49",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:25:49-01:25:50",
    "speaker" : "Greg",
    "text" : "No, I can't say it."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:25:51-01:25:56",
    "text" : "He's censoring himself. Take the mic land there. Yeah. Just say it's in the room."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:25:56-01:25:57",
    "text" : "I'll cut it out."
  },
  {
    "timestamp" : "01:25:59-01:26:00",
    "speaker" : "Steve",
    "text" : "And there it is."
  },
  {
    "text" : "What's the saying? It's not gay if it's somebody. Sister, mother, brother, whatever.",
    "speaker" : "Andy",
    "timestamp" : "01:26:00-01:26:05"
  },
  {
    "text" : "I mean we I we do have to have that guy on the podcast that I know that did have that relationship with somebody who did spend some time with Tom Brady. I cannot confirm or deny. All right.",
    "timestamp" : "01:26:05-01:26:20",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Why? Let's do best and worst.",
    "timestamp" : "01:26:20-01:26:24"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Steven. Uh best. Richard Seymour's first career sack. Oh, he bonnie that fucking. And first of many. Yeah. First round pick. Took him week eight to get his first sack. And it was a it was a brutal one. And he's gonna have like how many more at the Patriots? Hundred more.",
    "timestamp" : "01:26:25-01:26:47"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:26:48-01:26:56",
    "text" : "I don't know, is that maybe yes, I love your style. And for the Raiders. And the worst. Richard Seymour, six, six, three hundred and five pounds. Oh yeah."
  },
  {
    "text" : "But is it the the true like you know, where the edge defender was going at that point. The new defensive end.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:26:56-01:27:03"
  },
  {
    "timestamp" : "01:27:03-01:27:13",
    "text" : "Which they got a shit ton of crap for drafting him because he was too tall to be a defensive end, but too big to be a outside linebacker some bullshit like that.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Is he gonna be a Hall of Famer?",
    "timestamp" : "01:27:14-01:27:15"
  },
  {
    "text" : "He's on the cusp. Probably.",
    "timestamp" : "01:27:15-01:27:17",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Eventually, yeah. Hope so.",
    "speaker" : "Andy",
    "timestamp" : "01:27:17-01:27:18"
  },
  {
    "text" : "Page it's Hall of Famer for sure. Yeah. Oh yeah. If he's not alright. Definitely. I was he worse. The lawyer Malloy just let me get out of the way on that slant route. I was just like, what are you doing? I hear you. If your lawyer Malloy just Just body him and like I think what his thought was like I don't want to hurt my own player too, but like it's Larry Mole. I don't know if those thoughts ever occurred to them. I know.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:27:18-01:27:43"
  },
  {
    "speaker" : "Steve",
    "text" : "He almost hurt his own player anyway.",
    "timestamp" : "01:27:45-01:27:46"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah. I had a chance to tackle it twenty yards early and you you just just literally dodged the whole play.",
    "timestamp" : "01:27:46-01:27:52"
  },
  {
    "timestamp" : "01:27:53-01:27:55",
    "speaker" : "Andy",
    "text" : "All right, Mr. Mello. Best and worst."
  },
  {
    "text" : "Um I gotta go best. I gotta go twofold here. It's a hustle. It's a hustle double. Alright. Um There was a play that um was gonna go for a touchdown that Tylaw cuts across the field. He runs like forty forty yards, I think it was. Oh, hair. Yeah, yeah, and saves that touchdown on that play. So that was pretty um pretty great. And then uh Vinateri also did the same. So to kind of call back to an earlier episode where you were talking about his athleticism, yeah. He he pretty much blocked it down the field and like knocked the guy out of bounds to save another touchdown. So Kinda two two good hustle plays, I thought.",
    "timestamp" : "01:27:56-01:28:32",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:28:33-01:28:42",
    "text" : "I missed that episode. Was that the one where you guys pulled up that him running down the Cowboys or Turner? Uh you mean uh Herschel Walker, you mean? Yes.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Remember I was hating on you, I was like, does no one's true? Yeah. It's true. Motherfucker's a football player.",
    "speaker" : "Greg",
    "timestamp" : "01:28:44-01:28:51"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:28:51-01:29:04",
    "text" : "Not a kicker football player. Incredible. You have not seen this just YouTube Benedict Herschel Walker that'll come up. It's amazing. It's the best kick in the book."
  },
  {
    "text" : "I've never seen anything like that. Um and I think I'm gonna bypass the worst moment because I didn't really have one. I was I I you know for the holiday season I think like I'll I'll be nice, but an honorable mention, which is not really the worst play, but I thought it was worth noting. Is that the first time I've seen people Bledsoe, um, and which I saw in your notes that you kind of mentioned this sort of play as well in the same fashion, is uh, you know I he he basically like Brady chucks the ball like no look over his head to try to complete a pass as he's fallen down and it ends up being almost a reception. It was an incompletion, which I know Bletto it would have been a pick six for sure.",
    "speaker" : "Steve",
    "timestamp" : "01:29:04-01:29:43"
  },
  {
    "text" : "Oh easy, yeah. So he picks up some bad habits.",
    "speaker" : "Andy",
    "timestamp" : "01:29:43-01:29:52"
  },
  {
    "text" : "Yeah, just chuck it over your head and hope for the best.",
    "timestamp" : "01:29:53-01:29:55",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:29:55-01:30:00",
    "text" : "Yeah, that was rough. All right, Greg, best and worse."
  },
  {
    "text" : "Alright, so um my worst, I'm gonna kinda go back to that Boston Globe thing we were talking about earlier, the spotless snatch. I mean all Michael Smith, all four of these are bad. Mean catch, spotless snatch, stainless snare. He's pure pluck. I mean that's he's a writer. Gotta do better than that. You have to do better than that.",
    "timestamp" : "01:30:00-01:30:23",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:30:23-01:30:24",
    "text" : "Probably an English major.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:30:25-01:30:34",
    "text" : "Nair was one of them. Stainless sets worse than spotless. For a porn title, yes. Yeah, we need your mom."
  },
  {
    "timestamp" : "01:30:36-01:30:44",
    "text" : "Yeah. I'm finishing up. The my worst of the week is my mom kicking me out of the gosh darn room. We'll be uh five minutes.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, we'd be finished already if we weren't for all these interruptions. You don't have to. We'll get you later. Yeah. We'll do a real one. We're already on hour three.",
    "speaker" : "Andy",
    "timestamp" : "01:30:45-01:30:53"
  },
  {
    "speaker" : "Greg",
    "text" : "Alright, so my uh my best Um, so I have all I have the newspaper clippings from that day. That same day, um, Arizona rallies in ninth inning to dethrone Yankees. Kurt Schilling versus Roger Clemens in a game seven World Series. Diamondbacks won on a Louis Gonzalez single. Yes, that's a great one.",
    "timestamp" : "01:30:53-01:31:18"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Wow. World Series game seven, same day.",
    "timestamp" : "01:31:20-01:31:23"
  },
  {
    "speaker" : "Greg",
    "text" : "Wow. Yeah.",
    "timestamp" : "01:31:23-01:31:24"
  },
  {
    "timestamp" : "01:31:25-01:31:26",
    "speaker" : "Mike Melo",
    "text" : "Car Shaling."
  },
  {
    "speaker" : "Greg",
    "text" : "Carl Schaling versus Roger Clements. Fucking the Yankees. Love it.",
    "timestamp" : "01:31:26-01:31:31"
  },
  {
    "speaker" : "Andy",
    "text" : "Red Sox legends. Kurt Chilling against Red Sox legends.",
    "timestamp" : "01:31:31-01:31:34"
  },
  {
    "speaker" : "Greg",
    "text" : "Denying the Yankees their fourth World Series in a row. Oh. Wow.",
    "timestamp" : "01:31:34-01:31:40"
  },
  {
    "timestamp" : "01:31:41-01:31:43",
    "text" : "Bam. Dark years.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:31:44-01:31:54",
    "text" : "So the start of one dynasty was the finish of another. I like that. Writer over here. Take notes, Michael Smith."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:31:54-01:31:57",
    "text" : "Wait, wait. You you clipped out a news news article and put that in your book?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:31:58-01:31:58"
  },
  {
    "timestamp" : "01:31:58-01:32:00",
    "speaker" : "Mike Melo",
    "text" : "About the Patriots and you just stuck in the biggest."
  },
  {
    "text" : "Yeah, I think I must have been hyped on it. It was the same day, so I was like, I gotta throw this in here. Yeah, because I hated the Yankees too.",
    "timestamp" : "01:32:00-01:32:05",
    "speaker" : "Greg"
  },
  {
    "text" : "I mean how how many Yankees sucked chance were there the Patriots uh first parade? Like all of them All right, my best and worst. Uh my best, I think I have a few years. I think I'll go with um Brady with his first ever third and short QB sneak, where they emptied the backfield and had him do the quick QB sneak. First time we ever saw it. First of many that he would always convert. Changed the game. Now has a thousand yards rushing, one yard at a time. Twenty fucking years later. The thousand yard rusher and it started there.",
    "timestamp" : "01:32:05-01:32:40",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:32:40-01:32:49",
    "text" : "Which his is average yards per rush. Because he has all the yield downs for negatives. His longest rush is like",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:32:49-01:32:50",
    "text" : "18, 19 years."
  },
  {
    "text" : "His average has got to be like one and a half.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:32:50-01:32:52"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:32:53-01:33:11",
    "text" : "It's not a lot. Um oh, also uh honorable mention was Terrell Buckley up at wide receiver. Yes. And getting a pass to him on the streak play early? Little weed off and see it go that way. But the patient's always like a wide receiver playing defensive back when you have the other."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:33:11-01:33:24",
    "text" : "Did he just do that in the Bills game? No. Do we we threw a pass of JC Jackson, right? I don't think so. I don't think so. Watching different games. Maybe I was just drunk. Yeah. Yeah."
  },
  {
    "text" : "Although I wouldn't be surprised if Gilmore does do something like that in the playoffs. Yeah. I would love to see Gilmore.",
    "timestamp" : "01:33:25-01:33:30",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:33:30-01:33:39",
    "speaker" : "Mike Melo",
    "text" : "On the on the scout team as wide receiver and like Oh yeah, they did say that because you you've been playing a lot in the big thing. I'm pretty sure they threw him a ball. Were you rating a route?"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't think so. I'll double check but so my worst um And this was probably my favorite worst of the worst this season so far, yeah. With Jermaine Wiggins. Uh he got a a tripping call. I think it was like in the second quarter somewhere. And usually when you see tripping calls, they're usually like kind of borderline, like a guy gets beaten, just kind of sticks his leg out. Jermaine Wiggins flopped on the ground and just like the guy tried to beat him, so he like flailed his legs, almost looked like a dead fish, like flopping. And like tried to just kick the guy in the junk and missed and got called for that on that play. And the next play had a false start like immediately afterwards and you didn't see him for the rest of the fucking game.",
    "timestamp" : "01:33:40-01:34:23"
  },
  {
    "text" : "This is what the rest are talking about all the the commentators are all about the flags coming out. Yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:34:24-01:34:28"
  },
  {
    "timestamp" : "01:34:28-01:34:32",
    "speaker" : "Andy",
    "text" : "Yeah. But that was like one of the few legitimate inflighting."
  },
  {
    "text" : "It was so bad. Falcons had like a first of twenty-five. It was just brutal.",
    "timestamp" : "01:34:34-01:34:37",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Oh yeah, it w it was brutal. Yeah, some of these uh sequences were real bad. Oh yeah, oh yeah, the Pages picked up 20 yards on a third and thirty to set up a field goal at one point.",
    "timestamp" : "01:34:38-01:34:48",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:34:48-01:34:52",
    "text" : "See kids, don't watch these games in the entirety. They're actually not that fun.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, yeah, yeah. If you can find highlights, do it up. Actually if you go to Paige Dynasty Info, I'll highlight you there.",
    "timestamp" : "01:34:52-01:34:58",
    "speaker" : "Andy"
  },
  {
    "text" : "I know, lucky for us that there are no highlights of each game, I don't think for the most part the majority of them so you need to listen to it.",
    "timestamp" : "01:34:58-01:35:05",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "No there are they're on the website, patrons diet info. Well the big plays All the all the highlights. Why are you doing that? Nobody needs to listen to the podcast. Well, but they do. You gotta get the context. That's true. Troy Brown's miracle catch out of nowhere.",
    "timestamp" : "01:35:06-01:35:20"
  },
  {
    "text" : "Oh, you mean the spotless snag?",
    "timestamp" : "01:35:21-01:35:23",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:35:28-01:35:32",
    "text" : "That's fair. All right, let them watch it. The cleanest clam.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, I think we beat this horse dead enough.",
    "timestamp" : "01:35:37-01:35:40"
  },
  {
    "text" : "Well I got I got one more. I got one more surprise. Alright. You already kinda blew it for me.",
    "speaker" : "Greg",
    "timestamp" : "01:35:40-01:35:45"
  },
  {
    "timestamp" : "01:35:46-01:35:47",
    "speaker" : "Andy",
    "text" : "Oh good."
  },
  {
    "speaker" : "Greg",
    "text" : "I got uh Christmas comes early.",
    "timestamp" : "01:35:47-01:35:51"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:35:51-01:35:52",
    "text" : "Ooh presents."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:35:52-01:35:54",
    "text" : "Oh what is happening here?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:35:57-01:35:57",
    "text" : "Oh no"
  },
  {
    "text" : "What?",
    "speaker" : "Steve",
    "timestamp" : "01:36:00-01:36:01"
  },
  {
    "speaker" : "Greg",
    "text" : "Now instead of just one t-shirt, we all got a t-shirt.",
    "timestamp" : "01:36:01-01:36:04"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh my god. Right of the best. Wow Wow, that is fantastic.",
    "timestamp" : "01:36:06-01:36:15"
  },
  {
    "speaker" : "Greg",
    "text" : "So I had a bit of uh issues with uh licensing I originally put one picture of like one of those cool ones that you had on the website that like you know what I'm saying? And they were like, nah, I can't use that. And then I found another one from Patriots Twitter. She's like you can't use NFL logos or anything. I was like, she's like can't use that. Who is this? It was like the people at the t-shirt cup. She was great. Shout out Adriana She was a great customer sales code.",
    "timestamp" : "01:36:15-01:36:46"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "For those who can't see, it is Bill Belichick. But no, no, he's the Pope. And he's like holding rosaries. It's fitting. It's fitting.",
    "timestamp" : "01:36:46-01:36:59"
  },
  {
    "speaker" : "Greg",
    "text" : "Wow, well thank you. Patriots dynasty logo on the front.",
    "timestamp" : "01:37:00-01:37:05"
  },
  {
    "text" : "We may have to sell both of these on the website at some point.",
    "timestamp" : "01:37:05-01:37:07",
    "speaker" : "Andy"
  },
  {
    "text" : "Wow, thank you, man. Merry Christmas, guys. I love you.",
    "timestamp" : "01:37:08-01:37:10",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:37:11-01:37:34",
    "speaker" : "Andy",
    "text" : "Merry Christmas, boys. And Merry Christmas to all our listeners. And by that I mean our mom, Mama Brown, who is standing outside watching us currently. Oh yeah. So it'll be Christmas in July. And she will uh get to relisten to all of this as she watched it happen. What is next week? Ho ho. Don't ruin anything for me."
  },
  {
    "text" : "Or the ramps when they lose the ramps?",
    "speaker" : "Greg",
    "timestamp" : "01:37:38-01:37:40"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:37:40-01:37:41",
    "text" : "No."
  },
  {
    "timestamp" : "01:37:41-01:37:42",
    "speaker" : "Greg",
    "text" : "Well we had to ruin it, correct?"
  },
  {
    "text" : "Oh I have her, yeah.",
    "timestamp" : "01:37:44-01:37:44",
    "speaker" : "Andy"
  },
  {
    "text" : "You can check your scrapbook. Oh, at home with the bills, right?",
    "speaker" : "Greg",
    "timestamp" : "01:37:45-01:37:49"
  },
  {
    "timestamp" : "01:37:49-01:37:56",
    "text" : "Correct. The one in six bills will visit Foxbro Stadium.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:37:56-01:37:58",
    "text" : "You wanna sneak peek?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:37:58-01:38:01",
    "text" : "No. We don't want a sneak peek. Don't ruin it."
  },
  {
    "timestamp" : "01:38:01-01:38:18",
    "speaker" : "Greg",
    "text" : "Yeah, I know. I like it. No, it's going fresh. I was trying to give you like uh one of these cryptic headlines, but they're all pretty uh pretty obvious. Oh, how about this? This is a good uh teaser. Many are taking hits for Johnson decision. Oh by Ron Borges."
  },
  {
    "timestamp" : "01:38:18-01:38:20",
    "speaker" : "Andy",
    "text" : "Lee Johnson? Oh, I bet that's really accurate."
  },
  {
    "timestamp" : "01:38:21-01:38:23",
    "speaker" : "Steve",
    "text" : "Oh, we didn't even talk about the punters. Ah, next time."
  },
  {
    "text" : "I had a note. Well one last note to end this on a punter note. Well I haven't puntered note as well. This is how it starts. Chris Moore, the punter of the uh Atlanta Falcons was averaging less than thirty yards a punt and I wrote Where's Lee Johnson when you need him?",
    "speaker" : "Andy",
    "timestamp" : "01:38:26-01:38:44"
  },
  {
    "timestamp" : "01:38:45-01:38:49",
    "speaker" : "Steve",
    "text" : "I know. I actually love that fucking fucking job."
  },
  {
    "timestamp" : "01:38:53-01:38:56",
    "text" : "I feel like punchers are punting the ball further now.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Oh, they are.",
    "timestamp" : "01:38:56-01:38:57",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:38:58-01:39:03",
    "speaker" : "Mike Melo",
    "text" : "They were like, oh, he's averaging like 40 yards a punt. And I was like, well, that sucks. Dude, that ponder?"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, it's good. Jay Moore. Chris Moore was there.",
    "timestamp" : "01:39:05-01:39:08"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh man, yeah, the comedian. So bad. That comedian Jay Moore is so bad at punting.",
    "timestamp" : "01:39:08-01:39:12"
  },
  {
    "text" : "Scott Chandler. Scott Chandler. All right. Merry Christmas, guys. Love you. Merry Christmas. Love you and your family and your loved ones. We'll see you in 2020. You betcha.",
    "timestamp" : "01:39:14-01:39:25",
    "speaker" : "Andy"
  }
]