[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:19"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, we'll be back for all of you who are still with us. After the bullshit we've said. For the first 11 weeks, this is week 12. of the 2001 New England Patriots season where the Pats go to travel to is it Metal Land Stadium back then? I believe so. To face the New York Jets, the 7-3 AFC East. Co-leaders, New York Jets. The Pats at six and five right behind them, tied with the Dolphins for the first in the AC East. We've kind of already talked about the Jets uh back in week two. Uh not much to talk about really other than that. So we'll just kind of give a bit of an update into how they're doing so far. Curtis Martin. There was a lot of talk about him in this game. Uh he has they talked about his success and how well he had played against Patriots and he had some quote about how he wished he could play them eight games a year. I think the Patriots would disagree because the quote was in seven reunions against the Patriots, he had gained more than a hundred yards against them five times, including a hundred and six yards in the ten to three Jets victory earlier in the season. And at this point he was right ab I think he was what did he say? It's like seventeen yards away from a thousand yard season.",
    "timestamp" : "00:21-01:47"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And that's correct.",
    "timestamp" : "01:48-01:50"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I think it was seventeen. And uh which you would get in this game, of course, because it's Curtis Martin against Patriots. And then uh that gave seven in a row, right? Yes, for his first seven seasons in a row. I mean he was one of only three guys to do it. It was Barry Sanders and someone else.",
    "timestamp" : "01:50-02:12"
  },
  {
    "timestamp" : "02:12-02:13",
    "text" : "Eric Dickerson.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:14-02:18",
    "text" : "Yes, thank you. They would even need to fact check that. Look at you guys."
  },
  {
    "text" : "Please. I mean this is.",
    "speaker" : "Mike Melo",
    "timestamp" : "02:18-02:19"
  },
  {
    "text" : "No.",
    "speaker" : "Andy",
    "timestamp" : "02:19-02:19"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "02:20-02:23",
    "text" : "Uh I've been hearing whispers because we need to tighten up our our game."
  },
  {
    "timestamp" : "02:24-02:27",
    "speaker" : "Andy",
    "text" : "But we actually have to get these stats right?"
  },
  {
    "text" : "I don't know. I don't think so.",
    "speaker" : "Mike Melo",
    "timestamp" : "02:27-02:28"
  },
  {
    "text" : "I bet to differ, but it doesn't feel right, does it? Um also I think we touched on it last time, but the Patriots have lost the last four games against the Jets now. And seven of the eight seven of the last eight meetings. So beating the Jets not something that happens often. Uh probably most of that was usually because Bill Belichick was on the other side line. In some of those other games, but not anymore. Um but he I don't believe yeah, if they'd lost the last four, he hadn't beaten the Jets. Uh up until this game. So this is his first time of him beating the Jets as the Pages head coach. Historic.",
    "speaker" : "Andy",
    "timestamp" : "02:28-03:11"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "03:11-03:13",
    "text" : "Way to give it away, Andy."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "03:13-03:16",
    "text" : "I know. You just well man"
  },
  {
    "text" : "Did you boys not watch the game? Do you not know how this is gonna end?",
    "speaker" : "Andy",
    "timestamp" : "03:18-03:21"
  },
  {
    "text" : "They don't. We gotta it we gotta we gotta build up to it, my friend.",
    "timestamp" : "03:22-03:26",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "No. Um no. My podcast, I do what I want.",
    "speaker" : "Andy",
    "timestamp" : "03:26-03:33"
  },
  {
    "text" : "That's fair. I mean I I guess we can gloss over the fact that some personnel did change in this game.",
    "timestamp" : "03:34-03:39",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, talk to me.",
    "timestamp" : "03:40-03:41"
  },
  {
    "timestamp" : "03:41-03:46",
    "speaker" : "Mike Melo",
    "text" : "Uh Santana Moss actually became a little bit more involved this time around."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:46-03:59",
    "text" : "Correct, because he had been injured up until the week before. And he caught his first catch in this game. I think it was the first quarter. It went for like yeah, of his career and it went for like thirty-three yards."
  },
  {
    "timestamp" : "03:59-04:00",
    "speaker" : "Mike Melo",
    "text" : "Yeah, catch."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:00-04:01",
    "text" : "Yeah."
  },
  {
    "timestamp" : "04:01-04:02",
    "speaker" : "Mike Melo",
    "text" : "He kept the ball."
  },
  {
    "timestamp" : "04:09-04:27",
    "text" : "Oh he probably still does, yeah. He does. Uh let's see. All right, I guess we'll just jump into the game. Um talk about the f there's a game of two halves. The first half was the Jets half, the second half was the Patriots half Um Steve, what do you think about this first half? Did you have any anything that jumped out at you?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Well to set the stage, it was fifty-three degrees in December. Sounds like global warming started early.",
    "timestamp" : "04:28-04:33"
  },
  {
    "timestamp" : "04:33-04:35",
    "speaker" : "Andy",
    "text" : "Oh yeah. You know."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Hot take.",
    "timestamp" : "04:36-04:37"
  },
  {
    "timestamp" : "04:39-04:40",
    "speaker" : "Andy",
    "text" : "Literally a hot take."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, so the Patriots Dynasty started global warming.",
    "timestamp" : "04:40-04:43"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "04:44-04:49",
    "text" : "Oh boy ma'am everyone's gonna get on our case. You've gone and done it, Steve."
  },
  {
    "text" : "So it's their fault the earth is flat too, I'm assuming.",
    "timestamp" : "04:50-04:53",
    "speaker" : "Andy"
  },
  {
    "text" : "All right, I guess we're gonna have to talk about this. What do you guys think about all this stuff? Go.",
    "timestamp" : "04:53-04:57",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Steve",
    "text" : "No. Um, I mean if you watch that first like drive, that first like ten minutes of the game where Tyla slips, gave us that touchdown, Jets were coming off the bye and one at home. Crowd was real into it. Yeah.",
    "timestamp" : "04:58-05:14"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well, are you recapping the entire game right now? I know, but man, we're blowing through material here. What do we need to talk about for the next one?",
    "timestamp" : "05:19-05:30"
  },
  {
    "timestamp" : "05:30-05:38",
    "text" : "I mean they called like a flea flicker on the second drive on the first play. Yeah, that was awesome. First play of the game, a deep shot. They were coming out flinging it.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "05:38-05:56",
    "speaker" : "Andy",
    "text" : "Yeah, because they weren't known. I mean, it's Vinny Tessavardi as a quarterback, so not exactly known for chucking the ball down the field, but I think at one point they had like eight passes to two runs or something like that. Like they were tilted heavily at least in the first like quarter, quarter and a half towards the passing game. And they were slinging it all over the place."
  },
  {
    "timestamp" : "05:56-05:58",
    "speaker" : "Mike Melo",
    "text" : "Yeah, they were bombs."
  },
  {
    "text" : "Yeah. Uh and the paths were doing a whole shit ton of numbers. I believe, yeah. That's what we decided last time. He was right around there. He's definitely 38.",
    "speaker" : "Andy",
    "timestamp" : "05:58-06:10"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I said it. So pretty impressive.",
    "timestamp" : "06:10-06:13"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "06:13-06:14",
    "speaker" : "Andy"
  },
  {
    "text" : "I mean not as impressive as 38 year old Tom Brady.",
    "timestamp" : "06:14-06:17",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, I I was looking up Testa Verde's stats. You his nineteen eighty eight season. I'm ridiculous Is it you got drafted by the Bucks when they were shitty? Oh yeah yeah. So in 15 games he had a 47% completion percentage. Whoa. Thirty two hundred yards, fifteen touchdowns, and thirty-five picks.",
    "speaker" : "Greg",
    "timestamp" : "06:17-06:44"
  },
  {
    "timestamp" : "06:47-06:53",
    "speaker" : "Mike Melo",
    "text" : "I'm not as part of every game the next year. I mean that kind of sounds like uh Jameis Winston a little bit."
  },
  {
    "text" : "Unbelievable.",
    "speaker" : "Greg",
    "timestamp" : "06:57-06:57"
  },
  {
    "timestamp" : "06:58-07:00",
    "text" : "Uh yeah, when was he drafted, Craig?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh eighty s eighty seven, so that's his second.",
    "timestamp" : "07:00-07:03"
  },
  {
    "timestamp" : "07:04-07:07",
    "text" : "What what uh what round was he drafted? Like how high was he drafted?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "07:08-07:23",
    "text" : "Remember he was a stud at Miami. Right, yeah. So he was like really highly touted coming out of school, but then he got drafted by a shitty team. So I think they just gave him like four or five years to just like You can't lose your job type of deal."
  },
  {
    "text" : "Yeah, yeah. Holy shit he was. He just drafted first overall in the 87 draft.",
    "timestamp" : "07:24-07:27",
    "speaker" : "Andy"
  },
  {
    "text" : "And then he had like a ton of he never threw for more touchdowns and picks for the Bucks. And I got slightly better when he went to the Browns. And he had like two Pro Bowl seasons in like twenty-one seasons that he played.",
    "timestamp" : "07:27-07:43",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "07:44-07:46",
    "speaker" : "Andy",
    "text" : "One with Baltimore, which I don't even remember."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "07:46-07:54",
    "text" : "Yeah, it was like career like yardage numbers or like top twenty ever. Just because he played for so long."
  },
  {
    "timestamp" : "07:55-07:56",
    "text" : "Played for the cats too.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. But yeah, he always sucked.",
    "timestamp" : "07:56-07:59",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "08:00-08:00",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "He he sucked for a long time.",
    "timestamp" : "08:01-08:03",
    "speaker" : "Greg"
  },
  {
    "text" : "I mean it's all solidly mediocre in some of these seasons, it looks like. Like three thousand thirty five hundred yards, twenty-ish touchdown. Well, all right. Seventeen ish touchdowns. I mean yeah, he just played forever.",
    "speaker" : "Andy",
    "timestamp" : "08:04-08:21"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "08:22-08:26",
    "text" : "Is he a bust as a first overall? if you played 21 years."
  },
  {
    "timestamp" : "08:26-08:29",
    "speaker" : "Andy",
    "text" : "No. Anybody that played 21 years can't be a bust."
  },
  {
    "timestamp" : "08:29-08:33",
    "speaker" : "Greg",
    "text" : "Yeah, but he's never like he's never been good."
  },
  {
    "timestamp" : "08:33-08:37",
    "speaker" : "Andy",
    "text" : "He's a two-time pro bowler, thank you very much. Never been good."
  },
  {
    "timestamp" : "08:38-08:40",
    "speaker" : "Greg",
    "text" : "Yeah, I don't know bust."
  },
  {
    "text" : "He's a bust. He's like Jameis Winston.",
    "timestamp" : "08:41-08:43",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "08:44-09:01",
    "text" : "Dude. That's what I'm saying. Minus the crab stealing. I know, I don't know. We didn't have social media back then. I'm a big uh Tessa Verde fan, FYI. Why is that? He's just the man."
  },
  {
    "text" : "So I had a question.",
    "speaker" : "Andy",
    "timestamp" : "09:01-09:02"
  },
  {
    "speaker" : "Greg",
    "text" : "That's a hot take, Mike.",
    "timestamp" : "09:03-09:04"
  },
  {
    "timestamp" : "09:06-09:17",
    "text" : "I don't know where else to go with it. Of course he sucks So can any of you spell his name without looking? Because I try it every time and I get it wrong every time.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That's because you want to finish. Test a green.",
    "timestamp" : "09:18-09:21"
  },
  {
    "text" : "Ooh, that's a good way to uh remember that. So what does test us stand for?",
    "timestamp" : "09:22-09:26",
    "speaker" : "Andy"
  },
  {
    "text" : "Ooh, stat check.",
    "timestamp" : "09:27-09:29",
    "speaker" : "Greg"
  },
  {
    "text" : "I thought you were gonna make something up about testicles, but alright. Yeah, check that stat.",
    "speaker" : "Andy",
    "timestamp" : "09:30-09:34"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh boy. Oh okay.",
    "timestamp" : "09:34-09:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, so at least checking that. Uh let's talk about Greenhead. Greenhead?",
    "timestamp" : "09:36-09:43"
  },
  {
    "timestamp" : "09:43-09:47",
    "speaker" : "Greg",
    "text" : "It's head. So Testa Verde is Greenhead. Any place where J"
  },
  {
    "timestamp" : "09:50-09:53",
    "text" : "Look at this. It's serendipity. That's what that is, right Mike?",
    "speaker" : "Andy"
  },
  {
    "text" : "Breaking new ground.",
    "timestamp" : "09:54-09:55",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "09:55-10:03",
    "speaker" : "Andy",
    "text" : "I'm just I'm baffled by all of this, but I'm all that that right there is is something nobody's ever said about Vinny Testa Verde, I think."
  },
  {
    "speaker" : "Greg",
    "text" : "Italian, not Spanish.",
    "timestamp" : "10:04-10:06"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh boy. This is going downhill quickly. It's something kind of like this first half did. Uh it went downhill very quickly because the uh Jets defensive ends were basically doing whatever the fuck they wanted. And there was a lot of talk about seven total yards. Yeah, in the in the half. And uh there was a lot of talk about how let's see how Brady does um when he has the same sort of issues that Drew Bledsoe has. Talking about no offensive line, no time to throw it, no running game, which was basically this game.",
    "timestamp" : "10:09-10:51"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, I thought that was interesting too, because um, I mean, we've seen shades of it. This you know, and during the season that Brady kind of like had a shitty game or whatever because of maybe a little bit of pressure. This one was definitely the first one I think that every player was just he was getting hammered. Uh yeah. So obviously they changed it up. I mean the announcers were even talking about how uh Weiss was changing up the game plan so that they were kind of doing the dinking and dunking, the slants, the like screens. Um that sort of thing. Do you think, because I don't remember Bletto ever really doing that, and I know he's not a finesse passer anyway, but do you think that Bletto would have been successful in that type of system?",
    "timestamp" : "10:52-11:34"
  },
  {
    "speaker" : "Andy",
    "text" : "That's a good question. Uh it never really seemed to be the strength of Bloodsoe's game. I can still picture at least a few plays that I may have made up in my mind or that actually happened. Where he would uh overthrow a guy in the flat or overthrow a uh a screenplay just because he doesn't really have touch. He's more of a gun it down the field sort of guy. So But I don't know if that was just, you know, the offense was was tailored to that and so he was more uh",
    "timestamp" : "11:34-12:11"
  },
  {
    "timestamp" : "12:12-12:19",
    "speaker" : "Mike Melo",
    "text" : "You laughing at the background noise? Yeah. Again, uh living in LA, baby."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:20-12:46",
    "text" : "Highway right next next door. That'll get cut. Um Yeah, so I don't I don't know if like the they tailored a down the field offense because of true blood so and his strength was chucked it down the field or If they that's just how they did it, so he played that game and like didn't have the opportunity to to do more short stuff, but I don't know."
  },
  {
    "text" : "I don't think he had the decision making either.",
    "speaker" : "Greg",
    "timestamp" : "12:46-12:49"
  },
  {
    "timestamp" : "12:50-12:58",
    "speaker" : "Andy",
    "text" : "Yeah, he he didn't seem that quick and that was always the the knock on him, was that He would pat the ball three times and get sacked, right? Wasn't that his MO?"
  },
  {
    "timestamp" : "12:59-13:05",
    "speaker" : "Greg",
    "text" : "He'd be like in someone's arms and he'd just like throw the ball up. Right. Like not true. Give up on a play."
  },
  {
    "timestamp" : "13:05-13:22",
    "speaker" : "Mike Melo",
    "text" : "Like you can't read the defense and like, what is it, like three steps? Yeah. Right. So yeah, I guess that makes sense. I mean I guess he he was like the starting quarterback for a long enough time that he probably would have come across a couple of screams or some some short stuff."
  },
  {
    "text" : "It's true. And I I feel like we kind of shit on Bledsoe a lot. So I will say that I think well you do too. You just you literally just did. But I think that uh I think that that part of it also made him like successful too for a long time because he kind of was for a long time. the only thing that the Patriots had. And so we did have that drive to always try to finish a play, I guess, for lack of a better way of putting it. Um which something happened. Yeah, and I think it always like that. He he would try that in every play because he was kind of so maybe overwhelmed because he had no protection, he had no weapons, he had no anything. It was like just him. You think?",
    "timestamp" : "13:22-14:21",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, you give him weapons and a good coach, he'll play great.",
    "timestamp" : "14:21-14:24"
  },
  {
    "speaker" : "Andy",
    "text" : "Hmm. I yeah, I don't know if it it's that big of a swing. I think Drew Bledsoe had enough talent that he could still pull himself through some games, but I think he had that mentality of always having to try and make something happen that it kind of led to a lot of bad decisions.",
    "timestamp" : "14:28-14:47"
  },
  {
    "text" : "I think is what can't help too. Don't you think? Goth is a gunslinger, you know? I guess. I mean would you say that Bledsoe's a little like tougher than Goth?",
    "timestamp" : "14:47-14:57",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I feel like Bledsoe would at least stand in there and take it.",
    "timestamp" : "14:57-15:01"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "15:02-15:03",
    "text" : "Yeah, I think."
  },
  {
    "speaker" : "Andy",
    "text" : "And I don't think you ever really see Bledso get as confused as Goff does. Like Goff in that Super Bowl against the Patriots, he had no idea what was going on. I don't know if that's just because like that's how he was coached and the coaching let him down or If he's just not a good decision maker. But Bledso, I mean, he would make stupid decisions, but he would also perform kind of on his own too, you know?",
    "timestamp" : "15:03-15:28"
  },
  {
    "text" : "Well, I was just wondering, does he hold the ball long enough to come off as not knowing what's going on? Because I mean he'd throw a pick before he analyzed it. So maybe uh maybe Goff just looks it because he might hold the ball on a little longer. Uh I'm not sure. I mean like you guys said, he did he do the uh interception over his head toss once again.",
    "speaker" : "Mike Melo",
    "timestamp" : "15:29-15:53"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I mean what did I call him?",
    "timestamp" : "15:53-15:55"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Butt clench blood so much.",
    "timestamp" : "15:55-15:58"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because every time he draws back on third down, you just like tighten up just reflexively.",
    "timestamp" : "15:58-16:04"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "16:06-16:14",
    "text" : "He he is a nice man, okay? And I think he makes good wine. I haven't tried it yet, but the word on the street is he makes good wine, he's a nice man."
  },
  {
    "text" : "Maybe we should do an episode. Where we all order a bottle of wine, drink it before we do the episode, and we'll do a review of wine.",
    "speaker" : "Andy",
    "timestamp" : "16:15-16:26"
  },
  {
    "text" : "I got the perfect game. I'm doing the Cabernet his first his first game when he plays for the Bills. That's good idea.",
    "speaker" : "Steve",
    "timestamp" : "16:27-16:35"
  },
  {
    "timestamp" : "16:35-16:36",
    "text" : "That's a hell of an idea.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "16:38-16:41",
    "speaker" : "Andy",
    "text" : "I mean I I think we yeah, I think that's a pretty good idea."
  },
  {
    "timestamp" : "16:41-16:49",
    "speaker" : "Mike Melo",
    "text" : "Alright, so we'll put that in the in the You guys actually have to drink though, because I'm gonna commit and I don't want to come off stupid on here. God forbid."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:49-17:00",
    "text" : "God forbid. You got a reputation uphold. No comment. I got bad news. What's the bad news?"
  },
  {
    "timestamp" : "17:00-17:05",
    "speaker" : "Greg",
    "text" : "It's like a hundred dollars a hundred dollars a bottle. Andy. Andy."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "By that point the ratings are gonna be uh coming in. So yeah",
    "timestamp" : "17:07-17:11"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:11-17:17",
    "text" : "Uh we may have to start a Patreon to get some uh or maybe a GoFundMe to see what people donate to us."
  },
  {
    "speaker" : "Greg",
    "text" : "It's a hundred dollars a bottle? I'm fine. I'm gonna see if the what the cheapest one is. I mean that that's a problem for me.",
    "timestamp" : "17:17-17:25"
  },
  {
    "text" : "But I mean we are podcasters. We're not made of money here.",
    "timestamp" : "17:26-17:29",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "17:30-17:34",
    "speaker" : "Steve",
    "text" : "Let's be real. By the time we get to that Bills game, we're all gonna be rich and famous, so whatever."
  },
  {
    "timestamp" : "17:34-17:57",
    "speaker" : "Andy",
    "text" : "That's the idea. Yeah. I do like this idea though. All right, all right, here we go. Here we go. What we're gonna do is we're going to crowdfund this via the Bill's Mafia. Cause if anybody one likes to raise money and two likes to drink, it's the Bills Mafia. That's true. So this does seem like a good cause. So we'll have to see if we can reach out to them."
  },
  {
    "timestamp" : "17:57-18:09",
    "text" : "Yeah, so listen to this. I'm on his website here. The president and director of winemaking, it says is Josh McDaniels.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "The Josh McDaniels? I don't know. It's a crazy coincidence. How many are there out there? Because Josh McDaniels is was part of the team here, wasn't he? What was he doing? He's like offensive assistant. Yeah, wasn't he well didn't he start the QB coach? Do I have that wrong?",
    "timestamp" : "18:10-18:30"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh boy, we gotta stab check this.",
    "timestamp" : "18:30-18:32"
  },
  {
    "timestamp" : "18:32-18:47",
    "speaker" : "Andy",
    "text" : "2001 is a personnel assistant. And then a defensive coaching assistant working with defensive backs. And then he was oh in 2004 he became team's quarterback coach. So I was off for a little bit. But yeah, he was on the team in 2001. This is his first season."
  },
  {
    "timestamp" : "18:47-18:51",
    "speaker" : "Steve",
    "text" : "I mean with such a unique name like that it can't be a different person."
  },
  {
    "speaker" : "Andy",
    "text" : "I mean and and they do have that overlap, you would think it's the same.",
    "timestamp" : "18:51-18:54"
  },
  {
    "timestamp" : "18:54-18:56",
    "speaker" : "Greg",
    "text" : "It's a different person."
  },
  {
    "timestamp" : "18:56-18:57",
    "speaker" : "Andy",
    "text" : "No."
  },
  {
    "text" : "Born and raised in Walla Walla and at an early age fell in love with the wine industry. Washington State with blood set.",
    "speaker" : "Greg",
    "timestamp" : "19:00-19:10"
  },
  {
    "text" : "What are the odds of that?",
    "speaker" : "Andy",
    "timestamp" : "19:10-19:12"
  },
  {
    "text" : "That's hilarious.",
    "timestamp" : "19:13-19:14",
    "speaker" : "Greg"
  },
  {
    "text" : "It's a beautiful So Drew Gledsoe knows in his work with two separate Josh McDaniels.",
    "speaker" : "Andy",
    "timestamp" : "19:14-19:20"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah",
    "timestamp" : "19:20-19:21"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:22-19:22",
    "text" : "Wow."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And it worked out for him two times.",
    "timestamp" : "19:23-19:27"
  },
  {
    "text" : "I'm on his LinkedIn. I'm gonna drop him a live.",
    "timestamp" : "19:30-19:33",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "19:34-19:40",
    "speaker" : "Andy",
    "text" : "Yeah, see yeah, see if we can get some bottles donated, Greg. I'm connecting with them. All right."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, I mean the review will go a long way for them. So I think they should what is it, four bottles, four hundred bucks? It's not bad.",
    "timestamp" : "19:40-19:48"
  },
  {
    "speaker" : "Andy",
    "text" : "We have tens of listeners too.",
    "timestamp" : "19:49-19:50"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah.",
    "timestamp" : "19:51-19:51"
  },
  {
    "text" : "I mean We have twenties of listeners.",
    "speaker" : "Andy",
    "timestamp" : "19:51-19:54"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Dude, by the time this one gets released, we might have like All right, all right, all right.",
    "timestamp" : "19:55-19:59"
  },
  {
    "text" : "So here's the issue. I just went to how manyofme. com, which you can search for people with uh your first and last name. Oh, I've done this. There are a lot of Andrew Browns, just gonna, you know, spoiler alert. Um, there are 38,075 people in the United States with a first name Josh. There are 8,477 people last name McDaniels. There is one person. There is one person in the United States named Josh McDaniels, according to this website.",
    "speaker" : "Andy",
    "timestamp" : "19:59-20:28"
  },
  {
    "text" : "This is bullshit because we just determined that there's two of them. Yeah. Oh, oh, holy shit, wait a minute. What if Joshua Daniels from the Patriots is lying about his identity on the website? Maybe he changed his name when he got married.",
    "timestamp" : "20:28-20:43",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "20:44-20:44",
    "text" : "Maybe too much.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "20:45-20:54",
    "text" : "I wasn't watching that. Maybe he's embarrassed to deal with um I don't know man. I'm now I'm confused. So I'm just gonna step away from this conversation.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "20:54-21:01",
    "text" : "So are are we thinking that there aren't uh four thousand five hundred and sixty five Andrew Browns in the United States?",
    "speaker" : "Andy"
  },
  {
    "text" : "There's definitely way more way more. One just didn't you say there's three thousand McDaniels?",
    "speaker" : "Mike Melo",
    "timestamp" : "21:01-21:08"
  },
  {
    "timestamp" : "21:09-21:11",
    "speaker" : "Andy",
    "text" : "Uh eight thousand McDaniels."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "21:12-21:24",
    "text" : "Do you know how many people are in the United States? Yeah. Lots. Thank you. Yeah, Greg is right. How many? So three hundred plus million."
  },
  {
    "timestamp" : "21:24-21:25",
    "speaker" : "Steve",
    "text" : "Yeah, all right."
  },
  {
    "timestamp" : "21:25-21:28",
    "text" : "So I don't know. I have my doubts about this website.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "21:28-21:32",
    "speaker" : "Steve",
    "text" : "I think uh the real question is though what is there more? Andy, Greg, or Steve Brown's?"
  },
  {
    "speaker" : "Greg",
    "text" : "There's a kid the grade below me. Gregory D. Brown.",
    "timestamp" : "21:36-21:41"
  },
  {
    "speaker" : "Andy",
    "text" : "No shit.",
    "timestamp" : "21:41-21:42"
  },
  {
    "timestamp" : "21:42-21:44",
    "speaker" : "Greg",
    "text" : "Yeah. Or Facebook Friends."
  },
  {
    "text" : "He's kind of a loser. Do you wanna do you wanna put it out there and like reach out to him? Like do you have some beef or something that you wanna squash and put it out there right now No. All right.",
    "timestamp" : "21:44-21:56",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "So I uh I set up a Google news alert for my name. Because you can do that, you can just set up for any search term. And so every week I get a list of all the Andrew Browns in the news. There is a defensive lineman for the Bengals, who's probably the most famous other than me. Have we done it?",
    "speaker" : "Andy",
    "timestamp" : "21:57-22:14"
  },
  {
    "text" : "Have we? Yeah, and Steve the Yo-Yo guy",
    "timestamp" : "22:15-22:19",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh well we definitely were looking up we were Googling your name and remember I found a lot of murderers and a lot of other stuff uh named Andy Brown. Yeah, Andy Brown's so we can't go off of that.",
    "timestamp" : "22:19-22:33",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "22:33-22:38",
    "speaker" : "Andy",
    "text" : "I think there's a lot of southern Andy Browns that uh in trouble with the law."
  },
  {
    "text" : "What I'm fascinated by is why do you have a Google alert on your name?",
    "speaker" : "Mike Melo",
    "timestamp" : "22:39-22:43"
  },
  {
    "text" : "Uh because I want to see how Google alerts worked. And I thought it'd be funny to because I've heard of people with like actual interesting names do it. I'm like, oh what'll show up on me? And so there's a park named after me in Texas that I want to go visit. I learned things from it. So I I think it was a good investment.",
    "speaker" : "Andy",
    "timestamp" : "22:44-23:00"
  },
  {
    "text" : "I I have to say I haven't I haven't met a lot of uh Mike Mellows, but I'll keep an eye out.",
    "timestamp" : "23:03-23:07",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Uh when I worked that movie scene I put a flag on every single Steve Brown's account and said, I live down street, call me if he comes in. And I'm working and Steve Brown came in to write a movie. He was like 45 years old. Strange, but we had a nice chat about nicknames.",
    "speaker" : "Steve",
    "timestamp" : "23:08-23:24"
  },
  {
    "timestamp" : "23:25-23:25",
    "speaker" : "Andy",
    "text" : "Oh boy."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I'm missing all of these interactions. I gotta get a better name, I guess.",
    "timestamp" : "23:27-23:31"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, the brown and the brown really gives you a head start as the last name.",
    "timestamp" : "23:31-23:36"
  },
  {
    "text" : "All right, so I s I uh Josh uh LinkedIn request. I said big fan of the wine. Let's connect.",
    "speaker" : "Greg",
    "timestamp" : "23:37-23:47"
  },
  {
    "timestamp" : "23:48-23:53",
    "text" : "Oh, that's good. Yeah, I don't want to you know No, yeah, d doing the slow play, I like that.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I wanna spook them, I want it clearly.",
    "timestamp" : "23:53-23:55"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:55-23:58",
    "text" : "So wait D do you have the podcast in your LinkedIn though?"
  },
  {
    "text" : "Nah.",
    "speaker" : "Greg",
    "timestamp" : "23:59-23:59"
  },
  {
    "text" : "Okay, so we can't you can't track back. Of course not. By the time this episode comes out, that's gonna be the only thing on my LinkedIn. Probably because I'll have been fired from my real job for r spending so much time doing this.",
    "timestamp" : "23:59-24:12",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh dude. Oh, don't admit that. Don't admit that.",
    "timestamp" : "24:12-24:15"
  },
  {
    "text" : "No. I'm logged in under Kelly's Oh That'll be interesting.",
    "timestamp" : "24:16-24:23",
    "speaker" : "Greg"
  },
  {
    "text" : "Hey that's probably better. That might yeah, that might work.",
    "speaker" : "Mike Melo",
    "timestamp" : "24:24-24:26"
  },
  {
    "speaker" : "Greg",
    "text" : "Alright, I'll report back next week. Oops.",
    "timestamp" : "24:27-24:32"
  },
  {
    "timestamp" : "24:36-24:38",
    "speaker" : "Steve",
    "text" : "Regularly on Kelly's LinkedIn."
  },
  {
    "speaker" : "Greg",
    "text" : "I have to use the computer because mine will log into Zoom. Oh, that's right. All it was all logged in.",
    "timestamp" : "24:39-24:46"
  },
  {
    "text" : "Oh boy.",
    "timestamp" : "24:47-24:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "It's a happy accident.",
    "timestamp" : "24:48-24:49"
  },
  {
    "text" : "Uh yeah, I I think that'll work out for the best for everybody involved, including Kelly. We'll give her some of the wine if if we get some.",
    "timestamp" : "24:50-24:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "24:57-24:57",
    "text" : "Yeah."
  },
  {
    "text" : "All right. Alright. So speaking of uh the Jets football game. First first half bad, second half good. So the Pats go into the half down 13-0. And what'd you say, Steve? They had sixty something yards of total offense? Yeah, so not a lot.",
    "speaker" : "Andy",
    "timestamp" : "24:57-25:19"
  },
  {
    "timestamp" : "25:19-25:49",
    "speaker" : "Mike Melo",
    "text" : "But the uh to be fair though, the defense did all o okay against the Jets. I mean, considering they were slinging it and they had some momentum early on. Like um they uh you know, sometime before the half, I think it was in the first quarter, they had a goal line stand. So it could have been they could have been down two touchdowns real quick. And uh They they stuffed the offense at the one. So that made it what? They were down by ten. So that was pretty impressive."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that was the first quarter, yeah.",
    "timestamp" : "25:49-25:51"
  },
  {
    "text" : "And uh Teddy Bruski came in with the stop in the final one.",
    "timestamp" : "25:51-25:54",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Oh man. Yeah, uh, yeah, him and Brian Cox. Uh it was Curtis Martin tried to jump over the pile and just hit a brick wall of the two of them. It's beautiful.",
    "timestamp" : "25:54-26:05",
    "speaker" : "Andy"
  },
  {
    "text" : "That's a huge bite.",
    "speaker" : "Greg",
    "timestamp" : "26:06-26:07"
  },
  {
    "timestamp" : "26:07-26:25",
    "text" : "Yeah, and yeah, this was uh Brian Cox's first game back from when he broke his leg in Denver. Yep. Five weeks ago. Uh he recovered from a broken leg quicker than uh Terry Glenn recovered from his uh quote unquote hamstring injury.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:25-26:29",
    "text" : "Yeah, man, hamstrings are tough, man. I guess."
  },
  {
    "timestamp" : "26:33-26:35",
    "speaker" : "Andy",
    "text" : "What was your sneaky surprise of the season?"
  },
  {
    "text" : "Brian Cox. Yes. Awesome dude. The way he plays, he's just a monster.",
    "speaker" : "Greg",
    "timestamp" : "26:36-26:43"
  },
  {
    "text" : "Yeah, he was uh He was screaming at the refs for something. I don't even remember what it was.",
    "timestamp" : "26:43-26:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "26:49-26:57",
    "text" : "I haven't done it on it. It was like on the field goal attempt. Yeah. The Jets were off size or fall key. Yes."
  },
  {
    "text" : "He was livid. Yeah, he had to get pulled away from the referee so he wouldn't get another 15 yard on sportsman like conduct. The Oh yeah. Like literally dragged away.",
    "timestamp" : "27:00-27:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "27:11-27:12",
    "text" : "Yeah. That was great."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "27:13-27:13",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "27:13-27:16",
    "text" : "Only imagine if she is mic'd up. That'd be amazing."
  },
  {
    "timestamp" : "27:16-27:49",
    "text" : "Oh man. Well, uh I posted a link to the NFL primetime uh highlight video, mainly for Greg, because he never watches the game. Um but at the end of it they had an interview with him uh and he was basically saying, Yeah, we actually played like shit, but uh we still beat the Jets, so Uh it'll be nice if uh you know we can it's nice that we can still like not play very good and and beat a team like this. So I'm excited for when we actually play good. And that was the whole interview.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Is that word for word?",
    "timestamp" : "27:50-27:52"
  },
  {
    "timestamp" : "27:53-27:55",
    "speaker" : "Andy",
    "text" : "Uh yeah, I'm pretty sure that was verbatim."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "27:55-28:04",
    "text" : "Oh boy. It wasn't, but my favorite quote of that was because it was uh Chris Berman Obviously prime time."
  },
  {
    "timestamp" : "28:04-28:04",
    "speaker" : "Andy",
    "text" : "Oh yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Like there was a point where the pass receiver Coleman caught it and he got tackled by Coleman. And he's like so many I haven't seen this many Coleman since LL Beam put a sail on those little bots.",
    "timestamp" : "28:05-28:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Almost little like grill things. It wasn't as as smooth as lime, but he got there.",
    "timestamp" : "28:20-28:25"
  },
  {
    "text" : "Oh my god, it was so fucking funny.",
    "timestamp" : "28:25-28:27",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "So badly.",
    "timestamp" : "28:30-28:31"
  },
  {
    "speaker" : "Steve",
    "text" : "Um so that was real quick first ever catch he had two whole career. Yeah, we are his entire career? Yeah, his entire NFL career. Holy crap.",
    "timestamp" : "28:32-28:46"
  },
  {
    "text" : "Now it was one of them. That was a big catch. Yeah, I didn't recognize him.",
    "timestamp" : "28:46-28:49",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "28:49-28:50",
    "speaker" : "Steve"
  },
  {
    "text" : "Nope.",
    "timestamp" : "28:50-28:50",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "28:51-28:57",
    "speaker" : "Steve",
    "text" : "So it was like what to open the second half, they're kind of they got a couple first downs and then they hit him for like a forty five yard all the way down."
  },
  {
    "text" : "So that's their first touch. Yeah, so this is the beginning of the the half. Pass got the ball. And went backwards immediately. I think it was like a run got stuffed and then Brady got sacked and they went three and out. And they punted. Uh the punting in this game was horrendous. And so Ken Walter managed to punt it to his own 35. So Jets got the ball at the New England 35, and then Vrabel picks off the batted ball a couple plays later. Oh yeah. And then there was that big play to Coleman, his one of two ever catches, um, which goes for like thirty-five yards.",
    "timestamp" : "28:57-29:34",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:35-29:40",
    "speaker" : "Mike Melo",
    "text" : "The Pats, I think, like punted like six or seven straight times before they did anything."
  },
  {
    "timestamp" : "29:40-29:51",
    "speaker" : "Andy",
    "text" : "Uh yes, let's see. One, two, three, four, five. I think there were six at least. Yeah. Yeah, so they they punted on all five. Most of them suck."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "29:52-30:13",
    "text" : "One of them though went to the one yard line, so that was helpful, I think. Can we talk about Tom Tup, Mike? We touched on that? Dude, no, but um we could do a whole like thing on him because the the year before, um there's all kinds of stuff that ties into the dynasty, but that's for another day. Well Tom Tupa."
  },
  {
    "speaker" : "Andy",
    "text" : "Maybe we'll do a punter episode just for Mike.",
    "timestamp" : "30:14-30:18"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Alright, because I don't know if like Greg remembers anything about Tom Tupac, but uh Um there there was a game against the Pats like before this season where he came in as a quarterback. He was lighting it up. And uh there's a lot of things that are tied into that guy in that game the year prior.",
    "timestamp" : "30:18-30:32"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:32-30:35",
    "text" : "So yeah, the game when Vinny got hurt."
  },
  {
    "text" : "Right. Yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "30:35-30:36"
  },
  {
    "text" : "And he threw a touchdown to Keyshawn Johnson.",
    "timestamp" : "30:36-30:39",
    "speaker" : "Greg"
  },
  {
    "text" : "Yes. He is also uh when he was a member of the Browns, Bill Belichick's Browns, he was the first ever player to score a two-point conversion.",
    "timestamp" : "30:39-30:48",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "30:49-30:50",
    "speaker" : "Mike Melo",
    "text" : "Oh no shit. That's awesome."
  },
  {
    "text" : "It was on a like a fake field goal attempt and he was the holder.",
    "speaker" : "Andy",
    "timestamp" : "30:51-30:54"
  },
  {
    "text" : "For those that that don't know, he's a he's a quarterback punter combo.",
    "speaker" : "Greg",
    "timestamp" : "30:54-30:59"
  },
  {
    "text" : "He was drafted by I believe the Cardinals as a quarterback. And then they converted they converted maybe he punted in college, so they eventually converted him to punter.",
    "timestamp" : "31:00-31:09",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:09-31:11",
    "speaker" : "Greg",
    "text" : "Yeah, he was an all American punter in college."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, as well as a starting quarterback.",
    "timestamp" : "31:11-31:13"
  },
  {
    "timestamp" : "31:13-31:41",
    "speaker" : "Greg",
    "text" : "And get this, as a child, he was obviously the punt passing kick. semifinals three times. No. Yeah. Oh dude, I remember that. That was awesome. I mean awesome, right? He's a quarterback and a kicker, he's gonna be fucking winning. Pun pass and kick. Should fucking hope so. That's awesome. Yeah, good for him. Yeah. It's great. Save the Ross for spot, right?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:41-31:41",
    "text" : "Absolutely."
  },
  {
    "text" : "Oh, hell yeah.",
    "timestamp" : "31:42-31:42",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Emergency quarterback.",
    "timestamp" : "31:43-31:44"
  },
  {
    "timestamp" : "31:44-32:09",
    "text" : "Yep. Um before we go uh too far into the second half, I just wanted to say that um there there were a couple of like drives that Brady like struggled with. One, he got like blasted by my Mo Lewis And like a thought like came across my mind where I'm like, what if he just happened to go through what Bletto went through and then he just lost his job and we never hear anything again?",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "32:09-32:24",
    "speaker" : "Andy",
    "text" : "I actually wrote down that um my note from Mo Lewis was that he was uh trying to kill both of the Patriots quarterbacks because he Although on that play, like it looked really bad in real time, but then you could see actually eased up at the end of that that hit."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh really? I missed that part.",
    "timestamp" : "32:25-32:26"
  },
  {
    "text" : "Yeah, just just just barely, but I think he May have had something on his conscience about almost killing the blessing. No. We've seen a few that probably should have been where Brady will slide uh and still get lit up.",
    "speaker" : "Andy",
    "timestamp" : "32:26-32:47"
  },
  {
    "timestamp" : "32:47-32:47",
    "speaker" : "Mike Melo",
    "text" : "Right."
  },
  {
    "speaker" : "Andy",
    "text" : "Like a a helmet to the face mask sort of thing. But yeah, no, I don't think we've seen one yet that I can remember.",
    "timestamp" : "32:48-32:53"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well, and then the other thing that like stuck out to me in the first half was um So Brady had a fumble that was actually incomplete, right? So his his arm is moving forward. The announcers freaking out that it's called the open hand rule. And they were debating on if it was a you know an incomplete, if it was a fumble. Then literally the same drive, Brady fumbles, um, his hands are moving backwards. It might have been the next play. And uh I thought it was pretty funny because it seemed like the fr based on what the announcers were talking about, it wasn't like a familiar thing already as it stood. So I thought it was like pretty good foreshadowing for later in the season.",
    "timestamp" : "32:53-33:35"
  },
  {
    "text" : "Yeah, no kidding. Um yeah, but I I I actually had a note on that too because it was right at the end of the half. So the Patriots the ball with like two minutes left. And that obvious it was an obvious forward pass. Um and like even in real time you could tell it was a forward pass. But the Jets challenged it anyway and lost their last timeout. And so then the Patriots ran the clock down to like 30 seconds before they punted it. And so the Jets got the ball back with what 29 seconds I have. And so instead of being able to like take a couple shots to get within field goal range, which at this point probably would have been the game winning field goal. They have to try Hail Mary, which they tried the Hail Mary and that was probably the most one of the most bizarre plays we've seen this season. Because Vinnie Testaverdi gets strip sacked, Curtis Martin recovers it and runs for like twenty-thirty yards, gets like inside the the red zone before getting tackled.",
    "timestamp" : "33:35-34:35",
    "speaker" : "Andy"
  },
  {
    "text" : "Dude, I can't believe that he didn't try to lateral that.",
    "timestamp" : "34:35-34:38",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "34:38-34:42",
    "speaker" : "Andy",
    "text" : "Yeah, it it did feel a little bit like the beginning of the Miami Miracle to me."
  },
  {
    "text" : "Oh, the announcers thought he was going all the way.",
    "speaker" : "Steve",
    "timestamp" : "34:43-34:45"
  },
  {
    "text" : "They were so excited. Well, he broke a couple tackles and you're like, uh oh, uh-oh.",
    "timestamp" : "34:45-34:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Dude The announcers though, man, Brent Jones, we already have a history with that guy, but did he not seem like he was jacked up for this game? Like something was off. I every statement he he had was like a hyperbole, he was like losing his mind.",
    "timestamp" : "34:49-35:02"
  },
  {
    "timestamp" : "35:03-35:10",
    "speaker" : "Andy",
    "text" : "So I'm a little self-conscious about talking about commentators, but since you brought them up, I have I have some things here."
  },
  {
    "timestamp" : "35:11-35:13",
    "speaker" : "Mike Melo",
    "text" : "Um do they take into the things that I have?"
  },
  {
    "speaker" : "Andy",
    "text" : "No, probably not. I don't listen to the game the way you listen to the game. Um Brent Jones, the beginning of the game. And I quote The Jets are just as explosive as the Rams on offense.",
    "timestamp" : "35:14-35:29"
  },
  {
    "timestamp" : "35:29-35:32",
    "speaker" : "Mike Melo",
    "text" : "I mean they for the for a drive and a half."
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly. For the first two drives when they actually decide to throw the ball. It's like, well, they have speed on the outside with these little receivers and they have Curtis Martin to keep you on. And so I'm like, it's not quite the same, Brent, but okay. And then um they went to game break with um Oh, what's his name that they always go to the game break to? They go to New York. Kurt? No. Oh, I can't remember. Um but the the game break was a Colts game, and I guess Uh Peyton Manning must be throwing a lot of interceptions this year because they showed I guess it's against the Ravens and they showed the Ravens score a touchdown. And then right at the end they slipped in the line of uh and Manning has not been picked off to this point. And it was like halfway through the first quarter.",
    "timestamp" : "35:33-36:23"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, I think he throws a bunch.",
    "timestamp" : "36:23-36:25"
  },
  {
    "text" : "Like there was a game where he had thrown like four.",
    "timestamp" : "36:25-36:27",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "36:27-36:27",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:28-36:33",
    "speaker" : "Mike Melo",
    "text" : "Yeah, I thought when when you mentioned that I thought that they meant all year, but they were talking about that game."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "36:33-36:34"
  },
  {
    "text" : "Oh okay.",
    "timestamp" : "36:34-36:34",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "36:35-36:37",
    "text" : "Yeah. And it was early in the first quarter.",
    "speaker" : "Andy"
  },
  {
    "text" : "Andy, I got a stat check for ya. All right.",
    "timestamp" : "36:37-36:40",
    "speaker" : "Greg"
  },
  {
    "text" : "with the seventeenth ranked offense in the oh wow that's a good good call there pretty explosive Rams play how many uh Patriots were sixth oh by points scored",
    "timestamp" : "36:48-37:02",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "37:02-37:04",
    "speaker" : "Andy",
    "text" : "Okay. What about by yards gained?"
  },
  {
    "text" : "Uh let me uh think it's that guy here. Jets were 24th.",
    "timestamp" : "37:05-37:13",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "37:17-37:22",
    "speaker" : "Andy",
    "text" : "Well okay. So that that that didn't help Brent's argument at all either."
  },
  {
    "timestamp" : "37:22-37:48",
    "text" : "Um I will say though to Brent's defense, this is the first game that I've actually been more annoyed with Gus Johnson. Really? Uh yeah I mean his fake laugh was driving me nuts. It was he's doing the Like the whole game. It was that and I don't know if it was because Brent is just insane and he's just sick of him or if because Gus has nothing else to add. But that I mean my guess is that irritating.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "37:48-37:56",
    "speaker" : "Andy",
    "text" : "Brent Jones was getting riled up and and Gus Johnson didn't want to get smacked around up there. They're together in a booth, so you gotta kinda like"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Did you hear the little like little thing that they got into where it showed like um Santa Claus and like a kid on his lap? And then Brent goes, uh, Gus, maybe if you get married, you could have a uh son sitting on Santa's lap. And he's like, I hope so And then Brent is like, I hope you get married you hope you get married or you hope you have a son. And then there's like silence, it was super awkward. And then Gus goes, you're putting me on a tough sp uh spot here, buddy. And then he went back to the game. But that laugh was driving me nuts. It was because he wanted to sit on Santa's lap.",
    "timestamp" : "37:56-38:29"
  },
  {
    "text" : "That's what he was hoping for.",
    "timestamp" : "38:29-38:30",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "38:30-38:32",
    "speaker" : "Mike Melo",
    "text" : "And ask for what?"
  },
  {
    "text" : "A sun, I don't know.",
    "speaker" : "Andy",
    "timestamp" : "38:33-38:34"
  },
  {
    "text" : "There's something there's something deeper there.",
    "timestamp" : "38:35-38:38",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "38:38-39:07",
    "speaker" : "Andy",
    "text" : "So I'll look into it. Yeah, well I'm I'm gonna leave that one alone. We said enough dumb shit today. Uh but did you notice how Uh excited Brent Jones was about the height of the grass. No, I missed that one. On and on about how the the edges of the field uh had taller grass and the middle was much softer and shorter and easier to run in, but the outside was easier to cut on and Every time the ball went to the outside or there was a run up the middle, he would comment about the grass."
  },
  {
    "text" : "Did you pick out last time that he was like obsessed with Canadian blue seats? Was that the same guy?",
    "speaker" : "Mike Melo",
    "timestamp" : "39:14-39:19"
  },
  {
    "text" : "Uh Canadian blue steel, wasn't it? Oh steel, yeah.",
    "timestamp" : "39:20-39:23",
    "speaker" : "Andy"
  },
  {
    "text" : "But I think that was him. Yeah, I think so. I don't know. So maybe he's uh maybe he's into details, man. There's nothing wrong with that.",
    "timestamp" : "39:23-39:30",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "text" : "Maybe. You know his daughter played for the uh Boston Breakers, the women's professional soccer team. Okay. She won two uh NCAA championships yet UNC. Oh, so she's big time. Big time. Hot shot.",
    "timestamp" : "39:31-39:47"
  },
  {
    "speaker" : "Andy",
    "text" : "That's pretty sweet. Athletic families, dude. Mm-hmm.",
    "timestamp" : "39:48-39:51"
  },
  {
    "timestamp" : "39:52-39:57",
    "speaker" : "Mike Melo",
    "text" : "Um I I did have some questions though if you guys want to uh help me out again."
  },
  {
    "timestamp" : "39:57-39:58",
    "speaker" : "Andy",
    "text" : "Oh yeah, let's do this."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "39:59-40:01",
    "text" : "Um it's a Brent Jones game, so we know this is gonna happen."
  },
  {
    "timestamp" : "40:01-40:02",
    "speaker" : "Andy",
    "text" : "Um football, not football."
  },
  {
    "timestamp" : "40:03-40:31",
    "speaker" : "Mike Melo",
    "text" : "Football or not football, yep. Um Alright, here we go. I'll just start with the first one that I have. This one was about Lord Malloy, apparently. And he was saying that's exactly what they want to do. Get him out of the box. let Curtis Martin start to pound it up in there. Now, based on past episodes, I think that the box is like. kind of like where the running back is or kind of runs to."
  },
  {
    "text" : "Yeah, I think we've talked about that before in terms of um The box is kind of the uh it's an imaginary box that surrounds the both the offensive and defensive line. And it's kind of how many people are in that little area. Yeah.",
    "timestamp" : "40:33-40:47",
    "speaker" : "Andy"
  },
  {
    "text" : "It's also a euphemism for a vagina, Mike.",
    "speaker" : "Steve",
    "timestamp" : "40:49-40:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Which is why it's confused, yeah. That makes sense.",
    "timestamp" : "40:53-40:55"
  },
  {
    "timestamp" : "40:55-41:05",
    "speaker" : "Mike Melo",
    "text" : "Well no, but and it also seems a little like selfish too. That's exactly what they want to do. Get the Lori Malloy out of the box and let Curtis Martin start to pound it up in there. I just thought that was a little selfish."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. They call it the clam in the CFL. Not the bottom. They call it the what? Clam.",
    "timestamp" : "41:06-41:12"
  },
  {
    "timestamp" : "41:13-41:16",
    "speaker" : "Mike Melo",
    "text" : "No shit. Are you serious?"
  },
  {
    "speaker" : "Andy",
    "text" : "Well That that sounds that sounds pretty Canadian to me. Yeah, I can I I would believe that. Yeah, an eight guy clam.",
    "timestamp" : "41:17-41:24"
  },
  {
    "text" : "Alright, so so it's the getting him out of the box means getting getting him out of that area and then that would allow Curtis Martin to Like pound it through there? Is that what they mean? Yeah, to town through the clam. Well now when you put it like that, that sounds horrible. Well he can hit the hole with juice. Okay. Well yeah, but that was about passing though. So I guess you could like say the same thing. I see what you're saying. Yeah. All right, well that's informative. Okay. Um what else? Next one was um Tom Brady doesn't see Mo Lewis coming, who has a full head of steam and gets it off just in time. What is that?",
    "speaker" : "Mike Melo",
    "timestamp" : "41:26-42:10"
  },
  {
    "text" : "I I just wonder how your mind works sometimes.",
    "timestamp" : "42:10-42:12",
    "speaker" : "Andy"
  },
  {
    "text" : "I'm just I'm confused. Dude, Brad Jones throws out new top uh new terms every time. I I'm just fascinated. I'm like, oh Shit. Sometimes I I'm I'm sort of fascinated with what he's saying that I miss a play or two, if you can believe it.",
    "timestamp" : "42:13-42:25",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "So all right, re read that back to me again.",
    "timestamp" : "42:25-42:27",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "42:28-42:35",
    "speaker" : "Mike Melo",
    "text" : "All right. So Tom Brady doesn't see Mo Lewis coming, who has a full head of steam and gets it off just in time."
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. Alright, so I think I know that so my guess, um I'm not able to see the play in real time, but I think Tom Brady has probably dropped back to pass. And I think the Molu is coming is is he's running at him. Probably to try for a sack, as you know. And so Tom Brady getting it off, I think is is throwing the ball before Mo Lewis gets there.",
    "timestamp" : "42:35-42:58"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "42:59-43:06",
    "text" : "Yeah, or Clown's blindfolded and Mola's bust the nut on his face. One of the two. Oh Jesus man."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh, I can't believe you just said that. Right? That's dirty. Yeah, what the hell? We're all playing. Oh my god, that's insane, dude. Okay, I don't think it's that, Steve, but I appreciate the effort. What were you gonna say, Greg?",
    "timestamp" : "43:06-43:20"
  },
  {
    "timestamp" : "43:20-43:30",
    "speaker" : "Greg",
    "text" : "I was gonna say real talk, like I after we first did the segment, I tried to like listen for these and I couldn't do it. So this is like a unique skill, Mike."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:30-43:34",
    "text" : "I this is what I'm saying. I I his brain works differently than mine."
  },
  {
    "speaker" : "Greg",
    "text" : "He's got like four for every game.",
    "timestamp" : "43:34-43:36"
  },
  {
    "text" : "I try not to. I don't I I want to know everything, but very confused. I'm not two more and we'll be done with this. All right. So um next one, so we uh we mentioned the box, so we get that. And I I think now this is a little silly bringing this up, but I'll just say it anyway. Um the quote was, we've talked about eight men in the box. How about eight men in the end zone?",
    "timestamp" : "43:39-44:02",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:03-44:04",
    "text" : "Oh my."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "44:04-44:05",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, okay. Alright. So well we know what the box is, right? We we just discussed that. Correct. So I remember this plan. Damn, right. Because this is right at the end, this is the Hail Mary we're talking about, and the Patriots unveiled a new defensive scheme.",
    "timestamp" : "44:07-44:19"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh yeah, that's what it was.",
    "timestamp" : "44:19-44:20"
  },
  {
    "timestamp" : "44:21-44:41",
    "text" : "Where they had eight of their players lined up basically in the end zone to knock down a Hail Mary because they wanted to have more guys. than on defense then the the offense sent down wide receivers. Because usually if it's a Hale Mary you're sending at least four, if not five, wide receivers down into the end zone. So you want to have More than that to cover them.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "44:41-44:51",
    "text" : "Gotcha. That was the first time that was done because Brent Jones seemed to think that that was um a new It's the first time Brent Jones ever saw it, that's for sure."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "44:51-44:58",
    "text" : "Okay. And if you meant to put eight in the box and they end up in the end zone, you're in big trouble."
  },
  {
    "text" : "That's very true. Uh wow, see, I'm learning a lot of stuff. And the last one, um Those defensive ends of the Jets get wide so much that we're gonna use some draw action to come on underneath them. I don't know what that even means at all.",
    "speaker" : "Mike Melo",
    "timestamp" : "45:01-45:22"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay, alright. getting a lot of quick pressure on Tom Brady, right?",
    "timestamp" : "45:23-45:31"
  },
  {
    "timestamp" : "45:31-45:33",
    "text" : "Yeah, they're destroying them.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, so, but if you think about the way they run, because they're coming off the ends, they're going out wide around Usually the guys that are trying to block them to to close in on Tom Brady. So because they're giving that space, there's a lot of space in the middle, so the Patriots were mitigating that by running draw plays. Where you drop back and it looks like you're gonna pass it, but then you hand it off to the running back on a delay usually. Oh shit, okay. And then they run where those the defensive lineman used to be.",
    "timestamp" : "45:33-46:02",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:02-46:03",
    "text" : "That makes sense.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "46:04-46:04",
    "text" : "Right?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I mean I don't know. I think that makes sense. Do you guys agree? I stopped listening after the third one. All right. Well then I appreciate your help, guys, and I'm a little bit smarter for that, so thank you. All right.",
    "timestamp" : "46:04-46:19"
  },
  {
    "text" : "The real question is, Mike, how did you not Get on the uh quarterback sneak where Vinites have already touched his center's dick when they ran off straight ahead.",
    "timestamp" : "46:19-46:27",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "46:28-46:30",
    "text" : "What goosed him",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "46:31-46:32",
    "text" : "Oh, is that what they were talking about?"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "46:33-46:33"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well I heard about the goose and he was freaking out about that.",
    "timestamp" : "46:39-46:42"
  },
  {
    "timestamp" : "46:42-46:45",
    "speaker" : "Andy",
    "text" : "I didn't know the thing. Slap the grundle, I'm pretty sure, yeah."
  },
  {
    "timestamp" : "46:45-46:46",
    "speaker" : "Mike Melo",
    "text" : "That's what he was talking about for real?"
  },
  {
    "text" : "Yeah. That's what they do. They literally goose them. It's a physical tell for the center to snap the ball immediately and run like hell. I think you made a joke about like No, it it's literally like slapping a horse and running after it.",
    "speaker" : "Andy",
    "timestamp" : "46:46-47:04"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:04-47:09",
    "text" : "Just tug on his cock. See, it's hard to tell with this guy. I don't know."
  },
  {
    "text" : "It's Brent Jones with everybody. Uh so I th I think I think this is the perfect time to do best and worst. Steve, you go first.",
    "speaker" : "Andy",
    "timestamp" : "47:10-47:22"
  },
  {
    "text" : "Well, I'm definitely I was gonna say that, but we just covered that.",
    "speaker" : "Steve",
    "timestamp" : "47:23-47:26"
  },
  {
    "timestamp" : "47:26-47:29",
    "text" : "No, you can still use it if you want, that's all yours.",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh I think best bit was how stoked Belichick was at the end of the game. Yeah, well reserved, but this is his first win against the Jets. Clearly hates the Jets like I do. And at the end of the game, he's running around, he's yelling, he's grabbing all his players, he's like screaming. It was pretty crazy.",
    "speaker" : "Steve",
    "timestamp" : "47:30-47:49"
  },
  {
    "timestamp" : "47:50-47:52",
    "speaker" : "Andy",
    "text" : "That's a good one. Do you have a worst?"
  },
  {
    "text" : "Um that first little couple minutes where the Jets were just absolutely whooping them up and that slip by Ty Law and that slant that just gave him walking touch. Yeah. Terrible start. That was not great.",
    "speaker" : "Steve",
    "timestamp" : "47:53-48:05"
  },
  {
    "speaker" : "Andy",
    "text" : "All right, Greg, give me your best and worst.",
    "timestamp" : "48:05-48:07"
  },
  {
    "timestamp" : "48:08-48:15",
    "text" : "All right, my best was um Antoine Smith on that reception. Oh yeah, that was awesome.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "48:16-48:18",
    "speaker" : "Andy",
    "text" : "His acceleration came out of nowhere."
  },
  {
    "text" : "It didn't look like him. It didn't really yeah but yeah I I agree I was gonna say that people and then uh my worst was just Curtis Martin in general because he's a cunt.",
    "timestamp" : "48:20-48:31",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "48:33-48:40",
    "text" : "And that is punt for everyone out there. He's a dual running back punter."
  },
  {
    "text" : "Alright, Mike, give me your best and worse.",
    "timestamp" : "48:41-48:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:44-49:35",
    "speaker" : "Mike Melo",
    "text" : "I'm just kidding. Um well, I mean, he's awesome, but we have reason to and it isn't. He got traded, man. What can you do? Yeah. Um, best for me was um so it Right after like one of the Patriots uh touchdowns, um there was a kick return that was gonna break it, and I think that would have been the end of the game. And Vinateri comes out of nowhere. So to your credit, man, you brought this up at the beginning of this podcast where you're like Vinateri's beast. And I didn't realize it, but after seeing the clip that you showed and then this has happened twice in this season alone, it ran down the returner as the last guy and saved the touchdown. And that drive they ended up getting a field goal. But if that was a touchdown, game over."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because that was what what wasn't that um Herschel Walker, the one to the clip you're talking about.",
    "timestamp" : "49:35-49:42"
  },
  {
    "text" : "Oh yeah, yeah, you're right.",
    "speaker" : "Steve",
    "timestamp" : "49:42-49:43"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "49:43-49:50",
    "text" : "I was trying to figure out somewhere. I think it was someone on the jet saying that's the fastest kicker they've ever seen."
  },
  {
    "text" : "Yeah, it was the uh it was it was right after the Patriots first touchdown was that ensuing kickoff.",
    "timestamp" : "49:49-49:57",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "49:58-50:04",
    "text" : "Right, because it was uh seven to thirteen And after that it was seven to sixteen, but the game would have been over.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Right, exactly.",
    "timestamp" : "50:05-50:06"
  },
  {
    "timestamp" : "50:06-50:08",
    "speaker" : "Mike Melo",
    "text" : "So that's pretty awesome."
  },
  {
    "text" : "Yeah. Yeah, because yeah, one of the commentators like, that's the fastest kicker I've ever seen. You're right, Greg.",
    "speaker" : "Andy",
    "timestamp" : "50:08-50:13"
  },
  {
    "text" : "Yeah. It uh that was pretty cool. So I don't know how many of those he has in his career, but I I know of three. Yep. At the moment. Um and then worst moments, uh, I would go uh pretty much what Steve said, but the opposite end of it where uh Bill was so happy, he was smiling, he was high-fiving and hugging, and I just know that a few years later we're never gonna see that again. It made me sad. So um my worst is that he was happy at one point now he's not All right then. Serious.",
    "speaker" : "Mike Melo",
    "timestamp" : "50:13-50:50"
  },
  {
    "timestamp" : "50:51-50:53",
    "text" : "That's the best song I've ever heard one.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "50:56-50:57",
    "speaker" : "Andy",
    "text" : "Oh boy."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "50:57-51:03",
    "text" : "Yep. And we established 2004 is when he sold his soul, and you know, we'll get to that."
  },
  {
    "speaker" : "Andy",
    "text" : "Correct. All right. My best is the winning the game winning play. Uh Patriots, uh the the Jets of use their last time out. They need a first down. It's third and I think like three or four. And the Pages run a bootleg with Tom Brady. Um, but the defensive end steps right in the way and he basically just cuts it back upfield and runs for a first down all by himself to win the game. Dude, I forgot that.",
    "timestamp" : "51:03-51:34"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And he spun as well. He did a spin and he dove. And yeah, he got the first.",
    "timestamp" : "51:35-51:39"
  },
  {
    "timestamp" : "51:39-53:02",
    "speaker" : "Andy",
    "text" : "And he picked up the first by like the nose of the football too. Like it was it was close. And uh that was the game winner. So that's by far my best. That's just a good one. That's that's Tom Brady being Tom Brady before everybody knew he was Tom Brady. Um so my worst was gonna be uh the page two article that I found about by Bob Halloran. Who has a hard on for Drew Bledsoe. Um, but I think it's actually gonna work better later because he has a few of them. So we're gonna actually get in depth into some of the more egregious ones. Uh so I'm gonna say my worst is the Jets fans for two reasons. One was Fireman Ed. Yeah What a fucking hardo. And every time they cut to him, they were showing him try to pump up the crowd even though the Jets were on offense. Every fucking time. Yeah. Just waving his hat around like he yeah. Oh and then they also kept talking about how uh they're the Jets fans unofficial mascot is Shrek. Because he's green and they win ugly."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "53:02-53:02",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "53:04-53:07",
    "text" : "I don't even remember that being a thing, but they did uh keep showing that.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Steve",
    "text" : "Like is Shrek that old?",
    "timestamp" : "53:10-53:11"
  },
  {
    "timestamp" : "53:12-53:20",
    "speaker" : "Andy",
    "text" : "Uh yeah, I guess so. I mean Mike went to school for that. Mike, when how old was I went to school"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "A few years ago it was already out. Cause this is 2001. Right. So we were we had just gone Yeah, it had come out recently, and I will say this because I I went to a lovely uh school of um RIT and I went for computer animation and um When I was taking the tour, uh because nobody knew what c computer animation was really, Toy Story had come out and Shrek was recently out. We took a tour. They're like, hey man, um these computers in this lab is what they use to work on Shrek with. And we're all like, what dude, that is crazy. I gotta go here. And then I I went there. And I'll leave it at that. So a story for another day, apparently. Yes. But it you know, there's shades of your Penn State you know, experiences and whatever we can go into that another time. But uh to confirm yes, Shrek was out and um and doing well. How many helicopter cocks were there at R I T Mike? How many what?",
    "timestamp" : "53:21-54:24"
  },
  {
    "timestamp" : "54:24-54:26",
    "speaker" : "Steve",
    "text" : "Helicopter cocks."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "54:27-54:48",
    "text" : "Ooh, I didn't see any. It was a different type of uh environment out there. A lot of deaf people at RIT, right? Yeah, National Uh Technical Institute of the Deaf, yes, was right near there. And uh I was in a room that um uh was a deaf room. So people would walk by the hallway and uh press the button so the strobe would go off. And that was pretty cool."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because you had to have that was the uh the fire alarm for deaf people, right? Was the strobe.",
    "timestamp" : "54:49-54:54"
  },
  {
    "text" : "Right, yeah. Um but you could press it in the hallway. Right. So that's what everybody did. Right. No, there's a lot of a lot of good things about RAT. So we'll we'll figure them all out down there.",
    "speaker" : "Mike Melo",
    "timestamp" : "54:54-55:06"
  },
  {
    "text" : "All right. Yeah, we'll get into that. No helicopter dicks though, man. Maybe we'll get into that next week when the Patriots uh travel back home. Uh to host the six and five Cleveland Browns coming into Foxboro. A revenge game? How so? Oh, I guess it is, yeah.",
    "timestamp" : "55:07-55:32",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "55:32-55:36",
    "speaker" : "Greg",
    "text" : "The revenge tour. He's just stomping everybody."
  },
  {
    "timestamp" : "55:37-55:45",
    "speaker" : "Andy",
    "text" : "This is true. So we'll learn more about that next week on the Patriots Dynasty Podcast. See you later, guys."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Bye. I'm Mike. Bye.",
    "timestamp" : "55:47-55:51"
  }
]