[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid. Stupid. You still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:19"
  },
  {
    "text" : "Welcome to episode 11 of the Pages Dynasty Podcast. We're gonna start this before Michael and I come to Fisticuffs from across the video.",
    "timestamp" : "00:22-00:34",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "If you guys are wondering, we're discussing the intro music as if nothing else can be talked about right now.",
    "timestamp" : "00:34-00:40"
  },
  {
    "timestamp" : "00:40-02:04",
    "text" : "So, well, I think because we haven't addressed this yet and because we've actually just figured it out on our end, but it'll have been in every episode since. So we should probably take the time to thank Mama Brown for her disclaimer at the beginning of all of these. Mama Brown! Woo! Yeah. Um in full transparency, she was not the first choice. We did try to uh get a cameo uh from their website uh of Jonas Gray to do it for us, but Either he doesn't know how to use the the cameo website or he just decided not to didn't tell us. So we tried a couple times, didn't get him. But Mama Brown, it felt It felt right to have her apologize for us before you even started listening to this. So thanks to her. So as you can tell, we have both Mike and Steve here. No Greg this week because he is heading to Miami for the Super Bowl. That was some poor foreplanning, I suppose, on his part. Um buying it. Although I understand why you would would buy tickets to wherever the Super Bowl is every year. Just because the last time the Patriots weren't in it was Four years ago? Is that right? Think so? I don't know. I'm terrible with time. So We're gonna go with that.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "02:04-02:09",
    "speaker" : "Mike Melo",
    "text" : "But to be clear, even if they were in the Super Bowl, he did not have tickets to the game. No, no, he's just going to Miami."
  },
  {
    "text" : "He's not even gonna go to the game, even if the Patriots are in it. He couldn't afford that anyways.",
    "speaker" : "Steve",
    "timestamp" : "02:10-02:14"
  },
  {
    "timestamp" : "02:14-02:24",
    "text" : "Well, just don't want to you he probably could afford it because if the pages are in it, the tickets would have been cheap again. They were cheap last time, weren't they? That's why all the Patriots fans were there.",
    "speaker" : "Andy"
  },
  {
    "text" : "What's cheap these days, $5,000?",
    "speaker" : "Mike Melo",
    "timestamp" : "02:24-02:26"
  },
  {
    "timestamp" : "02:27-03:24",
    "text" : "No, that's how much they are this year, I think. Maybe like 9,000. I don't know they were pretty expensive this year. Because the Chiefs haven't been in like 100. But we're not here to talk about the Chiefs or the 49ers. We're here to talk about the Saints. Because the Saints are coming to town 2001, week 11, to the the wet and windy Foxboro, Massachusetts. Apparently the everybody was pissed because during the day it was like 60 degrees and sunny. Uh but this was a late game and the rain and wind started late. So it was fun. Uh about the Saints. Uh the Saints team, they seem like they were pretty good. They were good the year before. But uh this year they would actually finish seven and nine, third in the NFC West, behind obviously the Rams, and I believe the 49ers were a bit of a powerhouse this year too. Head coach was Jim Hazlitt. You boys remember Jim Hazlitt?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "03:24-03:33",
    "speaker" : "Steve",
    "text" : "Oh yeah. Wait, who else was in the NFC West back then? 'Cause this is before they realign the divisions, right? When the Colts are still in ours."
  },
  {
    "timestamp" : "03:33-03:34",
    "speaker" : "Andy",
    "text" : "It is."
  },
  {
    "timestamp" : "03:34-03:39",
    "text" : "Uh by the end of this podcast, people will definitely remember How these divisions were broken up.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, because we asked this question literally every week. NFC West was the Rams, 49ers, Saints, Falcons, and Panthers. I believe we touched on this last week.",
    "timestamp" : "03:40-03:48",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "03:52-03:58",
    "text" : "Uh yeah. Rams went Super Bowl last year, Niners and Super Bowl this year.",
    "speaker" : "Steve"
  },
  {
    "text" : "Saints I think the Falcons were in the Super Bowl recently too, weren't they? No, they got they were weren't they like up big in the Super Bowl? Something like that, yeah. I don't I don't remember. I'm sure well we'll probably find out a bit twenty years from now. Yeah. Exactly. Keep listening. At this rate it'll be forty years. Are you kidding? Uh so Jim Hazlitt, uh pretty good defensive coordinator. It was a defensive coordinator for the Steelers before this for a few years. when they were pretty good. Um and that's I think how he got his head coaching gig. So his head coach from 2000-2008. Most of those years were with the New Orleans Saints. Uh didn't do so great. He only had two winning seasons. One was that first 2000 season and then 2002. Uh the rest of the season he was either eight and eight or worse. Uh he finished with a forty seven and sixty-one record overall, which is not great. Uh but the fact that he lasted for what was it, eight years? Yeah. Even with such a bad record is, you know, a testament to being able to stick around. Jeff Fisher.",
    "speaker" : "Andy",
    "timestamp" : "03:59-05:08"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "What what about uh Garrett, Jason Garrett? I mean, uh this guy did worse than that guy and he held his job, so",
    "timestamp" : "05:11-05:18"
  },
  {
    "timestamp" : "05:19-05:57",
    "speaker" : "Andy",
    "text" : "That's true. Um props to him. We can uh I think there's other connections to Jason Garrett too, which we'll get to in a second. But against Hazlitt coach teams, the Patriots were undefeated. They went 3-0. Uh they beat the Saints twice in 01 and 05 and then again uh when Hazlitt was coaching the Rams in in 2008. So we liked seeing his teams uh none of the games were particularly close really. The average score was uh 27-17 paths. One of the games. Yeah, most of the games were about 24 to 17, 16 to 23. Twenty-four to seventeen."
  },
  {
    "speaker" : "Steve",
    "text" : "So they were very uh calling them out for not wanting to play in this game.",
    "timestamp" : "05:57-06:02"
  },
  {
    "text" : "Yeah, they were definitely a dome team for sure. Because all three of those games were at were in Fox. Dome team Dome team?",
    "timestamp" : "06:02-06:09",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "06:09-06:11",
    "speaker" : "Mike Melo",
    "text" : "Oh dome team. Gotcha."
  },
  {
    "text" : "You haven't been in New England for a while, have you? It's my accent. It's tripping you up. It is. Sorry. But yeah, so to come back to the uh the clapper that I said before, uh the other notable coach in this, offensive coordinator Mike McCarthy. who is currently the new Dallas Cowboys head coach after turning this offensive coordinator job into the Green Bay had coaching job in 2006 and coach forever up until last season, right? He was through 2018 season, didn't coach until 19 now he's just gotten hired.",
    "timestamp" : "06:13-06:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "What's your take on his relationship with old Aaron Rodgers?",
    "timestamp" : "06:52-06:56"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't really have a take. I've kind of ignored that to be honest.",
    "timestamp" : "06:56-06:59"
  },
  {
    "text" : "Really?",
    "timestamp" : "06:59-07:00",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Aaron Rodgers seems kind of like a A Dingleberry.",
    "timestamp" : "07:00-07:03"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "So I mean uh that's a funny way to put it, but uh he um I don't know, I I think I we respected him early on. I think he's become a little bit of a curmu curmudgeon. Um Aaron Rodgers, that is.",
    "timestamp" : "07:04-07:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. That's what it feels like.",
    "timestamp" : "07:16-07:17"
  },
  {
    "text" : "And he's under the bus.",
    "speaker" : "Mike Melo",
    "timestamp" : "07:17-07:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, the early success seems to have maybe gone to his head a bit.",
    "timestamp" : "07:20-07:24"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. It's also kind of interesting to see that I mean he was hands down across the board known as the you know the most athletic quarterback, and now that's definitely not the case. So it's interesting to see the passing of the f torch and he never really won another championship, so it is what it is.",
    "timestamp" : "07:25-07:42"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I think it kind of puts what Brady has accomplished into perspective when you see somebody with that sort of ability and that sort of talent and all the success that he's had and he's only won one Super Bowl. Right for a while. Right? I think that's the only one he's been to as well. Right. So to only ever get to one Super Bowl. What's the fact that Brady's gotten to nine and one six of them, it's it's a whole different level.",
    "timestamp" : "07:42-08:10"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "08:10-08:17",
    "text" : "But remember when it was Aaron Rodgers, Peyton Manning, and Brady. Yeah. For GOAT status, yeah."
  },
  {
    "timestamp" : "08:17-08:25",
    "text" : "Yep. And now it's Tom Brady and Drew Brees has now entered the conversation.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Wait, Drew Brees is in for goat?",
    "timestamp" : "08:25-08:27"
  },
  {
    "text" : "Uh yeah. This year you heard it when he uh when he passed uh Peyton Manning touchdown record. Well, regular season touchdown passing record. People say that.",
    "speaker" : "Andy",
    "timestamp" : "08:28-08:40"
  },
  {
    "text" : "I mean if you're talking just regular season, then yeah, maybe it is between Manning and Breeze.",
    "timestamp" : "08:41-08:45",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "08:46-08:59",
    "text" : "The thing is, Brady's up there in all those numbers. But he has the whole playoff on top of it, you know, all those playoff records where he's uh head and shoulders above everybody in every statistic.",
    "speaker" : "Andy"
  },
  {
    "text" : "I know it's kind of a silly argument.",
    "speaker" : "Mike Melo",
    "timestamp" : "08:59-09:01"
  },
  {
    "timestamp" : "09:01-09:25",
    "speaker" : "Andy",
    "text" : "It's outrageous, yeah. You could actually put together um a full season of Tom Brady playoff games. And I think he still finishes 12 and 4. Against playoff teams and Super Bowl teams. Teams like the Legion of Boom and the Greatest show on turf and all these teams."
  },
  {
    "text" : "It's and what can we thank for all this? The flake gate.",
    "speaker" : "Mike Melo",
    "timestamp" : "09:26-09:31"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:32-09:35",
    "text" : "I'm serious. I thought it was Belichick selling a soul."
  },
  {
    "timestamp" : "09:36-10:11",
    "text" : "No, I mean dude, there's a lot of stuff. There's Brady selling a soul after like I think oh seven or maybe oh six. There's obviously We've talked about when Belichick sold his soul. We've talked about Belichick's cheating ways and his opportunistic getting caught to use his motivation. Well, let's call a spade a spade, my friend. So with Deflate Gate, that happened and that they went on a run, needless to say. So without the Deflate Gate, we probably don't have the second part of the dynasty and it probably gets capped. So BowerCheck again, freaking G. You think so though? Yeah, absolutely.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "10:12-10:17",
    "speaker" : "Andy",
    "text" : "You think the Patriots weren't gonna win the game against Seattle, the Super Bowl against Seattle?"
  },
  {
    "text" : "Well yeah, but but the flake gate sort of like created that that aura that like, oh, screw this, everybody's against us. Because if you remember, after you deflate gate, they still had two weeks or whatever of like answering BS questions. And then The um the year after, you know, what was that, the suspension year? Was it the year after that? Uh whatever Brady was uh suspended, I mean That brought up the whole Garoppolo thing, so everyone was looking at him. Brady had a chip on his shoulder. He hadn't probably had that chip on his shoulder for a long time. And they just rattled off Super Bowl after Super Bowl after Super Bowl. So I think Deflate Gate played a hand in this run. Yes, I do.",
    "timestamp" : "10:17-11:00",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "11:01-11:04",
    "text" : "Yeah, but Mike, you also thought nine eleven played a hand in this.",
    "speaker" : "Steve"
  },
  {
    "text" : "Look, I didn't say all I said was the dynasty happened because of Mo Lewis's hit, okay? Indirectly.",
    "speaker" : "Mike Melo",
    "timestamp" : "11:05-11:12"
  },
  {
    "speaker" : "Andy",
    "text" : "We're adding that to the list. Okay.",
    "timestamp" : "11:13-11:14"
  },
  {
    "timestamp" : "11:15-11:26",
    "speaker" : "Mike Melo",
    "text" : "Indirectly. Look, there's a lot of stuff we've talked about. The people Don't start on this episode. Listen to all this. You need to see the uh the the the filth that these guys are spewing. And I'm right."
  },
  {
    "timestamp" : "11:28-11:33",
    "speaker" : "Andy",
    "text" : "Some solid spin zone considering it's all taken. Right, good lord."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Some takes. Oh man, they're just real takes, my friend.",
    "timestamp" : "11:34-11:38"
  },
  {
    "text" : "See, I like I like doing this because all these hot takes get us through this cold New England winter. It just it just keeps me warm. I wouldn't know. I wouldn't know. It's really nice out here. Do you still have the the fires to keep you warm or are those done?",
    "timestamp" : "11:38-11:52",
    "speaker" : "Andy"
  },
  {
    "text" : "Um now it's just sunny, man.",
    "timestamp" : "11:52-11:55",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "It's just good. Yeah, it's a tough life you lead.",
    "speaker" : "Andy",
    "timestamp" : "11:55-11:58"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "11:58-12:01",
    "text" : "There's a couple of earthquakes here and there, but other than that"
  },
  {
    "timestamp" : "12:02-13:03",
    "text" : "Alright. Well that's that must be nice. It was nice today because it got um into the thirties. Got to thirty-six this afternoon. Like sweatshirts on there outside and fucking lovely. Fucking lunatics. All right, uh the Saints. Speaking of lunatics, how about some of these uh Saints players? Quarterback Aaron Brooks, remember him? I do because I actually had his jersey, if you recall. I went through a phase, yes. Uh that's messed up, man. That's not Patriots. Mike and I talked about this. Uh may have just been the two of us, I think, Mike. When we go shopping at that place in Lawrence. Oh, hell yeah. So sold Steve, do you remember that place? No. No, Greg used to love it too. They had uh It's like one of those like filings based on like TJ Maxx sort of places. They just had a bunch of random stuff, but they always had one rack of random like crap jerseys. So they had one with uh Like names sewn on upside down and like stupid things like that. I think it was Peerless Price was the one that I had.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "13:03-13:04",
    "text" : "Ooh, yeah.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "13:04-13:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Mine was Dave Megat off center 22.",
    "timestamp" : "13:05-13:08"
  },
  {
    "text" : "Right. But one of them I had Aaron Brooks. And then I also, my my crown jewel was Maurice Clorette Broncos jersey. Oh. Yeah, those were cheap. There was also Tim Couch one, I think. Um who is the the big defensive lineman for Green Bay with the great name? Kabah Biyamila, that guy. I don't remember his first name. Remember him? Yeah. Had one of those. So I I would give those away in college for uh like Christmas presents and stuff to all my roommates and things. Warren? Oh yeah, of course. Oh boy. Yeah, they weren't new. They were used.",
    "timestamp" : "13:08-13:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well I used to worry about like house parties and stuff and get like I I've seen what you do with them, so that's why I'm surprised.",
    "timestamp" : "13:46-13:52"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "13:54-13:58",
    "text" : "No surprise that Aaron Brooks is on the reject pile though. He fucking sucks."
  },
  {
    "text" : "Dude, he he is fast as hell, man. Yeah, he was not as bad as I remember him being.",
    "speaker" : "Andy",
    "timestamp" : "14:00-14:05"
  },
  {
    "timestamp" : "14:05-14:08",
    "speaker" : "Steve",
    "text" : "Oh, he was worse than I thought he was bad."
  },
  {
    "text" : "Are you basing it on this game, man?",
    "timestamp" : "14:09-14:10",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "They were. And he couldn't handle it. Like he had to get out of the kitchen. But I mean he put up decent numbers. He had 3800 yards, 26 touchdowns, and 22 interceptions.",
    "timestamp" : "14:14-14:25"
  },
  {
    "timestamp" : "14:25-14:30",
    "speaker" : "Steve",
    "text" : "Didn't he have like 350 yards in this game passing? Which was weird because I don't think I saw him complete a pass."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:31-14:35",
    "text" : "Oh he did, but there was appearances. The only passes he completed were sixty yards downfield."
  },
  {
    "timestamp" : "14:36-14:38",
    "text" : "Yeah. There's a couple of nice ones.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "14:38-14:49",
    "speaker" : "Andy",
    "text" : "Yeah. Um but he was also second on the team in rushing yards with 358. He was sacked 50 times. That is 5-0. 50 times."
  },
  {
    "text" : "But see, is is that I I that's usually in the upper region, right? But like 50. You hear that. I mean, what about um carr? Remember the Texans? Didn't he set records for like being sad?",
    "timestamp" : "14:49-15:01",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "15:02-15:04",
    "text" : "I have no idea how many times.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Although for a running quar a quarterback, that is a lot of sacks. You'd think you'd escape.",
    "timestamp" : "15:04-15:10"
  },
  {
    "text" : "Well, you think that um Because uh the sack in this game was where he was scrambling and then he ran and kind of like tripped over himself. Right. It was like a one-not sack. Yeah. Uh oh here we go. Here's the leader of time sacked in the season. Uh was it you, Steve, that said David Carr?",
    "speaker" : "Andy",
    "timestamp" : "15:11-15:29"
  },
  {
    "text" : "I was Maria.",
    "timestamp" : "15:30-15:30",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "15:31-15:37",
    "text" : "Oh, Mike, sorry. Um yes, it was him in 2002. Care to take a guess how many times he was sacked that year?",
    "speaker" : "Andy"
  },
  {
    "text" : "I remember it was like in the 70s, I think.",
    "speaker" : "Mike Melo",
    "timestamp" : "15:37-15:40"
  },
  {
    "timestamp" : "15:40-16:13",
    "speaker" : "Andy",
    "text" : "76. Oh, damn. Second place though, uh Reynolds Cunningham in 86 with 72. Wow. Surprising. Yeah, the a lot of these it seems to be either um White quarterbacks on bad teams, like immobile quarterbacks on bad teams, or mobile quarterbacks who like Deshaun Washing's on here, 2018, with 62. Randall Cunningham's on here a lot."
  },
  {
    "timestamp" : "16:14-16:15",
    "speaker" : "Mike Melo",
    "text" : "Poor guy."
  },
  {
    "timestamp" : "16:16-16:31",
    "speaker" : "Andy",
    "text" : "He's in the Hall of Fame. Three. Drew Bledzo's on here. 1999. 55 sacks. Tied for 18th with Blake Bortles in 2014. Bledso's on here again. Uh 2002 at Buffalo with 54 sacks."
  },
  {
    "timestamp" : "16:32-16:41",
    "text" : "Doesn't that guy sound like a Pokemon? I mean I don't know anything about Pokemon. Every time I hear bordels, I just uh picture his face a bordle, bordle. I don't know. Anyway.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I think you're right, yeah. So yeah, Aaron Brooks is he's uh He's on this list, but he's got some good good company. Aaron Rodgers, uh 51 sacks. He also had 50 sacks in a year. So it does seem to be kind of mostly the more mobile guys. And David Carr. Huh. Who is first and also third on this list. Oh, forgot. That's pretty rough. Oh, my boy Tim Couch is on here. 56 sacks. It's a lot of car crashes. That's a lot of car crashes.",
    "speaker" : "Andy",
    "timestamp" : "16:42-17:15"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "But now car is bringing it in the announcing game, I think.",
    "timestamp" : "17:16-17:18"
  },
  {
    "text" : "Is he?",
    "timestamp" : "17:19-17:19",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know. He's a reporter of some sort. I don't know.",
    "timestamp" : "17:19-17:22",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Man, yeah. I don't I haven't come across Oh there he is. It's like the most Tom Brady's ever been sacked was forty-one times. Guess what season that was? This one? This one. Oh really? Yeah.",
    "timestamp" : "17:23-17:36",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Well yeah, dude. He doesn't have his like supernatural awareness. He got blown up blindsided in this game.",
    "timestamp" : "17:36-17:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:41-17:51",
    "text" : "Yeah. Yeah, he had a couple of fumbles that uh his offensive lineman recovered. One of those blindsided. It was real bad. The one where your your neck snaps back, yeah."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "It's a wonder why Belichick allowed him to keep his job. But again, Bletto didn't have the greatest uh history as well. And I mean he got a pretty good view of him the year before when they went five and eleven. So",
    "timestamp" : "17:51-18:05"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:07-18:16",
    "text" : "And from what it sounded like is uh Belchek chose Tom Brage based on the decisions he was making, more so than really the numbers, I think."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, that's a good point. I also read, and uh this is you know perspective that you get after the fact. I don't remember any of this stuff like you know when I was watching these games live, but Um it came down to a lot of like uh practice snaps between Bledsoe and Brady, and I guess in the previous game against the Rams, um Belichick basically blamed Brady's performance, so to speak, on um on the limited practice opportunities because Bletso kind of took some away. Uh I don't know if that's like true or not, but that that's sort of what he went with. And if you look at it from that perspective, and you have a quarterback who's been You know, he was a starter for two games, gets hurt, and then you have a guy who's a starter for eight games. You sort of like gear the uh the whole team philosophy towards what's happening with that quarterback, the terminology, et cetera, play calling. So it doesn't actually make sense that, you know, you're this far into the season, regardless of even if he thought Brady was the better quarterback. There it probably is a setback to kind of like restart it again with some guy that's been sitting on the bench for two months.",
    "timestamp" : "18:17-19:21"
  },
  {
    "timestamp" : "19:21-19:27",
    "text" : "Right, especially with Brady like still winning games during that stretch too. Like he was five and three going into this game.",
    "speaker" : "Andy"
  },
  {
    "text" : "I had heard somewhere some Belichick clip talking about this specific Saints game where he said Brady played like crap the game before and this game Kind of showed him that he needed to stick with Brady and kind of proved him right and he was gonna ride him for the rest of the year was this specific Saints game.",
    "timestamp" : "19:28-19:46",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, and that that's actually what all the um the Boston Globe articles were kind of but before and after is ex exactly that kind of di",
    "timestamp" : "19:46-19:54",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "19:54-20:15",
    "text" : "dichotomy where the the funny thing though is is that like he made not the hard decision but he made the decision that Brady was going to be the starter barring like injury before this game So I wonder if he didn't play like lights out, which he he did. Um I wonder if it would have been a different outcome. I mean he probably still would have stuck stuck with him the rest of the year, but Yeah.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I mean who who really knows other than Belichick, but And he's never gonna fucking tell you. He'll talk about it. Sure he will. Once we have him on this podcast in 30 years. But yeah, I mean there was there was a bunch of stuff in the papers about how Belichick just made the decision and took the full responsibility for it too, even back then. In typical Belichick fashion, talking about how It's his decision and it is what it is and nobody else uh has anything to do with it. I think the the line was there's no sense in being wishy-washy. That's not what I'm paid to do. It's fucking Bill Belichick.",
    "timestamp" : "20:15-20:59",
    "speaker" : "Andy"
  },
  {
    "text" : "It's true, but uh then there were also players quoted saying that you know exactly where you stand with him, which I thought was interesting, except for the fact when he chooses not to to be up front, he is witchy-washy because he told Bletto that he would be allowed to practice and earn those reps and earn the uh the starting status again. That was never the case. And as recently as um Uh I think Mike Pennell uh this past year was coming out and saying that Belichick was never up front with them and it was just, you know, sort of a guessing game until he was cut and whatever. So it is funny that that's uh Belichick stands, but he's not wishy washy unless he has to Well I mean get out of here, Mike.",
    "speaker" : "Mike Melo",
    "timestamp" : "21:00-21:42"
  },
  {
    "text" : "Yeah I don't I don't know if I agree with that because they also had um Wasn't I uh Michael Bennett on and he said exactly the opposite. He's like, no, I knew exactly where I stood. It was completely transparent and well I didn't say every time, did I?",
    "speaker" : "Andy",
    "timestamp" : "21:42-21:56"
  },
  {
    "text" : "I said when he wants it to be the case.",
    "speaker" : "Mike Melo",
    "timestamp" : "21:56-21:59"
  },
  {
    "timestamp" : "21:59-22:11",
    "speaker" : "Andy",
    "text" : "I mean maybe or is it just that it's up to the player to decide? how to react to Belichick's Demeanor, maybe? I don't know what the right word there would be."
  },
  {
    "timestamp" : "22:12-22:45",
    "speaker" : "Mike Melo",
    "text" : "I don't know. I mean I I'm just repeating what Bledsoe said. He said that he had a conversation with Belichick. Belichick said that he would give him the opportunity to win his job back and then the next week he named Brady starter. So I'm just looking at it from Bletzus' perspective. Now, maybe he was a little butthurt about it. Maybe uh you know, his feelings were hurt. I mean, I I players said that he was very angry. That's all understandable. Um But I'm just saying what he said, man. This is what happens when we read these articles. That's true, yeah. I bring you the news."
  },
  {
    "text" : "But it is kind of funny to look back at some of these articles at these People were writing at the time, knowing what we know now. Fucking Romboy Bob Duffy getting super pissy about it before the game and then afterwards having to kind of like eat their own words. Fucking Dan Shaughnessy being a miserable prick about it.",
    "timestamp" : "22:46-23:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "No.",
    "timestamp" : "23:09-23:10"
  },
  {
    "text" : "Oh, yeah. Shocking, right?",
    "speaker" : "Andy",
    "timestamp" : "23:11-23:12"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "23:13-23:38",
    "text" : "Um, I will say I I was reading another article that you put up and uh It's said, and again, this is in in line with wishy-washy or not, I don't know. Um, or being up front with players or maybe them having to interpret what he says, but it's said that the Patriots have had more grievances filed against them than any other team in the NFL in the past few years. And that was like before all of this recent stuff. So this is going back to two thousand one, baby."
  },
  {
    "text" : "I mean that yeah. I thought Belichick was installing his system and people weren't happy about it. Although I do wonder how many of those grievances were just from Terry Glenn.",
    "speaker" : "Andy",
    "timestamp" : "23:40-23:50"
  },
  {
    "timestamp" : "23:51-23:52",
    "speaker" : "Mike Melo",
    "text" : "I mean probably a few."
  },
  {
    "text" : "He popped up a couple of times, so Yeah, I mean there was one article after the game about basically Glenn's done. Terry Glenn's done in New England.",
    "speaker" : "Andy",
    "timestamp" : "23:52-24:03"
  },
  {
    "timestamp" : "24:03-24:08",
    "speaker" : "Mike Melo",
    "text" : "Uh because you think with a smirk too, right? One of those, oh my ankle hurts or whatever."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I have the core right here. So it's the wide receiver said he came back to the team ready to play against San Diego, quote, but the other side didn't give an inch and his hamstring started hurting. So do you want to play again this season? The guy interviewing him asked. And his response was, I did want to play for them again, he said. That's D I D, but I don't think I'll be here next season. I don't care if I'm still on this football team. Asked directly if he was if he wasn't playing because he wasn't getting his money. Glenn said, Maybe I'm not getting paid and my hamstring hurts. Smile. So Yeah. Yeah, ship definitely.",
    "timestamp" : "24:08-24:45"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I mean we've we've touched on that a little bit, but um it is funny to as we go through this season to kind of see how that whole scenario played out.",
    "timestamp" : "24:45-24:54"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, this feels like officially because uh we were talking about it earlier that you know we remember the whole saga but we don't remember how it ended. And this feels to me like this week specifically. This is the beginning of the ending. The past few episodes, like there just hasn't been any news on him. Everything was pretty quiet and I thought, oh, maybe that's how it goes. I was just like, Do you think it's time anymore? We asked that question too. We don't know What was the question? If he if Terry Glenn got a Super Bowl.",
    "timestamp" : "24:54-25:24"
  },
  {
    "text" : "I gotta think that he probably did. I don't know if crafting.",
    "timestamp" : "25:24-25:27",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I mean he was on the team. Although a quick Google search now.",
    "speaker" : "Andy",
    "timestamp" : "25:27-25:31"
  },
  {
    "text" : "If you just shut up, you would have got him like a hundred thousand dollar ring at the end of the year.",
    "timestamp" : "25:31-25:36",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:36-26:13",
    "text" : "Here we go. I think you might have to What? Fruh episode this I found an article from February 8th, 2002, entitled Glenn says he would take Super Bowl Ring if offered. Controversial wide receiver Terry Glenn said he probably does not deserve a ring from the Super Bowl champion New England Patriots, but would accept one if offered. That's ridiculous. Wait. Would I deserve a ring compared to the guys who are out there and won the Super Bowl? Of course not, Glenn told the Boston Globe. Uh I was happy for those guys, they're my friends, but I felt like I was still part of your of that organization. I did play some of this year"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, but was that before the rings were handed out or after?",
    "timestamp" : "26:13-26:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Was it February February 8, 2002.",
    "timestamp" : "26:17-26:21"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, they haven't handed them out then.",
    "timestamp" : "26:21-26:23"
  },
  {
    "timestamp" : "26:23-26:24",
    "speaker" : "Mike Melo",
    "text" : "No, I don't think so."
  },
  {
    "text" : "Suitable would have been like February two thousand and two, right?",
    "speaker" : "Steve",
    "timestamp" : "26:25-26:28"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "26:28-26:28"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well yeah, but the rings are usually like the ceremony's like way down the line, isn't it?",
    "timestamp" : "26:30-26:33"
  },
  {
    "timestamp" : "26:33-26:34",
    "text" : "Yeah, in the summer.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "26:35-26:40",
    "text" : "It is a little bit more. So I wonder if uh Wonder if he did or not.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "26:40-26:48",
    "text" : "Now that they've won the Super Bowl, why bother with me, he said. Just reach a settlement. I don't even care about the money. Let's let's just break it off. Poor guy.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "What's up with uh wide receivers?",
    "timestamp" : "26:48-26:50"
  },
  {
    "text" : "Uh I think there's a different breed. They've always been kind of that me first diva mentality. That's always been the stereotype, right? The whole Keyshawn Johnson writing a book called Throw Me the Damn Ball. Right. Tara Lowell working out in his driveway during the offseason.",
    "timestamp" : "26:51-27:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:06-27:23",
    "speaker" : "Mike Melo",
    "text" : "I mean we we follow the Antonio Brown thing up until now, but I guess now looking a little bit worse than I mean we we sort of alluded to the fact that it could go either way, but uh Sir Antonio Brown has uh Gotten into some trouble."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:23-27:25",
    "text" : "Yeah, it's not looking great."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "27:25-27:32",
    "text" : "So again, for those that are listening, you probably know the outcome. Um, you know, we don't spoil it for us."
  },
  {
    "text" : "Um speaking of troubled players, uh the star of this offense of the Saints team was Ricky Williams. Loving Ricky Williams. Yeah. Definitely a a fun dude. Uh I did love how the commentators um commented on his small hands. And how that uh contributed to him not being able to catch the ball or how many fumbles he had. Poor guy. Of all the things he has tiny hands. But after the game, the pages actually did a good job of stopping him, which I I don't know if it was a surprise to me or what, but I just uh I feel like I had this reaction every time I saw him get the ball of like the clenching that we talked about every time I'd see Drew Bledsoe drop back on third down. Uh where you just I feel like he kind of tore the Patriots to bits, but I don't know if that was when he was with the Dolphins. Do you either of you remember? I just I had this like bad feelings when I got the ball shit. Huh? What'd you say, Steve?",
    "speaker" : "Andy",
    "timestamp" : "27:34-28:36"
  },
  {
    "timestamp" : "28:37-28:39",
    "speaker" : "Steve",
    "text" : "It's probably when he was with the dolphins."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah. It's probably when he was with the dolphins. Was he the part of that Dolphins team that ran the Wildcat? That's what I couldn't remember. Oh no, that was Monty Brown. Yeah, okay. Our cousin. I'm gonna go out on limb and say probably not.",
    "timestamp" : "28:39-28:56"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Um yeah. I mean Ricky Williams though had an interesting career. So that that guy was fun to keep tabs on.",
    "timestamp" : "28:56-29:04"
  },
  {
    "timestamp" : "29:05-29:13",
    "speaker" : "Andy",
    "text" : "He was, he was Uh other than that on offense there was Joe Horn who went to the Pro Bowl. He had a decent year, didn't do much. That's a Mr."
  },
  {
    "timestamp" : "29:14-29:15",
    "speaker" : "Mike Melo",
    "text" : "Cell phone, right?"
  },
  {
    "timestamp" : "29:15-29:18",
    "speaker" : "Andy",
    "text" : "Oh, that's right. That was him. Yeah. Yeah"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Where he only had one cell phone stashed in the goalpost. So if he scored in the opposite end, that wouldn't have worked.",
    "timestamp" : "29:19-29:25"
  },
  {
    "text" : "It wouldn't have happened, which is great.",
    "speaker" : "Andy",
    "timestamp" : "29:26-29:28"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:28-29:33",
    "text" : "Um that's gotta be the best TD celebration of all time, right?"
  },
  {
    "timestamp" : "29:33-29:38",
    "text" : "Uh I'm partial to Rainy Moss pretending to moon the crowd, personally.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, which I don't know why. Was it Joe Buck that was like, that is all I can't believe he did that. Sure was, yeah. Come on.",
    "timestamp" : "29:39-29:46"
  },
  {
    "timestamp" : "29:47-29:51",
    "speaker" : "Andy",
    "text" : "Don't get me started on Joe Buck, Michael. All right, we won't get on that so I didn't."
  },
  {
    "timestamp" : "29:51-29:56",
    "speaker" : "Steve",
    "text" : "They made rules after after Joe Horn pulled that cell phone out, right? They're like, no prop."
  },
  {
    "timestamp" : "29:56-30:03",
    "text" : "That's like I think it was between that that was the season, I think, because it was him and um Chad Chocico. Yeah, yeah.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Because he was pulling he pulled a sign out of the snow that said NFL, please don't find me. So they find him for it.",
    "speaker" : "Andy",
    "timestamp" : "30:03-30:08"
  },
  {
    "speaker" : "Steve",
    "text" : "Right. Who's the one T. O. Nealon on the Cowboys star.",
    "timestamp" : "30:08-30:13"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, or the like him just like posing there and gets tackled. That was pretty easy.",
    "timestamp" : "30:14-30:18"
  },
  {
    "speaker" : "Steve",
    "text" : "That's my dude number one.",
    "timestamp" : "30:19-30:20"
  },
  {
    "text" : "That was that was great. He had the uh proposing to the cheerleader. He had the popcorn. Uh he was pretty good.",
    "speaker" : "Mike Melo",
    "timestamp" : "30:21-30:27"
  },
  {
    "timestamp" : "30:27-30:38",
    "speaker" : "Andy",
    "text" : "That's right. Yeah, he was he was he was on his game too. There was some good not as good anymore. It's a shame. I don't know. I mean some coordinated ones are okay, but I don't know. Oh I think even TL."
  },
  {
    "speaker" : "Steve",
    "text" : "I think TO's still on his game, man.",
    "timestamp" : "30:39-30:40"
  },
  {
    "text" : "Oh he's awesome. I'm sure he's still got some good ones.",
    "timestamp" : "30:40-30:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "But to be fair, not making the cowboy sall and TO just like feasting on his tears.",
    "timestamp" : "30:43-30:48"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah. See, to be fair, that season, um, the celebrations were getting a little weak. Like I think Ojo Cinco had like the the rowboat thing where he's paddling, like resuscitate, like a football, like things weren't making sense after a while.",
    "timestamp" : "30:50-31:03"
  },
  {
    "text" : "I mean you run out of ideas, but you gotta like keep doing something, right? Yeah. Score in Barry Sanders and just give the ball back like you've been there before.",
    "timestamp" : "31:05-31:12",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "But I feel that Joe Horn started all this with the cell phone, you know? That's gotta be like first up there.",
    "timestamp" : "31:12-31:18"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "It's gotta be and in recent news, he also got caught in his scam. Did you guys hear about that? The healthcare scam? Oh, he was part of that? He was part of that.",
    "timestamp" : "31:18-31:32"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:32-31:36",
    "text" : "Yeah, I feel like we touched on that recently. A couple other players as well, wasn't there?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I don't know, Clinton Portis was in there, I think.",
    "timestamp" : "31:36-31:37"
  },
  {
    "timestamp" : "31:38-31:39",
    "speaker" : "Andy",
    "text" : "Yes, yes, yes, that's who it was."
  },
  {
    "timestamp" : "31:39-31:42",
    "speaker" : "Mike Melo",
    "text" : "And Rashe Caldwell. That's what it was."
  },
  {
    "speaker" : "Andy",
    "text" : "Well that is a collection of of names. Yeah. Holy shit.",
    "timestamp" : "31:43-31:48"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "It's just it's the news.",
    "timestamp" : "31:48-31:50"
  },
  {
    "timestamp" : "31:50-32:03",
    "speaker" : "Andy",
    "text" : "Yeah. That sure is. Uh let's see. Who else was on this team? Did you know recognize any other names? Sammy Knight was on this team and apparently he was the playmaker."
  },
  {
    "text" : "I remember him.",
    "timestamp" : "32:03-32:04",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "32:04-32:30",
    "speaker" : "Andy",
    "text" : "I don't really remember him, but as a strong safety, he led the team in both interceptions, fumble returns, uh fumble recoveries, and tackles from the saw strong safety position. That would never happen anymore. Although if you're leading your team in tackles from the safety position, that's usually not a good sign. Right. Which is weird because Hazlitt was supposed to be like the defensive coordinator guy. So you think his defense would be the strong point of his team, but it wasn't."
  },
  {
    "timestamp" : "32:30-32:34",
    "speaker" : "Steve",
    "text" : "I had no idea who their quote unquote lockdown corner was."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "32:34-33:33",
    "text" : "Yeah, they kept talking about him through the whole game, but who was it? Yeah, I don't remember the name either because they they talked about him early. Be like, oh, they they picked him up from somewhere and he was supposed to be this really good um Defensive back, he was he wasn't that great before. I don't know, he was going through injuries or something, but this year he really stepped it up and he's he's become a shutdown corner corner. Um Let's see, was it Fred Thomas? So let's see, Sammy Knight and Jay Bellamy were the safeties Kevin Mathis and Fred Thomas were the Yeah, it's Fred Thomas. I think it's Fred Thomas. And they're like and he's gonna cover Troy Brown in this game and Troy Brown's gonna have a tough time with him. And he didn't. Or did he? Uh no, he had seven catches. Hey, what's 91 yards and a touchdown?"
  },
  {
    "timestamp" : "33:33-33:35",
    "speaker" : "Mike Melo",
    "text" : "Or we could just ruin the whole game for everybody."
  },
  {
    "timestamp" : "33:35-33:42",
    "speaker" : "Andy",
    "text" : "Well, I mean we're this far in, we haven't actually talked about that. Troy Brown game. Yeah, this was this was a quality Troy Brown game."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "33:42-33:47",
    "text" : "I will say Leroy uh Glover on the Saints, by the way. I remember him and he was kind of a beast."
  },
  {
    "text" : "I remember him just for his name. It was LaRoy with the apostrophe and Glover, which sounds like a glove and then That was a very big thing. I remember that same one. That's it. Willie Rofe, yeah. I remember that name too, but sick name for a big fat offensive lineman guy.",
    "timestamp" : "33:47-34:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:06-34:08",
    "speaker" : "Steve",
    "text" : "I mean Like meet Roaf."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:09-34:17",
    "text" : "Yeah, I'm surprised there were there wasn't those jokes in there actually. They they had one pun about Roaf, but I don't remember what it was, and it wasn't very good."
  },
  {
    "timestamp" : "34:18-34:21",
    "speaker" : "Mike Melo",
    "text" : "So did you touch on Boo Williams then? Because you wrote it down."
  },
  {
    "timestamp" : "34:21-34:43",
    "speaker" : "Andy",
    "text" : "I wrote down Boo Williams, but the the note that I had on here, if we're gonna pull the the kimono aside, is a great name, mediocre tight end. Did you know who he was before I wrote his name down? Um ye well there was that time that I didn't, no. Yeah, that's what I thought. All right, g the game. How did what did you think of the game?"
  },
  {
    "text" : "I thought it was a uh strong start for sure for the Patriots.",
    "timestamp" : "34:43-34:49",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "34:49-34:57",
    "speaker" : "Andy",
    "text" : "I feel like the Pages have had strong starts this season, kind of generally. And then they fade at the end, which is very unpatriot like these days."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well, funny you mentioned that because uh The they were mentioning that the uh Patriots scored first nine out of eleven times um so far that season. Pretty impressive.",
    "timestamp" : "34:57-35:09"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:09-35:15",
    "text" : "It is. I don't know. I thought they kind of put it away in the end of the third beginning of the fourth quarter drive for that touchdown, but they just ran out of the way."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Whoa, whoa, whoa, whoa, whoa, that's true. Jeez.",
    "timestamp" : "35:15-35:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:23-35:25",
    "text" : "Bro, we're like 45 minutes into this podcast."
  },
  {
    "timestamp" : "35:28-35:30",
    "speaker" : "Mike Melo",
    "text" : "Settle down. We gotta talk about the first drive, baby."
  },
  {
    "timestamp" : "35:31-35:43",
    "text" : "All right, talk about that first drive. Uh you can do it if you want. Oh what? Like four or five plays of it? It wasn't very long because it Uh yeah, let's say one, two, three, four.",
    "speaker" : "Andy"
  },
  {
    "text" : "I mean it ended with the forty-one yard screen pass to Antoine Smith, which just say that.",
    "timestamp" : "35:43-35:48",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "That play call was tremendous.",
    "timestamp" : "35:48-35:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah, great timing.",
    "timestamp" : "35:51-35:52"
  },
  {
    "timestamp" : "35:55-36:23",
    "text" : "It's one of those plays that I feel like you don't see enough. Uh that kind of everybody rolls out to one side and then it's the kind of the throwback screen to the other side, to the empty side of the field. And On this play, it was Antoine Smith and two offensive linemen on one half of the field. It was just them and there was nobody else out there. I think the the two the two blockers got what twenty, thirty yards down field before they hit anybody?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:23-36:23",
    "speaker" : "Mike Melo",
    "text" : "Yeah."
  },
  {
    "timestamp" : "36:24-36:33",
    "speaker" : "Andy",
    "text" : "And it was like both safeties were the only ones that like had to come all the way back across. The only ones that had any sort of angle on the play, and they both got blown up by By the offensive linemen who were down the field."
  },
  {
    "timestamp" : "36:33-36:40",
    "text" : "And didn't Brady like throw a block on that play as well? Was that the play? No, he was on the opposite side of the field, but he did throw a block sometime.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "36:41-36:54",
    "speaker" : "Andy",
    "text" : "He did. Um it was when they tried to run a reverse. Oh, that's right. And they had him out there as a lead blocker, but it got blown up in the backfield, so Antoine Smith just ate the ball and and didn't pitch it. That's right, that's right."
  },
  {
    "speaker" : "Steve",
    "text" : "Which I thought was smart.",
    "timestamp" : "36:55-36:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh I would have liked to see him toss it. I thought, yeah, he was hemmed in, but I thought uh Patton had.",
    "timestamp" : "36:57-37:03"
  },
  {
    "text" : "Yeah, then you know they would have fucked that up though. It's a prime fuck-it-up spot.",
    "speaker" : "Steve",
    "timestamp" : "37:04-37:08"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know, not in this game.",
    "timestamp" : "37:08-37:09"
  },
  {
    "text" : "And in the same defense on that first touchdown, like how many balls did Antoine Smith catch? He's like Sony.",
    "timestamp" : "37:09-37:16",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he he wasn't a big pass catcher, just in general. I agree.",
    "timestamp" : "37:17-37:21"
  },
  {
    "text" : "Like if it'd been Kevin Falk and they got burnt on that, you're like, come on guys, what are you doing? Of course it's gonna be a screen of Kevin Falk.",
    "speaker" : "Steve",
    "timestamp" : "37:21-37:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah, but you you don't expect The Spanish Inquisition or the screen pass to Antoine Smith.",
    "timestamp" : "37:26-37:32"
  },
  {
    "text" : "I will say Vinateri in the ensuing kickoff and every kickoff probably this entire year sucked at uh getting it past what, the 20-yard line?",
    "speaker" : "Mike Melo",
    "timestamp" : "37:33-37:42"
  },
  {
    "text" : "Yeah, I mean he was never really known for that, yeah. I feel like he was never really known for his booming kickoffs. And the Patriots always seemed to try to Not kick touchbacks unless it's a really dangerous.",
    "timestamp" : "37:42-37:58",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, but at least with uh Gaskowski, there's like he puts it at the one. Vinateri puts it at like the fifteen.",
    "timestamp" : "37:59-38:06"
  },
  {
    "text" : "That is true, yeah, and gives them a running start.",
    "timestamp" : "38:06-38:09",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "38:09-38:17",
    "text" : "Right. Oh, you're right. Oh, Steve Brad. That's a little something. Yeah, good call.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "So yeah, I and I think there was an article in one of the the Globes um days about how you can't really blame Adam Vinateri because his kick coverage team is is god-awful was the gist of it. And I don't know I fully agree with that because I think it's all into play, but I am surprised how bad this kick, like just the special teams in general, are in this season. I don't know if just because Belchak hasn't got his scheme fully implemented or what's going on, but it is kind of surprising because last game there was a comment about how The Rams and the Patriots were the two worst uh kick coverage teams in the league. And yet somehow they both end up going to the Super Bowl.",
    "timestamp" : "38:17-39:06"
  },
  {
    "timestamp" : "39:06-39:10",
    "text" : "Spoiler alert. I couldn't stop that one, guys. Sorry.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "39:12-39:17",
    "text" : "I had no idea Deuce McAllister turned kicks either. He was super good in this game."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:17-39:39",
    "text" : "Yeah, well that's kind of all he did on this Saints team. He was the running back. He was the third yeah, well he was the uh third leading rusher on this team behind obviously really Ricky Williams and so I think he had like under a hundred yards, wasn't it? Yeah, he had he did. Yeah, his stat line was actually pretty legit. He had he finished the season with 91 rushing yards, but had a long of 54."
  },
  {
    "text" : "Doesn't he like he must be good later on in his career then? Because I remember Deuce being pretty solid. Yeah, I think you're right.",
    "timestamp" : "39:40-39:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I think so too. I think uh didn't he go on to play with He was with another back. Eagles. Yeah, the Eagles, I think. No, maybe not. Maybe you're thinking of Brian Westbrook.",
    "timestamp" : "39:47-39:57"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "39:58-40:03",
    "text" : "Mark Ingram and uh Kamara with Deuce McAllister and somebody else in New Orleans."
  },
  {
    "timestamp" : "40:03-40:06",
    "text" : "Let's see. Yeah. Um yeah, I mean actually.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "40:06-40:13",
    "speaker" : "Mike Melo",
    "text" : "I just want to put it out there that we're not experts on any of this. So anything that we say could potentially be completely inaccurate."
  },
  {
    "speaker" : "Andy",
    "text" : "Nah, C Brown nailed it after this season. Uh Deuce McAllister ran for 1300, 1600, and then just over a thousand yards in three seasons.",
    "timestamp" : "40:13-40:23"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:23-40:29",
    "text" : "Yeah, in your fucking face, Mike. And then he must have got injured. Oh my lord. He really said throwing the disclaimer out after I said."
  },
  {
    "timestamp" : "40:32-40:34",
    "speaker" : "Andy",
    "text" : "Well that we've already covered that in the in the right."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Let me rephrase. Um anything that Andy says is probably bullshit because he doesn't know what he's talking about. Is that better, Steve?",
    "timestamp" : "40:35-40:42"
  },
  {
    "timestamp" : "40:43-40:43",
    "speaker" : "Steve",
    "text" : "No."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Okay.",
    "timestamp" : "40:44-40:44"
  },
  {
    "timestamp" : "40:46-40:47",
    "text" : "Good answer.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "40:47-40:49",
    "text" : "Oh boy. This is starting off well."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:49-40:51",
    "text" : "Oh good. My headphones."
  },
  {
    "timestamp" : "40:56-40:58",
    "speaker" : "Mike Melo",
    "text" : "We're not in hour and fifty nine. Where are you guys getting these numbers?"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah, you shut up way late. Sorry.",
    "timestamp" : "40:58-41:00"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, my monitor was broken, guys. Sorry. God, you're late one time, a half hour. Everybody loses their shit.",
    "timestamp" : "41:01-41:08"
  },
  {
    "timestamp" : "41:09-41:11",
    "text" : "Well, you were so late that my headphones died.",
    "speaker" : "Andy"
  },
  {
    "text" : "What does that mean? You're on uh Bluetooth?",
    "timestamp" : "41:12-41:14",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I was.",
    "speaker" : "Andy",
    "timestamp" : "41:14-41:15"
  },
  {
    "text" : "Oh boy. This is a great conversation.",
    "timestamp" : "41:15-41:17",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "41:18-41:37",
    "text" : "Oh yeah. Alright. So The other thing I think we can talk about is the kicker, which we didn't touch on before, because John Carney on the season missed three field goals the entire season. Two of them were in the first quarter of this game. One he missed.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "41:37-41:41",
    "text" : "It was a longer kick, I think, on the the Did he miss three or four, Andy?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:42-41:49",
    "text" : "I don't know. Ma math's not as strong. We ain't professionals here, like you said. I don't do math."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "But anyways, yeah, you're right. Two two missed field goals.",
    "timestamp" : "41:49-41:52"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:52-41:58",
    "text" : "Yep. And one of them was blocked by our boy, Richard Seymour. Caught him right now."
  },
  {
    "text" : "That's right. Although Vinateri missed one as well, so rough day for the kicking game.",
    "timestamp" : "41:58-42:02",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, I feel like we can chalk this one maybe up to the the weather with the wind and the rain, but I don't know. I feel like Vinateri hasn't been as automatic this season as I remember him being. You know, you remember him just like never missing a kick?",
    "speaker" : "Andy",
    "timestamp" : "42:03-42:16"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "42:16-42:16",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "But he's actually missed quite a few in this season.",
    "speaker" : "Andy",
    "timestamp" : "42:16-42:18"
  },
  {
    "timestamp" : "42:18-42:22",
    "speaker" : "Mike Melo",
    "text" : "I know I think it happened after the 2001 season for some reason."
  },
  {
    "text" : "Yeah, they weren't great. Yeah. So something something clicks eventually. Steroids.",
    "timestamp" : "42:28-42:33",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "42:36-42:37",
    "text" : "Allegedly.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Allegedly, yeah.",
    "speaker" : "Andy",
    "timestamp" : "42:37-42:38"
  },
  {
    "timestamp" : "42:40-43:09",
    "speaker" : "Mike Melo",
    "text" : "Um but anyways the rest of this game we could pretty much fast forward to um right before halftime because it was 7-0 pats. Um but for like a 7-0 game they look really good. Uh wasn't it thirteen nothing? Well, I'm saying before the half. So before that drive, it was seven nothing until about like, you know, a minute and a half left in the game. Uh I mean uh a minute and a half left in the half. And uh Paths were up seven nothing. Third touchdown thirteen nothing"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:09-43:15",
    "text" : "Yeah, they went up they went up in the drive, guys, they it was a seven nothing game."
  },
  {
    "timestamp" : "43:16-43:21",
    "speaker" : "Andy",
    "text" : "They went into the half up twenty to nothing. You're right, my notes are fucked up."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Alright, well guys, let's fast forward to that driver. It's 13-nothing. No, I don't know what you guys take over. You guys have flustered me.",
    "timestamp" : "43:21-43:30"
  },
  {
    "text" : "I don't know what's going on. Yeah, I I mean uh you you missed the uh the Brady touchdown pass to Troy Brown, where afterwards the I thought that was the one, but it wasn't. Your boy Ken Walter. uh was holding the extra point, your your your punter there. And he kind of when he the snap was high, so he caught it like in his chest, so kind of fumbled a little bit putting it down. And then Adam and Terry didn't get to him quick enough. He's like, fuck it. And just like pulled it and ran all by himself.",
    "speaker" : "Andy",
    "timestamp" : "43:30-43:58"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, I don't know what that was.",
    "timestamp" : "43:58-44:00"
  },
  {
    "timestamp" : "44:00-44:02",
    "text" : "And got lit the fuck up.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "44:02-44:04",
    "speaker" : "Mike Melo",
    "text" : "You're right. I apologize, guys."
  },
  {
    "speaker" : "Andy",
    "text" : "But no, but you're right, because then, you know, there there was a a bunch of like uh back and forth here, like everybody going three and out.",
    "timestamp" : "44:04-44:12"
  },
  {
    "timestamp" : "44:13-44:20",
    "text" : "I just had to note that like the game was like there wasn't a lot of action, but the pads looked like they were dominating for some reason.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it did, yeah, because the The Pats were winning the battle of field position even when they weren't scoring. Like they were even when they were punting, they were they were downing the ball inside like the five-yard line every time. Uh the Saints would get out of their own ends with either some random amazing catch on a deep pass or something. They get to like the 50 and then like sputter. Either miss a field goal or punt it back or whatever. But then like you said, right at the end of the half the first play of the drive, Brady, this is the one that Steve was talking about earlier, Brady gets hit from behind. And gets like it's that snap back of your head that you used to see in all the uh those NFL's greatest hits uh VHS tapes. You remember those? Oh yeah. And it was just all of those like quarterbacks getting blinds that's all they were. And it was that type of hit and Brady lost the ball, but somehow the pass recovered. It didn't even look like they should have. Um and then they run a couple plays and that was at the 15, right? Yeah, Antoine uh gets like a bunch of yards on both plays, like 10, 15 yards on each play. So it gets them like midfield, so they're like All right, there's this I think 30 seconds left at this point, and they're just gonna start airing it out, try going for the touchdown. And Brady Finds what was his name? Charles Johnson? Is that right? Yeah. Yeah. I think Charles Johnson's only touchdown from Tom Brady. But it was an absolute fucking laser.",
    "timestamp" : "44:20-45:51"
  },
  {
    "timestamp" : "45:52-45:58",
    "speaker" : "Steve",
    "text" : "Oh, that was one of the best throws Barry's ever made, I feel. Like over the linebacker in between the safety and the cornerback."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep.",
    "timestamp" : "45:58-45:59"
  },
  {
    "text" : "But the window was was minute.",
    "timestamp" : "45:59-46:02",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, it was an amazing throw.",
    "timestamp" : "46:02-46:03"
  },
  {
    "timestamp" : "46:04-46:38",
    "text" : "See, maybe I wanted to jump the gun here because um so yeah, so I guess that made it 20-nothing. So it was 13-nothing. But what I did wanna point out about that drive, um, outside of that like crazy, you know, laser to Johnson. was on that drive, um Brady was rolling out to the left. He was rolling out to the right at one point. Um he he's diving for first downs, uh long pass to David Patton and then a touchdown to Johnson. So I felt like that was a statement drive for the year, and I called it the drive of the year up to this point.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I would agree with that. Uh, because I think that y the only other one that I can think of off the top of my head would be the one against San Diego to tie it uh at the end of the game. But that was like his first comeback win. Right. I think this was his like statement of I'm not fucking around here. I'm not overwhelmed. I belong in the NFL. I am a starting quarterback, sort of thing.",
    "timestamp" : "46:39-47:02",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:02-47:08",
    "speaker" : "Mike Melo",
    "text" : "Yeah, and it was a it was amazing with eight seconds left. Uh as well called the drive of the whole season, right?"
  },
  {
    "timestamp" : "47:08-47:14",
    "speaker" : "Andy",
    "text" : "Up to this point, yeah. Up to this point. I don't I don't know what's to come. Turning point."
  },
  {
    "timestamp" : "47:14-47:22",
    "text" : "Yeah, I'll I'll give you that. I mean it's pretty amazing for for anybody who has access to that drive, it it is pretty textbook. Yeah. It is.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "And and Tom Brady had that that one long run too. I was I feel like I was surprised at how active Brady was in the run game in this game. Like he was taken off if there was nothing open. He wasn't getting very far because he's not fast. But uh at one point in the fourth quarter, they called a design quarterback draw.",
    "timestamp" : "47:22-47:42"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "47:43-47:46",
    "text" : "I have on here Brady looks like a baby deer running."
  },
  {
    "text" : "He looks like a newborn deer running. He just hasn't quite figured out how his legs work yet.",
    "speaker" : "Andy",
    "timestamp" : "47:47-47:51"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "47:51-47:52"
  },
  {
    "timestamp" : "47:52-47:53",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "In one of the plays though where he was like rolling out, he must have ran like 40 yards before gaining like eight, I think.",
    "timestamp" : "47:53-47:59"
  },
  {
    "timestamp" : "47:59-48:15",
    "speaker" : "Andy",
    "text" : "I think that's one of the longest runs of his career, too. Yeah, it was amazing. Oh, Tom. But I think because of that, um all the I and I I think both uh Antoine Smith had a really good running game too in this game."
  },
  {
    "text" : "Oh yeah, he crushed him.",
    "speaker" : "Steve",
    "timestamp" : "48:15-48:16"
  },
  {
    "timestamp" : "48:17-48:47",
    "speaker" : "Andy",
    "text" : "And that opened up the the Tom Brady patented play action. I think my favorite one that I forget they I I don't think they run it much anymore. But that they fake the pitch and then he kind of spins around real quick and throws a quick slant to whoever it is. That play that that used to be a staple, I I thought. So I remembered it. I I saw it in this game, like, oh I love that play. But I don't remember that and they don't run that really anymore. At least not that way."
  },
  {
    "timestamp" : "48:52-48:53",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "48:53-49:21",
    "speaker" : "Andy",
    "text" : "But the one play that they did run which I think has been kind of the bread and butter was the direct snap play to Kevin Falk. Mm-hmm. Did you see that one? Yeah. And uh but the favorite part of that play was Tom Brady dropping back to pass without the ball in his hands. And it fooled like the entire defensive line. Like they're all rushing upfield to get to him. And Kevin Falk's like four or five yards downfield already."
  },
  {
    "timestamp" : "49:22-49:33",
    "speaker" : "Mike Melo",
    "text" : "Is that the one where the announcers were like freaking out at how much he sold that? Yes. Yeah, like look at this kid. He's actually he's pretending to hold the ball."
  },
  {
    "text" : "What gumption? I don't also do have any of you heard of either of these commentators?",
    "timestamp" : "49:34-49:40",
    "speaker" : "Andy"
  },
  {
    "text" : "No, but they were fine. Uh they were fine, but they did leave me very confused. Um and you know What was that? Are we gonna do this? Yeah, we're gonna do this. We can do it, man. Uh again, I try not to every week, but it uh these guys, I mean Bill Moss especially was fantastic.",
    "timestamp" : "49:41-49:59",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "So let's introduce them first. There's Sam Rosen and Bill Moss, who I've never heard of.",
    "timestamp" : "50:00-50:04",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "50:05-50:42",
    "speaker" : "Mike Melo",
    "text" : "Uh me neither, but he had some pizzazz. Apparently, in one of the articles um that you had posted, uh people were not happy with him. because uh the uh the article said that the p the PC police was out to get him because he said that the um the line was winning in the trenches right and They thought that that was a military reference and that was too risque. Um, so he had flack about that. So it was it's interesting because we think that Everything's incendiary now, but he was getting flaked for making a military reference, which I thought that was like common terms."
  },
  {
    "text" : "Oh yeah. Yeah. But again, I don't know anything. The amount of military terms in football lingo is like eighty percent of all football terms.",
    "timestamp" : "50:42-50:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, so bomb all of it. That wasn't even part of my football or not football because I figured tr in the trenches was just a sort of metaphor. Yeah, it's pretty pretty easy to figure out. Okay. Um he also said this, which I thought was funny, but he goes, ever since they sent Kyle Turner of the Saints to anger management. uh the whole team has gotten a little softer and he starts laughing and then the other announcer just goes, maybe.",
    "timestamp" : "50:52-51:17"
  },
  {
    "text" : "I wrote that down to.",
    "timestamp" : "51:18-51:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:23-51:31",
    "text" : "I guess he was like freaked out in the game before when they were playing the Rams in the locker room and like throwing a bunch of shit and hit people in the team."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he was talking something about I I didn't quite follow what he was talking about, but yeah, somebody was like breaking shit in the at at halftime or something like that, and they came back and won the game or something, I think he was talking about",
    "timestamp" : "51:32-51:43"
  },
  {
    "timestamp" : "51:43-52:08",
    "speaker" : "Mike Melo",
    "text" : "Wow, yeah. I don't know, but Bill Moss, he's he's very close to Brent Jones in my opinion, but uh we got the same van for sure. We can uh we can go down my my list if you guys want. Um I I guess the first question would be so he said see Brewski number 54 at the bottom of the pile down there. There's a lot of banging going on What is that? Is that football or not football?"
  },
  {
    "timestamp" : "52:09-52:18",
    "text" : "Uh I think it's football. I think the bang they're talking about is is banging their pads together, probably. Bang their bodies together.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Uh wait, yeah, but if you're in the bottom of if you're at the bottom of a pile though, like hasn't the collision already happened or I'm confused about that?",
    "timestamp" : "52:19-52:27"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:27-52:31",
    "text" : "Yeah, I think I think that's why he's at the bottom of the pile is because he did a lot of banging."
  },
  {
    "timestamp" : "52:31-52:36",
    "speaker" : "Mike Melo",
    "text" : "Oh well, he's talking about the process of the pile happening. I think so. Not when he's actually down there."
  },
  {
    "timestamp" : "52:37-52:42",
    "speaker" : "Andy",
    "text" : "I I'm I'm guessing, yes. I don't want to speak for it, I don't want to put words in his mouth, but that's my assumption."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Okay. Steve? Yeah, I don't know. It could be either way. Okay. Thank you for that. Um the next one. He wants it all the time, and if you don't give it to him often enough, he kind of gets his dauber down a little bit and then becomes ineffective. His dauber.",
    "timestamp" : "52:43-52:58"
  },
  {
    "timestamp" : "53:05-53:10",
    "speaker" : "Andy",
    "text" : "Yes, it was about Joe. So Joe Horn getting his dauber down. Yeah, what does that mean?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "53:10-53:12",
    "text" : "I don't know what a dauber is."
  },
  {
    "text" : "If I'm being honest, that that might be a dick joke. Really? Talking about Dauber being down? I mean, he was because he was talking about like you need to feed him. footballs or else he uh turns into Randy Moss and and gets his dauber down. And so I think he's like he's probably just gets a hard arm for getting catches.",
    "speaker" : "Andy",
    "timestamp" : "53:12-53:30"
  },
  {
    "timestamp" : "53:30-53:39",
    "speaker" : "Mike Melo",
    "text" : "See, because that's weird, because it's like he wants it all the time. If you don't give it to him often enough, he kind of gets his dauber down, right? Which that kind of makes sense, and then he becomes ineffective."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, well see, there you go. So I think I think the first part is uh is about getting footballs throws.",
    "timestamp" : "53:39-53:46"
  },
  {
    "timestamp" : "53:47-53:50",
    "speaker" : "Mike Melo",
    "text" : "Um and that that's so the second part you think is is a dick joke."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:51-53:51",
    "text" : "I think so."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "All right. Yeah, he I mean Bill Moss had a hell of a game. Um next one. Uh maybe now that you guys said that halftime thing, maybe it makes a little bit more sense. Uh this quote but he said about this game I wish we had a camera in the Saints locker room at halftime. I'd like to see that. You know, it would have to be one of those pay-per-view channels to watch. What the hell uh now I I guess I kinda get it, but at the time I didn't. Maybe he's talking about the swearing.",
    "timestamp" : "53:52-54:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:18-54:22",
    "text" : "Yeah, definitely. You can't swear on network television, can you?"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "54:22-54:25",
    "text" : "Okay, so that's what he wanted to see in the locker room. Maybe."
  },
  {
    "timestamp" : "54:25-54:28",
    "speaker" : "Andy",
    "text" : "Or maybe maybe he thinks it's like WWE sort of style."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "With like shipping thrown around. I think so.",
    "timestamp" : "54:28-54:32"
  },
  {
    "timestamp" : "54:32-54:36",
    "text" : "Usually it was back then for sure. Yeah. Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "54:36-54:59",
    "text" : "So alright. So I guess that's football. And then the last one, again, I don't know. Uh two men coming hard, Bruski and Malloy. Two men coming hard. Brisk brisky and believe. No, filling the hole. No, we've talked about filling the hole, which I get. We've talked about putting juice in the hole, which I get. But like too many coming hard. I haven't heard that one yet.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "54:59-55:03",
    "text" : "Well they're they're coming hard to fill the hole. They're running very quickly to come fill that hole.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "55:03-55:14",
    "speaker" : "Mike Melo",
    "text" : "Oh, because they're defenders. Yes. Gotcha. All right. It's all communicated. That makes sense. But yeah, I think so that that was pretty much it. Thank you guys for helping me out there."
  },
  {
    "timestamp" : "55:14-55:28",
    "speaker" : "Andy",
    "text" : "You're very welcome. Yeah, Bill Maas, you're right. He did have himself quite the game. There was one part where he was legitimately arguing with the referees. Yeah, I love that. On the uh because I also loved how like anti-PI he was."
  },
  {
    "timestamp" : "55:28-55:32",
    "text" : "Like that's not passive appearance. He's like, ah, nah, that's stupid ass reps.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. See but yeah, because one of them was uh it was on a punt and I think it was Gerard Cherry stepping in and like got back into the field of play and down the ball at the one. And the refs like as he's as the ref is explaining that he got a bit, he's no, no, he did not re-establish himself, like literally yelling at the TV as if he's Me watching the TV. I like that. They literally show the replay afterwards where he got like you have to get two feet in, you got like four steps in. He's like, well Maybe.",
    "timestamp" : "55:33-56:06"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I hope we get him again in a few days.",
    "timestamp" : "56:10-56:12"
  },
  {
    "text" : "It was exciting. He did also have he went on a rant about um The defense having 12 guys on the field. You see that? It's like that should be a penalty even if they get off in time. Even if the twelfth guy gets off the field in time. Because the defense isn't gonna or the offense isn't gonna know who's blitzing. Like well one, you don't blitz every play. And two, the offense like Well, I mean he's got a point.",
    "timestamp" : "56:13-56:37",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:37-56:41",
    "speaker" : "Steve",
    "text" : "If you have twelve men in the huddle on offense, that's an automatic penalty before you can even break the huddle"
  },
  {
    "text" : "It's true, but defenses don't have huddles, so it doesn't quite count. And the reason was to stop you from putting everybody on the field and then having enough guys run off so that the defense can't adjust and put their personnel on. Right. It's the offense that's dictating the personnel on the field.",
    "speaker" : "Andy",
    "timestamp" : "56:41-56:58"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Chances are the guy running off the field is not blitzing. Right. Pretty sure. I think you're right.",
    "timestamp" : "56:59-57:07"
  },
  {
    "speaker" : "Andy",
    "text" : "But hey, let's give it up to Bill Mox. Yes. All right. Great. Clapping on a podcast. That's that's gonna sound really good. All right, you guys have anybody else you want to talk about?",
    "timestamp" : "57:07-57:20"
  },
  {
    "text" : "I mean, you know, after drive of the year, it's all downhill from there. Yeah, I think I mean I I would say that New Orleans made a pretty good push. It was twenty-seven seventeen at one point.",
    "speaker" : "Mike Melo",
    "timestamp" : "57:25-57:37"
  },
  {
    "text" : "Yep. Yep. They uh they yeah, at the end of the third quarter it was twenty to ten. They they pulled it back within ten a couple times. But every time they did the Pace who just drive down the field and score a touchdown.",
    "speaker" : "Andy",
    "timestamp" : "57:37-57:47"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "57:47-58:00",
    "text" : "Well there's that that last touchdown with Antoine Smith that they just ran it the whole time. Yeah. And then if you notice, right, when he scored from like the two-yard line or whatever it was, like the entire offensive linemen all at the same time put up their arms."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:00-58:01",
    "text" : "Yeah."
  },
  {
    "text" : "Like that O line was so stoked on that. I mean, they had he had like a hundred and no, they had 193 or something like that yards running. They're pounding it down.",
    "speaker" : "Steve",
    "timestamp" : "58:01-58:10"
  },
  {
    "text" : "Yeah, and Brady almost had 300 yards passing and four touchdowns, so they were firing on all offensive cylinders there.",
    "timestamp" : "58:10-58:15",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Snoon had 191 yards rushing. And 258 yards passing and four touchdowns.",
    "timestamp" : "58:16-58:24",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:24-58:49",
    "speaker" : "Mike Melo",
    "text" : "Um I did like the stat that uh I like the stat that they basically said that New Orleans allowed forty-five yards of uh you know whatever run games, run plays up the middle the entire season up to that point. So forty-five yards up the middle, and then that game Uh Antoine Smith got I think it was 75 yards up the middle. So he he almost doubled that. Oh, he's crushing him."
  },
  {
    "timestamp" : "58:49-58:54",
    "speaker" : "Andy",
    "text" : "All right, let's do uh some best and worst. Mike, you want to go first?"
  },
  {
    "timestamp" : "58:56-59:54",
    "speaker" : "Mike Melo",
    "text" : "Yeah, it was great. I mean the first half was unbelievable. So and and that drive really pumped me up. I mean it was definitely a taste of what was to come. Absolutely. Uh let me see. Uh let me see best and worst here. Um I'll start off with my worst. All right. The uh announcers were having uh trouble telling the difference between David Patton and Troy Brown the entire game. They were blaming you on the dirty jerseys. I don't I don't know. I just don't know if I like that. Um kind of bothered me. So that was my worst. And then my best wasn't actually from the game, but it was hearing that Brian Cox was running at warmups after breaking his leg earlier in the season. Yes. So that's pretty amazing. I don't know what he was taking, probably steroids, but yeah. Uh he Remember 'cause in earlier uh earlier episode we mentioned something to the fact of uh we didn't remember what happened at Cox and he probably would not return."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "59:54-59:54"
  },
  {
    "timestamp" : "59:54-01:00:03",
    "speaker" : "Mike Melo",
    "text" : "Um but here we are, six games left, I believe, five games and uh They're talking about him coming back uh and playing against the Jets."
  },
  {
    "text" : "I know. Yeah, no, that was uh that was that was exciting to see actually. That ties into mine. But Steve, you go f you go do yours first.",
    "speaker" : "Andy",
    "timestamp" : "01:00:03-01:00:11"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:12-01:00:16",
    "text" : "Um best and worse. The best was that Brady throw on that third touchdown."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:00:17-01:00:17"
  },
  {
    "speaker" : "Steve",
    "text" : "That was awesome. And I have like a worse for the Saints.",
    "timestamp" : "01:00:17-01:00:22"
  },
  {
    "timestamp" : "01:00:22-01:00:23",
    "speaker" : "Andy",
    "text" : "Yeah, that's funny."
  },
  {
    "timestamp" : "01:00:26-01:00:50",
    "speaker" : "Steve",
    "text" : "Where like for somehow he didn't see Lori Molloy literally standing like three yards in front of him. And he just throws it right at him. He just deflects it up in the air if he pleasing gets it. Yeah, it wasn't great. Like I don't I don't know what how do you he's literally standing right in front of him and he just locks it at his face. He was like trying to like stop the ball from mid with the base and just ended up deflecting it up."
  },
  {
    "timestamp" : "01:00:50-01:01:05",
    "speaker" : "Andy",
    "text" : "Well he did that a couple times. He hit uh he hit um Vrabel right between the five and the zero in his jersey. That should have been a pick. And Vrabel wasn't even like he wasn't even coverage. He was coming around on like a stunt. Just got hit right in the chest."
  },
  {
    "timestamp" : "01:01:06-01:01:25",
    "text" : "And then my Patriots worst was Ty Law just getting absolutely torched by Joe Horn on that long deep ball when they were back up their yard line. And Joran just ran straight and just absolutely burned. And if like Brooks had not underthrown it terribly He probably would have got six out of it.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:01:25-01:01:30",
    "speaker" : "Andy",
    "text" : "Yeah, but he made the catch and um they got called for a PI anyway."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:01:30-01:01:37",
    "text" : "Oh, Tylaw was on him while he caught the ball, so that was an incredible catch regardless, but yeah, pretty bad play."
  },
  {
    "timestamp" : "01:01:37-01:01:37",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:01:38-01:01:46",
    "text" : "But if Aaron Blooks didn't blow, he just puts more air into that ball and Joe Horns gone. Yeah. Oh yeah. Two steps on tie. That's true."
  },
  {
    "timestamp" : "01:01:47-01:02:51",
    "text" : "All right. Um so my best was um Brian Cox talking to the media after the game uh uh before the game. uh talking about um the quarterback controversy and uh so the the quote in the globe was according to the injured linebacker there's no quarterback controversy in New England, only a media core looking for trouble in capital letters. There would never be a controversy like this in any other town. According to Brian Cox. Oh no, this is fucking gorgeous writing this, of course. Oh no. Quarterback controversies exist only in Foxboro, never in places like New York or Chicago, which were among Cox's previous playing addresses. Not like this, Cox said. This is real foolish. You guys are trying to undercut Bill. He's trying to make a decision that's best for the team. You guys don't know the situation. I don't think it would be this bad in New York Some of the media up here are not capable of making the choice of who should be the quarterback. They don't know. They don't see the tape. So fucking Brian Cox coming out here and he's got Bill Belichick's back.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:02:51-01:02:56",
    "text" : "Plus that's saying a lot, because he did come from those places. So if he thinks the media It's even worse."
  },
  {
    "text" : "It's worse than New York. That doesn't lie.",
    "speaker" : "Andy",
    "timestamp" : "01:02:56-01:02:59"
  },
  {
    "speaker" : "Steve",
    "text" : "New York media is better than the Boston Media. It's saying something.",
    "timestamp" : "01:03:00-01:03:03"
  },
  {
    "timestamp" : "01:03:05-01:04:05",
    "speaker" : "Andy",
    "text" : "And uh Troy Brown also I this isn't this is kind of tied into he kind of handled it similarly where uh uh in the article, it's a similar article, it's a Troy Brown, the Patriots senior and top receiver, rolled his eyes when he looked up from his locker and saw a media posse. swarming him, wanting to talk about why Belichick chose they were kind of uh all on the same page it seemed like the only people that were up in arms about it were media which It's still playing out to this day with the the blood so decision making stuff, which again, probably sorted out by the time you listen to this, but don't spoil it for the rest of us. Um, let's see, my worst was uh was Ricky Williams after the game. talking about uh how he thought he had a good game and how the he didn't think the the pages defense stopped him. So he only ran for Ricky Wins. He was like leading the league in in yards, I think."
  },
  {
    "timestamp" : "01:04:06-01:04:07",
    "speaker" : "Mike Melo",
    "text" : "I think he was third in the NFL."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:04:07-01:04:08"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:04:08-01:04:09",
    "text" : "First in the NFC."
  },
  {
    "text" : "Right, right, yeah. In rushing yards. And he was like up there in total yards as well. I think he was like second in total yards from scrimmage. Uh so they're talking about asking him about you know, he the Patriots held him to fifty-six yards. And a touchdown um on fifteen carries. So like not great, especially for the leagues where the NFC is leading rusher, right? So this is the the quote from the article. So naturally Williams was asked If this was the toughest defence he'd encountered all season, he looked so incredulous that his Saints cap almost spun around frontwards and the tidy gold stud nearly fell out of his nose. Are you being serious? He said, his eyes wider than any of the holes he tried in vain to find. They're not even close. And it goes on and on about how He doesn't think that the Patriots did anything special and he basically his his whole argument was that um Because the pages were so far ahead, he just didn't get enough carries to do anything. Which, I mean, he only got 15 carries, but still he didn't do much. But he was also talking shit about Willie McGuinness. Um who was like one of the main reasons that he wasn't running. So uh it was for instance, there was the way he and fullback Terrell Smith positively manhandled linebacker William McGuinness. who merely anchored the bottleneck for three quarters before leaving with a leg injury. Quote, McGuinness is two hundred and seventy pounds, said Williams. Torrell and me are a lot smaller, but we stood up to the challenge. We smashed his mouth.",
    "speaker" : "Andy",
    "timestamp" : "01:04:09-01:05:40"
  },
  {
    "text" : "Ooh.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:05:41-01:05:41"
  },
  {
    "timestamp" : "01:05:43-01:05:47",
    "text" : "Uh for a whole 50, what was it, 57 yards?",
    "speaker" : "Andy"
  },
  {
    "text" : "56 yards. But they were tough yards, man. He was coming hard at him.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:05:47-01:05:51"
  },
  {
    "timestamp" : "01:05:52-01:06:02",
    "speaker" : "Andy",
    "text" : "He was, yeah, the defense was coming hard at him. So I enjoy Riku. I forgot how uh entertaining he was. But I think not a great look after getting"
  },
  {
    "text" : "Well again, he was smoking a lot of pot at this time in his life, so you gotta give him a little leeway here.",
    "speaker" : "Steve",
    "timestamp" : "01:06:02-01:06:06"
  },
  {
    "speaker" : "Andy",
    "text" : "So but yeah, but you think he'd be a little bit more laid back about it, you know? Yeah, I didn't do something.",
    "timestamp" : "01:06:07-01:06:11"
  },
  {
    "timestamp" : "01:06:11-01:06:12",
    "text" : "Maybe he's seen things.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:06:12-01:06:17",
    "speaker" : "Andy",
    "text" : "Well is that what you know weed up? When you smoke weed, C-Brawn, what kind of weed are you smoking?"
  },
  {
    "text" : "I mean not as good weed as Ricky Williams can afford. I guess not, Jesus Talk to Greg about that. He's the Did he literally quit the NFL to go round the world smoking weed.",
    "timestamp" : "01:06:17-01:06:26",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:06:26-01:06:29",
    "text" : "Yeah, he was living in the mountains with some gurus or something."
  },
  {
    "text" : "Yeah, he could fucking afford it, couldn't he?",
    "timestamp" : "01:06:29-01:06:31",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:06:31-01:06:32",
    "speaker" : "Steve",
    "text" : "Gotta respect that."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, until until that ran out, if you remember, then you had to come back. That's right. Yeah.",
    "timestamp" : "01:06:32-01:06:36"
  },
  {
    "text" : "Nicky like made amends to Willie after he got like super high with Buddha and stuff and like came back and was like, Willie, I'm sorry, dude. Oh definitely. I didn't mean that.",
    "speaker" : "Steve",
    "timestamp" : "01:06:37-01:06:45"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:45-01:07:12",
    "text" : "I think it seems like the m the forgiving type, so I'm sure it was cool. Yeah. All right. Well that about wraps up for this one. Next week we have to look forward to the pages traveling to what is officially called Giant Stadium. To visit the New York Jets. They don't even have their own home. But the New York Jets that started this whole thing, really. So would this be a revenge game? Well we will find out next week."
  },
  {
    "text" : "We'll find out. I just want to say I apologize for being out of hand earlier, guys. My notes got a little jostled and I was incorrect again. And I just want to apologize for um taking it out on you guys. And uh I'm sorry.",
    "timestamp" : "01:07:12-01:07:34",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:07:34-01:07:37",
    "text" : "You know what? Apology accepted. We still love you, Mike.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Don't throw me in there with that, Andy. That's fine. I still love you.",
    "timestamp" : "01:07:38-01:07:41"
  },
  {
    "timestamp" : "01:07:42-01:07:44",
    "speaker" : "Andy",
    "text" : "I'll talk about we as in me and the listeners."
  },
  {
    "text" : "Oh, okay. himself. I apologize.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:07:44-01:07:50"
  },
  {
    "text" : "Hey we're we're uh we're a a positive positivity podcast here.",
    "speaker" : "Andy",
    "timestamp" : "01:07:51-01:07:56"
  },
  {
    "timestamp" : "01:07:57-01:07:57",
    "text" : "I'm working on it.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:07:58-01:08:14",
    "speaker" : "Andy",
    "text" : "We're not shooting anybody. Except for Greg, because he's not here. Fuck Greg. Yeah, Greg. Take him or leave him. Maybe he'll be here next week and we can say it to his face. Until then, fuck Greg Brown. Fuck Greg Brown. No fuck Greg Brown from you, Steve."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:14-01:08:17",
    "text" : "I don't know I love Greg Brown. Fuck Mike. Whoa"
  },
  {
    "speaker" : "Mom",
    "text" : "Holy crap, I take my apology back. You better go on that note, Jesus Christ.",
    "timestamp" : "01:08:19-01:08:25"
  }
]