[
  {
    "speaker" : "Mom",
    "timestamp" : "00:00-00:19",
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid. Stupid. You still want to listen? Go right ahead. I am not your mother."
  },
  {
    "timestamp" : "00:23-01:00",
    "speaker" : "Andy",
    "text" : "Welcome back to yet another playoff podcast. Playoff special playoff episode, I guess you could say, the Patriots Dynasty Podcast. This week is the 2001 AFC Championship game. And which we are subtitling the Drew Bledsoe Renaissance. I don't know if we are. I made that up literally right now. So nice. Yeah, glad you like it. With us today, we have the brothers again, Steve and Craig. And we also have another special guest who I guess for this podcast we're calling Good Steve, we've decided."
  },
  {
    "text" : "Well, better Steve. Bald Steve? Either one works.",
    "speaker" : "Greg",
    "timestamp" : "01:01-01:07"
  },
  {
    "timestamp" : "01:08-01:29",
    "speaker" : "Andy",
    "text" : "Less county, Steve. Wow. Off to a a rousing start. And uh so yes, uh Last Shitty Steve is uh a Steelers fan, so we'll let you call him what you will as listeners. So Steve, thanks for joining us."
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "Uh no problem.",
    "timestamp" : "01:30-01:31"
  },
  {
    "text" : "And uh you are, as we said, a Steelers fan. That is correct, right? You haven't been lying to everybody?",
    "speaker" : "Andy",
    "timestamp" : "01:32-01:38"
  },
  {
    "timestamp" : "01:38-01:39",
    "speaker" : "Steelers Steve",
    "text" : "100%."
  },
  {
    "speaker" : "Steve",
    "text" : "No, he's not man. His dog is named Heinz.",
    "timestamp" : "01:40-01:43"
  },
  {
    "speaker" : "Steelers Steve",
    "timestamp" : "01:43-01:47",
    "text" : "No, that's true. Indeed. After Heinz Ward, not after the stadium."
  },
  {
    "speaker" : "Greg",
    "text" : "He did it. That was what I was wondering actually.",
    "timestamp" : "01:47-01:49"
  },
  {
    "text" : "Not after the ketchup. Yeah, it's the ketchup. It's not the ketchup.",
    "speaker" : "Steelers Steve",
    "timestamp" : "01:49-01:53"
  },
  {
    "text" : "The dog does love food, Steve.",
    "speaker" : "Greg",
    "timestamp" : "01:54-01:55"
  },
  {
    "timestamp" : "01:56-01:59",
    "speaker" : "Steelers Steve",
    "text" : "He does love food, this is true, but what dog doesn't?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:59-02:01",
    "text" : "So he's named after Ben Rothesburger."
  },
  {
    "text" : "No, that's the next dog.",
    "timestamp" : "02:03-02:04",
    "speaker" : "Steelers Steve"
  },
  {
    "timestamp" : "02:04-02:08",
    "speaker" : "Steve",
    "text" : "Oh Jesus. Really? You're gonna name your next dog Big Ben or something like that?"
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "I mean if I have my way, yeah. But probably not gonna happen. God you gotta feel like.",
    "timestamp" : "02:09-02:13"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "02:14-02:17",
    "text" : "It carries a negative connotation these days. Yeah."
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "Stop pumping my leg, Big Ben. It makes it even worse is I'm an FSU fan, so I had to deal with Big Ben and Jameis Winston. So",
    "timestamp" : "02:17-02:26"
  },
  {
    "timestamp" : "02:27-02:33",
    "speaker" : "Andy",
    "text" : "How did how did you get that combination? So where are you from the Pittsburgh area?"
  },
  {
    "timestamp" : "02:33-02:50",
    "text" : "My family's from Pittsburgh, so I was born there and then we moved to Jacksonville, Florida when I was like two years old or something like that. Um so I just grew up watching all Pittsburgh sports with my grandpa. None of them were college fans and I just kind of adopted Florida State growing up in Florida.",
    "speaker" : "Steelers Steve"
  },
  {
    "timestamp" : "02:50-02:54",
    "text" : "Wow. That's uh tough luck of the drop. For like a semester too.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:55-02:57",
    "speaker" : "Steelers Steve",
    "text" : "Yeah, I did go there for a semester, yeah."
  },
  {
    "timestamp" : "02:57-03:17",
    "speaker" : "Andy",
    "text" : "I know how that goes. I went to Penn State for a semester. That doesn't last long. Alright, so that's uh I I say that's reasonable. Um we've had some other fans on here. We had uh last week we had a Raiders fan on. Who became a Raiders fan because of hip hop."
  },
  {
    "text" : "Yeah. Whoa. Okay.",
    "speaker" : "Steelers Steve",
    "timestamp" : "03:18-03:20"
  },
  {
    "timestamp" : "03:20-03:48",
    "speaker" : "Andy",
    "text" : "Hey, we don't we don't fan base judge around here, okay? No, that's what I'm saying. It's just I I'm always curious to know how people got into this, like uh got into following a certain team, especially if they're not living in that area. So it's kind of cool. So alright, so we're talking about the 2001 Steelers. And before this, before we start recording, um Not shitty Steve was saying that uh you were what like nine years old at the time?"
  },
  {
    "speaker" : "Steelers Steve",
    "timestamp" : "03:48-04:05",
    "text" : "Yeah, I mean I was probably a little I think I was like eleven or twelve. I was I was still pretty young. Um You know, and I that was like only my second or third year really following um football. 'Cause I remember like a couple years before that we weren't very good. Um and then that was the first year in Heinz field, actually. You"
  },
  {
    "timestamp" : "04:05-04:06",
    "text" : "Oh, that's right.",
    "speaker" : "Andy"
  },
  {
    "text" : "It was that two thousand and one season.",
    "speaker" : "Steelers Steve",
    "timestamp" : "04:06-04:08"
  },
  {
    "timestamp" : "04:08-04:14",
    "text" : "Yeah. Yeah, because everybody had trouble kicking in that uh That one end zone kicking field goals.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "04:14-04:17",
    "speaker" : "Steelers Steve",
    "text" : "Yeah, the open end that opens to the river there."
  },
  {
    "timestamp" : "04:17-04:21",
    "text" : "Yeah, yeah, yeah, yeah. Including Chris Brown this this season.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Our cousin.",
    "timestamp" : "04:21-04:22"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. You say that every time a brown is mentioned.",
    "timestamp" : "04:22-04:26"
  },
  {
    "timestamp" : "04:27-04:28",
    "speaker" : "Steve",
    "text" : "Yeah, all browns are cousins."
  },
  {
    "timestamp" : "04:29-04:34",
    "speaker" : "Andy",
    "text" : "That's weird, but alright. Um we're not cousins, Steve. You and me."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "04:34-04:36",
    "text" : "That's true. I wish."
  },
  {
    "timestamp" : "04:39-04:51",
    "speaker" : "Andy",
    "text" : "Brutal. Um yeah, because I was actually looking up in Chris Brown. I was wondering what was going on because he made 68% of his field goals this season. Which was not stopped. Not great. Yeah."
  },
  {
    "speaker" : "Steelers Steve",
    "timestamp" : "04:52-04:56",
    "text" : "Um no. It's like Bucks character level."
  },
  {
    "timestamp" : "04:56-05:12",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, it's it's definitely on that level, but he he still played the whole season. And this was I mean I think this is his only season. Uh not for the Steelers he didn't, no. Okay I think he went out to play for the uh the Texans for a few years. And did okay 'cause he was in a job."
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "Yeah, it was short I don't remember if there was a kicker between him and Jeff Reed, but I wanna say Jeff Reed years were shortly after the season.",
    "timestamp" : "05:13-05:20"
  },
  {
    "text" : "Yeah. Yeah, he did not last long. So do you remember watching this game live, Steve?",
    "timestamp" : "05:21-05:26",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Steelers Steve",
    "timestamp" : "05:27-05:53",
    "text" : "Yeah, I do actually. Um I remember watching that with that whole playoffs live. Uh like the week before we had beaten the Ravens. They were the only loss we had had in Hines Field that year. And that was actually Tony Saraguso's last game um for the Ravens. And it were all high actually period he retired after that season. And then so we were the number one seed and I remember thinking for sure we were gonna, you know, go to the Super Bowl and obviously that did not happen."
  },
  {
    "speaker" : "Andy",
    "text" : "So Yeah, I don't think you're alone in that. Everybody thought the The Patriots gonna get stomped in this game. And the Ravens the week before, they were the uh defending Super Bowl champions too.",
    "timestamp" : "05:53-06:03"
  },
  {
    "timestamp" : "06:04-06:08",
    "text" : "Yep. We crushed, I think it was like twenty-seven to ten the week before.",
    "speaker" : "Steelers Steve"
  },
  {
    "timestamp" : "06:09-06:20",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, absolutely annihilated 'em. And uh I I still remember because I this was the one game I didn't watch of the playoffs because I was working at the time."
  },
  {
    "timestamp" : "06:20-06:21",
    "speaker" : "Greg",
    "text" : "Cole, brutal."
  },
  {
    "text" : "Yeah. I was working at that um uh that retirement home like in the kitchen cleaning dishes so I had a little like portable FM radio with me and it would only pick up the game in one spot in the kitchen so I would like run to that spot in the kitchen and stand there in a certain position to make sure I got the the reception and then run back and clean some dishes and keep going back and forth. So it's actually listening to it.",
    "timestamp" : "06:21-06:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Radio sports.",
    "timestamp" : "06:49-06:50"
  },
  {
    "text" : "Yeah, it is. So I I I would clean dishes between like in current commercial breaks. So I this is actually the first time I watched this full game. Really? Which yeah, I didn't realize, but I'm like, I don't remember any of this. Like I've seen the highlights and stuff, obviously, a bunch of times. I don't remember like half of these plays.",
    "timestamp" : "06:51-07:08",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:08-07:23",
    "speaker" : "Greg",
    "text" : "Yeah, because that was a thing too. You couldn't really look up games after the fact there. Like now we can just, you know, they'll show it on NFL replay. You can find it online. But back then, you missed the game, you're fucked. You can watch Prime time on Sunday night, but I'll give you like a four minute clip."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:24-07:27",
    "text" : "Right, exactly. Yeah. It's just highlights."
  },
  {
    "timestamp" : "07:27-07:28",
    "speaker" : "Steve",
    "text" : "Yeah, this game's on YouTube."
  },
  {
    "timestamp" : "07:29-07:47",
    "speaker" : "Andy",
    "text" : "The beginning of the game, Gil and Gino, the radio announcers, said something along the lines of I'm happy to report that despite all the prognostications of doom, the Patriots have shown up here today and will take the field against the Steelers. And that was like how we led into this because of how heavily favored the Steelers were."
  },
  {
    "timestamp" : "07:48-07:57",
    "text" : "Yeah. I mean that's a pretty that's a pretty good uh Steelers team though. Like you look at that roster. Oh my god. It's a shitload of names that jump out.",
    "speaker" : "Greg"
  },
  {
    "text" : "Do you have any favorites, Steve?",
    "speaker" : "Steve",
    "timestamp" : "07:57-07:59"
  },
  {
    "timestamp" : "08:00-08:13",
    "text" : "Yeah, I remember well he didn't turn out to be one of my favorites, but it was actually the first jersey I ever bought, and that was Kendra Bell, linebacker for the Healers, I think Yeah. He was uh I think that was a rookie year. I think he was defensive rookie of the year.",
    "speaker" : "Steelers Steve"
  },
  {
    "text" : "Yeah, I think they heard them mention that.",
    "timestamp" : "08:13-08:16",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "Yeah.",
    "timestamp" : "08:16-08:16"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "08:17-08:17"
  },
  {
    "timestamp" : "08:18-08:30",
    "text" : "Yeah, so he was like the defensive rookie of the year that year and I was like a huge fan and then he had that great season, kind of fizzled out, ended up in Kansas City and didn't really Pan out there. I think he only played like four or five years in the league actually.",
    "speaker" : "Steelers Steve"
  },
  {
    "timestamp" : "08:31-08:33",
    "speaker" : "Steve",
    "text" : "What other players on that team did you have jerseys of?"
  },
  {
    "timestamp" : "08:34-08:49",
    "text" : "I had a Cordell Stewart jersey, um, had a Heinz Ward jersey. Which I still have actually. Um I've seen that. I think that's it from that from those years actually. All right. Oh, and Jerome Bettis actually.",
    "speaker" : "Steelers Steve"
  },
  {
    "timestamp" : "08:49-08:56",
    "speaker" : "Greg",
    "text" : "Oh really? I was Yeah. I was looking at the roster, I'm like, oh good, he didn't have a bettis and then you said that."
  },
  {
    "timestamp" : "08:57-09:03",
    "speaker" : "Steelers Steve",
    "text" : "Yeah, I had a betis. I don't anymore, like that was when I was way smaller, but yeah. He used to have a baddest jersey."
  },
  {
    "speaker" : "Greg",
    "text" : "What it what is your like general like memories of Jerome Battis? 'Cause he's a he's a he's a vintage type player, you know?",
    "timestamp" : "09:04-09:12"
  },
  {
    "text" : "Oh yeah. Yeah. Oh yeah. I mean I actually got to meet him once at a Steelers Jaguars game. I think it might have been this year that year actually. Um it was like so the Steelers were in Jacksonville and we hung out near the buses after the game and got to shake his hand and got his autograph on a football. But I remember I was pretty young at the time, but I just remember how massive he frickin' looked. Like his legs just look like tree trunks and just like I mean, he definitely wasn't like the prettiest running back, but he was good to get you, you know, three and a half to four yards of carry. Just straight up the gut. One of my favorite memories, I remember when he just absolutely trucked Brian Erlacher.",
    "speaker" : "Steelers Steve",
    "timestamp" : "09:12-09:48"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:48-09:49",
    "text" : "Oh, really?"
  },
  {
    "timestamp" : "09:49-09:53",
    "speaker" : "Steelers Steve",
    "text" : "In a game in Chicago. So yeah, I was a huge Bettis fan."
  },
  {
    "text" : "Stat check that, Greg. Stat check. Check what? I don't know, Steve's memory.",
    "timestamp" : "09:53-10:00",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "10:01-10:11",
    "speaker" : "Steelers Steve",
    "text" : "Did he uh he average three point nine yards of carry over his career? Yeah. Okay, Steve. I think he's the only Hall of Fame running back that averaged less than four yards a carry."
  },
  {
    "timestamp" : "10:11-10:19",
    "text" : "Oh. I remember his stats were always like four carries, three yards, two touchdowns, sort of thing. Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Like that one that was he definitely had a few games like that towards the end of his career.",
    "timestamp" : "10:19-10:24",
    "speaker" : "Steelers Steve"
  },
  {
    "text" : "Yeah, yeah, yeah.",
    "speaker" : "Andy",
    "timestamp" : "10:24-10:25"
  },
  {
    "timestamp" : "10:25-10:57",
    "speaker" : "Greg",
    "text" : "What are we gonna say great? Oh, you want me to give you a play-by-play of the stat check? Sure. Sure. We're we're in the snow here from the five-yard line. Rothesberger hands it off to Bettis. Erlacher fills the gap and he just gets trucked. That it's just like stood him up and then just kept churning until he like it was like a looked like a meat grinder. He just got caught underneath the bus. That's what happens."
  },
  {
    "timestamp" : "10:57-11:01",
    "text" : "Yeah, what a great nickname. One of the all-time great football nicknames.",
    "speaker" : "Steve"
  },
  {
    "text" : "Do one of my like memories of this game actually was like I was like 10 years old. And Like the the bus was the big nickname going around and I remember thinking like oh the the school bus doesn't run on Sundays And think that I was like the cleverest little shit ever. I was like dad I'm gonna make a poster board. Did you? I don't I know I don't think I ever did it, but you would do.",
    "speaker" : "Greg",
    "timestamp" : "11:01-11:30"
  },
  {
    "timestamp" : "11:31-11:31",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean he was wearing yellow, so and it was gonna be like a picture of like a broken down bus that whole thing that I was gonna do.",
    "timestamp" : "11:32-11:40"
  },
  {
    "text" : "So uh Steel enough, he's not even the Steelers all-time leading rusher.",
    "speaker" : "Steelers Steve",
    "timestamp" : "11:41-11:46"
  },
  {
    "text" : "Wait, all right, let's trivia this. Let's trivia this. We can get disguised.",
    "speaker" : "Greg",
    "timestamp" : "11:46-11:50"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh uh Franco Harris? Franco Harris would be my guy.",
    "timestamp" : "11:51-11:54"
  },
  {
    "timestamp" : "11:54-11:56",
    "speaker" : "Steelers Steve",
    "text" : "Yeah. Yeah, it's Franco Harris."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh it is, okay.",
    "timestamp" : "11:56-11:57"
  },
  {
    "timestamp" : "11:57-12:01",
    "speaker" : "Steelers Steve",
    "text" : "Because uh yeah, the Bucks played his first three seasons with the Rams."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh that's right, he did. Fuck I forgot about those years. I had no idea about that. The LA Rams.",
    "timestamp" : "12:01-12:08"
  },
  {
    "text" : "Yeah, that's when he was called the Battering Ram instead of a bus.",
    "timestamp" : "12:09-12:12",
    "speaker" : "Steelers Steve"
  },
  {
    "text" : "Oh, wow. What a also a great name. Yep.",
    "timestamp" : "12:12-12:16",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steelers Steve",
    "timestamp" : "12:16-12:17"
  },
  {
    "timestamp" : "12:19-12:25",
    "text" : "Yeah, he was uh he was a round mound of uh of rushing yards. It didn't rhyme.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "12:25-12:28",
    "speaker" : "Steve",
    "text" : "Yeah, round mound of touchdown. Jeez, Andy."
  },
  {
    "text" : "That doesn't rhyme either, you fucking idiot. Is it",
    "timestamp" : "12:28-12:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Golly.",
    "timestamp" : "12:32-12:33"
  },
  {
    "speaker" : "Andy",
    "text" : "What do you mean the D doesn't end with a D.",
    "timestamp" : "12:33-12:36"
  },
  {
    "text" : "Okay, Andy. That's how rhyming works.",
    "speaker" : "Steve",
    "timestamp" : "12:37-12:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:39-12:46",
    "text" : "It is, you fucking goddamn it. Golly. I'm not even gonna look up the word, but fuck it. You want me to stat check?"
  },
  {
    "timestamp" : "12:49-12:51",
    "speaker" : "Steve",
    "text" : "This mountain down rhyme."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:54-12:56",
    "text" : "Alright, uh good Steve."
  },
  {
    "speaker" : "Steve",
    "text" : "That husband's less shitty, Steve.",
    "timestamp" : "12:57-12:59"
  },
  {
    "timestamp" : "12:59-13:17",
    "speaker" : "Andy",
    "text" : "He was until you guys are shitting on me. Now he's good, Steve. I like him better the more I talk to you. Uh as a uh as a Steelers fan, w what's your view of the Patriots? Because we've got we've got a bunch of answers when we ask this question."
  },
  {
    "timestamp" : "13:18-13:36",
    "text" : "Yeah, I mean like I think it's obvious I have like a lot of respect for them and what they've been able to do. Um just it's kind of ridiculous the success they've had, but also like I'd be lineup, I wouldn't say it's a little uh bitter towards them as well, 'cause I just think of all the Super Bowls the Stewart would have if it wasn't for Belichick and Brady.",
    "speaker" : "Steelers Steve"
  },
  {
    "timestamp" : "13:36-13:46",
    "text" : "So Yeah, I feel like the Steelers in particular have been whipping boys. Yeah. I was gonna say he's stymied more than anybody else in the playoffs, but yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "13:47-13:48",
    "text" : "Yeah, for sure."
  },
  {
    "text" : "We have had a great record against Pittsburgh. Especially in the big",
    "timestamp" : "13:49-13:53",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "13:54-13:56",
    "speaker" : "Andy",
    "text" : "In in the playoffs especially, yeah."
  },
  {
    "text" : "Well yeah, I mean you even look at the two years that the Steelers won the Super Bowl with Rothesburger, we didn't play the Patriots because they got knocked out, I think, one year by Um the Ravens. I'm not sure of the other year.",
    "timestamp" : "13:56-14:08",
    "speaker" : "Steelers Steve"
  },
  {
    "timestamp" : "14:08-14:16",
    "text" : "Actually, but how has uh knowing me changed your opinion of the Patriots?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "14:16-14:35",
    "speaker" : "Andy",
    "text" : "Not for the better. Oh, it's made it worse. Uh that's 100% true. Wow, the the Patriots have only ever played the Steelers like since like the Belichick Brady era. In the AFC conference game. In the AFC championship game."
  },
  {
    "speaker" : "Steve",
    "text" : "No. That can't be.",
    "timestamp" : "14:35-14:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:41-14:49",
    "text" : "Yeah, and they're both there was two thousand one, two thousand four, and twenty sixteen. In the playoffs, yeah, yeah in the playoffs."
  },
  {
    "speaker" : "Steve",
    "text" : "Uh",
    "timestamp" : "14:49-14:49"
  },
  {
    "text" : "The only playoff games the Pages have played against Steelers have been in the AFC Championship Championships. Which is probably why for Steve it it hurts that much more because it's that last game to get in the Super Bowl.",
    "speaker" : "Andy",
    "timestamp" : "14:50-15:01"
  },
  {
    "timestamp" : "15:01-15:07",
    "speaker" : "Steelers Steve",
    "text" : "Yeah, it can't get on the Super Bowl. I think two of those games were in Pittsburgh, maybe."
  },
  {
    "speaker" : "Andy",
    "text" : "They were. I know Pittsburgh was the first O one. O four was as well. Rookie year, I think.",
    "timestamp" : "15:07-15:17"
  },
  {
    "text" : "Rookie year, yeah.",
    "speaker" : "Steelers Steve",
    "timestamp" : "15:18-15:19"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:19-15:21",
    "text" : "They went fifteen and one. Yeah."
  },
  {
    "text" : "Yep. Fifteen and one and I mean I'm not gonna complain too much because they came back and won it the next year, but yeah. That's right. Would've been nice though. Did you get that one? Yeah, because that year we beat we beat the Patriots and the Eagles and I think it was like within three weeks of each other.",
    "timestamp" : "15:21-15:38",
    "speaker" : "Steelers Steve"
  },
  {
    "text" : "Both games are in October. The the Steelers victory over the Patriots was the one that broke their 21 game win streak.",
    "speaker" : "Andy",
    "timestamp" : "15:39-15:46"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "15:47-15:49",
    "text" : "Oh yeah, remember that game? On Halloween."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:50-15:50",
    "text" : "Yes."
  },
  {
    "timestamp" : "15:51-15:51",
    "speaker" : "Steve",
    "text" : "Yep."
  },
  {
    "speaker" : "Andy",
    "text" : "How much candy did you eat, Greg, to get over that?",
    "timestamp" : "15:52-15:55"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "15:55-15:59",
    "text" : "I yeah I don't know why I remember that it was Halloween, but I don't either."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:59-16:02",
    "text" : "But you said that more than once, I think."
  },
  {
    "text" : "Oh boy. All right, so I got a question for uh good Steve. I thought he was less shitty, Steve.",
    "speaker" : "Greg",
    "timestamp" : "16:04-16:12"
  },
  {
    "speaker" : "Andy",
    "text" : "He was. He's growing on us.",
    "timestamp" : "16:12-16:15"
  },
  {
    "text" : "Uh Bill Cower or Mike Tomlin? Who are you taking?",
    "timestamp" : "16:16-16:20",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steelers Steve",
    "timestamp" : "16:21-16:45",
    "text" : "Oh, that's tough. Um honestly I'm I'm a big Mike Tomlin fan. I mean I love Cower, but you know, I think it's I I especially after everything that came out with Antonio Brown this year. Yeah. I have a lot of respect for Mike Tomlin and like him just keeping that under wraps for as long as he did. That's fair. So Yeah. I I I still think he's pretty young. I think he's got more Super Bowls ahead of him."
  },
  {
    "timestamp" : "16:46-17:00",
    "speaker" : "Greg",
    "text" : "Yeah, I mean as far as like keeping a culture together outside of the Pats Yeah. It's you know, you talk about like spanning more than ten years with having like consistently winning seasons."
  },
  {
    "timestamp" : "17:00-17:01",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "17:02-17:07",
    "text" : "Ste I mean Patriots Steelers in a while there, but Tomlin or Chuck.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "17:08-17:10",
    "speaker" : "Steelers Steve",
    "text" : "Yeah, I mean obviously What's that?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "17:11-17:12",
    "text" : "Tomlin or Chuck Knowle"
  },
  {
    "text" : "Well, I wasn't alive during the seventies, so I'm gonna I mean obviously had a lot more success than Tom's had, but so I can't even yeah, I can't even really comment on that.",
    "speaker" : "Steelers Steve",
    "timestamp" : "17:13-17:22"
  },
  {
    "text" : "I don't really claim that Lance Allworth.",
    "speaker" : "Andy",
    "timestamp" : "17:23-17:25"
  },
  {
    "text" : "Well, considering my dog after Heinz Ward, I'm gonna go with Heinz Ward. Like best blocking wide receiver in NFL history",
    "speaker" : "Steelers Steve",
    "timestamp" : "17:28-17:37"
  },
  {
    "text" : "Yeah, I have to say after watching this game, I remember the fury that he would instill in me. He was one of those guys that I think Kind of like the Rodney Harrison of the team where you fucking love him if he's on your team. I just I I hope he stays in balance and something.",
    "speaker" : "Andy",
    "timestamp" : "17:37-17:55"
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "Yeah, bad market. Yeah, oh yeah. I mean I think he broke uh Keith Rivers jaw. Like you're talking a linebacker for the Bengals. Right, yeah. I mean he was just he was vicious.",
    "timestamp" : "17:58-18:10"
  },
  {
    "text" : "Didn't that kind of start the whole like Steelers Bengals feud too?",
    "speaker" : "Andy",
    "timestamp" : "18:11-18:15"
  },
  {
    "timestamp" : "18:16-18:20",
    "speaker" : "Steelers Steve",
    "text" : "Uh I mean not really Bengals still sucks for a few more years."
  },
  {
    "text" : "Yeah, but the games were always like super chippy after that though. Like I said in the play.",
    "speaker" : "Andy",
    "timestamp" : "18:20-18:25"
  },
  {
    "text" : "And I mean they actually the NFL changed the rules because of Heinz Ward with a lot of those blocks. So you couldn't get away today with like what it used to do.",
    "speaker" : "Steelers Steve",
    "timestamp" : "18:25-18:33"
  },
  {
    "text" : "I mean Juju Smith Schuster's still doing it.",
    "speaker" : "Andy",
    "timestamp" : "18:34-18:37"
  },
  {
    "text" : "Yeah, and he got a suspension for it. But I'm okay with that because Montez Burke's a piece of shit.",
    "speaker" : "Steelers Steve",
    "timestamp" : "18:39-18:43"
  },
  {
    "text" : "That's what it was, yes. And then he stood over him. I think that's what got him the uh perfect probably had that coming.",
    "speaker" : "Andy",
    "timestamp" : "18:43-18:51"
  },
  {
    "text" : "Oh, he's had that coming for years, yeah. I was watching that game with you, Steve, that playoff game against the Bengals. Perfect. Oh yeah, we were in a deep peak at ugly mug or whatever it was. Yeah. You were super hot then too.",
    "speaker" : "Steve",
    "timestamp" : "18:51-19:07"
  },
  {
    "speaker" : "Greg",
    "text" : "You know what the pop culture ref the equivalent of that is is of the the Vontes Berfeck thing is uh Weinstein getting coronavirus. Where you're like, yeah, I don't want to see it happen to anybody, but if it was gonna happen to someone, that's the guy.",
    "timestamp" : "19:08-19:26"
  },
  {
    "timestamp" : "19:26-19:27",
    "speaker" : "Steelers Steve",
    "text" : "That asshole."
  },
  {
    "speaker" : "Andy",
    "text" : "That's a that's a good one, Greg. I like that. Yeah, that's a great it's a deep cut, but you got there. I was worried.",
    "timestamp" : "19:32-19:38"
  },
  {
    "timestamp" : "19:38-19:43",
    "speaker" : "Greg",
    "text" : "That's why I had to interrupt. Whoever I interrupted."
  },
  {
    "text" : "I appreciate it. All right, let's see. Uh all right, so here's a here's a good question for you. Uh we haven't had great luck well I haven't had great luck asking this question to other people because we've been asking Panthers and Raiders fans then There weren't any, but uh do you have a favorite Patriots Steeler game?",
    "speaker" : "Andy",
    "timestamp" : "19:43-20:02"
  },
  {
    "text" : "Uh yeah, I mean actually I mean, unfortunately it didn't turn out that great for us for the season, but the game two years ago on the hinds field where the Steelers won it with an interception front by uh Joe Hayden at the end of the game. Oh. Just because I was actually at that game.",
    "timestamp" : "20:05-20:19",
    "speaker" : "Steelers Steve"
  },
  {
    "timestamp" : "20:19-20:22",
    "text" : "So it was a bless. It's a good game to be at.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steelers Steve",
    "timestamp" : "20:22-20:29",
    "text" : "Yeah. Me and uh Me and Shitty Steve were there, so Steve, you might have on your name."
  },
  {
    "speaker" : "Steve",
    "text" : "We were also at the year before when Rothesberger faked it faked it.",
    "timestamp" : "20:29-20:34"
  },
  {
    "speaker" : "Steelers Steve",
    "timestamp" : "20:35-20:43",
    "text" : "And that is probably my like other than the AFC championship game, that is definitely like my least favorite. I was red hot. That game was crazy."
  },
  {
    "text" : "Which AFC championship game?",
    "speaker" : "Andy",
    "timestamp" : "20:43-20:45"
  },
  {
    "text" : "Uh this was no that was an AFC championship game. We I said other than the AFC championship games that we have there was three where we beat you.",
    "speaker" : "Steelers Steve",
    "timestamp" : "20:46-20:53"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "20:53-20:54",
    "text" : "Yeah. Three times."
  },
  {
    "timestamp" : "20:55-20:56",
    "text" : "No shit, probably",
    "speaker" : "Steelers Steve"
  },
  {
    "timestamp" : "20:56-21:05",
    "speaker" : "Steve",
    "text" : "Yeah. So this was like number I didn't watch it. What's that? Was this like the that was that fake spike one, the fourth one, or"
  },
  {
    "text" : "Your fourth least favorite?",
    "timestamp" : "21:07-21:08",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steelers Steve",
    "timestamp" : "21:08-21:09",
    "text" : "Like my fourth least favorite?"
  },
  {
    "timestamp" : "21:10-21:13",
    "text" : "Right, right. Or does one of the AC championships really stick out as like a",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, I mean definitely 2004 really sticks out. Like I mean we're fifteen and one. I thought we were going all the way. Yeah.",
    "timestamp" : "21:15-21:22",
    "speaker" : "Steelers Steve"
  },
  {
    "timestamp" : "21:22-21:26",
    "text" : "I mean even even in 2001, the these this Steeler team was a fucking wagon.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "21:26-21:27",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Your defense is legit. Yeah, I had it here. They they were first in uh rushing Yards and yard and like rushing defense in both yards and uh touchdowns. Like they were fucking unstoppable on the ground. And yet in this game It felt like they just didn't even run it for whatever reason. Like they came out slinging the ball.",
    "timestamp" : "21:28-21:53"
  },
  {
    "text" : "Yeah, I don't Yeah, I mean Cordell threw it threw three interceptions, I think, in that game. Yeah.",
    "timestamp" : "21:54-21:59",
    "speaker" : "Steelers Steve"
  },
  {
    "timestamp" : "21:59-22:03",
    "text" : "Well we'll get there even into Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:03-22:14",
    "speaker" : "Greg",
    "text" : "You wanna know my favorite Patriot Steelers game? Yes. 1996 Fog Bowl. Oh, remember that? No. Barely."
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "I do not know.",
    "timestamp" : "22:14-22:15"
  },
  {
    "timestamp" : "22:15-22:26",
    "speaker" : "Greg",
    "text" : "It's it was the Patriots' first ever home playoff game. Drew Bledsoe and Tyree Glenn. Yes. Versus Neil O'Donnell in the Steelers. Holy shit, Neil O'Donnell."
  },
  {
    "speaker" : "Andy",
    "text" : "The guy didn't have enough a lift.",
    "timestamp" : "22:26-22:27"
  },
  {
    "text" : "Yeah. Greg Lloyd. Remember Greg Lloyd, the linebacker for the Steelers?",
    "timestamp" : "22:28-22:32",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "Linebacker. Yeah.",
    "timestamp" : "22:33-22:34"
  },
  {
    "speaker" : "Andy",
    "text" : "Dude, Steelers linebackers, they're a different breed, I feel like. Because they always have that like cool like predator face mask. They all do for some reason. And it look like the black helmets. Yeah, and they're just like fucking Terrifying looking people.",
    "timestamp" : "22:34-22:51"
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "Just wait till we get JJ Watt next year on the other side of TJ Watt.",
    "timestamp" : "22:52-22:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh Jesus Christ.",
    "timestamp" : "22:55-22:56"
  },
  {
    "text" : "Oh I saw that article, but I didn't read it because it looked shitty. What what is the rumor going around though?",
    "speaker" : "Greg",
    "timestamp" : "22:56-23:05"
  },
  {
    "text" : "I mean, I don't think there's real any legs to it, but um there is I mean we got his brother we got two of the brothers now and I think JJ would love to play for the Steelers. Just kinda w you hear, you know, on message boards or whatever, but I just don't really think it'll happen.",
    "timestamp" : "23:06-23:21",
    "speaker" : "Steelers Steve"
  },
  {
    "text" : "I don't know if you think if we did though trade him for a bag of practice balls or something like that.",
    "timestamp" : "23:21-23:24",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "This is true. I mean you are DM with Bill O'Brien here, so like maybe we could just offer them like, you know, shoot. I don't even know. Yeah, give him like a sip round finish. Yeah. Speaking of which, like, thank God for the Raiders. Like, we absolutely took them to town with both Brown and uh freaking Martavis Bryant the last three years.",
    "timestamp" : "23:25-23:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh shit, that's great. I forgot about the Martavis Bryant thing. Man. So basically the the Raiders are where wide receivers go to die, basically, right?",
    "timestamp" : "23:49-23:59"
  },
  {
    "speaker" : "Steve",
    "text" : "Yep. Yeah, Rainy and Moss.",
    "timestamp" : "23:59-24:01"
  },
  {
    "timestamp" : "24:01-24:09",
    "text" : "You have Rainy Moss as well, yeah. And Jerry Rice to a certain extent. Yeah, he was good in that.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "Yeah, but I think he was yeah, he had like still a thousand yard season while there, I'm pretty sure.",
    "timestamp" : "24:09-24:12"
  },
  {
    "text" : "He did, yeah. Yeah. So. Alright, you boys have any more questions for uh good Steve?",
    "timestamp" : "24:12-24:23",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "24:24-24:29",
    "text" : "No, I'm just gonna make Steve relive that moment when we were at that fake spike game together.",
    "speaker" : "Steve"
  },
  {
    "text" : "Dude, I uh that was memorable. I talked to you after that game, Steve, and you were shit faced. Which Steve. Which Steve. Shitty Steve. Shit-faced Steve. Yeah.",
    "timestamp" : "24:29-24:42",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "24:42-25:02",
    "speaker" : "Steve",
    "text" : "Like I'm a I'm a chirper. Like I love going to games and away games and chirping at them. I didn't say anything after that game because everyone there was just like They were so shell-shocked, angry, and I was like, Yeah, you know, the rest fucked you, but Rothelsberger fucked you harder. And they're like, yeah."
  },
  {
    "timestamp" : "25:04-25:07",
    "speaker" : "Andy",
    "text" : "So good, Steve, is this is this story true?"
  },
  {
    "timestamp" : "25:08-25:17",
    "speaker" : "Steelers Steve",
    "text" : "Oh yeah, that's definitely true. He didn't he like he that's the one time yeah that you know shitty Steve has not taught shit after a game when the Steelers or another Pittsburgh team lost."
  },
  {
    "text" : "Ah Greg, you owe me five bucks, he can read a room. Yeah, right.",
    "speaker" : "Andy",
    "timestamp" : "25:17-25:22"
  },
  {
    "speaker" : "Greg",
    "text" : "It that was a tough one",
    "timestamp" : "25:25-25:28"
  },
  {
    "timestamp" : "25:28-25:29",
    "speaker" : "Andy",
    "text" : "Yeah. It was, yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Because it was like the refs, yeah. The refs really I I mean, I think they got that call wrong. And then it was compounded by just like a dreadful decision by Big Daddy.",
    "timestamp" : "25:29-25:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:41-25:48",
    "text" : "Yeah. Just the factory. Just anything else. Literally anything else would have worked. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "But like that game was so back to everything else, dude. Like the Patriots drive before that where he just goes to Gronk over and over again. Just Storms down the field just sling it to Gronk for the touchdown and then that Juju drag route where he outran everybody. But that Gronk all within like two minutes. It was crazy. Yeah.",
    "timestamp" : "25:48-26:06"
  },
  {
    "speaker" : "Andy",
    "text" : "The Gronk uh touchdown spike where he like he caught the touchdown, pointed at the guy who was covering, who was laying on the ground, laughed at him, and then spiked it is is seared in my memory. Like that to me is is Rob Gronkowski.",
    "timestamp" : "26:07-26:20"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, that was our end of the stadium too where Gronk was spiking that those",
    "timestamp" : "26:20-26:24"
  },
  {
    "timestamp" : "26:28-26:29",
    "text" : "Fucking hell.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steelers Steve",
    "timestamp" : "26:29-26:34",
    "text" : "I thought you would trip up to, you know, Boston next time the Steelers are up there."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, we were gonna do it this past year, but it was opening. No super.",
    "timestamp" : "26:34-26:38"
  },
  {
    "text" : "Yeah, nope. Yeah, I'm not paying what dropping a grand to go to that.",
    "timestamp" : "26:38-26:42",
    "speaker" : "Steelers Steve"
  },
  {
    "text" : "Yeah. Probably a good decision. Especially after the result of that too. That would not have been worth it for you. No.",
    "timestamp" : "26:42-26:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "Oh yeah, that'd have been that would've been shitty.",
    "timestamp" : "26:51-26:53"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that was a shit show.",
    "timestamp" : "26:53-26:54"
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "That was a bad game.",
    "timestamp" : "26:54-26:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, for you.",
    "timestamp" : "26:56-26:57"
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "So many for me.",
    "timestamp" : "26:58-27:00"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Well I I don't know, maybe the the I got nothing. That's true. An FSU I guess maybe?",
    "timestamp" : "27:02-27:14"
  },
  {
    "text" : "Yeah, they've been pretty bad the last few years.",
    "timestamp" : "27:15-27:17",
    "speaker" : "Steelers Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:18-27:20",
    "text" : "Uh you sure know how to pick 'em."
  },
  {
    "timestamp" : "27:20-27:32",
    "speaker" : "Steelers Steve",
    "text" : "They they had their uh forty one straight seasons of a bowl game snapped. Or winning record snaps a couple years ago. Yeah. Willie Tagger was awful. Don't even get me started on college football."
  },
  {
    "timestamp" : "27:32-27:35",
    "speaker" : "Steve",
    "text" : "You were so high on him too. Oh my god, that was hilarious."
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "Yeah, yeah.",
    "timestamp" : "27:36-27:37"
  },
  {
    "text" : "Uh all right Steve. Well I guess if nobody else has any questions, I think we will uh mercifully let you go.",
    "speaker" : "Andy",
    "timestamp" : "27:38-27:47"
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "Yeah, no problem. Enjoy the uh reliving That glorious game for y'all and and going on to win it.",
    "timestamp" : "27:53-27:59"
  },
  {
    "speaker" : "Greg",
    "text" : "So thanks for coming on, Steve. Good, Steve.",
    "timestamp" : "27:59-28:02"
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "Have a good one, guys.",
    "timestamp" : "28:03-28:03"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, you too, bud.",
    "timestamp" : "28:03-28:04"
  },
  {
    "timestamp" : "28:05-28:08",
    "speaker" : "Steelers Steve",
    "text" : "All right. See you ends later. Bye."
  },
  {
    "text" : "I gotta say he doesn't sound like a Steelers fan, does he?",
    "timestamp" : "28:10-28:13",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh he's a hardcore Steelers fan for sure.",
    "timestamp" : "28:14-28:16"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:16-28:24",
    "text" : "Yeah, he just doesn't sound like it. He doesn't he doesn't talk like a Steelers fan. Uh yeah. I don't know. I'm I didn't he didn't say yints once."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:25-28:45",
    "text" : "I like Pittsburgh. Like I like the people there. You drive around New England, you see Patriot stickers and brewing stickers and sock stickers everywhere. Everyone's wearing the stuff. It's like that in Pittsburgh too."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah.",
    "timestamp" : "28:45-28:46"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:46-28:48",
    "text" : "Whereas this there's sports everywhere."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:48-28:51",
    "text" : "Yeah, because Pittsburgh isn't really a huge college sports town, is it?"
  },
  {
    "speaker" : "Steve",
    "text" : "No, and there's no basketball there either. But yeah, it's not it's not a huge But they're like a big sports hands all kind of blue collary people are like Yeah They'll be like assholes, but like they're not gonna beat you up either, right? You can talk shit to people.",
    "timestamp" : "28:52-29:08"
  },
  {
    "text" : "Holy shit, now that now that you say that, I actually just had a memory because this was I don't know why, but uh oh I think I think we had to go back and get all my shit from Penn State. So we drove down there, packed up the van, and we're driving back. We stopped at like a fucking steakhouse or something like that on the way. And it must have been, I don't even think it was in the Pittsburgh area, because Pittsburgh's west. Western Pittsburgh, all right? Because yeah, Philly's east and Pittsburgh.",
    "speaker" : "Andy",
    "timestamp" : "29:08-29:38"
  },
  {
    "timestamp" : "29:38-29:40",
    "text" : "It's only 45 minutes from Ohio.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. So we were in this steakhouse and I was wearing my Troy Brown jersey and I was in the bathroom at the urinal and some guy walks in and sees it and starts like giving me shit while I'm taking a piss about, oh, oh this the patrons don't even have a chance, huh? I can't believe you're wearing that here. Like going on and on. All I can say is like, yeah, we'll see, we'll see. Because, you know, I was fucking eighteen years old and this dude was like forty and twice my size.",
    "timestamp" : "29:40-30:06",
    "speaker" : "Andy"
  },
  {
    "text" : "And you had your dick in your hand.",
    "timestamp" : "30:06-30:08",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. I was feeling a little a little exposed. So uh but it's my my first thought was to go back to that guy and be like, oh yeah, I bet you feel like a shithead fucking talking shit to a Fucking college kid in a in a urinal. I bet he doesn't. I bet he doesn't even remember it. Yeah. But I I felt vindicated. Which is all that's.",
    "timestamp" : "30:08-30:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "30:31-30:51",
    "text" : "The first game that we went to, uh, we met these guys standing in line behind us. One was a Steelers fan, one was a Patriots fan. We were waiting for Pomani Brothers, like the sandwich place. Quicker we all sat together, ate lunch, and then like we ended up like tailgating with them and drinking a bunch of beers throughout the whole weekend. And then next year we got the Airbnb with them as well. So like everyone's like super chill there."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, and then and then they all fucked each other. Just one big gay orgy. He loves it in Pittsburgh.",
    "timestamp" : "30:52-30:59"
  },
  {
    "timestamp" : "31:00-32:36",
    "text" : "I can't I can imagine why. You're so friendly. Yeah. Yeah. So I think this is probably the perfect time to uh explain why this is the the the Drew Bledsoe what did I call it Renaissance game? So for those that maybe don't remember, we concocted this plan weeks ago and uh actually at this point it was probably like months ago. Um yeah About we found out that Drew Bledsoe owns a winery and we tried to get his wine and we're going to do this episode as a uh a tribute to to Drew Bledsoe because this was his renaissance. So Um as as true brown plans tend to go, I am the only one that actually found True Blood So wine because it is very prevalent in New Hampshire liquor stores. You can find it in almost all of them, actually, believe it or not. And uh for anybody who doesn't live in New Hampshire. The the liquor stores are directly off the highway, so they're very easy to get to and to leave. And we say we don't Yeah, exactly. We say we don't promote drunk driving, yet we put all liquor stores directly off of highways. So live free or fucking die. Yeah, so I was able to find it and this is quite literally the most money I've ever spent on a bottle of wine. It is flying B, not V, but B for Bledzo. Uh the Cabernet Sauvignon 2016.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:37-32:37",
    "text" : "Ooh."
  },
  {
    "text" : "And for those that you're doing vintage. Yeah, it's it is delicious. And I know nothing about wine, but I decided to to prime my palate over the the past week with a bottle of wine that my boss gave me that was supposed to be super fancy and I drank it and it was pretty good. This one's better. So Drew Bledsoe.",
    "speaker" : "Andy",
    "timestamp" : "32:37-32:57"
  },
  {
    "text" : "That's not you just gassing up Bledsoe. That's that's a legitimate take.",
    "speaker" : "Greg",
    "timestamp" : "32:58-33:01"
  },
  {
    "timestamp" : "33:02-33:24",
    "text" : "Yeah, no, Drew Bledsoe, not great on third and long, great at uh squishing grapes and making them ferment. How dare you? Oh, we'll get to it. Don't you worry. Oh, we'll get to it. So I found Drew Blood so wine. And so I have been drinking that steadily throughout this. How about you boys?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "33:25-33:30",
    "text" : "I have a um it doesn't have a year on it."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:31-33:32",
    "text" : "Good start, good sign."
  },
  {
    "speaker" : "Greg",
    "text" : "Um it doesn't cost that that pregnant women shouldn't drink it though. Okay. But it is a 25th anniversary California Cabernet Savignon with a massive Panthers logo on it from the Durham, North Carolina Harris teeter. That I ran to this afternoon with a backpack on. Ran two miles there, stuffed it in my backpack and ran home.",
    "timestamp" : "33:33-34:03"
  },
  {
    "text" : "So it's it's well shaken, is what you're saying.",
    "timestamp" : "34:04-34:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:06-34:06",
    "speaker" : "Greg",
    "text" : "Yes."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:06-34:08",
    "text" : "And it Which is what you're supposed to do with all wine, I believe."
  },
  {
    "text" : "That's how you aerate it.",
    "speaker" : "Steve",
    "timestamp" : "34:08-34:09"
  },
  {
    "text" : "Yeah, I'm I'm wafting the aromas into the microphone right now. So take a deep Oh yep, yes. That's that's a nice nose it has.",
    "speaker" : "Greg",
    "timestamp" : "34:10-34:22"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:22-34:25",
    "text" : "It's delightful. Is that is that uh elderberry?"
  },
  {
    "timestamp" : "34:25-34:43",
    "text" : "Um no, that's blackcurrant. Oh, okay. That you're smelling. Yep. It's a nice earthy aroma, you know. Uh acidity. Yeah. Is that mocha? I think I I think there's a a layer of mocha in there now that I'm yep. Yep.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "So for reference, I took Greg Brown to a beer festival once. Uh and only once, I'll never do it again. Because you spent the entire time, every time I got a beer, I'd be like, mm-hmm, yeah, nope. Mm-hmm. Yeah, those oh there's malt in this one. Ooh, the hops. Ooh, this no, this one tastes like beer. Literally every single time he drank something. Guys, guys, mine tastes like beer. What did yours taste like?",
    "timestamp" : "34:43-35:08"
  },
  {
    "speaker" : "Greg",
    "text" : "Awesome. Fucking beer nerds.",
    "timestamp" : "35:10-35:13"
  },
  {
    "speaker" : "Andy",
    "text" : "So that only leaves Steve. Steve, what what did you end up finding in fucking Virginia of all places?",
    "timestamp" : "35:13-35:20"
  },
  {
    "timestamp" : "35:21-35:30",
    "text" : "I have a bottle of Jan Stevenson's Merlot from 2010. I hear the older the wine, the better it is.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, definitely.",
    "timestamp" : "35:30-35:32",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:32-35:41",
    "speaker" : "Steve",
    "text" : "This has been sitting in my Liquor cabinet for many, many moons. Probably good six years."
  },
  {
    "text" : "So how did you obtain it? Well, that's what you're supposed to do with wine.",
    "timestamp" : "35:41-35:43",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:43-36:08",
    "speaker" : "Steve",
    "text" : "You're supposed to let it sit for the time, right? So for those BB seller. Dummies. I work at a golf company and like there was like some stupid team building event and one of the prizes was wine and I answered the question, got a bottle of wine. I said, I'll never drink this."
  },
  {
    "text" : "And here we are.",
    "timestamp" : "36:09-36:10",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:10-36:11",
    "text" : "Yeah, it was a question.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, it was a question.",
    "timestamp" : "36:11-36:12",
    "speaker" : "Steve"
  },
  {
    "text" : "Give us the gist.",
    "timestamp" : "36:13-36:14",
    "speaker" : "Andy"
  },
  {
    "text" : "How many Super Bowls does Tom Brady have? So of course I knew it. It was three.",
    "speaker" : "Steve",
    "timestamp" : "36:14-36:20"
  },
  {
    "text" : "It was three back then. It was Gregory getting booed at his Christmas party for wearing a Pat's Chris uh Santa hat.",
    "timestamp" : "36:22-36:27",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:28-36:45",
    "speaker" : "Greg",
    "text" : "I got booed by the entire company. How many people in that company? There was like a hundred and sixty people who we made. Jesus. Uh I'm sure you handled it well. Oh yeah, of course. Yeah. I feed off the hate, you know."
  },
  {
    "text" : "I agree. I'm the same way.",
    "speaker" : "Steve",
    "timestamp" : "36:45-36:46"
  },
  {
    "timestamp" : "36:47-36:53",
    "text" : "The the hate nourishes me. I think it's a brown family thing. I drink it up.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "36:54-37:02",
    "speaker" : "Andy",
    "text" : "Like wine. Like Drew Bledsoe wine. So to Drew Bledsoe, everybody, for those drinking at home. Hopefully not in the car."
  },
  {
    "speaker" : "Greg",
    "text" : "See if we can hold can you hear that? Yeah. Yes. Can you tell that I'm spinning the bottle as I pour it? Yes.",
    "timestamp" : "37:03-37:11"
  },
  {
    "speaker" : "Steve",
    "text" : "That is uh slightly presumptuous.",
    "timestamp" : "37:12-37:14"
  },
  {
    "text" : "Ooh.",
    "timestamp" : "37:14-37:14",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "37:16-37:22",
    "speaker" : "Steve",
    "text" : "Enemately palatable though. Did you fucking smell it first? Overall an amusing firewater."
  },
  {
    "timestamp" : "37:24-37:37",
    "speaker" : "Greg",
    "text" : "Ooh. Ooh, this is quite fragrant. Have you actually tried it yet, Greg? No, dude, come on. Are you an amateur? You gotta smell that shit for like ten minutes before you do anything."
  },
  {
    "text" : "I've already had like two glasses though. Yeah, me too.",
    "speaker" : "Steve",
    "timestamp" : "37:38-37:40"
  },
  {
    "text" : "Yeah, you gotta look at the color, you know?",
    "timestamp" : "37:40-37:42",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, you gotta see how like the legs of it. What are the legs of it?",
    "timestamp" : "37:43-37:45"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm in my car. I can't see the color. It just looks dark.",
    "timestamp" : "37:45-37:48"
  },
  {
    "timestamp" : "37:48-37:54",
    "text" : "Ooh, and then you gotta like spin your glass to see how it ripples off shit, you know? It's called legs.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "37:54-37:56",
    "speaker" : "Steve",
    "text" : "I was just saying that. Jesus Christ. Legs?"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, I'm sorry, Steve. Alright, so I got I got some ripple. I have to say this is actually just really good wine.",
    "timestamp" : "37:57-38:02"
  },
  {
    "text" : "Steve probably couldn't even tell the difference between a Malbec and a Cabernet.",
    "timestamp" : "38:02-38:06",
    "speaker" : "Greg"
  },
  {
    "text" : "It's pronounced Cabernet. Do you guys remember that tie we were in that French restaurant in Brooklyn with Ellie when she first moved there? I do Hey, Greg was ordering.",
    "speaker" : "Steve",
    "timestamp" : "38:07-38:20"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:20-38:27",
    "text" : "I've never seen her that that embarrassed in like Ellie doesn't get embarrassed, but she was embarrassed that one night."
  },
  {
    "text" : "And Greg was just taking it all the way to the max.",
    "speaker" : "Steve",
    "timestamp" : "38:29-38:32"
  },
  {
    "timestamp" : "38:33-38:35",
    "speaker" : "Andy",
    "text" : "He ordered a peanut grigiat, I remember."
  },
  {
    "timestamp" : "38:36-38:36",
    "speaker" : "Steve",
    "text" : "Yes."
  },
  {
    "text" : "Your fine is peanut griggiat in the chicken Parmi Yagana.",
    "timestamp" : "38:38-38:41",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "38:45-39:01",
    "text" : "The waiter was like one of those Brooklyn hipsters who was taking his job super serious and he we he hated you. Well, they're the worst. There's that picture of the clown in the booth that you were like making out with. Oh yeah. I have that photo still. You do. Yes. Oh yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:02-39:04",
    "text" : "So can you post that online so we can put it in the show notes? Yep."
  },
  {
    "timestamp" : "39:04-39:06",
    "speaker" : "Steve",
    "text" : "Oh yeah. I'll text it to you now."
  },
  {
    "speaker" : "Andy",
    "text" : "Love it. Thank you. So um speaking of clowns, how about we talk about this football game? How about Cordell Stewart? I I have more to talk about my wine.",
    "timestamp" : "39:07-39:17"
  },
  {
    "speaker" : "Greg",
    "text" : "You haven't even drank it yet. Shut up. Yeah, well, of course not, Andy. It's letting it be a little bit more.",
    "timestamp" : "39:19-39:23"
  },
  {
    "timestamp" : "39:24-40:16",
    "speaker" : "Andy",
    "text" : "So we'll do we'll we'll do uh we'll do a halftime wine review of Greg Brown's Panther wine. Okay. All right. Of course. Let's get into this game. 2001 AFC championship game. Even Gil and Gino are are joking about how the Patriots actually finally showed up, even though nobody expected them to. And it starts off as expected, I would say. Uh I don't know. You know, actually, yeah, no, I take that back. I think um what was expected was that the Steelers would run it down the pages' throat because that's if there's one criticism of this This Patriots defense that we've seen is that fucking no names are running down there. What was the Panthers guy's name? Do either of you remember? Ooh."
  },
  {
    "text" : "Let me think for like two seconds.",
    "timestamp" : "40:17-40:18",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Quiz time.",
    "timestamp" : "40:19-40:19"
  },
  {
    "timestamp" : "40:20-40:20",
    "speaker" : "Greg",
    "text" : "Hunt Lee?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Hunt. I I'll I'll take your word for it because I I don't remember it either.",
    "timestamp" : "40:21-40:26"
  },
  {
    "text" : "Yeah, I think it was Huntley.",
    "speaker" : "Steve",
    "timestamp" : "40:26-40:27"
  },
  {
    "speaker" : "Andy",
    "text" : "But just some random ass dude. And then the week last week was uh Charlie Garner who Uh mediocre. He was good after this year, but not this year.",
    "timestamp" : "40:27-40:38"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:39-40:44",
    "text" : "Remember Jerome Bennettis was hurt though, right? He would miss like the previous six or seven games."
  },
  {
    "timestamp" : "40:44-41:12",
    "speaker" : "Andy",
    "text" : "So yeah, that that was my question too, is that the commentators kept talking about They they made this comment. I wrote it down because it freaked me out a little bit. He w this is his first game back in seven weeks. And they mentioned something about a botched painkiller injection. Ooh. Oh, I missed that. And Jerome Bettis was like, oh, it's the best thing that's happened to me because I was able to Take all this time off and go back and re-watch every single one of my runs to see what I was doing right and what I was doing wrong and all this shit."
  },
  {
    "text" : "Yeah, that's that's what someone on Painkillers does. Yeah, and I'm gonna sit on this couch and we'll watch shit.",
    "timestamp" : "41:12-41:19",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "41:19-41:25",
    "text" : "Or smoke this bowl of meth and then I can and I can watch every single goddamn every single run.",
    "speaker" : "Steve"
  },
  {
    "text" : "I don't think that's necessarily prescribe painkillers, Steve, unless you're going to a doctor I don't know about.",
    "timestamp" : "41:25-41:31",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "41:34-41:37",
    "text" : "Yeah, you're gonna combine drugs. Is that right?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "41:39-41:44",
    "text" : "You're not just doing one. I mean that's fair, yeah. I mean HGH, I'm sure, right?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "41:48-42:00",
    "text" : "I do remember though that the first couple of like the first Stealers possession, we bottled up the bus and I was like, yeah. I knew that stopping the run was huge for the pass then. Yeah, running on Sundays."
  },
  {
    "timestamp" : "42:00-42:34",
    "speaker" : "Andy",
    "text" : "That's right. School bus is not running on Sundays. And he wasn't. He he was Awful in this game. They kept trying to do that like uh pitch kind of sweep for him. And whoever the defensive end was on that side, almost always Willie McGuinness, I felt like. was almost behind him by the time he caught the ball. Like they just couldn't block the sweep for whatever reason. Well you gotta set an edge. Let me get us a check one on one soon skin. Exactly, yeah But Willie McGinnis like earned his paycheck in this game."
  },
  {
    "text" : "Yeah, Willie is everywhere.",
    "speaker" : "Steve",
    "timestamp" : "42:35-42:36"
  },
  {
    "text" : "It's so like odd to watch Bettis play though, because it's just like you don't see players of that shape. It's true. He he almost looks heavy. He's so he's so round. Like he is. There's players that are like heavy, right? Like the Derrick Henries of the world, even the Mike Allstots where you're like that guy is",
    "speaker" : "Greg",
    "timestamp" : "42:38-43:01"
  },
  {
    "speaker" : "Andy",
    "text" : "He's a big boy, but yeah, like that's that's that was the guy I I was trying to compare him to was Mike Alstott because I'll start you kind of had this similar running style where he's gonna run through people and even if he breaks it past the line of screamers, you'll look for somebody to hit sort of thing. But also it just looked like a tree trunk. Like he's just a thick boy. Yeah. But Jerome Dennis he was kind of like round.",
    "timestamp" : "43:01-43:27"
  },
  {
    "speaker" : "Steve",
    "text" : "He had like legs and then there was it was like um a slim down Vince Wilfort",
    "timestamp" : "43:27-43:32"
  },
  {
    "timestamp" : "43:34-43:35",
    "text" : "Ooh, that's not bad.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:35-43:39",
    "speaker" : "Steve",
    "text" : "Yeah. Because they have the very same kind of body shape where Vince was he was also very round."
  },
  {
    "timestamp" : "43:40-43:48",
    "speaker" : "Andy",
    "text" : "Yeah But moved quicker than you expect him to. Exactly. Jerome Bettus is making people miss. Yeah, yeah. He's actually in the same shape. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. When they threw him a screen at one point, I was like, oh my god, they throw it to a line. And they started running. I was like, oh, never mind. That's just bettys.",
    "timestamp" : "43:48-43:58"
  },
  {
    "speaker" : "Andy",
    "text" : "So but uh and I mentioned it before when we were talking to Good Steve, but the stat lines for Jerome Bettis are fantastic. And this one was no exception. He had Anybody want to guess this dat line?",
    "timestamp" : "43:59-44:11"
  },
  {
    "timestamp" : "44:12-44:15",
    "speaker" : "Steve",
    "text" : "Like 15 carries, 40 yards, and a touchdown."
  },
  {
    "text" : "Oh, it's so much better than that. Nine carries, eight yards, one touchdown. Wow. Longest run? Four yards.",
    "timestamp" : "44:15-44:27",
    "speaker" : "Andy"
  },
  {
    "text" : "Ugh. Yeah.",
    "timestamp" : "44:28-44:30",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "44:31-44:37",
    "text" : "Not great. Really doesn't.",
    "speaker" : "Andy"
  },
  {
    "text" : "I think I think we should uh well let's not gloss over like uh the lightning of that thunder and lightning backfield. Amos Zeroway? Famous Amos Zeroway.",
    "timestamp" : "44:37-44:49",
    "speaker" : "Greg"
  },
  {
    "text" : "He's got to be up there in the um football name Hall of Fame, right?",
    "timestamp" : "44:49-44:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It's a great name. Zeroway.",
    "timestamp" : "44:53-44:55"
  },
  {
    "text" : "Zeroway itself, I mean, it's it's basically 90% vowels, which is fantastic. But his first name is Amos is amazing.",
    "timestamp" : "44:55-45:03",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:03-45:06",
    "text" : "There's five vowels and two non-vowels.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "And one of those non vowels is Z, which is like almost a a vowel in itself because you never see it used.",
    "timestamp" : "45:07-45:13"
  },
  {
    "text" : "And one of the vowels has one of those little accent marks. Does it really? Yeah, and the last E has that A, you know, that Eny.",
    "speaker" : "Greg",
    "timestamp" : "45:13-45:20"
  },
  {
    "timestamp" : "45:21-45:24",
    "speaker" : "Andy",
    "text" : "Oh god. It was common, but I don't like it."
  },
  {
    "speaker" : "Greg",
    "text" : "That's why it's not zero E, it's Zero A.",
    "timestamp" : "45:24-45:26"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:27-45:32",
    "text" : "Oh, alright. I'll take your word for it. Probably reference can't handle those, so Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "45:32-45:33",
    "text" : "From the Ivory Coast."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:34-45:39",
    "text" : "Oh no kidding. That's pretty cool. Like um who's Sakba? Is it Drogba?"
  },
  {
    "text" : "DDR Drogba. That that's one dark Chilean. Dude. Have I ever told you that story? No. We were the quote. This is from um college. We had a buddy that was like a surfer guy. And he was just like he was like your typical stoner, like always zoned out, like didn't really know what was going on.",
    "speaker" : "Greg",
    "timestamp" : "45:39-46:01"
  },
  {
    "speaker" : "Andy",
    "text" : "Like, yo man, like what's going on, dude?",
    "timestamp" : "46:01-46:04"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, and we were playing FIFA. And it was like someone was playing with Chelsea, so on the scoreboard it had CHL and it zoomed in and had like drug with scoring a goal and he just goes That's one dark Chilean. And we were like, what the fuck? So then from then then on that's been a part of our vernacular.",
    "timestamp" : "46:05-46:31"
  },
  {
    "speaker" : "Andy",
    "text" : "I've heard you say it multiple times. I don't actually know the backstory to it. That's fantastic. Oh good Lord. I'm pretty sure Chelsea would kick the shit out of Chile, by the way. That's true. Like easily. So yeah, so uh speaking of Chileans, uh the first quarter of this football game was pretty chilly. For both offenses.",
    "timestamp" : "46:32-46:56"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, we're gonna do a best and worst for each quarter again.",
    "timestamp" : "46:56-46:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh Jesus Christ. I was wondering if you had given that up, but apparently not. All right. Nope. Alright. Um Sure, Steve, you go first. You son of a bitch.",
    "timestamp" : "46:59-47:11"
  },
  {
    "text" : "Oh um Well, I mean I think the overall worst is watching Cordell Stewart play quarterback. Especially when he had Hyans Ward and Black Scoburris as his receivers. He's either throwing it short or he's throwing it into coverage and they're making a play.",
    "timestamp" : "47:11-47:28",
    "speaker" : "Steve"
  },
  {
    "text" : "The dude can bounce a football into somebody, into a wide into a wide receiver like no other.",
    "timestamp" : "47:28-47:33",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:34-47:36",
    "speaker" : "Greg",
    "text" : "He looked nervous. He did look nervous."
  },
  {
    "text" : "He did. And uh but you say that but both of those wide receivers were over a thousand yards.",
    "speaker" : "Andy",
    "timestamp" : "47:36-47:43"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "47:43-47:48",
    "text" : "And I'll get into the best, which I think is pretty obvious."
  },
  {
    "timestamp" : "47:49-47:55",
    "speaker" : "Andy",
    "text" : "Alright, so I shouldn't let you go first, you son of a bitch. Alright. The Troy Brown punt return."
  },
  {
    "text" : "Yes, but I mean I think everyone has seen that and there's actually a Belichick breakdown on it. If you haven't watched that, you definitely should.",
    "timestamp" : "47:56-48:03",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, that's right. I forgot about that.",
    "speaker" : "Andy",
    "timestamp" : "48:03-48:05"
  },
  {
    "timestamp" : "48:05-48:30",
    "text" : "The effort that they do on the gunner. Remember they blocked the gunner to the end zone. But which you don't really get unless you rewatch this game in full is the punt before that had a penalty on it. So they punted it and Troy Brown kind of messed it up. Yeah. Where he probably should have fear caught it and stepped out of bounds or something like that. And he just let it go and it bounced and it kept going down the sideline. And it was like on the Patriots 25.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "48:30-48:32",
    "text" : "It was a sixty-something yard punt, yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "48:32-48:45",
    "text" : "Yeah, there was a booming punt with a flip field position, but the guy punted from the end got locked in the end zone, ran out of bounds, didn't try and get back in, so they threw a flag and made him repunt it. Yep. Troy took it right out the gut to the house."
  },
  {
    "timestamp" : "48:45-48:57",
    "speaker" : "Andy",
    "text" : "Yeah. And then on the next play he got he he actually didn't get off the line. And when you watch the replay, the guy that's f that's being blocked by two guys and falling over in his own end zone. That's the same guy."
  },
  {
    "timestamp" : "48:57-49:08",
    "speaker" : "Steve",
    "text" : "Yeah, I didn't remember his name. Troy Edwards is his name. But this whole game made me start hating him. Like I just I just have a note way in the fourth quarter. Like I love seeing Troy Edwards fail."
  },
  {
    "timestamp" : "49:08-49:12",
    "speaker" : "Andy",
    "text" : "Why? And he did it a lot, because he was the kick returner too."
  },
  {
    "text" : "Yeah. I just like I just like seeing him fail. We'll get to that.",
    "speaker" : "Steve",
    "timestamp" : "49:12-49:16"
  },
  {
    "timestamp" : "49:16-49:17",
    "speaker" : "Greg",
    "text" : "That's harsh, dude."
  },
  {
    "timestamp" : "49:17-49:23",
    "text" : "A little bit. I felt bad for him Uh he yeah, he's he's a human being. He's he's got a fan of the human being.",
    "speaker" : "Andy"
  },
  {
    "text" : "He he he made a tough play. He probably regrets that play every day of his life.",
    "timestamp" : "49:23-49:28",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "49:28-49:30",
    "speaker" : "Andy",
    "text" : "Think of how his mother feels."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Maybe we should start calling him shitty Troy Edwards.",
    "timestamp" : "49:30-49:33"
  },
  {
    "speaker" : "Andy",
    "text" : "You tell me. Uh the Troy Edwards? Alright.",
    "timestamp" : "49:40-49:45"
  },
  {
    "text" : "I don't think of the receiver from the Browns.",
    "timestamp" : "49:45-49:48",
    "speaker" : "Greg"
  },
  {
    "text" : "Uh Braylon Edwards?",
    "timestamp" : "49:49-49:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "49:50-49:52",
    "text" : "Braylon Edwards."
  },
  {
    "timestamp" : "49:52-50:00",
    "text" : "Yeah. He was shitty. I was thinking the same thing too. Didn't he play for the uh Steelers too at one point?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Might have. Oh fucking no.",
    "timestamp" : "50:00-50:01"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:01-50:02",
    "text" : "Statchek."
  },
  {
    "timestamp" : "50:03-50:05",
    "speaker" : "Greg",
    "text" : "No, I'm already looking up Troy Edwards."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, fuck it. All right. Um all right, then I'll I'll do my best and worst. Ooh. Um",
    "timestamp" : "50:06-50:11"
  },
  {
    "timestamp" : "50:13-50:26",
    "speaker" : "Greg",
    "text" : "He finished his career at the Graham Rapids rampage of the Arena Football League. Oh, Arena Football League was the a Troy Edwards uh rapids arena football jersey would be sick."
  },
  {
    "text" : "Oh yeah it's gotta be one on eBay. Actually there's definitely not one on eBay. Deep cut. That'd be dope though. The if if I saw somebody wearing that, I mean you'd have to buy him a drink, right?",
    "speaker" : "Andy",
    "timestamp" : "50:28-50:40"
  },
  {
    "text" : "You wouldn't even know who it is. Like who the hell is Edwards and what is this jersey? Well, we wouldn't know the three of us.",
    "timestamp" : "50:40-50:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So if any if any of us see that or any of our listeners see that Send us a picture and we will buy that man a drink.",
    "timestamp" : "50:45-50:51"
  },
  {
    "speaker" : "Steve",
    "text" : "Or we'll just us. Who knows? Because no one's listening to this, let's be honest.",
    "timestamp" : "50:51-50:55"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:55-51:07",
    "text" : "Hey, we get some listens. Nobody from our family though, apparently, we found out recently. Literally none of our our family members listen to this podcast."
  },
  {
    "text" : "They're smart enough. Unlike you idiots.",
    "speaker" : "Steve",
    "timestamp" : "51:08-51:10"
  },
  {
    "timestamp" : "51:12-51:24",
    "text" : "That'll keep them around. Great. Yeah, well fucking shut up and I will. My best was actually Troy Brown's first punt return.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Typical original Andy.",
    "timestamp" : "51:25-51:27"
  },
  {
    "text" : "Dude, that did you it was better than the second one. I mean yeah, second one for a touchdown, but his first punt return, he was making guys look fucking foolish. Twenty-five yards? He broke some dude's ankles. And uh he caught the ball. I don't even know what he did. It didn't look like he did a move, but the guy just kind of like fell over in front of him and Troy Brown just kind of like skipped around him. It was fantastic. So I'm gonna have to find that highlight and put it on the website because that was great. And the worst was um kind of every other Patriots offensive player in this first quarter because the only um the only person that that had any, I think, positive offensive yard was Troy Brown. Like the Patriots had a bunch of like false starts and shit. And like the first drive, they had the false start. And then second play Brady got sacked. And so now it's like third and eighteen. Yeah, now it's third and eighteen. Yeah. And uh it throws uh wide receiver screen to Troy Brown. He picks up like fifteen or sixteen yards on the ball. Yeah, yeah. But it's still three and out. So he was like the only good thing in this first half.",
    "timestamp" : "51:27-52:35",
    "speaker" : "Andy"
  },
  {
    "text" : "So that was my I mean this game is peak Troy Brown.",
    "speaker" : "Steve",
    "timestamp" : "52:36-52:41"
  },
  {
    "text" : "Well my yeah and actually You go you boys were talking about and you were patting yourselves on the back for having the same thought, which good for you. Um but you were talking about how Last week in the snowball was like a perfect example of Bill Belichick's all three phases of the game. And I will argue this game tops that in those three phases.",
    "speaker" : "Andy",
    "timestamp" : "52:41-53:05"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know. The offense was meh. But you're right that button set up by a great punt. Yeah.",
    "timestamp" : "53:07-53:15"
  },
  {
    "speaker" : "Andy",
    "text" : "And also we'll get to the the other um Yeah, I mean the defense was was phenomenal, I thought, for for stopping the run on the best running team in the in the league. And I think the offense was the perfect example of next man up. with the the Drew Bletto situation. Sure. And there was uh some executing in in in crunch time, if you will, like executing when exactly they needed it to happen. Like that it wasn't uh a huge offensive production day, but when they needed to have a play, they got it. And so this was to me the perfect execution of the Belcheck system.",
    "timestamp" : "53:15-53:58"
  },
  {
    "timestamp" : "54:01-54:05",
    "speaker" : "Greg",
    "text" : "What was your worst? Every other player besides Troy Brown."
  },
  {
    "text" : "Yeah, my words was the offense. Having said all that.",
    "timestamp" : "54:05-54:09",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:09-54:12",
    "text" : "Yeah, I guess one gets you short-term amnesia.",
    "speaker" : "Steve"
  },
  {
    "text" : "I guess so. All right, Greg, what about you? Best and worse if there's anything left.",
    "speaker" : "Andy",
    "timestamp" : "54:13-54:16"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "54:17-54:34",
    "text" : "My best was Troy Brown's screen pass, which was even better than both of his Kick return, so fuck you guys. The ooh"
  },
  {
    "text" : "That was erotic. I'll say. Samaria Samara again. Back to that.",
    "speaker" : "Andy",
    "timestamp" : "54:36-54:42"
  },
  {
    "text" : "My best is the uh Chris Fumatuma follow sign uh sighting.",
    "speaker" : "Greg",
    "timestamp" : "54:42-54:46"
  },
  {
    "text" : "Yeah, the only one in the game, Fari.",
    "timestamp" : "54:46-54:48",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:49-54:51",
    "text" : "I love that you nailed that first time too."
  },
  {
    "text" : "Dude, I love him. He's an all-time name.",
    "timestamp" : "54:51-54:54",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "54:55-54:56",
    "text" : "That's a good one.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "54:56-55:09",
    "text" : "And then my worst on names is Matt Stevens. Like brutal name. And for some reason I don't like I've seen him show up a lot this year and uh I don't even think I remembered him at all."
  },
  {
    "timestamp" : "55:09-55:15",
    "text" : "Me, I thought the same thing. I remember like he started week one and I had a note there. I was like, who the fuck is Matt Stevens?",
    "speaker" : "Steve"
  },
  {
    "text" : "No, I think my favorite player name is uh Steven Gregory on the Patriots.",
    "speaker" : "Andy",
    "timestamp" : "55:15-55:20"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah.",
    "timestamp" : "55:21-55:21"
  },
  {
    "speaker" : "Greg",
    "text" : "Mine is Chris Brown because I love my mom.",
    "timestamp" : "55:23-55:25"
  },
  {
    "speaker" : "Andy",
    "text" : "Nicely done.",
    "timestamp" : "55:26-55:27"
  },
  {
    "timestamp" : "55:27-55:32",
    "speaker" : "Steve",
    "text" : "Mine's Vincent Brisbee, just because that's an awesome name. Vincent Brisbee was the man."
  },
  {
    "speaker" : "Andy",
    "text" : "He was he was my first favorite Patriot. Really because his name rhymed with Frisbee. And I was like seven.",
    "timestamp" : "55:33-55:43"
  },
  {
    "speaker" : "Greg",
    "text" : "Mine was Mosey Tatupu.",
    "timestamp" : "55:45-55:46"
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "Oh yeah.",
    "timestamp" : "55:47-55:47"
  },
  {
    "timestamp" : "55:48-55:52",
    "text" : "That's dad's everything. Yeah it is. You suck up.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "55:52-55:54",
    "text" : "Alright, so what's your worst thing, Greg?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:54-55:56",
    "text" : "I just said Matt Stevens."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that's your worst is just the name.",
    "timestamp" : "55:56-55:58"
  },
  {
    "timestamp" : "56:00-56:07",
    "speaker" : "Greg",
    "text" : "I'm making these up on the fly. You know this, okay? We are. I'm literally looking at the rosters and making up my best and worst."
  },
  {
    "text" : "Okay. All right.",
    "timestamp" : "56:07-56:08",
    "speaker" : "Steve"
  },
  {
    "text" : "Well let's get into the second quarter.",
    "timestamp" : "56:08-56:09",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:13-56:21",
    "text" : "Uh yeah, he made a tackle uh with nine fifty-four in the first quarter. All right. With William McGinnis on uh Jerome Bettis' twelve yard gain. Oof.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:22-56:23",
    "text" : "Was that the screenplay?"
  },
  {
    "text" : "I think the low-key worst was right at the end of the first quarter. Cordell Stewart ripped off that super long run.",
    "speaker" : "Steve",
    "timestamp" : "56:23-56:29"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:30-56:31",
    "text" : "40-plus yard run, yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:31-56:33",
    "text" : "Dude, they hadn't done anything up to that point."
  },
  {
    "text" : "Yeah, and now they're inside the pi the Pats ten to start the second quarter.",
    "timestamp" : "56:33-56:37",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:37-56:41",
    "speaker" : "Steve",
    "text" : "There's like no pat's in game. They can't run the ball, but somehow they're inside the ten."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, which and he escaped a sack on that play. It was one of those It reminded me of when the Patriots would play Cam Newton and they'd have him like dead to rights for like a twenty-yard sack. Or even uh this most recent season and um Ah, what's the name for the Texans? God damn it. Watson. Wine wine does give you amnesia. Yeah. So yeah, Deshaun Watson where they had him for that sack. Yeah. He broke her for a big run and that kept the drive alive and they, yeah. So it was it was that sort of play where they couldn't quite contain the mobile quarterback and he runs for like 40 fucking yards. But on the plus side, so they they're inside the Pats 10, the the quarter ends. And so to start that second quarter. Yeah, seven other Patriots on Troy Brown's punt return. Second quarter starts and the Steelers basically go three and out, and they show this stat, which I kind of want to get into a little bit because it's it's baffling to me.",
    "timestamp" : "56:41-57:45"
  },
  {
    "text" : "Ooh.",
    "speaker" : "Greg",
    "timestamp" : "57:46-57:46"
  },
  {
    "text" : "And then basically this is the number one rushing offense in the league, right? With two thousand yard receivers as well on top of it all. And the stat was they showed the Patriots defense in the red zone was third in the NFL in uh like touchdowns allowed. The Steelers offense, the best running offense in the league, was 29th in the NFL.",
    "speaker" : "Andy",
    "timestamp" : "57:47-58:16"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I saw that too. I didn't really put that all together. Fuck does that work? I think a lot of their Russian yards came from Stewart though.",
    "timestamp" : "58:18-58:25"
  },
  {
    "speaker" : "Andy",
    "text" : "Maybe. I mean he wasn't he had like st yeah like",
    "timestamp" : "58:26-58:29"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "58:30-58:41",
    "text" : "Uh Bettis only had a thousand yards in the year. Stewart had like almost six hundred. So I think it was like a combination. running game more so than like a ground and pound running game."
  },
  {
    "speaker" : "Steve",
    "text" : "They did try a bunch of design quarterback runs in this game. And they did not work. No, that one worked, the early one worked, but nothing else after that did.",
    "timestamp" : "58:41-58:50"
  },
  {
    "timestamp" : "58:51-58:59",
    "speaker" : "Andy",
    "text" : "Richard Seymour. Sniff that out almost every time, it seemed like. You had a great game. Like he's drinking a fine wine, right?"
  },
  {
    "speaker" : "Greg",
    "text" : "He's just getting those aromas up in there.",
    "timestamp" : "59:00-59:02"
  },
  {
    "timestamp" : "59:03-59:49",
    "speaker" : "Andy",
    "text" : "So yeah, the the play went Jerome Bet is run for no gain, like right up the middle. And then it was it wasn't a design run. It was actually a pass play that um Cornell Stewart took a sack. And they threw an incomplete pass when he tried to like scramble again, and there was like an offensive holding on the play, and it was a a sh a shitty mess. So they kicked a field goal. Now it's 7-3. And then not much happens in the second quarter other than the Pats actually started to get into a bit of a rhythm. Uh they had uh a completion overturned on third and long to Troy Brown where Phil Sims o almost guaranteed that it was a uh completion."
  },
  {
    "speaker" : "Steve",
    "text" : "Dude, fuck Phil Sims and his replay Like guesses in this goddamn game. Welcome to the darkness thing.",
    "timestamp" : "59:49-59:58"
  },
  {
    "text" : "Every fucking time. Every time.",
    "speaker" : "Andy",
    "timestamp" : "59:58-01:00:01"
  },
  {
    "text" : "Whoa. He was. And he was like Greg Gumble's like, oh m remind me not to take you to Vegas next time I go 'cause he was that's wrong.",
    "speaker" : "Steve",
    "timestamp" : "01:00:02-01:00:11"
  },
  {
    "timestamp" : "01:00:12-01:00:21",
    "text" : "But he was so adamant about his stance too. To the point where at the end of the at the end of the game, whenever there was a challenge, he'd be like, I'm not even gonna say anything because I know I'm gonna be wrong.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "There were so many challenges too, like no one knew what the fucking catch was. It's crazy to see that no one knew even 2001 what a freaking catch is.",
    "timestamp" : "01:00:22-01:00:29"
  },
  {
    "timestamp" : "01:00:29-01:00:40",
    "text" : "The referees in this game were I'm gonna say they were hot garbage. And not just like against the pages, but just in general. Like they made some shitty calls.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:00:39-01:01:04",
    "speaker" : "Greg",
    "text" : "Here you wanna hear a hot take? Everybody everybody complains about the catch thing. I think it's legitimately a hard thing to Put a rule around. I agree. There's so many nuances to catches that it's you know, they're doing their best I but they've also like people complain all they want, but there's no if there was an easy answer as to like this is a catch and this isn't, we would have figured it out by now."
  },
  {
    "text" : "But there's no easy answer. There's I agree with that, but I don't know. You can show the ten people and say seven of them say that's a catch, right? Yeah. Or show it in real time sort of thing.",
    "speaker" : "Steve",
    "timestamp" : "01:01:05-01:01:15"
  },
  {
    "text" : "I but then there's also the other three people that raise hell and say it wasn't, you know?",
    "timestamp" : "01:01:15-01:01:20",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, but I think there's a majority of people like If you look at it in real time on a bigger sample, then yeah, that's a catch. That's not a catch.",
    "timestamp" : "01:01:20-01:01:27",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So I I have two answers to this. Two two solutions. One is simplify a catch to the most basic thing you can possibly be. And like, you know, like baubles don't matter, whatever. As long as the guy makes a catch at some point and has two hands on the football, it's a catch. And that's it. Or we go back to we actually talked about this back, I think, in the Saints game. It was ages ago. Um Whenever there was a challenge this year early on, some of the the stations would would you were allowed to vote? So you could, I don't know if you like text in almost like voting for um what's that singer show? American Idol. Yeah, it's almost like American Idol. So you can actually vote. And as they were reviewing the play, they would show the the voting of America and like, oh, six those seven thousand votes and sixty two percent say this call should stand. And I think it was I think it may have been Greg who said that they should just use that and whatever the uh population votes is what the call is.",
    "timestamp" : "01:01:28-01:02:33"
  },
  {
    "speaker" : "Greg",
    "text" : "I want 'em to do that, but not with fans. I want him to have like a room full of refs. Or careful Jasper.",
    "timestamp" : "01:02:33-01:02:39"
  },
  {
    "timestamp" : "01:02:41-01:02:46",
    "speaker" : "Steve",
    "text" : "So we ended up with Donald Trump. See, it's American."
  },
  {
    "speaker" : "Greg",
    "text" : "Solutions don't matter because someone will always complain.",
    "timestamp" : "01:02:47-01:02:50"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true.",
    "timestamp" : "01:02:50-01:02:51"
  },
  {
    "timestamp" : "01:02:51-01:03:01",
    "speaker" : "Greg",
    "text" : "Even if they got voted in by uh by uh you know a democracy we go, well it was it the pop popular vote it's never been the popular vote so if I can"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, there were a lot of replays in this, a lot of overturn calls. Yeah. Um because there was that there was that Troy Brown call that got overturned, which probably legit Uh it was borderline, but Troy Brown was still like he hit the ground, it kind of moved a little bit, whatever, great. So Paige's punt. And then the pass to Heinz Ward, where he caught it just over the fingertips of Troy Brown. Uh Troy Brown. Uh Ty Law. It was a sick catch, but as he caught the ball, like his back hit the ground and it bobbled, and by the time he grabbed it again, he would slid out of bounds already. So You know, so they're basically even at this point.",
    "timestamp" : "01:03:07-01:03:49"
  },
  {
    "text" : "There was the Hinesword fumble, which they ruled a fumble on the field. He can't see the ball come out at all, and then they reversed it.",
    "timestamp" : "01:03:49-01:03:56",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:56-01:04:14",
    "text" : "Because his helmet hit the ground first, which I didn't realize. It's true, but I didn't realize that the helmet was was considered like a part of you that was down. Like I knew the knee and the elbow and like whatever. But I didn't know the helmet was part of that. Who knows?"
  },
  {
    "speaker" : "Steve",
    "text" : "Terrible instead of something.",
    "timestamp" : "01:04:16-01:04:17"
  },
  {
    "text" : "It was Ed Hawkilly. He had some fucking He was making it all about himself too. I I wrote down a quote. Let me see if I can find it. Uh I reviewed the play and I can't tell whether the tip hit the ground. Football or not football. So it's an incomplete pass.",
    "timestamp" : "01:04:17-01:04:34",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:04:38-01:04:43",
    "text" : "It was also every time the refs would get on the stadium mic, there was that feedback loop which made it like awful to listen to."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, it's even that that hits even closer to home now that Like I'm zooming or Skyping every call for work where it's on like, dude, just figure out your microphone situation.",
    "timestamp" : "01:04:45-01:04:56"
  },
  {
    "text" : "Fucking mute. Everybody mute right now. Not paying attention is the one guy who's got the feedback.",
    "timestamp" : "01:04:56-01:05:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:05:04-01:05:27",
    "text" : "Yeah. Dude, today, this morning, there's this guy in Ireland that was like having a fight with his siblings on a that he didn't know his mic was on. Oh yeah it's like trashing his sister. It was so funny. He's like, I don't know what she's doing. I don't know why she keeps doing this with that. Still funny."
  },
  {
    "text" : "Uh so yeah, so the really the only speaking of hurtful things, the only real Uh news of the second quarter of this game was Brady taking some low hits, which I'm gonna come out and say it. They were fucking cheap shots.",
    "timestamp" : "01:05:27-01:05:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:44-01:05:46",
    "speaker" : "Steve",
    "text" : "That's that's the bad news."
  },
  {
    "timestamp" : "01:05:47-01:05:47",
    "speaker" : "Andy",
    "text" : "Hmm?"
  },
  {
    "timestamp" : "01:05:47-01:05:49",
    "speaker" : "Greg",
    "text" : "That's the only news of the quarter?"
  },
  {
    "timestamp" : "01:05:50-01:05:52",
    "speaker" : "Steve",
    "text" : "Yeah, I feel like you're glossing over it."
  },
  {
    "timestamp" : "01:05:52-01:05:53",
    "text" : "Well, hang on.",
    "speaker" : "Greg"
  },
  {
    "text" : "We're getting there. Jesus fucking Christ. Yeah. Listen, you gotta you gotta let it breathe. You're all drinking wine, you're letting that breathe, but you're not letting me breathe. Yeah, you either it's only. Oh my god. So Brady takes a couple of cheap shots. I'm gonna say, well, actually one of them wasn't, but he he got his ankle rolled up on. Second one was definitely a cheap shot by I wrote his name down because I wanted to call his ass out. Lee Flowers crawled into Brady's legs, rolled over him.",
    "speaker" : "Andy",
    "timestamp" : "01:05:53-01:06:28"
  },
  {
    "timestamp" : "01:06:28-01:06:35",
    "text" : "And uh Brady's like to do that. Maybe like a little to the side, but very similar hit.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:06:35-01:07:24",
    "text" : "Yeah, very similar to the the hit against him from Pollard that tore his ACL, but it like got him from behind. So rolled up his legs from the back. And Brady came up limping hard. And uh on the play, he had actually completed a fucking laser to um Troy Brown. Yeah, they were moving the ball, they were starting to get into a rhythm. Like all of a sudden the Patriots offense was actually moving and it was great. And like, oh fuck, here we go. And then Brady gets hurt and in comes Our savior, Drew Bledsoe, who I am to the rescue out in my car. To the rescue, literally to the rescue. Thank you very much. Yes, that's exactly what I was looking for. I was looking for somebody who cheers me. Thanks. And uh Bledzer comes in and here.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It happened so fast too of like it felt it feels like, you know Looking back, I was like, oh man, that must have been like such a dramatic thing. But they were just like, oh, Brady's down and Blesso's in. Yep. And then they were like, all right, second and six.",
    "timestamp" : "01:07:25-01:07:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:07:40-01:08:11",
    "text" : "I was like, and so this is with I wrote a what a minute forty left and a half. So we'll get to this later. I found this article of some guy who was a huge blood so stan and hated Brady and wrote a bunch of ESPN articles about him. And like this was his vindication apparently. But so it comes in with a minute 40 left in the half. And the play was uh a laser completion to to to David Patton on the first play. Like Split him five wide and just started chucking the balls great and he zipped it."
  },
  {
    "speaker" : "Steelers Steve",
    "timestamp" : "01:08:11-01:08:11",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:08:11-01:08:51",
    "text" : "Yeah. Second play uh was he got flushed out of the pocket and ran towards the sideline and got lit the fuck up almost exactly the same as he did against the Jets. and Molot. A late shot out of bounds, which I think there was a flag thrown, but they picked it up like the the video that we watched kind of like skip that part so I don't know what happened because I I saw them like throw a flag and they were conferring and then all of a sudden it's still second and six and I was I was bullshit. Again, like this happened fucking with twenty years ago. I was bullshit for 'em. Uh and then the next play came back and he he popped the fuck up too. He was Bledsoe was excited to get it.",
    "speaker" : "Andy"
  },
  {
    "text" : "And Brady was walking by there on the sidelines on his way to the locker room. That was gonna be my best.",
    "timestamp" : "01:08:51-01:08:58",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:08:59-01:09:02",
    "speaker" : "Andy",
    "text" : "That was gonna be my best of the of the of the game. Yeah."
  },
  {
    "text" : "He starts John",
    "timestamp" : "01:09:02-01:09:03",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:09:04-01:09:16",
    "speaker" : "Andy",
    "text" : "He's limping towards the fucking gun. No, he's drawn at the referee because he wasn't throwing a p a flag. And he was fucking livid. He was literally bouncing on his one good leg. It was amazing."
  },
  {
    "speaker" : "Greg",
    "text" : "That's what you want from like your two quarterbacks, right?",
    "timestamp" : "01:09:16-01:09:19"
  },
  {
    "timestamp" : "01:09:20-01:09:20",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:09:20-01:09:23",
    "text" : "Like these two couldn't have handled this whole situation any better."
  },
  {
    "text" : "They had each other's backs. It was amazing.",
    "speaker" : "Andy",
    "timestamp" : "01:09:24-01:09:26"
  },
  {
    "speaker" : "Greg",
    "text" : "And like think about blood, so like He's literally like holding the holding the play sheet and then like 35 seconds later he's in there zipping it. Yeah. Like I imagine like that you're just from a mental preparation standpoint, right? You just stand there like, yeah, I'm not gonna play in this game. And then 35 seconds later, you're in a huddle leading up like they haven't played since week two. Against the best defense in the league. And you're stepping into the AFC championship game. In a two-minute girl. It's just kind of it's just like a weird like movie moment, you know? Yeah.",
    "timestamp" : "01:09:26-01:10:01"
  },
  {
    "timestamp" : "01:10:01-01:10:08",
    "speaker" : "Andy",
    "text" : "Yeah. If you had written this as like part of Remember the Titans, I'd be like, nah, that's that's too far-fetched. You gotta kinda tone that down a bit."
  },
  {
    "timestamp" : "01:10:08-01:10:10",
    "speaker" : "Greg",
    "text" : "Yeah, they would have taken a timeout. Yeah."
  },
  {
    "text" : "No cheer a little or something.",
    "speaker" : "Andy",
    "timestamp" : "01:10:11-01:10:12"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:10:12-01:10:12",
    "text" : "Yeah."
  },
  {
    "text" : "Yeah. Chucked him in. No big deal. It's true blood, so it's fine.",
    "speaker" : "Andy",
    "timestamp" : "01:10:13-01:10:16"
  },
  {
    "text" : "I mean that's probably coaching philosophy, right?",
    "speaker" : "Steve",
    "timestamp" : "01:10:16-01:10:19"
  },
  {
    "timestamp" : "01:10:19-01:10:56",
    "text" : "Yeah, next man up. This is what I'm saying. This is this is the Belchek game. This is the game of the Belchak philosophy. It's that too. It's everything. But I think the uh the the best recipient for this happening was David Patton because he hadn't caught a pass yet this game. And all of a sudden, this is the David Patton drive because he caught all three passes, including the touchdown with 58 seconds left, which look vaguely familiar to a play we'll see next week. In the Super Bowl in that back corner of the uh the end zone.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. So so Budso comes in with a minute forty left and it's zip fifteen yards. Cranked out of bounds, zipped ten yards, zip touchdown, four plays, seven points. Like, what the fuck just happened?",
    "speaker" : "Greg",
    "timestamp" : "01:10:56-01:11:10"
  },
  {
    "timestamp" : "01:11:12-01:11:17",
    "speaker" : "Steve",
    "text" : "35 seconds. It was a third down where he had that nice touch pass before"
  },
  {
    "text" : "No, th that comes later. I know what you're talking about, but that comes later.",
    "speaker" : "Andy",
    "timestamp" : "01:11:18-01:11:21"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. This is four plays, thirty-five seconds, and a touchdown",
    "timestamp" : "01:11:21-01:11:26"
  },
  {
    "timestamp" : "01:11:25-01:11:45",
    "text" : "And then they're showing him on the sideline and there's some guy that has like a a towel up to his chin because I think it was the first pass of the the first completion that he had to Patton. He got Clocked right in the chin. Yeah, split his chin open. So now he's got like a band-aid on his chin and he's just like fucking badass.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:46-01:11:57",
    "speaker" : "Greg",
    "text" : "And his s his uh reaction to throwing the touchdown was sick too. Where he just stares at the sidelines and he gives a little, who me? It was just like everybody's like clamoring around him."
  },
  {
    "text" : "Yeah, it was so that was some fucking cool hand luke shit. Well what else did you expect? Of course I'm gonna throw a touchdown. What do you think? Just so cool.",
    "timestamp" : "01:11:58-01:12:07",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:12:07-01:12:16",
    "text" : "So then stealing the ball back. Well do you remember mom's reaction to that? No. Because mom was I was working, remember?"
  },
  {
    "text" : "Yeah, she's a hard blood cell fan. She was a huge Bled Cell fan.",
    "timestamp" : "01:12:16-01:12:19",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:12:19-01:12:42",
    "speaker" : "Greg",
    "text" : "So like this whole season she was like kind of like torn, like a dude Bledsoe, but And as soon as Brady got hurt, she was like immediately panicked and was like but you know how she like hides in the background? She was hiding behind the couch, like peering over and watching the game. So funny."
  },
  {
    "speaker" : "Andy",
    "text" : "How did she feel about that Bledzo touchdown?",
    "timestamp" : "01:12:42-01:12:44"
  },
  {
    "text" : "Oh, exactly what you'd expect. She was hiding up. Oh yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:12:44-01:12:47"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:12:47-01:12:49",
    "text" : "She was whooping up a storm, I'm sure."
  },
  {
    "text" : "Oh yeah.",
    "timestamp" : "01:12:50-01:12:51",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:12:52-01:13:13",
    "text" : "So I thought the end of the half was actually pretty interesting because I had forgotten about the end of the half as well. Yeah, the Steelers actually, you know, they had what 58 seconds left, I think? Something like that. So under a minute, and they actually moved they had all three timeouts, so they moved the ball down almost within field goal range, and then they took a shot in the end zone, and your boy Skill Burris.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Like they had an OPI that pulled him back on Baris.",
    "timestamp" : "01:13:14-01:13:17"
  },
  {
    "timestamp" : "01:13:18-01:13:44",
    "speaker" : "Andy",
    "text" : "That's exactly what I was about to say. And that was on the shot that they took to Barris. And Otis Smith played it perfectly. Otis Smith in this game, I thought. had one of the best games on defense. Because if you look at Plaxico Burris, that dude is a fucking He's a he's a beast. He's a rush. Yeah, I hate him too. Yeah."
  },
  {
    "text" : "I mean that's I don't hate him, but that name just brings back memories I'd rather not remember.",
    "speaker" : "Greg",
    "timestamp" : "01:13:45-01:13:49"
  },
  {
    "text" : "Yeah. But he was like It almost looked like he was a foot taller than Otis Smith or a foot taller than anybody else out there, but could run past him. It it almost had like a He had that same kind of gait as Randy Moss did, where it didn't look like he was trying much, but he was still just running past people But he just didn't have the awareness, I think, that Rainy Moss had. And Otis Smith played him like a goddamn fiddle in this game. So they took a deep shot. And Otis Smith was just in the perfect position. So um Plaxico Burris had to just kind of grab him and pull him so it wasn't an interception. So that was an offense pass for him to push them outside of field goal range And uh so they had to settle for a Hail Mary which got intercepted instead of an actual field goal.",
    "speaker" : "Andy",
    "timestamp" : "01:13:49-01:14:37"
  },
  {
    "timestamp" : "01:14:37-01:14:43",
    "text" : "Dude, Cordell Stewart didn't even make the end zone on his Hail Mary from the 45-yard line.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:14:44-01:14:45",
    "speaker" : "Andy",
    "text" : "This is true. Ooh."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:14:45-01:14:48",
    "text" : "Quarterback controversy? He couldn't even knock it."
  },
  {
    "speaker" : "Andy",
    "text" : "Wait, drone Bettis? Who is that backup quarterback?",
    "timestamp" : "01:14:48-01:14:52"
  },
  {
    "speaker" : "Steve",
    "text" : "He's on the positive side of the field and like he made it to like the five. He threw it forty yards in the air. Yes, that's not great.",
    "timestamp" : "01:14:52-01:14:59"
  },
  {
    "timestamp" : "01:15:00-01:15:02",
    "speaker" : "Andy",
    "text" : "He was under pressure though, right?"
  },
  {
    "text" : "I don't remember. I don't think so. Yeah, I don't remember yet. Still. It's the Hail Mary. The like the one thing you gotta do is throw it in the fucking end zone. Apparently not. I I remember hating Cordell Stewart. And rewatching this game really made me realize why I hate him because oh he's so bad in this game",
    "timestamp" : "01:15:02-01:15:24",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:15:25-01:15:28",
    "text" : "I never hated them. I was still bad for him for some reason. I don't know why.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "It's like the quarterback you're waiting for the other shoe to drop, right? Like all they're due.",
    "timestamp" : "01:15:28-01:15:32"
  },
  {
    "timestamp" : "01:15:32-01:15:57",
    "speaker" : "Andy",
    "text" : "Yeah I guess. Are we doing best and worse? My best was the offensive pass interference that Oda Smith managed to to pull. And my worst was uh the the dirty hit on Drew Bla on Tom Brady that caused him to get injured. Fuck you guys."
  },
  {
    "speaker" : "Steve",
    "text" : "My worst was uh Jason Gil Gildian Gildan.",
    "timestamp" : "01:15:58-01:16:02"
  },
  {
    "timestamp" : "01:16:02-01:16:03",
    "speaker" : "Andy",
    "text" : "Gildan, yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:16:03-01:16:05",
    "text" : "He was a he was a wrecking ball in this game."
  },
  {
    "speaker" : "Andy",
    "text" : "He was a monster, yeah.",
    "timestamp" : "01:16:06-01:16:07"
  },
  {
    "text" : "He like killed a drive with a sack. He almost had a pick six, like Especially in that first half in actually the whole game, he was in the backfield. We had no answer. And then my best is added out here. I think like when Brady came in and you see like all the players around him that were like excited, right? Like they're ready to go, they're amped up. I think if you'd been in the diva situation the whole year and had been trying to create a divide and not taking the path he would, I don't think it would have been successful in that drive.",
    "speaker" : "Steve",
    "timestamp" : "01:16:07-01:16:42"
  },
  {
    "text" : "I agree. Yeah, just to go back to your Jason Gilden thing, he was uh first team all pro too, the only one on the team. He had 12 sacks on the season.",
    "timestamp" : "01:16:43-01:16:51",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:16:52-01:16:58",
    "speaker" : "Steve",
    "text" : "Yo, and he had like two in this game, like literally a pick six in his hand. He was a fucking monster, yeah."
  },
  {
    "timestamp" : "01:16:59-01:17:00",
    "speaker" : "Andy",
    "text" : "Greg, what about you?"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean, obviously my best is the entire blood so situation.",
    "timestamp" : "01:17:01-01:17:05"
  },
  {
    "text" : "Oh god, yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:17:05-01:17:06"
  },
  {
    "speaker" : "Greg",
    "text" : "With fairy tale. You know, my worst is I think this is in the second quarter when they were showing um Brady going back to the locker room and he was like kind of limping and one of the commentators was like He actually looks like he's uh walking better than he was before and then he starts hopping on his good leg and they were like oh never move a good sign.",
    "timestamp" : "01:17:06-01:17:29"
  },
  {
    "timestamp" : "01:17:30-01:17:33",
    "speaker" : "Andy",
    "text" : "Look at that Phil Sims being wrong again. What a surprise."
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "Yeah",
    "timestamp" : "01:17:33-01:17:34"
  },
  {
    "text" : "Yeah. And like what i Brady's such a fucking goofball too. Yeah. Like He just looked like a a child that's been hurt but doesn't want to admit it. Yep. You know, oh I'll walk on this and then like, oh no, this ain't working.",
    "timestamp" : "01:17:35-01:17:50",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:17:51-01:17:54",
    "speaker" : "Andy",
    "text" : "He tried to walk on it again because he saw the cameras on him."
  },
  {
    "text" : "And it's like why do you why do you need to hop, like just walk slowly?",
    "speaker" : "Greg",
    "timestamp" : "01:17:54-01:17:57"
  },
  {
    "text" : "Yeah, exactly. He's like speedwalk into the locker room. Yeah. Uh all right, so we're at halftime, Greg. Do you want to do your wine review?",
    "timestamp" : "01:17:57-01:18:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:18:09-01:18:10",
    "speaker" : "Greg",
    "text" : "I sure do."
  },
  {
    "text" : "All right, give it to me. All right. Um how is the Carolina Panthers wine?",
    "speaker" : "Andy",
    "timestamp" : "01:18:10-01:18:16"
  },
  {
    "text" : "Well, it's got a nice syrupy texture. It's got a it's got a great nose, definitely some earthy oak, um, nutty tones.",
    "timestamp" : "01:18:17-01:18:27",
    "speaker" : "Greg"
  },
  {
    "text" : "Does it hurt to drink?",
    "timestamp" : "01:18:27-01:18:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh no.",
    "timestamp" : "01:18:30-01:18:31"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. That's that's a good sign.",
    "timestamp" : "01:18:31-01:18:33"
  },
  {
    "timestamp" : "01:18:33-01:18:37",
    "speaker" : "Greg",
    "text" : "It slides down the throat very smoothly."
  },
  {
    "timestamp" : "01:18:37-01:18:39",
    "speaker" : "Steve",
    "text" : "That's what she said."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:18:40-01:18:45",
    "text" : "Oh we're gonna we're gonna isolate that. That's gonna be the uh the quote from this game."
  },
  {
    "timestamp" : "01:18:46-01:18:54",
    "speaker" : "Greg",
    "text" : "It certainly uh It's certainly less underwhelming than the Carolina Panthers."
  },
  {
    "timestamp" : "01:18:55-01:19:02",
    "speaker" : "Andy",
    "text" : "I'll say that. How how would uh Cam Newton rate this?"
  },
  {
    "text" : "Is Cam Newton I bet he is a wine guy, right? Because that's if brawn, like, you know. By the way, that's the worst. If we can like if we can talk about how she LeBron is. Oh, any time.",
    "timestamp" : "01:19:03-01:19:21",
    "speaker" : "Greg"
  },
  {
    "text" : "Always down to do that, yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:19:22-01:19:23"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it's a Boston Podcast.",
    "timestamp" : "01:19:23-01:19:25"
  },
  {
    "timestamp" : "01:19:27-01:19:28",
    "speaker" : "Steve",
    "text" : "Sorry."
  },
  {
    "speaker" : "Andy",
    "text" : "Apparently Greg has finally drank the wine.",
    "timestamp" : "01:19:30-01:19:32"
  },
  {
    "timestamp" : "01:19:36-01:19:43",
    "speaker" : "Greg",
    "text" : "There's so much pollen here. It's ridiculous. I feel like I'm eating pollen every day."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh my god, spring came early. It must suck.",
    "timestamp" : "01:19:43-01:19:45"
  },
  {
    "text" : "It happens like three times a a day where I get this fucking",
    "speaker" : "Greg",
    "timestamp" : "01:19:45-01:19:48"
  },
  {
    "text" : "Gray radio.",
    "timestamp" : "01:19:51-01:19:52",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, but LeBron, fuck LeBron, and he's like thinking he's cool. You know what my l the the thing that LeBron did that I hate the most? What's that?",
    "timestamp" : "01:19:52-01:20:02",
    "speaker" : "Greg"
  },
  {
    "text" : "What's that?",
    "timestamp" : "01:20:02-01:20:03",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:20:06-01:20:25",
    "speaker" : "Greg",
    "text" : "There was like I don't know if you've ever seen how he like pretends to be a reader and he's like always reading The Godfather, the book. There was a situation one time where he was um you know how they like when they do like the pre game stuff, they show the players coming in from the bus?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:20:26-01:20:26"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:20:26-01:20:34",
    "text" : "Well there's one time he was walking and reading The Godfather, right? Which first of all on its face is just ridiculous. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "It is no man reads and walks. He saw the camera up and he flipped the book open.",
    "timestamp" : "01:20:35-01:20:39"
  },
  {
    "timestamp" : "01:20:40-01:21:22",
    "speaker" : "Greg",
    "text" : "Exactly. He knew he was getting filmed, so he flipped his book open to be cool book reading guy, which is a douchebag move. Because anybody that's tried to walk and read knows that it's like damn near impossible. Your head's shaking, you can't you can't focus on the words. Yeah. It doesn't work. But then to make it worse, there was uh there was video of him earlier in the day at a practice session, and after the practice session, he was reading the book on the sidelines. And some internet sleuths look into it and when he was reading it on the sidelines, fake reading it obviously, he was further along in the book than when he was reading it getting off the page. Of course he was. Because he just opened a random page."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:22-01:21:24",
    "text" : "Fucking typical."
  },
  {
    "speaker" : "Greg",
    "text" : "Who the fuck brings a book to practice?",
    "timestamp" : "01:21:24-01:21:26"
  },
  {
    "text" : "Oh my god.",
    "timestamp" : "01:21:27-01:21:27",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:21:28-01:21:32",
    "text" : "Like if that isn't a look-it-me move, then 100% is."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:33-01:21:48",
    "text" : "Wait, how do we get here again? I don't know. Who the fuck is? This is great. Fuck wrong. Yeah, exactly. Uh speaking of people we hate, how about this uh Pedro Steelers game? Should we get in the third should we get in the second half here?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, this third quarter was tough to watch.",
    "timestamp" : "01:21:49-01:21:51"
  },
  {
    "speaker" : "Andy",
    "text" : "It was a little bit. This this was the uh this kind of steelers come back a little bit.",
    "timestamp" : "01:21:52-01:21:56"
  },
  {
    "timestamp" : "01:21:56-01:22:00",
    "text" : "So 14 3 going into the I will say",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:22:00-01:22:34",
    "text" : "The uh the first drive as he was was fun to watch. The opening kickoff, Matt Chatham's tackle on that one. I don't know if you guys spotted that. He It was probably the best tackle I've seen of him so far, but he hit the guy like at a full speed run and it it hit him so hard it bounced him back three yards, but he still managed to hold on and dragged him down at the same time. Like that it it it was embarrassing. It was I think it was the same guy, Steve, that you were talking about, the uh the gunner on the punt retreat."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:22:35-01:22:45",
    "text" : "Troy Edwards, I ate him. Again, yeah, every time he touched the ball, I rooted for him to fail. And that was great, yeah. Yeah, you couldn't get it past the play the whole freaking game."
  },
  {
    "text" : "No, he was not a great kick returner. Or maybe the Patriots special teams were much better than the that was definitely an advantage for us in this game, without a doubt.",
    "speaker" : "Andy",
    "timestamp" : "01:22:45-01:22:53"
  },
  {
    "speaker" : "Steve",
    "text" : "It definitely was, yeah.",
    "timestamp" : "01:22:53-01:22:55"
  },
  {
    "timestamp" : "01:22:56-01:23:03",
    "text" : "Um but the SEO has also had a Heinz Ward fumble overturned",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, the head touching one.",
    "timestamp" : "01:23:03-01:23:05",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:23:05-01:23:14",
    "text" : "Yeah, exactly. And then Lewis. Of course he did. That's definitely a fumble. It has to be overturned. There's no way you could not overturn it. And then it got over.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:23:14-01:23:17",
    "text" : "In his defense they ruled it a fumble in the field. There's nothing to overturn it.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I agree with him on that one, but still fuck Phil Sims and his shitty commentation. Do you like his son?",
    "timestamp" : "01:23:18-01:23:25"
  },
  {
    "text" : "Have you heard him at all?",
    "timestamp" : "01:23:25-01:23:27",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I have not heard him, no.",
    "timestamp" : "01:23:27-01:23:29"
  },
  {
    "text" : "Uh What's his name? Chris Sims. He does like commentary stuff or uh uh PFT. Is that right? Oh, really? Pro football talk? Yeah. With uh with Florio. I he's one of my favorite football commentators going right now. Really?",
    "timestamp" : "01:23:30-01:23:52",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:23:52-01:23:52",
    "text" : "Okay.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. He's kind of like a he's a bit of a prick, but That's all you like 'em. I I really like 'em a lot.",
    "timestamp" : "01:23:52-01:23:59",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "You do I do you identify with them, Greg?",
    "timestamp" : "01:23:59-01:24:01"
  },
  {
    "timestamp" : "01:24:02-01:24:15",
    "speaker" : "Greg",
    "text" : "No. Well, like the good I think. He's got a good back and forth with Florio, who's like a lawyer. So he was always like shitting on him for being a nerd. So I can I can associate with that."
  },
  {
    "timestamp" : "01:24:16-01:24:18",
    "text" : "Fair enough. Yeah, a bit of a prick.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:24:18-01:24:18"
  },
  {
    "speaker" : "Andy",
    "text" : "So yeah.",
    "timestamp" : "01:24:18-01:24:19"
  },
  {
    "timestamp" : "01:24:24-01:24:26",
    "speaker" : "Greg",
    "text" : "Who's your favorite commentator going right now?"
  },
  {
    "speaker" : "Andy",
    "text" : "Tony Robo.",
    "timestamp" : "01:24:27-01:24:28"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Well, I mean like an analysis guy, like post-game analysis guy.",
    "timestamp" : "01:24:28-01:24:33"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:24:34-01:24:35",
    "text" : "Um Brian Brian."
  },
  {
    "timestamp" : "01:24:36-01:24:38",
    "text" : "Yeah. Oh yeah, Baldy.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Baldy Freak Down. He just loves him some good blocking. And that that to me just it just warms my heart.",
    "timestamp" : "01:24:39-01:24:47"
  },
  {
    "timestamp" : "01:24:47-01:24:52",
    "speaker" : "Steve",
    "text" : "He's got an amazing like gravel voice too, which like makes it his love even better."
  },
  {
    "text" : "Yeah, he always sounds hyped up when he's like Doing his breakdowns. Oh yeah, he's working himself up for like 80 minutes, being like, I gotta show you guys this.",
    "speaker" : "Greg",
    "timestamp" : "01:24:52-01:25:04"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:25:04-01:25:14",
    "text" : "He's been edging himself for yeah, a good half hour. You're like, I'm right on the edge here. I'm just oh this this block. Oh, I'm not gonna be a big floor. Wait till you see this block."
  },
  {
    "timestamp" : "01:25:15-01:25:16",
    "speaker" : "Greg",
    "text" : "Look at number fifty-four."
  },
  {
    "timestamp" : "01:25:17-01:25:25",
    "speaker" : "Andy",
    "text" : "Look at how his hands are extended. Oh phenomenal. I love them. So yeah, Baldi's breakdown, if you if you haven't seen them, definitely look 'em up."
  },
  {
    "speaker" : "Steve",
    "text" : "They're worth it.",
    "timestamp" : "01:25:26-01:25:27"
  },
  {
    "speaker" : "Andy",
    "text" : "Um speaking of hands extended or lack thereof. After the fumble was overturned from um Heinz Ward, the literal next play, Cordell Stewart fumbles a snap in perfect karma, because the play shouldn't have been overturned. Yeah, I have a doubt. Recover.",
    "timestamp" : "01:25:28-01:25:44"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:25:44-01:25:46",
    "text" : "Karma bitch."
  },
  {
    "timestamp" : "01:25:47-01:26:05",
    "text" : "Of course you did. Um, but uh third quarter was not Bledsoe's best. Um he struggles on his first drive because the page got the ball like deep inside Steel's territory. And um Not deep inside, ca kind of quote is fifty.",
    "speaker" : "Andy"
  },
  {
    "text" : "Thirty, forty-five ish maybe.",
    "speaker" : "Steve",
    "timestamp" : "01:26:06-01:26:07"
  },
  {
    "timestamp" : "01:26:08-01:26:40",
    "speaker" : "Andy",
    "text" : "Yeah, outside of field goal range. And um I'm pretty sure this is the the drive where Bledsoe does his patented over-the-shoulder throw. Yes. And he started four or five for thirty nine yards and touchdown, and then he does that. Literally getting sacked and throws the ball over his shoulder. And I thought Yeah. I mean it's typical Drew Bledzo, but I thought the intentional grounding call was bullshit. It was. There was actually a guy that was a uh running back in the vicinity."
  },
  {
    "text" : "And like the only reason it was a tension ground is because they hadn't seen him play for so many weeks. Like he'd been playing all year, but like yeah, it's just blood so big.",
    "timestamp" : "01:26:40-01:26:47",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:26:54-01:27:20",
    "speaker" : "Andy",
    "text" : "So they go three and out and it's fourth and seven from like, yeah, just outside field goal in so the patients have to go for it and Bledsoe, I think maybe still hyped up, or maybe it's just typical Drew Bledsoe, tries to throw a wide receiver screen and basically just guns it into Troy Brown's face mask. Yeah. Troy Brown can't catch the ball and drops it. And so that's that's how fourth down goes."
  },
  {
    "timestamp" : "01:27:20-01:27:24",
    "text" : "Uh I remember mom being shook at this point too.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I was watching re-watching this game for the first time in 20 years. I was shook, I'm like, oh fuck. The commentators started talking about how, oh, you better remember this play because you know the Steelers have momentum and it's",
    "timestamp" : "01:27:24-01:27:38"
  },
  {
    "timestamp" : "01:27:38-01:27:55",
    "speaker" : "Greg",
    "text" : "Well, I just mean from like a like a purely blood so loving standpoint where she was like, oh, it couldn't have been better at the end of the first half, but now he's gotta play the whole segment. I think she's probably secretly hoping that like Brady would come back and start the second half. Exactly."
  },
  {
    "text" : "No, he did his part. He had he had his time in the sun and now he can go back into the note here.",
    "timestamp" : "01:27:57-01:28:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:28:03-01:28:12",
    "text" : "Honest question. Uh honest question. Uh if Brady says he wants to give it a go, start of the third quarter, and you're the coach, what do you do?"
  },
  {
    "text" : "Well that's my that was my question here. Like, was the third quarterback even dressed? It was Damon Hewart, I saw him on the sideline. I don't know if he was active or not for the game. I believe if Bloodslow got hurt, would they put Bertie back in? Because he looked okay in that second half-ish. Like same sideline.",
    "timestamp" : "01:28:14-01:28:30",
    "speaker" : "Steve"
  },
  {
    "text" : "But with a bad ankle you can do that.",
    "timestamp" : "01:28:35-01:28:37",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true. Yeah, yeah, yeah.",
    "timestamp" : "01:28:37-01:28:38"
  },
  {
    "text" : "So you can play on a bad ankle. You just can't do anything. You can just stand there and throw it.",
    "speaker" : "Greg",
    "timestamp" : "01:28:39-01:28:45"
  },
  {
    "text" : "Yeah, you're not scrambling or anything.",
    "speaker" : "Andy",
    "timestamp" : "01:28:45-01:28:46"
  },
  {
    "timestamp" : "01:28:47-01:28:48",
    "speaker" : "Greg",
    "text" : "You're just doing shotgun."
  },
  {
    "timestamp" : "01:28:50-01:28:52",
    "speaker" : "Andy",
    "text" : "Oh, absolutely. Yeah."
  },
  {
    "text" : "But just from like r ride in the momentum of the end of the first half Even if he's like, yeah, I can give it a go. If I was a coach, I'd be like, you know what? Like, let's just see how this plays out. And I'd be like, uh, Brady, we don't want to push you. We're going to need you for the Super Bowl.",
    "timestamp" : "01:28:52-01:29:08",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "No, that's that's a great point. Because literally the next drive the Steelers drive down at the field goal range. Um and the Patriots actually had uh uh interception, but it was brought back by defensive offsides. Yeah. And the pass interference was a whole bunch of like defensive penalties on the drive. They get into field goal range and this is the field goal that gets blocked where Troy Brown scoops it up, laterals it to Antoine Harris, and he returns it for a touchdown.",
    "timestamp" : "01:29:09-01:29:40"
  },
  {
    "timestamp" : "01:29:41-01:29:55",
    "speaker" : "Steve",
    "text" : "I actually snapchatted this to Steve be f while I was watching this game the other day. Right before it where Willie drops the pick. Right. They try to play like a little quick out route and Willie McGuinness is right there, hits him right in the hands, and he almost has a second chance at it."
  },
  {
    "speaker" : "Andy",
    "text" : "No, that that's even later in this game though.",
    "timestamp" : "01:29:56-01:29:59"
  },
  {
    "text" : "No, no, this is right before the field goal. That was that third down.",
    "timestamp" : "01:29:59-01:30:02",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:30:02-01:30:03",
    "speaker" : "Andy",
    "text" : "Oh fuck, you're right."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, because the interceptor got on that same drive we had the that was negated by the offsides.",
    "timestamp" : "01:30:03-01:30:08"
  },
  {
    "text" : "Yep.",
    "timestamp" : "01:30:09-01:30:09",
    "speaker" : "Andy"
  },
  {
    "text" : "And then Willie McGuinness like had a short pick in his hands right in the hands. That he drops.",
    "speaker" : "Steve",
    "timestamp" : "01:30:09-01:30:15"
  },
  {
    "timestamp" : "01:30:15-01:30:20",
    "speaker" : "Andy",
    "text" : "Yeah, hits him in the hands. He he he knocks it down to his knees, it bounces up and he still doesn't catch it."
  },
  {
    "timestamp" : "01:30:20-01:30:32",
    "speaker" : "Steve",
    "text" : "Yeah, because I'll just send one Snapchat of him dropping the pick and then the the field goal block. Yeah. And he still agreed to come on this podcast. What a guy."
  },
  {
    "speaker" : "Andy",
    "text" : "Poor bastard.",
    "timestamp" : "01:30:33-01:30:34"
  },
  {
    "timestamp" : "01:30:35-01:30:41",
    "speaker" : "Greg",
    "text" : "But let's get into that blocked field goal because it's it's an absolutely incredible play by Troy Brown."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:30:41-01:30:44",
    "text" : "Is it the best Troy Brown play ever?"
  },
  {
    "timestamp" : "01:30:45-01:30:55",
    "speaker" : "Steve",
    "text" : "This game, the punt return, the only thing we had going in the first quarter, and then obviously this play is just Peak, peak, Troy Brown."
  },
  {
    "timestamp" : "01:30:55-01:31:25",
    "text" : "And I encourage listeners to go back and and look at the video again because I I like my Memory wasn't what it was. Like he like that the kicker is like a yard away from him when he goes to scoop that ball. Like anything, anything outside an absolutely perfect scoop, he's fucked. He's getting tackled. And I know it just like scoops it, doesn't even break stride, and then laterals it like without a thought in the next second, like a perfectly",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I know how exactly. That's the thing though. Like it only Troy Brown would have lateraled that. Because everybody else would be like, I can break the the the tackle of a kicker and I'm gonna keep going and he gets dragged down. And Troy Brown's like, how do I make this?",
    "timestamp" : "01:31:25-01:31:39"
  },
  {
    "text" : "Work. I think Bell Chicky.",
    "speaker" : "Steve",
    "timestamp" : "01:31:39-01:31:41"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that guy's not a good tackle, he's just lateral to him.",
    "timestamp" : "01:31:41-01:31:43"
  },
  {
    "timestamp" : "01:31:44-01:31:45",
    "text" : "A lot of people just jump on that ball too.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:31:45-01:31:54",
    "text" : "Yeah, I think that's what Bell Shakes them all just jump on it, but Troy probably has enough experience like returning punts and catching them off the bounce and stuff. True.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "the he gets the ball there anyway.",
    "timestamp" : "01:32:06-01:32:08"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. I had a question on this that I don't know the answer to. So so he scoops it, right? If he Then like he he took a few steps and then lateraled it. He maybe went like ten yards. If he's if he laterals it and that gets dropped and the Steelers recover Are they first down from there? Is that considered like change of possession?",
    "timestamp" : "01:32:09-01:32:32"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:32:32-01:32:34",
    "text" : "I believe so."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:32:34-01:32:34"
  },
  {
    "text" : "If the Madden video game has taught me a thing, then yes.",
    "timestamp" : "01:32:35-01:32:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Okay. But I think to Greg's point of like it I don't even know it would have been like that because it was so c close between him picking it and lateraling it.",
    "timestamp" : "01:32:39-01:32:47"
  },
  {
    "speaker" : "Andy",
    "text" : "True.",
    "timestamp" : "01:32:47-01:32:48"
  },
  {
    "text" : "It wasn't like he ran ten yards. It was like he took one or two steps, if that",
    "speaker" : "Steve",
    "timestamp" : "01:32:48-01:32:52"
  },
  {
    "text" : "Yep. And he was getting tackled on and down and just chucked it to the guy and white knife to him.",
    "timestamp" : "01:32:52-01:32:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:32:57-01:32:59",
    "text" : "I don't even know how he saw him either."
  },
  {
    "speaker" : "Andy",
    "text" : "It was it was perfect.",
    "timestamp" : "01:33:00-01:33:01"
  },
  {
    "timestamp" : "01:33:01-01:33:02",
    "text" : "It was that bang bang.",
    "speaker" : "Steve"
  },
  {
    "text" : "It was just like scoop it, take a step or two, and then pitch it perfectly to the whenever somebody mentions the name Troy Brown, that's the first play that comes to my mind.",
    "speaker" : "Andy",
    "timestamp" : "01:33:02-01:33:12"
  },
  {
    "speaker" : "Greg",
    "text" : "Well mine is the uh The interception against the Chargers where he stripped it. Oh, yeah, yeah, yeah. That's number two. That one's better to me.",
    "timestamp" : "01:33:12-01:33:21"
  },
  {
    "text" : "Or the uh or the interception of Drew Bledsoe as a defensive back.",
    "timestamp" : "01:33:21-01:33:26",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:33:26-01:33:40",
    "speaker" : "Greg",
    "text" : "Yeah. I mean that was cool for like posterity reasons, but the like in the meaning meaningfulness of the game, that's that's fumble against the charges of just I don't know. This is a heads-up play."
  },
  {
    "speaker" : "Steve",
    "text" : "This game itself, though. He's got 14 points on the board here.",
    "timestamp" : "01:33:43-01:33:46"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:33:46-01:33:46"
  },
  {
    "text" : "All by himself. By himself. And not on offense. Yeah.",
    "timestamp" : "01:33:46-01:33:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:33:51-01:33:56",
    "text" : "You also shout out Antoine Harris, uh local Raleigh, North Carolina legend."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, I if we can find a way, I'd love to have him on the podcast because I think he is one of those He he's like the that that same kind of uh mold of the that middle class of Patriots players that that's kind of the the foundation of that Belichick system, you know?",
    "timestamp" : "01:33:56-01:34:19"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he's got like a he's got like a semi-following around here.",
    "timestamp" : "01:34:19-01:34:23"
  },
  {
    "text" : "Oh yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:34:23-01:34:24"
  },
  {
    "text" : "Yeah. Cause he's like he's a Raleigh born and bred, and there's tons of New Englanders living in Raleigh. And there's like a Patriots bar downtown where they all watch the games. And he shows up all the time and like does autographs and pictures and shit like that.",
    "timestamp" : "01:34:24-01:34:39",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Brown, you gotta get you gotta go talk to him when he does.",
    "timestamp" : "01:34:39-01:34:41"
  },
  {
    "text" : "Dude, I get weird about like that kind of stuff.",
    "timestamp" : "01:34:42-01:34:46",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:34:46-01:34:48",
    "text" : "So do I, and I'm still doing it, so fucking.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, well why don't you fucking woman, Mandy, huh?",
    "timestamp" : "01:34:49-01:34:52"
  },
  {
    "text" : "If we get some on the podcast, let's fucking do this.",
    "speaker" : "Andy",
    "timestamp" : "01:34:52-01:34:55"
  },
  {
    "timestamp" : "01:34:56-01:35:00",
    "text" : "Cause i I don't know. If I was famous, I'd be like, uh, I'm sick of people trying to",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:35:02-01:35:13",
    "text" : "You know. But that's the thing though. I I feel like he's that class of guys who probably appreciates the attention because he doesn't get it a lot because he's not Famous, famous, you know?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:35:13-01:35:15",
    "speaker" : "Greg",
    "text" : "Oh he famous boy."
  },
  {
    "timestamp" : "01:35:15-01:35:19",
    "text" : "He's I bet he's not like going out to the grocery store and be like, oh my god, that's Antoine Harris.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:35:19-01:35:20",
    "text" : "That's true.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:35:21-01:35:33",
    "text" : "Like he can still live his life, but when people recognize him, that's that's gotta feel good when people recognize him. Yeah, that's what I'm saying. I wish I was Antoine Harris.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I want I wish uh uh I want to be like uh like a investment banker. Rich where you're not famous at all, but you just have fuckload of money.",
    "timestamp" : "01:35:34-01:35:44"
  },
  {
    "timestamp" : "01:35:44-01:35:57",
    "speaker" : "Andy",
    "text" : "So you know, I so here's my thing. I I've said this for a while. I want to be famous for something I've made, but I don't want people to recognize me. So I can go to a party and be like, oh, so what do you do? I'm like, oh I made this thing that everybody uses."
  },
  {
    "text" : "You like this.",
    "speaker" : "Greg",
    "timestamp" : "01:35:57-01:35:57"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:35:57-01:35:59",
    "text" : "I made this podcast."
  },
  {
    "text" : "Right, yeah, exactly. Like oh I run a podcast that's super fucking famous. You may have heard of me",
    "timestamp" : "01:36:00-01:36:04",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "You're like the Banksy of Podcast, Sandy.",
    "timestamp" : "01:36:04-01:36:06"
  },
  {
    "timestamp" : "01:36:06-01:36:09",
    "text" : "Exactly, yeah. Nobody knows what I look like.",
    "speaker" : "Andy"
  },
  {
    "text" : "Except way less talented.",
    "speaker" : "Greg",
    "timestamp" : "01:36:09-01:36:11"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:36:12-01:36:16",
    "text" : "Hey, go fuck yourself. And significantly uglier."
  },
  {
    "text" : "How many times will we booted Greg from this podcast? Because one of these times is going to be fucking ugly.",
    "timestamp" : "01:36:16-01:36:20",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:36:20-01:36:28",
    "speaker" : "Greg",
    "text" : "And we've never seen Banks beat, but we know Andy's ugly or just by like the low averages. Listen, you prick."
  },
  {
    "timestamp" : "01:36:30-01:36:31",
    "speaker" : "Steelers Steve",
    "text" : "I have to put up with this."
  },
  {
    "text" : "It's statistically almost guaranteed.",
    "speaker" : "Greg",
    "timestamp" : "01:36:31-01:36:34"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:36:37-01:36:41",
    "text" : "Just because your mom says you look like Tom Bray doesn't mean you actually do your fucking head."
  },
  {
    "timestamp" : "01:36:42-01:36:44",
    "text" : "I love wine episode.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "We should do it more often. So after the Antoine Harris uh touchdown Uh I've never heard Heinz Field so so quiet, which is fucking phenomenal.",
    "timestamp" : "01:36:45-01:36:57"
  },
  {
    "text" : "I have after that blown touchdown by Rothesberger when he fakes biked it into a pick.",
    "timestamp" : "01:36:57-01:37:03",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "But that was what 14 years later? 13 years later?",
    "timestamp" : "01:37:04-01:37:08"
  },
  {
    "text" : "Yep. Yeah.",
    "timestamp" : "01:37:08-01:37:10",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:37:10-01:37:50",
    "text" : "Um but it didn't last because The Steelers would score two touchdowns in this this quarter. A Jerome Bettis touchdown, which actually should have been a um the fuck was his name? Zero way. Yeah. Which was no. This is actually when I wrote down the referees, these referees are garbage, was because It was clearly a touchdown, but like, oh no, he stepped out at the two. And it was blatantly obvious he didn't. Almost similar to the um Nikila Harry touchdown against the Chiefs. It was more blatant than that that he didn't step out of bounds.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:37:50-01:37:52",
    "text" : "Yeah, it was close."
  },
  {
    "text" : "Because of how many bad calls there have been in this game or even close calls, if you will. Uh the Steelers didn't have any more challenges. They couldn't challenge, so they had to run a play, but they were at the the two-yard line anyway, and the bus ran in for touchdown.",
    "timestamp" : "01:37:52-01:38:06",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:38:06-01:38:13",
    "text" : "So the bus's like actual legitimate stat line was what minus one carry, minus two yards, minus one touchdown."
  },
  {
    "text" : "Yeah, this was notable in that he gained positive yards.",
    "timestamp" : "01:38:13-01:38:16",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:38:17-01:38:19",
    "speaker" : "Andy",
    "text" : "Right, yeah, and and scored a touchdown on it. Yeah."
  },
  {
    "timestamp" : "01:38:19-01:38:22",
    "speaker" : "Steve",
    "text" : "I don't even know if he got in either. Like look like he got stood up."
  },
  {
    "speaker" : "Andy",
    "text" : "It was borderline. You probably could have challenged that, but at this point everybody's so fucking bored of challenging it. Like Belljack's like, yeah, fuck it. Just let it ride. Um and then the ensuing patrons drive was more of the same. It was a false start penalty to start it. Bloodsoe sacked again, which uh brought back a whole flood of memories of Bledsoe. It was one of those ones where you just held the ball too long. Yeah, play Matty Kick with it. Throw it, throw it, throw it, throw it. Fuck you got sacked. I can't have that. God damn it. Happy feast, Bledsoe.",
    "timestamp" : "01:38:22-01:38:55"
  },
  {
    "speaker" : "Steve",
    "text" : "Bledsoe, fatty cake, then shitty punt coverage because they returned that punt to like the 35. That's how they got that second touchdown.",
    "timestamp" : "01:38:55-01:39:01"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. So they returned the punt. And actually, I will shout out um The punter. Lee? No, not Lee Johnson. It was Ken Ken Walter, yes.",
    "timestamp" : "01:39:01-01:39:14"
  },
  {
    "speaker" : "Greg",
    "text" : "Thank you. Such a punter name, Ken. Yeah.",
    "timestamp" : "01:39:14-01:39:17"
  },
  {
    "speaker" : "Andy",
    "text" : "But he's a single father just doing his best too.",
    "timestamp" : "01:39:19-01:39:21"
  },
  {
    "timestamp" : "01:39:22-01:39:28",
    "speaker" : "Greg",
    "text" : "My friends call me Kenny. But in professional circumstances, I go by Ken."
  },
  {
    "timestamp" : "01:39:28-01:39:49",
    "speaker" : "Andy",
    "text" : "I go by Ken is Yeah, it just feels more professional. Yeah. So Ken Walden, but he was fucking hustling. He's the one that that actually ran the partner turn out of bounds. But at the New England 32. So a few plays later, Amos, Famous Amos scores a uh touchdown."
  },
  {
    "text" : "This game's the get a little close cookies for everybody. That's a good like Steve, you want to hear some marketing shit right now? Uh if if Zaraway scores a touchdown, uh free cookies for everybody. Famous, famous cookies in the stance.",
    "timestamp" : "01:39:49-01:40:03",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:40:04-01:40:05",
    "speaker" : "Andy",
    "text" : "Nice idea."
  },
  {
    "text" : "You like that speed? What about maybe if they miss two extra points in the fourth quarter free cookies for everybody?",
    "speaker" : "Steve",
    "timestamp" : "01:40:05-01:40:13"
  },
  {
    "speaker" : "Andy",
    "text" : "What? What the fuck are you talking about?",
    "timestamp" : "01:40:14-01:40:17"
  },
  {
    "text" : "You ever in a basketball game where they if you miss both free throws, like everyone gets Chick-fil-A?",
    "timestamp" : "01:40:17-01:40:22",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah, they do that NC State.",
    "timestamp" : "01:40:22-01:40:24"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:40:25-01:40:25"
  },
  {
    "text" : "But then you don't have the connection to Amos. Right. This kid calls himself a marketer. Unbelievable.",
    "speaker" : "Greg",
    "timestamp" : "01:40:25-01:40:33"
  },
  {
    "timestamp" : "01:40:33-01:40:37",
    "text" : "Alright, let's do best and worst. Come on. Fucks.",
    "speaker" : "Steve"
  },
  {
    "text" : "I'm about to take your job. My best is at the uh at the last drive of the third quarter, the Patriots should get finally get their first first down of the second half. Yeah. My worst is all the fucking touchdowns that the Steelers scored because it's now 21-17 instead of 21-3.",
    "speaker" : "Andy",
    "timestamp" : "01:40:37-01:40:57"
  },
  {
    "speaker" : "Greg",
    "text" : "All right, my best, obviously Antoine Harris. What a legend. Yeah. Actually no, my new best is uh that that punt return by Troy Edwards. Like that guy's a stud. Lot twist, all right.",
    "timestamp" : "01:41:00-01:41:16"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:41:17-01:41:19",
    "text" : "It was a good part of child give him that."
  },
  {
    "timestamp" : "01:41:19-01:41:22",
    "speaker" : "Greg",
    "text" : "It was, yeah. Steve, care to comment?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:41:23-01:41:28",
    "text" : "There's a block in the back that the rest missed. That's all I got."
  },
  {
    "text" : "No worse. Fuck worse. My yeah, your worst is the uh the Pittsburgh crowd going silent. Fuck 'em. Yeah. Battle for adversity. Jesus Christ. You're fucking Pittsburgh, Pennsylvania. You've been through.",
    "timestamp" : "01:41:29-01:41:45",
    "speaker" : "Andy"
  },
  {
    "text" : "I actually have two bests and two worsts. How about that? God damn. My worst is Steve Brown. The Tyla hit out of bounds on Heinz Ward.",
    "timestamp" : "01:41:46-01:41:58",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:42:00-01:42:01",
    "text" : "Was that your best or worst?"
  },
  {
    "text" : "That was the worst. Like that was kind of a dumb thing about that. He definitely got smacked and like hands the basic.",
    "timestamp" : "01:42:01-01:42:09",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:42:09-01:42:27",
    "text" : "Hines Ward basically took his fucking helmet off with a fucking flopped ground on the bench. I I guarantee Belichick was like, I don't give a fuck about that penalty. That was worth it. He barely touched him. It was a flop. That was both."
  },
  {
    "text" : "I keep I have I have on here this note over and over again and it keeps getting like in bigger and bigger caps of like so many home calls.",
    "timestamp" : "01:42:27-01:42:33",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "There seemed to be a lot of players on calls. No, there weren't there weren't home calls, there's just bad calls on both sides of the ball.",
    "timestamp" : "01:42:34-01:42:40"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, they're the I don't believe in home calls. I do, but not in this game. In professional sports, dude, these guys, they no They don't do home calls. I disagree.",
    "timestamp" : "01:42:41-01:42:52"
  },
  {
    "speaker" : "Steve",
    "text" : "I had a worse where right after the turnover, the karma turnover. Let's go take the shot to the end zone, the same one there they got the touchdown on.",
    "timestamp" : "01:42:52-01:43:01"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "01:43:01-01:43:02"
  },
  {
    "timestamp" : "01:43:02-01:43:04",
    "text" : "And just sails it like",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:43:08-01:43:10",
    "text" : "Four yards out of bounds. That was great."
  },
  {
    "speaker" : "Steve",
    "text" : "He's throwing it away. There was a sneaky uh heads up play on that third down before the failed fourth down conversion where he got strip sacked and it's that kind of like right on the edge strip sack where it might have been incomplete might have been strip sack And you watch that Patriots player just like come flying in from nowhere and jump on the ball.",
    "timestamp" : "01:43:10-01:43:33"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know who it was, but I wrote it down as Troy Brown because it felt like it's a little bit more.",
    "timestamp" : "01:43:34-01:43:36"
  },
  {
    "text" : "No, I looked it up. I had to like rewind it and pause it. Yes, Charles Johnson, yeah. No shit. All right.",
    "speaker" : "Steve",
    "timestamp" : "01:43:37-01:43:43"
  },
  {
    "timestamp" : "01:43:43-01:43:46",
    "speaker" : "Greg",
    "text" : "And I thought he was Bethel Johnson the whole game."
  },
  {
    "speaker" : "Andy",
    "text" : "Charles Johnson, who used to play for the Steelers, which I think is why he put so much fucking effort into this game.",
    "timestamp" : "01:43:47-01:43:53"
  },
  {
    "timestamp" : "01:43:52-01:43:56",
    "text" : "And he's on the list of touchdown catches from Brady with one.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:43:56-01:44:04",
    "speaker" : "Andy",
    "text" : "He is. Yeah, we saw it uh I think it was in the uh Saints game. Saints game. Yeah. And it was a fucking laser by Brady."
  },
  {
    "text" : "Yeah, we should do a live um sporkle for Brady like TD recipients.",
    "speaker" : "Greg",
    "timestamp" : "01:44:04-01:44:12"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:44:12-01:44:21",
    "text" : "All right. You've already done it once I've seen it. I've done it. Yeah, yeah. It's actually one. It's super hard because there's fucking 70 something of them."
  },
  {
    "timestamp" : "01:44:22-01:44:35",
    "speaker" : "Greg",
    "text" : "Yeah. And it's just interesting like going through twenty your whole sports fandom of players and being like All right, how many receivers can you remember of your sports fandom?"
  },
  {
    "timestamp" : "01:44:35-01:44:36",
    "text" : "Yeah. That's basically what it is.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Because there's so many obscure people too. And then you'd be like Johnson, and it'll bring up like three Johnstons. Like, oh yeah.",
    "timestamp" : "01:44:36-01:44:41"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, all of those are great.",
    "timestamp" : "01:44:42-01:44:43"
  },
  {
    "speaker" : "Steve",
    "text" : "Troy laterals for the field goal return.",
    "timestamp" : "01:44:53-01:44:56"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:44:56-01:44:57",
    "speaker" : "Andy"
  },
  {
    "text" : "They had a shot, the great work by CBS of Tom Brady celebrating, jumping on one leg.",
    "speaker" : "Steve",
    "timestamp" : "01:44:57-01:45:03"
  },
  {
    "speaker" : "Greg",
    "text" : "I didn't see you.",
    "timestamp" : "01:45:04-01:45:05"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:45:06-01:45:09",
    "text" : "Oh yeah, no, that was my other best for the game. God damn."
  },
  {
    "speaker" : "Greg",
    "text" : "Screaming like a girl like in Seattle Super Bowl?",
    "timestamp" : "01:45:09-01:45:12"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but literally but on one leg. It was exactly the same like jumping up and down with his hands on his head, but on one leg. It was phenomenal.",
    "timestamp" : "01:45:12-01:45:19"
  },
  {
    "speaker" : "Greg",
    "text" : "I love Brady.",
    "timestamp" : "01:45:20-01:45:21"
  },
  {
    "timestamp" : "01:45:21-01:45:31",
    "speaker" : "Andy",
    "text" : "He was so pumped up for this game. I'm so pumped up for like Drew Bledsoe and like everything that was happening. He was so pissed he wasn't in there, but he was like in a good way. It was amazing."
  },
  {
    "timestamp" : "01:45:32-01:46:04",
    "text" : "I got uh I got a worst that I missed from earlier in the game. Hmm. The um I think it was in the first quarter, the the fourth and one situations where they bring the people out the the offense out and do the hard count. Right. And then call timeout. I fucking cannot stand that. Why not? Cause it never works. And it's a tease. You're like, all right, you're going for this, and then you get hyped up, and then you're like, that was lame. Oh, and successful.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:46:05-01:46:12",
    "speaker" : "Andy",
    "text" : "As a defense, you're so relieved though, right? Like if it's the pages on defense and they do that, you're like, oh fuck, nobody's gonna fall for that. Fuck off."
  },
  {
    "text" : "I guess. Yeah. But I just like it yeah. Have you ever seen it work? I can't even think of an instance where I saw it work. It must have worked at some point. It just feels like one of those coach things where they're like, oh yeah. It probably worked like twice, and then ever since then, every coach in the world has been like Oh, fourth and one, they're coming out there and they do a motion or a shift to start the pages did like four or five motions on this play.",
    "timestamp" : "01:46:13-01:46:39",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:46:39-01:46:40",
    "speaker" : "Andy",
    "text" : "Yeah, it's always selective."
  },
  {
    "text" : "Yeah, because of like up shift, up motion. You're like There's no fucking chance they snap this block.",
    "timestamp" : "01:46:40-01:46:45",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:46:45-01:46:55",
    "text" : "Well, what's has it ever been where like everyone in the stadium thinks that they're not gonna go for it and then all of a sudden with like two seconds left in the play clock, they snap it?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:46:55-01:47:08",
    "text" : "That's a fucking good call, Steve. They should do that. They should do a sh a shift, a motion, and then like a hard count and then and then the quarterback walks off the field and then they direct snap to the fucking running back. Yes That's genius.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "No, we should email uh what's his name? The the pink strapes guy. Oh yeah. Fuck's his name. Ernie Ernie Adams. Yes. Should we should send him a m if anybody who's listening knows Ernie Adams email Oh Ernie Adams is not listening",
    "timestamp" : "01:47:11-01:47:27"
  },
  {
    "text" : "Seeing if you can get like an advanced scouting report.",
    "speaker" : "Steve",
    "timestamp" : "01:47:27-01:47:29"
  },
  {
    "speaker" : "Andy",
    "text" : "That's probably true. Ernie Adams, if you if you're listening, hit us up at uh Patriots Dynasty two thousand one on Twitter.",
    "timestamp" : "01:47:29-01:47:36"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:47:36-01:47:41",
    "text" : "Yeah, and let's just send them a DM us. It won't have any words, it'll just be like play sheets. Yeah."
  },
  {
    "text" : "Oh 100%. Oh yeah. No, we we've got plenty of players that we can write up for you.",
    "timestamp" : "01:47:42-01:47:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:47:46-01:47:46",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "All right, fourth quarter.",
    "timestamp" : "01:47:47-01:47:48"
  },
  {
    "text" : "Fourth quarter, baby. This is crunch time. Patriots clinging to a lead 21-17. They have the ball. They're driving. They've they actually finally get a first down. This literally the first down in the first half is on their last drive of the third quarter.",
    "timestamp" : "01:47:48-01:48:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:48:03-01:48:05",
    "text" : "Sneaky big grab by Johnson."
  },
  {
    "timestamp" : "01:48:06-01:48:30",
    "speaker" : "Andy",
    "text" : "Yep, and then they get another which was uh Drew Bledsoe on third and short getting lit the fuck up like he does like a jump pass And uh it takes a shot kind uh it would have been to the chest, but now it's to the groin because he he jumped up, but completes it to the uh To Mark Edwards on the other."
  },
  {
    "speaker" : "Steve",
    "text" : "They got like a tiny little grip on the run game there, which I think set up that pass to the fullback.",
    "timestamp" : "01:48:36-01:48:42"
  },
  {
    "text" : "It did. So it's it's that typical Patriots, you know, run a few times, get to third and short, and then convert it with with the pass. Did it a couple times and got into field goal range enough that uh out of an ateri kicked a long field goal. It's like 45-ish yards, give or take. Uh hit that Well patch her up 24-17 and the Steelers get the ball back. Another Plaxico Burris offensive pass interference. That's two in the game, which I don't think has ever happened before that I can remember. Two offensive pass interference on the same wide receiver. But this was again going back to Otis Smith just kind of owning shit. And he was he was lined up on Plaxico Burris and Tyla was lined up on Heinz Ward, just the entire game. Wherever they went, they were just shadowing them. And neither of those wide receivers had a good game. No.",
    "timestamp" : "01:48:42-01:49:41",
    "speaker" : "Andy"
  },
  {
    "text" : "Especially Hines. I think Tyla did an amazing job on him.",
    "timestamp" : "01:49:42-01:49:45",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, I think so too. No, and there was uh there was actually one play. I don't even remember what the play was. I think it was like a run play. Or maybe it was um Cordell Stewart like r running for a couple yards. But you could you it it showed in the foreground Otis Smith just kind of punching Plaxico Burris in the chest as he tried to get off the line and Plaxico Burris just didn't know what to do with it. And the the commodities actually called it out at one point. Yeah. And it was it was kind of how the whole game went. You just you just Otis Smith just kind of was too physical for Plaxico Barris in this entire game and Plaxico just didn't know what to do. He didn't have a gun in his in his sweatpants, so he he couldn't You couldn't handle this shit.",
    "timestamp" : "01:49:46-01:50:31",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:50:31-01:50:48",
    "speaker" : "Steve",
    "text" : "That's uh that reminds me one year on Halloween, uh I had a friend who had a Plaxco de Burris Giants jersey and I went him for Halloween. I got a pair of sweatpants, put a shitload of ketchup all in the dick area, soft like a BB gun in my pants, and that one has flex a go."
  },
  {
    "timestamp" : "01:50:49-01:50:51",
    "speaker" : "Andy",
    "text" : "Oh Steve Brown, you never feel disappoint."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:50:53-01:51:08",
    "text" : "It's an all-time it's an all-time bonehead move. Oh it's not great. A gun without a safety in sweatpants. I don't even put my cell phone in my sweatpants. Yeah. Right. club falls out every fucking time you can."
  },
  {
    "speaker" : "Andy",
    "text" : "Who goes to a club in sweatpants by the way? Like I don't go to many clubs and when I do it ain't in sweatpants because they don't fucking let you in.",
    "timestamp" : "01:51:08-01:51:15"
  },
  {
    "timestamp" : "01:51:15-01:51:20",
    "text" : "And he just signed like a deal too. He just signed like a contract I feel like.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:51:21-01:51:22",
    "text" : "That feels right, yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:51:23-01:51:26",
    "text" : "Because everyone's like, what's gonna happen with this contract? Because he's going to jail.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:51:27-01:51:39",
    "speaker" : "Greg",
    "text" : "I can't believe he did go to jail for that, right? Yes. That's outrageous. He shot himself. But still, this is America, damn it."
  },
  {
    "speaker" : "Andy",
    "text" : "He discharge a firearm in a in a building with lots of money.",
    "timestamp" : "01:51:40-01:51:43"
  },
  {
    "timestamp" : "01:51:43-01:51:44",
    "speaker" : "Greg",
    "text" : "Yeah, but that himself."
  },
  {
    "text" : "I mean true.",
    "speaker" : "Andy",
    "timestamp" : "01:51:45-01:51:46"
  },
  {
    "speaker" : "Greg",
    "text" : "Like yeah Marvin Harrison has shot people and he didn't go to jail. Really someone didn't go to jail. You know, and then this guy shoots himself and they're like jail time.",
    "timestamp" : "01:51:50-01:52:01"
  },
  {
    "timestamp" : "01:52:02-01:52:08",
    "text" : "That's because New York. I bet if he did that in Indiana like uh Marvin Harrison did, he wouldn't have got jail time",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, for sure not.",
    "timestamp" : "01:52:08-01:52:09",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "But he's not big enough ironic for New York to be able to get off.",
    "timestamp" : "01:52:09-01:52:13"
  },
  {
    "timestamp" : "01:52:13-01:52:19",
    "text" : "I mean Tyree Kill broke his girlfriend's orbital bone. He didn't go to jail. Allegedly.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Just breaking that right the fuck down. Good job. Um so speaking of orbital bones, I guess, fourth quarter. I thought the the miss of the game was Jou Bledsoe going deep in his own territory to David Patton and Patton was half a step short.",
    "timestamp" : "01:52:20-01:52:40"
  },
  {
    "timestamp" : "01:52:40-01:52:42",
    "text" : "That was a touchdown. Yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "That's actually he wasn't even short, but Bledsoe actually underthrew him. And whoever the defensive back was just barely got like a fingertip on it and made Patton bobble it. And if Patton caught that, he's walking in for a touchdown. He should have caught it. That's it. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:52:42-01:52:58"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:52:58-01:52:59",
    "text" : "He should have caught it."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:52:59-01:53:00",
    "text" : "I agree."
  },
  {
    "speaker" : "Steve",
    "text" : "That's the classic Bledsoe upside though, right? That was such a beautiful ball.",
    "timestamp" : "01:53:01-01:53:06"
  },
  {
    "speaker" : "Andy",
    "text" : "Off his back foot. Yeah, Bledsoe chucked it like 60 yards off his back foot because That's all he knows how to do.",
    "timestamp" : "01:53:06-01:53:12"
  },
  {
    "text" : "You just spun it.",
    "speaker" : "Greg",
    "timestamp" : "01:53:12-01:53:13"
  },
  {
    "timestamp" : "01:53:14-01:53:16",
    "speaker" : "Andy",
    "text" : "Yeah, he just hocked it."
  },
  {
    "text" : "For every for every throw over his head on third and seven. that he gets intentional grounding for he then uncork the ball like that.",
    "speaker" : "Steve",
    "timestamp" : "01:53:16-01:53:26"
  },
  {
    "text" : "Yeah, exactly. Um but they they convert a couple third downs and eventually punt the ball. Just running off clock at this point. Um and now we get into the Cordell Stewart interception section of the podcast.",
    "speaker" : "Andy",
    "timestamp" : "01:53:27-01:53:42"
  },
  {
    "timestamp" : "01:53:42-01:53:43",
    "text" : "Brigade.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:53:44-01:53:44",
    "text" : "Yeah."
  },
  {
    "text" : "I'd wrote a note right before this. Because I again, like Andy, I'd watched a lot of the highlights and I had watched that Troy Brown like kick return and all that a bunch and the field goal block. I hadn't watched the whole game and my whole perception was that like we kinda hung on at the end. Yeah. Which I don't know Brunswick made some plays But and I also remember like hating Cordell Stewart out of this and I have a note on here, has Cordell thrown a pass more than 14 yards and then like immediately after it",
    "speaker" : "Steve",
    "timestamp" : "01:53:45-01:54:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Tries it dot dot dot throws a pick and then he meeting as another one and the both of the picks were just so yeah both of them he just overthrew his wide receiver neither of the wide receivers were open",
    "timestamp" : "01:54:18-01:54:30"
  },
  {
    "speaker" : "Steve",
    "text" : "No, the first one his guy was so open. Well the first one he was actually right, yeah. Heinz Ward had like nobody within five yards of him. And he shook it like five yards over his head into the bigger. It was like ten yards deep and he threw it so far over the Hines Ward's head that the safety hit uh Where it was to Bucky right in the chest and he like bobbled it. He was like, Why is this ball in my chest right now?",
    "timestamp" : "01:54:30-01:54:54"
  },
  {
    "timestamp" : "01:54:54-01:54:55",
    "text" : "Yeah, it was a can of corn.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:54:56-01:54:59",
    "speaker" : "Greg",
    "text" : "Can of corn. Do you know that phrase comes from?"
  },
  {
    "speaker" : "Andy",
    "text" : "I do, but I don't remember. Yeah, it's talking about knocking kids of corn off the uh off the top shelf.",
    "timestamp" : "01:54:59-01:55:06"
  },
  {
    "speaker" : "Greg",
    "text" : "Yes. Old old grocers. Used uh used to use a stick to get things off the corn and they'd knock it into their waistband pocket things. Yeah. And they just knock it off the shelf and catch it in their little hip pocket. And make it look so easy. Can of corn. Yep. Remember that video game we used to play?",
    "timestamp" : "01:55:06-01:55:27"
  },
  {
    "timestamp" : "01:55:27-01:55:30",
    "text" : "And then fuck what was that? It was a computer game, yeah. Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Every single every fucking time, like at least once a game.",
    "timestamp" : "01:55:30-01:55:34",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:55:36-01:55:54",
    "speaker" : "Andy",
    "text" : "All we do is swing it every pitch. There's either a home run or a flyball. Yeah. And every pop-up. Can of corn. Hey, you know where that phrase came from? Exactly. That's where I learned it from. It's a video game. Yeah. MLB two thousand four or some shit like that it was. Yeah."
  },
  {
    "text" : "I still I still dish out that fact all the time.",
    "speaker" : "Greg",
    "timestamp" : "01:55:54-01:55:57"
  },
  {
    "timestamp" : "01:55:57-01:55:58",
    "text" : "Oh me too.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:55:58-01:55:59"
  },
  {
    "speaker" : "Andy",
    "text" : "So, yeah, so Coral Stewart throws a new session to Bucky Jones, overthrows it.",
    "timestamp" : "01:56:00-01:56:04"
  },
  {
    "timestamp" : "01:56:04-01:56:05",
    "speaker" : "Greg",
    "text" : "A can of corn."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep, Pasco 3-0. Because you know, Drew Blaz is at the home and that's what happens right now. And Adam Vinateri misses his first field goal since um Connor decided to tell us that he didn't miss a field goal for the rest of the season. Well, well, well. This was the one What do we have here?",
    "timestamp" : "01:56:05-01:56:25"
  },
  {
    "text" : "To be fair, it was a 50-yard field goal at Hinesfield. And a chance to make it a two-score game with two and a half minutes left AFC championship game.",
    "timestamp" : "01:56:26-01:56:35",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. So this would have been clutch. Yep. Push it just left. And he missed by like what a foot if that. I had a note here like that. Didn't miss by much. Horseshoes and hand grenades, Andy.",
    "timestamp" : "01:56:35-01:56:48"
  },
  {
    "speaker" : "Steve",
    "text" : "On that third down the touchdown, if we just like got five yards or so, we probably would have made that.",
    "timestamp" : "01:56:48-01:56:54"
  },
  {
    "timestamp" : "01:56:54-01:57:02",
    "text" : "Oh yeah. Yeah. No yeah, because Bletto Took a shot in the end zone and like threw it like fucking. Way over everybody's head. Yeah. Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "But that's why I'm saying this these perceptions on kickers are just built on circumstances, right? So the Steelers come back and get a touchdown here. People are talking about that missed kick. Yeah. They're like, yeah, he made a great he and that like invalidates the kick against the Steelers because they don't or the Raiders because they don't make the Super Bowl. True. Yeah. Right. And then and then this whole like lore of Adam Vinateri being the the best clutch clutch kicker in the history of the game is like kind of thrown out the window.",
    "timestamp" : "01:57:02-01:57:30",
    "speaker" : "Greg"
  },
  {
    "text" : "It's it's very true.",
    "timestamp" : "01:57:30-01:57:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "So it's just like all entirely built on circumstances. So like that that's the argument I was trying to make. It's not that Vinateri sucks. It's just like yeah, he's like an average kicker, but great. In the circumstances he got and you know he made some big kicks.",
    "timestamp" : "01:57:31-01:57:49"
  },
  {
    "text" : "Yeah. And and but give me one field goal that Steven Goskowski has even had the opportunity to make To win a game.",
    "speaker" : "Andy",
    "timestamp" : "01:57:49-01:58:00"
  },
  {
    "text" : "The Rams Super Bowl.",
    "timestamp" : "01:58:00-01:58:02",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:58:03-01:58:11",
    "text" : "And But that wasn't to win the game. That was just go up a couple. Yeah, the Giants game. That's it. Like he hasn't had one where He's like a tough kick.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:58:11-01:58:17",
    "text" : "Yeah, I mean he's got he's had a few, but like a you're talking about like a tough kick in like a really important game.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:58:17-01:58:56",
    "text" : "Yeah, to win it. Like he just hasn't had that opportunity. So So they missed a field goal. The Steels get the ball back in pretty good position. And I think it was maybe one or two plays later. Cordell Stewart does an overthrow again. Thanks to Oda Smith undercutting the route. And it's picked off by Laurie Malloy. And this game is just about over. But it's officially over when Antoine Smith, who has averaged maybe one less than two yards of carry so far On second and like eight runs for twelve yards, gets the first down, game over."
  },
  {
    "speaker" : "Steve",
    "text" : "Dude, do you see how hyped everyone was when he got that?",
    "timestamp" : "01:58:57-01:58:59"
  },
  {
    "speaker" : "Andy",
    "text" : "First down to God.",
    "timestamp" : "01:58:59-01:59:01"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:59:02-01:59:05",
    "text" : "Literally everybody. Mark Edwards was there. They were just like, they knew it. It was awesome."
  },
  {
    "timestamp" : "01:59:06-01:59:13",
    "speaker" : "Andy",
    "text" : "The entire Pedro's defense went and stood up on their um on the bench and started waving the white towels at the crowd."
  },
  {
    "text" : "Yeah, I saw that.",
    "speaker" : "Steve",
    "timestamp" : "01:59:13-01:59:14"
  },
  {
    "timestamp" : "01:59:14-01:59:17",
    "speaker" : "Andy",
    "text" : "Which was my favorite moment of this entire game."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, that's amazing. Drew in that final huddle when the kneel down looked like he was about to cry. He was like blinking like every second.",
    "timestamp" : "01:59:17-01:59:25"
  },
  {
    "timestamp" : "01:59:25-01:59:27",
    "speaker" : "Andy",
    "text" : "Ah, it was So good."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:59:27-01:59:29",
    "text" : "Yeah, that was uh that was awesome."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I mean they were 10-point dogs in this game.",
    "timestamp" : "01:59:29-01:59:32"
  },
  {
    "text" : "They were, and they and they won it. I'm surprised it was that low. I was too actually.",
    "timestamp" : "01:59:32-01:59:38",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:59:38-01:59:44",
    "speaker" : "Greg",
    "text" : "Like the Steelers are a wagon playing at home. So ten points is a lot of points for a playoff game."
  },
  {
    "timestamp" : "01:59:44-01:59:46",
    "text" : "That's true. Yeah, for an AFC championship game.",
    "speaker" : "Andy"
  },
  {
    "text" : "Especially in a low scoring league like this place. Yeah, that's true.",
    "timestamp" : "01:59:46-01:59:50",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "So give me your best and worst for this game now.",
    "timestamp" : "01:59:51-01:59:53"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, we got the quarter.",
    "timestamp" : "01:59:54-01:59:56"
  },
  {
    "speaker" : "Andy",
    "text" : "That was no best world. Let's go whole shebang. Whole game, baby. Steve Brown.",
    "timestamp" : "01:59:57-02:00:02"
  },
  {
    "speaker" : "Greg",
    "text" : "My best. I mean, there's there's absolutely no argument you can make against the best not being the Bledsoe story. You know, just the way he handled himself all year and then to to step in with like thirty seconds of notice and Win the AFC championship game.",
    "timestamp" : "02:00:03-02:00:23"
  },
  {
    "speaker" : "Andy",
    "text" : "But not only that, but the way he did it. The way he took that hit on the sideline and bounced back up. And then went and threw touchdown, which was basically the game winning touchdown. Yeah.",
    "timestamp" : "02:00:23-02:00:34"
  },
  {
    "timestamp" : "02:00:35-02:00:58",
    "speaker" : "Steve",
    "text" : "The replacements should be this. I thought he was like terrible in the second half, but like re-watching it, he had some clutch throws. He had like that awesome touch pass what was it like in the fourth quarter? Yep, that was pretty sick. huge third down to keep that kind of drive churning and eating up the clock. Like he actually had some bigger plays than I remembered."
  },
  {
    "text" : "Yeah. Yeah, I remember just like kind of hanging on in spite of blood so, but that's definitely not the case. Yeah. It was because of Bloodsoe.",
    "timestamp" : "02:00:59-02:01:08",
    "speaker" : "Andy"
  },
  {
    "text" : "All right, so my worst is this wine.",
    "timestamp" : "02:01:12-02:01:15",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:01:18-02:01:20",
    "text" : "What do you expect from the cow line package?"
  },
  {
    "text" : "I was bullshitting at the beginning. I I don't like red wine to begin with. So how much how much did it cost?",
    "speaker" : "Greg",
    "timestamp" : "02:01:20-02:01:25"
  },
  {
    "timestamp" : "02:01:26-02:01:26",
    "speaker" : "Andy",
    "text" : "Neither do I."
  },
  {
    "timestamp" : "02:01:27-02:01:38",
    "text" : "You know, I was I was thinking I didn't even look at the price. No big deal. I I wanna say it was like more expensive than I thought. I think it was like 35 bucks or something.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:01:38-02:01:38",
    "text" : "Ooh."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "02:01:39-02:01:55",
    "text" : "Yeah. I probably should have checked the price, but I was like, ooh. Big NFL logo, that thing's gotta be like twelve dollars. Like this thing looks gaudy as shit. Oh man, you know what likes the Panthers, so that that's gonna lead into my best, which is"
  },
  {
    "text" : "Drew Bledsoe knows how to make a bottle of wine.",
    "timestamp" : "02:01:55-02:02:00",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "02:02:00-02:02:02",
    "speaker" : "Greg",
    "text" : "He knows how to crush grapes. Let's say that."
  },
  {
    "speaker" : "Andy",
    "text" : "This man has created a fantastic bottle of wine.",
    "timestamp" : "02:02:02-02:02:06"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "02:02:07-02:02:21",
    "text" : "And um you wanna you wanna know something funny is like I didn't I didn't realize until very recently that um raisins were just like dehydrated grapes. What? Yeah. Bro."
  },
  {
    "text" : "And dude, pickles? Oh no. Pickled cucumber? Yes. You know what the thing is? I love I love pickles. I I don't like cucumbers.",
    "timestamp" : "02:02:22-02:02:35",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "02:02:35-02:02:48",
    "speaker" : "Steve",
    "text" : "I've always thought that though, like, why are pickles called pickles and like it's pickled onions, pickled radishes, pickles, all of this. That's the point we brought up when we were having a discussion. Why not call a pickled cucumbers?"
  },
  {
    "timestamp" : "02:02:48-02:02:53",
    "text" : "And why not call a raisin a dehydrated grape?",
    "speaker" : "Greg"
  },
  {
    "text" : "Well like dehydrated other stuff, you know. I mean it's fine. I get that. They're called craisins.",
    "timestamp" : "02:02:54-02:03:06",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Or that.",
    "timestamp" : "02:03:07-02:03:08"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm just saying that. I'm just saying, you know, I I feel like it's not my fault, it's society's fault. Not just for this, but for everything.",
    "timestamp" : "02:03:09-02:03:19"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean I'm disagreeing.",
    "timestamp" : "02:03:20-02:03:21"
  },
  {
    "text" : "And for all my flaws, you know?",
    "timestamp" : "02:03:21-02:03:22",
    "speaker" : "Greg"
  },
  {
    "text" : "My worst is Greg Brown's flaws and also the referees in this game. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "02:03:23-02:03:26"
  },
  {
    "speaker" : "Greg",
    "text" : "Do I don't care so bad? I don't beat my wife because I'm an asshole. It's because society raised me this way.",
    "timestamp" : "02:03:27-02:03:33"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:03:33-02:03:35",
    "text" : "Yeah. Jesus Christ."
  },
  {
    "speaker" : "Greg",
    "text" : "It's one I have got to you. Just kidding, cut that.",
    "timestamp" : "02:03:35-02:03:42"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, on that note, Steve Braham, with you best of words.",
    "timestamp" : "02:03:42-02:03:45"
  },
  {
    "text" : "The worst is that last comment. Fair. Uh best was definitely Peak Troy Brown. Well, not definitely. I agree with Greg on the Drew Glad So redemption story and all that. If I had to do it. This is peak Troy Brown. I mean, there's other plays you can pull out, right? Of like Troy Brown being this, and he's always been my favorite Patriot, but like this game is technical. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "02:03:48-02:04:14"
  },
  {
    "text" : "You want to run through his contributions real quick?",
    "timestamp" : "02:04:14-02:04:16",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "02:04:17-02:04:19",
    "speaker" : "Steve",
    "text" : "Yeah, what was the stat line on the receiver?"
  },
  {
    "text" : "Okay, so he had eight catches for 120 yards. Damn, son. He had the scoop and Toss. Yep, for the touchdown. Yep. And he had three returns, 80 yards, and a touchdown.",
    "timestamp" : "02:04:19-02:04:36",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, for 26 and a half yard average.",
    "timestamp" : "02:04:36-02:04:40",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "So a a touchdown a touchdown two hundred yards and a touchdown pass. Essentially.",
    "timestamp" : "02:04:40-02:04:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Touchdown lateral.",
    "timestamp" : "02:04:50-02:04:52"
  },
  {
    "text" : "Is that that's that's a fucking Troy Brown stat line. Yeah.",
    "timestamp" : "02:04:52-02:04:57",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "02:04:57-02:05:00",
    "text" : "That is the prototypical Troy Brown stat line.",
    "speaker" : "Andy"
  },
  {
    "text" : "And he didn't make the initial Pro Bowl. Yeah. Garbage.",
    "timestamp" : "02:05:00-02:05:03",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:05:03-02:05:12",
    "text" : "And like they were talking about Ford setting the Steelers single season record with like 90-something catches. And I was like, wait, didn't over 100?"
  },
  {
    "text" : "Yeah, he had more than that. Yeah. So C Row is your worst then? Troy Edwards? Gotta be right?",
    "timestamp" : "02:05:12-02:05:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "No, I think watching Cornell Stewart try to play quarterback, man. Yeah, since he got bottled up.",
    "timestamp" : "02:05:22-02:05:29"
  },
  {
    "timestamp" : "02:05:29-02:05:30",
    "speaker" : "Andy",
    "text" : "He struggled."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:05:30-02:05:35",
    "text" : "Yeah. Is he um what's the Bills guy right now?"
  },
  {
    "speaker" : "Greg",
    "text" : "Tyrod Taylor.",
    "timestamp" : "02:05:36-02:05:37"
  },
  {
    "text" : "No.",
    "speaker" : "Steve",
    "timestamp" : "02:05:37-02:05:37"
  },
  {
    "timestamp" : "02:05:38-02:05:43",
    "speaker" : "Andy",
    "text" : "He's for the Saints now, but uh uh Chargers now, but uh Allen Josh Allen"
  },
  {
    "timestamp" : "02:05:44-02:05:58",
    "speaker" : "Steve",
    "text" : "You know where like you're just waiting for that other shoe to drop with him? Or even Sir Sam Darnold, you know, like you're just waiting for them or Sanchez, you can go through the list of quarterbacks where you're just like, yeah, he's gonna fuck up pretty Cordell will get better than them."
  },
  {
    "timestamp" : "02:05:59-02:05:59",
    "text" : "No.",
    "speaker" : "Greg"
  },
  {
    "text" : "He's a brawl baller.",
    "speaker" : "Steve",
    "timestamp" : "02:05:59-02:06:00"
  },
  {
    "timestamp" : "02:06:02-02:06:14",
    "speaker" : "Andy",
    "text" : "Yeah, he was he was dangerous in other ways. Like his passing wasn't his Danger, I guess."
  },
  {
    "timestamp" : "02:06:15-02:06:24",
    "speaker" : "Steve",
    "text" : "And like he couldn't, I mean he could run the ball, but he didn't against us. So Belchuk took away what he did well and made him beat him with his arm, and then just watching Cordell try to beat us with his arm."
  },
  {
    "text" : "Yeah. It was brutal to watch. I'll give you that.",
    "speaker" : "Andy",
    "timestamp" : "02:06:25-02:06:29"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:06:29-02:06:37",
    "text" : "He was that's why he threw two picks in the last minute because like the only thing they had is Cordell trying to throw it down the field."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I mean he ran for forty one yards and his longest with thirty-four. He had two fumbles, one which he lost. 24 for 42 for 255 uh passing with three interceptions, three sacks And uh long as a twenty-four yards. His rating was forty-five point two.",
    "timestamp" : "02:06:37-02:06:59"
  },
  {
    "text" : "Yeah, as long as it was twenty-four yards, and that was probably a screen pass. I actually pretty sure it was the Zeroway.",
    "timestamp" : "02:07:00-02:07:06",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, it was. It was to um Charlot Bettis.",
    "timestamp" : "02:07:06-02:07:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Famous Amos.",
    "timestamp" : "02:07:10-02:07:11"
  },
  {
    "text" : "So like the dude cannot drop the ball down the field. So when it came to that and he had to, boom. Pick, pick, done.",
    "timestamp" : "02:07:12-02:07:21",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, it wasn't great.",
    "timestamp" : "02:07:22-02:07:24",
    "speaker" : "Andy"
  },
  {
    "text" : "Although that's actually probably a best just because he sucks. Maybe the other worst is a specific ref call where they had a huge block in the back. And they called it back because the rumors.",
    "timestamp" : "02:07:25-02:07:37",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "But it didn't though. I don't think it did. I think if you reviewed that you would have found out.",
    "timestamp" : "02:07:47-02:07:51"
  },
  {
    "text" : "And fucking Plaxco bursts high steps away from that whole situation like a fucking goon.",
    "timestamp" : "02:07:52-02:07:57",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he did. Fucking dirty.",
    "timestamp" : "02:07:58-02:08:03"
  },
  {
    "text" : "Bad refurbisco being an idiot. The only thing could have been if like Troy Ed's would come up and chest bumped them or something.",
    "speaker" : "Steve",
    "timestamp" : "02:08:03-02:08:10"
  },
  {
    "text" : "Steve. I love it. Alright, well I think we've done this game justice. And uh next week",
    "timestamp" : "02:08:13-02:08:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "We have what I'm hoping will be We're doing spirits.",
    "timestamp" : "02:08:23-02:08:27"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:08:28-02:08:29",
    "text" : "Oh Jesus Christ."
  },
  {
    "timestamp" : "02:08:30-02:08:32",
    "speaker" : "Greg",
    "text" : "Imagine that'd be awesome."
  },
  {
    "speaker" : "Andy",
    "text" : "Next week I think I'm hoping we have a uh a special guest. So we will see you for that one. The Patriots have made the Super Bowl for their third time ever. Going for the first ever Super Bowl win against the greatest show on turf. So we will see you next week for that.",
    "timestamp" : "02:08:32-02:08:51"
  },
  {
    "speaker" : "Steelers Steve",
    "text" : "Gentlemen, have a good evening. Have fun at Media Day. Hell yeah.",
    "timestamp" : "02:08:52-02:08:58"
  }
]