[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid. You still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:19"
  },
  {
    "text" : "Welcome to episode 2 of the Patriots Dynasty Podcast. This week we have everybody. We've got uh Mike Mello. How you doing, Mike? Uh doing doing splendid.",
    "timestamp" : "00:25-00:38",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "00:38-00:39",
    "text" : "How are you doing, man?",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Ooh, splendid. I'm do I'm doing very well. Much better now that I've been talking to you.",
    "timestamp" : "00:39-00:43",
    "speaker" : "Andy"
  },
  {
    "text" : "Wow, that's so sweet.",
    "timestamp" : "00:43-00:45",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:46-00:54",
    "text" : "We've also got Steve Brown with us today. In the middle of dinner, I think. Steve, how's it going? Amazing."
  },
  {
    "timestamp" : "00:54-00:59",
    "text" : "What are you eating for dinner? Uh those burgers we had last weekend when we were up here.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "00:59-01:01",
    "speaker" : "Andy",
    "text" : "The same ones or did you cook more?"
  },
  {
    "timestamp" : "01:02-01:02",
    "speaker" : "Steve",
    "text" : "That was my question."
  },
  {
    "text" : "Oh, okay. I was just making sure you didn't know.",
    "speaker" : "Andy",
    "timestamp" : "01:06-01:08"
  },
  {
    "timestamp" : "01:09-01:13",
    "speaker" : "Mike Melo",
    "text" : "It would have been a better story if it was the same one, yeah. It would have been better."
  },
  {
    "timestamp" : "01:13-01:20",
    "speaker" : "Andy",
    "text" : "That's all right. And last but definitely not least on the phone we have uh Greg Brown. How's it going, Greg?"
  },
  {
    "speaker" : "Greg",
    "text" : "It's going just great, Andy.",
    "timestamp" : "01:20-01:22"
  },
  {
    "timestamp" : "01:22-01:25",
    "text" : "Nice. It's nice to have you here for this one.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm glad to be here for the inaugural episode.",
    "timestamp" : "01:25-01:29"
  },
  {
    "text" : "Yeah, we'll call this the inaugural episode too. It's fine. We we didn't do them before. It's okay. You didn't miss anything. Game wise you didn't miss anything because the Bengals game was rough. Yeah, I watched half of it. It was a very familiar feeling, I think, was the consensus of uh futility, especially down at the end of the Yeah. But I believe at the end of that episode, Mike made a a bold a bold statement that um 9-11 was the reason for the Patriots dynasty.",
    "timestamp" : "01:29-02:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I'm gonna comment my I don't know if that's exactly what I said. If 9-11 didn't happen, the dynasty would have never happened, is my point.",
    "timestamp" : "02:06-02:19"
  },
  {
    "text" : "You just call Mo Lewis 9-11.",
    "speaker" : "Steve",
    "timestamp" : "02:24-02:26"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "02:27-02:35",
    "text" : "I mean look, these are hi no comment, you know"
  },
  {
    "speaker" : "Andy",
    "text" : "After a rousing start of it.",
    "timestamp" : "02:36-02:38"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "True. I'm not saying that it is a direct correlation. Okay. Don't don't take it that way. I am just saying, if 9-11 did not happen, Tom Brady would not be our quarterback. I mean, he might be playing for the freaking Colts for all we know. That's true. Go the 49ers. Right. So that's my point. You don't need to spin it, okay?",
    "timestamp" : "02:44-03:06"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. All right. I mean I I I think there's probably something to that. Maybe we'll get into it further down the road and see. Um Like how the Panthers were at the beginning of the season, because I know at the end of the season they got their doors blown out by the Pages, but I think they kind of given up on the year by that point. So maybe it does change things.",
    "timestamp" : "03:06-03:29"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "See that's all I'm saying. I'm with you, Mike. I mean the whole narrative changed. Plus, I mean here's the other thing. I I I don't I'm not a conspiracy theorist, right? But the Patriots the Patriots are playing the Jets. after nine eleven. I mean, I don't know man. Yeah. Yeah. It just seems a little fishy. We're all Patriots of the end of the year. I mean, I'm not gonna say that sports is scripted, but if it were Bob Kraft is an opportunist and I do not stand by that.",
    "timestamp" : "03:30-04:01"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:01-04:09",
    "text" : "And and weren't weren't the pages playing the Rams and the Ram is a uh A Muslim figurehead or something. I remember seeing that pop up."
  },
  {
    "timestamp" : "04:09-04:18",
    "speaker" : "Mike Melo",
    "text" : "I I did see that frequently as well. I don't know. It seemed a little too opportunistic in my opinion, but hey. Uh this is the Patriots uh dynasty."
  },
  {
    "speaker" : "Andy",
    "text" : "Right?",
    "timestamp" : "04:25-04:25"
  },
  {
    "timestamp" : "04:26-04:36",
    "text" : "Um I don't know, but the I feel like around that era. Yeah, and the the Patriots, you know, we're all patriots, right? Uh the whole Bob Kraft thing, I think.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "But we're on the city. Yeah, I mean I get it, but you think you may also do it around one of the New York teams as well.",
    "speaker" : "Andy",
    "timestamp" : "04:37-04:49"
  },
  {
    "timestamp" : "04:50-04:53",
    "speaker" : "Mike Melo",
    "text" : "So Yeah, but they just didn't have the talent, did they?"
  },
  {
    "speaker" : "Andy",
    "text" : "Maybe that's what 2007 was. Oh, it could have been a little redemption there. Yeah, just a long game.",
    "timestamp" : "04:53-05:00"
  },
  {
    "speaker" : "Greg",
    "text" : "Fair change. You gotta educate yourself. Luke Chain, whatever that you know, that conspiracy documentary.",
    "timestamp" : "05:00-05:07"
  },
  {
    "timestamp" : "05:08-05:12",
    "speaker" : "Mike Melo",
    "text" : "Oh yeah. And Zeitgeist. Zeitgeist, you gotta check those out."
  },
  {
    "text" : "Yep. Gotta educate itself.",
    "timestamp" : "05:13-05:15",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:17-05:19",
    "text" : "Oh is this where you call me sheeple?"
  },
  {
    "timestamp" : "05:20-05:21",
    "speaker" : "Greg",
    "text" : "Exactly."
  },
  {
    "text" : "I don't know, but I mean in all seriousness, uh, you know, nine eleven, I was reading like some of the uh the articles that you had uh available to us and just kind of looking it over. I mean it is pretty uh Pretty devastating. And you could even tell, like, how do you even write about it? And how do you write about sports after something like that happens? So I mean I know that there's a debate between leagues on like if games should be played or when they should be played, but at the same time the country can't stop for that kind of stuff. And I think that overall the country, New York, the leagues, they all kind of did what they could to kind of rally everything. So",
    "timestamp" : "05:22-05:57",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "05:59-06:50",
    "speaker" : "Andy",
    "text" : "Yeah, cuz um for the listeners that don't know what we do behind the scenes, I I put together old clippings of the Boston Globe. And so for this one I put together like the day after September eleventh, like the sports section. And that that was the argument was, you know, do you keep going? Do you play the games this weekend or do you not? And like push everything off. So of course obviously they push it off one week, which is why instead of playing the Panthers, they skipped a week, put the Panthers at the end of the season, and then played the Jets the week after. That's what happened, right? The only time that the that's whatever happened, that the season has been moved around. Um I'm wondering if it happened back in like the strike shortened era. I think that'd be the only other time I could think of. But f the only time that since we've been alive, yeah."
  },
  {
    "text" : "Yeah, it's pretty inter Too watching like the Andruzi brothers, like that one that one had me going with the Fields, you know?",
    "speaker" : "Greg",
    "timestamp" : "06:50-06:57"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah. Oh yeah. Yep. Pretty powerful.",
    "timestamp" : "06:57-07:00"
  },
  {
    "text" : "Yeah. I didn't expect it to as much cause it's been so long, but it definitely hit me somewhere.",
    "timestamp" : "07:01-07:07",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "07:07-07:27",
    "text" : "Yep. Oh dude, and then like how about I mean I wrote this guy's name down. He's like the Mass State trooper, but Dan Clark sort of like led the national anthem and he went through like this whole It was like part performance art, part like history lesson talking about like sort of our country uh our country and the national anthem. But I thought that was phenomenal.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I was riveted the whole time. And even uh before that, they they started the whole programming with um New York mayor Rudy Giuliani talking about You know, unity and s New York and strength and all that stuff. It's interesting to see that side of him, especially what he's become these days. But He was very eloquent, I thought. And then they moved on to that whole extended national anthem. It was it was it was uh yeah, like Greg said, I wasn't expecting to be hit that hard by it 'cause it's been so long, but It was uh like even the moment of silence felt longer than any moment of silence you hear anymore.",
    "timestamp" : "07:27-08:10"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "08:10-08:13",
    "text" : "Did you see uh the Lionel Richie thing?"
  },
  {
    "timestamp" : "08:14-08:14",
    "speaker" : "Andy",
    "text" : "No."
  },
  {
    "timestamp" : "08:14-08:16",
    "speaker" : "Mike Melo",
    "text" : "No, I I missed that."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "08:17-08:27",
    "text" : "I watched it through YouTube and they had like some extended opening and they had like Lionel Ritchie doing like a piano song solo type thing. It was ridiculous."
  },
  {
    "timestamp" : "08:27-08:31",
    "speaker" : "Andy",
    "text" : "Oh, that's right. Yeah, that was uh right after Broody I think, wasn't it?"
  },
  {
    "timestamp" : "08:32-08:32",
    "speaker" : "Greg",
    "text" : "Exactly."
  },
  {
    "text" : "Yeah, yeah. No, I forgot about that, yeah.",
    "speaker" : "Andy",
    "timestamp" : "08:33-08:35"
  },
  {
    "text" : "So my question was gonna be who who would who would you have do it in today's day and age if you have like a national tragedy and you gotta pick like Songbird of our generation. Who you got going out there?",
    "timestamp" : "08:36-08:50",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "08:51-08:52",
    "speaker" : "Andy",
    "text" : "Ooh, that's a good question."
  },
  {
    "timestamp" : "08:53-08:57",
    "text" : "Lil Oozy, you think? Tail switch maybe",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "08:58-09:02",
    "text" : "Taylor Smith could be uh, you know, but she could be classy.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Probably somebody in country music, I would think.",
    "timestamp" : "09:03-09:05"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "09:06-09:07",
    "text" : "Lil Xan."
  },
  {
    "text" : "Bruce Springsteen dude, he'd be perfect. Oh you're right, yeah. He's not like really Yeah, everybody loves him knows his song.",
    "timestamp" : "09:13-09:22",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I mean he's kind of not our generation though. He's like way back there anyway. I'd say Tom.",
    "timestamp" : "09:22-09:26"
  },
  {
    "text" : "Yeah, but you still know his song though, right? What? You still know his songs.",
    "timestamp" : "09:27-09:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "09:32-09:38",
    "text" : "Oh yeah, I mean he's a classic, but I thought we were talking about today. Like the classics of today for tomorrow."
  },
  {
    "speaker" : "Andy",
    "text" : "Is he still even is Springsteen still alive? I don't know. I feel like we're entering dark territory here. A little bit.",
    "timestamp" : "09:38-09:44"
  },
  {
    "text" : "What about uh a Dell? A Dell could work.",
    "speaker" : "Greg",
    "timestamp" : "09:47-09:50"
  },
  {
    "text" : "Oh, good one. Yep.",
    "speaker" : "Mike Melo",
    "timestamp" : "09:51-09:53"
  },
  {
    "text" : "Yep.",
    "speaker" : "Greg",
    "timestamp" : "09:53-09:54"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's not a bad one. Hopefully uh this uh you know we never have to address this uh ever moving forward. Would that be clear?",
    "timestamp" : "09:54-10:01"
  },
  {
    "text" : "But I love how this podcast off to a very patriot centric start here.",
    "timestamp" : "10:01-10:06",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "10:06-10:18",
    "text" : "It sure is. Yeah, this is about football, guys. Well I mean you kinda have to talk about this because this is like the mood going into this game was Super patriotic."
  },
  {
    "timestamp" : "10:18-10:47",
    "speaker" : "Mike Melo",
    "text" : "Yeah. And I mean it's also crazy just looking back because I mean I at the time I mean I was, you know, in college and, you know, what the hell you you don't know anything when you're in college, right? So I don't know if so like I I quite understood like exactly what was happening at that time. I know there was a confusion as to like you know, who was behind it and like what this whole thing was. So looking back now, I mean you definitely have a different perspective on the whole thing for sure."
  },
  {
    "timestamp" : "10:47-10:49",
    "speaker" : "Andy",
    "text" : "Yeah, absolutely."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, did you notice that they don't refer to it as nine eleven either, 'cause it's like it happened last week. So I wonder if it's a little bit more than that. Oh yeah. That's always kinda interesting. It's like when does it that note that name become like a unanimous. Yeah.",
    "timestamp" : "10:49-11:12"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I wonder when that happened. I wonder if it was on the one year anniversary of like this is the date it happened. This is The date that's gonna look down an infamy.",
    "timestamp" : "11:13-11:22"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "11:22-11:26",
    "text" : "Right, yeah, that would make sense. Like a year on, you're like 9-11, yeah."
  },
  {
    "timestamp" : "11:26-11:47",
    "text" : "Yeah. I mean, and in in like adding to Greg's question, like what How do you guys feel about how they they went with this? Like what what do you think the ideal situation would be to um sort of pay respects and kind of let the country heal a little bit before going back to it? I mean, do you think that It's a right to just get back into playing these games.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "11:48-12:43",
    "text" : "Uh I think it's a balancing act and I think even even when they were playing this game, like in the the papers they were people on both sides of it. It's like, yeah, well there's a the NFL's just getting back into it 'cause they don't want to lose any money and the other half is like, yeah, we need to get back into this cause we can't let, you know, terrorists dictate our lives and we just need to get back to doing what we're doing. So I think they walked a fine enough balance. I'm sure there was shady shit going on in terms of like they were trying to get um whoever was using the What's the the stadium in New Orleans? The Superdome at the time? They were trying to get whoever was using it the weekend after the original Super Bowl to move their shit. Oh right. So there was kind of like some some of that stuff going. So the uh I think there was some like the NFL doesn't want to lose any money sort of things happening."
  },
  {
    "timestamp" : "12:43-13:00",
    "text" : "Right. I mean it's a catch twenty-two though because in one sense, I mean it's sort of like the evil empire where you're talking about they just want to make money, but then it's also like You know, we're capitalist society and if we do allow that to kind of change our behaviors, then what are we doing? Right, exactly.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, I'm I'm strongly in that camp of like the point of terrorism is to fuck up your you know your shit and make you overreact so it's like That's basically giving into what they why they did it, you know?",
    "timestamp" : "13:00-13:15",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. And the fact that we're still taking our shoes off to get on airplanes is kinda points. Yeah, it's a fair point.",
    "timestamp" : "13:15-13:21"
  },
  {
    "text" : "Not me. Pre check, bro.",
    "speaker" : "Steve",
    "timestamp" : "13:21-13:23"
  },
  {
    "speaker" : "Andy",
    "text" : "Must be nice.",
    "timestamp" : "13:26-13:27"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "13:28-13:29",
    "text" : "It is."
  },
  {
    "text" : "Alright then, I guess it's just me. Assholes. Now the one thing I I did catch was that um I know Greg touched on the Andrewsie brothers or the whole family actually going out there because the dad was there too, right? But we're saying that that was Robert Kraft's idea, which I thought was kind of cool.",
    "speaker" : "Andy",
    "timestamp" : "13:31-13:51"
  },
  {
    "timestamp" : "13:52-14:17",
    "speaker" : "Mike Melo",
    "text" : "It is. And it was also, I mean, I don't know, because It's always a debate with like entertainment and these spectacles of like like you said how much is opportunity versus how much is heartfelt, but just at least Not even talking about craft or whatever, but just seeing the family, seeing how they spoke. I mean, that was like really um just amazing to see their reaction, how much they did love the country, how much they were felt. And I mean all of them are from New York, if I'm not mistaken, so"
  },
  {
    "timestamp" : "14:18-14:24",
    "text" : "Yeah, because they were all uh at least a couple of them were firefighters in the New York fire department.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:24-14:27",
    "speaker" : "Steve",
    "text" : "I think they did something in the Super Bowl as well, like something similar."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's that sounds familiar. But yeah, I think and one of the because they interviewed them like towards the end of the game, the broth like the brothers on the sideline, like as the game was going on. And I I thought they said that one of the brothers Like 9-11 was his first day on the force.",
    "timestamp" : "14:28-14:45"
  },
  {
    "text" : "Oh, I think yeah. I think something like that. Yeah, it's insane.",
    "timestamp" : "14:46-14:49",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "And the other one was like he was actually on the scene like ten minutes before the the tower fell, or the tower collapse. So like it makes a lot of sense that they of all people were there and were the ones being uh celebrated at this. Like they were the face of it. That that kind of made sense because they also had the connection to football, obviously. But like it wasn't like they just pulled some randos out of the out of the stands because there was some like generic connection. Like these guys actually were legit.",
    "timestamp" : "14:49-15:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "15:23-15:37",
    "text" : "Well the uh who was the commissioner was it Tagliaboo? Tagli however you Yes, I believe so. Yeah so I mean, we could probably wager that Goodell might not handle it as classy. I don't know. That's just a gut feeling."
  },
  {
    "timestamp" : "15:38-15:53",
    "speaker" : "Andy",
    "text" : "Well, I mean there was a whole bunch of stuff swirling around Taglaboo about how he didn't want to cancel the games that weekend too. And the RZ did is because the Jets uh threatened to just not play regardless if they held the games or not, like all the players. So they weren't gonna play, so then he canceled it."
  },
  {
    "timestamp" : "15:53-15:56",
    "speaker" : "Steve",
    "text" : "What do you think Adele would have done if he was in charge?"
  },
  {
    "timestamp" : "15:57-15:59",
    "speaker" : "Andy",
    "text" : "Oh, he would have fucked it up somehow. Found a way."
  },
  {
    "timestamp" : "16:00-16:11",
    "speaker" : "Mike Melo",
    "text" : "I mean, he probably would have suspended Brady for some reason. I don't know. I mean that's it's my guess."
  },
  {
    "text" : "That's dark, but I I kinda like it.",
    "speaker" : "Andy",
    "timestamp" : "16:12-16:14"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I mean I'm just going by the past, you know.",
    "timestamp" : "16:14-16:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. So alright, let's uh let's kind of get into a bit of the game then now that we've we've beaten the the dead horse of 9-11 Which is a great way to start this. A couple things. Uh I know in the last episode we talked about the replacement referees, which I completely forgotten about, and now I know why. It was because Uh the NFL sorted out the referee situation real fast after 9-11 happened. So they had the regular refs back in this game. Not that I thought you could really tell, because I don't think they were very good, but um the other generic game thing was that the commentators for this game were Dick Enberg and Dan Dierdorf. Which I found offensive personally because out of every commentator that I've ever listened to do a a football game, I think Dan Dedorf is easily the worst. We still got a job. It's ridiculous. He was so bad. I started just tracking all the things that they got wrong and then I got so angry that I stopped doing it.",
    "timestamp" : "16:19-17:25"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "17:26-17:27",
    "text" : "How far did you get?"
  },
  {
    "timestamp" : "17:27-17:41",
    "speaker" : "Andy",
    "text" : "Uh let's see. Um they were getting names wrong from the opening kickoff. They uh mentioned whoever the the um The kicker was. They they got that name wrong. Um they were calling both punters Tom Tupa for both teams."
  },
  {
    "text" : "Even though he was a big thing. As they showed Demon's Fantastic.",
    "speaker" : "Mike Melo",
    "timestamp" : "17:41-17:44"
  },
  {
    "timestamp" : "17:44-18:06",
    "speaker" : "Andy",
    "text" : "Yep. Uh they didn't understand penalties. They couldn't understand that uh loss of d you get a loss of down on intentional grounding. It took 'em I think two intentional groundings or maybe three for them to actually understand that that was happening. And then Dan kept bringing up how painful it must be for uh Patriots fans to watch Curtis Martin have so much success. And he kept bringing that up over and over again because he's a dickhead."
  },
  {
    "speaker" : "Steve",
    "text" : "Imagine a YouTube of Dan fucking up. Maybe longer than this podcast episode.",
    "timestamp" : "18:06-18:12"
  },
  {
    "timestamp" : "18:15-18:18",
    "speaker" : "Andy",
    "text" : "I mean we could do a special episode of everything Dan Dudovka's."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "18:18-18:20",
    "text" : "I was gonna say, I think Andy, that's a challenge."
  },
  {
    "speaker" : "Andy",
    "text" : "It's a passion project of Bilas do this. But seriously, like every time they'd make a a call on a play, they would get it wrong initially. It's like, oh, he was out of bounds. And then like as you see the the referee come over saying he caught it in bounds, it's like I I I I thought I was remembering it wrong and I just had this like pent up anger over like somebody who was mediocre, but no. No, he's he's awful.",
    "timestamp" : "18:20-18:43"
  },
  {
    "text" : "Right? Theodore? What?",
    "timestamp" : "18:45-18:47",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "18:47-18:54",
    "speaker" : "Andy",
    "text" : "I I think he retired recently. No, I don't think so. Uh but he we're still going for a while, yeah."
  },
  {
    "timestamp" : "18:54-18:59",
    "text" : "Hey, good for him. You know, he's he's not he's not cynical, he's just kind of a goof.",
    "speaker" : "Greg"
  },
  {
    "text" : "He's just watching a different game than I am.",
    "timestamp" : "18:59-19:01",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I I think it's kind of fun watching him 'cause it's like he's like a doofus uncle, you know? He's just like bumbling around, he's screwing up And it's it's it's as entertaining as like a good commentator, you know?",
    "timestamp" : "19:01-19:15"
  },
  {
    "speaker" : "Andy",
    "text" : "Nah, because he feels so condescending about it. Like he knows more than like the people he's talking to. I think that's that's what I have functioned with.",
    "timestamp" : "19:16-19:25"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "He's sort of like not in on the joke.",
    "timestamp" : "19:26-19:28"
  },
  {
    "speaker" : "Andy",
    "text" : "Maybe maybe I've got the anger issues or something. I find it furious.",
    "timestamp" : "19:28-19:32"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Do you want to talk about those uh issues?",
    "timestamp" : "19:33-19:37"
  },
  {
    "timestamp" : "19:37-19:42",
    "speaker" : "Steve",
    "text" : "Well what was taking. I was thinking Dan Fouts. Who's worse?"
  },
  {
    "text" : "Oh, Fouts is terrible. Yeah, he's bad.",
    "timestamp" : "19:43-19:46",
    "speaker" : "Greg"
  },
  {
    "text" : "Deirdorf is worse. Fouts. I hate Fouts. No. Cause I guarantee as we go through these games, the Patriots will get a lot of Dan Durd Deerdorf and you guys will come around. Because he is I I I even remember him. I I I remember specifically, I think it was a Bills game, but it was a punt and he he I think he was watching a different game. Because he was talking about it being a kickoff and it he had like the wrong teams he was talking about. It was just completely wrong in every single aspect of the commentation. I think I just made a word up there. I'm so angry.",
    "timestamp" : "19:46-20:28",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "20:30-20:34",
    "text" : "Hey, can we circle back and talk about your anger issues for a second?"
  },
  {
    "text" : "Yeah, apparently Greg was uh was about to to drop some knowledge on that. I know he's got some Some insight into my anger issues.",
    "speaker" : "Andy",
    "timestamp" : "20:35-20:43"
  },
  {
    "timestamp" : "20:43-20:53",
    "speaker" : "Greg",
    "text" : "Okay. Yeah, because I worked pools with you for two summers and I've never seen someone get so mad at traffic in my entire life."
  },
  {
    "timestamp" : "20:54-20:57",
    "text" : "And now I commuted to Boston and nothing has changed.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "20:58-21:04",
    "text" : "Oh god. Are you w working on those issues? I mean I guess by talking about it we're we're starting the process."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:05-21:11",
    "text" : "I'm fixing that. But the the thing is, like that's the only thing that gets me angry is traffic. And bad."
  },
  {
    "text" : "But once I'm angry, like well and the refer",
    "timestamp" : "21:11-21:16",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "21:17-21:25",
    "speaker" : "Andy",
    "text" : "Alright, alright, let me rephrase that. The things that get me angry are things that don't work the way they should. Travic is one, Dan Dorf is the other."
  },
  {
    "speaker" : "Greg",
    "text" : "You should uh you should start l Should start what? A list. Call your hit list. Oh boy.",
    "timestamp" : "21:26-21:33"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "21:35-21:38",
    "text" : "Um I'm getting a little uh uncomfortable here."
  },
  {
    "text" : "Can't wait to see this come up in a court hearing.",
    "timestamp" : "21:40-21:42",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:42-21:47",
    "speaker" : "Mike Melo",
    "text" : "I uh don't condone anything that's been said so far, including anything that I've said."
  },
  {
    "timestamp" : "21:47-21:51",
    "text" : "Well I'm cutting all the I'm cutting everything you just said out Mike so don't worry about it.",
    "speaker" : "Andy"
  },
  {
    "text" : "Don't use this and Dan Didor's neutral exhibit A.",
    "timestamp" : "21:51-21:54",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh god.",
    "timestamp" : "21:55-21:56"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "On his uh tombstone or whatever it says uh you know bad commentation. Yeah.",
    "timestamp" : "21:57-22:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Well w what's the what's the verb for? The past participle of commentate? I don't know what I'm looking for. What's the noun version of it? I don't know.",
    "timestamp" : "22:10-22:21"
  },
  {
    "text" : "Again, big fan about how Patriots filled this podcast has been.",
    "timestamp" : "22:21-22:25",
    "speaker" : "Steve"
  },
  {
    "text" : "I know. This is like you're taking me back to like the classroom. I mean, I'm getting a mini panic attack right now. I don't know if you guys know that.",
    "speaker" : "Mike Melo",
    "timestamp" : "22:25-22:32"
  },
  {
    "speaker" : "Andy",
    "text" : "Good. Well that that that puts you in the right mood for watching this football game, I think. So let's uh wait.",
    "timestamp" : "22:32-22:38"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "22:39-22:42",
    "text" : "Let's back up. Let's talk about Mike's panic issues."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "We'll get to those.",
    "timestamp" : "22:46-22:46"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm sure they'll come out naturally, I promise.",
    "timestamp" : "22:46-22:48"
  },
  {
    "text" : "I don't know how well we want to go.",
    "speaker" : "Mike Melo",
    "timestamp" : "22:48-22:50"
  },
  {
    "text" : "All right, so let's talk about um the players in this game. Because the starting lineups were a who's who of forgettable AFC East players, I think.",
    "timestamp" : "22:51-23:02",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "23:03-23:06",
    "speaker" : "Mike Melo",
    "text" : "Well, except for the Jets D, right? Well"
  },
  {
    "text" : "Uh I think except for the the Patriots D more than anything. Even the Jetsy didn't have a ton of names.",
    "timestamp" : "23:06-23:11",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know. I thought that like every time they said something, maybe it's just because I was so familiar with them, but What's happening?",
    "timestamp" : "23:11-23:18",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh Steve is not paying any goddamn attention. Steve needs a mute button, I think.",
    "timestamp" : "23:18-23:24"
  },
  {
    "timestamp" : "23:25-23:28",
    "text" : "Yeah, my roommate came home and didn't want to make a ton of noise.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, well you're doing a great fucking job.",
    "speaker" : "Andy",
    "timestamp" : "23:28-23:30"
  },
  {
    "text" : "Yeah, put the baby on.",
    "speaker" : "Greg",
    "timestamp" : "23:31-23:32"
  },
  {
    "text" : "I'm kind of interested in what they think. Greg Eric.",
    "speaker" : "Mike Melo",
    "timestamp" : "23:34-23:36"
  },
  {
    "text" : "Well, I'll be cutting this part. Give it a listen. Steve's gonna make this so hard to edit, I can feel it already.",
    "timestamp" : "23:40-23:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "23:50-23:53",
    "text" : "Give it a listen, see how it feels, then make your decisions, okay?"
  },
  {
    "text" : "Greg, last week, the the last episode we did. A halfway through he's like, alright, I gotta go, I gotta eat dinner, and he just fucking left halfway through the podcast.",
    "timestamp" : "23:54-24:01",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, halfway through like 90 minutes in. It wasn't. It was it was like 40 minutes.",
    "timestamp" : "24:02-24:07"
  },
  {
    "timestamp" : "24:07-24:12",
    "speaker" : "Mike Melo",
    "text" : "Dude, we have five minutes of good material in that 90 minutes. Don't you understand this? Yeah, exactly."
  },
  {
    "timestamp" : "24:14-24:47",
    "speaker" : "Andy",
    "text" : "Yeah, so Milo, you're talking about the Jets defense? You think you would I I I I had four names I recognize. There's John Abraham. Hey, legend. Who's a monster? He was. They were comparing him to um what's his name? Derek Thomas, which I thought was a little overboard, but okay. Oh no, he was pretty good in his time. He was, but he was no Derek Thomas. Derek Thomas had seven sacks in a game, didn't he? Seven, I think. Could be. Like that's that's he I don't think he quite got too much."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "24:47-24:50",
    "text" : "But I also remembered him as a Falcon. And James Farrier is a stealer."
  },
  {
    "timestamp" : "24:50-25:03",
    "text" : "Yes, that was the other name. Like I don't remember these guys as Jets so much. Um so yeah, John Abraham, James Farrier, Mo Lewis for obvious reasons. And then Victor Green only because he became a patriot the next season.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "25:03-25:08",
    "text" : "In the war. What about like Aaron Glenn and Sean Ellis? Those guys were pretty good."
  },
  {
    "speaker" : "Andy",
    "text" : "I mean their their names I kind of recognize, I guess. Yeah. I mean I think Aaron Glenn wasn't Jack Glenn.",
    "timestamp" : "25:09-25:17"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "If I'm not mistaken. Aaron Glenn? Yeah, sure. No.",
    "timestamp" : "25:20-25:24"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "25:25-25:32",
    "text" : "Sure. The draft pick they got from Belcheck though. I know that. Oh, was he really?"
  },
  {
    "timestamp" : "25:32-25:36",
    "text" : "Yeah, we never really addressed that. Maybe that's for another time, but we should talk about that.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "What's that?",
    "speaker" : "Andy",
    "timestamp" : "25:36-25:37"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "The uh the whole like how Belichick got to be uh Patriots head coach. uh and how he left the jets to begin with and started this whole thing.",
    "timestamp" : "25:38-25:47"
  },
  {
    "text" : "Yeah, I think that's a a fair thing to s to do. I don't know if we'll touch on it today because we're already what, forty five minutes in, but And we haven't actually talked about the game.",
    "speaker" : "Andy",
    "timestamp" : "25:47-25:56"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "25:57-26:01",
    "text" : "Right. But we're technically three minutes in, so Yeah, so that's fine."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh yeah, I I mean yeah, I'd say there was more names on the Jets defense than the Jets offense. Because it was basically Curtis Martin and that was it.",
    "timestamp" : "26:03-26:14"
  },
  {
    "timestamp" : "26:14-26:16",
    "speaker" : "Greg",
    "text" : "Way an Corbett."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:17-26:45",
    "text" : "Yes, Wayne Krebett only because he was the original white slot receiver. The original lunch pail guy, the Vinny Testa. Did that name ring a bell? Yeah. So Vinny Tessavardi for as old as he was in this game, he was 37, almost 38, I think, by the end of the season. He's still what five years younger than Tom Brady is still playing right now? Brady is forty Brady forty two or forty-three?"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "26:46-26:47",
    "text" : "Forty two, I believe."
  },
  {
    "text" : "I think he turns forty-three this year.",
    "speaker" : "Andy",
    "timestamp" : "26:48-26:49"
  },
  {
    "text" : "Yeah, it did stick as like the two most unathletic quarterbacks I've ever seen in one game.",
    "timestamp" : "26:49-26:56",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "26:59-27:04",
    "text" : "Well, with three though, right? I mean if you're including Brady Bledsoe and Sester Verde."
  },
  {
    "speaker" : "Andy",
    "text" : "That's true. I I Yeah, say that again.",
    "timestamp" : "27:04-27:14"
  },
  {
    "text" : "I can say you could even make the analogy that there were two twin towers standing back there.",
    "timestamp" : "27:14-27:19",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "27:19-27:24",
    "text" : "Oh yeah, cut that one. Yeah, we're not we're not doing that, okay? We're not doing that.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "27:26-27:35",
    "speaker" : "Andy",
    "text" : "So so so which one went down first? We're not doing this guys. Oh Jesus Christ."
  },
  {
    "text" : "I'm about ten seconds away from walking off of this thing.",
    "timestamp" : "27:35-27:38",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, no, that's definitely not making the final cut. Jesus. That's brutal.",
    "timestamp" : "27:38-27:45"
  },
  {
    "text" : "Not gonna say well played, but Yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "27:45-27:51"
  },
  {
    "timestamp" : "27:51-28:30",
    "speaker" : "Andy",
    "text" : "Yeah, it does. Um but I did think that both of these um Lineups kind of were very similar to each other. Like you had a uh An older quarterback who was on his last legs. Um a team that was focused, an offense that was focused around the running game on both sides with no name receivers at the time. And then like the both strengths were the the defense on both sides. And those are the names that you recognize. And like all the stats were almost exactly even two all the way across the board. Like these were probably the perfectly matched teams."
  },
  {
    "timestamp" : "28:30-28:58",
    "speaker" : "Greg",
    "text" : "I had a note on that as uh 'cause they were showing um uh Curtis Martin's like numbers from the year before and it was like twelve hundred yards. I was like, Oh that's pretty good. three point eight yards of carry. So I looked up like it's like a rushing attempts players had back then. And if you look from that season there's like ten or twelve guys with three hundred plus attempts and there was only one last year."
  },
  {
    "timestamp" : "28:59-28:59",
    "speaker" : "Mike Melo",
    "text" : "Oh wow."
  },
  {
    "speaker" : "Greg",
    "text" : "Saquon was two hundred and sixty. So like Rushing like workhorse running backs has like completely changed since then.",
    "timestamp" : "28:59-29:10"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And I think the pages may have been kind of the driving force for that where they just have a stable of mediocre guys who they can just cycle through when one gets hurt. Because I think that was the problem is if you had that workhorse and he went down, you kind of fucked.",
    "timestamp" : "29:10-29:24"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "29:25-29:48",
    "text" : "Well, do you think that it stemmed from um I mean, obviously Robert Edwards was supposed to be the next big running back for the Patriots uh a couple years prior and obviously he went down you're sort of like I think they were like running back hell for a while. Yeah, because then they they were trying to like psychotropia. Right, right. Yeah."
  },
  {
    "text" : "And I think the in 2000 they were starting Kevin Falk as their every down back, which did not work very well. Mm-hmm.",
    "speaker" : "Andy",
    "timestamp" : "29:48-29:55"
  },
  {
    "text" : "Like as a community, right? Uh committee. 'Cause you had Falk and he knew he was good but you couldn't use him in that role, so you're like, all right, third down back. Anselm Smith just plow up the myth. So like, all right, let's use them both, you know?",
    "speaker" : "Greg",
    "timestamp" : "29:58-30:13"
  },
  {
    "text" : "Yeah, exactly. And then you had G. R. Redmond in there too for I don't know. Although I mean you say all that and then if you watch this game, the leading rusher was the fullback Mark Edwards.",
    "speaker" : "Andy",
    "timestamp" : "30:13-30:24"
  },
  {
    "text" : "Which I mean uh I thought he had like a hell of a game until his Mishap. Until it's both mishaps that you fumbled it twice. Okay. Okay.",
    "timestamp" : "30:24-30:32",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "30:32-30:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah. But I love the guy.",
    "timestamp" : "30:33-30:36"
  },
  {
    "text" : "Apparently those are his first two fumbles as well, like of his career.",
    "timestamp" : "30:36-30:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "30:40-30:49",
    "speaker" : "Mike Melo",
    "text" : "Was this the at the point where I was gonna say was this at the point where it it clearly wasn't at the point where like, you know, you'd be in the Belichick bag house if you messed up."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:50-30:57",
    "text" : "I don't think they had the doghouse erected yet. They weren't good enough to be able to put people in the doghouse."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "30:57-31:00",
    "text" : "What were you gonna say? They put them out right white uh out wide?"
  },
  {
    "text" : "Yeah, like they They were throwing to him like split him out wide. Like he seemed like he was the offensive weapon, which If your fullback is your offensive go-to weapon, that's probably not a great sign, I don't think, even in 2001. But I mean, should we touch on the whole Curtis Martin stuff since I don't know if we'll get a chance to do it further down the line? Like the whole I because I looked into the whole tr like Curtis Martin trade. And basically it was a bit of a poison pill. And I think this was when all the poison pill stuff was going on. Because I remember there was There was one that was a tipping point. I think it had to do with the Vikings and an offensive lineman or something like that.",
    "timestamp" : "31:00-31:45",
    "speaker" : "Andy"
  },
  {
    "text" : "What is a poison pill?",
    "timestamp" : "31:46-31:48",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "A poison pill is they would put um like if a team is trying to sign somebody I think like the the Vikings, they were trying to sign some cowboys offensive linemen or something like that. And so they put a a poison pill in where like the Because if he was a restricted free agent, for instance, it would put something in like if if you if the the guy gets more than um you know, 50 yards rushing in the state of Texas, you would uh you would have to pay on like a five million dollar bonus sort of thing. So the Cowboys obviously couldn't match that. So then he would be able to you'd be free to sign with a different team. Oh, that's ingenious. Yeah, oh absolutely.",
    "timestamp" : "31:48-32:30"
  },
  {
    "timestamp" : "32:30-32:33",
    "speaker" : "Steve",
    "text" : "Um yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Well they they got rid of it because it started",
    "timestamp" : "32:33-32:35"
  },
  {
    "timestamp" : "32:36-32:44",
    "speaker" : "Steve",
    "text" : "Who was it? Charles Clay going to the bills not too long ago. Like they just structured it so like all the salary was in the first year."
  },
  {
    "text" : "Yeah, so I mean it still kind of happens, but they got rid of a lot of the egregious stuff where you couldn't do that. Um but this was before that, so Yeah, basically the poison pill and the Curtis Martin one was like he was running out of his his original rookie deal. And so the Jets offered him like a uh what looked like a huge contract, um, but they also had a clause that prohibited the the team from using the franchise tag, which means he could be an unrestricted free agent the next year. Um and so the page couldn't re-sign them because they they risked losing them the year after, but um and then they wouldn't get any draft picks or anything like that, like comp picks and that sort of stuff. So Uh the Jets signed him for a big contract, and it was probably gonna be bigger than what the Patriots would have signed him for anyway, because they thought he was kind of on the decline, which he wasn't, but Um there was like a whole bunch of like extra money added in that wasn't actually real money um just to kind of steal him away. Because the Patriots offered Martin six years at twelve million dollars and the Jets ended up paying him a five year twenty-eight million dollar contract. So you gotta you got a bunch more. I mean it's probably the best decision for Curtis Martin, but Suck for Pat's fans.",
    "timestamp" : "32:45-34:12",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:12-34:24",
    "speaker" : "Steve",
    "text" : "All I remember is being I just couldn't help. Go ahead. Steve go. I said all I remember is being Steve Hurt by Curtis Martin betraying me, stabbed me in the back. Yeah, Judas."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "34:25-34:28",
    "text" : "Yeah, that's a that's a middle school opinion right there."
  },
  {
    "text" : "He doesn't love it. I mean, I wrote the note like do you think that they I mean, they won like three out of four Super Bowls. Do you think if Curtis Martin all things equal He's the only difference was uh you know, on those teams that they would have gotten four in a row. Or would they have like emphasized him too much, maybe?",
    "timestamp" : "34:31-34:50",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "text" : "He had some great years in New York.",
    "timestamp" : "34:51-34:53"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "34:53-34:54",
    "text" : "He does."
  },
  {
    "text" : "Like you I have his stats brought up right now and he had looks like seven, eight straight thousand yard seasons for the Jets.",
    "speaker" : "Greg",
    "timestamp" : "34:55-35:05"
  },
  {
    "timestamp" : "35:05-35:22",
    "speaker" : "Andy",
    "text" : "Yeah. And I I don't I think uh I saw a stat where he was only one of like there was only two other guys who had done it for seven years in a row or more, and one of them was Barry Sanders, and I can't remember who the other one was. But you know, big names sort of thing."
  },
  {
    "timestamp" : "35:23-35:25",
    "speaker" : "Mike Melo",
    "text" : "But you're not thinking four in a row with him."
  },
  {
    "timestamp" : "35:25-35:36",
    "text" : "Um, I don't think because I think 2002 they didn't lose it wasn't because they didn't have a running game. I think it was just because they had a Super Bowl hangover more than anything.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:37-35:41",
    "text" : "Some of them with Brett Favre. I remember hating Brett Favre because of the 2002 season."
  },
  {
    "text" : "Bret Favre is a r is the reason we missed the playoffs twice.",
    "timestamp" : "35:41-35:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:45-35:51",
    "text" : "I just uh remember hating him because he would send dick picks to people and I didn't think that was appropriate.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "35:51-35:59",
    "text" : "He didn't like his dick picks, Mike? No, what I saw, I'm not a fan. Or were you just mad you didn't get them?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "36:00-36:03",
    "text" : "Uh who says I didn't? Oh, touche.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Oh uh all right, let's um",
    "speaker" : "Andy",
    "timestamp" : "36:04-36:10"
  },
  {
    "timestamp" : "36:11-36:22",
    "text" : "Well wait, one more comment on Curtis Martin. Yeah. His stats are quick. He played eleven years and he had a thousand yards in ten of those seasons.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Jesus. It's pretty good. That's pretty impressive.",
    "timestamp" : "36:22-36:26"
  },
  {
    "text" : "He had almost seventeen hundred rushing yards a year before he retired.",
    "speaker" : "Greg",
    "timestamp" : "36:26-36:32"
  },
  {
    "text" : "Yeah, yeah, just for running back to play for eleven straight years and still be that productive, I think.",
    "timestamp" : "36:34-36:41",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:41-36:49",
    "speaker" : "Mike Melo",
    "text" : "Yeah, that's a guy right now. He should be in the Hall of Fame, I think. I agree. Is he in the Hall of Fame? Can somebody check that? Oh."
  },
  {
    "speaker" : "Greg",
    "text" : "No, he's not in the Hall of Fame.",
    "timestamp" : "36:52-36:54"
  },
  {
    "timestamp" : "36:54-37:04",
    "text" : "I don't think so. Well that's a freaking travesty. We should spend the rest of the time talking about that bullshit. Uh other question. Has enough time passed? I have no idea.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "text" : "Mike, I checked your Aaron Glenn take too. He's not in the Hall of Fame either. Yeah, I checked that all I don't think we need to double check that one, but alright. All right. All right.",
    "timestamp" : "37:05-37:14"
  },
  {
    "text" : "Jesus. Um yeah, I mean I'm I'm not too worried about spending all this time talking about Curtis Martin in 9-11 because there's not much to talk about in the actual game itself. Um but uh let's just talk about the Jets for a bit. Um they did go 10 and 6 this year.",
    "speaker" : "Andy",
    "timestamp" : "37:17-37:37"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Wait a minute, Chris Martin is in a hall of fame, guys. Jesus. Is he? Yeah, I'm fact checking right here.",
    "timestamp" : "37:37-37:45"
  },
  {
    "timestamp" : "37:46-37:49",
    "speaker" : "Andy",
    "text" : "All right, so you're you're one for two on Hall of Fame calls."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "37:50-37:51",
    "text" : "That's all I'm saying."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, all right. It's back to 500",
    "timestamp" : "37:51-37:53"
  },
  {
    "timestamp" : "37:57-38:01",
    "speaker" : "Greg",
    "text" : "Stan Bierdorf from the the Pro Football Hall of Fame."
  },
  {
    "text" : "I'm not gonna fact check that because yeah, because if he actually is, that's gonna make me angrier than the fact that you're just telling me that he is. I'm just gonna believe you're saying that to make me angry.",
    "timestamp" : "38:02-38:12",
    "speaker" : "Andy"
  },
  {
    "text" : "He received the Pete Rosell Radio Television Award from the Pro Football Hall of Fame.",
    "timestamp" : "38:13-38:19",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "38:19-38:21",
    "text" : "For freaking commentation."
  },
  {
    "timestamp" : "38:25-38:27",
    "speaker" : "Andy",
    "text" : "Uh Mike, you might have getting a heart back to this."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "38:28-38:31",
    "text" : "You would not know talent if it hit you in the face, is all I'm saying."
  },
  {
    "timestamp" : "38:32-38:46",
    "speaker" : "Andy",
    "text" : "Neither would the commentation hall of fame either, apparently. Oh, god damn it, Dan Diadorf. Fucking useless. I am. I'm I'm gonna put together a a super clip of him saying shit wrong. It's my new passion project."
  },
  {
    "text" : "He got a sick mustache though.",
    "timestamp" : "38:46-38:48",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "38:48-38:59",
    "speaker" : "Andy",
    "text" : "He did. I'll give him that. Um so yeah, so the Jets finished third in the AFC East, uh made the playoffs. Three teams in the AFC East made the playoffs. So AFC least? I don't think so."
  },
  {
    "speaker" : "Greg",
    "text" : "With the dolphins or the Bills?",
    "timestamp" : "39:01-39:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh I believe it's the Dolphins, yeah. I don't think the Bills were good at this point. This was their Jim Kelly hangover era. Which continues. Pretty bad hangover too. Oh, no, no, it was the Colts. Wasn't it wasn't it? Oh yeah, yeah. They were in there. Yeah, Patriots, Colts, Jets were the three AFC's teams.",
    "timestamp" : "39:03-39:24"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I mean, can we just say uh Jim Kelly four straight Super Bowls? I mean, I don't know if he was a quarterback for all of them, but that is a pretty bad hangover. And I don't know if they've made a playoff since, so That's terrible.",
    "timestamp" : "39:26-39:36"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:36-39:48",
    "text" : "Uh they made it once. They were nine and seven a couple years ago. That's they made the playoffs. And they lost to uh the Jags. Uh in a game that ended like 6-3."
  },
  {
    "text" : "And the Music Serie Miracle. Oh, you're right. Oh, I remember that.",
    "speaker" : "Steve",
    "timestamp" : "39:48-39:52"
  },
  {
    "timestamp" : "39:52-39:58",
    "text" : "Oh yeah, and the Mer Music Serie Miracle where they lost to the Titans. On that throw back on the kickoff.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh, you're right. Yep. Okay.",
    "timestamp" : "39:59-40:00"
  },
  {
    "text" : "Had an illustrious playoff career, actually. Yeah. Yeah, so the they would end up losing the wild card to the Oakland Raiders, which I think we will end up touching on later. Head coach is one of my favorites, Herm Edwards. This was his yeah, this is his first year as an FL head coach. Um he was with the Jets, yeah, until from here until 2005, and then with the Chiefs, obviously. From 06 to 08. And then I think from there he just went to college. I know I know he's coaching college now. State State? Yeah, okay. And it was great to have him in the league because Uh the Patriots would go nine and two against Hermette Woods coach teams. One two games. Between O and oh yeah, and this was one of them. I guess, yeah.",
    "speaker" : "Andy",
    "timestamp" : "40:01-40:50"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:50-40:53",
    "text" : "That was who Frady went nine and one."
  },
  {
    "text" : "Yeah, yeah, basically. Um and also another the only other coach of note was Bob Sutton, who was the linebackers coach, which with this linebacking crew you think would be a good thing, but then you see the historically bad Chiefs defense of last year and how he was fired for being absolutely god-awful. That's a fun note.",
    "speaker" : "Andy",
    "timestamp" : "40:54-41:16"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "41:16-41:18",
    "text" : "He just brought everything down."
  },
  {
    "speaker" : "Andy",
    "text" : "Well that was the idea. Herm Edwards he'll do that to a guy. To a podcast. Um You should talk Andy. What?",
    "timestamp" : "41:19-41:29"
  },
  {
    "text" : "You should talk to somebody.",
    "timestamp" : "41:30-41:32",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "41:32-41:44",
    "speaker" : "Andy",
    "text" : "What about about my anger towards people? People I've never met. It is it's people I've never met. If I if I meet ya Uh I'm less likely to be angry at you, I think."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I don't know. I think I've made you pretty angry over the years. So that's a false statement. I I feel like it's the other way around actually. Yeah, it has actually been that way for a long time.",
    "timestamp" : "41:44-41:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I mean the the headbutt that I gave you in the face that was by accident if we're putting the cards.",
    "timestamp" : "41:55-42:00"
  },
  {
    "timestamp" : "42:00-42:16",
    "speaker" : "Mike Melo",
    "text" : "Look, you just can't let it go. You know, I could have I mean I don't condone violence, but things could have gone a million different ways. And I'm a peaceful man. And he just won't let the the headbutt thing go. And I don't understand. I mean it's the headbutt of fifteen years ago for crying out loud."
  },
  {
    "text" : "Yeah, that's true.",
    "timestamp" : "42:16-42:17",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know what he's telling you guys, but um I'm just frankly sick of it.",
    "timestamp" : "42:18-42:23",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "42:25-42:26",
    "speaker" : "Andy",
    "text" : "That's not what I've heard."
  },
  {
    "text" : "Some just to mind that I wanted to bring up. Oh just to give a little further to this conversation is I was watching the big Lebowski the other day and he's the bowler. Yeah, Jesus.",
    "timestamp" : "42:27-42:41",
    "speaker" : "Greg"
  },
  {
    "text" : "Look, I may or may not have heard that about 50,000 times. Um, so thanks for being 50,000 at once. And I was also dressed up as that gentleman uh for Halloween Tamir. So if you can find those pictures.",
    "timestamp" : "42:44-42:58",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "42:59-43:00",
    "text" : "Brought it upon yourself.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:00-43:12",
    "speaker" : "Mike Melo",
    "text" : "Okay. It'll be a a treat for you if you can dig that up. That would be a treat. Head uh hair net at all. And I think I'm licking a bowling ball. So Yeah."
  },
  {
    "text" : "And in the purple jumpsuit, right?",
    "timestamp" : "43:12-43:13",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, purple jumpsuit, the whole shebang.",
    "timestamp" : "43:14-43:16",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "43:16-43:16"
  },
  {
    "text" : "We won't talk about what his character is because I didn't really think about it until after I wore the costume that I probably don't want to be associated with that guy as a character. But It did look.",
    "speaker" : "Mike Melo",
    "timestamp" : "43:18-43:27"
  },
  {
    "timestamp" : "43:28-43:30",
    "text" : "I don't remember the character in the movie.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "43:31-43:36",
    "text" : "I think the character in the movie allegedly may or may not have spent time with children. I don't know."
  },
  {
    "timestamp" : "43:37-43:37",
    "speaker" : "Andy",
    "text" : "Oh."
  },
  {
    "timestamp" : "43:39-43:41",
    "speaker" : "Mike Melo",
    "text" : "I may have not been aware of that fact."
  },
  {
    "timestamp" : "43:41-43:44",
    "speaker" : "Andy",
    "text" : "Yeah, I wasn't sure that's where that was headed, but alright, okay."
  },
  {
    "text" : "Moving on. We all make mistakes, guys.",
    "speaker" : "Mike Melo",
    "timestamp" : "43:47-43:50"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:50-43:53",
    "text" : "Speaking of pedophile, how about the first half of this football game?"
  },
  {
    "timestamp" : "43:53-43:58",
    "speaker" : "Mike Melo",
    "text" : "Oh boy. Yeah, I'm I'm gonna leave now guys. Thank you. Thank you so much, guys."
  },
  {
    "text" : "What are you, Steve? Uh do we think he's really gone? No. I don't think it's really good. Yeah, so let's talk about a f this football game. You know, now that we're we're like 45 minutes into this, 55 minutes into this. It's gonna be a lot of editing.",
    "speaker" : "Andy",
    "timestamp" : "43:58-44:19"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I decided to come back, guys. Alright. Okay.",
    "timestamp" : "44:20-44:22"
  },
  {
    "text" : "Thanks.",
    "timestamp" : "44:22-44:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "44:22-44:29",
    "text" : "I'll give you one more chance. I'll give you one more chance. I couldn't stay quiet for that long. So We'll give this another go."
  },
  {
    "timestamp" : "44:30-44:38",
    "speaker" : "Andy",
    "text" : "Alright, let's do this. Alright, Mike, lead lead us off for the first half. Tell me tell me your thoughts on the first half of this game."
  },
  {
    "text" : "The first half, I would say top 250 games I've ever seen played out. Uh I'll tell you why. Um one, uh that that Jets D was just tough as nails Uh I remember, like we said, those those started star studied team there. Um the punter, Lee Johnson, again. I said it last time, I'll say it again. Star Punter. Uh what else can you say? The guy's number one in everything.",
    "speaker" : "Mike Melo",
    "timestamp" : "44:38-45:04"
  },
  {
    "text" : "He's punted for forty-two miles or something like that total.",
    "timestamp" : "45:05-45:08",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "45:08-45:12",
    "text" : "Exactly. It doesn't matter that he played for 72 years. He's amazing."
  },
  {
    "speaker" : "Andy",
    "text" : "From bottom-of-the-barrel teams, his entire career.",
    "timestamp" : "45:13-45:16"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah. The run game I felt was far better just uh optics-wise. Um, I don't know how you guys felt about that, but I thought, I mean, they used four guys like you touched on, but they were pretty pretty solid, I think.",
    "timestamp" : "45:17-45:30"
  },
  {
    "text" : "Mm-hmm.",
    "timestamp" : "45:31-45:31",
    "speaker" : "Steve"
  },
  {
    "text" : "I don't know if you guys thought it was a uh it was an an obvious upgrade, or if you even knew, I mean, uh that that Antoine Smith would sort of be the the guy.",
    "timestamp" : "45:33-45:44",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it didn't feel like it from this game. It felt like they were sharing the load like we taught touched on earlier, it was a lot of Mark Edwards. Get getting actual physical handoffs. Uh my guess is going back to like I think it was Greg talking about the doghouse. Um I I don't think we I don't remember seeing as much Mark Edwards. Um but then again I may just not be remembering correctly. But I I feel like When thinking about the 01 season, you think about Antoine Smith being the war horse. And that wasn't happening this game. It was it was much more spread out. There's a whole lot of JR Redmond and Mark Edwards and Kevin Falk getting carries in this game.",
    "timestamp" : "45:45-46:30"
  },
  {
    "timestamp" : "46:30-46:58",
    "text" : "Yeah, I mean it was all pretty even. Um but what stood out to me in the first half was the uh unbelievable play of Drew Blezzo. Um Okay. I feel like essentially every good play that he made was followed by a horrible one right after. Yes. Yeah. Yeah, and it happened time and time again. It was actually amazing.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "46:58-47:07",
    "text" : "It was Yeah, and that one intentional grounding where he was about to get shacked and he just like flipped it sidearm into the top."
  },
  {
    "timestamp" : "47:10-47:20",
    "text" : "Oh or or they got down to uh the goal line. And it's uh fourth and goal and they're going for it, and then Blood Zoe gets uh delay a game.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "47:21-47:38",
    "text" : "Yeah, the red zone and Yeah, then the crazy thing was that it was fourth down and you know some Bill Belichick mind games uh they do a long snap or long count and then They somebody goes off sides, they get the first down and then he pulls that right after."
  },
  {
    "timestamp" : "47:38-47:55",
    "text" : "Oh yeah, on the on the field goal attempt, right? Yep. Because it was a chip shot field goal, fourth and three or whatever it was, and they do a hard count on the field goal to get the defense to jump off. And that gets them the first down and then they drive down to the goal line and then they kick a field goal anyway.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:56-48:02",
    "text" : "That was giving me a public. I'm surprised more people don't do that. A hard count on a Yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "I don't remember seeing that too much. Yeah, no that was very Belichican. I loved it.",
    "timestamp" : "48:02-48:07",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "48:08-48:23",
    "text" : "But every coach in the world does the it's fourth down and we come out and we hard count and let the clock run out. I hate that. It never works. It's never worked ever. But every coach is like, Oh, I'm gonna get 'em on this one."
  },
  {
    "speaker" : "Andy",
    "text" : "It's true.",
    "timestamp" : "48:23-48:24"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "48:24-48:30",
    "text" : "So all right, excited we're gonna go for a fourth and then they just don't and you're like, that sucks"
  },
  {
    "speaker" : "Andy",
    "text" : "So, okay, I I agree with you 100%. But recently the pages have started doing this thing where on fourth down they'll leave the offense zone, they'll kind of linger. Then all of a sudden the offense will sprint off the field and the punt team will sprint on. And then the I don't know why. But you know it's like one of these mind games and they're doing it for some specific reason. I just don't know what it is.",
    "timestamp" : "48:30-48:53"
  },
  {
    "text" : "Yeah, it's a fuck with the fans, 'cause like, oh, we're gonna go for it. Uh no we're not.",
    "timestamp" : "48:54-48:58",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "He's probably not fond of the fans or the media or his team or Maybe even myself. Exactly. Just people in general.",
    "timestamp" : "48:58-49:09"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:09-49:12",
    "text" : "Yeah. Demarius Thomas."
  },
  {
    "text" : "Oh yeah. That's kind of a interesting thing. It's also interesting that players are starting to speak out a little bit more and a little bit more Bellitech stuff. I don't know if that's social media driven or whatnot, but interesting.",
    "timestamp" : "49:12-49:22",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, I mean I think it's it the only guys that ever seem to speak out about that stuff are guys who don't spend much time here. Um who was the the Colts wide receiver that We picked up and then he retired because it was too hard. Reggie Wayne.",
    "timestamp" : "49:22-49:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh Wayne Corvette. Yeah. Yeah, Reggie Wayne.",
    "timestamp" : "49:35-49:38"
  },
  {
    "text" : "Mr. I guess I mean your eyes. Yes.",
    "speaker" : "Steve",
    "timestamp" : "49:40-49:45"
  },
  {
    "timestamp" : "49:45-50:11",
    "speaker" : "Mike Melo",
    "text" : "Man. Yeah. Reggie Wayne. So Wayne Crebette. Back to the game. Yeah. Um, no, but my my final note of the half is that uh Drew Bulletto had 17 yards passing. Oh my god. It wasn't it wasn't great. No. Um and but also I think that they also mentioned, remember how we were talking about Terry Glenn was suspended for the year by Bill Belichick?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "50:12-50:12"
  },
  {
    "timestamp" : "50:13-50:16",
    "speaker" : "Mike Melo",
    "text" : "Did that end up being like a four-week suspension after the fact?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:16-50:29",
    "text" : "So yeah, I think the league game of four-week suspension and then he came back. He must have come back because Tom Brady's first ever Touchdown pass was to Terry Glenn, wasn't it?"
  },
  {
    "text" : "I think so.",
    "timestamp" : "50:29-50:30",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "And then so he must come back. And then I think other shit happened and then Belichick just got sick of him and suspended him. But we should definitely look that up for the next podcast. Because yeah, I I had first thought that he was suspended for the year, but I don't think that ended up happening. Hm.",
    "timestamp" : "50:31-50:48"
  },
  {
    "timestamp" : "50:48-51:01",
    "speaker" : "Greg",
    "text" : "Yeah, I think I I think I saw them say that it was like he got suspended by the league and then he just didn't show up to like training camp and practice, so the Patriots were like, well just suspended for the year. But he must have changed at some point."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Uh so the only other thing that I had for the first half was the um emergence of the Tuck rule. Because on uh the only one long drive that the Jets had, they were driving, they were in the red zone. And um Tessa Verde got hit as his arm was like pulling the ball back down again. Pages recovered the fumble, but then they overturned it and the Jets ended up getting a tying field goal at the end of the yeah, and this game ended 3-3.",
    "timestamp" : "51:02-51:32"
  },
  {
    "timestamp" : "51:33-51:41",
    "speaker" : "Mike Melo",
    "text" : "It's funny that they don't like bring that up when the tuck rule was discussed. You know, they kind of make it seem like that was the first time anyone had even thought of that. Right."
  },
  {
    "timestamp" : "51:41-51:48",
    "speaker" : "Andy",
    "text" : "Um, exactly. Foreshadowing, shall we say?"
  },
  {
    "text" : "Right. That that's me crazy. I was actually having that conversation with some of my work today about like the Lions, the missed calls in the Lions game. Yeah. And it was like like they missed calls all the time, sometimes you get 'em, sometimes you don't and the kid was like, Oh well you don't understand 'cause you're a Patriots fan and you get every call It's like, No. You're just bitter so you like the calls that went for the Patriots stick out in your mind. Like Yeah. There's three calls that have gone against that. So stop thinking about it.",
    "speaker" : "Greg",
    "timestamp" : "51:49-52:20"
  },
  {
    "timestamp" : "52:20-53:09",
    "speaker" : "Andy",
    "text" : "Where's the fun in that? I agree with you man. I love being angry about things, remember? I'll bitch about all of this. I still say Eli Manning should have been called in the grasp in the on the helmet catch. Yeah. It is toxic. I love it. Yeah, so uh going back to m the 17 yards passing Uh the the total yards in the first half. The Jets had 136 and the Pages had 90. Yep. It was tough to watch. It was rough. The second half wasn't much better. Sure. Alright. Oh, everybody. Great."
  },
  {
    "text" : "Alright, I can jump in here, man.",
    "timestamp" : "53:10-53:11",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "I got some all these notes, man.",
    "timestamp" : "53:11-53:13"
  },
  {
    "text" : "I got like Seven highlighted things. Uh we'll go with pink first. Um yeah, give me pink. No, I I mean uh Um basically was just more bleto uh uh genius play. I mean I have it here. Beautiful bomb to Troy Brown for uh for in the fourth, right, for a touchdown. Um or yeah, 58 yarder. And then he uh he throws a pick in the end zone, returns midfield. So I guess it wasn't a touchdown. Uh so yeah, fifty-eight yard pass, they make it down the field, throws a pick right after",
    "timestamp" : "53:13-53:48",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Did you see the replay when they were showing the pick? Um and all the I think there was two or three receivers to the right side of the field and the right corner of the end zone in the left corner there was one receiver and I believe it was either five or six defenders around him and Bloodso's like yeah no that's my choice throw it to the left Brutal.",
    "timestamp" : "53:48-54:10",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:11-54:21",
    "speaker" : "Mike Melo",
    "text" : "Yeah, but isn't it isn't it kind of funny? Like Soldier Butzo. I I get a sick kick out of it looking back. I think it's"
  },
  {
    "speaker" : "Andy",
    "text" : "So but I think this but this was my point. Go ahead, Jay.",
    "timestamp" : "54:22-54:27"
  },
  {
    "timestamp" : "54:29-54:34",
    "text" : "Comes back so quickly of like, yeah, blood so's awesome, but he also sucks.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "54:35-54:48",
    "speaker" : "Andy",
    "text" : "Where did he go? Yeah, it was that very it was that very familiar feeling of futility at the end of games. Like, well, we were kind of in it, but you know, this is what happens. We're the Patriots."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I mean, but if you look at it this way, he kept it interesting every week. Like with Brady. You know, you kind of don't know what to expect.",
    "timestamp" : "54:49-54:56"
  },
  {
    "timestamp" : "54:57-55:27",
    "speaker" : "Andy",
    "text" : "Well, we do now, but I think back in 01, I think the difference for this team and the reason they turned around was it was still the same. I th I think Brady wasn't any better than Drew Bledsoe, but they were still keeping it close at the end of the games, and Brady would make that one last play at the end of the game to get the W instead of losing the game. Yeah. And that's how they kind of ran the whole team like all the way through 04 or until like even oh seven when Brady got his weapons."
  },
  {
    "timestamp" : "55:27-55:40",
    "speaker" : "Greg",
    "text" : "Yeah. I think Red So's a more talented quarterback, like stronger arm. They both can't move. So like it was all about like decision making and like situational football that Brady was way better at."
  },
  {
    "speaker" : "Andy",
    "text" : "Mm-hmm. Right. And that was how Belichick ran the team, which I think is probably why Brady moved up the depth chart so quickly. Is because he could he understood the the situational aspect of it better than the other guys. Yep. So maybe, maybe when people say Tom Brady is a system quarterback, that's the system they're talking about.",
    "timestamp" : "55:40-55:57"
  },
  {
    "text" : "They're right. They're right. He is. Yeah. What, an intelligent guy who makes good decisions and wins games?",
    "speaker" : "Mike Melo",
    "timestamp" : "55:57-56:05"
  },
  {
    "timestamp" : "56:06-56:20",
    "speaker" : "Andy",
    "text" : "A a guy who his his focus on the situational aspect of things is better than others. That system, I guess? I don't know. I mean that's we'll workshop that. We'll workshop that. We'll get there."
  },
  {
    "text" : "How can we spend on this?",
    "speaker" : "Greg",
    "timestamp" : "56:21-56:23"
  },
  {
    "text" : "He's elite, but he's not Joe Flacco elite.",
    "timestamp" : "56:23-56:26",
    "speaker" : "Steve"
  },
  {
    "text" : "And that that one playoff run. Yeah, we're we're not gonna talk about that playoff run.",
    "timestamp" : "56:27-56:31",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:31-56:38",
    "text" : "I mean Flacco's playoff run was worth what, a hundred and thirty million dollars or whatever the hell it was. Yeah it was a lot of money.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah. That basic ruined the the ravens, which is great.",
    "timestamp" : "56:38-56:42",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, for years. Yeah.",
    "timestamp" : "56:42-56:44",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "It's still recovering. Alright, so I mean that's kind of the only thing that happened in that half, right? Was there anything else? No, not really.",
    "timestamp" : "56:44-56:51"
  },
  {
    "timestamp" : "56:52-56:53",
    "speaker" : "Greg",
    "text" : "I mean I ran out of"
  },
  {
    "text" : "What was that? Game over. Turn the lights off. Go to bed. Nothing interesting else happened at the end there.",
    "timestamp" : "56:54-56:59",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "57:00-57:03",
    "speaker" : "Mike Melo",
    "text" : "Yeah, but a highlighter dried up pretty quick."
  },
  {
    "timestamp" : "57:03-57:51",
    "speaker" : "Andy",
    "text" : "Drew Bledsoe got pulled um because of performance, right? That's what they say. I I I have the I have the quote here from uh none other than our favorite Dan Deerdorf We're being told Bledzo's replacement was not because of injury. And there was anything. Well, there was a full article in the Boston Globe the next day. Basically bitching about like Dan Diodorf bitching about no not Dan. It was uh whoever the sideline reporter was. I don't remember her name. Uh but basically she went up and asked the PR people and they're like, yep, nope, it's not an injury-related thing. And everybody's like, yeah, it is. Like apparently even Gil and Gino on the uh the radio broadcast are like They're saying it's it's not an injury thing."
  },
  {
    "timestamp" : "57:52-58:09",
    "speaker" : "Mike Melo",
    "text" : "Well, and I mean uh we're obviously talking about Mo Lewis's hit on Bletto and sort of him. kind of finishing out that drive and then being pulled. But he was standing on the sideline. What I think is insane is didn't he have a a punctured lung and like internal bleeding and the guy is just standing on the sidelines like nothing happened."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I think uh they they uh they interviewed Brady after the game and Brady actually said something along the lines of I was right there when you got hit. And uh if I ever get hit that hard, I'm gonna be in the hospital for a month. Like Drew Bledsoe can take a shot.",
    "timestamp" : "58:10-58:28"
  },
  {
    "timestamp" : "58:28-58:41",
    "text" : "Oh, hell yeah, he can. I mean he's tough. Um But I I also couldn't see in the broadcast uh that I was able to watch, but I mean wasn't his whole face mask like bent when he took that shot?",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "58:41-58:48",
    "text" : "That's what they said, yeah, but uh you couldn't see it I mean, uh the you didn't really see him much with the helmet back on.",
    "speaker" : "Andy"
  },
  {
    "text" : "Right.",
    "speaker" : "Mike Melo",
    "timestamp" : "58:48-58:49"
  },
  {
    "speaker" : "Andy",
    "text" : "But yeah, I didn't know. Maybe it's one of those like legend things. Yeah, yeah. Or maybe it was bent, but it was just like not enough that you can actually see it, sort of thing. Right. Technically bent.",
    "timestamp" : "58:49-59:00"
  },
  {
    "text" : "I mean I I just looking back, I don't know if it was uh i I definitely remembered seeing the bent face mask and just like how gratuitous it was. So That didn't happen.",
    "timestamp" : "59:00-59:13",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, no, I don't think so. Uh it was it was good to confirm that.",
    "timestamp" : "59:13-59:17",
    "speaker" : "Andy"
  },
  {
    "text" : "Conspiracy.",
    "speaker" : "Mike Melo",
    "timestamp" : "59:17-59:18"
  },
  {
    "timestamp" : "59:19-59:45",
    "speaker" : "Andy",
    "text" : "Well if you if we want to go conspiracy, I got one for ya. Oh God. They're all saying that, you know, uh nobody really knew how hard Bloodsoe was and that they put it back in the game and then they they finally pulled him. I think they knew how hard he was, but they put him back in the game anyway. But they just made him hand the ball off. All he did, he he did two handoffs and a shovel pass, and then they turned the ball over and he never saw the field again. I think they knew how hard he was"
  },
  {
    "text" : "So what what would be the uh the purpose of that as a decoy?",
    "timestamp" : "59:46-59:50",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "No, so you can get hurt more and Tom Brady can come in. Exactly. Oh, there you go.",
    "speaker" : "Steve",
    "timestamp" : "59:51-59:56"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:56-59:57",
    "text" : "See? We got there"
  },
  {
    "text" : "Well it was a one score game, so they were probably hoping they could pull the game out.",
    "timestamp" : "59:58-01:00:02",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:02-01:00:37",
    "text" : "Yeah, uh that that would probably be my guess, but which Tom Brady almost they didn't seem like they were gonna trust Bloodsoe to throw the ball down. But to C's point, I think he's right. You put Brady in there and you expect him to look like the absolute goober that he looks like on his his uh player profile picture there. And like he just looked like normal Brady's out there just calm and collected, picking up chunks of yards, actually moving the ball for the first time through the air in the entire game. He had more than 17 passing yards, I think, in that drive, right?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah Oh did he? Yeah.",
    "timestamp" : "01:00:37-01:00:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:39-01:00:43",
    "text" : "Well I think one of his passes was for like 20-something yards, so he must have."
  },
  {
    "text" : "Well and it was interesting cause obviously, I mean, he didn't have command of that the the the first team, you know, so Yeah. Uh certain things were sloppy. He was a little bit slower than that maybe we're used to, but even in that sort of uh two-minute drive, it it still looked better than Bletto's had in the last like five years.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:00:44-01:01:02"
  },
  {
    "text" : "It did. It looked more under control. But you're right, it was a lot slower than you expect from a Tom Bray Lit offense, because it's such a well-oiled machine these days that they can run a two-minute offense in no time. But you're right. It was yeah. I've uh let me see. He was five of seven on the drive before he just started chucking in the end zone because they didn't have any. So I mean he was he'd walk right down the field.",
    "timestamp" : "01:01:02-01:01:28",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01:29-01:01:32",
    "speaker" : "Steve",
    "text" : "Quarterback injuries. Pat Mahomes just went to the locker room."
  },
  {
    "text" : "Yeah. Oh shit. Wait, is he playing right now? Oh, that's wild.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:01:33-01:01:37"
  },
  {
    "timestamp" : "01:01:37-01:02:03",
    "text" : "It's Thursday night. That's right. I forgot. Whoa. So I don't I'm pretty sure I've told one of you this, but my worry for Patrick Mahomes, because I love watching that do play. was that he's gonna be the next RG3 where he lights the league on fire for a year and nobody can stop him. But as soon as he star he gets that first injury, he just won't be the same guy. I'm a big fan too. He's awesome.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:02:03-01:02:03"
  },
  {
    "speaker" : "Andy",
    "text" : "I love watching him.",
    "timestamp" : "01:02:04-01:02:05"
  },
  {
    "text" : "It's so fun to watch that guy play.",
    "timestamp" : "01:02:05-01:02:07",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:02:07-01:02:10",
    "text" : "Uh he's a he's amazing. Did you know it used to be a shortstop?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "No.",
    "timestamp" : "01:02:11-01:02:11"
  },
  {
    "text" : "Mm-hmm. He used to play baseball. Yes, I was a baseball player. Professional.",
    "timestamp" : "01:02:12-01:02:17",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:17-01:02:41",
    "speaker" : "Mike Melo",
    "text" : "Yeah. I mean hopefully he heals up. Uh I mean I mean, you know, maybe when like i if things uh go as as they seem to go and uh you know, Brady retires and whatever. I mean this dude's gonna be lighting up all kinds of teams and, you know, it's not gonna be fun for the Patriots, perhaps, but it would be fun to see overall. But yeah, hopefully he doesn't hurt himself."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:02:41-01:02:58",
    "text" : "Stidum is better. I think it's gonna be him and Watson. Him and Josh Watson. Not Jared Stidum. Jared Stidum's already thrown a pick six. I wonder how long it took for Bray to throw his first pick six. Good question. Stidum's just ahead of the game."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Can we check the stats on that?",
    "timestamp" : "01:02:59-01:03:00"
  },
  {
    "text" : "I bet we could.",
    "timestamp" : "01:03:01-01:03:03",
    "speaker" : "Andy"
  },
  {
    "text" : "I mean, can we get a stat guy? Oh.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:03:05-01:03:07"
  },
  {
    "text" : "We gotta stack him.",
    "timestamp" : "01:03:08-01:03:09",
    "speaker" : "Greg"
  },
  {
    "text" : "I am a statement. It's called bullshit on the stupid stuff you guys say. I don't know.",
    "speaker" : "Steve",
    "timestamp" : "01:03:10-01:03:16"
  },
  {
    "text" : "All right, here we go. Here we go. I actually I have a list of Tom Brady's pick sixes. Uh his first one Was 2001 uh October 28th against the Broncos in the fourth quarter. Does that make sense? Yep, that's the first one. Uh incomplete for Troy Brown's intercepted by Denard Walker At the 39 and return for 39 yards for a touchdown.",
    "speaker" : "Andy",
    "timestamp" : "01:03:19-01:03:49"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "What year?",
    "timestamp" : "01:03:50-01:03:51"
  },
  {
    "text" : "Uh 2001. It'll be this year, but it'll be in November. Against the Broncos. Let's see what week that is. I don't know what week that is.",
    "speaker" : "Andy",
    "timestamp" : "01:03:51-01:03:57"
  },
  {
    "timestamp" : "01:03:58-01:04:18",
    "text" : "I guess he wanted the stat guy. That was pretty impressive actually. Where are you getting these numbers? Uh I don't know why I have this one saved, but I do. Aga If if this is like conspiracy themed based episode then I'm starting to wonder why you have all these numbers and if I can trust them. But we can discuss amongst ourselves.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "This is a pro football reference. I was I actually had it up for some other thing. Uh something about guys didn't Jameis Winston throw like two or three pick sixes in one single game recently this year? I think it was him. Maybe it was him or Fitzpatrick or somebody. So I I was looking up uh how long ago it was since Brady's throne too. And it was His second to last one was uh December of 2017 against the Bills of all teams. And then one most recent one was obviously the Falcons in the Super Bowl. That same you. So Cliff. All right. Anyone else want to talk about anything Brady did that jumped out to him?",
    "speaker" : "Andy",
    "timestamp" : "01:04:19-01:05:11"
  },
  {
    "timestamp" : "01:05:12-01:05:15",
    "text" : "I mean I think he looked uh faster than I remember.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Apparently he's faster now, but yeah.",
    "timestamp" : "01:05:16-01:05:18",
    "speaker" : "Andy"
  },
  {
    "text" : "Well I mean I think he's more agile now, but I I mean I think he was like hauling ass on that one run.",
    "timestamp" : "01:05:18-01:05:23",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, well which was like three plays. It looked exactly the same as the one that Bloodsaw got hurt on, and it was like three plays later. But Brady dived out of bounds instead of slowing. I I feel like Bledsoe slowed down and like pulled up instead of stepping out of bounds.",
    "timestamp" : "01:05:23-01:05:37"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:05:37-01:05:37"
  },
  {
    "timestamp" : "01:05:37-01:05:38",
    "speaker" : "Andy",
    "text" : "And just got walloped."
  },
  {
    "timestamp" : "01:05:39-01:05:41",
    "speaker" : "Mike Melo",
    "text" : "You think it was like bracing for the hit, maybe."
  },
  {
    "text" : "I guess. I I I'm wondering if he got caught from behind, and I think that kind of threw him off balance so he couldn't brace himself well enough, but still. Like I don't know why he was slowing down.",
    "speaker" : "Andy",
    "timestamp" : "01:05:41-01:05:51"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "So you're saying that I I mean I'm not putting words in your mouth, but you're saying that the reason that that happened, he got hurt and he punctured his lung was Bletto's fault.",
    "timestamp" : "01:05:52-01:06:01"
  },
  {
    "timestamp" : "01:06:02-01:06:03",
    "speaker" : "Andy",
    "text" : "Yeah, oh a hundred percent."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:06:04-01:06:20",
    "text" : "That's that's fantastic. Turn up field and take a moment. If we ever interview him, I want to agree to tell him that. No, he he he'll agree with me."
  },
  {
    "text" : "I can feel it. I personally think it was the Illuminati",
    "speaker" : "Steve",
    "timestamp" : "01:06:21-01:06:24"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "We're going that deep, huh? I mean I knew I knew the Patriots were haven't you looked at the one dollar bill",
    "timestamp" : "01:06:26-01:06:33"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:33-01:06:36",
    "text" : "Come on. This is the chemtrails. He saw him in the sky."
  },
  {
    "timestamp" : "01:06:37-01:06:44",
    "text" : "Hey, you're right. I did watch that YouTube video that one time. It makes it all clear.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, let's see, what else? Only other thing I have for leftovers.",
    "timestamp" : "01:06:44-01:06:49"
  },
  {
    "text" : "Live update. Joe Flacco fumbled the ball for a touchdown for the Chiefs. Good. Now he's ruining the good.",
    "speaker" : "Greg",
    "timestamp" : "01:06:50-01:07:07"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:07:09-01:07:12",
    "text" : "We gotta get uh we gotta get regularly clear connection here."
  },
  {
    "timestamp" : "01:07:13-01:07:36",
    "text" : "I know, no kidding. I'll mail him a microphone at this point. It's brutal. Alright, so the only thing I had left were leftovers, um, just from the broadcast in general, them showing CMGI field in the background, and the fact that it was gonna be called CMGI Field. Did you remember that? Yeah. That's a deep cut.",
    "speaker" : "Andy"
  },
  {
    "text" : "That was uh would you care to elaborate?",
    "speaker" : "Mike Melo",
    "timestamp" : "01:07:36-01:07:38"
  },
  {
    "speaker" : "Andy",
    "text" : "I actually looked up who CMGI was. Yeah, I don't even know who it was. So apparently they were uh a like a web company that owned a bunch of They're actually out of Andover, Massachusetts. But the article that I found was called Could CMGI Have Been The Google of Boston? So they were like a big ass tech company that would buy smaller tech companies and they owned Uh here we go. Uh included companies like Alta Vista, Lycos Geo Cities, Raging Bull, which I vaguely remember, Snapfish. Yesmail and others. So I think Alta Vista was their their big search engine that was supposed to be like Hell yeah. Yeah, exactly. Alta Vista and Ask Jeeves and all of those Yahoo. And obviously we know what happened. But they got hit big by the uh the dot-com bubble. So they could no longer afford to. Rent the stadium name.",
    "timestamp" : "01:07:39-01:08:37"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:08:38-01:09:09",
    "text" : "I looked up uh the the worst stadium names 'cause that's a bad name. It's in India, the cricket stadium. So this is a guy's name, so it's like Ralph Wilson or Lambeau. His name is Doc Dr. Y. S. Raja Secara Reddy ACA B D C A cricket stadium I love that you you found that out. I love that."
  },
  {
    "speaker" : "Steve",
    "text" : "What did you Google to get there? We need a stats guy, huh?",
    "timestamp" : "01:09:11-01:09:14"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right, I know. What what was I thinking?",
    "timestamp" : "01:09:15-01:09:17"
  },
  {
    "text" : "Right. Now you gotta get the full name in, but it doesn't have the same effect otherwise. Oh, it's fantastic. What were you gonna say, Mike?",
    "timestamp" : "01:09:25-01:09:40",
    "speaker" : "Andy"
  },
  {
    "text" : "Um I didn't know if you were going to talk about the other leftover but I was gonna bring up are we gonna do the uh the best and worst thing again? Because I do have one that um it's actually a pretty good uh Bletto play.",
    "timestamp" : "01:09:41-01:09:52",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:09:52-01:09:55",
    "speaker" : "Andy",
    "text" : "Yeah, let's do it. Give me your give me your best and worse, Mike."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Alright, uh for best, um so Damian Woody fumbles the the shotgun snap and Boletto dives off the ball like a maniac as like two like jets are jumping on him. They made me think of like You know, Cam Newton in the Super Bowl he's like deciding if he should jump on the ball and he doesn't, like they they could have won the game. And this is like you know, against the the Jets week two and the the guy's like putting his life on the line. So that was pretty awesome.",
    "timestamp" : "01:09:55-01:10:22"
  },
  {
    "speaker" : "Andy",
    "text" : "That was great. That was that's classic true blood so uh blood so what did what did you do the play after? Because I bet it was uh what what did I call him? Uh butt clenched blood so Because nothing makes your butt clench tighter than Drew Bledsoe on third and long.",
    "timestamp" : "01:10:22-01:10:39"
  },
  {
    "text" : "That is great.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:10:42-01:10:44"
  },
  {
    "text" : "It's because I I like I was I I knew the outcome of the game. I've watched this game before and it's from 2001 and every time you draw back on third and twelve, I could it was like an instinct of just like tighten up like oh oh Oh, oh yeah, yeah, no, that was a bad decision. Every time. So what's your best memo? I like that. But clench blood. So that was that was his best. What was your worst?",
    "timestamp" : "01:10:44-01:11:06",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Um Every time somebody on the Patriots touch the ball outside of Tom Brady. That's pretty much the worst. Um, there's too much, man. There's like Mark Edwards, there's all that stuff. I mean, I can't go into it",
    "timestamp" : "01:11:08-01:11:21"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:21-01:12:10",
    "text" : "So all right, well I'm going to uh counterpoint that because my best was every time Troy Brown touched the ball. Because I remember Like obviously I I like have the soft spot for Troy Brown and I'm always like yeah Troy Brown's my favorite patrons but I never like You kind of forget why until you go back and actually watch the game. And that dude is electric. And he was kind of the only weapon. It felt like he's he was the only weapon on the Patriots for years, but they never even really utilized him for whatever reason. Felt like he's returning punts and he's like not calling fair catches even though the three guys around him is still somehow managed to get 10 15 yards on punt returns. Every time he catches the ball he goes for twenty yards. He's always wide open."
  },
  {
    "text" : "And I wrote down like that that that uh return that he had that was like for twenty-three yards, but it was like It looked amazing. Yeah. Oh yeah. He was in the second quarter. But yeah, every time he touches the ball. You're right.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:12:10-01:12:25"
  },
  {
    "text" : "He probably should have called a fair catch for it, but he's like, you know what? No, I got this. And he he sidesteps that first guy every time. It's like Edelman when he used to return him.",
    "speaker" : "Andy",
    "timestamp" : "01:12:25-01:12:35"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I'm gonna I'm gonna change my statement and say the worst is every time Bletto was involved in anything. Yeah, all right. It's quite a reversal.",
    "timestamp" : "01:12:36-01:12:48"
  },
  {
    "timestamp" : "01:12:49-01:13:17",
    "text" : "Uh kind of. It's big market. My my worst was um watching Gerard Cherry try to be the poor man's Matthews. That one play where he lit the returner up before the returner even caught the ball. That's kind of rule number one of like being a gunner on the punt team is like not hitting the guy until he catches the fucking thing. And then he gets up like, whoa, what did I do? It's like, man. You know Matthew's player.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, he took a risk.",
    "timestamp" : "01:13:17-01:13:19"
  },
  {
    "speaker" : "Andy",
    "text" : "He sure did.",
    "timestamp" : "01:13:19-01:13:20"
  },
  {
    "timestamp" : "01:13:21-01:13:25",
    "speaker" : "Greg",
    "text" : "Sometimes you got y you gotta go for it sometimes, you know?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:24-01:13:44",
    "text" : "There was a quote in the paper the day after about him being like, Well, I think I kind of got pushed. I'm like, nah, I I watched to see if you did. You didn't get pushed at all, bud. You just hammered through three guys to get to the the kick returner. Not a mission. So that was my worst. What about you, Steve? What's your best and worst?"
  },
  {
    "timestamp" : "01:13:45-01:14:11",
    "text" : "That pick Blood Soul 3 that we talked about was just aw. Like they had like, oh, we can we can do we got a little momentum here. And then so what's your worst? And the best is definitely getting a little taste of Tom Brady wants to come. You know, just an apertif.",
    "speaker" : "Steve"
  },
  {
    "text" : "Wow, that's a good one. Yeah. Alright, Greg. Give me some best and worst.",
    "speaker" : "Andy",
    "timestamp" : "01:14:12-01:14:18"
  },
  {
    "timestamp" : "01:14:19-01:15:06",
    "text" : "Yes, I did I didn't have a best and worst, but I have one that we didn't talk about. I don't know if you guys caught this, but they were talking about Kevin Swain and how so I looked up his Wikipedia. This guy at one point played fifty-two straight weeks of professional football So he played for the NFL, the AFL, and the XFL all in one year. Fifty two straight weeks of full that's almost a full year plan every week. That's which is outrageous. Yeah. Yeah. And it maybe like the exit. This dynasty might out last two iterations of the XFL if we're lucky. Which could be awesome.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:15:09-01:15:12",
    "speaker" : "Andy",
    "text" : "That would be amazing. So that sounds like it's your best."
  },
  {
    "speaker" : "Greg",
    "text" : "So yeah, we'll call that my pet.",
    "timestamp" : "01:15:13-01:15:14"
  },
  {
    "text" : "Yeah, hell yeah.",
    "timestamp" : "01:15:14-01:15:15",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:15:15-01:15:15",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:15:16-01:15:22",
    "text" : "That's all I had though. Yeah. No? No worries. No, that's all I had. An eternal optimist. I like it.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, yep.",
    "timestamp" : "01:15:22-01:15:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:15:24-01:15:42",
    "text" : "Yeah. What about the uh I you could use the uh the the jumbotron in the old Schaefer Stadium, whatever the fuck they were calling at this point, Foxboro Stadium. That thing looked beat. Like broken pixels and shit. Do you hear them make in front of the stadium?"
  },
  {
    "text" : "The commentators? Yeah. Where they're like, oh they're gonna sh they're gonna sure miss this place and then Deardorf hit him with a knot. Oh yeah.",
    "timestamp" : "01:15:42-01:15:51",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Fucking Deerdorf. The best to use is the not joke. God.",
    "timestamp" : "01:15:54-01:15:59"
  },
  {
    "text" : "Yep. You know what?",
    "timestamp" : "01:16:00-01:16:00",
    "speaker" : "Greg"
  },
  {
    "text" : "All rounds. Hall of Fame.",
    "timestamp" : "01:16:00-01:16:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Hall of Fame career. Hall of Famer.",
    "timestamp" : "01:16:02-01:16:06"
  },
  {
    "timestamp" : "01:16:07-01:16:10",
    "text" : "I'm I'm I'm not fact checking that. I'm just not gonna do it.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:16:11-01:16:16",
    "text" : "This is a Hall of Fame episode of the podcast, in my opinion. I feel pretty good about it.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:16:17-01:16:17",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:16:17-01:16:18",
    "speaker" : "Greg",
    "text" : "Yep."
  },
  {
    "text" : "I'm gonna have to trim it down from the three hours that it took us to record it, but Yeah, there's at least twenty-three good minutes in here.",
    "speaker" : "Andy",
    "timestamp" : "01:16:18-01:16:25"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah.",
    "timestamp" : "01:16:25-01:16:26"
  },
  {
    "timestamp" : "01:16:26-01:16:31",
    "text" : "I'm surprised you didn't go twenty four, Greg Brown. That feels like your number. Ooh.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Well there's still time fellas. Another hour, we can get a minute out of it.",
    "timestamp" : "01:16:32-01:16:37"
  },
  {
    "timestamp" : "01:16:37-01:16:42",
    "text" : "I'm I'm up for it if you guys are. Nope. Okay, never mind.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:16:44-01:16:51",
    "speaker" : "Andy",
    "text" : "I am all done. Alright boys. Yeah, I think this was good."
  },
  {
    "timestamp" : "01:16:52-01:16:53",
    "speaker" : "Greg",
    "text" : "Same time next week."
  },
  {
    "speaker" : "Andy",
    "text" : "Absolutely. Sounds like a plan. Um who's week three?",
    "timestamp" : "01:16:54-01:16:57"
  },
  {
    "text" : "Who are they playing week three?",
    "speaker" : "Greg",
    "timestamp" : "01:16:57-01:16:58"
  },
  {
    "text" : "Uh the Colts, I think. Yes, that's the thing.",
    "timestamp" : "01:16:59-01:17:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:17:01-01:17:03",
    "text" : "Oh, that's a great game. Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:17:04-01:17:16",
    "speaker" : "Andy",
    "text" : "Against uh the Colts who have uh scored I think forty points in both their first two games. 'Cause I remember seeing the score across the bottom and they had blown out the bills this this week."
  },
  {
    "speaker" : "Steve",
    "text" : "If you look at that like stock ticker for scores like the Colts were the only ones scoring like a regular nowadays NFS 4 back then.",
    "timestamp" : "01:17:16-01:17:23"
  },
  {
    "timestamp" : "01:17:23-01:17:27",
    "speaker" : "Andy",
    "text" : "Yeah, every every other game was like 1710 except for the Colts who put up 42."
  },
  {
    "timestamp" : "01:17:28-01:17:37",
    "speaker" : "Greg",
    "text" : "So Oh, this game is awesome. I I remember like a few plays from this game. Yeah. Me too. It's so it's one of the best of the year for sure."
  },
  {
    "timestamp" : "01:17:39-01:17:53",
    "speaker" : "Andy",
    "text" : "All right. Well we will uh talk about that next time on the Patriots Dynasty podcast. As long as we are still going by then and haven't been kicked off of Apple Podcasts for the shit that we said on this episode."
  },
  {
    "speaker" : "Greg",
    "text" : "So join us next time. We're gonna get demonetized.",
    "timestamp" : "01:17:53-01:17:56"
  },
  {
    "speaker" : "Andy",
    "text" : "I think you have to get monetized first before that happens, but yes. All right boys. Great show. See ya.",
    "timestamp" : "01:17:57-01:18:12"
  },
  {
    "timestamp" : "01:18:12-01:18:12",
    "speaker" : "Mike Melo",
    "text" : "Bye guys."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:18:13-01:18:14",
    "text" : "I'll talk to you soon."
  },
  {
    "text" : "Alright, there it goes. Love you. Oh, I love you too. Not you, Mike. I was talking to Andy. Okay, I figured, but I thought I'd jump in anyway. Love you, Mike. Oh, thanks.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:18:14-01:18:26"
  }
]