[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid. You still want to listen? Go right ahead. I am not your mother.",
    "speaker" : "Mom",
    "timestamp" : "00:00-00:19"
  },
  {
    "text" : "This is episode four, I suppose, of the Patriots Dynasty Podcast. Uh today we're doing the 2001 season week four against the Miami Dolphins. And we have a pared-down crew today. It's myself and Mr. Mello. The brothers are off gallivanting somewhere. I was thinking gallivanting. Yeah, uh yeah. I mean it's Greg's birthday, so he him I'll give a pass. Steve is probably on a plane somewhere. For work. Not that he really works because he golfs. Um so yeah, that's just uh just you and me, Mike.",
    "timestamp" : "00:23-01:03",
    "speaker" : "Andy"
  },
  {
    "text" : "That's that's right. Uh Greg didn't respond to my birthday wish.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:03-01:08"
  },
  {
    "timestamp" : "01:08-01:22",
    "speaker" : "Andy",
    "text" : "I called him right before this and he uh he's hanging out with the resident with Danny Emerald. Oh nice love that guy yes he Danny flew down For uh Bro Week, I think they called it."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh no.",
    "timestamp" : "01:23-01:23"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, exactly.",
    "timestamp" : "01:24-01:26"
  },
  {
    "text" : "Um I thought it was a nice birthday wish. Did you enjoy it?",
    "speaker" : "Mike Melo",
    "timestamp" : "01:27-01:31"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:32-01:33",
    "text" : "No, no I didn't."
  },
  {
    "timestamp" : "01:34-01:46",
    "speaker" : "Mike Melo",
    "text" : "Oh okay. There's something to the effect of uh happy birthday concu congratulate your parents on uh boning or fluids, I believe. Swapping juice, I believe I think I wasn't that Disgusting."
  },
  {
    "text" : "You have a way with words.",
    "timestamp" : "01:47-01:49",
    "speaker" : "Andy"
  },
  {
    "text" : "It's the way my brain functions.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:51-01:52"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:53-01:56",
    "text" : "It's a bad way, but it is a way with words."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "But happy birthday to to Mr. Gregory Brown, wherever you are.",
    "timestamp" : "01:56-02:00"
  },
  {
    "timestamp" : "02:00-02:03",
    "speaker" : "Andy",
    "text" : "31 today. Wow."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah.",
    "timestamp" : "02:03-02:04"
  },
  {
    "text" : "And also happy birthday to uh our niece Audrey, who is also well, she's one. So she's got some catching up to do.",
    "timestamp" : "02:04-02:11",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Happy birthday, Audrey.",
    "timestamp" : "02:12-02:13"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:14-02:33",
    "text" : "But uh yeah, I I I think I am still um number one uh favorite uncle so far out of our nieces Nice. Which annoys the other two Browns, so hopefully they don't listen to this episode. They won't. No, they definitely won't. Luckily nobody will, so we can say whatever the hell we want."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Boom.",
    "timestamp" : "02:34-02:34"
  },
  {
    "text" : "Until they do, and then Yeah, and then we'll get cancelled.",
    "timestamp" : "02:35-02:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's alright.",
    "timestamp" : "02:41-02:42"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I don't mind me.",
    "timestamp" : "02:42-02:43"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I don't want to do this shit anyway, I'm tired.",
    "timestamp" : "02:43-02:45"
  },
  {
    "speaker" : "Andy",
    "text" : "It's a lot of work, so being canceled might actually be a blessing in this guy. That's right. All right. So week four. Patriots at the Dolphins. Um let's let's uh touch on these this Dolphins team. What did you think of them, first of all?",
    "timestamp" : "02:45-03:01"
  },
  {
    "text" : "The Dolphins team, um, I mean I guess it was a bit refreshing, dare I say, on a uh Patriots podcast. Um because the AFC East has been so bad for so long that I couldn't remember a team uh being even above mediocre. I'll fight you on that later, but okay. Alright, fine. And if you bring up the bills, I can't co-sign on that. But Um yeah, I don't know. I think they looked I mean they have uh they they they've always needed a quarterback. I mean, I guess that's their biggest problem at this point, but their defense is solid, their run game was all right. Um what's the uh quarterback? Jay Fiedler? Uh yes.",
    "timestamp" : "03:01-03:43",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Um so yeah, so this is Jay Fiedler was the I feel like air apparent to Dan Marino is is too strong, but he was their first shot at replacing Dan Marino. I want to say ninety eight or ninety-nine. So Fiedler was the next in line to take over. Um I don't think anybody was expecting a Merino-esque sort of replacement. Right. Because I don't think there is or maybe even ever will be. Just the numbers he was putting up are what good quarterbacks put up now. And he was doing it at an age where it wasn't quarterback friendly. Like he's throwing for five thousand yards back when the average was like half that. Yeah. Yeah. So um, but this was still a good team. Um They were still running the AFC East at this point. They had um, I think won the division the year before in 2000. And this year they finished second in the AC East uh eleven and five.",
    "timestamp" : "03:43-04:48",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "04:48-04:52",
    "speaker" : "Mike Melo",
    "text" : "Like so they were still Oh spoiler alert right there."
  },
  {
    "text" : "We ain't spoilin' nothing. This is history, but you there's no spoilers in history.",
    "timestamp" : "04:53-04:58",
    "speaker" : "Andy"
  },
  {
    "text" : "Nobody's googling this stuff.",
    "timestamp" : "04:58-05:00",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "We are are you do you listen to World War II podcasts, bro?",
    "timestamp" : "05:00-05:03",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "05:04-05:09",
    "speaker" : "Mike Melo",
    "text" : "No, I don't. Oh, you should. It's awesome. Could you imagine that it sounds depressing?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:10-05:12",
    "text" : "Uh depends on who's talking about it."
  },
  {
    "timestamp" : "05:12-05:15",
    "speaker" : "Mike Melo",
    "text" : "Okay. Is it only about World War II?"
  },
  {
    "text" : "No, actually, uh Hardcore History. We're we're gonna plug this right now, because that's how we do. Uh by Dan Carlin. He Talks about a bunch of different historical things. The the my favorite is he goes through the entire World War I from start to finish. And I think there's like four or five episodes. Each one is um between three and four hours long.",
    "timestamp" : "05:16-05:43",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "05:43-05:44",
    "speaker" : "Mike Melo",
    "text" : "Oh my lord."
  },
  {
    "timestamp" : "05:45-05:46",
    "speaker" : "Andy",
    "text" : "Of him monologuing."
  },
  {
    "timestamp" : "05:47-05:51",
    "speaker" : "Mike Melo",
    "text" : "And it's fascinating. That sounds pretty cool."
  },
  {
    "text" : "Yeah, I mean it's No, I mean it does.",
    "speaker" : "Andy",
    "timestamp" : "05:52-05:55"
  },
  {
    "text" : "I mean it it it's each of their own, right? I it just seems like a um a dreary um topic, obviously.",
    "timestamp" : "05:55-06:02",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "06:02-06:15",
    "text" : "Yeah, but he's so excited about it and he's he's a very good uh storyteller. So he he tells kind of the human side of things and it he does it it's a very well done podcast. I never thought I I'd be listening to a history podcast of four.",
    "speaker" : "Andy"
  },
  {
    "text" : "I could see it. I've known you for a while. I could see it. Um You obviously don't know me that well. What else is the Patriots in this game? Yeah. See that segue?",
    "speaker" : "Mike Melo",
    "timestamp" : "06:16-06:28"
  },
  {
    "text" : "That's pretty good. That was a fantastic segue. Let's let's uh let's finish up on the Dolphins real quick though. Um so yeah they finished second in the AC East, they made the playoffs this year along with both the Pats and the Jets. 'Cause um, you know, how's that weak A of C E's for you now, Mr. Mello?",
    "timestamp" : "06:29-06:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Hey, I said twenty years, man. I mean twenty years ago is formidable.",
    "timestamp" : "06:52-06:57"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and they they've always had a a challenger. The pages have always had at least one challenger in the AFC East. But we'll get to that a A different episode because we c I can do an entire episode on that with or without you.",
    "timestamp" : "06:58-07:11"
  },
  {
    "text" : "Oh wow. Well I will take that one off then. Thank you.",
    "speaker" : "Mike Melo",
    "timestamp" : "07:12-07:15"
  },
  {
    "text" : "All right. Um so yeah, so they lost to the Ravens in the wild card. Um but I'd think it's probably a successful season. Their head coach was Dave Wonstadt. The man, the myth, the mustache. The mustache, yes. Yep, that was Yeah, he does look like um a janitor from uh a porn studio, I think.",
    "timestamp" : "07:16-07:41",
    "speaker" : "Andy"
  },
  {
    "text" : "Um janitor is very specific.",
    "timestamp" : "07:42-07:44",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "I would say they have janitors. I feel like the thing is.",
    "timestamp" : "07:45-07:48"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, I don't know. I don't even know what a janitor specifically would look like at a porn studio. What I would say is he probably looks like the stand-in, if they do have stand-ins for some porn. Studio.",
    "timestamp" : "07:48-07:58"
  },
  {
    "timestamp" : "07:59-08:00",
    "text" : "Maybe. Yeah, I can see that too.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "08:00-08:02",
    "text" : "I don't know what that means though.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:02-08:04",
    "text" : "He looks like Deuce Bigelow, maybe?"
  },
  {
    "timestamp" : "08:05-08:09",
    "speaker" : "Mike Melo",
    "text" : "And I don't really know what well enough porn is, so. Yeah."
  },
  {
    "text" : "Um but yeah, so Wannstatt was a decent coach. Uh he spent six years with the Bears before coming to Miami uh and kind of was like mediocre, you know, kind of like a nine and seven sort of coach. Uh but when he took over the Dolphins in 2000, 2011, they were both or excuse me, 2000, 2001. Uh they were 11 and 5 both years, kind of taking over from I don't think it was wasn't it Don Schuela then Jimmy Johnson then wants that? Or was this directly Sounds about right. Yeah, either way. He took over that like well-built team. Took him to eleven and five records and made the playoffs both years. And then kind of like trailed off a little bit. They went nine and seven, ten and six. And then he didn't make it through the 2004 season because they were 1 and 8 at the time and he was uh relieved of his duties. But um Yeah, it's it's the Dolphins. Um and when Wansett was a coach of them, they played the Pats tough. Uh the Dolphins were four and five against the Pats, but they did lose their last four games. So actually four and one at one point. against the Patriots, like early, when he had those teams that were built by his predecessor. Um and then the Patriots became the dynasty that everybody knows them as now and He didn't let it go.",
    "timestamp" : "08:11-09:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "09:46-10:14",
    "speaker" : "Mike Melo",
    "text" : "I never thought about this before, but do you think like obviously the Patriots are our team and we root for them, but if you think about it, and evil empire side and all that stuff, how many jobs have the Patriots uh basically gotten rid of over the years because of their dominance. Like you get you just said that once that probably due to the Patriots lost his job. And I bet a thousand other people have done so as well. So how do you feel about that?"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh I'm fine with it. Um but yeah, I I wonder what that number would be because I think you have to count head coaches because they never last. Uh starting quarterbacks I think you could add in there. Oh definitely. I'm sure there's been general managers. Yep. Yep. And I think like the the the rest of the players and personnel and stuff, maybe less so. Because that's so fluid.",
    "timestamp" : "10:14-10:37"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "10:38-10:40",
    "text" : "Yeah, they they get rotated, right."
  },
  {
    "timestamp" : "10:40-11:06",
    "speaker" : "Andy",
    "text" : "Yeah, but I think if you counted up all the different GMs, coaches, and starting quarterbacks, I bet you could put together quite a list. That's interesting. Maybe maybe we'll think about that. Yeah, we'll do some fact checking and we'll bring it back for for next week. Figure out like how doing the fact checking of you? I'm assuming it's me because it's not gonna be you know the the brothers or the yeah."
  },
  {
    "timestamp" : "11:07-11:12",
    "speaker" : "Mike Melo",
    "text" : "So Okay, cool. Yeah, definitely get uh that info and get back to me on that because I'm interested."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "11:13-11:16",
    "text" : "We'll do Yes shit."
  },
  {
    "timestamp" : "11:17-11:17",
    "speaker" : "Mike Melo",
    "text" : "Yes."
  },
  {
    "timestamp" : "11:18-11:46",
    "speaker" : "Andy",
    "text" : "Alright, so I had uh usually I have a section on our uh show notes page. Um outlining the star players for these teams. But I crossed out star players and just put guys I've heard of because there wasn't a lot of big names on this Dolphins team for Them finishing 11 and 5. They were guys I kind of, you know, recognized, but they're not ones you're gonna see in the annals of the the history books of the NFL, I don't think."
  },
  {
    "text" : "I beg to differ. I thought their defense was stacked.",
    "speaker" : "Mike Melo",
    "timestamp" : "11:46-11:49"
  },
  {
    "text" : "I I thought there was two names on the defense and then outside of that it was like yeah okay.",
    "timestamp" : "11:50-11:57",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "11:57-12:22",
    "speaker" : "Mike Melo",
    "text" : "Alright. Well I would say two big names and then like a couple like solid ones. Alright, give me some names. Clearly, uh Jason Taylor and Zach Thomas are freaking amazing. Um and I remember that Jason Taylor was like, you know Uh I think Brady recently said that Ed Reed was his kryptonite. Well Jason Taylor was up there and causing problems."
  },
  {
    "timestamp" : "12:22-12:27",
    "text" : "Yeah, I think for the first half of Brady's career it was Jason Taylor and the second half it was Ed Reed.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "12:28-12:38",
    "text" : "Yeah, that's fair. Yeah. So and there was always there was always rumors about both those guys that they would be on the Patriots. So it was kind of sad that I never saw that happen because Jason Taylor in like a Patriots uniform, that'd be sick.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, it was him and uh who was the uh the defensive end for the Panthers for all those years? Peppers.",
    "timestamp" : "12:38-12:47"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "12:47-12:48",
    "text" : "Oh Peppers, yeah."
  },
  {
    "text" : "He's a playing right always rumors Is he still?",
    "timestamp" : "12:48-12:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I think he's still playing. Maybe he's not. I think he is though. I think he is. I'm gonna fill in the space while you're googling this. Um Uh I vaguely remember it was a couple of weeks ago, it was raining. Um, you know, Frank Sinatra was on the radio and I was flipping through the channels when I saw his his sparkly eyes on TV and I thought for a minute is that Julius Peppers and it wasn't. But then I kept on changing the uh channels and switching through and eventually I turned the TV off because",
    "timestamp" : "12:52-13:28"
  },
  {
    "text" : "I love the way you kill in time. So you were not far off. He the last career history list he has, he played so Started with the Panthers 02-09. Went to the Bears 2010 to 2013. Packers 2014-2016 Back to the Panthers 2017 through 2018. Retired last year.",
    "timestamp" : "13:29-13:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "13:53-13:56",
    "text" : "Oh, okay. Man, that's a hell of a career."
  },
  {
    "speaker" : "Andy",
    "text" : "Right? For a defensive end.",
    "timestamp" : "13:56-13:58"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "13:58-13:59"
  },
  {
    "text" : "Like pretty monstrous.",
    "speaker" : "Andy",
    "timestamp" : "13:59-14:02"
  },
  {
    "text" : "Yeah, so uh Jason Taylor, Zach Thomas. I mean there I believe there's Patrick Sertan, which he was pretty okay.",
    "speaker" : "Mike Melo",
    "timestamp" : "14:03-14:10"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh yeah, I had him and uh Sam Madison.",
    "timestamp" : "14:10-14:13"
  },
  {
    "text" : "Yeah, he was solid.",
    "timestamp" : "14:13-14:14",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:17-14:21",
    "text" : "Uh I mean like I said, they're they're they're names I I recognize, guys I know."
  },
  {
    "timestamp" : "14:22-14:29",
    "speaker" : "Mike Melo",
    "text" : "But they're not like I mean I feel like Zach Thomas was like a Brewski type, you know, he wasn't flashy, but he was He was in every play."
  },
  {
    "timestamp" : "14:29-15:12",
    "speaker" : "Andy",
    "text" : "Yeah, he was a he but he was a name brand, you know? Right. He was he was one he was that Lunch pale, white, no-necked. Exactly, exactly. Yeah. Erlacher, Brusky, and Zach Thomas were the guys, you know. But I'm not sure. Yeah, the only other name I I recognize, at least on the defense, was Brock Marion. I don't know why I recognize him. Probably just because His name is Brock Marion. And it's one of those names that stuck with me. I don't remember him being good. I just maybe I had his football car growing up or something, but Brock Marion was a name that stuck with me."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I did uh remember Olinda Mare. Olinda Mare.",
    "timestamp" : "15:11-15:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Who apparently was a uh an absolute weapon.",
    "timestamp" : "15:17-15:19"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "15:20-15:21",
    "text" : "Right."
  },
  {
    "timestamp" : "15:21-15:31",
    "text" : "I which I didn't realize you know, I mean you don't think of kickers much, but I think about 'em all the time. I bet you do. Well you do this year. Well there aren't any kickers who can kick a field.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "15:31-15:40",
    "text" : "Yeah, which funny how we all complained about uh our kicking situation until we've uh speak for yourself. Hey, I complained about everything."
  },
  {
    "timestamp" : "15:40-15:43",
    "text" : "Well that's true. I I didn't complain about it at all.",
    "speaker" : "Andy"
  },
  {
    "text" : "Alright. I still complain about trading Jimmy G even. The Patriots have won two Super Bowls and been to three since then. That's besides the point, dude. Okay. Pay the guy whatever he wants and keep him in the bench until like Brady retires when he's 50. I don't care. Make it happen, Belichick. I'm sick of the Patriots doing whatever they want all the time. What about me?",
    "timestamp" : "15:43-16:02",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Counterpoint, when has Gus Tkowski ever lost a game by missing a a field goal? I can think of uh maybe one.",
    "timestamp" : "16:03-16:12"
  },
  {
    "text" : "The Broncos. It wasn't to miss the game, but he definitely affected it. Where then they needed to go for two points at the end. Gronk couldn't make it happen. It was potentially some defensive pass interference. And that's the way it went.",
    "speaker" : "Mike Melo",
    "timestamp" : "16:12-16:24"
  },
  {
    "speaker" : "Andy",
    "text" : "Correct. Name another.",
    "timestamp" : "16:25-16:27"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "16:28-16:48",
    "text" : "Another time. Well, I was thinking about this about five weeks ago. It was raining and I had Frank Sinatra on the radio. Funny enough. I want to say frequently by his standards in the recent years, but I guess that's a good point. I don't really remember any big ones."
  },
  {
    "text" : "There's there's one other that I can think of, and it was way back in the day when they were playing the Cardinals early in the season.",
    "speaker" : "Andy",
    "timestamp" : "16:48-16:54"
  },
  {
    "timestamp" : "16:54-16:54",
    "speaker" : "Speaker 4",
    "text" : "Mm-hmm."
  },
  {
    "timestamp" : "16:54-17:19",
    "text" : "And it was just one of those games where shit was just going wild where the Cardinals had the ball like late and they were up by a couple points. And they uh were trying to run the clock out and I think Vince Wilfork forced the fumble and they recovered it, but then they couldn't drive anywhere, so they tried to kick a game-winning field goal at the end and and they missed. Talkowski missed and they lost that game.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "17:19-17:24",
    "speaker" : "Mike Melo",
    "text" : "Well, I'll counter and ask you, do you remember when he won the game?"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "17:25-17:25"
  },
  {
    "text" : "When?",
    "timestamp" : "17:26-17:26",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Uh this most recent Super Bowl against the Rams, he won that one.",
    "timestamp" : "17:28-17:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "17:33-17:34",
    "text" : "Okay, that's fair."
  },
  {
    "timestamp" : "17:34-17:41",
    "speaker" : "Andy",
    "text" : "And um I would say the Giants game where he kicked a 50 some odd yard field goal as time expired, he won that one."
  },
  {
    "timestamp" : "17:41-17:44",
    "speaker" : "Mike Melo",
    "text" : "I remember that one. That was regular season you're talking about."
  },
  {
    "timestamp" : "17:44-17:53",
    "speaker" : "Andy",
    "text" : "Yep. He did it again uh against the Jets in overtime. Uh I think a couple times actually he's beat the Jetson overtime um in the regular season."
  },
  {
    "timestamp" : "17:53-18:17",
    "speaker" : "Mike Melo",
    "text" : "So like under ten times that you remember. Big whoop. No, to be to be serious for a second. You're right. Um he was pretty good. Uh Vinateri was awesome. So now to go from those two guys to Nick Folk and all that stuff is pretty disappointing. So a guy like Olynde Mare, I don't even know how to say his freaking name. I think he nailed it."
  },
  {
    "text" : "Linda Marvin.",
    "speaker" : "Andy",
    "timestamp" : "18:18-18:19"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah. All right. I think uh that's on par with um Dolphins wide receiver Aronde Gadson. Oh yeah. Man, that guy was like he just looked like a beast. I don't think he was a beast, but he was like he just looked vicious. He did, yeah. They uh but like so I mean I uh this this dolphins offense to segue to that. Um wasn't a great segue, but I'll give it to you. Yeah, all right, thanks. Yeah. That was all right. Alright, we'll workshop it.",
    "timestamp" : "18:19-18:51"
  },
  {
    "text" : "Um, was basically Lamar Smith at running back. Who the year before had over a thousand rushing yards, this year had almost that. He had nine sixty-eight. Um It was basically kind of that typical run first heavy set offense with some play action and some guys who were I guess burner is down the field, so you had to look for the the long play action. Almost it felt similar to like the later Baltimore Ravens with Joe Flacco. Yeah. They were more of like a run first team, but then they were gonna try chuck it down the sidelines.",
    "timestamp" : "18:52-19:28",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "19:28-19:31",
    "text" : "Playoff Joe Flacco or regular season Joe Flacco?",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Oh this was definitely regular season Joe Flacco. Where they just try to chuck it deep and get the pass in France Cole. Um but yeah, so I mean like we talked about before Jay Fieldler, the quarterback had a decent year, I guess",
    "timestamp" : "19:31-19:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "For quarterbacks and he was a bit of a running quarterback too, which was kinda weird.",
    "timestamp" : "19:46-19:50"
  },
  {
    "timestamp" : "19:50-20:10",
    "speaker" : "Andy",
    "text" : "Yeah. It came up a lot in uh the announcers as well, talking about how they were deploying the uh what they call it the the Doug Flutie defense. Yeah. Which I thought was an interesting choice of rushing quarterback, but I guess this is pre Michael Vick, so it makes sense."
  },
  {
    "timestamp" : "20:11-20:23",
    "text" : "Mm-hmm. Well, and Flu is probably on a different level, I would say, than Michael Vick. So I I'm sure Michael Vick created uh uh you know issues for the defense to the point where they had to create game plans just for him.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "But Oh yeah.",
    "timestamp" : "20:23-20:24"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Feedler Probably not of that caliber, but he was all right for you know a little guy running around.",
    "timestamp" : "20:25-20:31"
  },
  {
    "timestamp" : "20:31-20:57",
    "speaker" : "Andy",
    "text" : "Yeah. Um he definitely got his ass lit up a bunch of times though. The man has no feeling for somebody coming up behind him. Like I feel like he's the first guy to die in a scream movie. Because he just had no spatial awareness. So he would take off and he got caught from behind multiple times by three to fifty-pound linemen."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And I hate to feel passionate about this, but I'm gonna go at you hard. In a scream movie or something like that, you would think that the most unaware guy who doesn't know what the hell is going on would get slashed. But that would be too obvious. He's probably also the comedic relief because he's just running around like a maniac. So I would say that you would probably you'd probably kill off some well-known person just to kind of give the audience shock and to scare them a little bit to the snakes arisen. Then you'd probably go after maybe like a couple of like the side characters, but like one's a fan favorite, you know, you're like, damn it, you know, how'd that happen? Then it would be Jay Fever, probably in some sort of like weird sex scene or something where he's like warming up and then boom down goes Jay. That is how I feel about this.",
    "timestamp" : "20:56-21:41"
  },
  {
    "speaker" : "Andy",
    "text" : "Where he's rolling left on a third log.",
    "timestamp" : "21:42-21:44"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "21:45-21:46",
    "text" : "Right. Exactly."
  },
  {
    "timestamp" : "21:46-21:46",
    "text" : "Third.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, yeah. He's like reciting poetry and boom, decap decapacitated. But anyways, I didn't mean to attack you there, but that's how I felt.",
    "timestamp" : "21:48-21:58"
  },
  {
    "timestamp" : "21:58-22:00",
    "speaker" : "Andy",
    "text" : "Moving there. Alright, fair enough."
  },
  {
    "text" : "Hey, it is what it is.",
    "speaker" : "Mike Melo",
    "timestamp" : "22:00-22:02"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "22:03-22:43",
    "text" : "All right, so With that being said, let's actually talk about this game. Let's do it. Our recording. I know you called this out to me because you thought it was a glitch as well, like I did, started halfway through the second drive of the game. Um and looking at the um the Boston Globe. Things. I don't know if you saw it too, but on the the front page they actually talked about how it was because the um The United States had launched a uh an attack on Afghanistan."
  },
  {
    "timestamp" : "22:43-22:46",
    "speaker" : "Mike Melo",
    "text" : "Right, it was the first day of that, I believe."
  },
  {
    "timestamp" : "22:46-23:00",
    "speaker" : "Andy",
    "text" : "Yeah, it was the airstrikes on bin Laden and so it was kind of like a special report talking about that. And so a lot of the um A lot of networks actually covered that, which kind of went into the the beginning of the game."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "So Which again created more controversy because I read a few things where it was talking about I guess some networks decided to not show any games and just show the coverage and push speak and everything and then switched over and then some I um decided to cover the games and uh not address that.",
    "timestamp" : "23:00-23:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, or or they would like push it off to a sister station to speech and show the game on the regular station. Yeah, it was a whole big kerfuffle over that which, you know, typical. Can you imagine if Twitter was around back then if that had happened?",
    "timestamp" : "23:18-23:31"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "23:32-24:11",
    "text" : "I mean, no. I I that yeah, that I mean, we were talking off-air about the wonders of Twitter and and the w the world as it is today and with information. And yeah, I mean something like that. I cannot imagine. Which I also wonder what it would do for information, because I mean I'm sure everybody at that point, as far as I can remember, was just curious about what was going on. We were, you know, afraid what might happen over here, what was going on to people over there. And if you just had a barrage of voices coming at you and in the middle of all that, what would you take from it? I mean that that might even be a scarier time looking back if that was around. I don't know."
  },
  {
    "timestamp" : "24:12-24:49",
    "text" : "Yeah, no, I agree. Just because of I mean I I feel like nowadays news isn't so much um who's the most correct, it's who gets the information out first. So I think there would probably be a lot more um I don't want to say fear mongering, but just kind of unnecessary fear coming up from all these maybe unreliable stories coming out of like people trying to be the first but not getting all the information or getting incorrect information out",
    "speaker" : "Andy"
  },
  {
    "text" : "Right. But then the the devil's advocate would say, and it's also I think an interesting point where you would definitely have some sort of vehicle to hear people outside of the US and how they were viewing things, um, and maybe some of the people that were going through things that we weren't seeing. And we definitely didn't have that voice. Um, you know, I'd travel to Europe and heard some things around that time and you know you'd have to sort of do that to to hear it. But I guess social media and internet the way it is now probably would provide us with different voices and people trying to reach out to kind of explain what they were going through, which is a another interesting point.",
    "speaker" : "Mike Melo",
    "timestamp" : "24:49-25:27"
  },
  {
    "timestamp" : "25:27-25:29",
    "speaker" : "Andy",
    "text" : "Yeah, that is true."
  },
  {
    "text" : "But that did happen. And um Yes.",
    "timestamp" : "25:31-25:34",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "25:34-25:54",
    "speaker" : "Andy",
    "text" : "So we yeah, so the game started with the Patriots on the Dolphins like inside their 20. Which turns out was because uh the Patriots actually kicked off and the first pass from uh Jay Fieldler was Um Mike Rabel's first career interception."
  },
  {
    "timestamp" : "25:54-25:59",
    "text" : "That's right. It was a beautiful one just because of how ridiculous it was. Yeah.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean, the fact that Jay Fiedler was uh as the announcers pointed out throwing into triple coverage before variable drop back into coverage.",
    "timestamp" : "25:59-26:09"
  },
  {
    "timestamp" : "26:09-26:13",
    "speaker" : "Mike Melo",
    "text" : "Right, so there's four guys in on the one that he was"
  },
  {
    "text" : "Yeah, which tells you a bit about Jay Fiedler as a uh replacement for Dan Marino. But you know, he he had something Dan Marino didn't, which was the ability to run. That's right. So yeah, so you turn it on and the first play you got to see of this game was um a Patriots Rushing T D. by Antoine Smith, which was a great start. Um not I I think that would have been um really uplifting had you been watching it live. But knowing what the score was going in, knowing the pages are gonna lose this.",
    "timestamp" : "26:13-26:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "26:53-27:00",
    "text" : "See, I didn't even know they were gonna lose. I forgot. I didn't even check the score, man. I went in it cold. I experienced the game brand new."
  },
  {
    "text" : "Oh, so we'll have different takeaways. Yeah, we'll have different takeaways of this then, because I knew going in this is going to be 30 to 10. No, I saw the Patriots one touchdown a couple minutes into this game.",
    "timestamp" : "27:01-27:12",
    "speaker" : "Andy"
  },
  {
    "text" : "Right. Well, and then like soon after uh Fiedler, so the Dolphins were kind of making their way towards Patriots territory. And uh Gadson actually likes broke free, and he was probably one of the most wide-open wide receivers in an end zone I've ever seen ever, and uh, or tight ends. And uh Well he missed him. Uh wide open. I I don't know if I think it was like overthrown or whatever. I don't know how it happened, but I was like, oh man, maybe this is a win for the Patriots. I forget. Like we'll see how it goes. And then a couple of plays later that was pretty much destroyed. So That was as far as I got with the hope on this one. I think that was in the first quarter.",
    "timestamp" : "27:13-27:52",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I mean I think it was still pretty close.",
    "timestamp" : "27:53-27:56"
  },
  {
    "text" : "Even like at halftime was like 17 and 10 or something.",
    "speaker" : "Mike Melo",
    "timestamp" : "27:57-28:01"
  },
  {
    "text" : "Yeah, deep deep into the into the second quarter. The Patriots were they were tied at ten. They were hanging in there. And the Dolphins had that. last drive right at the end where they score a touchdown to go into the half up 17-10 like you said. And then it's like, all right, well, you know, they're hanging in there. And then the third quarter started and Well it just fell off.",
    "speaker" : "Andy",
    "timestamp" : "28:01-28:21"
  },
  {
    "timestamp" : "28:22-28:56",
    "speaker" : "Mike Melo",
    "text" : "We also have to address, and this is something I I've I guess subconsciously thought about this, but I I never really pieced it together as to why until This year when I was watching the Patriots um early on and then after watching this game, it was sort of solidified. But like, so it was 90 degrees, it was 120 on the field. Yeah. And Uh I also didn't uh I guess I somehow missed this information before, but the Dolphins wear um white at home uh due to sun issues and so they want their opponents to kind of wear the darker colors and soak the sun in."
  },
  {
    "timestamp" : "28:57-29:08",
    "speaker" : "Andy",
    "text" : "Exactly. And the way the stadium faces now, apparently, um the dolphins are the sideline is in the shade, whereas their opponents is in full sun the entire game."
  },
  {
    "text" : "Which is interesting because I mean the Patriots always have trouble at mile high and they obviously have their own unique circumstances for that stadium. So Um so that was interesting. So it makes a a lot more sense why the Patriots have some issues over there. Um but yeah, I think that definitely played uh a little bit into it. And then I think the Dolphins, Jay Fiedler Especially after the game was commenting that the defense looked slow. And I was saying it was kind of like the most lackluster performance I've seen from a Patriots defense that I can remember. Like it looked like their spirit was broken by the third quarter.",
    "timestamp" : "29:08-29:40",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, they were just getting the ball run down their throat. I think there was actually a quote from Belichick in the the paper the next day. Um one of the reporters after the game said to him, like what do you how do you feel about the fact that they ran it on you forty-four times? And he said in typical Belichick fashion, I'm surprised they didn't run it more.",
    "timestamp" : "29:40-30:01"
  },
  {
    "timestamp" : "30:02-30:03",
    "speaker" : "Mike Melo",
    "text" : "Yeah, I thought that was pretty good too."
  },
  {
    "speaker" : "Andy",
    "text" : "Cause yeah, they were get I mean, well they it was they ran for forty something times. I think it was forty four times, but they had Like close to 200 yard rushing. It was like 160, 170 yards rushing all in, I think.",
    "timestamp" : "30:04-30:15"
  },
  {
    "text" : "Because um Lamar Smith himself had One forty-four. Yeah, so that's I mean, it's a hell of a game. And a touchdown.",
    "timestamp" : "30:15-30:26",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "30:28-30:41",
    "speaker" : "Andy",
    "text" : "Yeah, oh they finished with uh 209 total between Damn. I mean I suppose with um Jay Fiedler rushing as well, he had how many yards rushing do you have? He had 37 yards rushing, 87 yards passing."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's insane. I mean i i I guess it could uh it was shades of the uh the uh Ravens game in the 2019 season.",
    "timestamp" : "30:42-30:52"
  },
  {
    "text" : "Yep. Yeah, it felt very similar. The fact that we watched both of those in the same week um felt I don't know, a little telling. I'm not quite sure why, but",
    "timestamp" : "30:52-31:02",
    "speaker" : "Andy"
  },
  {
    "text" : "Hey, but if it ends the same way, I mean it's a teaching point, and that was obvious uh from that point on that Belichick used it. Because I mean I was also looking at it, I mean the Patriots were one and three after this game.",
    "speaker" : "Mike Melo",
    "timestamp" : "31:04-31:15"
  },
  {
    "timestamp" : "31:16-31:16",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "31:16-31:18",
    "speaker" : "Mike Melo",
    "text" : "Uh Baffling."
  },
  {
    "timestamp" : "31:18-31:31",
    "speaker" : "Andy",
    "text" : "Right. Yeah, because you you look at the end of this and you s you think pages one and three, they've lost like all the articles too after the game are talking about how Well, it's obviously not Brady. Like quarterback uh controversies ended. It's obviously they need Bloodsome."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well, and the and the the Ron Borges thing where he wrote the quarterback controversy ended after Brady's first fumble. So I'm like, wow, what a bold statement.",
    "timestamp" : "31:31-31:41"
  },
  {
    "text" : "So typical.",
    "timestamp" : "31:41-31:42",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:46-32:19",
    "speaker" : "Mike Melo",
    "text" : "What's the point of listening to like sports talk when like anybody can say whatever the hell they want and nobody's held accountable for anything? I mean You know, between Max Kellerman, um, you know, the uh first take guys, uh, you know, uh Skip Bayless and and Shannon, uh uh What's the point? Because you could say anything and then if you're wrong, you're wrong, who gives a crap? Because that's a pretty bold statement. And I wonder if even like Ron Board just remembers it because there's so much other crap that he said over the years that Uh it doesn't really matter."
  },
  {
    "text" : "Oh, don't you worry. I'll make sure he remembers that because I'm gonna tweet it at him after we're done with this show.",
    "speaker" : "Andy",
    "timestamp" : "32:20-32:25"
  },
  {
    "text" : "Do it.",
    "timestamp" : "32:25-32:25",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "32:26-32:27",
    "speaker" : "Andy",
    "text" : "Yeah, he can get fucked."
  },
  {
    "text" : "And I'm gonna sign up for Twitter and then I'll do that too.",
    "speaker" : "Mike Melo",
    "timestamp" : "32:27-32:30"
  },
  {
    "text" : "Oh yeah, because I know we're gonna run some Shaughnessy articles too. Um and we'll tweet them at um Cold Takes Exposed.",
    "timestamp" : "32:30-32:38",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh okay, yeah.",
    "timestamp" : "32:38-32:39",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "I love that account. Um so we'll uh we'll make sure they know about it All right. But yeah, no, I th I I think this actually it it almost feels like there's a cottage industry about hating the Patriots. And uh I was thinking about this earlier because I've heard this kind of come up in other places where The Boston sports teams before you know 2000-ish were kind of the lovable losers. So the sports writers of the day kind of made their their names being the the negative of these teams and like pointing out like, you know, well here we go again. It's time for, you know, the Red Sox to bungle it away or the Patriots to be the Patriots or, you know. all of that stuff. And then since like oh one and the pages became a dynasty, the rest of the teams have kind of followed And so there's been this level of success, but the sports media in Boston has kind of tried to keep that negative attitude towards it. But now it just feels forced because like The pages have won two of the last three Super Bowls and they've been to all three of them. Why are we shitting over how Bill Belichick drafts in the second round over the past ten years because honestly, doesn't fucking matter, does it? There's it's obviously working because they're still winning Super Bowls at uh 66% clip. So yeah, I I I feel like the negativity is by design and I feel like they're almost trying to play this caricature of like the page so good so we're gonna hate them so that people will hate watch us and we'll go viral because of it.",
    "timestamp" : "32:39-34:35"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Doesn't that like make sports dot kinda lame though? Because we know it's a gimmick and of course they have to because somebody has to play the counterpoint So, you know, you have Max kind of running his mouth for four straight years, kind of just saying the same thing, and somehow he gets a paycheck for that. But I mean we know that it's an act, so I guess like part of it is that he's trying to sell that act, so good for him. Yeah. But uh yeah, it just seems like I don't I don't know how sports talk exists when um nothing matters. I mean this is what I mean.",
    "timestamp" : "34:35-35:04"
  },
  {
    "timestamp" : "35:04-35:14",
    "speaker" : "Andy",
    "text" : "This this is how it existed because They come out with these ridiculous hot takes like But why do we listen to it, man? Because we hate ourselves, Mike."
  },
  {
    "timestamp" : "35:14-35:18",
    "speaker" : "Mike Melo",
    "text" : "Okay, that's what I wanted to talk about. Why do we hate ourselves?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:19-35:26",
    "text" : "Um Uh because we weren't hugged enough as children, I I that is uh beyond my pay scale."
  },
  {
    "timestamp" : "35:27-35:29",
    "speaker" : "Mike Melo",
    "text" : "That's a good start, I think."
  },
  {
    "timestamp" : "35:29-35:31",
    "speaker" : "Andy",
    "text" : "Speaking of other things I hate."
  },
  {
    "text" : "We'll we'll touch on that later because I feel like we were going in a pretty good spot there.",
    "timestamp" : "35:32-35:36",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Alright, yeah, no, well yeah, we'll get back to that. We we've got a whole season's worth of episodes, so we'll we'll we'll peel that onion. Yes. Um Other things I hate, the stupid fucking baseball dirt baseball field in the middle of the old Miami.",
    "speaker" : "Andy",
    "timestamp" : "35:36-35:51"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh yeah, yeah. That was a staple.",
    "timestamp" : "35:52-35:54"
  },
  {
    "timestamp" : "35:55-35:59",
    "speaker" : "Andy",
    "text" : "It was awful. Like trying to watching kickers kick from the dirt."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah.",
    "timestamp" : "35:59-35:59"
  },
  {
    "timestamp" : "36:00-36:06",
    "speaker" : "Andy",
    "text" : "Watching like linemen trying to like Like line up in the dirt and try to like get a jump on things."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, but isn't there like some kind of like fun like backyard football type of thing to that?",
    "timestamp" : "36:06-36:11"
  },
  {
    "text" : "Well, I mean, yeah, between that and the fact that all the grass was dead.",
    "speaker" : "Andy",
    "timestamp" : "36:12-36:15"
  },
  {
    "text" : "At least it looked like it on on a I mean a couple of like rolled ankles aside.",
    "timestamp" : "36:15-36:20",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "It made me feel better looking out the window and be like, oh my grass is brown too. This is perfect. And half of it's dirt. I love it. I am the Miami football field.",
    "timestamp" : "36:20-36:28",
    "speaker" : "Andy"
  },
  {
    "text" : "Not to play counterpoint after just saying what I just said about everybody else, but I will say that that was probably my favorite field of all time.",
    "timestamp" : "36:28-36:35",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "36:36-36:37",
    "speaker" : "Andy",
    "text" : "Oh fucking course it was"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "So take that and we could debate that all all day long.",
    "timestamp" : "36:38-36:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:42-36:45",
    "text" : "Why would all right give it to me? Why is that your favorite field?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Because it's different? Because it's different. Because it's wrong. Okay. Because it's socially unacceptable. It's socially unacceptable. No, dude, don't don't attack me over that. Or are you playing me attacking you?",
    "timestamp" : "36:46-37:02"
  },
  {
    "timestamp" : "37:03-37:04",
    "speaker" : "Andy",
    "text" : "No, I'm attacking you in that case."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "37:04-37:43",
    "text" : "Oh yeah, no, I don't like that. And I wasn't gonna attack you. I was gonna say I have a lot of beautiful uh childhood memories. uh about that that field. Um there are a lot of times uh where um I remember watching Dan Marino uh destroy us on that field and I remember like man that guy has some crazy stats and I keep track of those stats. uh because I had no friends and no time uh uh with anybody outside of my parents. And um It got me through those days. Okay. I remember there are journals from when I was a kid in school that talked about Dan Marino's stat lines, okay? So god damn it I love that field."
  },
  {
    "speaker" : "Andy",
    "text" : "All right, all right. I mean I I I can't argue that because um I'm pretty sure I introduce you to the unnecessary roughness uh computer football game.",
    "timestamp" : "37:43-37:53"
  },
  {
    "text" : "And by the way, that still might be the best game ever. If anybody can get what was it, running on DOS or something? I don't know. If you can find this game.",
    "timestamp" : "37:54-38:01",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:02-38:07",
    "text" : "It's online. There's an online emulator of it. Then get everyone get it."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "38:07-38:14",
    "text" : "If anyone's listening right now and all you take from life or this podcast is this, download this game. What is it again?"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh unnecessary roughness, I want to say ninety-three.",
    "timestamp" : "38:15-38:18"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "But it didn't have the the date, right?",
    "timestamp" : "38:19-38:21"
  },
  {
    "timestamp" : "38:22-39:27",
    "text" : "I don't know. There was a couple of them, but yeah, whatever the earliest one was. Um and if I remember I'll I'll post the the link to where you can play it online for free. But you could uh literally design your own plays so you could There's a chalkboard where you can drag and drop different players into the positions and then click and draw, literally draw the routes for where everybody's supposed to run. And I would draw the most ridiculous plays. But yeah, so that game, I think, um before I an obsession over numbers. Oh, but I I I can't even begin to tell you how bad it was. I before I put us in the game, like that once I finally met you and and made a friend, um, I would I think I played as Yeah, I played as as the ninety-four, ninety-five, whatever it was, Patriots. So I would put Drew Bledsoe in and make sure he would throw for 500 yards a game and then put Scott Zolak in and try to get him another 500. Um And at the end of the season I literally printed out all the stats that I had.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "39:27-39:29",
    "text" : "Oh, I remember it. I think I had my own book too."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:29-39:52",
    "text" : "And I put him in I put him in a binder and I would highlight all the ones that were um NFL records and I was super proud of the fact that I had um Drew Bledsoe throw for more passing yards than Dan Marino because it was over the 5,000. And in a video game that I had on easy, by the way, I beat Dan Marino by like 200 passing yards."
  },
  {
    "text" : "Well, that's an accomplishment. And that yeah, that that game was awesome. I mean it's right up there with uh Tecmo Super Bowl, which is one of my favorites. Um Jim Harbaugh on that was awesome. And uh I mean you pronounce that with a hard G at the end. Harbog. Or Harbage, as he likes to be called.",
    "speaker" : "Mike Melo",
    "timestamp" : "39:52-40:13"
  },
  {
    "speaker" : "Andy",
    "text" : "Even better. Only when he's playing in London.",
    "timestamp" : "40:13-40:16"
  },
  {
    "timestamp" : "40:17-40:37",
    "text" : "That's right. Um but yeah, no, that that that that game was definitely awesome. And I don't know if you remember the um That NFL coaches game that came out for a couple of years where it was like you would coach the team and like it was super weird. And I like the idea of it because I'm a stat nerd, but um it was sort of like that, but you could play the game.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "So it was Yeah, that that game was a great idea, but the execution was horrendous.",
    "timestamp" : "40:37-40:43",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "40:43-40:44",
    "text" : "Yes.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "40:44-40:45",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And I don't know how much of a market there is for that type of game per se, but you know",
    "timestamp" : "40:45-40:50"
  },
  {
    "text" : "And it was a console game and it didn't work. It should have been a pretty game. But yeah, we were so psyched about that. I remember that.",
    "timestamp" : "40:51-40:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "40:57-41:03",
    "text" : "Yeah. So anyways, that Dolphin Stadium. somehow is connected to that.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:03-41:08",
    "text" : "And I don't we finish measuring our NFL nerd bonus."
  },
  {
    "timestamp" : "41:09-41:19",
    "speaker" : "Mike Melo",
    "text" : "Um it is what it is, man. I mean Dan Marino was like my best friend growing up. Wow. I didn't know. And then you. And then you. But sound makes weird."
  },
  {
    "timestamp" : "41:19-41:21",
    "speaker" : "Andy",
    "text" : "Alright. Well, you already did, but that's okay."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I know.",
    "timestamp" : "41:22-41:22"
  },
  {
    "timestamp" : "41:22-41:27",
    "speaker" : "Andy",
    "text" : "Um did you really liked him. Did you happen to catch the uh the Ray Lucas appearance?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, man, I wrote down back up Ray Lucas, which I mean he was on and off starter back up throughout his career.",
    "timestamp" : "41:28-41:33"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah. The poor man's Michael Bishop, I wrote down. Um yeah, they they would bring him in on third and shorts and he would immediately get a false start and they pull him back out again and then put Feather back in to convert the third and long.",
    "timestamp" : "41:33-41:44"
  },
  {
    "timestamp" : "41:45-41:46",
    "speaker" : "Mike Melo",
    "text" : "It's good to see him though."
  },
  {
    "timestamp" : "41:47-41:50",
    "speaker" : "Andy",
    "text" : "Yeah. I I didn't realize he was a former Patriot Ray Lucas."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "41:51-41:55",
    "text" : "Oh, I uh I noticed that in uh he played for the Jets too, right?"
  },
  {
    "speaker" : "Andy",
    "text" : "I think so, yeah, but uh I think what happened was when Because it was in the it was in the one of the paper the articles, I think, if I read it correctly, that um when Bledsa went down, the Patriots Either traded for or signed John Freeze from the Dolphins. And so the Dolphins picked up Ray Lucas because the pages dropped him. um to be their backup.",
    "timestamp" : "41:55-42:21"
  },
  {
    "timestamp" : "42:21-42:25",
    "speaker" : "Mike Melo",
    "text" : "So they basically swap quarterbacks when Where does uh Damon Hewart fit in all that?"
  },
  {
    "text" : "Um Oh no, sorry you're right. Uh John Freeze was on the pages already but they picked up Damon Hewitt. I get those two confused.",
    "timestamp" : "42:26-42:34",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "42:35-42:38",
    "text" : "I don't know why Damon Hewitt five and one starter."
  },
  {
    "timestamp" : "42:39-42:41",
    "speaker" : "Andy",
    "text" : "How is John Freeze as a starter?"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "42:42-42:44",
    "text" : "Um he's two and seventeen."
  },
  {
    "text" : "Wow, you just had that off the top of your head. I love it. Did you make that up?",
    "timestamp" : "42:45-42:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I might have. I don't know.",
    "timestamp" : "42:49-42:52"
  },
  {
    "text" : "I don't even know if it was ever started. No, that was good. I don't know if he ever was, but that was uh that was very well done. Thank you. Um the uh the matchup of this game, I thought, was um Matt Light versus Jason Taylor",
    "timestamp" : "42:52-43:06",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, not much of a matchup, but it was a sort of foreshadowing. I mean, I think uh Matt Light was in over his head and he obviously got tweaked. Um by the end of the game, so that was an issue. But uh it's probably great exposure that early in the season to go up against somebody like that.",
    "timestamp" : "43:07-43:26",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because I I don't think Matt Light even played the first game because he was injured. So this is his third game as a NFL starter. He's growing up against the Jason Taylor in his prime. Yep. Who would eat people alive. And um I did I did notice I think they actually called it out too early in the game where Matt Light was all about finishing the fucking play and he would block Jason Taylor like even after the whistle was done. He's like Trying to set the tone and it it didn't work. Hey, but that's like that's a fellow check attitude right there. It's that attitude is why Matt Light played left tackle for as long as he did. Right. Um, because he just was You kind of need that that mean streak as just like an offensive lineman in general.",
    "timestamp" : "43:26-44:18"
  },
  {
    "text" : "But Right. Which I mean, I wouldn't say that he was like amazing, but he was consistently good throughout his career.",
    "speaker" : "Mike Melo",
    "timestamp" : "44:18-44:25"
  },
  {
    "timestamp" : "44:25-44:43",
    "text" : "Yeah, yeah. Yeah, I mean he was a solid left tackle, similar to um Nate Solder, I think, who would have trouble every once in a while. Um but you could usually count on him to quiet most rushes off that edge. Right. If not shut them down completely.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh, we also failed to talk about Troy Brown's fumble. Yeah, uh that's probably the at least in this stretch of games that we've watched recently, I would say that's his only mistake that I've seen him do.",
    "timestamp" : "44:46-45:09"
  },
  {
    "timestamp" : "45:09-45:27",
    "text" : "Yeah, I I don't think like just literally in general, I don't think I've seen him make any other mistakes. At least not that I can remember, so Yeah, I I think this might we may have actually seen and uncovered the one mistake Troy Brown has ever made.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Let's have a moment of silence.",
    "timestamp" : "45:29-45:31"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:32-45:54",
    "text" : "Well, did you see his quote about it in the paper too? No, in this post game they were uh they were telling him about how um like the about the broadcast getting cut off at the beginning. He's like, uh, did did they uh did they miss my my muff punt? Did did anybody see that? They're like, yeah, no, that it was on by then he's like, oh damn."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's pretty funny.",
    "timestamp" : "45:55-45:56"
  },
  {
    "text" : "Good old Troy Brown.",
    "speaker" : "Andy",
    "timestamp" : "45:56-45:58"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "45:58-46:05",
    "text" : "And I'm not saying that the events were funny. I'm saying that Troy Brown's reaction to his fumble is what's funny. For the record."
  },
  {
    "text" : "Simmered down.",
    "speaker" : "Andy",
    "timestamp" : "46:06-46:06"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Jesus. Um canceled.",
    "timestamp" : "46:07-46:09"
  },
  {
    "text" : "You canceled.",
    "timestamp" : "46:09-46:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Hey. Troy Brown fumbling though at the Patriots two-yard line, no less.",
    "timestamp" : "46:10-46:14"
  },
  {
    "timestamp" : "46:15-46:19",
    "speaker" : "Andy",
    "text" : "Yeah, it was a bad fumble. But it only resulted in a field goal."
  },
  {
    "text" : "Uh and why is that, Andrew? Because they had an amazing, potentially best moment of the game, goal line stand. Yes.",
    "timestamp" : "46:19-46:28",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "I think if they had won it, that would have been the uh the thing you'd see on turning point on another.",
    "timestamp" : "46:29-46:34"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, exactly. I mean it was still early in the game, but With the, you know, the the Frable interception, with the touchdown run, with the goal line stand, this was looking pretty good in the beginning, like you said.",
    "timestamp" : "46:34-46:44"
  },
  {
    "timestamp" : "46:44-46:53",
    "speaker" : "Andy",
    "text" : "Yeah, they would definitely hang in there. Um even but this was right around the time that the um Patriots sideline were having headset issues too. Did you notice that?"
  },
  {
    "text" : "Oh yeah.",
    "timestamp" : "46:53-46:54",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:54-46:57",
    "text" : "And Belichick was livid."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh he was. He was complaining the whole game pretty much, it felt like we're He wanted the other team to remove their headsets. I mean I don't know why why uh that didn't happen though.",
    "timestamp" : "46:57-47:08"
  },
  {
    "timestamp" : "47:08-47:18",
    "speaker" : "Andy",
    "text" : "Yeah, it didn't seem to. And but there was nothing those I I mean obviously we don't have access to the postgame videos or anything. So I mean but there was nothing."
  },
  {
    "text" : "If anybody out there is listening and has access to that, please email.",
    "speaker" : "Mike Melo",
    "timestamp" : "47:18-47:23"
  },
  {
    "text" : "Oh man. I don't know if I need anything else for my spank bank. But yeah, that would be awesome to have. Right. Uh but yeah, I mean in the in the papers there was no mention of it whatsoever. There's no like mention of Belichick even talking about it, which As we know f uh further down the line in this dynasty, that um the opposite would happen quite often, um, usually from Was there ever anybody other than Mike Tomlin that would bitch about it? I feel like he would do it every time he showed up.",
    "timestamp" : "47:23-47:51",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, he's the biggest uh proponent of that whole argument. Um I was thinking though, and this is again Partly sell his soul. You know, you know my views on Belichick. Love them. Very suspicious. Um so uh I was thinking we're friends. I was thinking Could this have been the first time that gave Belichick the idea to really fuck with the headsets? You know what I mean? Because I mean it obviously affected him to the point where he was livid, right? So how funny would it be? And just like now we see Tomman, right? Let's say hypothetically and let's agree that he did. Um fuck with those head headsets intentionally every time. Imagine like Tomlin on the sideline losing his mind and Belichick's not showing like like anything. No his poker face is like on strong And that guy's losing his mind. Inside, that dude is grinning. Uh oh. And you see like the you know, the the the bug-eyed look, you know, the anger just spewing off of Tom Woon's face. That's freaking hilarious. Do you think that it started with this game kind of giving him that idea?",
    "speaker" : "Mike Melo",
    "timestamp" : "47:52-48:56"
  },
  {
    "timestamp" : "48:57-49:26",
    "speaker" : "Andy",
    "text" : "I think here's how far I'll go. I think this game with that happening is one of those things where Belchak adds that to his little piece of paper that he's always scribbling on. Oh right. Of the Yeah, of the of the um of the things they're they're gonna take care of for now until ever. Like it's one of those things that they're gonna be prepared for. It's one of those little things that they prepare for. Right. That's now on the list and that will never happen again."
  },
  {
    "text" : "Would you say it's a cheat sheet or a cheater sheet?",
    "speaker" : "Mike Melo",
    "timestamp" : "49:26-49:28"
  },
  {
    "text" : "A belletheat sheet?",
    "timestamp" : "49:30-49:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Ooh, belly cheat sheet. I like it. I don't know, it's something to table for now, but we can oh man, you know what would be crazy. No, we should tally. How many little things could be considered like in the cheat sheet or cheater sheet, right? Tally them up at the end of the year. each season and then just uh by the end see what the score is on if Belichick is in fact a cheater. That's something that Patriots fans might be interested in. I don't know.",
    "timestamp" : "49:32-50:02"
  },
  {
    "timestamp" : "50:03-50:06",
    "text" : "I think you're right. No they'd love that You're gonna be their favorite person.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I'll uh I'll toss it to uh Steve and Greg and see what they think.",
    "timestamp" : "50:07-50:10"
  },
  {
    "timestamp" : "50:10-50:31",
    "speaker" : "Andy",
    "text" : "Oh Steve will definitely be all about that. He loves being hated Alright, so we've blamed the um page going behind on the muff punt and the um headsets. So not their fault, even though they had the uh the the defensive holds on the goal line."
  },
  {
    "text" : "Right.",
    "timestamp" : "50:32-50:32",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Um so then I think the I think it was the ensuing drive. Patriots are moving the ball again. Um I don't know if you saw this, but there was one play, I think it's like a third and four-ish, like near midfield. Brady goes on a bootleg and there's a rusher right in his face immediately, so he just takes off upfield. Yes. And goes for the slide and gets lit the fuck up. Like forearm right to like right across the eyebrows.",
    "timestamp" : "50:34-51:02"
  },
  {
    "timestamp" : "51:02-51:22",
    "speaker" : "Mike Melo",
    "text" : "This is one of my best moments of the game. And not because he got lit up, but Yeah, no, that's uh bad timing on my part. But he's gonna say, yeah. Yeah, and he just gets in the face of Walker, I believe it was, and he's just like Yeah, picture a guy like his what second start, just like getting up and just going on a top."
  },
  {
    "text" : "Poking him in the chest, screaming at him. That was a good move. It was, yeah. But I mean that's the that's the old school Brady that you kinda remember that, that fire in his belly. Just like not gonna take shit from me. He doesn't care who the fuck that is. He just gets up. He's like how the f how dare you try to hit me in the head, try to take my head off when I'm sliding. And he didn't even get the call for it.",
    "speaker" : "Andy",
    "timestamp" : "51:23-51:48"
  },
  {
    "timestamp" : "51:48-51:51",
    "text" : "No, yeah, I know. It was a lot more lax back then. Yeah.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "You could say that.",
    "timestamp" : "51:52-51:53",
    "speaker" : "Andy"
  },
  {
    "text" : "Which also like I also made a note. Were the uh shoulder pads bigger back then? I know we've talked about a protocol like shit Dude, or was everybody like on steroids? And I know that in the 70s everybody was. So maybe everybody was in the the freaking early two thousands. I don't know. But they were massive people running around that field.",
    "speaker" : "Mike Melo",
    "timestamp" : "51:53-52:08"
  },
  {
    "speaker" : "Andy",
    "text" : "So how do all right, I had something slightly different than that. There was some story this year about how Brady has been wearing the same shoulder pads since like high school or college, wherever it was.",
    "timestamp" : "52:09-52:22"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah. Michigan.",
    "timestamp" : "52:23-52:23"
  },
  {
    "timestamp" : "52:24-52:36",
    "speaker" : "Andy",
    "text" : "But you look at shots of him on the sideline of these games. And his shoulder pads are like six inches out past like corner of his arms. Okay. There's no way they're the same shoulder pads unless they just have shirts that fit differently or something"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, I don't know. Everybody's looking like a jacked up monster out there.",
    "timestamp" : "52:36-52:39"
  },
  {
    "text" : "Yeah, they do. They look like um basically what the uh guys in the black hole at Raiders games wish they looked like. Right, yeah. like extra l large shoulder pads sticking out.",
    "speaker" : "Andy",
    "timestamp" : "52:39-52:54"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, I just thought that was funny. Uh which um I also wrote down, uh, because you had mentioned it uh before we got on here, but we can tie it into the steroid talk. But uh do it. Uh uh on this day, I believe Barry Bonza also broke the uh the home run record.",
    "timestamp" : "52:54-53:13"
  },
  {
    "text" : "Yes. Yeah. Um the San Mateo alum.",
    "speaker" : "Andy",
    "timestamp" : "53:13-53:17"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's all right. That's all right. One and the same. Yeah. Um so I vaguely remember, I mean, because I believe we yeah, we were in high school. I remember this uh this happening. Uh we would uh kind of play pickup football games and kind of romanticize this whole like home run thing. Everyone would kind of like be talking about it week after week. And then obviously the steroid stuff came out and that whole era was tainted. Um and uh, you know, looking at these guys, I'm pretty sure A lot of these guys were on something throughout football. I mean, uh obviously now it's HGH or whatever, but and guys are running faster, but they were pretty jacked back then. So what are your thoughts on steroid use?",
    "timestamp" : "53:17-54:04"
  },
  {
    "text" : "Um I think that I agree with you. I think there were a lot of people on steroids. I think um football as a game back then. They would uh was just a game for bigger people in general. There wasn't as much a focus on speed as there was on size in hitting um because it was more run first the the offense and the rules of the league hadn't been tailored towards the passing game yet. Right. And so I'm sure there were pressures on getting bigger than the guy across from you on the field. Um but yeah, and I think also the equipment probably played into that too. Like you're talking about like these massive shoulder pads and kind of baggier jerseys as well. Yep. This makes everybody look like um A bit like a Frankenstein costume, you know.",
    "timestamp" : "54:04-54:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Now I'll I'll toss this out to you because I mean I'll go on the record, and this is a hot take. I'll go on the record as saying that steroid abuse is extremely bad for your body. It's poor sportsmanship for those that are not on steroids. It's not a level playing field. And You know, obviously if you're doing that and you're getting an advantage, I mean, I wouldn't necessarily feel like I'm the better person or the better athlete because obviously I'm assisted, but You've like you said, other people were taking it too, and so how do you compete with those people is the question. Um but so Barry Bonds, and I've thought about this, and it's sort of like everyone likes to play the safe answer, um, which is fine. Safe is keeps you alive for the most part. But um Barry Bonds was he was a household name and he was great. You know, he was uh uh probably gonna be considered a great after he was done. But I would say that once the steroid use started happening, he became a very much a household name. uh nationwide and he became a star, right? So he broke this record. Um for the rest of his career, I mean he became the type that was feared and they would walk them every time. It was like this whole like war that was being created around this guy. And You know, whatever, it came out. Um, same thing with a lot of these guys, you know, Clemens and whatever. Um and now they're like the pariah of society, you know, Lance Armstrong, um, all that stuff. Uh, which of course Lance Armstrong, I mean, it seemed a little iffy that the guy would be so dominant with no peers, but um We all want to do that. Well, so you're saying he has to compensate for that, which I I it's his choice. I have no idea.",
    "timestamp" : "54:59-56:47"
  },
  {
    "speaker" : "Andy",
    "text" : "I just made it more streamlined, that's all.",
    "timestamp" : "56:47-56:49"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right, exactly. So he's leveling the playing field by doing that. He was at a disadvantage and he was being humble and slightly uh scared to to re reveal that information for being judged. But anyway, so um all these guys, so um people love heroes, right? They love larger than life characters, they love big numbers. Um Hopefully people like Brady and Mahomes are clean and like we can kind of cherish them as their careers are over. But um But yeah, so these guys are like cartoon characters or superheroes where they're a little bit different than everybody else. And so we praise them and then when we find out all this stuff, it crumbles, right? And then they become pariahs and we like shit on them. But we sort of had a hand in it because we wanted it so badly, right? Um so my question to you is so Barry Bonds now and Clemens and all those guys, they're starting to be talked about Hall of Fame and all that stuff, and people are coming around to them because of the era, right? So as with time, everything sort of gets rewritten slightly. Um So he might be in the Hall of Fame he'd be beloved one day. Would you, as Barry Bonds, right? Actually, no, as Andy Brown. Fucking Barry Bonds. Andy Brown, you're you start off on the Pirates, you end up being on the Red Sox, right? We'll change history a little bit. Um and your You're on the you're just about to become like David Ortiz, right? Um and I I don't know what the deal is with that guy. Things have been tossed around, never proven, whatever. I just bring him up because he's the most recent Red Sox hero. So um basically I'm stalling here, but what I want to ask is Would you, knowing that you're gonna be one of the greats, take steroids, knowing that it'll also increase your brand and probably give you a shit ton of money Um and it would guarantee that you would be one of the greats and then whatever happens after happens. Or would you play it safe, play by the book, knowing that other people do this, and then just be a good player that's eventually forgotten?",
    "timestamp" : "56:49-58:56"
  },
  {
    "timestamp" : "58:57-59:02",
    "speaker" : "Andy",
    "text" : "I would probably do steroids if I knew it would make me the greatest."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Okay, so it has to have that stipulation.",
    "timestamp" : "59:03-59:05"
  },
  {
    "text" : "I think so. So I think uh but I think that's why everybody does them.",
    "timestamp" : "59:05-59:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. So but I mean y you would have to have that thought if you were gonna start doing it. So let's say you're one of these guys where you have your ego sort of plays into that realm because that's your That's your industry, right? I mean, yeah. Okay. Yeah. So if you if you thought like somebody sold it on you and was like, yeah, man, like you'll you'll knock out over 70 home runs or whatever it is, whatever sport. Um, you think you might consider it if it would bring you to the next level?",
    "timestamp" : "59:10-59:41"
  },
  {
    "timestamp" : "59:42-59:44",
    "speaker" : "Speaker 4",
    "text" : "Yeah. I think a lot of people would."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "59:44-01:00:31",
    "text" : "I I think so too. I'm like, it's not black and white, man. Like That's a very complex issue. And like I understand it breaks down your body, and I'm not condoning it as well, but I I also understand what thought process these guys had, and some of them didn't even know really what was going on. Um, you know, as silly as that sounds. Um, I believe some of that. So how can we as a society then condemn these people to the point where they like they should be in jail for twenty years for destroying the the uh integrity of the game when it's like, hey, it's his choice, you know, yes it is cheating. Yeah, he should be banned from the the the sport maybe, or maybe not be in the record box. How can we condemn a guy who's like trying to compete and be known as one of the greats? I think that's very black and white thinking. I don't know."
  },
  {
    "text" : "It is, and I think there are people who just think in black and white and it's either right or it's wrong, and if it's wrong, then you should be condemned. I'm not one of those people I think. Um I and I I have less of a problem with steroids and that sort of stuff in football because of how violent a sport it is. And it seems like A lot of the guys, at least nowadays that are getting caught using it, are ones who are doing it to come back from injury more.",
    "timestamp" : "01:00:31-01:00:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. Are you alluding to like Edelman and things like that?",
    "timestamp" : "01:00:59-01:01:03"
  },
  {
    "text" : "Oh yeah. Well I was thinking about Rodney Harrison, but yeah, Edelman and those sorts. And I um I'm assuming there have been other people. I mean like Adrian Peterson blew out his whatever it was, his ACL or something. Yeah. And was back within like some ridiculous time. Or even uh Saquon Barkley recently had a high ankle sprain which was supposed to put you out for six weeks and he was back in like two",
    "timestamp" : "01:01:03-01:01:25",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, no, and then people wonder, they're like, oh, they're superhuman. It's like, I don't think it works that way. No. Well, and even like We'll we'll joke about like Peyton Manning and I don't know if he has taken HGH or not, but if the guy has a neck injury and he can barely f feel his fingertips and he's doing whatever he can to keep playing the game, I'm not condoning that again because you know, whatever he's doing to his body is his choice. But I and I also don't condone it because not everybody is able to be on it. Like if it was made available, that's a different thing, but I can't like hate the guy for wanting to continue playing the game.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:01:25-01:02:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly.",
    "timestamp" : "01:02:03-01:02:04"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I can make fun of him all day long because it's funny.",
    "timestamp" : "01:02:04-01:02:06"
  },
  {
    "timestamp" : "01:02:07-01:02:10",
    "text" : "Yeah, especially because of the size that it made his forehead.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well, and I don't know if it did anything for his face, but the manning face is still one of the greatest ever.",
    "timestamp" : "01:02:10-01:02:15"
  },
  {
    "timestamp" : "01:02:15-01:02:25",
    "text" : "And you know obviously pure genetics, bro. Yeah, and then like I don't think anyone's gonna accuse Eli Manning of doing steroids, but they have the exact same face.",
    "speaker" : "Andy"
  },
  {
    "text" : "That's true. His is slightly different. There are nuances. But uh But I'm like, yeah, and the storyline is just made funnier because like, yeah, supposedly his wife got it and all this other stuff. And like, yada yada yada. The point is, is that It's funny, I think, because of the situation, how ridiculous that it is. It's not funny because of how damaging it is to your body and that you're cheating, but I feel like they're not to my knowledge, killing anybody or whatever. So I think it's a little uh harsh to condemn a person. Again, tick kick them out of the league, do whatever, but um You know, I can understand reasons why people might or might not want to do that. Yeah, I agree. On that note. Barry Bonds. Barry Bonds, yeah. Exactly. But David Ortiz. Castrate that motherfucker.",
    "timestamp" : "01:02:25-01:03:18",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Get him out of him. Yeah, I do I I think um Going back to just like the look and feel of these like players these I I thought the other great thing about old school football were the face masks. Oh yeah. They were just so badass. I don't know what it was about him, but like like the tie-law with the two like bars kind of like on the outside of his eye line. Mm-hmm. Like coming down like the vertical ones. For some reason, like every time I create my player in Madden, I'm like I have to have the Ty Law helmet.",
    "speaker" : "Andy",
    "timestamp" : "01:03:18-01:03:54"
  },
  {
    "text" : "Oh yeah, it's all about the accessories, man.",
    "timestamp" : "01:03:54-01:03:56",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:03:56-01:04:08",
    "speaker" : "Andy",
    "text" : "Oh man, that was so great. Or even the um Like the one with the running backs where it's like a regular one, but like the the middle bar had like two bars across it. Yeah. Little dip across like in between the eyes at the top."
  },
  {
    "text" : "Yep.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:04:08-01:04:08"
  },
  {
    "text" : "Oh my god. Oh yeah. But or Lindo Mares, who was a kicker who had like the the top of the bar kind of like went up a bit so it looked like he was raising his eyebrows in a quizzical fashion. But He always like he wears he puts a helmet on and all of a sudden like immediate looks confused.",
    "timestamp" : "01:04:09-01:04:29",
    "speaker" : "Andy"
  },
  {
    "text" : "Right. Which is help is is a great tactic.",
    "timestamp" : "01:04:29-01:04:32",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Especially since he never missed a field goal.",
    "timestamp" : "01:04:33-01:04:35"
  },
  {
    "timestamp" : "01:04:35-01:04:36",
    "speaker" : "Mike Melo",
    "text" : "Right."
  },
  {
    "text" : "He was just he is he is uh underselling people. So speaking of football. Um so I I we kinda talked about the first half, um, and it was decent. Um, but then the second half happened. And I think it was the third quarter, especially where the wheels fell off because it was Seventeen ten right at the end of the half. Patrice Paters got the ball back um to start the the second half",
    "timestamp" : "01:04:36-01:05:08",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:05:08-01:05:14",
    "text" : "Well can I talk about how the uh the second half ended? I believe this is how it ended."
  },
  {
    "text" : "Second half ended?",
    "timestamp" : "01:05:15-01:05:15",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:16-01:05:27",
    "text" : "I mean the uh the first half, second quarter. Sorry, came through. I'm trying to read and talk the same time. Not all of us can do that. I'm sorry. Not very well apparently. Thank you for calling me out.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "You're welcome, you illiterate fuck. Alright. So tell tell me about the end of the first half, the second quarter.",
    "timestamp" : "01:05:27-01:05:33"
  },
  {
    "timestamp" : "01:05:33-01:06:26",
    "speaker" : "Mike Melo",
    "text" : "Um And I'm hoping that this is because the notes are in chronological order, not because I ran out of space. But um uh I I recall a Hail Mary attempt at the uh right before the the the halftime. And uh Brady was chucking it, right? And so the uh the commentators were sort of talking about like, can you you know what what's the strategy or whatever? And You know, he drops back to pass and Jason Taylor sacks Brady, which I I wrote down, you don't often see that. It's sort of like a pre-vent defense with a couple of rushers. And you know, the quarterbacks running around. So Jason Taylor lit him up and that was before what you were going to talk about in the s the the second half of the game where things just started to fall off. So I I feel like that was an indication of how things would continue."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it was the um uh what are they what do they call that in literary terms where you show the gun in the first scene that and you have to use it. Foreshadowing It's something like that, yeah. But there's like a it's like a a smoking gun rule or something like that.",
    "timestamp" : "01:06:26-01:06:39"
  },
  {
    "text" : "Oh, I don't know. You are very good at English, you tell me.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:06:39-01:06:42"
  },
  {
    "text" : "Apparently. Well apparently not that good because I don't remember what it's called, but",
    "timestamp" : "01:06:43-01:06:46",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:06:46-01:06:52",
    "text" : "Yeah, that uh we can make you sound smarter. That's a lot of editing.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Okay. Uh but yeah, I think foreshadowing is a good way of putting it where um the defensive pressure is an issue for this offense right now. Um And I always remember that against Miami. And it wasn't always just Jason Taylor. It was just like Miami defenses in general. But I think even like more than that, it was AFC East defenses in general. Because I think when a new coach would come in or a new GM or whatever will come into the AFC East. The immediate like first step is to build a team that beats Patriots and The number one way of beating the patients, stopping Tom Brady. Number one way of stopping Tom Brady is being able to get to him without blitzing. So over the years I know there's been a bunch of arguments about how none of these AFC E's teams have ever had a decent quarterback, but I think it's because they always started building with that defensive line and they were always like monsters.",
    "timestamp" : "01:06:52-01:08:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:08:01-01:08:01",
    "speaker" : "Speaker 4",
    "text" : "Right."
  },
  {
    "text" : "Like the Jets always had great defensive linemen. Dolphins, Bills always had these like absolute like Just guys that would wreak havoc. So I actually looked it up to find out like who had the most sacks Against the Patriots? So I'll give you the top ten. Actually, I want to see if you can guess I want to see if you can guess number one.",
    "timestamp" : "01:08:01-01:08:26",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Number one, linemen?",
    "timestamp" : "01:08:28-01:08:30"
  },
  {
    "timestamp" : "01:08:31-01:08:34",
    "text" : "Um yes, they are all linemen.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Um and they're NFL wide or division?",
    "timestamp" : "01:08:35-01:08:39"
  },
  {
    "timestamp" : "01:08:40-01:08:41",
    "speaker" : "Andy",
    "text" : "NFL wide."
  },
  {
    "timestamp" : "01:08:41-01:08:56",
    "text" : "NFL wide. I mean the top one has to be within the division because just by frequency alone, I would think. So I would say I have no idea, man. I mean, John Abraham comes to mind. He's on the list. Okay.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "He's number nine with six sacks.",
    "timestamp" : "01:08:56-01:08:58"
  },
  {
    "text" : "Ooh. Ooh. I mean, uh we could go uh Jason Taylor on that one.",
    "timestamp" : "01:08:58-01:09:04",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:09:04-01:09:08",
    "text" : "Number two. Tie every second with twelve. Oh, no kidding."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Um I would say I'd I mean that's it. I'm out.",
    "timestamp" : "01:09:09-01:09:13"
  },
  {
    "text" : "Technically it is uh Aaron Schobel. Remember him from the Bills?",
    "speaker" : "Andy",
    "timestamp" : "01:09:14-01:09:18"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh yeah. Now I remember I would not have guessed that one. That's number one. Yes.",
    "timestamp" : "01:09:19-01:09:23"
  },
  {
    "speaker" : "Andy",
    "text" : "He technically had 14 sacks, although two of them were half sacks, so",
    "timestamp" : "01:09:23-01:09:27"
  },
  {
    "text" : "Or if you're going to have to do that, ever brought this to his attention?",
    "speaker" : "Mike Melo",
    "timestamp" : "01:09:27-01:09:30"
  },
  {
    "timestamp" : "01:09:31-01:09:56",
    "text" : "I believe so. I think we tweet Aaron Schobel. I guarantee I guarantee he knows that stat. Okay. Uh the Jason Taylor, Joey Porter. Um Who uh Joey Porter, Steelers obviously also played for the Dolphins. Uh Sean Ellis for the Jets. Oh yeah, yeah. And then Cameron Wake for the Dolphins.",
    "speaker" : "Andy"
  },
  {
    "text" : "So I feel that.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:09:56-01:09:58"
  },
  {
    "text" : "Of the top five, three of those were Dolphins defensive linemen. Nice. Uh then it gets a bit interesting. Uh number six, Von Miller for the Broncos.",
    "timestamp" : "01:09:58-01:10:08",
    "speaker" : "Andy"
  },
  {
    "text" : "I can see that. Is that is he alignment though?",
    "timestamp" : "01:10:09-01:10:11",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:10:11-01:10:17",
    "speaker" : "Andy",
    "text" : "He's like a linebacker h hybrids."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh, gotcha.",
    "timestamp" : "01:10:17-01:10:18"
  },
  {
    "timestamp" : "01:10:18-01:10:22",
    "text" : "But yeah, I think And then it's uh Kyle Williams for the Bills.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yep.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:10:23-01:10:23"
  },
  {
    "text" : "Surprisingly. Uh Robert Mathis from the Colts, of course. John Abraham from the Jets, like we said, and then at number 10, Justin Tuck from the Giants.",
    "timestamp" : "01:10:23-01:10:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Ooh. There we go. But is that including uh playoffs?",
    "timestamp" : "01:10:33-01:10:39"
  },
  {
    "text" : "Uh I believe so, yes.",
    "timestamp" : "01:10:40-01:10:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:10:42-01:10:44",
    "text" : "That makes sense unfortunately"
  },
  {
    "speaker" : "Andy",
    "text" : "But yeah, so of the six hundred and thirty-one sacks that have happened since two thousand one against you know Patriots quarterback in general, so not all Tom Brady, but the vast majority of them are. Uh a third of those have come from the AFC East. So like a dangly large percentage.",
    "timestamp" : "01:10:44-01:11:01"
  },
  {
    "timestamp" : "01:11:02-01:11:05",
    "speaker" : "Mike Melo",
    "text" : "Man, so how many was that? Six hundred and something?"
  },
  {
    "timestamp" : "01:11:05-01:11:06",
    "speaker" : "Andy",
    "text" : "Six hundred and thirty-one."
  },
  {
    "timestamp" : "01:11:07-01:11:11",
    "speaker" : "Mike Melo",
    "text" : "Don't they say that each tackle or sack is like like a car accident?"
  },
  {
    "text" : "Uh yeah, I think so.",
    "timestamp" : "01:11:11-01:11:12",
    "speaker" : "Andy"
  },
  {
    "text" : "So Brady's potentially been in 600 plus car accidents.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:11:13-01:11:18"
  },
  {
    "text" : "Yeah, give or take.",
    "timestamp" : "01:11:18-01:11:19",
    "speaker" : "Andy"
  },
  {
    "text" : "That's fucked up.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:11:19-01:11:20"
  },
  {
    "timestamp" : "01:11:20-01:12:07",
    "speaker" : "Andy",
    "text" : "And of those, 214 were from the AFC East. Yeah. So I mean this is this is why I think when you think about Patriots divisional games You think of like these slug fests and you know Brady having to overcome some sort of stout defense too that's custom built to to prevent him doing what he wants to do comfortably. So it's almost uh even more impressive what he's been able to do against that. I mean there's a lot of sacks uh by the Bills, but Not very many wins. I think well they've beaten them three."
  },
  {
    "text" : "Well I mean it's also the dink and dunk thing that people love to praise and bash. You know, at the same time, but I mean, how do you adapt to something like that? You figure out a different way to do it. Right. Which is not necessarily West Coast. I mean, they do their own thing, but you take benefits of each system.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:12:07-01:12:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:12:23-01:12:33",
    "text" : "Yeah, that that getting that pressure with your your defensive line without blitzing and then being able to play coverage behind that should prevent any sort of dinking and dunking."
  },
  {
    "text" : "Right. Shane Perrin and all those guys come and Falk like uh James Wayne. I think yeah, Bill Belichick sort of figure that out, I think, pretty early on. So I mean it kind of makes sense because you have the the tight ends in the middle, the the wide receivers in the back. But, you know, you still have these like monsters kind of like rushing. So you have the running back either blocking or going out for like a short two yarder that could potentially be a twenty yarder Right. So it makes sense based on like how you're saying.",
    "timestamp" : "01:12:34-01:13:07",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, it shows you the value of uh Gronkowski as well in this offense where he can either stay in block or Good old Bronx.",
    "timestamp" : "01:13:08-01:13:15",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:13:17-01:13:22",
    "text" : "If they would only legalize CBD oil, he would be back."
  },
  {
    "speaker" : "Andy",
    "text" : "That's all it takes.",
    "timestamp" : "01:13:22-01:13:23"
  },
  {
    "timestamp" : "01:13:23-01:13:24",
    "speaker" : "Mike Melo",
    "text" : "Right."
  },
  {
    "text" : "So yeah, um so we've kind of been alluding to this too, um, with talk about Brady getting sacked and pressure and stuff. And um The actual turning point in this game, I think, was the fumble, which is not something I've I've seen before, because I mean do you want to talk through this or do you want me to do it?",
    "speaker" : "Andy",
    "timestamp" : "01:13:25-01:13:49"
  },
  {
    "text" : "Go for it.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:13:49-01:13:49"
  },
  {
    "timestamp" : "01:13:50-01:15:03",
    "speaker" : "Andy",
    "text" : "Because the the I I think the play by play of this is fantastic because what happens is Brady's he's actually under center. It's not like it was a shotgun staff or anything, but he Mishandles the snap and the ball falls like to his right onto the ground. And the right guard is going back in pass protection, so he takes a step back and the ball falls perfectly Where the I think it's the left foot of the right guard backheels the football like to a point where I think some soccer players would be jealous, just the way that he hit it, how square it was. He caught it dead on and kicked it ten yards directly backwards. And the only people that knew what was happening was Tom Brady and any dolphins. Pass rushers. And these pass rushers had a seven-yard head start on Brady getting up the field. Because Brady still hadn't seen what happened to this ball getting kicked backwards. Yeah. So Jason Taylor, yeah, Jason Taylor picked it up at the one. uncontested and took two steps and was then celebrating a touchdown. And so it went from being uh a seven point game being down uh 1710 to being down 2410."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "and it all went down from there",
    "timestamp" : "01:15:04-01:15:07"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, because now you're a one-dimensional offense and you are starting a quarterback in his second game against uh the pass rushing phenom of this Dolphins defensive line. And the results were pretty predictable.",
    "timestamp" : "01:15:07-01:15:22"
  },
  {
    "timestamp" : "01:15:23-01:15:56",
    "speaker" : "Mike Melo",
    "text" : "Well I mean Brady, uh what I liked about um the the the last minute or so of the game was that the announcers were kind of like touching on this where Belichick wasn't giving up. He was forcing Brady to kind of run his, you know, no huddle or two minute offense or whatever, the hurry up, you know. Uh I don't know if they were huddling or not, but I know there was like some sort of um uh what's the word? Desperation to get him a touchdown. Yeah. And you know, they didn't get that. It actually ended up with uh Brady fumbling again to end the game."
  },
  {
    "timestamp" : "01:15:56-01:16:11",
    "text" : "Yeah, getting stripsacked. Yeah, to end the game. Which was literally right after the announcers had praised Belichick for keeping Brady in to to run this and get him the experience. And that happened and I thought, well, there's some experience for you. You will find it's right.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:16:11-01:16:18",
    "speaker" : "Mike Melo",
    "text" : "But then also on that drive, I thought it was interesting because they ran a fake snap to Brady um that went to Kevin Falk and like a direct snap."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that was the the first one that you'd seen. of that play.",
    "timestamp" : "01:16:18-01:16:22"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, where Brady like pretends to like, you know, be chasing it and like the scale.",
    "timestamp" : "01:16:23-01:16:26"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:16:27-01:16:32",
    "text" : "Yeah, like the ball goes over his head and he jumps in like flails for it and Kevin Fawkes two steps to his right."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "So I thought that was an interesting wrinkle, more of the Belichick stuff where he's like, you know, there's thirty seconds left in the game, most people would waste this. Oh, let's throw something out there so people like know that that's there.",
    "timestamp" : "01:16:31-01:16:41"
  },
  {
    "speaker" : "Andy",
    "text" : "Let's just try it and see if it works. Right. Game situations and it did. It got seven or eight yards, I think, which you know the time didn't really mean anything, but you knew it worked. Um and they like I actually wrote a whole blog post about that play in particular where they've kind of brought it back a bunch of different times. Oftentimes like when they actually really needed a score for like um two-point conversions and things like that. Yeah, that was a go-to. In the um the playoff game against the the charge that they shouldn't have won. Right. But then I think it was in 07, they did the uh like an offshoot of it where they actually snapped the ball to Brady and caught it and pretended to jump. over his hand and Kevin Falk pretended to take I don't even think it was Kevin I may not have even been Kevin Falk at that point but pretended to do the direct snap and it was almost like a um Statue of Liberty play, where Brady still had the ball with his back turned to the defense for like a good second. And he pulled it out, turned around, and threw a touchdown to uh, I believe it was Welker at the time. So they kind of like they've continued to iterate over it. But you even saw it as recently as um the Falcon Super Bowl. But it did that was that on a two-point conversion as well? Didn't that come back? It was either a a short touchdown or a two-point conversion. I can't remember. I think it was a two-point conversion.",
    "timestamp" : "01:16:42-01:18:09"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well, and then I also feel like on on top of that, their other go-to now is sort of that like little push pass or like shovel pass that like Brady does to like whoever's running across. So I between those two plays, I think I've seen those two the most.",
    "timestamp" : "01:18:09-01:18:22"
  },
  {
    "timestamp" : "01:18:22-01:18:43",
    "text" : "Yeah. Um that and almost like the real fast screen play, which is the other play they did for the two-point conversion in the Falcon Super Bowl. Where they throw it to like uh either Amendola or Edelman, like out of the bunch. Like it's immediate snap and chuck it to him, then the two guys in front of him block and he just like dives through those two.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. Um yeah, but overall, I mean I wrote down Brady's numbers. He was 12 for 24, so at 50%, 86 yards passing, two fumbles. Um and you know we laugh at the sports writers because they're bolt tapes you know but four sacks, 47 yards rushing by Antoine Smith, everyone pretty much crapped on this one. It was But I mean if if b Bletzo was like ready to come back the next week, I think there would be some sort of like thought process going there on like which way to go. But yeah, because there was a little bit more time. And I think now, especially nowadays, man, you get a backup and he has a performance like that, I think he's pretty much done.",
    "timestamp" : "01:18:43-01:19:27"
  },
  {
    "text" : "So you're kind of toast.",
    "timestamp" : "01:19:27-01:19:29",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, so I think it was the perfect storm for Brady to kind of lick his wounds. And you know, he after the game he responded pretty well, you know, still very confident, talking about practicing and all that stuff. So",
    "speaker" : "Mike Melo",
    "timestamp" : "01:19:29-01:19:40"
  },
  {
    "text" : "about uh yeah who they interview I think it was uh Lloyd Malloy that they were interviewing and he's talking about how Brady come to him at practice on Wednesday and been like, dude, like practice Like we're we're we're doing terribly in practice, but I'm the backup, so I don't like have the ability to like call this out. So I'm coming to you as the captain to like Call us out that we're practicing like shit. So you can get us to get our shit together.",
    "timestamp" : "01:19:42-01:20:08",
    "speaker" : "Andy"
  },
  {
    "text" : "That's how you do it. Yeah. You delegate when necessary.",
    "timestamp" : "01:20:08-01:20:12",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but I've said this is probably the only game of football that I can recall where neither quarterback threw for a hundred yards.",
    "timestamp" : "01:20:12-01:20:19"
  },
  {
    "timestamp" : "01:20:19-01:20:43",
    "speaker" : "Mike Melo",
    "text" : "Yeah, I mean it was um pretty uh really bad. Pretty rough to watch, I gotta admit, but I guess. I mean I was kind of you know, I had my eye on the fast forward button a couple of times, but uh but you know, we're here bringing it to anyone who is listening so that they can hear our bullshit, but not necessarily watch this disaster. Um yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "But one thing we have, oh go ahead. This would be a this would be a skip.",
    "timestamp" : "01:20:43-01:20:47"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yes, uh if you're following it. I would definitely not watch this one. But there are certain takeaways that are pretty good. But One thing we haven't talked about that we've talked about every other time were the announcers. And for me, a part of the fun of looking back at these games is sort of what's being said. Because I mean You just see how society sort of changes and things evolve and like what people would consider acceptable and what they uh understand to not be acceptable now. Um but you know I have a bunch of stuff written down from uh uh it was Gus Johnson and Brent Jones again. Yep. And uh I don't mind them Me neither, but Brent Jones is like I think he wants to be if he knew like how Tony Romo would be, I think he wants to be that because I think t Tony Romo's fantastic. He's like real and you know he's honest with his opinions, he's funny.",
    "timestamp" : "01:20:47-01:21:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:41-01:21:45",
    "text" : "He's excited to be watching the game. He's excited whatever game it is."
  },
  {
    "text" : "Yeah, he's got the players uh, you know, side of things, but he's also a goofball, right? So Brent Jones is a goofball, but I think he's like highly uncomfortable in like funny ways now looking back. I don't think this guy would have a job for two weeks um today. Not doing this. I don't know what he's doing now. Maybe you might still be doing this, but probably. I can't imagine though. So Can you look at the biggest thing? So what's making you say this? Alright, man. First of all, um the first thing that I I got of this game, which is like basic, basic like comedy, I feel like, and this guy's shitting himself. But Um they were talking about how you know it was hot on the field, this is right to start off the game, and uh Then that they show it they cut away to a cheerleader, and the cheerleader, you know, has got this bit where she's holding a thermometer and it's like 120 degrees, whatever. And let's see, it wasn't even that Funny, but what do you see? So Brent Jones, he goes, uh, you know, that is hot down there. And he's like shitting himself. And I'm sitting there going, what the fuck? And then like Um Gus, he goes, oh well, I have enough savvy to not comment on that. And then Brent goes, I think my career is over. So even then he knew that that was like inappropriate. And the guy's like falling over himself for literally two more plays.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:21:45-01:23:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it wasn't good, but yeah, he he was cracking himself up over that one. He loved it.",
    "timestamp" : "01:23:08-01:23:14"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I I it was hilarious. Another comment. Um Brent Jones goes, Mark Edwards, great hands for a fullback. And then Gus goes, really? And I was like, what does that mean? What kind of like response is that? And then another personal favorite of mine, uh, Gus, we were out on the practice uh field on Friday. It was so hot, we were standing around and almost fell out. And then Brent Jones goes, don't say we. What the fuck, man?",
    "timestamp" : "01:23:14-01:23:49"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:23:49-01:23:51",
    "text" : "And now fucking hard out."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:23:52-01:24:12",
    "text" : "This also brings me to sweat with the best of them. He said some shit that I assume are football terms, but I'm not as savvy as you are, Andy. So I wrote these things down, and maybe you can enlighten me on what the hell he was talking about. And I assume that they're football related. Um the first one is Herkinjerk."
  },
  {
    "timestamp" : "01:24:15-01:24:26",
    "speaker" : "Andy",
    "text" : "Um Is it I I don't know if that's a real football term. I thought that was more like a weightlifting term. Don't they have like a clean jerk and uh Or something like that."
  },
  {
    "text" : "And a Herkin jerk?",
    "timestamp" : "01:24:27-01:24:28",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:24:28-01:24:31",
    "speaker" : "Andy",
    "text" : "What is a Herkin jerk? I don't know. It sounds painful, doesn't it?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "It sounds like a technique for sure.",
    "timestamp" : "01:24:32-01:24:35"
  },
  {
    "text" : "Yeah. He may have made that one up.",
    "timestamp" : "01:24:35-01:24:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:24:38-01:24:47",
    "text" : "Okay, so are you gonna go not not football on this one? Yeah. Alright, so the next one, delivering the wood."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that's definitely a thing, yeah.",
    "timestamp" : "01:24:48-01:24:49"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:24:50-01:24:50",
    "text" : "What is that?"
  },
  {
    "text" : "That means laying a big hit.",
    "timestamp" : "01:24:51-01:24:52",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:24:52-01:24:56",
    "speaker" : "Mike Melo",
    "text" : "Laying a big hit, so it doesn't it means it's a football thing."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:24:56-01:25:05",
    "text" : "Yeah. Okay. It's like hitting somebody in the face with two by four. That sort of delivery in the wood. Not like not like showing up with a pickup truck full of um firewood."
  },
  {
    "text" : "It's not that sort of delivery. Right. Just like Two by four across the head. Got it.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:25:05-01:25:09"
  },
  {
    "timestamp" : "01:25:09-01:25:09",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "Um looking for gaping holes.",
    "timestamp" : "01:25:10-01:25:13",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Uh so uh that's a good segue to the one that I wrote down.",
    "speaker" : "Andy",
    "timestamp" : "01:25:17-01:25:21"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:25:22-01:25:24",
    "text" : "Okay. I still want to know, but go on."
  },
  {
    "timestamp" : "01:25:25-01:25:31",
    "speaker" : "Andy",
    "text" : "Um Brent Jones, these holes are tight with the Patriots. You have to keep pounding at them."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:25:31-01:25:38",
    "text" : "See, he's good with it. What is that? What is the gaping holes pounding the holes mean for those that don't know, including myself?"
  },
  {
    "speaker" : "Andy",
    "text" : "Um, I I believe that's um talking about the running game where uh you want the offensive lineman to open up holes.",
    "timestamp" : "01:25:38-01:25:46"
  },
  {
    "timestamp" : "01:25:47-01:25:47",
    "speaker" : "Mike Melo",
    "text" : "Oh, okay."
  },
  {
    "timestamp" : "01:25:47-01:25:59",
    "speaker" : "Andy",
    "text" : "So the defensive looking for the gaping holes. So yeah, a a bigger hole is better in this term. Gaping. Whereas um if the the holes are tight, like they are with the Patriots, you have to keep pounding them so that they become gaping."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Gotcha. Okay, so that's a football term. Yes. Okay. And then um so then there was take your crack or give it away.",
    "timestamp" : "01:25:59-01:26:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh do we have any context to this one?",
    "timestamp" : "01:26:10-01:26:13"
  },
  {
    "timestamp" : "01:26:14-01:26:24",
    "speaker" : "Mike Melo",
    "text" : "Um it was like the you know, you're driving, let's say it's fourth down, you know, you're you're trying to toss it up and you take your crack or give it away, he said."
  },
  {
    "text" : "Oh, interesting. Um, I think that might m just be um a Freudian slip of the tongue. And Brent Jones is actually a cocaine addict.",
    "speaker" : "Andy",
    "timestamp" : "01:26:24-01:26:34"
  },
  {
    "text" : "Okay, so not football related.",
    "timestamp" : "01:26:34-01:26:36",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't think so.",
    "timestamp" : "01:26:37-01:26:37"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And then my last one that I have written down here, The Little Man in the Canoe. Is that football or not football?",
    "timestamp" : "01:26:38-01:26:46"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:26:48-01:26:53",
    "text" : "Yeah, I don't know what it is, but it oh you know what it is? I miss the chin strap. It's your chin being in the chin strap."
  },
  {
    "text" : "I don't think he said it in the game. I'm just curious.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:26:53-01:26:55"
  },
  {
    "timestamp" : "01:26:57-01:26:58",
    "text" : "I had one more.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Uh that he actually said?",
    "timestamp" : "01:26:58-01:27:01"
  },
  {
    "text" : "Yeah. Um and it's it's not s uh sexual. Okay.",
    "timestamp" : "01:27:01-01:27:06",
    "speaker" : "Andy"
  },
  {
    "text" : "Well, wait, what you didn't tell me what that meant.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:27:06-01:27:08"
  },
  {
    "text" : "It's just I thought you said it was a chin strap. No, it is. You know what I mean. Okay. It's it's it's the lower hemisphere. I put down football. The lower hemisphere of chin strap. Yeah, so football. Yeah, vaguely football related. Okay, moving on. Um so uh when Belichick was flipping his shit um about the the headsets Yeah. They showed him and he was livid and Brent goes, You'd never see Bill Belichick this animated as he's yelling at the referees. And I thought Really? I feel like he's always that animated.",
    "speaker" : "Andy",
    "timestamp" : "01:27:08-01:27:46"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Um but is that revisionist? Are we looking back?",
    "timestamp" : "01:27:47-01:27:49"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean he's always pretty much like that, but Yeah, I don't think that's a secret. And this wasn't like his first season with the team.",
    "timestamp" : "01:27:49-01:27:57"
  },
  {
    "timestamp" : "01:28:00-01:28:08",
    "speaker" : "Mike Melo",
    "text" : "But it might be the first time that Brent Jones was paying attention. Yeah, it was he obviously wasn't paying attention to all the other stuff."
  },
  {
    "text" : "There were a lot of cheerleaders and a lot of gaping holes, so he was the scratch the scratch.",
    "timestamp" : "01:28:08-01:28:12",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:28:13-01:28:18",
    "text" : "You're talking about the linemen opening up for running backs.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, no, those are two different things.",
    "speaker" : "Andy",
    "timestamp" : "01:28:18-01:28:19"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:28:19-01:28:32",
    "text" : "Dude, I'm just trying to figure this out, man, because I mean Brent Jones is telling me football shit and he's supposedly a g uh a a dude who played, right? So I'm just trying to learn. That's all I'm that's all I'm saying. I'm not"
  },
  {
    "text" : "All right. You're not you're not savvy with the lingo, huh?",
    "speaker" : "Andy",
    "timestamp" : "01:28:32-01:28:35"
  },
  {
    "text" : "No.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:28:35-01:28:35"
  },
  {
    "text" : "Alright. Okay.",
    "timestamp" : "01:28:36-01:28:36",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:28:37-01:28:42",
    "text" : "And uh you know if I if I have to write these things down every week until we get to the bottom of this, I will."
  },
  {
    "text" : "Okay.",
    "timestamp" : "01:28:42-01:28:43",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:28:47-01:28:49",
    "text" : "We'll call it football or not football.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:28:52-01:28:59",
    "text" : "All right. Um Oh, the one other thing I want to talk about that I had on my list was um the Terry Glenn saga."
  },
  {
    "timestamp" : "01:28:59-01:29:02",
    "text" : "Oh yeah, yeah. I I had made note of that.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, because uh uh it wasn't in any of the the papers or anything, so maybe it was like early in the week or something, but um the commentators talked about how next week Terry Glenn was coming back and what had led to that because apparently he had been suspended four games for violating the league substance abuse policy. I don't know what ab what substance he abused. Do you remember?",
    "speaker" : "Andy",
    "timestamp" : "01:29:02-01:29:29"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I don't know. I mean obviously he had his off-the-field issues, so I my mind tends to think that, but Yeah, I didn't think it was like a PED thing. No, I don't think so.",
    "timestamp" : "01:29:29-01:29:39"
  },
  {
    "speaker" : "Andy",
    "text" : "But uh then they uh they talked about how Belichick, because he was suspended, so he didn't show up to like uh OTAs or camp or something like that. And so Belichick just said, fuck it, you're suspended for the year. Yeah. Which is such a fucking Belichick move. It is. But I guess like they didn't say why, but like, oh, but so that got reversed.",
    "timestamp" : "01:29:40-01:30:01"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "So I'm assuming Yeah, they said that he appealed.",
    "timestamp" : "01:30:01-01:30:03"
  },
  {
    "timestamp" : "01:30:04-01:30:04",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I don't know wh why. I mean I'm assuming it's because it's not a rule. Like you can't just suspend somebody for I mean he didn't show up to practice and stuff though. So I don't know. There is",
    "timestamp" : "01:30:05-01:30:13"
  },
  {
    "speaker" : "Andy",
    "text" : "So I yeah, I mean who did they uh who did he appeal that to? The league or the NFLPA or to Belichick himself, uh but whatever.",
    "timestamp" : "01:30:14-01:30:21"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "NFLPA took it to the league.",
    "timestamp" : "01:30:22-01:30:24"
  },
  {
    "timestamp" : "01:30:24-01:30:35",
    "text" : "Yeah, it got reversed. So um But they were talking about how immature Glenn was saying he did nothing wrong and like he should take accountability and all this stuff and Which also",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:30:37-01:31:23",
    "text" : "led me to think about the whole Antonio Brown thing. Um that's a good point. Yeah, because I mean together. Yeah, it's and it obviously now with Twitter and everything, things are just blown out a little bit more, but um, you know, He has been shooting himself in the foot a few times and then not necessarily acknowledging that it's his fault. And maybe it is, and maybe it isn't. Maybe he did stuff, maybe he didn't, you know, currently At the time that we're talking about this, he's accused. I don't know what he did and what he didn't do. So I'm not going to condemn condemn him for something that I don't know, but Um I will say he's not making the smartest choices and uh it's kind of got a like Terry Glenn feel. Like if Terry Glenn had Twitter, this might be similar."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:31:23-01:31:24",
    "text" : "Yeah, it might be very similar."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I agree with that. And I'll and today I don't know when this is uh this is gonna be out, so it's probably gonna be dated information, but still it's a nostalgia podcast, so you guys can hear about what was happening even this year. But uh But yeah, Antonio Brown today. Um so he's supposed to meet with the uh the NFL investigators, yeah, about you know his uh accused um sexual harassment case um situation. And uh he immediately after getting so he's been sort of campaigning to get this interview done with and then like literally within a couple of hours of that information, you know, being released that he was supposed to meet with them next week, he went on a Twitter tirade kind of telling the NFL to go fuck themselves and he doesn't need anybody. And then I'm racist. Racist, yep. Um he told all the fantasy football uh players to go fuck themselves. And then within two hours of that It was a very well written um statement where he basically acknowledged that he's just frustrated he still wants to play and wants to get yeah, yeah. Uh I didn't see that. I would definitely check that out right now. Um but It's uh, you know, chances are it could be written by Drew Rosenhaus. I don't know. The writing styles are a little bit different. Um But it basically said that he's frustrated that he wants to get back to the NFL and he wants to do an ASAP.",
    "timestamp" : "01:31:24-01:32:49"
  },
  {
    "timestamp" : "01:32:49-01:33:01",
    "speaker" : "Andy",
    "text" : "So I'm I'm just very frustrated right now with these false allegations and slander to my name. I love football and I miss it. I just want to play and I'm very emotional about that. I'm determined to make my way back to the NFL ASAP."
  },
  {
    "text" : "So clearly that sounds like Antonio. Um As opposed to his previous one that was like, fuck this and fuck that and I'm out making money on my body and my mind. No way. You know, some shit like that. And now he's like. I I I just miss you guys.",
    "timestamp" : "01:33:01-01:33:17",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Um Yo NFL, go fuck yourself.",
    "timestamp" : "01:33:17-01:33:19",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:33:20-01:34:14",
    "text" : "Yeah, he's I I love his personality and I mean I do think he's an ent entertaining guy. I love like watching him. I think he's engaging. But uh he definitely um does it something seems off. I don't know if he's doing this for a brand or because he's kind of going through things But it it definitely seems like and hopefully it doesn't end like the Terry Len thing and like he gets this thing situated and I don't know I don't know if it's like You know, people like to throw around CTE and you know obviously those Burfect hits when he he was on the Steelers um didn't help anything probably, but uh I don't know why he's doing this. It's sad to see because I would have loved to watch Antonio play. But Terry Glenn was also a guy that I kind of love to watch. I mean, I watched him, you know, I went to a couple of games when he was on the team. I liked watching it, but he was inconsistent and he did have all his troubles, so",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:34:15-01:34:18",
    "text" : "Um but when he was on the field he was he was great to watch."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:34:19-01:34:19"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:34:20-01:34:22",
    "text" : "It does feel very similar now that you say that."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:34:22-01:34:55",
    "text" : "It's a shame. So it is hopefully he'll get it uh sorted out. And um I also wrote down, and this is a pretty big one for me to admit, but um I have the first time I've been disappointed in Lee Johnson this season so far. I know I'm a I'm a pretty big fan. I love what he's done. Love what he's uh you know he had been doing throughout his career. Big Lee Johnson fan. But this one just did not pass the sniff test."
  },
  {
    "text" : "I mean he he averaged forty f almost forty five yards a punt. He just wasn't that consistent.",
    "timestamp" : "01:34:56-01:35:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:35:01-01:35:05",
    "speaker" : "Mike Melo",
    "text" : "Yeah, but like what about that like 20 yarder? Like what's up with that?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he he he had five punts. Two of them were like one was twenty-eight yards, one was like just over thirty, and the other ones were like bombed to like fifty, sixty yards. So you never knew what you were gonna get with them. That's right. But yeah, so I mean yeah, between that and the Troy Brown fumbled punt, it was uh It was tough. It was a tough day for all f all three phases, as Belichick would say. That's right. But yeah, so let's uh let's do best and worse. We'll we'll wrap this up.",
    "timestamp" : "01:35:05-01:35:38"
  },
  {
    "text" : "I mean we've tackled so much.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:35:38-01:35:41"
  },
  {
    "timestamp" : "01:35:41-01:35:43",
    "speaker" : "Andy",
    "text" : "Um You want me to go first?"
  },
  {
    "text" : "Yeah, do it.",
    "timestamp" : "01:35:43-01:35:44",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "All right. So um My best was finding out that uh Jason Taylor married Zach Thomas's sister.",
    "timestamp" : "01:35:44-01:35:55",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:35:56-01:36:01",
    "text" : "Oh yeah, that was interesting. See how close they are? That's that's why they were a crazy duo.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "That's team camaraderie right there.",
    "timestamp" : "01:36:02-01:36:04",
    "speaker" : "Andy"
  },
  {
    "text" : "And good for Zach, you know, like that's Just being okay with that, taking him in into his family.",
    "timestamp" : "01:36:04-01:36:11",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "What are you gonna say? No to Jason Taylor?",
    "timestamp" : "01:36:11-01:36:13"
  },
  {
    "text" : "I mean, that'd be a hell of a fucking disagreement.",
    "timestamp" : "01:36:14-01:36:18",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:36:19-01:36:21",
    "text" : "Well he's beautiful.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "There's a lot of people that I would marry before Jason Taylor. But he's great.",
    "timestamp" : "01:36:21-01:36:27"
  },
  {
    "text" : "A lot? I think he's probably up there. And I'm not judging you, dude. In the NFL. In the NFL.",
    "speaker" : "Andy",
    "timestamp" : "01:36:27-01:36:32"
  },
  {
    "timestamp" : "01:36:32-01:36:33",
    "speaker" : "Mike Melo",
    "text" : "Oh, in the NFL?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Hollywood doesn't care. You live in Hollywood. That doesn't count.",
    "timestamp" : "01:36:34-01:36:36"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:36:37-01:36:46",
    "text" : "Well, I do know somebody who is married to an NFL player and he's really good. I won't say who, but I probably would marry him because he's probably the most attainable."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:36:46-01:36:47",
    "text" : "Tom Brady?"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:36:47-01:37:00",
    "text" : "Nope. Alright. See? Guess it'll lead to Jimmy J. You know this is um this is what they call a teaser. In the business. I learned that from you."
  },
  {
    "text" : "Alright, yeah. So next week find out who Mike knows he would sleep with in the NFO.",
    "speaker" : "Andy",
    "timestamp" : "01:37:00-01:37:05"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. Great segment.",
    "timestamp" : "01:37:06-01:37:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Hell yeah. So my worst um It was the touchdown at the end of the half, um, not so much because of the touchdown itself, although that was bad because it was Teddy Bruski in coverage 20 yards downfield. Um, which looked exactly like you would expect it to, with uh Captain Neckerel trying to to cover uh a tight end. But also the fact that when they scored the touchdown, the song that came on immediately after was Who Let the Dogs Out?",
    "timestamp" : "01:37:08-01:37:36"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh yeah.",
    "timestamp" : "01:37:37-01:37:38"
  },
  {
    "speaker" : "Andy",
    "text" : "You know, I found myself singing song. Which I I don't think I've actually sung that song since college when I would buy um a 30 rack of red dog. Literally so I could bring it to house parties and sing that song as I would pull it out of my backpack.",
    "timestamp" : "01:37:38-01:37:54"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Um I was singing this and then my girlfriend came into the room. She was like, it's a little confused. I think we talked about it for a while, and I defended my choice because it was the party song of that time.",
    "timestamp" : "01:37:55-01:38:07"
  },
  {
    "text" : "Oh yeah, of of the early 2000s.",
    "timestamp" : "01:38:07-01:38:10",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, and womp there it is, which I still stand by that one.",
    "timestamp" : "01:38:10-01:38:14",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:38:14-01:38:16",
    "speaker" : "Andy",
    "text" : "Yeah, I feel like that was a little earlier."
  },
  {
    "text" : "Okay, whatever. Okay.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:38:17-01:38:20"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:38:21-01:38:23",
    "text" : "So there you go, those are my best of worse."
  },
  {
    "timestamp" : "01:38:24-01:38:59",
    "speaker" : "Mike Melo",
    "text" : "Alright, my uh best was um Jay Fiedler, uh there's less than 30 seconds left. Uh he's in the uh Pad's red zone and he's running the no huddle. And he's he scrambles. He gets plowed, right? Yeah. And he he's uh he's rushing everybody to the line and they need to get a first down. Brent Jones is harping on this. It's like time is running off the clock. It's like Um second or third down or whatever it is, and they still have chances. And he's running everybody. I think he was concussed, man."
  },
  {
    "text" : "I don't think he knew where he was, but he got lit up.",
    "timestamp" : "01:38:59-01:39:01",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, and he like rush everybody to the line and then he calls a quarterback sneak. So if he gets the first down and Brett Jones is like, Oh man, even though he took a pop, like he he's self-aware. He knew that he needed the first down. Meanwhile, another like twenty seconds goes off the clock.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:39:02-01:39:16"
  },
  {
    "timestamp" : "01:39:16-01:39:23",
    "text" : "I'm like, I've never seen a like a like Yeah, and that QB sneaky got kinda like stood up and he got lit up again.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:39:23-01:39:34",
    "text" : "He did two plays in a row. Yeah, but and then uh Brent Jones was like just loving it. He was like, that's what you gotta do. You gotta do that? Why? He had two downs to kind of go for something. Exactly.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:39:34-01:39:52",
    "text" : "Spike it. Take a timeout. You had a couple left. Yeah. But I mean he was uh I don't know Yeah, he was it was like that Snicker commercial. It was like, oh, do you know where you are? It's like, yeah, it's it's third and two with 20 seconds left. Like, oh and who are you? I'm Batman. Like he definitely thought he was Batman on that play."
  },
  {
    "timestamp" : "01:39:54-01:40:01",
    "speaker" : "Mike Melo",
    "text" : "I would say that that is an accurate assessment and probably what the commercial was based on. I don't know which came first. I'm not sure."
  },
  {
    "timestamp" : "01:40:02-01:40:04",
    "speaker" : "Andy",
    "text" : "Jay Feeler definitely came first."
  },
  {
    "timestamp" : "01:40:04-01:40:05",
    "speaker" : "Mike Melo",
    "text" : "Yeah, then there you go."
  },
  {
    "text" : "Uh that's what Brett Jones would say anyway.",
    "speaker" : "Andy",
    "timestamp" : "01:40:05-01:40:08"
  },
  {
    "timestamp" : "01:40:08-01:40:13",
    "speaker" : "Mike Melo",
    "text" : "Yeah, and then the worst I would say is Brett Jones. I mean he was a a source of of"
  },
  {
    "timestamp" : "01:40:13-01:40:17",
    "text" : "inspiration for me in terms of confusion from the sound of it.",
    "speaker" : "Andy"
  },
  {
    "text" : "Right, yeah. Very confused, but I'm also entertained because the game itself sucked. Um But I would also say one of the worst moments was when the commentator said that Tom Brady won a national championship at Michigan in 97 as a backup. And he hadn't won a championship after that. So it made me sad because it was the one true time that Tom Brady was a loser.",
    "timestamp" : "01:40:17-01:40:40",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:40:43-01:42:00",
    "speaker" : "Andy",
    "text" : "All right, that's that's uh that's a pretty good one. I'll give you that. Nicely done. Thank you. Nicely done. Great. All right, well, I think uh do we what do we have to look forward to next week? Um you tell me, Andy. So next week, oh, it's the uh the Chargers coming into town. Nice. A three and one Chargers who were undefeated until losing to the Browns this week with Doug Flutie at the helm because this was when uh the Bills had to make a choice between Doug Floody and Rob Johnson. Cause that was in the Boston Globe too, and they went with Rob Johnson who Led them promptly to an 0-3 start and then got hurt and threw a bunch of interceptions and fumbles. And Doug Flutie was leading the Chargers to a 3-1 start. And uh They obviously made the wrong decision there, which is pretty typical Bills. Love them. So we have to look forward to that. Them coming in town, riding high. Leading the league even though they were one in fifteen the year before. Oh, absolutely not. Uh that that didn't come till later with um What the hell is his name? The the sack dance guy?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh, Sean Merriman.",
    "timestamp" : "01:42:00-01:42:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes.",
    "timestamp" : "01:42:02-01:42:03"
  },
  {
    "text" : "I was talking about the uh recreational um variety, but that too.",
    "timestamp" : "01:42:03-01:42:08",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Oh well we'll get to that then. We'll save that for next week. It's a teaser, we call that in a in the biz, Mike.",
    "timestamp" : "01:42:08-01:42:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:42:15-01:42:18",
    "text" : "I already use that, man. We can't use that every episode."
  },
  {
    "timestamp" : "01:42:18-01:42:19",
    "text" : "It's called a callback, Mike.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Alright, fine.",
    "timestamp" : "01:42:19-01:42:20"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:42:21-01:42:23",
    "text" : "It's what we call in the biz a callback."
  },
  {
    "timestamp" : "01:42:24-01:42:28",
    "speaker" : "Mike Melo",
    "text" : "Well, if anybody's still listening, you just learned something. That's right. So."
  },
  {
    "speaker" : "Andy",
    "text" : "Not a lot of high hopes going into this this next game, but we'll see how it goes. Will Tom Brady ever throw a touchdown? Will the Patriots win another game or will they Stay one win on the season forever. My guess is yes. Tune in next week. For all that and more. And maybe some other guests.",
    "timestamp" : "01:42:29-01:42:48"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "So much more.",
    "timestamp" : "01:42:49-01:42:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Between So many guests. So many guests.",
    "timestamp" : "01:42:49-01:42:52"
  },
  {
    "timestamp" : "01:42:52-01:42:53",
    "speaker" : "Mike Melo",
    "text" : "The best guests."
  },
  {
    "timestamp" : "01:42:56-01:43:08",
    "speaker" : "Andy",
    "text" : "Go on. No, don't go on. We're gonna call it right there. Uh all right, until next week. We will see you then. Light up."
  }
]