[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid. You still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:19"
  },
  {
    "timestamp" : "00:24-00:55",
    "text" : "Welcome back, as I'm sure you've all been listening all the way through to the Patriots Dynasty Podcast. This week is 2001, week nine, with the the Buffalo Bills coming to Foxboro Stadium, not Gillette Stadium. Although the gratuitous shots of Gillette Stadium in the background. CMGI. Yes, thank you. CMGI field as we've already talked about. What were they? They were the The ass Jeeves of the early 2000s, isn't that what you discovered? Something like that.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yes, sir.",
    "timestamp" : "00:56-00:57",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Something like that. Yeah. So um just for some context, why we might sound a little dour. This week uh we are recording this the week after the ending of the 2019 Patriots season.",
    "timestamp" : "00:57-01:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:11-01:12",
    "text" : "The ending of dynasty"
  },
  {
    "text" : "Some would say that, well, a lot of media would say that. I'm not ready to call it quite yet. Because they've been saying that for the past What would you say? Ten years that the dynasty has ended?",
    "timestamp" : "01:14-01:26",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "It's over. I like that a uh a playoff appearance um after three Super Bowls is the end.",
    "timestamp" : "01:26-01:34"
  },
  {
    "timestamp" : "01:34-01:51",
    "speaker" : "Andy",
    "text" : "Yeah, twelve and four season while battling through uh a a platitude of injuries. Platitude? That's not the right word. That's true. He sold his house. And Alice Guerrero sold his too, didn't he? And and he's a free agent. He'll never be able to do it."
  },
  {
    "speaker" : "Greg",
    "text" : "And he moved to Connecticut. Belichick hates him",
    "timestamp" : "01:52-01:55"
  },
  {
    "timestamp" : "01:55-01:58",
    "speaker" : "Andy",
    "text" : "It's physically impossible for him to come back, I'm pretty sure."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, but isn't now you know, play devil's advocate here. Isn't it wouldn't it be a little bit interesting to see Brady? go somewhere else just to kind of add to that bar conversation of like who's better, Belichick, Brady, who needed who more. I mean obviously it's a different conversation because he's older, the teams are different, whatever. It's kind of stupid. But Could be fun to talk about.",
    "timestamp" : "02:01-02:24"
  },
  {
    "text" : "It'd be interesting. Yeah.",
    "timestamp" : "02:25-02:27",
    "speaker" : "Greg"
  },
  {
    "text" : "Imagine if like Brady wins one and then Belichick never wins another one. That's pretty embarrassing for him.",
    "speaker" : "Mike Melo",
    "timestamp" : "02:28-02:33"
  },
  {
    "timestamp" : "02:35-02:36",
    "speaker" : "Andy",
    "text" : "My money would be on the other way around."
  },
  {
    "text" : "I know, that's what I mean. It's more likely for the coach to coach until he's 85 and sneak one in there. Oh at least, yeah. But if Brady brings the fucking Titans to the Super Bowl, it's not bad. You put him on the Colts or something. Yeah.",
    "speaker" : "Mike Melo",
    "timestamp" : "02:37-02:52"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:53-02:57",
    "text" : "Isn't the Chargers the uh the lead spots? I don't get that man."
  },
  {
    "text" : "They're terrible. Yeah. And the Raiders, give me a break.",
    "speaker" : "Mike Melo",
    "timestamp" : "02:57-03:01"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. Uh I'm sure Belichick will see eye to eye with what's his name? Not Al Davis, his son, with the bowl cut. Fucks his name.",
    "timestamp" : "03:02-03:13"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "03:13-03:18",
    "text" : "Oh, uh that guy. Al Davis Jr. Yes, is it? Sure."
  },
  {
    "timestamp" : "03:20-03:23",
    "speaker" : "Andy",
    "text" : "He's such a weirdo. He's a real weird dude."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Um Uh all I know is the chances of the Patriots letting Brady go is minuscule because I don't know if you guys know, but there's a $13 million cap hit if he leaves. And that's a huge amount of money to be sitting around for nothing. So but we don't talk about that.",
    "timestamp" : "03:23-03:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:42-03:49",
    "text" : "Nope. Nope. We're here to talk about 2001 week nine. But the the one in five buffalo."
  },
  {
    "text" : "We need introductions before getting sidetracked. Nice.",
    "timestamp" : "03:50-03:52",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:53-04:03",
    "speaker" : "Andy",
    "text" : "Yep. I mean at this point, do we even need introductions? Everybody's here. The whole damn crew. If you don't know who we are by now, you can Google it."
  },
  {
    "speaker" : "Greg",
    "text" : "If you Google Google Steve Brown, it's hilarious. It's like a yo-yo champion. Alright.",
    "timestamp" : "04:05-04:11"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I'm gonna do that right now.",
    "timestamp" : "04:11-04:12"
  },
  {
    "speaker" : "Steve",
    "text" : "That guy is legit.",
    "timestamp" : "04:13-04:14"
  },
  {
    "timestamp" : "04:16-04:20",
    "speaker" : "Mike Melo",
    "text" : "I'm actually looking that up right now. So I think a yo-yo master."
  },
  {
    "speaker" : "Steve",
    "text" : "He like teaches other yo-yo guys. He's like an OG yo-yo.",
    "timestamp" : "04:21-04:25"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I'm not seeing this yo-yo guy, but I'm gonna type in yo-yo guy. Stay tuned.",
    "timestamp" : "04:25-04:29"
  },
  {
    "text" : "I set a a Google alert for Andrew Brown. So every time my name comes up in like a new Google story, I get notified. There is uh a defensive lineman for the Cincinnati Bengals named Andrew Brown. And there's a lot of guys who've done a whole bunch of terrible shit.",
    "speaker" : "Andy",
    "timestamp" : "04:30-04:50"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "04:50-05:11",
    "text" : "I was gonna say a lot of victims and and murderers and all kinds of weird things out there. But you know what? Um this yo-yo guy looks fucking awesome. Doesn't he? Yeah, his beard is sick. Forget the yo-yos. I don't know. His tats are on point. He makes walking the dog look cool. Shoot the moon."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:15-05:24",
    "text" : "Speaking of uh great beards, I guess, as a as a segue. Uh Buffalo Bills head coach Greg Williams. Does he have a beard?"
  },
  {
    "timestamp" : "05:25-05:29",
    "speaker" : "Mike Melo",
    "text" : "Uh that was handy. Yeah, I don't think so. I don't think so."
  },
  {
    "timestamp" : "05:29-05:30",
    "speaker" : "Andy",
    "text" : "All right, fuck it."
  },
  {
    "text" : "He does have like a cool fro though.",
    "timestamp" : "05:30-05:32",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:32-05:34",
    "text" : "Yeah, something like that."
  },
  {
    "timestamp" : "05:34-05:36",
    "text" : "He's got two G. Yeah.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "05:36-05:41",
    "speaker" : "Andy",
    "text" : "Oh yeah, this is Greg with two G's. He also has a very square head, I feel like."
  },
  {
    "text" : "I will say about uh Greg Williams. Um, because this popped up in the broadcast and I thought it was very cool. Um he was talking to his team or talking about his team and he says his team is too young and not talented enough to overcome penalties and mistakes. I thought that was pretty neat.",
    "speaker" : "Mike Melo",
    "timestamp" : "05:41-06:01"
  },
  {
    "text" : "Well, this is the the same Greg Williams who uh was the interim Browns head coach in twenty eighteen after Hugh Jackson was fired because he was He's more of a defensive coordinator, I think. Right. Yeah. Yeah, that's that's that's usually what he is. He's been in the league since ninety-seven Um mostly's a defensive coordinator, but he got a couple of shots at head coach. This, of course, was the 0-1 through 03 with the Bills, where he went 17 and 31. And then the year with Cleveland, he had eight games there. He went five and three, but they didn't bring him back as a head coach because I think he seems like a bit of a a loose canon.",
    "speaker" : "Andy",
    "timestamp" : "06:01-06:41"
  },
  {
    "timestamp" : "06:42-06:44",
    "text" : "From the way everybody talks about Bounty Gate guy.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "06:45-06:47",
    "text" : "He is. Yeah, right, right, right, yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "So he's uh Yeah, did you watch the hard knocks with him in it?",
    "timestamp" : "06:47-06:52"
  },
  {
    "timestamp" : "06:53-06:57",
    "speaker" : "Andy",
    "text" : "No. Which one was that? Oh, oh, the the one last year, right with the Browns?"
  },
  {
    "timestamp" : "06:58-06:58",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "No, I didn't actually see it.",
    "timestamp" : "06:58-06:59"
  },
  {
    "text" : "He's a hard HP. He's like an old school, you know, grumpy cunt kind of guy. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "07:00-07:05"
  },
  {
    "timestamp" : "07:05-07:07",
    "speaker" : "Mike Melo",
    "text" : "How do you feel about the uh Bonnie Yate?"
  },
  {
    "text" : "Dude, I don't know. I mean I think it's it's like whatever, dude. They're trying to hurt each other anyways.",
    "timestamp" : "07:07-07:12",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "07:12-07:20",
    "text" : "football. Right."
  },
  {
    "timestamp" : "07:21-07:23",
    "speaker" : "Greg",
    "text" : "Saying go hurt him and go hit him as hard as you can."
  },
  {
    "timestamp" : "07:24-07:39",
    "speaker" : "Mike Melo",
    "text" : "Right, right. And I think you like even the money thing was just like them, you know, again, not right the optics, it doesn't pass the optics test, but they're just you know It wasn't like this whole infrastructure to like decimate people, I don't think. Right. It's fool."
  },
  {
    "timestamp" : "07:40-07:51",
    "speaker" : "Andy",
    "text" : "Yeah, it it felt like the The actual punishments that came down. Yeah. Like Sean Payton being suspended for a year and all that crap. Like it that it just seems so over the top. Yeah."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "07:52-08:11",
    "text" : "Yeah, I mean it was it was definitely like an optics thing and you don't want a brutal sport to be like you know mired by things like that but uh Yeah, he like Greg said, he's an old school guy. Yeah. It doesn't excuse his actions though. Auto record."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:13-08:28",
    "text" : "Way to save that. So in his uh head coaching career, he has faced Balchecks six times, all while coaching the Buffalo Bills. Uh he lost five of them. Can any of you name the one win?"
  },
  {
    "text" : "I can, but I ch I cheated and I looked.",
    "timestamp" : "08:30-08:32",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "text" : "Was it the 31-nothing?",
    "timestamp" : "08:34-08:35"
  },
  {
    "timestamp" : "08:36-08:44",
    "speaker" : "Andy",
    "text" : "It was, yeah. It was game week one. That was his only win against the New England Patriots and Bel Bill Belichick."
  },
  {
    "timestamp" : "08:45-08:47",
    "speaker" : "Steve",
    "text" : "Yeah, but what a win, huh? Yeah."
  },
  {
    "text" : "Yeah. And then they uh they they finished that season pretty strong too, I believe, by coming back to I don't remember which one was where, but playing the Patriots again last week of the season and in the perfect bookend losing 31-0.",
    "timestamp" : "08:47-09:05",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "09:07-09:09",
    "speaker" : "Steve",
    "text" : "The first game was in Buffalo, the last game was in New England."
  },
  {
    "speaker" : "Andy",
    "text" : "That's what I thought. Yeah. From the the visuals that have been burned into my memory.",
    "timestamp" : "09:10-09:16"
  },
  {
    "timestamp" : "09:17-09:18",
    "speaker" : "Steve",
    "text" : "That pick in the end zone."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep, yeah, because they had the second string in until the the bills started driving right at the end and then they put the first string defense back in and held them to keep it 31-0. It's beautiful.",
    "timestamp" : "09:19-09:30"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Uh I wanna know, Mr. Vron. Z uh um Greg Williams got in trouble for the bounty gate thing. How come Sean Payton doesn't get in trouble for bringing like he's carrying around a hundred thousand dollars or something of cash and enticing his players to win a game? Doesn't that promote betting? Betting's real now.",
    "timestamp" : "09:30-09:51"
  },
  {
    "text" : "In New Jersey.",
    "timestamp" : "09:51-09:52",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, but you can't can you bet like if you're on an NFL team or against or for or whatever? Probably. Exactly. Exactly. So, you know, why doesn't Sean Payton you know what? Sean Payton should just get suspended every year. How about that?",
    "speaker" : "Mike Melo",
    "timestamp" : "09:52-10:08"
  },
  {
    "text" : "Uh that's that sounds great. I think you're on yourself. Go off, King. All right. Um Speaking of terrible though, the the Bills this year would finish the season 3-13 after coming into this at 1-6. Uh that would qualify for fifth in the IC East out of five teams back when that was still a thing. Uh they wouldn't actually win more than one game in a row this season. They had losing streaks of four which to start the season and then another six after winning coming out of their bye. And this is game that we're We're catching them now is part of that six-game losing streak. Let's see. Other notable coaches? Literally nobody. This team was so bad that uh nobody else ever got a job in the NFL afterwards. As a head coach anyway.",
    "timestamp" : "10:11-11:04",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know if they He replaced uh oh do you know who he replaced on the Bills?",
    "speaker" : "Greg",
    "timestamp" : "11:04-11:09"
  },
  {
    "timestamp" : "11:10-11:11",
    "speaker" : "Andy",
    "text" : "Who replaced?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "11:11-11:23",
    "text" : "Who uh Williams replaced? Who he's he's famous guy The uh he he was the architect uh fluety Rob Johnson fiasco, I'll give you a hint."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh no, that wasn't uh I've gone far. It's not uh Marv Levy, is it?",
    "timestamp" : "11:23-11:29"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "11:29-11:31",
    "text" : "No, it was Wade Phillips."
  },
  {
    "text" : "Oh I feel like I feel like I can fuse those two guys. Is that weird? I can see that.",
    "timestamp" : "11:32-11:38",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Well Way Phillips is is that uh like defensive coordinator who every once in a while gets a shot too, isn't he?",
    "speaker" : "Andy",
    "timestamp" : "11:39-11:45"
  },
  {
    "text" : "Yeah. Exactly.",
    "timestamp" : "11:45-11:46",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "11:46-11:47",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "11:47-11:51",
    "speaker" : "Greg",
    "text" : "So that's that's kind of uh because of Bum Phillips, yeah."
  },
  {
    "timestamp" : "11:51-11:54",
    "text" : "Yeah, yeah. Why are they related?",
    "speaker" : "Andy"
  },
  {
    "text" : "He's son of Bum. He wrote a book called Son of Bum. Yeah, he did. I actually read some excerpts out of it in preparation for this podcast.",
    "timestamp" : "11:55-12:06",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh, really? I hope you fell.",
    "speaker" : "Andy",
    "timestamp" : "12:06-12:08"
  },
  {
    "speaker" : "Greg",
    "text" : "I fell deep into the fluety Rob Johnson rabbit hole.",
    "timestamp" : "12:08-12:12"
  },
  {
    "text" : "It was it was quite a rabbit hole. There was uh there was a whole bunch of shit that went on.",
    "speaker" : "Andy",
    "timestamp" : "12:13-12:17"
  },
  {
    "timestamp" : "12:18-12:19",
    "text" : "It was ridiculous.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. I mean I realized it went that deep. Yeah, so I let we can get into that now if you want, because I mean the next thing is the the starting quarterback, as we've made aware, is Rob Johnson, and he was the replacement for Doug Flutie, really, right?",
    "speaker" : "Andy",
    "timestamp" : "12:19-12:34"
  },
  {
    "timestamp" : "12:35-12:40",
    "text" : "Yeah. Yeah. Now I remember the San Diego game we touched on this. Like d did anything go deeper than that?",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "You want want me to get into it? I got a timeline. Yeah. Yeah, let's hear it.",
    "speaker" : "Greg",
    "timestamp" : "12:40-12:44"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "12:44-12:44",
    "text" : "Let's do it."
  },
  {
    "timestamp" : "12:44-12:50",
    "speaker" : "Greg",
    "text" : "So he he's a fourth round draft pick, Johnson, for the expansion Jacksonville Jaguars."
  },
  {
    "speaker" : "Andy",
    "text" : "Right.",
    "timestamp" : "12:50-12:51"
  },
  {
    "text" : "He plays three years there. He starts one game. He like played his ass off in that one game. If you remember this this came up with uh like the Matt Castle conversation He g they gave up a first and a fourth round pick to trade fall. Wow. So they brought him and Flutie in in uh nineteen ninety-eight, I believe.",
    "speaker" : "Greg",
    "timestamp" : "12:51-13:18"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "13:19-13:19",
    "speaker" : "Andy"
  },
  {
    "text" : "And uh He sucks. He starts the season one and three, and then Flutie takes over when he gets hurt. They go he turns the season around. They make the playoffs. Flutie goes to the Pro Bowl. Everything's dandy. Right. The next year they go 11 and 5. This is this is where it all like blew up. So Flutie started 15 games that year.",
    "timestamp" : "13:19-13:45",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:45-13:45",
    "text" : "Right, right."
  },
  {
    "speaker" : "Greg",
    "text" : "We're making the playoffs. He sits out week 17 because they couldn't change their playoff uh seating. Johnson comes in, slings all over the field, plays his ass off. And then Wade Phillips starts Johnson. Oh my god.",
    "timestamp" : "13:46-14:01"
  },
  {
    "text" : "Yeah. I forgot that's how that went down.",
    "speaker" : "Mike Melo",
    "timestamp" : "14:04-14:06"
  },
  {
    "timestamp" : "14:06-14:37",
    "text" : "Yeah, which turned out to be the Music City Miracle. Yes, yeah. away. Yeah. Yeah. So then they uh they lost obviously to the Titans in that game. And then the next year, uh they split time. Flutie went four and one, uh, Rob Johnson went four and seven, and at the end of that year, their decision Wade Phillips said, I think we'll stick with Rob Johnson. Wow. Let Flutie go.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "14:38-14:51",
    "speaker" : "Andy",
    "text" : "Yeah, because I don't I don't I think it was just me and Mike that did the Chargers game, but cause they traded him to the Chargers. Yep. Doug Floody. And at the time, I think the Chargers were undefeated and the Bills were winless."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "14:52-15:20",
    "text" : "Yeah, so Flutie went everybody's like tearing him to bits. They were one and fifteen the year before. And then he actually played they played each other that year. And uh Floody was four and two. And it like turned around the Chargers and then there was like a dramatic like game ending uh scramble touchdown that Flutie had to win it for the Chargers. And I remember that play happening because everyone was like, dude, fuck Rob Johnson."
  },
  {
    "timestamp" : "15:22-15:25",
    "speaker" : "Mike Melo",
    "text" : "I guess that's what happens when you trade a first round pick for him."
  },
  {
    "timestamp" : "15:25-15:29",
    "speaker" : "Greg",
    "text" : "Yeah. So that it was actually two weeks before this game, I think."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:29-15:31",
    "text" : "Yeah, I think that was 701."
  },
  {
    "timestamp" : "15:31-15:32",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "15:32-15:35",
    "speaker" : "Andy",
    "text" : "It was, yeah. Yeah, it was their week seven."
  },
  {
    "timestamp" : "15:36-15:41",
    "speaker" : "Greg",
    "text" : "And then uh Rob Johnson like breaks his collarbone in this game, spoiler alert."
  },
  {
    "text" : "Yep.",
    "speaker" : "Andy",
    "timestamp" : "15:41-15:41"
  },
  {
    "speaker" : "Greg",
    "text" : "And he basically was never the same.",
    "timestamp" : "15:42-15:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Or I mean he kind of was though.",
    "timestamp" : "15:45-15:47"
  },
  {
    "speaker" : "Greg",
    "text" : "You just never had the one game where you bring his ass off.",
    "timestamp" : "15:48-15:51"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. Right, yeah. That was it. Wow, well thank you for that. I I forgot all about all that. Yeah, I went down.",
    "timestamp" : "15:51-15:58"
  },
  {
    "text" : "And like there were so many like instances throughout this whole thing of like Oh yeah, Rob Johnson started the game. They were losing. He, you know, gets a concussion. Flutie comes in, scores twenty-four unanswered points, and they win. Like I read that like four different times.",
    "timestamp" : "15:59-16:14",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "It's all similar to the uh the Tom Brady Drew Henson situation. I was thinking the exact same thing situation in Michigan.",
    "timestamp" : "16:14-16:21"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah.",
    "timestamp" : "16:21-16:21"
  },
  {
    "speaker" : "Andy",
    "text" : "Like they just want Rob Johnson to be good. When he isn't, they just put in the backup to clean things up again.",
    "timestamp" : "16:21-16:27"
  },
  {
    "timestamp" : "16:27-16:31",
    "text" : "Yeah. See, I thought he was like a high draft pick.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, so did I.",
    "speaker" : "Andy",
    "timestamp" : "16:31-16:32"
  },
  {
    "timestamp" : "16:32-16:37",
    "speaker" : "Greg",
    "text" : "The first and fourth, like that's where that like reputation came from."
  },
  {
    "speaker" : "Andy",
    "text" : "Of like we gotta use them because we get to I guess technically it was a high draft pick, just not by the jacks. Yeah. Fuck. Yeah. And so they're they they rolled with Rob Johnson and Alex Van Pelt of all people this season. Great name. And then the rest of the season because Rob Johnson. Well oh I think that was also another knock on Rob Johnson's he could never stay healthy too.",
    "timestamp" : "16:38-17:05"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah, he was injured too. And then so after that Music City Miracle, I think It took him twenty years to get back to the playoffs.",
    "timestamp" : "17:05-17:14"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:14-17:15",
    "text" : "Yeah."
  },
  {
    "timestamp" : "17:15-17:16",
    "text" : "The curse of Flutie.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. And I went did Flutie make the playoffs? In those 20 years? He was on the Patriots team, so he must have.",
    "timestamp" : "17:17-17:23"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "17:23-17:23"
  },
  {
    "speaker" : "Andy",
    "text" : "So not as a starter maybe, but Doug Flutie. I love it And they still haven't won a playoff game since then, right? Because they lost this year too. Yep. I believe so. So Tough. He's the he's the uh the babe Ruth of Buffalo.",
    "timestamp" : "17:24-17:44"
  },
  {
    "timestamp" : "17:44-17:50",
    "speaker" : "Steve",
    "text" : "I mean I don't think they've won since the year they lost that fourth Super Bowl in a row."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I think you're right, Steve. 'Cause they lost in the first round in both those years. I was looking at the ninety eight and ninety-nine.",
    "timestamp" : "17:51-17:58"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yep. Does it compare it to the Antonio Brown curse?",
    "timestamp" : "17:59-18:03"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "18:06-18:10",
    "text" : "He got 'em. The Raiders, Steelers, and Patriots."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And he included Buffalo in that as well. Right. I don't know. He was proud of, you know, every team. being out in the same week. So we gotta sign that man immediately.",
    "timestamp" : "18:10-18:24"
  },
  {
    "speaker" : "Steve",
    "text" : "We should at least bring one the podcast.",
    "timestamp" : "18:25-18:27"
  },
  {
    "text" : "I think he'd be down. Dude, we could like we could uh uh watch his uh music video.",
    "timestamp" : "18:27-18:32",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "18:32-18:34",
    "speaker" : "Greg",
    "text" : "Yeah, we could hype it for him."
  },
  {
    "timestamp" : "18:34-18:38",
    "text" : "I like it already. I think once was a whole lot of money",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that wasn't that's not auto-tuned enough. I'll auto-tune it in post.",
    "timestamp" : "18:39-18:45"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Thank you. I appreciate that. I hope you do.",
    "timestamp" : "18:45-18:47"
  },
  {
    "text" : "I think I will. So actually the uh the last Buffalo playoff win was the year after they lost their last Super Bowl. They won in the wild card against the Dolphins before losing to the Steelers in the visual round. 1995, baby. It's been a couple years.",
    "speaker" : "Andy",
    "timestamp" : "18:48-19:07"
  },
  {
    "timestamp" : "19:08-19:19",
    "speaker" : "Mike Melo",
    "text" : "Hey, there are other teams that are worse off, so they should be happy. Yeah. Sure. Verily, but yes. That's over."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:20-19:37",
    "text" : "What are we gonna do with ourselves until next year? Um speaking of dynasties, the Bills wide receivers, Eric Mold's Imperialist Price. Talk about a duo. Both of them really. Eric Molds."
  },
  {
    "timestamp" : "19:40-19:42",
    "speaker" : "Mike Melo",
    "text" : "Yeah, that's that's great."
  },
  {
    "timestamp" : "19:42-20:08",
    "speaker" : "Andy",
    "text" : "I think if we're if we're going with great names, uh running back starting running back Travis Henry. Was always my favorite because I remember playing him in Madden and calling him Big Hen and my college roommate at the time. I use Travis Henry to to such great effravis Henry and and Drew Bledzo to such great effect that he couldn't beat me. And that guy's speaking to me. I know. I know."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "20:09-20:12",
    "text" : "Drew Bledsoe and Travis Henry. I don't know, man."
  },
  {
    "text" : "Yep. Did anyone else go into the Travis Henry rabbit hole? I didn't know that there was a big thing. Oh, is there?",
    "speaker" : "Greg",
    "timestamp" : "20:12-20:21"
  },
  {
    "timestamp" : "20:23-20:26",
    "text" : "Oh boy. Let's hear it though. I mean, the last was so good.",
    "speaker" : "Andy"
  },
  {
    "text" : "Grab his Henry. Yes. Um he has some seed. We'll say that.",
    "timestamp" : "20:26-20:32",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh, is he a Dave Megat style?",
    "timestamp" : "20:33-20:35",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "20:35-20:36",
    "speaker" : "Greg",
    "text" : "Oh yeah. Oh no."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:36-20:39",
    "text" : "An Antonio Cromartie. Like on Cromari."
  },
  {
    "speaker" : "Greg",
    "text" : "He's the all-time best athlete for illegitimate children. Oh really?",
    "timestamp" : "20:39-20:44"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:45-20:46",
    "text" : "More than Cromartie."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "20:46-21:03",
    "text" : "Yep. Standard bear. So Cromartie has Twelve kids with eight women. Wow. Wow. Eleven with ten. Wow. He was paying so in 09."
  },
  {
    "timestamp" : "21:04-21:05",
    "text" : "Oh God.",
    "speaker" : "Andy"
  },
  {
    "text" : "He got brought to court for child support and they said that he was paying $170,000 a year in child support.",
    "timestamp" : "21:05-21:12",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh my god, did he have that much money?",
    "timestamp" : "21:12-21:14"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:15-21:32",
    "text" : "Well no. So if you all That's why he was in court. So this is all before he was thirty. He had all this So he ended up getting some jail time, I believe, for getting arrested for a multi-kilogram cocaine transaction."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oops. Well, I mean he was trying to do what he could to help out his kids.",
    "timestamp" : "21:33-21:37"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:38-21:52",
    "text" : "I would know so then it the plot dickens, they asked money for like the child support. And they asked where it all went, and he said, Oh, I spent it on my three cars and two hundred and fifty thousand dollars in jewelry."
  },
  {
    "timestamp" : "21:52-22:05",
    "text" : "Oh my god. Well, I mean think about it though. Uh the kids not gonna give a return on investment until they're at least forty. So, I mean, why not zip around in a cool ass car Three of 'em.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "22:06-22:07",
    "speaker" : "Greg",
    "text" : "Selling cocaine."
  },
  {
    "text" : "Yeah. I think I saw that in Antonio Brown's video. Some guy in the background. Yeah, it was Travis Henry.",
    "timestamp" : "22:07-22:15",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Steve",
    "text" : "Holy shit. I feel like I heard a quote from him when they like asked him about it and he's like, there's nothing to do in Buffalo except fuck.",
    "timestamp" : "22:15-22:23"
  },
  {
    "timestamp" : "22:25-22:34",
    "speaker" : "Andy",
    "text" : "That's really great. Wasn't that LaShawn McCoy? It might have been Willis McGahee. Oh my god."
  },
  {
    "timestamp" : "22:35-22:35",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh boy. They've had some quality running backs come out of Buffalo. I wrote down some of the plus Beast mode.",
    "timestamp" : "22:36-22:43",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:43-22:49",
    "text" : "OJ Simpson? Yeah. Thurman Thomas. What were you gonna say, G?",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I said I I wrote there's like a A lot of the people that have a ton of kids are like really famous too. Like names you'd know.",
    "timestamp" : "22:49-22:56",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, let's hear them.",
    "timestamp" : "22:57-22:57"
  },
  {
    "timestamp" : "22:58-23:18",
    "speaker" : "Greg",
    "text" : "Down. So I'll give you some stats here. Cromartie, 12 with eight, Muhammad Ali, nine with five. Sean Kemp from the Supersonics, seven with six. Vander Holyfield, eleven with six. Wow. Brad Guerrero, eight with five. One of them, talk about return investment, is like in the MLB."
  },
  {
    "timestamp" : "23:19-23:23",
    "speaker" : "Mike Melo",
    "text" : "Yeah, Vlad Jr. That's he, you know, one out of 30 in bed."
  },
  {
    "timestamp" : "23:23-23:29",
    "text" : "Yeah. Out of my favorite, the God-fearing man himself, Ray Lewis, six with four.",
    "speaker" : "Greg"
  },
  {
    "text" : "Wait, wait a minute. You're leaving out you're leaving out Benjamin Watson, who has like nine kids with one. So let's give that man a round of applause.",
    "timestamp" : "23:30-23:39",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I was gonna say, yeah, Phil Rivers, he's got like eleven, right? Something stupid. Yeah. Yep. He's got himself a whole football team. Man.",
    "timestamp" : "23:42-23:50",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "23:51-23:56",
    "text" : "For Mohammed had noted, float like a butterfly, cum like a horse.",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh, I know what clip we're using to promote this podcast. It's gotta be the turn.",
    "speaker" : "Andy",
    "timestamp" : "24:00-24:06"
  },
  {
    "timestamp" : "24:06-24:09",
    "text" : "It's gonna be Mike's Levin one, right?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, it I we could make that a shirt, Greg, but I don't know anybody who would wear that in public. Yeah. Um Uh speaking like uh coming like a horse, the only pro bowler on this team uh was the one, the only Larry Senters, the fullback.",
    "timestamp" : "24:10-24:30"
  },
  {
    "text" : "Ooh, love Larry.",
    "timestamp" : "24:30-24:32",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "24:32-24:37",
    "speaker" : "Andy",
    "text" : "Yeah, who was third in receiving yards on the team and fourth in rushing yards."
  },
  {
    "speaker" : "Greg",
    "text" : "Huh. Because there's a lot of names I recognize like on that defense even.",
    "timestamp" : "24:38-24:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:42-24:52",
    "text" : "Yep. Oh yeah, I even got the defense. The only other name that I had for offense was tight end Jay Remers Remersma? I think I pronounced it."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh yeah.",
    "timestamp" : "24:52-24:53"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's a great fucking name. Um, and he looks like uh a poor man's Rob Bronkowski, which we can talk about later if you want. But yeah, let's get to the defense. This was yeah, there was some pretty big names on this defense. Uh defensive backs, Nate Clemens and Antoine Winfield.",
    "timestamp" : "24:53-25:12"
  },
  {
    "speaker" : "Greg",
    "text" : "Solid.",
    "timestamp" : "25:13-25:13"
  },
  {
    "timestamp" : "25:14-25:26",
    "speaker" : "Andy",
    "text" : "Yeah. Yep. Linebackers, I didn't really recognize any of these names. Brandon Spoon, which is another great name, who had two pick sixes on the year, which for a linebacker I feel like is a lot."
  },
  {
    "text" : "The rookie too.",
    "timestamp" : "25:26-25:27",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Uh Jay Foreman, who led the team with 101 tackles, don't remember him. Or Keith Newman. Oh, I also don't remember. Uh defensive line, though, you'll know these both of these names, I'm sure. Pats fan. Aaron Shobel. Shobel. Yep, who had his this is his rookie year. He had two sacks of Brady on the day. Would actually finish with we talked about this before, I don't remember when. Uh he is the person with the most sacks of Tom Brady Yeah, in Brady's career. Yep. And he's got like 14. But Aaron Schobel, that's uh that's a great little trivia for you, Aaron Schobel.",
    "timestamp" : "25:27-26:04",
    "speaker" : "Andy"
  },
  {
    "text" : "Where was um Jason Taylor on that list?",
    "timestamp" : "26:04-26:06",
    "speaker" : "Greg"
  },
  {
    "text" : "I want to say he was like second or third. I think he was second, yeah.",
    "timestamp" : "26:07-26:09",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:10-26:13",
    "text" : "I just felt like he sacked Brady a shitload.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "26:13-26:25",
    "speaker" : "Andy",
    "text" : "Yeah. And then I remember because we did it yeah, I think oh Mike, I think that was the uh the Dolphins game that we did, the first one. Yep. That Greg actually watched but uh talked about two weeks later."
  },
  {
    "timestamp" : "26:28-26:37",
    "speaker" : "Steve",
    "text" : "Either on the roof. Remember the Bill's Pats in 04. I have in my hand a game date program from that game."
  },
  {
    "text" : "Nice. Sweet. Well we'll we'll get there in probably five and a half years. So hang on to that.",
    "speaker" : "Andy",
    "timestamp" : "26:38-26:44"
  },
  {
    "timestamp" : "26:44-26:47",
    "text" : "Well, I've had it since 2004, so no worries.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "26:47-26:47"
  },
  {
    "text" : "Wait a minute. Andy, did we go to a um Brady Bletto game? Was it us? In Buffalo?",
    "speaker" : "Mike Melo",
    "timestamp" : "26:47-26:53"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, that's right.",
    "timestamp" : "26:53-26:54"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I came out to visit. We'll have to talk about that when that pops up.",
    "timestamp" : "26:54-26:58"
  },
  {
    "timestamp" : "26:58-27:14",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, yeah. That'll be good. Yep. Um speaking of fat bastards, the last name on defense was uh Pat Williams. That guy was legit. Yeah. That wasn't pot roast, was it? That was a different Williams that was called Pot Roast. Who is he?"
  },
  {
    "speaker" : "Greg",
    "text" : "That was a guy in the Broncos. Yeah.",
    "timestamp" : "27:14-27:16"
  },
  {
    "text" : "I thought his name was Williams too, though, wasn't it?",
    "timestamp" : "27:17-27:19",
    "speaker" : "Andy"
  },
  {
    "text" : "What about uh Keith the Tractor Trailer?",
    "speaker" : "Greg",
    "timestamp" : "27:19-27:22"
  },
  {
    "timestamp" : "27:22-27:24",
    "speaker" : "Andy",
    "text" : "I don't think he was on this team at this point."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "27:24-27:29",
    "text" : "I think Weren't they say when your guests left, they're like, oh, he's the he lost his buddy."
  },
  {
    "text" : "Yes, yeah, yeah, yeah. Um Yeah. He's like, oh, it's buddy Antoine Smith. Like, no, no, it's the big fat guy on defense that he used to play right next to Ted Washington. Oh, I remember Teddy. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "27:30-27:45"
  },
  {
    "speaker" : "Greg",
    "text" : "What are your what are your thoughts on the commentators, Andy?",
    "timestamp" : "27:46-27:49"
  },
  {
    "text" : "Uh do we want to get to that now?",
    "timestamp" : "27:50-27:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I mean we can't because I gotta look guys. I try not to bring this up because I feel stupid in that I don't know so much. But Brent Jones started football or not football. And every time this guy pops up, I can't escape it. I have to write three or four things because he confuses the hell out of me. So I mean yeah we can get into it if you guys want to help me out on this, but again, I don't I I I feel dumb bringing this up, but this guy just brings it out of me, I think.",
    "timestamp" : "27:52-28:20"
  },
  {
    "timestamp" : "28:21-28:26",
    "speaker" : "Andy",
    "text" : "I mean we we can we can dive right in if you want even though we haven't talked about the game at all yet."
  },
  {
    "timestamp" : "28:26-28:59",
    "speaker" : "Mike Melo",
    "text" : "Well, I mean this can help the uh the listeners in understanding the game a little bit better as we uh unravel it. All right. I mean you may as well we're talking about comedy. Let's do it. All right. Yeah, Brent Jones. Gus Johnson's all right. He toes the line, but Brett Brent Jones is something else. And um so uh the first one would be sometimes that ball is slippery when you get that pump going. And I'm like I'm confused. I he definitely did and I don't understand it. So can you fill me in on is it is a football or not football?"
  },
  {
    "text" : "It was like a sunny game too. Why would it be slippery?",
    "timestamp" : "28:59-29:02",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "29:04-29:13",
    "speaker" : "Andy",
    "text" : "I guess if you pump it up enough, it'll get like super Yeah, it's it's like the opposite of deflate gate."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And the ball gets super yeah, you it you can't grip it as well, so it kind of So it's like an Aaron Rodgers gate.",
    "timestamp" : "29:14-29:20"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:20-29:21",
    "text" : "Yes, yeah, yeah, yeah."
  },
  {
    "text" : "Okay. So that's what you guys think? It's like a um air thing?",
    "timestamp" : "29:21-29:26",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "If I'm being completely honest, I don't actually know what the fuck you're talking about.",
    "timestamp" : "29:26-29:29"
  },
  {
    "timestamp" : "29:30-29:32",
    "text" : "He said it, I swear.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Oh, I'm sure he did. I don't know if he knew what he was talking about.",
    "speaker" : "Andy",
    "timestamp" : "29:32-29:34"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "All right, so if anybody out there is still listening to this, you can fill us in on what that means.",
    "timestamp" : "29:35-29:40"
  },
  {
    "timestamp" : "29:41-29:42",
    "text" : "That'd be ideal.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:42-29:54",
    "speaker" : "Mike Melo",
    "text" : "Uh next one is Tom Brady able to step up into the pocket and put some juice on it. Is that football or not football? I I think that's football."
  },
  {
    "timestamp" : "29:54-30:09",
    "speaker" : "Andy",
    "text" : "Uh 'cause the pocket I think we may have talked about this before is is what the offensive line we have. No? Alright, so that's what the offensive line tries to create. Around Tom Brady to keep the the the defenders off of him. And like U-shaped. Yeah."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "30:09-30:13",
    "text" : "No, no, no, no. Wait, that's called why don't they call it a wall? That's called a pocket?"
  },
  {
    "text" : "Because it's curved, so they have to call it a pocket. You don't put things in walls, right?",
    "timestamp" : "30:13-30:19",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "30:19-30:22",
    "speaker" : "Mike Melo",
    "text" : "So what does putting juice on the pocket mean?"
  },
  {
    "timestamp" : "30:22-30:35",
    "speaker" : "Andy",
    "text" : "Uh, I think the juice was about the football and how hard he threw it because uh I gotta say Tom Brady can fucking huck a football back in 2001. Oh, okay. It's kind of like uh the high cheese in baseball. Okay."
  },
  {
    "timestamp" : "30:37-30:45",
    "speaker" : "Mike Melo",
    "text" : "Yeah, now I get it. How come Brett Jones didn't say that? Yeah, I don't know. Put some juice on it, baby. Okay, so that makes sense. So step up in the pocket and put some juice on it. Okay."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "30:46-30:46",
    "text" : "Yeah."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Um baby Uh this one he was talking about Rob Johnson. I don't know anything about Rob Johnson and I don't know if it pertains to this, but he said he needed about six inches and he has it. Is that football or not football? I don't know anything about him. Dick Cinch is hard. I well I don't think it was easy. I don't know what we're right. Well, guys, I don't know what we're talking about. Well, I mean, it makes a big difference. Six inches? Well it's a game of inches, right? So I figure yeah. Six inches is important. Right. If one inch is important and like how you use that one inch in a game of inches and six inches has got to be pretty good. Above average.",
    "timestamp" : "30:46-31:31"
  },
  {
    "timestamp" : "31:32-31:34",
    "text" : "Yeah, I I would think so.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:34-31:35",
    "speaker" : "Mike Melo",
    "text" : "So that's a football thing."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:36-31:37",
    "text" : "Game of men. Yep. Yeah."
  },
  {
    "timestamp" : "31:37-31:45",
    "speaker" : "Mike Melo",
    "text" : "Okay, cool. And then the last one, and this was the uh the most confusing for me, he was under pressure and had to get it off."
  },
  {
    "timestamp" : "31:46-31:50",
    "text" : "Why did you never been under pressure and had to get it off, Mike?",
    "speaker" : "Greg"
  },
  {
    "text" : "Uh I've never played football like this.",
    "timestamp" : "31:51-31:52",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "31:54-31:55",
    "text" : "Not in front of fifty thousand people, I don't think.",
    "speaker" : "Andy"
  },
  {
    "text" : "If you scream, you hear the garage door opening, you're like, oh no. Mom's home.",
    "speaker" : "Greg",
    "timestamp" : "31:56-32:01"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh, I I see what yeah, Greg. Jeez. Gross. Jeez. What the hell? I believe uh what was that?",
    "timestamp" : "32:02-32:15"
  },
  {
    "speaker" : "Greg",
    "text" : "It's now or never.",
    "timestamp" : "32:16-32:17"
  },
  {
    "timestamp" : "32:17-32:42",
    "speaker" : "Mike Melo",
    "text" : "I did have that scenario though, but I I was watching I think it was MTV programming in my room and I heard footsteps. So M T All right. Well thanks guys. I'm gonna I'm gonna try to understand these things a little bit better, but uh Brent Jones, he he he's he's a man of words. Now is this just a Brent Jones thing or it Gus Johnson would never say these things. How dare you?"
  },
  {
    "text" : "I mean, it hasn't just been Gus uh j hasn't just been Brent Johns. No but no, but he seems to ha bring out the best in in these questions.",
    "timestamp" : "32:42-32:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "He he did start this whole thing because it seems like everything he says ha is multi-layered and he's a little bit more intelligent than I am. So Yeah. And he's money.",
    "timestamp" : "32:53-33:02"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:03-33:18",
    "text" : "Yeah. He also uh got super excited when they were showing CMGI Stadium. I miss that. He was like, you know what my favorite part of that stadium is? Canadian blue steel"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh right, yeah.",
    "timestamp" : "33:18-33:19"
  },
  {
    "timestamp" : "33:20-33:23",
    "speaker" : "Andy",
    "text" : "I'm guessing Brent Jones is Canadian."
  },
  {
    "text" : "Stat check. I got it.",
    "speaker" : "Greg",
    "timestamp" : "33:24-33:26"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "You got it, Greg?",
    "timestamp" : "33:27-33:28"
  },
  {
    "text" : "Yeah, I got it.",
    "speaker" : "Greg",
    "timestamp" : "33:29-33:30"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Uh yeah, how come Gus Johnson do uh uh doesn't say anything like this?",
    "timestamp" : "33:31-33:36"
  },
  {
    "speaker" : "Andy",
    "text" : "He's from Santa Clara, California. Oh",
    "timestamp" : "33:36-33:39"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "33:40-33:43",
    "text" : "Maybe he has stock in Canadian steel."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "33:45-34:01",
    "text" : "Can we write Brent Jones an email about this? Maybe we should I wonder if we can have Brent Jones on Dude, let's do it. And I'm gonna try to understand everything that he says when he's on the podcast because I might have to go back, listen to it, and decipher it and ask you guys."
  },
  {
    "text" : "Uh he has some polit possible political aspirations.",
    "timestamp" : "34:02-34:06",
    "speaker" : "Andy"
  },
  {
    "text" : "He shouldn't he shouldn't do that.",
    "timestamp" : "34:08-34:09",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Not with the back in 2010.",
    "timestamp" : "34:11-34:14"
  },
  {
    "timestamp" : "34:15-34:29",
    "speaker" : "Mike Melo",
    "text" : "I see. Interesting. There's a lot of tape on what this man has said. And I don't know. Hey, he was uh tight end, Mike. What does that make you think? Uh that he played a position on offense."
  },
  {
    "timestamp" : "34:29-34:33",
    "speaker" : "Greg",
    "text" : "Okay. Yeah, you get confused easily, so I don't know."
  },
  {
    "text" : "Oh yeah, no. Oh that's fair. That's fair. I'm not gonna I'm not gonna go against that.",
    "timestamp" : "34:33-34:39",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "text" : "Sometimes we gotta dumb it down for you.",
    "timestamp" : "34:40-34:42"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. Yeah, no.",
    "timestamp" : "34:42-34:43"
  },
  {
    "text" : "Alright. Well speaking of speaking of tight ends Um, I don't think the pages have any, because do they?",
    "timestamp" : "34:44-34:52",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:53-34:56",
    "speaker" : "Mike Melo",
    "text" : "Then I haven't seen the complete pass for tight ends."
  },
  {
    "text" : "Wiggins is all team. Yeah, that's right. Wiggins had one catch because I remember it because he tried to juke a guy and he jumped and got his feet caught and landed square on his face. And had to come off immediately.",
    "timestamp" : "34:56-35:08",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, that's right.",
    "timestamp" : "35:09-35:09",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "It was one of it was one of those hits where the whole like when he hit the ground, though like everybody in the crowd went, oh And you're wondering if he's gonna get up because he's uh not an agile fella, that one.",
    "timestamp" : "35:10-35:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:22-35:25",
    "speaker" : "Mike Melo",
    "text" : "Wasn't there like uh Rutledge? Wasn't he on the team?"
  },
  {
    "text" : "I think that was I think that may have been 2000.",
    "timestamp" : "35:26-35:30",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:31-35:33",
    "speaker" : "Mike Melo",
    "text" : "Okay. I want to see. Well then yeah, Wiggins."
  },
  {
    "text" : "Yep. Uh yeah, he he didn't do enough for me to put any notes in. The only the only tight end in this game that got notes from me was was Jay Remersma. 6'5-252. Big fucker. Doesn't wear gloves. He was definitely a hard O. Uh and he was also the holder on the Buffalo Bills fuel goal attempts. So if any of you caught that. So fuck yeah.",
    "speaker" : "Andy",
    "timestamp" : "35:34-35:59"
  },
  {
    "speaker" : "Greg",
    "text" : "That's pretty awesome.",
    "timestamp" : "36:00-36:01"
  },
  {
    "timestamp" : "36:01-36:02",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "Um what are your thoughts on the the tight end progression for the Patriots? Because it went through an interesting like it was like nothing. Yeah. And then they went to that two tight ends with Hernandez and Gronk. And now it looks like they're coming back out with like The no tight end theory again.",
    "speaker" : "Greg",
    "timestamp" : "36:02-36:21"
  },
  {
    "timestamp" : "36:22-36:40",
    "speaker" : "Andy",
    "text" : "Well I think well Belchak's always consistently drafted tight ends. He just hasn't he didn't have any success until the end as Gronkowski. Yeah, because I mean he drafted Watson he drafted, um Daniel Graham, yeah, Fourier. Like he's he's been drafting tight ends for his whole career."
  },
  {
    "text" : "Wait, I thought Fourier was a trade.",
    "timestamp" : "36:40-36:42",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "36:43-36:49",
    "speaker" : "Andy",
    "text" : "Well, I may have been. But yeah, he he likes Tibulano. Sorry. I I got confused him at Wiggins for whatever reason."
  },
  {
    "timestamp" : "36:50-36:53",
    "text" : "That was such a weapon when they had Hernandez and Gronk together.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "36:53-36:54",
    "text" : "Oh god yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "That's the one time when I remember thinking like there's there's nothing people can do to stop this.",
    "timestamp" : "36:54-36:59",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "You can't, because they can do whatever they want.",
    "timestamp" : "36:59-37:01"
  },
  {
    "timestamp" : "37:03-37:10",
    "speaker" : "Mike Melo",
    "text" : "Well and that hasn't really been replicated since. So you'd think that somebody would give it a shot, but"
  },
  {
    "timestamp" : "37:10-37:21",
    "text" : "I think finding somebody in that tight end position is hard to do. Sorry. Got our own Brent Jones up in here. Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "37:22-37:58",
    "speaker" : "Mike Melo",
    "text" : "But yeah, no, that that was pretty great. I mean, Gronkowski is like his own thing, right? So I mean that was what it was. I don't know man. I think the the uh the game's changing too. We're like now in the game I think there's like three dominant tight ends, they're all super fast. Agile and then like you don't really hear about it with like anybody else and with teams like um Baltimore, you know, they got like a whole different system. Um So yeah, I don't know. I mean obviously the Chiefs have a good one, uh Bengals, you know, off and on, but you don't really hear about it too much anymore for some reason."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, the the Ravens are kind of doing it this year where they're like tight ends have more catches than their wide receivers. Oh really? I didn't know that. Yeah, and they're rotating like three of them in there.",
    "timestamp" : "37:58-38:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah Yeah, I think it's i I mean the NFL is all cyclical anyway, so it's a matter of time. You're actually starting to see the resurgence of fullbacks come back too, you know, like with the 49ers as well as the Ravens and things like that.",
    "timestamp" : "38:08-38:22"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, it'd be like just a personnel thing too, right?",
    "timestamp" : "38:22-38:24"
  },
  {
    "text" : "Yeah. Yeah, but but I think that those all those sorts of positions are now being asked to do more. So you have to have a fullback who can catch now. Although I suppose if you're looking at 2001, you've got Mark Edwards, who is like at least through the first three or four weeks, was like the weapon that they kept going to. What about Sam Gash?",
    "speaker" : "Andy",
    "timestamp" : "38:24-38:44"
  },
  {
    "text" : "You remember him?",
    "timestamp" : "38:44-38:45",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "38:45-38:47",
    "text" : "Yeah, he was kind of a one-trick pony though.",
    "speaker" : "Andy"
  },
  {
    "text" : "He was uh Yeah, but he he I thought he was good for a pass here and there.",
    "speaker" : "Mike Melo",
    "timestamp" : "38:47-38:50"
  },
  {
    "text" : "Yeah, but so is Brian Cox. So I mean True.",
    "speaker" : "Andy",
    "timestamp" : "38:50-38:53"
  },
  {
    "speaker" : "Greg",
    "text" : "What did uh what did the guy on the Patriots say? Say, I see motherfuckers and I hit them or something.",
    "timestamp" : "38:54-38:59"
  },
  {
    "speaker" : "Andy",
    "text" : "I run through a motherfucker.",
    "timestamp" : "38:59-39:01"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Offense, defense, or special teams.",
    "timestamp" : "39:01-39:05"
  },
  {
    "timestamp" : "39:05-39:15",
    "speaker" : "Mike Melo",
    "text" : "Too bad he couldn't r run for one yard. I know, sorry. Speaking of two players when they hear it."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:16-39:23",
    "text" : "Speaking of two-way players though, um did anybody else see that Terrell Buckley was playing wide receiver again this game?"
  },
  {
    "text" : "Yeah, that really competes. That's silly.",
    "speaker" : "Mike Melo",
    "timestamp" : "39:23-39:25"
  },
  {
    "timestamp" : "39:25-39:40",
    "speaker" : "Andy",
    "text" : "Yeah. And they keep chucking bombs to him because uh that was Brady's interception in this game was uh they they decide to to take a shot and then he threw a pick. But that shot was too Terrell Buckley again, which is yeah, very strange."
  },
  {
    "timestamp" : "39:40-39:44",
    "speaker" : "Greg",
    "text" : "I was like watching In and Out and then I came back to that play."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "39:44-39:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "39:44-39:48",
    "text" : "I just saw the two of them like jumping up for a jump ball and I'm like, what the hell's going on here?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, why is he number 27?",
    "timestamp" : "39:49-39:50"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "39:50-39:55",
    "text" : "That makes no sense. Seemed like a bad ball too, or bad decision, obviously."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I mean I I think it was one of those design because I th uh I want to say the pages had just got the ball back, but I think that they had just gotten like uh",
    "timestamp" : "39:55-40:05"
  },
  {
    "timestamp" : "40:07-40:11",
    "speaker" : "Greg",
    "text" : "Uh I can't find it, my yeah they got it back the next play."
  },
  {
    "timestamp" : "40:11-40:20",
    "speaker" : "Andy",
    "text" : "Yeah, yeah. So yeah, Bills, yeah, the Bills went through oh the the Patriots scored the touchdown to Falk, the Brady to Falk off of Troy Brown's nice punt return."
  },
  {
    "timestamp" : "40:20-40:22",
    "text" : "Wait, are we getting ahead of ourselves here?",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "40:22-40:34",
    "text" : "No, this is this first quarter. Okay. And then the bills went three and out. And so then like the the first play off of the next punt return, but he's he took that shot on the on the first play.",
    "speaker" : "Andy"
  },
  {
    "text" : "Gotcha.",
    "timestamp" : "40:34-40:34",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "So I think they're just trying to like put the game away, you know?",
    "timestamp" : "40:34-40:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Didn't work.",
    "timestamp" : "40:37-40:38"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:39-40:50",
    "text" : "No. But uh I thought Troy Brown I thought the uh the Patriots special teams in general had a pretty good game. Well actually I don't think anybody really had a good game in this."
  },
  {
    "text" : "No, I mean Troy Brown had that 30 yard like punt return in the first quarter that was pretty awesome.",
    "timestamp" : "40:50-40:54",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "40:54-40:56",
    "speaker" : "Andy",
    "text" : "Right. On a 28-yard punt."
  },
  {
    "timestamp" : "40:56-41:02",
    "speaker" : "Mike Melo",
    "text" : "Yeah, which we'll get into the punting because that was pretty cool."
  },
  {
    "speaker" : "Andy",
    "text" : "Let's do it. Let's do it.",
    "timestamp" : "41:02-41:03"
  },
  {
    "timestamp" : "41:07-41:08",
    "text" : "Brian Mormon.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Give it to me. Give me some Brian Mormon.",
    "speaker" : "Andy",
    "timestamp" : "41:08-41:10"
  },
  {
    "timestamp" : "41:11-41:44",
    "speaker" : "Mike Melo",
    "text" : "Yeah, man. I'm gonna say this was almost like the uh best moment of the game for me. But I would say the best play of the game is Brian Mormon, Bill's punter. He had a 20-yard punt from the tw his own 20-yard line to the 40. And on that play, which is pretty sweet, um, Akeem Akbar actually touches the ball accidentally and the refs miss it. So the Patriots should have lost that ball and they they caught a break. So that play in general was amazing. A 20-yard punt Uh they make it to like midfield."
  },
  {
    "text" : "Yeah, that that bounced backwards. Like it hit the four like it hit like the forty-five and bounced backwards to the forty.",
    "speaker" : "Andy",
    "timestamp" : "41:44-41:49"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yep, and it was that that would be topped by another punt from Brian Mormon from his uh from the 50-yard line and made it to the 35. That's a 15-yard punt. Oh boy. This is pretty awesome.",
    "timestamp" : "41:50-42:05"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:06-42:15",
    "text" : "He averaged his his uh yards per punt On the day, he averaged 27. 2 yards per point. Averaged."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "42:16-42:17",
    "text" : "That is amazing."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:18-42:18",
    "text" : "I didn't see him."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "What what was wrong with him?",
    "timestamp" : "42:18-42:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh most of the punts were into the wind. Like it was a super windy game. And so Uh it seemed like all of his punts were towards the open end of the stadium. And like they were all really, really bad. He did a line drive one. And it went 28 yards and Troy Brown returned it for 32 or something like that. So he didn't try that again, but he kicked them straight up and they s they just hung.",
    "timestamp" : "42:20-42:48"
  },
  {
    "timestamp" : "42:49-42:50",
    "text" : "Oh, Brian.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "42:50-42:51"
  },
  {
    "text" : "Poor not.",
    "speaker" : "Greg",
    "timestamp" : "42:52-42:52"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:53-42:57",
    "text" : "Not great. Five punts, 136 yards, average 27. 2."
  },
  {
    "timestamp" : "42:57-43:05",
    "speaker" : "Greg",
    "text" : "You know, that's what happens in one in six seasons, you know? Yeah, I mean into the wind, as they say."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "You'd think like that they would try some kind of different technique given that it was pretty rough every time, but they just kept going for it.",
    "timestamp" : "43:06-43:15"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:16-43:49",
    "text" : "Yeah, it wasn't wasn't great. I but I mean the kicking game in general was awful. Uh they showed some stat about uh Adam Vinateri kicking against the Bills and how bad he is. Yeah. Yeah, like he was like a 70 or 80% kicker normally, but in this game against the Bills he was like fifty something percent field goal percentage, which is kind of strange. Oh yeah, here it is. Vinateri is 43 for 54 for 79. 6%, so almost 80% on field goal attempts."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Which I thought he was like a lot better at this point than that.",
    "timestamp" : "43:49-43:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And it says his one week has been the Bills against whom he's managed only fifty-eight point three percent field goal percentage.",
    "timestamp" : "43:53-44:01"
  },
  {
    "timestamp" : "44:01-44:02",
    "speaker" : "Mike Melo",
    "text" : "And he missed another one in this game."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:03-44:27",
    "text" : "He missed two. He missed both of his field goals. So 0 for 2 on field goals, hit all three of his extra points. So I think you can just blame the wind in general. It looked like a bunch like a couple of deep balls hung too and and did some weird shit. So This was one of those old Foxboro games where the wind actually mattered. As opposed to you hear it now where they say it matters, but you never really see it actually take effect."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "You're absolutely right though that uh like Most everyone had a crap game. I'm looking at Brady's numbers and he was 15 for 21, which isn't bad for 107 yards. He had a touchdown interception. Um Kevin Falk was the leading receiver with 29 yards. Yeah. He did good, yeah. The the run game was solid, you know. Twenty for a hundred and two touchdowns. It's that's What you want. It's good.",
    "timestamp" : "44:28-44:56"
  },
  {
    "speaker" : "Andy",
    "text" : "It is, but I think that was also skewed by the the run at the end, the big was it, forty something yard run. That's true.",
    "timestamp" : "44:56-45:03"
  },
  {
    "text" : "But he was running some tough yards too, though. Like he was breaking tackles. Oh yeah.",
    "timestamp" : "45:04-45:09",
    "speaker" : "Greg"
  },
  {
    "text" : "You know? Well, because that's the thing. Let's talk about Antoine Smith too, because he was a former Buffalo Bill. And in 98, he'd actually run for 1,100 yards and eight touchdowns. And then they got a new, I think, offensive coordinator, head coach or something like that, a whole new system. And basically they said like the commentators were saying that um the the new yeah, he ran for the new coach just basically didn't like him. So he just stopped playing him. So then he ran for 600 yards and then in ninety-nine then three hundred yards in two thousand.",
    "timestamp" : "45:09-45:47",
    "speaker" : "Andy"
  },
  {
    "text" : "Who is Rob Johnson blowing in that front office? Yeah, and we got Antoine Smith, both studs.",
    "timestamp" : "45:47-45:55",
    "speaker" : "Greg"
  },
  {
    "text" : "Is that a uh football question or not football question, Greg? A little bit of both. Yeah",
    "speaker" : "Mike Melo",
    "timestamp" : "45:55-46:02"
  },
  {
    "speaker" : "Andy",
    "text" : "But yeah, I mean he spent Antoine Smith spent it like the entire week before and all the the postgame saying about how this wasn't like a revenge game. He's not angered anybody because The people that gave up on him weren't even there anymore, like coach wise and stuff. But he still was running like he was pissed off. Like I think this is the hardest I've seen him run. So far this season.",
    "timestamp" : "46:03-46:25"
  },
  {
    "text" : "He's still got like clearly got a ton left in the tank, too. I mean obviously I can say we know that now, but Why would you give up on a guy like that?",
    "timestamp" : "46:26-46:35",
    "speaker" : "Greg"
  },
  {
    "text" : "The same reason you give up on a guy like Doug Flutie?",
    "timestamp" : "46:35-46:38",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. Yeah, it could be the soul.",
    "speaker" : "Greg",
    "timestamp" : "46:38-46:42"
  },
  {
    "text" : "And imagine like you're you're taking over a team, you kind of want your to put your stamp on it. Like I know a lot of guys want to distance themselves from like anybody that the GM put in place beforehand. So It's probably a situation where he just wanted his own guys and to prove a point, whatever.",
    "speaker" : "Mike Melo",
    "timestamp" : "46:42-46:57"
  },
  {
    "text" : "Yeah, that's a good point.",
    "timestamp" : "46:57-46:58",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "46:59-47:00",
    "text" : "Yeah.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "47:00-47:03",
    "speaker" : "Greg",
    "text" : "Yeah, I'd agree with that. It's bullshit though. It You know?"
  },
  {
    "timestamp" : "47:03-47:04",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It is. I mean, yeah. You know, play to the talent that you have. I mean, look at what they've done with the the Ravens this year. It's like",
    "timestamp" : "47:05-47:12"
  },
  {
    "timestamp" : "47:13-47:14",
    "speaker" : "Andy",
    "text" : "Mm-hmm."
  },
  {
    "speaker" : "Greg",
    "text" : "You have a running quarterback that can do things like that, build the system around him.",
    "timestamp" : "47:14-47:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. Yeah.",
    "timestamp" : "47:18-47:19"
  },
  {
    "text" : "Too much ego.",
    "timestamp" : "47:19-47:20",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I mean he had like decent numbers, like even riding the bench. Like they weren't horrible. So I mean to your point, they probably should have uh trusted him with the football a little bit more.",
    "speaker" : "Mike Melo",
    "timestamp" : "47:20-47:30"
  },
  {
    "text" : "We should be coaches.",
    "timestamp" : "47:32-47:34",
    "speaker" : "Greg"
  },
  {
    "text" : "I think so. I'll I mean I'm I'm in line for the Belichick position whenever he wants to uh give that up.",
    "timestamp" : "47:34-47:41",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:41-47:45",
    "text" : "Will you positional coach type of guy, Mike, you know?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well, I don't know. I mean I'm I'm willing to give it a shot, but I'm not freaking waiting around twenty more years to accept the job, believe me. Yeah. Oh man. Dude, Joe Joe Judge, special teams guy. Head coach of the Giants, see? So there is an avenue there, guys.",
    "timestamp" : "47:45-48:02"
  },
  {
    "speaker" : "Steve",
    "text" : "Mike, Mike, how are you gonna be a coach when you don't even know what's football and not?",
    "timestamp" : "48:02-48:06"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's uh damn it, you're right.",
    "timestamp" : "48:08-48:10"
  },
  {
    "timestamp" : "48:13-48:23",
    "speaker" : "Andy",
    "text" : "Speaking of not knowing their football. Uh I thought, like we were talking about everybody not having a great game, uh, Brady's play at the end."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "But we're talking about the end already? Because man, I mean, there's just like a lot of shit football every quarter.",
    "timestamp" : "48:24-48:31"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know if you've noticed, but we are all over the fucking place this week. So yeah, I'm gonna jump to the end and we can jump back later. Don't worry about it.",
    "timestamp" : "48:31-48:38"
  },
  {
    "timestamp" : "48:38-48:39",
    "speaker" : "Mike Melo",
    "text" : "All right, fair enough. Fair enough."
  },
  {
    "timestamp" : "48:39-49:33",
    "text" : "Because I wanted to point out Brady's uh kind of very unbrady-like rookie mistake at the end there. Pat's up by two scores and they're running the ball with relative ease. And for some reason the pats start calling like play action passes when they have no reason to. And so Brady fakes the play action, rolls to his right, and there's a defender like in his face. So he tries to like I I want to say he he was trying to juke. But if you've seen Tom Brady run, you can kind of imagine what that looks like. And so he doesn't and the the the defensive end just kind of slaps the ball out of his hand and then kicks it twenty yards backwards and the Bills end up recovering it and scoring a touchdown like two plays later. To make the game uncomfortably close.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, let's say it was a learning experience for Brady this game because it was pretty awful throughout. Um, but I don't know if it's entirely his fault because um they there was I think six sacks on him by the time the fourth quarter started. Yep So and I think in the by half he was sacked like f four or five times. So I don't think he's been pressured like that um this season.",
    "timestamp" : "49:34-50:01",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he was well, other than the the Miami Dolphins game, which also had that almost exact play where Brady fumbled the snap and then the the was it the right guard Did a beautiful back heel to kick a back 20 yards at the the Dolphins recovered for a touchdown. But yeah, he was sacked seven times in this game.",
    "timestamp" : "50:01-50:19"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "50:20-50:23",
    "text" : "Seven, man. And yeah, he fumbled twice. He had the pick."
  },
  {
    "text" : "Yeah, the bill quarterbacks were sacked five times. So this was not a an offensive display by any stretch of the imagination.",
    "speaker" : "Andy",
    "timestamp" : "50:24-50:33"
  },
  {
    "timestamp" : "50:34-50:39",
    "speaker" : "Greg",
    "text" : "Right and lead the league every year and sack to drop back ratio, I guess."
  },
  {
    "text" : "Who did?",
    "timestamp" : "50:40-50:40",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Rob Johnson. Yeah, I can see it.",
    "timestamp" : "50:41-50:43"
  },
  {
    "timestamp" : "50:43-51:18",
    "speaker" : "Mike Melo",
    "text" : "Yeah, I don't know. The um uh Brady's decisions at the end though, like you were saying, uh I Uh I wouldn't say that this game was a blowout because they were up by it what was it like 14 uh whatever it was like less than two touchdowns? 14-3. 14-3. And then After that play, yeah, Pierless Price got the touchdown, so it's 1411 after two-point conversion. So Yeah, that that one decision made it a close game, even though it shouldn't have been. To your point, they should they could have just run the timeout and I don't know why they were getting all cute and fancy, but"
  },
  {
    "timestamp" : "51:18-51:34",
    "speaker" : "Andy",
    "text" : "Yeah, that's that's what I was wondering. Is like, I mean, you're still on a rookie quarterback who's been sacked seven times. Well, probably six times. I suppose that probably counted as a sack, the fumble. Uh Why are you having him roll out on a bootleg?"
  },
  {
    "timestamp" : "51:34-52:04",
    "speaker" : "Mike Melo",
    "text" : "Right. And uh the Bills, they went for an onside kick and almost got it. Uh it was uh recovered by our very own uh Mike Vrabel. Yes. Um you know, sore spot right there, but Um yeah, they almost got the onside kick. So if they got it, this would have been potentially a different game. And yeah, we're not even at this point I don't think we were used to seeing uh Brady make, you know, these these decisions. So"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:04-52:04",
    "text" : "Yeah."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "52:05-52:32",
    "text" : "It was uh and and it was interesting to I don't I'm sure you saw some of this, but in reading some of the articles because now there's about fifty thousand articles written every game um that we have to sift through uh during this time. But uh They were uh talking to him about it and he did say that it was a learning experience and it was I think the first time where he was coming off a little bit more humble than like confident, um which was I think probably good for this moment in the season."
  },
  {
    "timestamp" : "52:32-52:42",
    "speaker" : "Andy",
    "text" : "Yeah, the quote that I wrote down was uh you'd like to play great every this is Tom Brady talking, you'd like to play great every week, but I'm finding out that's not always the case in this league."
  },
  {
    "timestamp" : "52:42-52:46",
    "speaker" : "Mike Melo",
    "text" : "Yeah, so that was a little different than what we've heard before. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. And then in that same article was the quote yesterday certainly was an education in adversity for the second year novice. He learned he could overcome a rash of misadventures. He completed fifteen of twenty-one passes, but they traveled only 107 yards. His longest connection was a 38-yard to Anjuan Winfield of Buffalo.",
    "timestamp" : "52:47-53:05"
  },
  {
    "timestamp" : "53:06-53:35",
    "speaker" : "Mike Melo",
    "text" : "Yep, that's pretty rough. Again, it's it's pretty uh amazing though that Belichick stuck with him because I I don't know. I mean we saw with Stidum, you know, he throws one pick six and you know he he never plays again. Uh so you know and and this is right around the time that Bletto was starting to come back. Um I think they were expecting him to be ready the next week. So the fact that Brady won that uh amazes me looking back on it."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:35-54:46",
    "text" : "Yeah, I'm I'm a little surpr uh uh it almost makes you feel like the situation is different. I mean, I don't know if if things would have been different if say Jimmy Garoppolo had stayed healthy for those first four games. A few years ago. And if he had if he had won all four of those games, if you would have seen something similar. But exactly. I don't I don't know. Wow. Because it feels like a similar situation where you know that the start is coming back, but if the the guy that plays those first four games gets you to this point. I mean, obviously this is more than four games, but if he gets you to this point, I and I think at that point Garoppolo was playing better than before he got hurt than Brady was playing here. So I I I don't I'm not quite sure how that would have worked out. But yeah, you're right. Um Bledsoe um it was announced that he was cleared by the medical staff to play this the the following week here against the Rams coming up. So I'm assuming that's gonna be the whole next week of articles."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "54:50-54:57",
    "text" : "Yeah, that's true. I mean, and it was it wasn't Politech's guy. I mean he had a lot of picks as usual."
  },
  {
    "text" : "I mean it's up but I you know I think I think the whole thing was that",
    "speaker" : "Greg",
    "timestamp" : "54:58-55:02"
  },
  {
    "timestamp" : "55:03-55:08",
    "text" : "Like the only thing that team had offensively was Drew Bledsoe. And he dragged them to five and eleven.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "55:10-55:59",
    "speaker" : "Mike Melo",
    "text" : "Right. I mean Belichick though, uh he's a decision-making, you know, guy, right? So I mean Brady, Brady makes sound decisions for the most part, great game manager at this point, didn't make a lot of mistakes. But I mean obviously, you know, he references Brady now as iconic in in Boston and for the Patriots. Well, Bletto was pretty iconic as well at the time. Oh yeah. So I don't know if it was the easiest decision. I mean uh again it obviously helps because it was Parcel's guy and not his own. Right But yeah, to your point, I mean I wonder what would have happened with the Garoppolo thing. I mean, obviously, luckily it happened the way that it happened, they made another three Super Bowls, but Uh that's a good point. I don't know how it would have played out if uh Brissett didn't uh jump in there."
  },
  {
    "text" : "All right. So anything anybody else have anything they want to touch on in this game?",
    "speaker" : "Andy",
    "timestamp" : "56:00-56:05"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "56:05-56:09",
    "text" : "Um Other than that it was uh absolute crap."
  },
  {
    "text" : "Uh it was a bit of a slog to get through.",
    "timestamp" : "56:09-56:12",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:12-56:14",
    "text" : "Well, good thing I didn't watch it then."
  },
  {
    "timestamp" : "56:16-56:18",
    "speaker" : "Andy",
    "text" : "Way to break the fourth wall, Steve."
  },
  {
    "speaker" : "Steve",
    "text" : "I know.",
    "timestamp" : "56:18-56:19"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Thanks a lot. All right. In that case, our uh Steve, did you wait, way, way, way, way, wait. Did you you end up watching the highlights at least? No, nothing. Not even didn't you? Alright, good for you. Okay.",
    "timestamp" : "56:19-56:30"
  },
  {
    "timestamp" : "56:30-56:39",
    "speaker" : "Andy",
    "text" : "So you know what? The I I actually found highlights because well I assume Greg wouldn't watch the game, so Uh he proved me wrong, so thanks, Greg."
  },
  {
    "timestamp" : "56:39-56:40",
    "speaker" : "Greg",
    "text" : "I watched the first half."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:41-56:46",
    "text" : "There you go. But the highlights I found were actually NFL primetime highlights."
  },
  {
    "timestamp" : "56:46-56:51",
    "text" : "Yeah, I watched those too. Yeah. Just in case. I love those.",
    "speaker" : "Greg"
  },
  {
    "text" : "Dude, I I will say um one of the on top of the bad play, obviously, um there were so many flags on the Bills and Patriots. It was almost painful to sit through. I think the announcers were getting a like a little antsy too, but obviously not, you know, the Belichick um type of team and and whatnot that we're used to, but so many on both sides. Like so I obviously the the referees were shit or something. Yeah, they weren't great. I don't know, that was rough. Um I think like it'd be interesting to touch on some of the stuff that was going on around this game as well. Um some of the notes that he had, Andy, on Terry Glenn I thought were pretty interesting. Uh around this time.",
    "timestamp" : "56:51-57:36",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:37-58:35",
    "text" : "Yeah. Uh yeah, here we go. So this is still kind of in the the peak Terry Glenn saga of will he ever play for the Patriots again? And the the story that came out in kind of the aftermath of last week's game on Tuesday in the Boston Globe was that Terry Glenn has depression. And uh it was a quote is Glenn confirmed that chronic depression is the physical disability cited as the reason the receiver was unable to take his mandated drug test at the appointed time during the offseason. that tardiness earned Glenn a four game suspension at the start of the season. That is not to be confused with the season long banishment Bellatreck charged to impose when Glenn bolted from training camp because he felt the team wasn't being supportive enough in his protest of the league sentence. Right. So now we get into like the whole like housewives of Orange County."
  },
  {
    "timestamp" : "58:35-58:41",
    "speaker" : "Mike Melo",
    "text" : "Hey, I don't necessarily agree with that. You son of a bitch. I could tell it in your voice."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:41-58:43",
    "text" : "All right, give it to me then. Give me your side of this."
  },
  {
    "text" : "Well, I don't know. It's tough because um I feel like for them to be talking about depression, that was like Uh almost like ahead of its time because you i I I I didn't really hear this kind of stuff being talked about. It was sort of a taboo back then. Um And for us to hear this, I mean obviously he's putting it out there at the time, but for us to hear this without like social media, um, there's uh definitely a stigma attached to it. Now Does he advance that, you know, lessening of the stigma? I don't know because I don't know if he was using it to justify his um you know, his actions uh to provide an excuse or if he was actually dealing with this. But we do know that he had, you know, substance issues. We see a little bit of that with uh Josh Gordon. Um and I you know, he hasn't necessarily described depression, but I know that it can, you know, it it there's a lot of things that go into you know, addiction, depression, um, anxiety, and we're finding out a little bit more about that now. Even guys like Antonio Brown where we're We're not quite sure what's going on. He seems like he's just kind of showboaty. Like there could be something a little bit deeper, a little bit of depression, who knows? Um but we do know that with Terry Glenn it manifested in substance abuse. So Maybe the way that he went about doing it wasn't the right way, but I feel like the infrastructure wasn't in place for sure back then to help a guy who's dealing with like problems. And like Maybe I'm off base and maybe he was sort of like using that as a crutch or like a reason to get because there was also a dispute where The Patriots had paid him, I think, eleven million dollars and they were withholding uh eight million dollars of a signing bonus because of all this. And, you know, that was sort of his reasoning for trying to combat that. So again Is it the Antonio Brown thing where it's like, hey, I'm gonna blame everybody else, I'm gonna put my blames on this or that, um, and I want my money back? Or is it that he was actually dealing with that and it just seems like an excuse because we didn't really like hear that kind of stuff back then.",
    "timestamp" : "58:44-01:00:47",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Right. And I think that's a criticism. It's not that whether or not he has chronic depression or anything like that, which I I mean looking back on it now and kind of the tragic way that he ended, it's probably pretty obvious that yeah, he had at least something, or whether it was chronic depression or or something even more than that. I think it was it's pretty obvious that there was something going on with him. Um But yeah, the criticism was that this came out however many months after the fact. And now why is this coming out all of a sudden when there's this like protracted legal battle? Right like at the time. Like why why didn't it come out at the time? And I thought like my whole the reason for my comment about like you know Housewives of Orange County was just the whole reason why uh of of Glenn like basically leaving training camp because the team wasn't being support enough of him sort of thing.",
    "speaker" : "Andy",
    "timestamp" : "01:00:47-01:01:46"
  },
  {
    "timestamp" : "01:01:46-01:02:13",
    "speaker" : "Mike Melo",
    "text" : "Right. I mean and uh you know obviously I'm giving you shit, but um to your point, it it it's just tough to uh assess that situation, especially without knowing what was going on without social media So it's just what we know based on what Terry Glenn told us and the timing of it. I gotta go guys. All right. Is that it? Is he just gonna say that and leave? Yep. Thanks, Steve. All right."
  },
  {
    "speaker" : "Andy",
    "text" : "See ya later.",
    "timestamp" : "01:02:13-01:02:13"
  },
  {
    "timestamp" : "01:02:14-01:02:16",
    "text" : "Who do we have left? Is Greg still here?",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Uh no, he left too. Just me and you.",
    "speaker" : "Andy",
    "timestamp" : "01:02:17-01:02:19"
  },
  {
    "timestamp" : "01:02:19-01:02:33",
    "speaker" : "Mike Melo",
    "text" : "Awesome. Way to go, guys. Way to You know. Well we knew Greg was leaving, so right. Way to let them uh viewers know. But anyways, to to wrap that up, I mean Oh, I I I don't have to go."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:02:34-01:02:36",
    "text" : "Not just sad you have to go."
  },
  {
    "text" : "Fuck outta here. Bye. Did he? Where? Oh, there's a chat here. He's gotta say bye to the viewers, man.",
    "timestamp" : "01:02:37-01:02:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:50-01:02:51",
    "text" : "Also benefit the viewers.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I'm cutting this whole thing out. We're just gonna play it off like you were.",
    "timestamp" : "01:02:51-01:02:54"
  },
  {
    "text" : "Oh no, this is leave it in there, man. Let it be messy. We'll see. Let it be messy.",
    "timestamp" : "01:02:55-01:03:02",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Steve",
    "text" : "No.",
    "timestamp" : "01:03:03-01:03:03"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "But all right, man. Good chatting.",
    "timestamp" : "01:03:04-01:03:05"
  },
  {
    "timestamp" : "01:03:06-01:03:06",
    "text" : "Night.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:03:07-01:04:18",
    "speaker" : "Mike Melo",
    "text" : "Later. Um, I think you should leave that all in there because this is life, and whoever's listening at this point, yes it is. And Speaking on that, the messiness of uh the Terry Glenn situation. Yeah. So yeah, to your point, um he It it did seem like he he you know he did some things like he missed some drug tests for whatever reason at the time. And then yeah, months later he said that it was because of that. Now it doesn't it doesn't mean that he's not dealing with that. Maybe he is using that to justify it later as a like legal way. But I just thought it was interesting because I didn't I didn't really remember this going on. Maybe I was a little bit too young to, you know, understand But uh I think it is an interesting thing because a lot of the articles that um you had uh put up um that I was looking over, it was like about you know, they were interviewing doctors and trying to figure out from psychiatrists if you know, how how this manifests itself and like, you know, uh people didn't really know how to deal with the mental health aspect of athletics um back then. I don't think we're at the point where we we know what how to handle that now."
  },
  {
    "speaker" : "Andy",
    "text" : "No. But yeah, I mean this was before CTE was even a f like uh a thought what could be right a a possibility. But yeah, I think you're right. And even in the articles, it all all the Even the explanations from these doctors felt really almost simplistic and you could you could almost tell that there hadn't really been a lot of emphasis on on that side of things. Um but it wasn't even just the the the depression and stuff because there was there was another article too folk like specifically focusing on Terry Glenn's mental health. And the quote that I I pulled from that one was um The Norfolk County District Attorney's Office dismissed the felony intimidation of a witness charge against Glenn, stemming from a May sixteenth incident in which he allegedly assaulted Kimberly Combs, the mother of Glenn's six-year-old son.",
    "timestamp" : "01:04:18-01:05:13"
  },
  {
    "text" : "Right, and I saw that and I I didn't remember that happening either. So again, I don't know if this was like public knowledge um or maybe I wasn't paying attention to it because I doubt I was reading newspapers and like, you know, around this time, but Um, I mean, obviously we would hear about it more uh with the social media aspect of today, but I just thought it was interesting. I mean and It it it's also I don't know, it it's it's a tough thing to th talk about because it is a very real thing. I think that now a lot of more people um understand what it is um or at least experience it a little bit more and are willing to talk about it. Um, is it fair that Terry Glenn was using it the way that he did? Again, probably not because it doesn't necessarily advance uh the study and understanding of depression. and anxiety and all these things that you know I think is very much in play today. But um it it was very interesting to to hear that. And obviously You know, if you're dealing with depression and anxiety, you're trying to get help, that also doesn't excuse behavior like what he was accused of. And um you know, it doesn't help that situation either in getting that discussion going. But I do think it's uh it's interesting because Nowadays and and I think social media has a lot to do with that, but we see a lot of athletes dealing with this and just people in their everyday life. Um And now we're just starting to to talk about those things and and try to figure out as a society how to deal with it. But can you imagine like twenty years ago dealing with it? If he in fact was, I don't know.",
    "timestamp" : "01:05:14-01:06:49",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Uh yeah, I mean I mean it sounded like he's he was definitely dealing with something, whether w whatever it it is or turned out to be. Um You know, shades of even like an Aaron Hernandez or like you're talking about uh Antonio Brown, like there's There's just things going on. Like this this this does feel very similar. Like the more that we get into it, it feels very similar to an Antonio Brown situation.",
    "timestamp" : "01:06:49-01:07:18",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07:18-01:08:39",
    "text" : "Right. I don't I'm not seeing anything uh substance-wise with him um at the moment, but there is like, you know, a lot of the illegal stuff up in the air. And You know, hopefully, I mean he said he's talking to a therapist. I don't know if Terry Len was at the time. Um, but then again, I I don't know if this is in interesting uh for anybody who's listening or not. Well I'm fascinated by this stuff because also if you're a football player, let's say you're Terry Glenn, um, you know, and Parcells was already like on them a little bit for being soft and this and that. That's not necessarily the environment that like promotes you to share your feelings or at least explain that like you know things don't feel right. And I don't know. It must have been tough. And like you said, for Aaron Hernandez, you know, there's a documentary that's coming out. I don't know what it's about. I mean, by the time this this is released, you know, it will have been out. But based on what I've read on him, I mean, he lived a sort of life that as a football player and as a tough guy, but then he had other feelings as well. And it's like, you know, if you don't have an outlet for that, um Then it's gotta be extremely tough. Again, it doesn't excuse his behavior or how he acted, you know, dealing with certain situations, but uh it's gotta be tough.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, no, uh yeah. And I think the fact that it's becoming more talked about these days is probably uh heading in the right direction as opposed to yeah just like what it was then and people just trying to deal with it on the on their own. Right. So as much as we give Terry Glenn shit and talk about how much of a circus this is, I think there's definitely some deep veins of of Some sad shit that that like runs through all of this. Sure. And if I'm being honest, I don't actually remember how this ends. The whole Terry Glenn thing. I cause I don't remember him ever playing again, but me neither, man.",
    "speaker" : "Andy",
    "timestamp" : "01:08:40-01:09:21"
  },
  {
    "text" : "I I remember I mean he obviously went to the Cowboys with the uh Bledsoe and Parsons reunion, but I it's not like he played any of these playoff games or like",
    "speaker" : "Mike Melo",
    "timestamp" : "01:09:21-01:09:30"
  },
  {
    "text" : "Super Bowls that I that I remember because I I remember those those games pretty vividly. And he wasn't a part of them. So I don't know. what happens with Terry Glenn this year. So I think we're gonna have to I think we'll probably stumble across that together as we go here.",
    "timestamp" : "01:09:31-01:09:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:09:46-01:09:54",
    "speaker" : "Mike Melo",
    "text" : "Right. I mean that is the interesting thing about looking back at these things is just kind of like understanding what was going on behind the scenes that we didn't quite necessarily have an understanding for."
  },
  {
    "timestamp" : "01:09:54-01:10:04",
    "speaker" : "Andy",
    "text" : "Yeah, because I think especially with with these, you know, positive football seasons, the things you remember are are all the the The the good things, you know?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. Well for the most part.",
    "timestamp" : "01:10:04-01:10:06"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, well I mean I I mean what negative stuff did you remember about the two thousand one season before we started doing that?",
    "timestamp" : "01:10:06-01:10:12"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh the two thousand one?",
    "timestamp" : "01:10:12-01:10:13"
  },
  {
    "timestamp" : "01:10:13-01:10:14",
    "speaker" : "Andy",
    "text" : "Not much."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:10:14-01:10:17",
    "text" : "That's what I mean. Pretty exciting."
  },
  {
    "text" : "Yeah. I mean when it comes to sports, I think you remember the good bits and then uh for the most part, unless there's some really heart-wrenching thing like the helmet catch or something. Right. You don't really remember the bad stuff.",
    "speaker" : "Andy",
    "timestamp" : "01:10:17-01:10:31"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, that's true. I mean, I'm also wondering around this time, because obviously uh Belichick was establishing this like culture, right? And it might not be the easiest thing to deal with when a player um is sort of acting up or acting differently than you know, he's not towing the line for whatever reason. And, you know, as a coach, he obviously was like, you know, we're gonna do it this way and I don't want any distraction. So it's not necessarily the most encouraging environment anyway. But I also understand that because you're trying to implement this sort of structure in this like you know, what this team is gonna become and what it became. Um but we also see like cause outside of like mental health or you know uh you know sitting Terry Glenn and making those decisions, maybe he doesn't play the rest of the year, I don't know. Um or like you said, you don't see him show up in any game. So I mean maybe that was a Belichick thing to just tr try to make a point. I mean there were articles about how he was already screwing around with the injury report and there was at one point eighteen players on it or something like that. Yeah.",
    "timestamp" : "01:10:31-01:11:29"
  },
  {
    "text" : "Because he got uh reprimanded or something. Yeah. Here it is. Belichick was asked if he had issues. If he had issued such a lengthy injury report at the behest of the League Office. which sometimes questioned such reports when few injuries were listed. Four times Belchek was asked if the eighteen man list was a result of such a reprimand, his replies were as follows No, nope, no, not that I'm aware of. Oh yeah, right. He was definitely like playing games with that whole injury report thing even back in 2001.",
    "speaker" : "Andy",
    "timestamp" : "01:11:30-01:12:03"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. So I mean I think all these things uh come into play. Uh obviously I think he's he's softened over the years because with the Josh Gordon situation, I think they were a little bit more, well, a lot more accommodating. Um",
    "timestamp" : "01:12:03-01:12:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I feel like the Corey Dillons and the Randy Mosses kind of soften him to to be to bring it in those ways. Because he see that it it can work as long as the the player has the right mindset. Right, right. Yeah, I agree.",
    "timestamp" : "01:12:18-01:12:34"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, so anyways, I mean it'll be interesting to see how it plays out. And uh, you know, I'm just interested as as I get older as well and as society progresses in whatever way it's going. It's interesting to to look back and uh you know, I'm sure there's gonna be other situations where we get a little bit more insight and we're like, oh, okay. Um You know, maybe there's something more going on.",
    "timestamp" : "01:12:35-01:12:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, absolutely.",
    "timestamp" : "01:12:57-01:12:58"
  },
  {
    "text" : "Yeah, I don't know if uh anybody wants to listen to this stuff, so there you go.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:12:58-01:13:02"
  },
  {
    "text" : "No, that was great stuff. Um So let's uh I think we should wrap this up. I think we've we've talked for uh quite a bit about uh all sorts today. Even some uh some Bills game. Uh you want to start your best and worst?",
    "timestamp" : "01:13:03-01:13:20",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:13:21-01:14:10",
    "speaker" : "Mike Melo",
    "text" : "Um yeah, I mean the obvious um best which I wanted to avoid picking this, but it was the best. Um was the Antoine Smith sort of touchdown that sealed the the game. I think it was um 157 left on the clock. Uh they're trying to kill time and then Um, Antoine Smith blows through pretty much everybody that was trying to tackle him, gets a monster 42-yard run, makes a score of 21-11, and that pretty much seals the deal. Yeah. Um Before that, to show how bad this uh this game was, my best play was a Patrick Pass kickoff return that was fumbled, picked up. He runs across the field, bounces off a few guys for a nineteen return, uh a nineteen yard return. That was my best play before that."
  },
  {
    "text" : "I mean, it was exciting. Sure. Uh wait, you didn't like the uh the Troy Brown end around that got called back for holding?",
    "speaker" : "Andy",
    "timestamp" : "01:14:11-01:14:20"
  },
  {
    "text" : "The reverse?",
    "speaker" : "Mike Melo",
    "timestamp" : "01:14:20-01:14:21"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:14:21-01:14:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:14:22-01:14:24",
    "text" : "Yeah. Um it was good.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "That that was one of my notes about Gus Johnson, Brett Jones. That's not a fucking reverse. Right.",
    "timestamp" : "01:14:25-01:14:29",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:14:31-01:14:45",
    "speaker" : "Mike Melo",
    "text" : "Right. And uh I did write a note on that though. I love Brady's handoff because he timed it perfectly to him. Oh yeah. He he held it long enough to make the play work. Obviously it didn't, but uh No, yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Um then what was your worst?",
    "timestamp" : "01:14:45-01:14:48"
  },
  {
    "text" : "Well, the worst I would say is just any offensive line uh play that allowed a sack. I mean and even like the hurries. I would say it All twelve of them. Yeah, the offensive line was terrible. It wasn't good, yeah. Which again I saw another article that they were talking about, oh well maybe um Bletto uh was better You know, because uh uh he would have been better if he had a a better offensive line or whatever. They were talking about how the offensive line play was a little bit better in uh, you know, Brady's tenure in two thousand one. I think they were the same. It's just sort of the decision making and whatever that comes with it.",
    "timestamp" : "01:14:51-01:15:30",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:15:30-01:15:45",
    "speaker" : "Andy",
    "text" : "No, you're right, but I I did like the quote from that article. Uh Here in 1999, Bledsoe played behind a line from which only one player remains. When I say that, I don't mean still remains in New England. I mean still remains in pro football."
  },
  {
    "timestamp" : "01:15:46-01:15:51",
    "text" : "All right. Well that's I mean that's a major point right there, but Yeah, so so not great.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "So I mean I don't think this is head and shoulders better than the 1999, but it was 99 was was this is what I'm talking about when I'm talking about uh Drew Bledsoe like dragging this team to victories is that's what he was dealing with. Right.",
    "timestamp" : "01:15:51-01:16:09"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Um and I will say that I also wanted to touch on this this game was so bad. I wanted to get the other guys on here and see what they thought, but When um they put up so you know how they put up like all kinds of posts, like there's the NFL. com one um where this time the Patriots were finally mentioned It's the first time all year that the the the poll, FrenfL. com actually referenced the Patriots.",
    "timestamp" : "01:16:10-01:16:34"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. I have it here. It was what has been the most surprising aspect of the 2001 season thus far and the first option is emergence of Tom Brady. It Which Jones picks.",
    "timestamp" : "01:16:34-01:16:45"
  },
  {
    "text" : "Yep. Exactly. So I thought that was a good thing. Right. And if it you know, if anybody has listened to some of these, uh they'll know that there's been a bunch of these um NFL. com polls and they have nothing to do with the Patriots even though they're during the Patriots game. Um but then the uh the best thing that I thought they put up there was they were talking about Ted Johnson's favorite books. Oh, you're gonna steal them best. No, go for it. Go for it. Go.",
    "timestamp" : "01:16:45-01:17:12",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, that's a great segue. Yeah, no, my best. I actually had two. Um, they're talking about Ted Johnson being an avid reader, like you said. Uh turns out his favorite book is The Notebook by Nicholas Sparks, apparently.",
    "timestamp" : "01:17:12-01:17:24"
  },
  {
    "text" : "That's so good.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:17:24-01:17:25"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:17:25-01:17:41",
    "text" : "Which those of you who have or are currently dating somebody You know that that got turned into a movie with Ryan Gosling. And it was fantastic. Yes, and will make your significant other very mad at you after we're after watching it because you're not. A Nicholas Sparks character."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "From what I will I will admit that I watched that movie on my own at like three AM by myself. Um, 'cause I think it's a horror film and nobody wants to talk about that, but it it is a horror film. And uh by the end I think I cried. by myself for at least 35 minutes. Not out of like the love story, but out of sheer fear. That that's like a possibility.",
    "timestamp" : "01:17:41-01:18:08"
  },
  {
    "timestamp" : "01:18:10-01:18:12",
    "speaker" : "Andy",
    "text" : "I mean yeah, that's fair."
  },
  {
    "timestamp" : "01:18:12-01:18:18",
    "text" : "But yeah, that that that graphic that you're talking about, they actually list like it here.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh I took a screenshot of it so I wouldn't forget it. Um Ted Johnson's favorite authors, Deepak Chopra Nelson DeMille, I believe is pronounced. John Grisham, which okay, great. Robert Ludlam, of course. M. Scott Peck, who I don't actually know, and then the aforementioned Nicholas Sparks.",
    "timestamp" : "01:18:18-01:18:38"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That is so funny though that they avid reader.",
    "timestamp" : "01:18:38-01:18:41"
  },
  {
    "timestamp" : "01:18:42-01:18:55",
    "speaker" : "Andy",
    "text" : "For for especially for a run-stopping uh linebacker who from the the picture they showed next to this these names of authors His neck is actually wider than uh his head."
  },
  {
    "text" : "Oh yeah. I remember that about him.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:18:55-01:18:58"
  },
  {
    "text" : "Yeah. And uh so yeah, just not something you would expect. And my actually had another favorite. Uh and this is just a small thing, but the Patriots ran a direct snap to Kevin Falk on like third and twelve. Do you see that play?",
    "timestamp" : "01:18:59-01:19:13",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:19:13-01:19:14",
    "speaker" : "Mike Melo",
    "text" : "I don't remember that one."
  },
  {
    "text" : "Yeah, it was uh it was halfway through like the second or third quarter. And um like they didn't they didn't convert it or anything, so it it didn't really work. But I think I it got like eight yards. But um On the the direct snap to Falk, Tom Brady's play fake was amazing. He literally acted like he caught the ball. And like was was doing his whole dropback and like looking looking across the field.",
    "timestamp" : "01:19:14-01:19:39",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh yeah, now I remember they the announcers were talking about that too.",
    "timestamp" : "01:19:40-01:19:43"
  },
  {
    "timestamp" : "01:19:43-01:19:51",
    "speaker" : "Andy",
    "text" : "Yeah, it was amazing. It was so like rookie uh Tom Brady like making sure everything is is exactly how it should be."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Are you calling him a uh a hard o Oh yeah?",
    "timestamp" : "01:19:52-01:19:55"
  },
  {
    "text" : "I've been calling him a hard all day Well all all season, I guess.",
    "speaker" : "Andy",
    "timestamp" : "01:19:55-01:20:00"
  },
  {
    "text" : "I didn't know that. I know I know uh JJ Watt is a hard o.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:20:00-01:20:04"
  },
  {
    "timestamp" : "01:20:04-01:20:50",
    "text" : "So Oh yeah, no, no, Rookie Tom Brady's a super hard o amazing. Um and then my worst, a lot to pick from. I think um we'll go back to the kicking game. Kicker in this game was Jake Arians. He would not last the entire season with the Buffalo Bills. They would eventually replace him with Patriot legend Shane Graham. Um but they they mentioned in his first uh uh field goal attempt, I think it was in uh it was in the second quarter. Uh they talked about how this was the first or his the the fact that his last two field goal attempts have been blocked before kicking this one. So this is the first time in three kicks that he didn't have one blocked. And he made it.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:20:50-01:20:51",
    "text" : "That's pretty good."
  },
  {
    "timestamp" : "01:20:51-01:21:07",
    "speaker" : "Andy",
    "text" : "Yeah. So that was that was what kind of game this was. It was one of those. So, all right, I think that does it for for this week. What do we have to look forward to, Mr. Mello?"
  },
  {
    "timestamp" : "01:21:08-01:21:13",
    "speaker" : "Mike Melo",
    "text" : "I don't know. But don't ruin it for me either. Because again, I'm experiencing the season as if I don't know."
  },
  {
    "speaker" : "Andy",
    "text" : "But you sh I think you will know this one.",
    "timestamp" : "01:21:14-01:21:15"
  },
  {
    "timestamp" : "01:21:16-01:21:17",
    "speaker" : "Mike Melo",
    "text" : "Oh, don't you dare."
  },
  {
    "speaker" : "Andy",
    "text" : "The greatest show on turf is coming to town next week.",
    "timestamp" : "01:21:18-01:21:20"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Okay.",
    "timestamp" : "01:21:21-01:21:21"
  },
  {
    "timestamp" : "01:21:22-01:21:24",
    "speaker" : "Andy",
    "text" : "One of the games you remember, I'm sure."
  },
  {
    "timestamp" : "01:21:25-01:21:28",
    "speaker" : "Mike Melo",
    "text" : "I remember all of them, okay. I'm just trying not to so I can enjoy."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:28-01:21:50",
    "text" : "I don't think you do. You don't remember any of these games. Don't you lie to me. But everybody remembers the first. Rams game. Because that's when shit got serious. So join us next episode when the St. Louis Rams come to town face the New England Patriots. The currently Five and four New England Patriots and we will see you then. Bye."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Ta-ta.",
    "timestamp" : "01:21:50-01:21:51"
  },
  {
    "timestamp" : "01:21:53-01:21:54",
    "speaker" : "Andy",
    "text" : "Ta-ta."
  },
  {
    "text" : "Oh man.",
    "timestamp" : "01:21:55-01:21:56",
    "speaker" : "Mike Melo"
  }
]