[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "speaker" : "Mom",
    "timestamp" : "00:00-00:19"
  },
  {
    "timestamp" : "00:22-00:40",
    "speaker" : "Andy",
    "text" : "Alright, welcome to the second inaugural episode of the Patriots Dynasty Podcast. I'm your host, Andrew Brown. With me today, we have Mike Mello, all the way from Los Angeles, California. Producer, director, screenwriter, actor."
  },
  {
    "timestamp" : "00:41-00:42",
    "text" : "Wow, thank you for that.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, well it gotta pump your ties up a little bit.",
    "speaker" : "Andy",
    "timestamp" : "00:43-00:46"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "00:46-00:49",
    "text" : "I appreciate that. They're a little flat these days."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:51-01:14",
    "text" : "All right. Well, I'm sure your talent will shine through in this as well. I think so. Yeah, I do too. Speaking of talent, we also have joining us today Steve Brown, one of my Brothers, the one that will actually join us today. Hey, what's up? I think I'm with Steve. I'm marketing and golf expert, Steve Brown, so that I'm sure that'll come in handy as we talk about neither of those things."
  },
  {
    "timestamp" : "01:14-01:14",
    "text" : "Mm-hmm.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:15-01:28",
    "text" : "And uh also with him, we have a special guest tonight. We have uh Jeff Carr, Steve's friend, who is a 49ers fan, so we won't hold that against him. Jimmy G! Jimmy Griggs, maybe.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:29-01:34",
    "text" : "To be fair, he's a Forty Niners fan when this season's going on, even though he lived in New Hampshire."
  },
  {
    "timestamp" : "01:35-01:51",
    "speaker" : "Andy",
    "text" : "Yeah, well, uh I think growing up, a lot of us were 49ers fans as well as Patriots fans, perhaps. Because it was tough being a Patriots fan. Back in the late 80s, early nineties."
  },
  {
    "timestamp" : "01:52-01:56",
    "speaker" : "Steve",
    "text" : "Well, yeah, that's why we watched the season 2000 recap video instead of all of the games."
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly. Yeah, so let's start there. Um There was some debate when we started this about when the actual dynasty started. Um and so the vote was to start in the 2001 season, but I think it's a good idea that we kind of recap the 2000 season because that was kind of the official start date on paper when Belichick took over the team when Brady was drafted, even though you didn't see any of Brady. Um so we watched uh in preparation for this the NFL films like season recap, which was probably generously titled Building for Tomorrow. And when you have something With that sort of name on it, you know that the season didn't go well.",
    "timestamp" : "01:56-02:39"
  },
  {
    "timestamp" : "02:40-02:45",
    "speaker" : "Steve",
    "text" : "Uh I always wondered like what the shitty teams do with these because everyone gets one of these, right?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Oh yeah. I think they make one for every team every year.",
    "timestamp" : "02:46-02:48"
  },
  {
    "text" : "Yeah, who's buying this? Like a 2019 Dolphins one?",
    "timestamp" : "02:48-02:52",
    "speaker" : "Steve"
  },
  {
    "text" : "No, I think completionists are buying these. But I'm pretty sure I remember seeing uh like a a Buccaneers one from back in the day when they're still wearing the creamsicles. Mm. And it was sad because I mean it was basically one replay over and over again because they just didn't have any positive moments on the season. That's gonna be the Dolphins this year.",
    "speaker" : "Andy",
    "timestamp" : "02:53-03:13"
  },
  {
    "timestamp" : "03:13-03:19",
    "speaker" : "Mike Melo",
    "text" : "Yeah, same idea. I don't know. They just made a quarterback switch, so Look out."
  },
  {
    "text" : "The same quarterback switch that uh the well the opposite quarterback uh kind of the same quarterback switch that the the Cardinals made And then they made the office. They switched again. Right. The season after, yeah. Oops. All right. So yeah, so I guess it's no surprise then that the Patriots finished five and eleven that season. Um and even before that, they were on a downwards trend anyway, because they had they went to Super Bowl with Parcells and was at 96. And then he left for the Jets and brought uh Curtis Martin with him with all that hullabaloo.",
    "timestamp" : "03:22-04:01",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "04:01-04:04",
    "text" : "And then And he took Belichick too."
  },
  {
    "text" : "He did it, that's true. He took with him. Yeah.",
    "timestamp" : "04:05-04:09",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, let's call it spade a spade here.",
    "speaker" : "Mike Melo",
    "timestamp" : "04:09-04:11"
  },
  {
    "timestamp" : "04:12-05:33",
    "text" : "Yeah, well, I'm still blaming on parcels. But yeah. Yeah, no, Belichick can do no wrong, so we're not gonna blame him on this podcast. Right. Yeah. Yeah, at least at least in 01 we won't blame him. Yeah, don't talk about it. So Pikao took over from From Parcells and won one last game every season. He was there. So they were eleven and five when they went to Super Bowl, and then they were ten and six in Carroll's first year. Um and then nine and seven and then eight and eight before they finally got rid of them. They bring in Belichick who went five and eleven but beat some like surprisingly good teams, weirdly. Uh two of their wins were at at Denver against the Broncos who finished 11 and 5 that season, which they never win in Denver. And then they beat the Colts at home when the Colts were still in the AFC East back then. Um and the Colts finished 10 and 6, and both those teams went to the playoffs. And one of their other wins, one of the the only other wins they had was against this Bengals team that we're starting the season with. Um and that's kind of all there was to the 2000 season. There wasn't much to talk about. I'd beg to differ. There was a lot going on, man. Oh yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "05:33-05:35",
    "text" : "I got I got notes, man. It's called show prep."
  },
  {
    "timestamp" : "05:35-05:43",
    "text" : "Alright, let's hear, because I I took notes too, but all I could find were issues and I didn't want to start on the one note.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "05:43-06:02",
    "text" : "Oh, they're not I mean Issues are that's a relatable term, I guess. I mean they're there things happened, right? And we're talking about 'em. Um my my first note is that I can't believe this video exists. So that was the top one. Um I'm right there with Steve. On YouTube."
  },
  {
    "timestamp" : "06:02-06:06",
    "speaker" : "Andy",
    "text" : "Um things you can find on the internet. It's it's pretty impressive."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "06:07-06:34",
    "text" : "I mean, I was more interested with like, you know, the the way that Belichick became the head coach, um, things that were happening with Terry Glenn, uh the Taiwa incident. So I mean this is like before social media, so I guess people might not remember or care or whatever, but if this stuff was happening today I think it would be a little bit different. So I don't know if people remember some of that stuff, but I think it's fun to talk about."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:35-06:41",
    "text" : "Yeah, no absolutely. Yeah, because that was the the uh the Canada incident, is that what you're talking about?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh yeah, the uh with Terry Lennon Tyler.",
    "timestamp" : "06:41-06:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and Troy Brown actually believes.",
    "timestamp" : "06:43-06:45"
  },
  {
    "text" : "Oh and Troy Brown, okay. That's uh unlikely one.",
    "speaker" : "Mike Melo",
    "timestamp" : "06:45-06:49"
  },
  {
    "text" : "Yeah, it was them three that went because they played a game from what I understand they played a game in Buffalo in the winter and so the the weather's real bad and the three of them were not big flyers. So they stayed up there an extra night because they didn't want to fly in the snow. Went to um I want to say Montreal or Niagara or something like that, and Uh got into some trouble on the way back, I believe. I can't remember exactly what it was. Do you remember?",
    "timestamp" : "06:49-07:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I mean I'm pretty sure that Tylaw got arrested for ecstasy.",
    "timestamp" : "07:19-07:23"
  },
  {
    "text" : "Yeah, but because I think they they found it in the car on the way back, but he said it wasn't his. It was like his cousins or something.",
    "speaker" : "Andy",
    "timestamp" : "07:24-07:31"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I mean he's a Hall of Famer, so I mean I don't care, but",
    "timestamp" : "07:32-07:35"
  },
  {
    "text" : "Troy Brown doesn't need ecstasy, Steven. Yeah, you see those eyes? He's just generally happy.",
    "timestamp" : "07:36-07:41",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:42-07:52",
    "speaker" : "Steve",
    "text" : "Football is his drug. And now look at Pat Chung gets busted as burger alarm trips automatically and Yeah, and who's still who's still a part of the team?"
  },
  {
    "text" : "Troy Brown. Coincidence? That's true. I didn't even think about that. Jeez.",
    "speaker" : "Andy",
    "timestamp" : "07:52-08:00"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh boy. So that was something. It's just stuff that happened, you know? Yeah, that's true.",
    "timestamp" : "08:01-08:12"
  },
  {
    "text" : "I mean I I have read the the Troy Brown autobiography and he did address it in there, so I would say that anything recap video was kind of nice.",
    "timestamp" : "08:13-08:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "There is a like a blind side hit on Peyton Manning, which I really liked.",
    "timestamp" : "08:22-08:26"
  },
  {
    "timestamp" : "08:26-08:28",
    "speaker" : "Andy",
    "text" : "Did you watch that part over and over again?"
  },
  {
    "text" : "I I didn't rewind that part, yeah. Well they like played it like three times too, so I got to watch it like twelve",
    "timestamp" : "08:28-08:33",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "08:33-08:42",
    "speaker" : "Andy",
    "text" : "Yeah, that's what I was talking about when uh I was saying there weren't a whole lot of highlights for some of these teams. There was a lot of repeats I felt in this video. Oh yeah."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "08:42-08:59",
    "text" : "Yeah, I mean the the highlights for me I don't know if you guys remember this or not, but I mean there was the Michael Bishop Hail Mary versus the Colts like right before the half. So that was pretty awesome. I would say top 20 plays of the Patriots. That year. Um okay."
  },
  {
    "timestamp" : "09:00-09:02",
    "speaker" : "Steve",
    "text" : "That was almost a real hot take."
  },
  {
    "timestamp" : "09:04-09:25",
    "speaker" : "Mike Melo",
    "text" : "Um there's the uh fake field goal um against the Colts, you know, and then uh there was a Tabucky Jones interception, so they beat the Colts. That was pretty cool. Um we saw a little bit of uh of Glen, so that was nice before we never saw him again. Um Uh let's see. That pretty much covers it."
  },
  {
    "text" : "I thought it was interesting how better quality the the Chiefs primetime game was. Yes. Like video quality was way better on that and like Willie was mic'd up, which was awesome. Oh yeah.",
    "timestamp" : "09:26-09:37",
    "speaker" : "Steve"
  },
  {
    "text" : "Kind of early 2000s was his prime and that dude kind of look like uh uh a grown man playing with with smaller children on the f on the same field. He was just so much bigger. I I felt like everybody in these highlights are bigger. Like you they all look like they're a team full of fullbacks on offense and just That's because they're wearing massive shoulder pads. Yeah, I think that's part of it, but I think they're also just like like defenses were bigger because It was still a a run first league back in the early two thousands, like late nineties. There wasn't this focus on the the passing game. So people were just massive. Like you look at Loy Malloy and he wouldn't, I don't think, last. as a safety in today's NFL. No way.",
    "timestamp" : "09:40-10:24",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "10:24-10:31",
    "speaker" : "Steve",
    "text" : "But it's it was telling that they're like, oh, Drew Bloodsoe has passed for 3,000 yards in like seven straight seasons. Yes."
  },
  {
    "text" : "That was one of the stats. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "10:32-10:34"
  },
  {
    "text" : "And then you have I mean what do you guys think about that too? I mean obviously the rules have changed and everything, but yeah, like big deal. And then yeah, the next generation that was hitting four. Now you have Mahomes and Breeze who are pretty much doing it every season. Maybe not Breeze anymore, but You think that like five thousand is now gonna be the uh the sort of goal?",
    "speaker" : "Mike Melo",
    "timestamp" : "10:38-10:59"
  },
  {
    "speaker" : "Andy",
    "text" : "I think so. And and I think that just makes uh what Dan Marino did back in the day throwing for five thousand yards back when everybody was still throwing for three, that much more impressive. Yeah, he was Yeah, it it does seem like somebody does it uh every year or gets real close with every year nowadays. It's just not quite the same.",
    "timestamp" : "11:00-11:21"
  },
  {
    "text" : "Yeah, so that is an interesting point. Um and it was fun to look back on. But seven years straight doing that, blood so slinging it, that's something. Jeff's got a hot take.",
    "speaker" : "Mike Melo",
    "timestamp" : "11:23-11:33"
  },
  {
    "text" : "I just heard on ESPN today that they think Mahomes is going to be the first hundred thousand yard guy.",
    "speaker" : "Jeff Carr",
    "timestamp" : "11:33-11:38"
  },
  {
    "speaker" : "Andy",
    "text" : "Whoa. I I could see that. I could also see Brady playing till he's 48 and hitting it as well though. Because he's at seventy something thousand, seventy-eight thousand. So with the league the way it is, if Brady can throw five thousand yards another five years, why not? I don't know if Brigg's ever thrown for five thousand yards. He has. Yeah, yes. Once I think.",
    "timestamp" : "11:39-12:05"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah. Well, yeah. He might have done it twice actually.",
    "timestamp" : "12:07-12:10"
  },
  {
    "speaker" : "Steve",
    "text" : "He's gonna do it again this year. We can all agree on that.",
    "timestamp" : "12:11-12:13"
  },
  {
    "text" : "Fingers crossed.",
    "timestamp" : "12:15-12:16",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "12:16-12:19",
    "speaker" : "Andy",
    "text" : "I mean, yeah, he's gonna do it every year from now on, I'm pretty sure."
  },
  {
    "timestamp" : "12:20-12:37",
    "text" : "Um also uh I think you would made uh a while back on the coaching staff. um on the pads that year, which is pretty interesting with Eric Mangini and Rob Ryan. Uh Scott Pioli was still there.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, there was a a surprisingly amount of of big names back in these days. Yeah, you got Rob Ryan as your linebackers coach. Yeah. Underneath American Jeannie's Yeah. Oh yeah, Eric Mangenini was a defensive backs coach at that point, wasn't he? I think so. Oh I'm looking at 2000. But yeah, I I think just the games that were. Yeah. Yeah, Eric Mancini defensive backs. Rob Ryan is the linebackers. I I didn't realize Rob Ryan was attached to the Patriots in that way. Yeah, I just think of him as uh Rex Ryan's long haired hairier brother. Yeah, exactly.",
    "timestamp" : "12:37-13:19"
  },
  {
    "timestamp" : "13:21-14:01",
    "speaker" : "Mike Melo",
    "text" : "But then I uh I I looked into it further and uh there's some other guys that nobody really mentions, but check this out. You got Jeff Davidson. Oh no, hey, Jeff Davidson. Yeah. O-line assistant coach. Today, O line coach. Detroit Lions. Next guy, right? Still in the league. Okay. Marcus Paul Assistant strength and conditioning coach now head strength and conditioning coach of the Dallas Cowboys and Dwayne Walker, defensive assistant, he's uh kicking around as DB coach at Cleveland. So that's something that most people don't talk about."
  },
  {
    "text" : "That's true because you always hear about how all the the Belichick disciples go out and fail. Because you'll never hear the guys taking the head coach positions. But the fact that all these other guys are still in the league Um I mean I I I know in 01 that was Josh McDaniel's first year. Oh, that's right. Technically still in the league, but yeah, and I think uh Brian Dable is still in the league as well, isn't he?",
    "timestamp" : "14:02-14:27",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And uh Maddie Walsh was on the uh the staff at this point. Do you remember that guy?",
    "timestamp" : "14:36-14:42"
  },
  {
    "timestamp" : "14:42-14:44",
    "speaker" : "Andy",
    "text" : "I do remember Matt Walsh, yeah."
  },
  {
    "text" : "He was a little uh video assistant. um fellow that may have had something to do with the old spygate situation. So he was kicking around.",
    "speaker" : "Mike Melo",
    "timestamp" : "14:44-14:53"
  },
  {
    "timestamp" : "14:55-14:55",
    "text" : "Oh Brian.",
    "speaker" : "Andy"
  },
  {
    "text" : "I'm a media guide, by the way. Go ahead. Yeah.",
    "timestamp" : "14:56-15:00",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I was gonna say Brian Dable is the uh offensive coordinator for the Buffalo Bills right now.",
    "speaker" : "Andy",
    "timestamp" : "15:00-15:04"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "See? I mean It's a beautiful thing. But yeah, this Maddie Walsh guy has to be said in the media guide. I was looking it over, and it it is written that he auditioned to be an MTV VJ and he's single. So that's a good professional resume right there. And finally, last but not least I would venture to get I don't I'm I'm that's too controversial for me to speak on. But um and last but not least, Dick R Rabine um used to be the quarterback's coach and now he's dead.",
    "timestamp" : "15:05-15:42"
  },
  {
    "speaker" : "Andy",
    "text" : "So Yes. Yeah, because he died between the two thousand and two thousand one.",
    "timestamp" : "15:42-15:46"
  },
  {
    "timestamp" : "15:47-15:51",
    "speaker" : "Mike Melo",
    "text" : "Unfortunate circumstance, yeah. He passed after a stress test."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep.",
    "timestamp" : "15:51-15:52"
  },
  {
    "text" : "So I'm telling the guy that wanted to draft Brady. Right.",
    "speaker" : "Steve",
    "timestamp" : "15:53-15:57"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh, that's right.",
    "timestamp" : "15:57-15:58"
  },
  {
    "text" : "Yes. So I think that's a good segue into this 2001 season. Um, because there were some things that happened during the offseason. Um, and that was one of the big ones was um the death of their wide receiver coach because I think that was kind of like a playing for um Uh what's Robert Kraft's wife's name? Myra. Myra. Myra, exactly. Yeah. So playing for Myra Kraft that year where they had the stickers on the helmets. It felt kind of similar to that. Um he was kind of one of those people who had been there for a while and um you know everybody talked highly of him and so and it was kind of an unexpected death. Uh but the other big news was um Terry Glenn because he got popped for uh smoking weed during the offseason, was suspended four games by the league. And then decided not to show up to training camp because I think he was there was like some money stuff going on as well. So Belichick turned around and just suspended him for the entire season.",
    "speaker" : "Andy",
    "timestamp" : "15:59-17:10"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Which I think was a a precursor to everything he was gonna do for the next 20 years. And the NFLPA They you know, the NFL, everybody was involved, they were trying to figure out if this was within the rules. I mean, knowing Belichick, he probably studied it up and down before doing it, but",
    "timestamp" : "17:10-17:27"
  },
  {
    "text" : "Exactly, yeah. Because they're their warriors gonna set some sort of precedent if Terry Glenn challenged this and then it got overturned and now the players have all this this power. But I'm gonna say that didn't happen because we didn't really hear much from Terry Glenn after that, other than get Well everyone says you know Belchek can make these crazy moves because he uh",
    "timestamp" : "17:28-17:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "has so much tenure in New England but proves he doesn't. And this is his second year and he's suspending Terry Galen as their best receiver by far. Yeah Emanuel, really?",
    "timestamp" : "17:47-17:57"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I know man, that's insane.",
    "timestamp" : "17:58-17:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Does he have a Super Bowl ring? You gotta imagine he does he was unless he got cut further further on. But they usually give him to everybody who played that year. That's yeah, I guess. So I mean I think he has a good chance he has one. What? I don't remember this guy.",
    "timestamp" : "18:00-18:17"
  },
  {
    "timestamp" : "18:23-18:25",
    "speaker" : "Steve",
    "text" : "Absolutely blown up by Corey Dillon."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "18:26-18:26"
  },
  {
    "text" : "He like bounces off Cory Dillon like he's made of rubber. He just goes flying.",
    "timestamp" : "18:27-18:32",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, there was a few of those, especially this this week one. game. There's a few people that I didn't even recognize the names, never mind. Be like, oh yeah, I remember that guy. It was just like a whole bunch of not even remembering that they were on the team.",
    "timestamp" : "18:32-18:46"
  },
  {
    "timestamp" : "18:46-18:48",
    "speaker" : "Mike Melo",
    "text" : "Outside of like David Patton."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:49-19:38",
    "text" : "Yeah, so that was the thing is because Terry Glenn was suspended for the year, David Patton, they actually had in the Boston Globe, I I pulled up some of the old Bossing Globe Articles from around this time. And one of them was basically about how he was um working at some place like carrying bags of coffee beans and like tearing up his hands before he got the call that he was um gonna be playing for the Patriots. And we all know how that turned out. Yeah, divine intervention. Yeah, exactly. Because the carrying coffee was um God's punishment for him because he hadn't learned his lessons yet. But apparently he'd just just enough. 'Cause he got the call from Bill Belichick once Terry Glenn was out for the year. And we know how that turned out for both of them, for both Terry Glenn and"
  },
  {
    "text" : "The little speed stare. Now Glenn though, the interesting thing about him was that he had signed a uh a new contract the previous year.",
    "timestamp" : "19:40-19:49",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "It was kind of a monster one.",
    "timestamp" : "19:49-19:50"
  },
  {
    "text" : "It was, yeah, at the time. It was sixty years, fifty mil with eleven guaranteed, which is like, you know, not much by today's standards, but back then it was pretty decent.",
    "timestamp" : "19:51-19:59",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, that's that's top wide receiver money for the time. Right. I mean simil similar to some other deals that happened.",
    "speaker" : "Andy",
    "timestamp" : "20:00-20:07"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well I mean I um I also saw that uh I didn't realize this, but Pete Carroll had suspended him before Belichick got there as well.",
    "timestamp" : "20:08-20:17"
  },
  {
    "speaker" : "Andy",
    "text" : "So I didn't see that.",
    "timestamp" : "20:17-20:18"
  },
  {
    "timestamp" : "20:19-20:23",
    "text" : "Yeah, in ninety-nine. So there was already a little bit of a precedent there.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah. Yeah, I remember him always having a tumultuous relationship. I because even when Parcells was was running the team and they had that press conference about Terry Glenn had an injury and Parcells didn't believe that he was injured, he thought he was sitting out, and so they asked him how Terry Glenn was, and he said, Yeah, she's fine. Right. In true parcels fashion. Uh that's like the only thing I remember about Tari Glenn.",
    "timestamp" : "20:23-20:49"
  },
  {
    "timestamp" : "20:49-21:00",
    "text" : "Oh that and the uh the uh that sparked the whole um if you want me to be the cook you gotta let me buy the groceries. Uh with Robert Kraft and Terry Glam, he pretty much hated him.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, because Terry Glenn was Robert Kraft's draft pick, not Bill Beladicks. Right. Bill Parcells, really.",
    "timestamp" : "21:00-21:07",
    "speaker" : "Andy"
  },
  {
    "text" : "Right, right. And then, you know, um obviously Terry Glenn uh passed in a accident, but pretty much every interview that I heard uh after that incident was that, you know, he was a good guy. He was just troubled and never really figured it out. So it's kind of a sad Story in that sense because he had the talent but uh and the style, but I just didn't quite put it together",
    "speaker" : "Mike Melo",
    "timestamp" : "21:08-21:31"
  },
  {
    "text" : "Yeah, I felt like one of those guys where it came easy to him before coming into the the pros. So it never really seemed like he gave or like had to give much effort coming in, didn't know how to do that once he got there.",
    "timestamp" : "21:31-21:43",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:43-21:43",
    "speaker" : "Mike Melo",
    "text" : "Yeah."
  },
  {
    "text" : "And so yeah, he just never really put it all together. Whereas the opposite side of that would probably be Troy Brown, who didn't quite have the talent but just worked his balls off. And kept making the team. And from his biography that I read, uh basically the only like he kind of just hung around barely by the skin of his teeth on uh parcels and Carroll's teams, but Belichick kind of day one came to him and says, I remember you from when I was I was the defensive coach um when I was here last and I've watched a bunch of tape on you and I know what you can do, so we're gonna basically feature you in this offense.",
    "speaker" : "Andy",
    "timestamp" : "21:44-22:22"
  },
  {
    "text" : "Twelve hundred yards, five touchdowns this year.",
    "timestamp" : "22:23-22:25",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, yeah, and in two thousand one was his his best year as a as a receiver because he was kind of the the number one guy because like you said, who else was it? Especially the beginning.",
    "timestamp" : "22:25-22:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, I mean even in 2000 he almost got uh a thousand yards. I think it was like 950 or something like that. So given that team Oh, nine forty-four yards and four touchdowns the year before. Uh twelve uh point nine return average um in two thousand as well. So he was on his way to be a part of the team in that fashion.",
    "timestamp" : "22:38-22:57"
  },
  {
    "timestamp" : "22:58-23:00",
    "speaker" : "Andy",
    "text" : "The original Wes Walker. Exactly."
  },
  {
    "text" : "Oh boy.",
    "timestamp" : "23:06-23:07",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:08-23:29",
    "text" : "Oh, that's a hot take. Oh, you know it is. Alright, so let's uh that that's kind of the lead up. So let's let's cause we're Haven't actually talked about the game yet and we're at about a half hour in here. But um is there anything else you want to to touch on real quick before we do get to the game?"
  },
  {
    "text" : "Mmm, I mean Willie McGuinness and Chris Lade had a pretty nice bromance. Yeah. So I missed that. And um about it for me.",
    "timestamp" : "23:30-23:39",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "23:40-24:48",
    "text" : "A couple notable draft picks for this year was uh the first round pick was Richard Seymour. Um and they also drafted Matt Light in the second round. So two big names. That was kind of the only names I recognized from this draft. Um there was a bunch of turnover from the 2000 season. The announcers in this game actually pointed out there was 38 new players from a year ago. Um, and 18 of those were free agents. So Belichick. basically just gutted the team that he had before, brought in a bunch of veteran guys. And I think that was his way of trying to set the tone for what this locker room is gonna be, which I think still holds today. He has, I mean he's created at core now that doesn't change as much because you got Brady that's there. the whole time, but that was his kind of method from the get-go was to build that culture of accountability and bringing in the guys who knew what they were doing to to help the young team kind of gell a little bit. And if you didn't know that, just watch this first game because the commentators wouldn't get off that topic for basically the whole third quarter when the Patriots stopped playing football.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well it's interesting too because a lot of the guys are older guys, like you said, veterans and they're uh they're veterans. Right. They had a little bit of like a tip on their shoulder. They had an attitude which is interesting because it fit with the Belichick type attitude. It wasn't like this arrogant type thing, but like Brian Cox, I remember he was like flipping people off and then he became a patriot, you know?",
    "timestamp" : "24:49-25:12"
  },
  {
    "timestamp" : "25:12-25:18",
    "text" : "Uh he had like an entire like neck roll on his shoulder.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:18-25:37",
    "text" : "Oh my god. That went like almost above the back of his helmet. It was awesome. Looked like the the the s headrest for your your car seat. It was awesome. So alright, and the oh the one last thing that they kept harping on to was that uh this season they had replacement referees which I did not remember"
  },
  {
    "timestamp" : "25:37-25:42",
    "speaker" : "Mike Melo",
    "text" : "Yeah, I do remember that. It only lasted like I think three weeks or the first two weeks."
  },
  {
    "timestamp" : "25:42-26:01",
    "speaker" : "Andy",
    "text" : "Yeah, I mean that doesn't surprise me considering what happened after week one. Um but yeah, it was kind of when I was reading the papers leading up to it and afterwards, it like uh half the articles were about these replacement refs and how they did and how they were gonna do and Every time they made a call in the field's like, oh, these replacement reps look like real referees. Okay."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Now did didn't that happen like a couple of years ago as well? Am I mistaken on this?",
    "timestamp" : "26:01-26:05"
  },
  {
    "timestamp" : "26:05-26:10",
    "speaker" : "Steve",
    "text" : "It did, yeah. Because um But it was in the age of social media, so it's way magnified."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, right, right. Blowing up because they they miscalled uh Hail Mary for Seattle? Seahawks Packers game. Right. Yep. And one called it incomplete, one called it a catch, and they have the picture of one guy waving it off and one guy with his hands up.",
    "timestamp" : "26:11-26:26"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "So the NFL still hasn't learned their lesson from 20 years ago, I guess.",
    "timestamp" : "26:26-26:31"
  },
  {
    "timestamp" : "26:32-27:16",
    "speaker" : "Andy",
    "text" : "No, yeah, I'm sure we'll have that coming up soon again, whenever the next CBA is for them. All right, so uh yeah, let's let's finally get to this game. Um This was uh week one of the 2001 season, like we said. It was in Cincinnati. Against the Bengals who the year before had not done well. They were uh I think they're four and twelve or something like that. Something's something real bad. Yeah, they were four and twelve the year before, but their only real contributor, especially on offense, was Corey Dillon. Like the only two names I recognize from the Bengals roster other than John Kitna, and I didn't recognize that for a good reason, was Corey Dillon and Takeo Spikes."
  },
  {
    "timestamp" : "27:18-27:21",
    "speaker" : "Steve",
    "text" : "Peter Wark, I remember him, and he was pretty good in this game."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:21-27:31",
    "text" : "Yeah, that's true. I I I vaguely remember his name. I don't remember him being as good as he was being hyped up to be, but The man made some quality catches in this game, the very least."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, that one handed grab was sweet. Yeah.",
    "timestamp" : "27:31-27:33"
  },
  {
    "timestamp" : "27:33-27:34",
    "speaker" : "Andy",
    "text" : "Oh, that was Darnay Scott. Sorry."
  },
  {
    "text" : "That wasn't Oh yeah, Darnay Scott's uh legit",
    "timestamp" : "27:34-27:37",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:38-27:46",
    "text" : "Yeah, yeah. For some reason I always had Darnell Scott in my head as a um a quarterback and I don't know why. I don't know who I'm confusing him with, but it was someone like that."
  },
  {
    "timestamp" : "27:46-27:50",
    "speaker" : "Mike Melo",
    "text" : "When Chad Johnson was uh on their team, but he didn't play at all."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:50-28:27",
    "text" : "Yeah, because this was his rookie season. And so the route the uh the commentators made some comment about how he looked good in preseason and they were excited to see what he could do. I don't think they quite understood what they had on that, but yeah, spee speaking of the um the commentators, I thought that was quite a quality crew for such a a game that was Probably not touted to be uh like one of the A-list games. It was Gus Johnson back in the day who makes everything sound really exciting. Uh I didn't think Brent Jones added much, but Sam Weich. The old coach of the Cincinnati Bengals actually did a I thought a a really good job."
  },
  {
    "text" : "Well, I thought that other guy sounded like Tony Romo a little bit. What you like, Brent Jones? Yeah. Really? I was like, Tony Romo? No.",
    "timestamp" : "28:28-28:37",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I didn't catch that. But yeah, I thought like Sam Wysh he he he kind of had that like you could tell he just came from coaching because um he was All about like calling out the players who were getting away with penalties and stuff like that. Um like he caught some guy, some offensive lineman holding twice on one play. Like, I don't know how he got away with one. Never mind, two of them. It was all up and off.",
    "timestamp" : "28:39-29:02"
  },
  {
    "text" : "Jeff Jeff remembers Brent Jones from his playing days.",
    "timestamp" : "29:03-29:05",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, Brent Jones was a 49ers uh tight end, I believe.",
    "timestamp" : "29:05-29:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Jeff Carr",
    "text" : "Yeah, he was like Steve Young's go-to.",
    "timestamp" : "29:10-29:11"
  },
  {
    "text" : "Yeah, yeah, yeah. Because they had some uh They had some banter halfway through uh because Brent Jones is 49ers actually beat Sam Weish's Bengals in the Super Bowl. And so Sam Weish's comment was something along the lines of, yeah, yeah, they they beat us because uh we couldn't cover their tight ends. And I don't know if that was actually true or not, or if he was just pandering to his audience.",
    "speaker" : "Andy",
    "timestamp" : "29:12-29:33"
  },
  {
    "timestamp" : "29:35-29:51",
    "text" : "But to your point, um after watching some of the 2000 season, I mean I didn't realize that there was such a difference in sort of level of quality between teams, but the announcing unit was pretty pretty on point on this one.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I was surprised because usually cause yeah, I I watched some of the 2000 games too and you had some I don't know, Dan Cricky and who was the other guy that w that did them with them, and they were just Not not the the top crew, I don't think. It's kinda like getting Dan Deodorf these days or uh someone like that. Dan Dorf. I don't even think he's doing it anymore, but just those. Oh uh no, who who did the last recent Patriots game? It was uh Iron Eagle and Dan Fouts. Yeah, Fouts. It's like getting that crewed. Yeah.",
    "timestamp" : "29:51-30:26"
  },
  {
    "timestamp" : "30:26-30:29",
    "text" : "What about old uh Scotty Zolak? Do you like him?",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "I like Scott Zolak, but only because he's such a huge homer. I kind of enjoy that. Especially like because he's a local guy, I enjoy that. Same with like Gil and Gino back in the day.",
    "timestamp" : "30:29-30:39"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "30:39-30:44",
    "text" : "Well that recap video just had just Gil and Gino, it was amazing. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, no, I love I love hearing those two call the games because they they were just kind of like It it that was like the history for me is is hearing their voices.",
    "timestamp" : "30:46-30:55"
  },
  {
    "text" : "Oh yeah, mom used to mute the TV and then put the radio underneath it. And Yelangino.",
    "speaker" : "Steve",
    "timestamp" : "30:56-31:01"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:01-31:47",
    "text" : "Uh I'm pretty sure that's where we got our hatred of TV commentators actually was from because sh she would yell at the TV with the best of them. Um some other general things about this game that I found interesting was uh extra points still from the one-yard line. And yet there was people that still almost missed them. Um and the fans in Cincinnati in this game were like super hardos. Those uh amazing mustache. Yeah, those a whole bunch of mustaches. It's almost like the 80s hadn't left Cincinnati at yet in in 2001. But they had uh the the hard hat but with the plain those colors It was beautiful. Alright, let's see what else we got here."
  },
  {
    "text" : "Let's do like best and worst because I got a good worst.",
    "speaker" : "Steve",
    "timestamp" : "31:47-31:50"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright.",
    "timestamp" : "31:50-31:51"
  },
  {
    "text" : "Well it yeah.",
    "timestamp" : "31:51-31:53",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Is there any anything else you want to touch on before we do that?",
    "timestamp" : "31:54-31:57"
  },
  {
    "timestamp" : "31:57-32:42",
    "speaker" : "Mike Melo",
    "text" : "I mean there is quite a bit on here. I mean I I I hate It was such a I mean nothing really happened in this game. It was it was one of the more boring games I've ever watched. But um there are you know, you see certain signs of things. I mean you saw You saw the toughness of the team in the first half. I mean they kind of like gave up in the second half, but um Pletto was slinging it, taking the hits as usual. Um and he had just signed a contract that was supposed to basically be his career contract where he was supposed to retire in New England. Um and that he was just coming off of that. So he was sort of supposed to be the savior of the uh the franchise at that point."
  },
  {
    "text" : "Yeah, I actually wrote down the the comment that the commentator said it said uh oh here's Drew Bledsoe. They signed a multimillion he signed a multi-year, multi-million dollar contract that should keep him a patriot through the end of his career.",
    "timestamp" : "32:42-32:54",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yep. Week one thousand one. Yeah. Well it's crazy because um they also said that he was the uh secus second longest with the team, um probably of like active players and Farvo's number one. He was at like nine years. So you look at Brady now, he's going on 20. I mean that's just unheard of.",
    "timestamp" : "32:54-33:14"
  },
  {
    "speaker" : "Andy",
    "text" : "It really is. Yeah, twenty twenty years in the league is for a non-kicker is is out of control, but to have all those with the same team is is even more so. Cause even Brett Favre, who's like the poster child of um longevity, how how many teams he end up playing for? Three at the end of the day? Because it was most of it with the Packers.",
    "timestamp" : "33:15-33:41"
  },
  {
    "timestamp" : "33:41-33:43",
    "speaker" : "Mike Melo",
    "text" : "And then the Vikings and like that."
  },
  {
    "text" : "I think that was it, right?",
    "timestamp" : "33:44-33:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "33:46-33:49",
    "text" : "Yep. Well, actually he was with the Falcons."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, Ridgie, he was drafted by the dog.",
    "timestamp" : "33:50-33:52"
  },
  {
    "timestamp" : "33:53-34:01",
    "speaker" : "Steve",
    "text" : "That's true, yeah. Even crushes ended up going somewhere else. Like Montana went to the Chiefs. Where did Steve Young go?"
  },
  {
    "text" : "Yeah, Steve Young. He started it with Tampa. Yikes. I know. Moving on. Yeah, I love it. All right. I I think that uh just just touching on Drew Bledsoe again. He uh I was surprised at how mobile he was. 'Cause i i in the few couple of games that I watched of the two thousand season and then this game, he was not afraid to take off, which was surprising 'cause he was Like six eight, a hundred and eighty pounds. Like he was not a massive dude. He was just kind of this tall, gangly guy. But he was not afraid to like take off and try to lower the boom on people, which you know We'll see how that comes back to bite him.",
    "speaker" : "Andy",
    "timestamp" : "34:02-34:50"
  },
  {
    "text" : "Well, that was the other thing though, it's like throughout the game and I think throughout the 2000 season from what I saw. Every announcer pointed out, man, I don't know if the coach likes him doing this. Oh man, I don't know how long he's gonna stay in there. So, I mean obviously foreshadowing, but it happened every game. Which I mean you could say it's a lion's fault, but Bletso, I don't know, man, like uh he held the ball on a little uh um held on to it a little too long. He uh I mean those rollouts didn't help the across the body, across the field. I mean so I don't know if it's his fault or the O Lions fault or they didn't have receivers or what, but it was awful to watch.",
    "timestamp" : "34:50-35:29",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, it felt like uh at least early in the 2000 season that I watched. A lot of it was the O-line's fault, but I think there's equal blame to go around because he would like double clutch it or even triple clutch it on some plays. If his first guy was Novin, it took him a while to go through his progressions and Because their O line wasn't stellar, I think, led to a lot of sacks. But it wasn't just their fault either. Yeah, you're right. He he kind of seemed like there's always one of those plays where he's falling down and he's uh just kind of hooking the ball up without looking at where it's going and you just kind of Pray that it's not an interception, because every once in a while it would be.",
    "speaker" : "Andy",
    "timestamp" : "35:30-36:13"
  },
  {
    "timestamp" : "36:13-36:24",
    "speaker" : "Steve",
    "text" : "Wow. I hope you guys watch this game all the way through because right at the end there's a guy wearing a gigantic furry Bengal's head, like a like a cat head. I I missed that one."
  },
  {
    "text" : "I I watched all the way through, but I don't remember seeing that. Oh yeah. I think towards the end of the fourth quarter I was kind of hoping this game would just end.",
    "speaker" : "Andy",
    "timestamp" : "36:24-36:32"
  },
  {
    "text" : "Yeah, it kind of felt like that. I mean they they made it competitive at the end somehow. I have no idea how, but uh It wa it was a pretty pretty rough one. I mean I'm looking at you know from the Bengals perspective, you have Corey Dylan who's just like a monster and it was like great to see that. I don't know why they didn't lean on him more.",
    "timestamp" : "36:33-36:51",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "But um That's a thing, yeah.",
    "timestamp" : "36:51-36:53"
  },
  {
    "text" : "You look at like our running backs, I'm looking at it and like it was our Redman, Antoine Smith, and Kevin Falk, and Kevin, I think Antoine Smith, or maybe Kevin Falk, I don't remember one of those was the top pressure with 33 yards So I mean pretty awful all around, I'd say.",
    "speaker" : "Mike Melo",
    "timestamp" : "36:53-37:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:10-37:21",
    "text" : "I I I was surprised how much they were trying to get their fullback Mark Edwards involved. Like he had like three or four carries. That was my worst."
  },
  {
    "timestamp" : "37:21-37:33",
    "text" : "The original first half their second half first drive was three plays calling Mark Edwards number. First down. And it's like, oh well, that didn't work. Duh. That's shocking.",
    "speaker" : "Steve"
  },
  {
    "text" : "No, I love that guy. He he was uh I mean yeah, he's he's basically deviling now, I think. Maybe you touched the ball a little bit more, but same guy.",
    "speaker" : "Mike Melo",
    "timestamp" : "37:33-37:41"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah I think he's Devlin, but without the um talent around him on offense to um to take away his touches.",
    "timestamp" : "37:41-37:50"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "37:51-37:53",
    "text" : "Oh yeah, okay. Makes sense."
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, guys, I gotta roll soon.",
    "timestamp" : "37:53-37:55"
  },
  {
    "speaker" : "Steve",
    "text" : "All right.",
    "timestamp" : "37:55-37:55"
  },
  {
    "text" : "Hey, wait, we still have so much to do. Hold on a second.",
    "timestamp" : "37:56-37:58",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "What are you guys gonna stock yourselves on?",
    "timestamp" : "37:59-38:01",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "38:01-38:01",
    "speaker" : "Mike Melo",
    "text" : "Huh?"
  },
  {
    "speaker" : "Steve",
    "text" : "You guys can talk to yourselves because you guys are doing a great job of that.",
    "timestamp" : "38:02-38:05"
  },
  {
    "speaker" : "Andy",
    "text" : "Just give me, Steve, just give me your best and worst, and I'll cut it in where it needs to go.",
    "timestamp" : "38:06-38:11"
  },
  {
    "text" : "Well, you heard my worst, of Starting the second half and just dishing the ball to Mark Edwards over and over again.",
    "speaker" : "Steve",
    "timestamp" : "38:11-38:18"
  },
  {
    "text" : "Yeah, that was a surprising play call, but What are you gonna do, I guess? Reliable. Yeah, what was your best?",
    "timestamp" : "38:18-38:27",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh actually honestly watching Corey Dillon and just getting a sneak preview of what he's gonna do in the Patriots.",
    "timestamp" : "38:27-38:33"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:33-39:01",
    "text" : "That's true, yeah. Yeah, and I i I mean he he looked apart that he could he was fast and he was strong and you don't see fast for a big guy. Yeah. Yeah. All right, cool. Alright, homies, good night. Alright, take it, buddy. Love ya. Alright, well now that he's gone. Real podcast."
  },
  {
    "text" : "Oh boy, that was awkward. And I thought he was I thought he was gone too and I was gonna say some nasty stuff.",
    "speaker" : "Mike Melo",
    "timestamp" : "39:01-39:08"
  },
  {
    "text" : "Alright, now he's actually gone. Are you lying or this is not into trouble in the past? I saw his name drop off the participants list. You can check it out.",
    "speaker" : "Andy",
    "timestamp" : "39:16-39:26"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh the participants list. Oh yeah. Oh yeah, I can't believe we didn't even touch on like the kicking game, and that was like the highlight of this whole thing. You have the Really? Yeah, you have Vinateri, right? I mean money in snow already at that point building a name for himself. The opposite, you have Neil Rackers. Which I mean the year before he went I can't believe they they kept him, but he went twelve for twenty-one. Uh that's rough.",
    "timestamp" : "39:26-39:58"
  },
  {
    "timestamp" : "39:58-40:00",
    "text" : "That's like the opposite end of the spectrum there.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, that's what I'm saying. And then we have like the greatest punter of all time on our team, um apparently. I didn't really realize how nasty this guy was, but",
    "timestamp" : "40:01-40:12"
  },
  {
    "speaker" : "Andy",
    "text" : "Um I I it felt like the way they were talking about him, it didn't feel like he was the best puncher of all time. It felt like he was the punter who had lasted the longest on the worst teams.",
    "timestamp" : "40:12-40:24"
  },
  {
    "timestamp" : "40:24-40:28",
    "speaker" : "Mike Melo",
    "text" : "Yeah, yeah, yeah. It it felt like the Vinnie Testaverdi type of Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:29-40:35",
    "text" : "'Cause it 'cause what do they say? The guy's like, I did the math and Lee Johnson has uh over twenty-eight miles of punting yards."
  },
  {
    "timestamp" : "40:36-40:42",
    "text" : "Yeah, i i it's insane. And I mean one of the highlights of the game was that 76 yard punt.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yes, yeah, I had that written down too.",
    "speaker" : "Andy",
    "timestamp" : "40:42-40:44"
  },
  {
    "timestamp" : "40:44-40:55",
    "text" : "In the four ranges. If that was like the Patriots teams of today, that shit would have been downed at the one. So we're actually, I mean, it would have been a 76 yard punt of like for real.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "40:55-41:10",
    "speaker" : "Andy",
    "text" : "Yeah, oh yeah. But it was uh I I I was surprised at how quickly they were jumping on those. Like as as soon as the ball hit the ground, they all just like jumped on and didn't like let it bounce and see where it would end up. It was very unpatriot like it felt like."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, I mean it was kind of a s right, sloppy execution, but I mean that dude was cool. You know it's it's it's a shame that the uh punter is one of my uh highlights, but hey.",
    "timestamp" : "41:10-41:23"
  },
  {
    "text" : "Yeah, well so far the punter and the highlights.",
    "timestamp" : "41:24-41:28",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "41:30-41:34",
    "speaker" : "Mike Melo",
    "text" : "Well hey, those are the building blocks of uh Belichick's teams."
  },
  {
    "timestamp" : "41:34-41:41",
    "text" : "Yeah, I mean you're not wrong. Uh I think Troy Brown was also uh a highlight if we're gonna talk about highlights.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, if you want to be real about it, then I mean if we're doing uh player of the game here, he's obviously the one. Uh You know, what do you have? A hundred a hundred and seven yards or something like that in the touchdown? Something like that.",
    "timestamp" : "41:41-41:54"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:54-42:46",
    "text" : "Yeah. He had that touchdown in the second quarter. And just felt like he was the only guy who was doing any sort of like big plays on offense. Like they didn't have any real big plays. They had one past the tight end, I think, that was probably the longest technical play. I think it was to Jermaine Wiggins, maybe. Um but it was Troy Brown who was the only one getting open. Like every time they needed something, like uh in the fourth quarter where they were like stuck in their own territory, like on the on the touchdown drive. Um the last touchman drive, they were on there like they're they're inside their own ten. And it was third and third and long and um somehow Bloodsoe fit it through two defenders to a falling over Troy Brown. It's like yeah, that's that's what I remember. Like I I d or I didn't actually remember anything from this game. But that play I think was the the most familiar out of all of it."
  },
  {
    "text" : "Yeah, it was interesting. Same for me. I was wondering as we kind of look back at these games how much I would actually remember. This one didn't really Stick with me.",
    "timestamp" : "42:47-42:57",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "No, I had no memory of this game whatsoever.",
    "timestamp" : "42:57-43:00"
  },
  {
    "text" : "And I thought I remember the storylines around it, you know, but I and I remember like the Brian Cox signing which I was pretty into, Roman Pfeiffer. And it was also interesting speaking of those guys. I mean, part of the issue I think with the defense was they were saying that I looked into a couple other things like Richard Seymour was out. Um, you know, Ted Johnson was was out. He was dealing with an injury which kind of reminded me a little bit of the Gronk injury on that like field goal that like",
    "timestamp" : "43:01-43:31",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "shattered his arm by Yeah, because he was it was in preseason he was on like punt duty or something like that. Yep. And got some sort of hip injury or I I can't remember exactly what they said, it was some leg injury. Yeah. And then because the papers were all up in arms about like, oh well this is why you don't have your starters playing punt on uh in the preseason. I thought, well that's that's who Belichick is. They just don't know this yet.",
    "timestamp" : "43:31-43:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right, I mean he I mean he there was never a departure from that, but um it was also interesting because I don't know if you saw the the stuff that just came out with Ted Johnson about talking about Belichick and their relationship, but I guess they had a rocky relationship for pretty much the entire the the maybe first three years that he w he worked with like uh Belichick. And then Belichick sort of went up to him and kind of was accountable for the way he was treating him or whatever. Maybe it stemmed from this, but uh they sort of made amends and then things were solid from that point on.",
    "timestamp" : "43:57-44:35"
  },
  {
    "timestamp" : "44:35-45:06",
    "text" : "Yeah, 'cause I remember when Ted Johnson retired, or shortly afterwards, there was a lot of talk about him talking about how the pages kind of took advantage of him because he was the the run stuff and he was a guy that was always like the one to clack heads and he he felt like they hadn't really protected him very well from like head injuries and things like that, I think. So I remember that coming out when it like when he first retired and that that was like kind of some of the reasoning why he did it, why he retired. And it's kind of, yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:07-45:40",
    "text" : "But yeah, so he just came out and was kind of talking about sort of Belichick's personality and demeanor, how he treats his players, but then like how he gets them back. So like the uh I mean it's also I mean this is for another another day, but he was also talking about how the butler thing, um how he was benched from the Super Bowl and obviously he was furious and then Belichick reached out to him afterwards and kind of made amends. So Ted Johnson's point was that it might have been a tactic on Belichick's part to treat people the way that he does and kind of play the puppeteer, but it's for another day.",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "45:43-45:51",
    "speaker" : "Andy",
    "text" : "being his MO, whether it is or isn't. But yeah. He's he's kind of built that that mystique around himself, I think."
  },
  {
    "timestamp" : "45:51-46:01",
    "speaker" : "Mike Melo",
    "text" : "Yeah, and it it works, you know, if you're if if you're looking for results, I mean, can't argue, but Exactly. And then yeah, and then I just had how good?"
  },
  {
    "text" : "I was just gonna say I think the reason that Corey Dillon had such a good game was because it was no Ted Johnson or Richard Seymour, 'cause he rushed for what he got like 140 yards in this game, something along those lines. Mm-hmm. Oh, I think the team ran for like 140. But uh 157 actually. Cordill, I know you had over a hundred. You did, yeah. Yeah. Oh yeah, it's 104. But yeah, the as a team they're in for like a buck fifty. And I think part of it was just that it was hot as balls apparently and you could just see the offense start to or the defense start to kind of lose their steam slowly every drive because the offense in the third quarter couldn't stay on the field. But I think not having those those two players, those two like run defense specialists on the on the field didn't help either.",
    "speaker" : "Andy",
    "timestamp" : "46:01-46:51"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, and then also the uh um they were saying that Willie McGuinness just w he was sort of trying to get back from uh back surgery and then Tyler had the foot injury. So I mean there was a lot of stuff going on.",
    "timestamp" : "46:51-47:05"
  },
  {
    "timestamp" : "47:05-47:28",
    "text" : "Yeah, they they were down to like the the skeleton crew by the end of it. And I think I I don't think this game should have been this close. Um 'cause I mean it ended 2317, so the Patriots were still kind of in it, but I think it was only because For some reason the Bengals offensive play calling decided to keep throwing the ball for no reason.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yep.",
    "timestamp" : "47:29-47:29"
  },
  {
    "timestamp" : "47:29-47:56",
    "text" : "And making all sorts of weird, strange decisions. Like they didn't um run a a play action pass until like two minutes left in the first half when they were gashing the pages on the run game. And they just couldn't like they just decided not to try to play action, which would have been the most obvious answer, I thought. But They also decided to punt from um the Patriots 35, which is hysterical.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:57-47:58",
    "speaker" : "Mike Melo",
    "text" : "Yeah, but hey, that was a hell of a punt."
  },
  {
    "timestamp" : "48:00-48:23",
    "speaker" : "Andy",
    "text" : "It better be because he's punting it like twenty yards. Yeah, I mean it got it inside the ten, but I mean it's not like they put it on the one. And I think that set up the Patriots scoring drive, didn't it? Because that was when they were pinned deep and then managed to drive the length of the score touchdown to keep it. Because they were up 13 and then the Patriots scored and and and kept it close."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right, yeah. And I mean, if we're talking about how they were running things, the the maddening thing watching this game was that You know, they're they're running a basically a four minute drill at the end of the half, the the pats are. And I mean it basically looks like there's like a minute and a half left on the clock. I mean th they're there's no awareness, people are freaking out, they're they're hurrying. Um so it's it's so different from what's a Brady run offense around that time. And then it ends with a sack. Bloodthorn takes a sack, and then the next play is a delay of game. So they got pushed out of field goal ray intervention was a disaster. And then at the end of the game, um the Yeah, the the two minute dr drill again was a disaster. I mean it it ended horribly. It was and I think that this is a pattern in sort of that era, uh the Bledsoe era, unfortunately.",
    "timestamp" : "48:24-49:16"
  },
  {
    "text" : "Yeah, you can you can kind of feel why when Brady took over Belichick was so comfortable with it because it felt like a lot of these games, even in the 2000 season, the uh Patriots kind of played to keep it close at the end. And then they they kind of set the offense up to have that one last drive to win it, and it just didn't ever really happen because it felt like Bledsoe couldn't run that two-minute offense or It it seemed like there was a lot of people creating other reasons why it it wasn't Bledsoe, but at the end of the day, he was kind of the one that was always there in the middle of it not not working. Right. But and then as soon as Brady comes in, he wasn't playing out of his mind the rest of the game, but he was just managing to find a way at the end of these games to finish them and get the the win.",
    "timestamp" : "49:16-50:16",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, and I think composure. I mean the uh the announcers we're talking about how Bletso's always cool into those moments and for me I think that was a big difference, like you're alluding to is that it was just a different demeanor. Uh, where I I think you would just panic to be honest, but Yeah, it it it felt to me more like",
    "timestamp" : "50:16-50:37",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Uh this might be too strong a word, but it felt more like uh a defeatist attitude. Here we are again. We I have to bring this team back, I gotta put them on my shoulders, let's Let's give this a shot, see what happens. It wasn't like it didn't feel like the the fire you would see, especially in Brady's early years. Oh yelling out the play of the lie, like screaming at people to get in the right position, sort of thing, you know? It just quite gave a shit.",
    "speaker" : "Andy",
    "timestamp" : "50:38-51:05"
  },
  {
    "timestamp" : "51:07-51:10",
    "speaker" : "Mike Melo",
    "text" : "Well, I mean that's that's tough to say, but it is, yeah."
  },
  {
    "text" : "And and I think with Bledsoe being where he was in his career too and how much punishment he had taken. I I I don't really hold it against him in any way, because I mean I I've never played any professional sports, but the, you know, playing men's open soccer on a Thursday night. If you're on a shitty team, you kind of you know what you're getting yourself into. Even if you're the best player on that team, you kind of it it wears on you, just just not being on good teams for a while. So I can understand why he would feel that way, but it wasn't successful for any of them.",
    "timestamp" : "51:10-51:47",
    "speaker" : "Andy"
  },
  {
    "text" : "I definitely played a lot of pickup flag football and I was consistently one of the better players on the team, so we have a sort of similar uh plight, I guess you could say. Blato and I I mean.",
    "speaker" : "Mike Melo",
    "timestamp" : "51:47-52:00"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:01-52:07",
    "text" : "Oh, okay. I was gonna say, because I like that you were you were alluding to me actually being the better player on my soccer team, because I I definitely was not."
  },
  {
    "text" : "I don't know about that. I'm glad to clarify this. Yeah, I mean I I always thought that you were gonna take the MLS route, but you know, you proved me wrong.",
    "timestamp" : "52:08-52:17",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:18-52:22",
    "text" : "Yeah, we just did the podcast route instead. Much more lucrative."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's all right. Um you want to do best moments here?",
    "timestamp" : "52:22-52:25"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:26-53:07",
    "text" : "Uh yeah, but before we do I just wanted to touch on that last drive because uh I thought The uh replacement refs kind of reared their head there. Because that last drive. Even though I don't think the pages would have won it, it was still some bullshit calls. Because there was the one Early, I wanna say it was like first or second down, where um a free rusher came in on Bledsoe and he kind of shrugged him off and made the throw to to Troy Brown, but they called him in the grasp like immediately. Yep. And so they they gave him the sack and and brought it away back. So it was instead of it being like second and five, it was second and like eighteen. Was it like kind of on the way down?"
  },
  {
    "text" : "So it kind of looked like it, but I mean he still got it off, but Yeah, but it like it's not something you would have blown dead.",
    "speaker" : "Mike Melo",
    "timestamp" : "53:07-53:13"
  },
  {
    "text" : "You would just wait to see how the play ended, sort of thing. Um and then the I think the next play was probably a sack, because this is Drew Bloodso in the two-minute drill. Um but so it was the third and like real long, third and eighteen or something like that. And um Blood so actually made the the pass to I don't even know what wide receiver it was. Uh I don't think it was patent. I want to say it was um Probably Bird Emmanuel, but he went down and made it made a diving catch. Yep. And um like it didn't look like Like it may not have been a catch, but it wasn't anything that you could overturn with replay. And replay I think was still pretty new in these days, but they overturned that and called it incomplete even though there's no like definitive evidence. So now it's like fourth and eighteen. from your own 20-yard line, and they decide to, like going back to what you said, roll Bloodzo out to his left as a right-handed quarterback, and then he For all intents and purposes, took a sack on the sideline. Throwing it like shh like just kind of shoveling it to whoever offensive line was in the vicinity, so it wasn't an official sack.",
    "timestamp" : "53:13-54:28",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:28-54:50",
    "speaker" : "Mike Melo",
    "text" : "Yeah, I mean it's kind of sad because you know, we didn't really get to see too much more of him moving forward. So that's sort of one of his last big uh plays and it is what it is. I mean fortunately I don't think anybody really remembers the specifics, but looking back It hurts a little bit."
  },
  {
    "text" : "Yeah, like I like I said, I I didn't remember any of this game, but a lot of it kind of felt familiar and that kind of um the the abject failure at the end of these games. It's like, oh yeah, no this I remember this. I remember when this just used to be the norm where You know, they'd be close, but they could never quite close the door because, you know, they get a penalty that would go against them and then they would just kind of fall apart from there. Or, you know, a play wouldn't go their way early in that last drive and they just like couldn't. couldn't make up for it, you know? Yep. Whereas now, you know, Brady gets sacked in its third and seventeen. It's like, oh well he'll he'll find Amandolo over the middle against the the Jaguars for 23 yards. In a in a playoff game because that that's just like they just rebound and you kind of expect it now most from these these Patriots teams these days, whereas back then, like the expectation was exactly the opposite.",
    "speaker" : "Andy",
    "timestamp" : "54:50-55:43"
  },
  {
    "timestamp" : "55:44-55:53",
    "text" : "Yeah, I mean I think that's the epitome of the entire Bulletto era minus the Super Bowl.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah. And I think the Super Bowl was kind of uh almost not wanting to believe that it was happening because this never happens to us as well.",
    "speaker" : "Andy",
    "timestamp" : "55:54-56:01"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah. I mean and that was a perfect storm anyway. I mean the team around them was something else, but clearly putting it on his shoulders like we've mentioned ad nauseum at this point. And I feel like we're not trying to bash uh Drablezo here, but just watching uh watching some of his highlights uh brings back some painful memories.",
    "timestamp" : "56:02-56:26"
  },
  {
    "text" : "So Yeah, I think just ki especially 'cause this was kind of later on in his career too. So late career Drew Bledsoe. I think it'd just been beaten down at this point. 'Cause it I mean, he was setting records before that. Like in his prime he was Yeah a top quarter. I had great fond memories of of some of those games when he's throwing 70 attempts to come back from 24 down or whatever it was against the the Vikings. Like games like that that I just I still stick out, but 2001 i it wasn't for him.",
    "timestamp" : "56:26-56:58",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "57:00-57:04",
    "text" : "Yeah. He had seen better days. I mean he played a part in 2001.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "We get to that later, but uh that's very true. Yeah, almost in fairy tale fashion, but yeah, like I said, we'll get to that when we get there. Um so yeah, let's let's uh do our best and worst. You want to go first?",
    "timestamp" : "57:05-57:17"
  },
  {
    "text" : "Yeah, I mean if we're doing I don't know if we're doing the three best moments or the three worst I mean I think we've kind of talked about these",
    "timestamp" : "57:18-57:26",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "57:26-57:32",
    "speaker" : "Andy",
    "text" : "Uh add nauseum. So I if you just want to pick one of each, I think that's all I have left in my list that we haven't talked about."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "57:32-57:53",
    "text" : "I don't know. Alright. I mean I i alright, fine. The um best moment was in a fumble. Um it was probably one of Yeah, it was one of my one of the best fumbles I've seen outside of like the butt fumble where I mean he basically fumbled with nobody touching it. He just lost Side of the ball. I don't know what happened."
  },
  {
    "speaker" : "Andy",
    "text" : "Um it it looked like he was trying to find the laces and then couldn't, so he decided to throw it anyway and just like J looked like it just like squeezed out of his hand. You just really needed the laces for that that goes flying backwards.",
    "timestamp" : "57:53-58:08"
  },
  {
    "text" : "Then it's it's amazing because then like you see Brewski just like flying over people trying to get to him. So yeah, it was kind of a fun visual to kind of see the ball just fly out of this guy's hand and then Bruski comes into the screen.",
    "timestamp" : "58:08-58:19",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "So that was probably uh That was actually gonna be my best was um seeing Bruski doing his run full tilt at the blocker and just jump over him do that flip into the quarterback. Yep. That was that was kind of like his signature thing was just running at the guy and just jumping over him or trying to and always getting clipped on the legs and always like ending up tackling the the quarterback with his with his ass cheeks or his or the back of his legs sort of thing.",
    "speaker" : "Andy",
    "timestamp" : "58:20-58:47"
  },
  {
    "text" : "Yep, yep. And then an honorable mention from me will be uh Bletto scrambling to the right, diving for a first down, helicopter spin. Yes. You know. That was that was pretty awesome. I mean he scrambled all over the place like you've mentioned, but that was that was an awesome play.",
    "timestamp" : "58:47-59:04",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, because he had that one and he also had uh he tried the the Q the quarterback sneak on fourth and two.",
    "speaker" : "Andy",
    "timestamp" : "59:05-59:10"
  },
  {
    "text" : "Oh yeah. Yep.",
    "speaker" : "Mike Melo",
    "timestamp" : "59:11-59:12"
  },
  {
    "speaker" : "Andy",
    "text" : "Which was a ballsy uh gutsy call, and I don't think um it was something Belichick was too fond of, like he was saying. I think it may have been uh thinking outside the box, but he got A yard and three quarters, which definitely didn't help. Right.",
    "timestamp" : "59:13-59:27"
  },
  {
    "text" : "Um, and then worst moments I would say Um the sixty-four yard return that the uh that they had after the Patriots' first touchdown, like was sort of backbreaking, I feel like.",
    "speaker" : "Mike Melo",
    "timestamp" : "59:28-59:40"
  },
  {
    "timestamp" : "59:41-59:51",
    "text" : "Uh I was surprised at how um unpatriot-like the special teams looked. Like they didn't seem to be very crisp on any of the execution anywhere.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, and it was rough because I mean you you right out out the gate you're you're scoring a touchdown, you're you're the lowly Patriots, so it's this boost, and then ne literally next play, it's sort of shattered.",
    "speaker" : "Mike Melo",
    "timestamp" : "59:52-01:00:04"
  },
  {
    "timestamp" : "01:00:05-01:00:07",
    "text" : "Yeah, no, you're absolutely right, it did.",
    "speaker" : "Andy"
  },
  {
    "text" : "Um then I'll throw out an honorable mention for this as well. Um it's more of a cringe worthy thing. But um I don't know if you heard the announcer go like, oh uh Greg Robinson Randall. Uh what kind of a guy has two names? And then the other announcer goes, Oh, he took on his dad's name after he passed. I'm like, oh, that is well. Yeah.",
    "timestamp" : "01:00:07-01:00:31",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "You could just you could feel the silence after that too. Yeah.",
    "timestamp" : "01:00:32-01:00:36",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That was pretty rough.",
    "timestamp" : "01:00:37-01:00:39"
  },
  {
    "text" : "Brutal. Yeah, I think that was uh I think it was a Brent Jones special that was.",
    "speaker" : "Andy",
    "timestamp" : "01:00:39-01:00:44"
  },
  {
    "timestamp" : "01:00:44-01:00:45",
    "speaker" : "Mike Melo",
    "text" : "Oh, okay, yeah."
  },
  {
    "timestamp" : "01:00:45-01:00:52",
    "speaker" : "Andy",
    "text" : "Two names Gus Johnson's like, well actually he took his dad's name because his dad passed. I'm like, whoa boy."
  },
  {
    "text" : "I mean that's um that's some comedy right there.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:00:53-01:00:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it was it was classic. Um Alright, so add to that, I'll I'll give you some honorable mentions too, some things that we didn't touch on yet. Um I liked the how excited the commentating team was about the uh what they called the shadow box.",
    "timestamp" : "01:00:56-01:01:11"
  },
  {
    "timestamp" : "01:01:11-01:01:14",
    "speaker" : "Mike Melo",
    "text" : "Oh scores from around the league."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:01:14-01:01:22",
    "text" : "Yes. This is brand new things. Like you might you might notice in the top corner we have what we're calling the shadow box, and it's gonna show you updated scores from around the league as they happen."
  },
  {
    "text" : "Well yeah, I mean the score on the screen at the same time? Because I don't remember this ever seeing the score, but I was seeing the other game scores.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:01:23-01:01:32"
  },
  {
    "speaker" : "Andy",
    "text" : "No, they did have the score in the the top left hand corner. But it was constantly changing.",
    "timestamp" : "01:01:32-01:01:37"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:01:39-01:01:40",
    "text" : "Oh, okay."
  },
  {
    "timestamp" : "01:01:41-01:02:50",
    "text" : "But yeah, but then in the top right hand corner they had what they were calling the shadow box, which is just like A gray box with white scores in it. They were super excited to be announcing that week one. They were able to show scores of of other games while this game was happening. Which I I really thought they had already been doing, but apparently not. Um and then uh the an honorable mention for the worst was um the upcoming schedule. Which uh not particularly funny, but they kept showing um the Pats playing the Panthers next week. Oh, right, right. Kept tripping me up and I was thinking, am I watching the wrong game here? I I had to go double check. I'm like, no, this is the right Bengals game. Why why are they saying that the Panthers was the next week? And then it finally clicked that between this game and the game was scheduled for next week was when nine eleven happened. So they canceled those games and pushed them to the end of the season. Yep. So A little bit of a down or tennis because why not, right? Yes, please.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Um I could say that uh Because of that, though, they played the Jets, and that's the Mo Lewis hit, which took Bledsoe out. So it could be said that Tom Brady and the dynasty happened because of 9-11.",
    "timestamp" : "01:02:50-01:03:04"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:05-01:03:26",
    "text" : "Oh, wait a way to bring that up a notch. All right. Oh I guess that's it, guys. And on that note We'll uh we'll be back we'll be back next time to talk about uh 2001 week two, which as we all know now is uh not against the Carolina Panthers, but we'll be"
  },
  {
    "speaker" : "Steve",
    "text" : "Versus the New York Jets in the game that changed it all. So thanks for joining us and we will talk to you next time. Late up. Woo. Bye.",
    "timestamp" : "01:03:26-01:03:37"
  }
]