[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid. You still want to listen? Go right ahead. I am not your mother.",
    "speaker" : "Mom",
    "timestamp" : "00:00-00:19"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:24-00:34",
    "text" : "Welcome again to the Patriots Dynasty Podcast. Back with me are the three amigos, Mr. Mello. Mike, how you doing?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Uh pretty darn good, I would say.",
    "timestamp" : "00:34-00:36"
  },
  {
    "timestamp" : "00:37-00:41",
    "speaker" : "Andy",
    "text" : "I'm glad to hear it. It sounds like you're recording from the beach, so I love that."
  },
  {
    "timestamp" : "00:41-00:47",
    "speaker" : "Mike Melo",
    "text" : "Oh man, it's the the concrete beach of Los Angeles. Oh baby. Yes."
  },
  {
    "text" : "It's great. You're uh you're not on fire at the moment, are you?",
    "timestamp" : "00:47-00:50",
    "speaker" : "Andy"
  },
  {
    "text" : "No, everyone's actually that noise you're hearing is uh people trying to leave the city, but I've decided to stay and do this thing. So you're welcome.",
    "timestamp" : "00:51-00:59",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "We appreciate your commitment. Thank you very much.",
    "timestamp" : "00:59-01:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01-01:02",
    "speaker" : "Mike Melo",
    "text" : "You got it."
  },
  {
    "text" : "All right, also with us we have uh Steve Brown. How's it going, Steve? Good.",
    "speaker" : "Andy",
    "timestamp" : "01:03-01:08"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08-01:11",
    "text" : "We'll miss you on future podcasts, Mike."
  },
  {
    "timestamp" : "01:12-01:14",
    "text" : "Thank you, man. That that means a lot.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "We also with us in a very Halloween mood today have uh Greg Brown. How's it going, G?",
    "timestamp" : "01:20-01:26"
  },
  {
    "speaker" : "Greg",
    "text" : "Going great. Best day of the year. Yeah? This is is this your favorite holiday? No, but I love Halloween.",
    "timestamp" : "01:27-01:34"
  },
  {
    "timestamp" : "01:34-01:36",
    "speaker" : "Andy",
    "text" : "Yeah, I fair enough. What is your favorite?"
  },
  {
    "timestamp" : "01:36-01:38",
    "speaker" : "Greg",
    "text" : "Getting ripped spooky today, boys."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh great. And I believe Greg is actually carving a pumpkin as we speak.",
    "timestamp" : "01:41-01:47"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:47-01:50",
    "text" : "So with a bowl full of candy sitting right next to me."
  },
  {
    "speaker" : "Andy",
    "text" : "Have you had any have any of you guys had any uh trick-or-treaters this year?",
    "timestamp" : "01:50-01:55"
  },
  {
    "speaker" : "Greg",
    "text" : "One.",
    "timestamp" : "01:55-01:56"
  },
  {
    "speaker" : "Andy",
    "text" : "We had one. And they are the the first ones we've ever had in the twelve years of living in our house.",
    "timestamp" : "01:57-02:04"
  },
  {
    "timestamp" : "02:05-02:05",
    "speaker" : "Mike Melo",
    "text" : "No kidding."
  },
  {
    "text" : "Yeah. So I don't think they're uh very excited.",
    "speaker" : "Andy",
    "timestamp" : "02:06-02:10"
  },
  {
    "timestamp" : "02:10-02:13",
    "speaker" : "Mike Melo",
    "text" : "I don't think there are kids in Los Angeles. I don't see them."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:13-02:22",
    "text" : "Yeah, I don't think there are either. Yeah, so I think child actors and they're already doing drugs anyway instead of Hey, whoa, we're not"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "We're not doing that.",
    "timestamp" : "02:22-02:23"
  },
  {
    "text" : "All right. So this week we're talking about uh week three of the two thousand one NFL season. Where the Colts came to visit I almost said Gillette Stadium, but it's not Gillette Stadium. It's Foxboro Stadium. Gillette Stadium is still being built in the background. And this is notable because it is Tom Brady's first ever NFL start after Drew Bledsoe's injury. The what is it? The hit her war round the world. Is that what we called it last week? The last episode. And uh as we talk about we we kind of put together some Boston Globe articles. from before the game and after the game and pretty much the entire week's worth of sports section from the week up to this was all about nothing but the Bledto injury and how they actually decided that Brady was going to be the starter instead of Any of the more experienced quarterbacks. I was wondering what you guys thought of that. Because they actually picked up um What was his name? Freeze. What's his first name?",
    "speaker" : "Andy",
    "timestamp" : "02:27-03:37"
  },
  {
    "text" : "Doug or something like that? Wasn't it John?",
    "speaker" : "Mike Melo",
    "timestamp" : "03:37-03:39"
  },
  {
    "text" : "John Freeze. Yeah, that's Something like that. And they actually the pages went out and picked him up, but still ended up starting Brady anyway for Reasons I think that were unbeknownst to at least the Boston sports media at the time, but became relatively evident. pretty quickly even in this game.",
    "timestamp" : "03:40-04:01",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "The Boston Sports Media is still complaining about Brady.",
    "timestamp" : "04:02-04:04"
  },
  {
    "text" : "This is this is true. Um I don't think that'll ever stop. But now they're they're complaining that he's gonna leave instead of that he's here. So it's a refreshing difference.",
    "timestamp" : "04:06-04:18",
    "speaker" : "Andy"
  },
  {
    "text" : "Bunch of haters. Animals.",
    "speaker" : "Steve",
    "timestamp" : "04:19-04:22"
  },
  {
    "timestamp" : "04:22-04:29",
    "speaker" : "Andy",
    "text" : "This is this is true. Do do any of you guys actually get to hear any Boston sports media these days? No."
  },
  {
    "timestamp" : "04:30-04:59",
    "text" : "I have to search for it. Yeah, I have to search for it. But what I do find, I mean the national media is intolerable, so I don't know how it is locally, but I mean you get the Stephen A. Smith's kinda ranting, you get the Max Kellerman's doing their thing, but I feel like it's tired, you know, they they've been doing this for what, five, six years now? And the stuff that they're talking about now with selling homes and you know, we'll find out I guess where this all heads, but it seems like a pretty far reach uh nowadays. So I don't know how it is for you guys.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, I mean for me, I'm I'm still living in it and it's actually worse here. It feels like Boston Sports Talk Radio, especially, um, and sports Twitter. all of the big names uh uh it feels like they're actively rooting against not even just the pages but new england sports teams in general",
    "speaker" : "Andy",
    "timestamp" : "04:59-05:21"
  },
  {
    "timestamp" : "05:21-05:26",
    "speaker" : "Steve",
    "text" : "Well that's why we're doing this, right? To give a fresh perspective of real Homerism."
  },
  {
    "text" : "That's exactly right. Yeah, if if if you want to break from all that that negativity, this is the place to be. Put on your Patriots footy pajamas. And come spend some time in our bedroom of of of Patriots love.",
    "timestamp" : "05:26-05:40",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I think my girlfriend thinks it's weird how handsome I think he is.",
    "timestamp" : "05:41-05:44"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "There's nothing wrong with that.",
    "timestamp" : "05:45-05:46"
  },
  {
    "text" : "No.",
    "speaker" : "Andy",
    "timestamp" : "05:46-05:47"
  },
  {
    "timestamp" : "05:47-05:50",
    "speaker" : "Mike Melo",
    "text" : "I mean Maybe she should be less judgmental."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, a dude recognizing the handsomeness of another dude. I I don't see anything wrong with that. It's 2019. Especially when he's that handsome. I mean Tom Brady. It's he just he ages like a fine wine. That's true.",
    "timestamp" : "05:50-06:02"
  },
  {
    "text" : "Long hair Brady though. Bring that back.",
    "timestamp" : "06:02-06:05",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "All I know is I have uh insider uh info here. I I know a gentleman who has dated uh several women who have been with intimately, um, Tom Brady and Aaron Rodgers. So I don't I can't think of a luckier guy than that.",
    "timestamp" : "06:06-06:22"
  },
  {
    "text" : "Who is he? Name name. I can't reveal this information.",
    "timestamp" : "06:22-06:26",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "06:26-06:27",
    "speaker" : "Mike Melo",
    "text" : "Come on."
  },
  {
    "speaker" : "Greg",
    "text" : "Would you bang him?",
    "timestamp" : "06:30-06:32"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Who my friend?",
    "timestamp" : "06:32-06:34"
  },
  {
    "text" : "Yes.",
    "speaker" : "Greg",
    "timestamp" : "06:34-06:35"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "06:39-06:40",
    "text" : "While we're on the topic."
  },
  {
    "speaker" : "Andy",
    "text" : "It was like an Eskimo Brothers sort of thing, right?",
    "timestamp" : "06:40-06:43"
  },
  {
    "text" : "I of course Look, I I can't talk about this gentleman. I'm sorry.",
    "timestamp" : "06:43-06:48",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "That's because it's him, boys. It's it's him. It is not.",
    "speaker" : "Andy",
    "timestamp" : "06:50-06:53"
  },
  {
    "timestamp" : "06:53-06:57",
    "speaker" : "Mike Melo",
    "text" : "It is not. Like I said, I would be I would be I would feel honored."
  },
  {
    "text" : "Well, quickly got off track too. That that took like 30 seconds.",
    "timestamp" : "06:58-07:03",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "07:04-07:38",
    "text" : "Um, I shouldn't uh Andrew. Um I thought that it could be broken down into two things, what you were asking about this game and uh you know the Bledsoe situation and also Brady. I mean the uh the quicker part of it, um I do think it's interesting that Brady was chosen considering that Damon Heward was technically ahead of him at the beginning of the season. And I didn't know that he was a career five-and-one quarterback at that time. So I mean Belichick was pretty bolt to throw in a guy who threw in what like two or three professional passes before that.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:38-07:39",
    "text" : "Yep."
  },
  {
    "timestamp" : "07:40-07:41",
    "speaker" : "Mike Melo",
    "text" : "So I thought that was pretty interesting."
  },
  {
    "timestamp" : "07:41-07:53",
    "speaker" : "Andy",
    "text" : "Yeah, I think Brady's stats before this, he had thrown three passes and completed one of them for six yards in a blowout the year before on Thanksgiving against the Detroit Lions. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Well, I mean that doesn't count the passes he threw when Bledsoe got hurt in the Jets game. He looked pretty good in that game.",
    "timestamp" : "07:53-07:58"
  },
  {
    "timestamp" : "07:58-08:35",
    "speaker" : "Andy",
    "text" : "Oh that's true, yeah. Yeah, I mean yeah, I that that's the one thing that stuck out to me, and this was and we'll just start talking about Brady, I guess. Um just how Brady like he looked. I mean he wasn't as accurate and he wasn't Like the results weren't quite there, but he just looked like Tom Brady. He walked in there just looking like he owned the place, like he'd been the starter for 20 years already. Had complete control of the huddle. And then his first play from Scrimmage, he ran into a sack. And his first pass attempt, he chucked it 20 yards over the head of"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Uh you know, he's uh earned his confidence, I guess you could say. And uh uh but in reading how he spoke, and I guess I kind of remember this a little bit back then, but It obviously wasn't a thing until maybe years later. But I mean, um, he was pretty confident with the media, he was pretty confident with with Robert Kraft. And we all know the story about how, you know, he approached Robert Kraft after he drafted him and basically told him that it was the best decision he ever made. Well, that sort of carried through to like the rest of the media. I mean he everything that I read was this guy who was claiming he wasn't nervous, he was ready, he was underestimated. And this was like even before his first start. So I I mean that was pretty I don't know if it's impressive or what, but the guy obviously knew who he was.",
    "timestamp" : "08:49-09:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, absolutely. I will say the one difference that I noticed, the biggest difference was um how much of a hardo he was on the uh the snap cadence. Like he was barking out signals back then. I don't know if that was just like an overcompensation thing, but now like he still yells at people, but it's not the same, you know, like he's just he's just trying to get the ball in his hands. But back then he was like Or maybe maybe it was just the uh the audio the way it was different back then, but it just sounded like he was putting a whole bunch of extra oomph into snapping that football.",
    "timestamp" : "09:36-10:11"
  },
  {
    "timestamp" : "10:12-10:33",
    "speaker" : "Mike Melo",
    "text" : "I mean that might play into um I also read that uh he felt like he always did whatever he wanted to do uh team wise to get them motivated, but as a backup, he sort of don't have any leverage. So he felt that by being a starter for the first time, people actually would listen to what he was barking out. So it might have played into that."
  },
  {
    "timestamp" : "10:33-10:36",
    "speaker" : "Andy",
    "text" : "Yeah, I could see that. That would make a lot of sense."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "10:36-11:28",
    "text" : "Um the the other part of the thing that you uh that you had brought up um that I was referring to was yeah, the the Bletto injury. But I actually thought it was interesting and again I didn't think anything of it back then. But um there was a so along with his punctured lung um and the internal bleeding, um I guess he might have or might have not blacked out for uh you know a number of seconds and he was encussed. Um you know and and Belichick kind of talked openly about it, which he obviously wouldn't today, but he was talking about how he regretted throwing Drew out there because he wasn't quite himself. And a lot of articles were actually addressing you know, creating a concussion protocol or something like that. Well, that was obviously years out. But uh that was pretty interesting to to see and kind of see where Drew was at at that time as well."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. Yeah, no, that was uh yeah, because that was before the whole like even before I think concussions were talked about as part of football too. Um, because uh the the one thing that I've noticed about watching these games in general is just how much harder the hits seem. And how there's a whole lot more like head contact in all these hits. I mean, I I think the defensive star of this game that we'll we'll get to eventually is um Brian Cox and he was just laying the wood on people. But he it felt like he was leaving with his head the entire time.",
    "timestamp" : "11:28-12:06"
  },
  {
    "timestamp" : "12:06-12:10",
    "speaker" : "Steve",
    "text" : "And like Just like the offensive receiver thing, not a thing."
  },
  {
    "text" : "Oh yeah, just laying out ri receivers. There was uh one kickoff return where Uh Tabucky Jones basically just clothesline the the kick returner and got a penalty for it, but was still taunting the entire time they were like calling the penalty, still like jacked up about it.",
    "timestamp" : "12:10-12:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "12:25-12:27",
    "text" : "It was it was like a straight clothesline."
  },
  {
    "timestamp" : "12:28-12:33",
    "speaker" : "Andy",
    "text" : "Yeah, just straight up just just caught him s right across the neck. Like, oh no, he's beat me."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "12:33-12:36",
    "text" : "I'll just stick my arm close slide in this guy."
  },
  {
    "text" : "It was it was a bit brutal. And and they called it a face mask. Just mashed that guy's throat with his forearm.",
    "timestamp" : "12:37-12:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Commentators were like loving it too.",
    "timestamp" : "12:45-12:47"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "12:48-12:48",
    "speaker" : "Andy"
  },
  {
    "text" : "Well that was Gus Johnson. Setting a tone here. You can see how he leads with his head. What a great hit. It's like geez.",
    "timestamp" : "12:48-12:56",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Oh yeah. Um but before we get too far into that, let's uh let's talk about the cults because we probably should have started with that. Um So this Colts team coming in was 2-0. They had blown the doors off of the Dolphins and the Bills, I believe. Um, and the week before, like, they like put up 40 something points on the on the Bills. They didn't punt the entire game. It was, you know, the typical Peyton Manning Colts offensive performance. Um I think their first four or five drives of the half were touchdowns of the first half in the in that game. So uh I looked it up and the Colts are you favored by eleven and a half in this game. Yeah, coming into Foxboro Stadium against a team that actually Had uh uh Belichick had given Manning trouble in the past, like the year before I think the the pages had beat them once. Um but this was not the Colts' best year, actually. This was when they were still in the AFC East. They would finish the season 6-10, even after starting 2-0. Um and they would finish fourth in the AFC East out of five teams, I want to say. Yep. And they were one The AFC East actually sent three teams to the playoffs this year, and they were one of the ones that weren't. It was them and the Bills didn't make it, but it was the Pats Dolphins and Jets off from the AFC East made the playoffs. Um here's an interesting morsel for you boys. Uh you can put this in your little uh Halloween basket. Uh their head coach was Jim Mora, who is actually a different Jim Mora than the one who coached the Falcons. I didn't realize there was two of them.",
    "timestamp" : "12:56-14:53"
  },
  {
    "text" : "Are they related?",
    "speaker" : "Mike Melo",
    "timestamp" : "14:55-14:56"
  },
  {
    "timestamp" : "14:56-15:12",
    "text" : "Yeah, wow. That's what I mean. That's a tasty morsel. Yeah. I don't know if they're related. I I couldn't I couldn't find anything in the 30 seconds of Googling I did. But I just I got super confused trying to find out which one was which.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, isn't it Jim Moore Jr. ? Again, I don't know if there's a relation or not. But I also was very sad in looking over everything and realizing that it was Jim Morris, the Colts of Jim Morris, last season as a coach. And that guy was a character, and I miss him dearly. He was the he was the playoffs guy. Yeah, oh hell yeah.",
    "timestamp" : "15:12-15:31"
  },
  {
    "timestamp" : "15:32-15:37",
    "text" : "Play offs playoffs talk about playoffs",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And I think you followed it up with I just want to win a damn game. So that's fair.",
    "timestamp" : "15:39-15:42"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "15:42-15:43",
    "text" : "That could have been this season."
  },
  {
    "speaker" : "Andy",
    "text" : "Because they did finish six and ten and miss the playoffs.",
    "timestamp" : "15:46-15:49"
  },
  {
    "text" : "Oh, was it this year?",
    "speaker" : "Mike Melo",
    "timestamp" : "15:49-15:50"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:50-15:51",
    "text" : "It could have been."
  },
  {
    "text" : "Oh man, that's great.",
    "speaker" : "Mike Melo",
    "timestamp" : "15:51-15:53"
  },
  {
    "speaker" : "Andy",
    "text" : "The other um coach of note in this game was their defensive coordinator, Vic Fangio, who you might recognize from um being a horrendous uh Flacco led Broncos team this year. And he is in charge of that dumpster fire. Although they're they're not Flacco led anymore. They're Flacco less. Right? Because he's out? Yeah. That's right. He just got hurt.",
    "timestamp" : "15:53-16:18"
  },
  {
    "text" : "So I'm sure they'll turn it around the second half of the season without John always created drafting quarterback, so this is a done deal.",
    "timestamp" : "16:18-16:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "You know, is it Vic or is it L Way?",
    "timestamp" : "16:28-16:31"
  },
  {
    "timestamp" : "16:32-16:59",
    "speaker" : "Andy",
    "text" : "Uh I don't think Denver will ever get rid of LA. That's just on names as well. Did you see the the story about how he uh had all the boxes checked for drafting Russell Wilson except for the height one. And so he he passed on him. That's so John Elway. He loves him some big white quarterbacks with massive arms."
  },
  {
    "text" : "That's candy.",
    "timestamp" : "16:59-17:00",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh all right, let's start uh so we'll go to the players. Um I don't know if we can uh can any of you name anybody on the defense?",
    "timestamp" : "17:03-17:12"
  },
  {
    "speaker" : "Greg",
    "text" : "For the Colts. I didn't recognize a single guy.",
    "timestamp" : "17:13-17:14"
  },
  {
    "timestamp" : "17:15-18:15",
    "speaker" : "Andy",
    "text" : "The Colts. Yeah. For the Colts. I recognized one guy. I recognize one name and it was Jeff Burris. And I remembered him as a Buffalo Bill. I didn't even know he played for the Colts. I don't remember him being particularly good. I think I just had his football card growing up. That was literally the only thing I recognized, which um It makes a lot of sense when you see how this game ended. I love the the talk of the commentators about how the Colts were feeling disrespected because uh the offense was so good and everybody was talking shit about the the Colts defense. And then the pages came in and just dominated them. Offense had a lot more known names. Obviously, quarterback Peyton Manning. He threw for over 4,000 yards this season and 26 touchdowns, but he also had 23 picks. And I think most of those came against the Patriots. Did it do they count? I'm assuming they don't count uh pick sixes as touchdowns thrown, right? For for the quarter quarterback now."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "18:16-18:16",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:16-18:18",
    "text" : "Because I mean that would give them an extra couple."
  },
  {
    "speaker" : "Steve",
    "text" : "I mean if that was the case, the Dolphins would be like leading the league this year.",
    "timestamp" : "18:18-18:21"
  },
  {
    "timestamp" : "18:23-18:27",
    "speaker" : "Andy",
    "text" : "I think Fitzpatrick would lead the league every year. The hammer Jameis Winston."
  },
  {
    "text" : "Jameis. Definitely Jameis.",
    "speaker" : "Steve",
    "timestamp" : "18:28-18:29"
  },
  {
    "text" : "And then for wide receivers, they had obviously Marvin Harrison. Who hang on, where's my note for this? I wrote this down. I thought it was funny, so I'm gonna I'm gonna beat you over the head with it. Uh Marvin Harrison was dropping balls in this, like he drops bodies.",
    "timestamp" : "18:31-18:46",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh.",
    "speaker" : "Greg",
    "timestamp" : "18:47-18:47"
  },
  {
    "timestamp" : "18:49-18:59",
    "speaker" : "Andy",
    "text" : "I thought that was a good one. And there was also Red Red Sheep Wayne was actually on the team. This was his rookie season, but I don't think he caught a ball in this game, at least not one that I noticed."
  },
  {
    "text" : "Nah, it's all Jerome Pathon. Yeah, he was in a factor.",
    "speaker" : "Steve",
    "timestamp" : "18:59-19:01"
  },
  {
    "text" : "Yeah. Jerome Path on who was leading the leading the team in receptions, which was baffling. Because I don't I kind of recognize the name, but I don't remember him playing for the Colts for some reason.",
    "timestamp" : "19:01-19:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I do. I feel like he was like once Reggie Wayne came good too. He was like a solid number three guy.",
    "timestamp" : "19:14-19:19"
  },
  {
    "timestamp" : "19:19-19:53",
    "text" : "Yeah, maybe, yeah. I don't know, but he he didn't have a great game either. Um, it's because Brian Cobb's taking his head off every time he touched the ball. Yeah, that definitely set the tone. Um so The tight end was Marcus Pollard, who was actually the second leading receiver on the team this season behind Ron uh Marvin Harrison. And then the running backs, which I want to talk about, were uh Dominic Rhodes, who was the leading rusher apparently on the team, even though I don't remember seeing him much in this game.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, he was a rookie too, I think.",
    "timestamp" : "19:54-19:56"
  },
  {
    "timestamp" : "19:56-20:46",
    "speaker" : "Andy",
    "text" : "Yeah, and then uh Egrin James was here and I I feel like he was the leading rusher. for the past few years before this, but I don't know if he had injuries or just a bad year or whatever, but he he finished uh distant second in rushing this year. And I kind of wanted to use that as a segue to talk about this Patriots defense because I thought, I don't know if they were in Egaran James's head or if he's just soft. I don't remember. I I I remember the kind of the general feeling of the Pagers being a harder team than the Colts, and the Colts were always like a bit more finesse, and you could kind of beat them up. But Agri and James. was super soft in this game. Did anyone else see that or am I an idiot?"
  },
  {
    "text" : "That's the home reason we're looking for, Andy.",
    "timestamp" : "20:47-20:49",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Um, I don't know. I mean, I kind of feel like he was always like that against the Patriots. And I don't know if it was the type of game that they got into. Um I mean, obviously in this one it was a little bit lopsided towards the end, but I don't know. I f I feel like didn't you have a rap for being kind of soft sometimes?",
    "timestamp" : "20:51-21:07"
  },
  {
    "timestamp" : "21:07-21:41",
    "speaker" : "Andy",
    "text" : "I that's that's what I'm I'm thinking. I know the whole team, but Agor and James, like it he never seemed to finish a run. Every time he got hit he just kind of went down. I mean he's a good one. Oh yeah, he's great in space. He can make people miss. He never seemed to like try to get that extra yard. Yeah, I don't think that was style. A couple of like third and ones where they ran off the middle, he was like hit somebody and fell over, and that was it. So I don't know if it was like if he was dealing injury or what, but I mean he was Kind of responsible for a lot of the mistakes on the Colts offense in this game."
  },
  {
    "text" : "Like he had a rough game I don't know, Peyton Manny threw some brutal interceptions.",
    "speaker" : "Steve",
    "timestamp" : "21:41-21:46"
  },
  {
    "timestamp" : "21:47-22:04",
    "text" : "He did. And I think I mean this is A Bill Belichick defense going against the young quarterback. Um, because let's see, Peyton Manning, how many years had he been in the league at this point? Two or three?",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, but I mean he was like he was crushing it. You know, i even in the year prior. I mean his first year was a wash, but yeah, I mean he was kind of evolving the offensive. side of things, um, football-wise. So I mean, yeah, he was young, but I mean i we gotta give Belichick credit for coming up with a game plan that he was sort of blowing up other teams with. Um and yeah, sure. I mean it it as he got more seasoned, um, it was a little bit more of a chess match, but uh he still was a pretty experienced guy at this point, I feel.",
    "timestamp" : "22:05-22:42",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, I mean i uh looking at it now he's his rookie year was ninety eight so this is his fourth year in the league. Yeah. He'd thrown for His first year he threw for 3,700 yards and everything after that was at least 4,000 yards. And in the two seasons prior to this, he gone 13 and three and then 10 and 6. So I mean they they've been putting up numbers He'd been throwing touchdowns and they were winning games, but still like he just looked lost in this game. I mean there was some Mistakes that weren't necessarily his, like a couple of the interceptions were bounced off of receivers' hands and stuff like that, like one of the ones Egrin James Had a pass out of the backfield that he bobbled straight up into with Roman Pfeiffer's hands. God, so soft. So soft. And then the one where uh even Eckern James, he Um he caught a screen pass and then tried to switch the ball from one hand to another and just straight up dropped it. Just that's just soft.",
    "speaker" : "Andy",
    "timestamp" : "22:42-23:40"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well, and also, I mean, as as we'll see as the season goes on, um the way that they did play defense, like Steve was talking about, they're like mauling wide receivers and Uh that that was something that Peyton obviously couldn't adapt to, and his receivers couldn't either. So it's sort of like I think a perfect storm for every part of that offense to kind of be affected in one way or another.",
    "timestamp" : "23:41-24:06"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I think the PC at that time matched up really well with their offensive style of play.",
    "timestamp" : "24:07-24:12"
  },
  {
    "timestamp" : "24:13-24:28",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, they were very kind of big physical corners. Um even Ty Law, who you don't really think of as a physical corner, um because of the time he played in, was I mean you look at him play now and he was"
  },
  {
    "speaker" : "Steve",
    "text" : "All over people. I mean Tabucky Jones clothes on a dude.",
    "timestamp" : "24:29-24:32"
  },
  {
    "text" : "Yeah, exactly. Um let's see",
    "speaker" : "Andy",
    "timestamp" : "24:32-24:38"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I wanted to ask you about the um so Gus Johnson and Brent Jones were the commentators. Did you have any level of hatred towards uh those fellows?",
    "timestamp" : "24:40-24:49"
  },
  {
    "text" : "Gus Johnson was was pretty dumb, but I I like uh not Gus um what's his name? Gus Johnson's the best. Yeah, no, sorry, yeah. Brent Jones was kind of like whatever. I don't think he really knew he was talking about. No, Gus Jones is great. He can make anything sound exciting.",
    "speaker" : "Andy",
    "timestamp" : "24:50-25:05"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he's he's the he's one of my all-time favorites.",
    "timestamp" : "25:05-25:08"
  },
  {
    "text" : "Yeah, no, Gus Johnson's great.",
    "timestamp" : "25:08-25:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Him doing the final four is is just music to my ears.",
    "timestamp" : "25:10-25:14"
  },
  {
    "speaker" : "Andy",
    "text" : "From the parking lot. Sorentine. From the parking lot. Exactly. Batista with the catch! But even in this, yeah, what was the I wrote it down? Brady threw a frozen rope.",
    "timestamp" : "25:14-25:32"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's a good line.",
    "timestamp" : "25:33-25:34"
  },
  {
    "timestamp" : "25:34-26:26",
    "speaker" : "Andy",
    "text" : "It was like a a 20-yard in. It was great. I mean he hocked it, but you know he just gets so excited. I also liked how they were he was. He was uh He he bet Brent Johnson, he's like, uh I will carry your luggage for the rest of the year if the Colts get shut out. Like halfway through the third quarter And then I had to stop and look at the score and be like, did they no, I don't think they got shut up. And then they showed um the shot of the uh the leader of the Boston Symphony. And prank goes, hey, you like the symphony, Gus? And Gus is like, nah, that's not my thing. And then they just kind of moved on. Glad we brought that up, boys. Um all right, yeah, before we get to the game, um, was there any other like uh like non-football related stuff that you guys noticed? Because I had a couple things."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I noticed that Brady looked goofy as hell. Oh, absolutely. And it's amazing how he could take a team and get everyone on board and like obviously the way he is now, Mr. Model and you know, um yeah uh pristine everything and I I feel like that sort of what was that?",
    "timestamp" : "26:27-26:45"
  },
  {
    "text" : "The most handsome man alive",
    "timestamp" : "26:45-26:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, pretty much that. Yeah. And I I feel like that turned around like maybe like oh seven. So before that he was sort of like this regular guy. Um I thought that was just fun to kind of see this wide eyed kid who was a little dopey and like goofy and uh",
    "timestamp" : "26:47-27:01"
  },
  {
    "timestamp" : "27:01-27:03",
    "speaker" : "Andy",
    "text" : "He is. He's such a goober."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "27:11-27:18",
    "text" : "Whatever like Ron Howard was, um, he reminds me of that kid. O p OP? I don't know."
  },
  {
    "text" : "Uh we didn't watch T V in the Brown House growing up.",
    "timestamp" : "27:18-27:21",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "It was just for the PBS, right?",
    "timestamp" : "27:21-27:24"
  },
  {
    "text" : "Yeah. It was Mr. Rogers and football on Sundays. That was it.",
    "timestamp" : "27:24-27:27",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't think you need anything else.",
    "speaker" : "Mike Melo",
    "timestamp" : "27:28-27:29"
  },
  {
    "speaker" : "Andy",
    "text" : "We couldn't even call it TV.",
    "timestamp" : "27:29-27:30"
  },
  {
    "speaker" : "Steve",
    "text" : "We had to call it you know what.",
    "timestamp" : "27:30-27:32"
  },
  {
    "timestamp" : "27:32-27:38",
    "text" : "Oh, that's right. We weren't allowed to say the word TV. Because otherwise you wouldn't be allowed to get to watch TV.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I mean how did you how did you guys deal with this? Oh boy.",
    "timestamp" : "27:40-27:46"
  },
  {
    "timestamp" : "27:46-27:48",
    "text" : "Uh even that wouldn't work sometimes.",
    "speaker" : "Andy"
  },
  {
    "text" : "Joke's on you, Mom. I'm addicted to Netflix. She did her best.",
    "timestamp" : "27:48-27:54",
    "speaker" : "Greg"
  },
  {
    "text" : "I'm watching TV as we're doing this podcast right now.",
    "speaker" : "Steve",
    "timestamp" : "27:55-27:57"
  },
  {
    "text" : "Yeah, I definitely went through a phase where if a TV was on, I couldn't not watch it.",
    "timestamp" : "27:59-28:03",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "28:03-28:06",
    "speaker" : "Steve",
    "text" : "And that was a detrimental thing with the TV on."
  },
  {
    "text" : "Oh god, no. Um did you guys notice the old school uh touchdown song? That was one of the things I want to bring up.",
    "speaker" : "Andy",
    "timestamp" : "28:06-28:13"
  },
  {
    "text" : "What was that?",
    "timestamp" : "28:14-28:15",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "The uh hey Oh yeah, yeah.",
    "timestamp" : "28:15-28:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I always like that one. Yeah.",
    "timestamp" : "28:19-28:20"
  },
  {
    "timestamp" : "28:20-28:43",
    "speaker" : "Andy",
    "text" : "Yeah. I'm like, oh, why'd they get rid of it? So I looked it up. Um it was written by Gary Glitter, who um turns out was convicted of downloading over 4,000 pornographic images of children and sent to jail for the channel. He was also charged with having sex with an underage girl. Then in March 2006, Glitter was convicted of molesting two girls aged eleven and twelve in Vietnam and jailed for three years."
  },
  {
    "text" : "Wow, we had to bring it down, maybe.",
    "timestamp" : "28:44-28:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:46-28:53",
    "text" : "I know. As much as I like the song, I I kind of understand why uh why they don't play that one anymore."
  },
  {
    "text" : "Yeah, give me crazy training, I'm good.",
    "timestamp" : "28:54-28:56",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "28:56-28:56",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "But I will say that. Although did you hear what happened to Ozzy Osbourne recently?",
    "timestamp" : "28:57-29:01"
  },
  {
    "timestamp" : "29:01-29:03",
    "speaker" : "Steve",
    "text" : "No. Childborn?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I don't know. I'm just throwing that out.",
    "timestamp" : "29:04-29:05"
  },
  {
    "text" : "I have no idea what's going on with Ozzy. There's like truth to that. Like if you look up all those like hair metal guys from the 80s, almost all of them have like underage women rumors.",
    "speaker" : "Greg",
    "timestamp" : "29:07-29:20"
  },
  {
    "text" : "Yeah, that sounds about right. I mean they all dress like they were carting them.",
    "timestamp" : "29:20-29:29",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:29-29:30",
    "text" : "That's all I want.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Oh they definitely were. I'm sure they were checking IDs at the door.",
    "timestamp" : "29:30-29:32",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:33-29:35",
    "speaker" : "Steve",
    "text" : "They've been on track for a while there."
  },
  {
    "text" : "Yeah, not really. Uh the other thing that I I do wish they kept was um every time the page drowned defense and it was third down, they had that like bell tolling.",
    "timestamp" : "29:35-29:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh yeah.",
    "timestamp" : "29:48-29:49"
  },
  {
    "timestamp" : "29:49-29:54",
    "text" : "I know they have the whatever horn it is now, but that bell tolling is ominous as hell.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "You know why they stopped that?",
    "timestamp" : "29:55-29:55"
  },
  {
    "timestamp" : "29:57-29:58",
    "speaker" : "Andy",
    "text" : "Why'd they stop it, Mike?"
  },
  {
    "timestamp" : "29:59-30:10",
    "text" : "Because the guy that would ring that fog horn thing He was caught doing things with the turtle and people were pretty upset about that. Um, I don't know if you remember this or not.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh involved.",
    "timestamp" : "30:10-30:12"
  },
  {
    "text" : "Yes.",
    "timestamp" : "30:12-30:13",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:13-30:16",
    "text" : "Uh like the the writers of the uh team jute ninja turtles."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "No, you're I'm being serious guys. If you look it up, Google it Uh just type in guy who uh controlled the foghorn for Foxboro Turtle, and you'll know exactly what I'm talking about.",
    "timestamp" : "30:17-30:30"
  },
  {
    "text" : "All right. I'm allowed to listen to that.",
    "speaker" : "Andy",
    "timestamp" : "30:30-30:33"
  },
  {
    "speaker" : "Greg",
    "text" : "In Google, it shows up. It does? What is it? No, what?",
    "timestamp" : "30:33-30:39"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Because you made it up, you dickhead. No, I didn't. That's I don't like that, Greg. It does?",
    "timestamp" : "30:39-30:48"
  },
  {
    "text" : "You made the lieup, dude. I can't confirm to deny.",
    "speaker" : "Greg",
    "timestamp" : "30:50-30:55"
  },
  {
    "timestamp" : "30:57-31:57",
    "text" : "Uh all right, so um with that out of the way, let's talk about the game itself. Um It was felt like it was over from the first quarter to me. And I I kind of forget what this feels like to be an underdog and take the lead in a game. Because I couldn't tell you the last time it happened. Like recently. Because usually it's the other way around where the Patriots are the favorite and it's an underdog beating them. And I know what that feels like. Because we had that, was it last year against the Titans? Where you could kind of feel it in the first quarter, you're like, this isn't gonna go well. And if the Patriots win, it's gonna be ugly and they don't deserve it. And the the Titans just outplayed him. Yeah, me and Greg were there for that. Yeah, that's right. I was actually supposed to go that game and I'm glad I didn't. Although at the very end.",
    "speaker" : "Andy"
  },
  {
    "text" : "I'm glad you didn't too. At the very end, I was like, in the fourth quarter, it's like five minutes left. I'm like, Greg, let's leave. And he's like, Nope. You gotta sit there and take your licks, bro. That's right. True. Yeah. Yeah. And then is that the same year we whooped them up in the playoffs?",
    "speaker" : "Steve",
    "timestamp" : "31:57-32:16"
  },
  {
    "text" : "No, we didn't play in the playoffs that year, did we?",
    "timestamp" : "32:17-32:18",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, this was last year.",
    "timestamp" : "32:19-32:20",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "32:20-32:21",
    "speaker" : "Andy",
    "text" : "Yeah, this is this past year."
  },
  {
    "speaker" : "Greg",
    "text" : "But it was it was all part of the journey.",
    "timestamp" : "32:22-32:24"
  },
  {
    "timestamp" : "32:25-32:37",
    "text" : "Yes. But like yeah, I forgot what it feels like to be the underdog and take that lead like into the into the first quarter because it was How's that pumpkin going, Greg?",
    "speaker" : "Andy"
  },
  {
    "text" : "It sucks, dude. Carbon pumpkin blows.",
    "speaker" : "Greg",
    "timestamp" : "32:38-32:40"
  },
  {
    "text" : "It sounds like you're slurping on something.",
    "timestamp" : "32:41-32:43",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. It's already coming out like shit. I just gave up.",
    "timestamp" : "32:43-32:46"
  },
  {
    "text" : "Oh God. Uh I'm not an artist. No, I'm me neither. I'm an artiste. No, you're not. But yeah, I mean the this game, like the pass just came out and controlled it from the beginning. They had was 103 rushing yards to the Colts 13 in the first quarter alone. Um which was basically all Antoine Smith. Like that dude is an absolute monster. He reminds me of like a skinnier Lagarrett Blunt. Yes. Like he he's not the fastest guy. I mean he he was quick, but he wasn't like he wasn't gonna pull away from people like defensive backs if he if he's if he breaks off a run. Like they'll catch up to him, but he's gonna he's gonna make him earn that tackle.",
    "timestamp" : "32:50-33:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "33:38-33:40",
    "text" : "Well he had a seven yard run."
  },
  {
    "speaker" : "Andy",
    "text" : "Not in this game. Pretty sure. Yeah, it was like thirty or forty yards, but yeah. Like in the first quarter, that early one. I don't remember. This is that uh Oh wait, yeah.",
    "timestamp" : "33:41-33:52"
  },
  {
    "timestamp" : "33:52-33:59",
    "speaker" : "Mike Melo",
    "text" : "It was a it was a 39 yarder in the first quarter with uh man, he's stiff armed guys, he was tight on the sideline. Yeah, I remember that. That was awesome."
  },
  {
    "timestamp" : "33:59-34:12",
    "speaker" : "Andy",
    "text" : "Yeah, that stiff arm was dirty. And it was just very like blunt-esque. He's just he's like, well, I'm not gonna outrun you, but I mean you're not gonna attack on me either, so I'm just gonna put my fist in your face and we'll see what happens."
  },
  {
    "timestamp" : "34:12-34:17",
    "speaker" : "Mike Melo",
    "text" : "But he had like what? Like uh 90 plus yards and two touchdowns, I think."
  },
  {
    "text" : "Yeah, I think he went over a hundred yards, didn't he?",
    "timestamp" : "34:18-34:20",
    "speaker" : "Andy"
  },
  {
    "text" : "Was he? I don't know. I mean he had a great game though",
    "speaker" : "Mike Melo",
    "timestamp" : "34:20-34:23"
  },
  {
    "text" : "Oh no, you're right. He had 94 yards. Wow, I'm surprised you can go over.",
    "timestamp" : "34:24-34:28",
    "speaker" : "Andy"
  },
  {
    "text" : "It's called show prep, Andy.",
    "speaker" : "Mike Melo",
    "timestamp" : "34:29-34:31"
  },
  {
    "timestamp" : "34:31-34:45",
    "speaker" : "Andy",
    "text" : "Yeah, well. I feel like between the four of us we'll we'll all do like one more in the right area. And we got there eventually, right? That's good teamwork. Just like the Patriots offensive line."
  },
  {
    "text" : "That's right. Oh, oh, and speaking of the offensive line, sorry. Um that's a good point though. I was like um just looking at it, like just watching the game, I'm like It's amazing how many um guys on the offensive line were mainstays for the team. Like just jotning down Matt Light, Damian Woody, Joanne Druzi. So that was a pretty solid foundation.",
    "speaker" : "Mike Melo",
    "timestamp" : "34:46-35:05"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:05-35:07",
    "text" : "Yeah. And even Mike Compton was there."
  },
  {
    "text" : "I mean Oh true, yeah.",
    "timestamp" : "35:07-35:08",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "He wasn't there for a long time, but he is he the only offensive lineman who wore a visor? That thing was sick. I remember thinking that was like the coolest thing back in the day.",
    "timestamp" : "35:08-35:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:20-35:24",
    "text" : "Why didn't not why do they not wear that? Because you probably get poked in the eye a little fair amount down there in the trenches."
  },
  {
    "speaker" : "Andy",
    "text" : "But uh I also noticed that I don't know if he did it in this game as much because they didn't play other shotgun, but I think there was an issue with Damien Damien Woody's shotgun snap. So they were kind of switch positions if the quarterback was in the shotgun and Compton would be the the the center. It would be snapping shotgun.",
    "timestamp" : "35:27-35:49"
  },
  {
    "timestamp" : "35:49-35:52",
    "speaker" : "Mike Melo",
    "text" : "Wow, that is detailed observation right there. I did not notice that."
  },
  {
    "text" : "Yeah. I know, right? You say that, but uh I actually noticed it in the Jets game and I forgot to mention it. So",
    "speaker" : "Andy",
    "timestamp" : "35:53-36:01"
  },
  {
    "text" : "Damn. Watching the all 22s, huh?",
    "speaker" : "Greg",
    "timestamp" : "36:01-36:05"
  },
  {
    "timestamp" : "36:05-36:14",
    "speaker" : "Andy",
    "text" : "Oh yeah. I don't think they had those back then, but yeah, damn right. And I think eventually they'll they'll talk about it because I feel like it comes up like in the playoffs."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Well speaking of equipment, um Brian Cox's whatever that thing is on the back of his neck is still the best thing in the world.",
    "timestamp" : "36:14-36:23"
  },
  {
    "speaker" : "Andy",
    "text" : "I want to call it a neck roll, but it it extends above his helmet. So at that point I don't think it's a roll anymore. It's like a plank.",
    "timestamp" : "36:24-36:31"
  },
  {
    "timestamp" : "36:31-36:36",
    "speaker" : "Mike Melo",
    "text" : "Yeah, and I don't know why it looks so intimidating, but I think it's the best thing in the world."
  },
  {
    "timestamp" : "36:36-36:43",
    "text" : "It's great. It looks like he ripped out the uh the headrest of his car and just stuck it down the back of his shirt.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:43-36:53",
    "speaker" : "Mike Melo",
    "text" : "I don't see that very often nowadays. I mean it probably like constricts you uh pretty well but and it's probably due to an injury or something come to think of it but Still look pretty badass."
  },
  {
    "speaker" : "Greg",
    "text" : "I mean he wore it a lot 'cause he's that's why uh Leighton Van Rush wears it because he had a neck injury, I'm pretty sure. Happen the Cowboys.",
    "timestamp" : "36:53-37:03"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, I think the main piece of it is the intimidation factor.",
    "timestamp" : "37:03-37:06"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:07-37:13",
    "text" : "Definitely helps because a lot of the fullbacks wear them still. Like um James Devlin."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh, he has that like big roll thing.",
    "timestamp" : "37:13-37:15"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it's it's not it's not a it's not as pronounced, but he's definitely got that yeah, that roll.",
    "timestamp" : "37:16-37:20"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah.",
    "timestamp" : "37:20-37:21"
  },
  {
    "timestamp" : "37:22-37:29",
    "text" : "So I think it's it basically if you're leading with your head into people, which are basically fullbacks and run-stuffing linebackers.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "What happened to those guys though? Like do you remember like John Randall and the Vikings where you'd like wear like war paint on his face? Yeah. I feel like that that's missing nowadays.",
    "timestamp" : "37:32-37:42"
  },
  {
    "text" : "Yeah, and that that's kind of that was one of my points I remember down. Like, has there ever been a more psychotic linebacker core than Brian Cox and Teddy Bruski in the middle?",
    "timestamp" : "37:42-37:52",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, that's that's insane.",
    "speaker" : "Mike Melo",
    "timestamp" : "37:53-37:55"
  },
  {
    "text" : "Those two, like it just looks like they want to hit anything. Like it doesn't even have to be a person. I feel like they just like come out at the beginning, like before the game and just start like running into the goalposts to warm up.",
    "timestamp" : "37:56-38:08",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know, psychotic. You could just do like Vonte's Berfect and anybody else.",
    "timestamp" : "38:08-38:12",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's true. That's not psychotic, that's just work.",
    "timestamp" : "38:13-38:16"
  },
  {
    "timestamp" : "38:16-38:22",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, maybe that is psychotic. I don't know. I'm sure we're going to on that list."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I feel like that guy pretty much created the present-day Antonio Brown.",
    "timestamp" : "38:22-38:27"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I suppose.",
    "timestamp" : "38:28-38:29"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "38:29-38:32",
    "text" : "Remember that game that he like laid him out and he was unconscious for like three weeks?"
  },
  {
    "text" : "Oh, that's right, yeah, in the in the playoffs.",
    "speaker" : "Andy",
    "timestamp" : "38:33-38:35"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah. I I feel like Antonio Brown is slightly different since that day.",
    "timestamp" : "38:35-38:39"
  },
  {
    "speaker" : "Andy",
    "text" : "He's never recovered. I think you're right.",
    "timestamp" : "38:40-38:41"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "38:41-38:43",
    "text" : "Yeah. That was brutal."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "38:43-38:46",
    "text" : "Remember when mom wrote that letter to the NFL?"
  },
  {
    "timestamp" : "38:47-38:48",
    "speaker" : "Andy",
    "text" : "Did she?"
  },
  {
    "text" : "Yes. I don't remember that. Um it was the Dolphins playoff game against the Steelers. Oh. And like the backup quarterback, I think it was, it wasn't Tannehill. It was like Matt Moore.",
    "timestamp" : "38:48-39:04",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "39:04-39:04",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "He was just like sliding and just got like Blown up.",
    "timestamp" : "39:05-39:08"
  },
  {
    "text" : "Yeah, no, he was rolling out and he he he threw the ball away. Yeah, and and took a took a helmet right to his mouth.",
    "timestamp" : "39:09-39:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "39:17-39:37",
    "text" : "Yeah. Dude mom, I was watching that game with mom. She legitimately sent an email to the NFL. Because I like I explained Yeah, I explained the rule in college where you can review those things and she's like, they need that in the fucking NFL. She's I'm emailing them"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Your mom's awesome though. Like I remember like being at some game, I don't know if it was soccer game or whatever, but um everyone was booing and she was disgusted and yelling at everybody for having like no class. And I thought that was pretty awesome.",
    "timestamp" : "39:38-39:52"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:52-40:16",
    "text" : "Yeah, that's that's our mother. I feel like we we should kind of touch on her because um I think she is the reason we're into football, which is unusual. Especially since I don't think most listeners know that she uh her and dad were both born and raised in England and moved here when they were What like 30? Like late 20s? Early 30s?"
  },
  {
    "text" : "No, it's early than that.",
    "timestamp" : "40:17-40:18",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "40:18-40:22",
    "speaker" : "Andy",
    "text" : "It was like mid Uh Yeah, yeah, it's probably mid to late twenties."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:23-40:29",
    "text" : "Because I was born when they were 27. So also Andy, you said most listeners. We have no listeners."
  },
  {
    "text" : "Well most well, actually, yeah, our listener is mom anyway, so we'll talk about her. But yeah, but she the story that I was told, and I think we'll probably have to have her on to explain this in more detail, but she caused dad came over f for a job, so he had a green card to to work and stuff, but she didn't. She just came over because she was married to him. Um, so she couldn't get a job over here. So she was kind of sitting around doing nothing. And so she decided to learn about football. So she was watching it. But obviously if you've come from a country that doesn't have football, you try to just like cold get into it, you you have no idea what's going on. So what she would do is she would write down questions she would have about the game, like, you know, what's a first down or you know, what is offsides? And she would send it to work with dad, who would then take this piece of paper that his wife had written football questions on and give them to co-workers, American co-workers. And they would write down the answers for him or explain them to him and he would come back and and report, you know, what off size was.",
    "speaker" : "Andy",
    "timestamp" : "40:29-41:29"
  },
  {
    "timestamp" : "41:30-41:38",
    "speaker" : "Mike Melo",
    "text" : "Did did your mom kind of invent Google? That's what that was. That's Google."
  },
  {
    "text" : "That's yeah.",
    "timestamp" : "41:38-41:38",
    "speaker" : "Andy"
  },
  {
    "text" : "Holy shit.",
    "speaker" : "Mike Melo",
    "timestamp" : "41:39-41:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:39-41:48",
    "text" : "That's amazing. It's like an ass Jeeves brush. But if it was ass Mick, yeah. That's what it should have been."
  },
  {
    "timestamp" : "41:48-42:03",
    "speaker" : "Steve",
    "text" : "Which is the thing about it, when she was like watching all the sports, like all the other Boston teams are sick. Like the Bruins, badass, the Celtics are winning like championships every year. Red Sox are really good then too. On the Patriots. Trash."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:03-42:21",
    "text" : "Yeah, but that was always her thing, is uh even in England she would always pick the the shittiest soccer team to root for. Because she just loved the underdog. So coming here, like the patriots fit perfectly because this was like the rod rust era when they're going one and fifteen and Coaches were getting electrocuted at the podium, so to shit."
  },
  {
    "speaker" : "Steve",
    "text" : "Sounds like Greg moving to Raleigh and being an NC State fan. Yeah, same idea.",
    "timestamp" : "42:22-42:27"
  },
  {
    "timestamp" : "42:28-42:33",
    "speaker" : "Greg",
    "text" : "Well she used to go to your soccer games in high school, Andy. That's true, yeah. We don't have many schools in soccer."
  },
  {
    "timestamp" : "42:34-42:38",
    "speaker" : "Andy",
    "text" : "She never came to my soccer games. You didn't play"
  },
  {
    "speaker" : "Greg",
    "text" : "14 in the country, baby. Undefeated. Right.",
    "timestamp" : "42:41-42:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Wait, my s my soccer team? I don't think so.",
    "timestamp" : "42:44-42:46"
  },
  {
    "timestamp" : "42:47-42:50",
    "speaker" : "Mike Melo",
    "text" : "I was on a soccer team, but I don't think I played much either."
  },
  {
    "text" : "Were you? In high school?",
    "speaker" : "Andy",
    "timestamp" : "42:51-42:52"
  },
  {
    "text" : "No.",
    "timestamp" : "42:53-42:53",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "No, you you didn't last that long. We did play one year of football though. That didn't last long either.",
    "timestamp" : "42:53-42:58"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "No, my uh my parents uh pulled me out for uh Poor grades.",
    "timestamp" : "42:59-43:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:04-43:06",
    "text" : "Oh, that's right, yeah, for academic reasons."
  },
  {
    "text" : "Yeah, that's a shame.",
    "speaker" : "Mike Melo",
    "timestamp" : "43:06-43:07"
  },
  {
    "timestamp" : "43:10-43:12",
    "text" : "Think of what you could have been, Mike.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I know, man. I I remember some scrimmage I almost got a sack, so that was pretty cool. I don't know what I was doing playing a linebacker, but hey",
    "timestamp" : "43:12-43:20"
  },
  {
    "text" : "I remember being scout team wide receiver and getting lit the fuck up, Brian Cox style.",
    "timestamp" : "43:22-43:27",
    "speaker" : "Andy"
  },
  {
    "text" : "That uh those guys, uh I mean football is fun to play and all, but when you're like I feel like we're undersized, so I kind of empathize with like these David Pattons of the world. And they really love to like light you up, I think.",
    "speaker" : "Mike Melo",
    "timestamp" : "43:28-43:41"
  },
  {
    "text" : "Oh yeah.",
    "speaker" : "Andy",
    "timestamp" : "43:41-43:42"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I remember I was uh I mean my helmet was too tight, my uh my pants uh didn't quite fit right. It was just it was a disaster. But uh I think that was the most pain overall over the course of several months I've ever been in. So props to these guys.",
    "timestamp" : "43:43-43:58"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I would agree. I don't know how they do it.",
    "timestamp" : "43:58-44:00"
  },
  {
    "timestamp" : "44:00-44:04",
    "speaker" : "Mike Melo",
    "text" : "Me neither. Yeah. Now I would dominate."
  },
  {
    "text" : "Oh absolutely, yeah. Now now I don't feel pain.",
    "timestamp" : "44:04-44:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "44:07-44:07",
    "text" : "Right.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I I'm dead inside.",
    "speaker" : "Andy",
    "timestamp" : "44:07-44:08"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "44:08-44:12",
    "text" : "It's beautiful. I put on some weight, so I'm ready to go."
  },
  {
    "text" : "This this is true. I've also put on weight, but not in a good way. So speaking of football Right.",
    "speaker" : "Andy",
    "timestamp" : "44:14-44:20"
  },
  {
    "text" : "I like how we're on track for like two minutes though. It's good good work.",
    "speaker" : "Steve",
    "timestamp" : "44:20-44:24"
  },
  {
    "text" : "Yeah, we'll kill it. Um Let's see. So we talked about Antoine Smith. He was kind of the driver of the offense. And we talked about Brian Cox, who was the driver of the defense. Um and he was actually he was the lead blocker on the last Patriots rushing touchdown as well, which is pretty cool. So he was I think he probably got uh the Belchak game ball in this game.",
    "timestamp" : "44:25-44:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "44:53-44:55",
    "text" : "That was a physical win, right?"
  },
  {
    "text" : "It was a yeah it was. It was like one of those, like how you remember the Pages beating the Colts.",
    "timestamp" : "44:55-45:00",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:00-45:10",
    "text" : "Yeah, I mean you look at the score and there was like a lot of points, but the that team, the offense and the defense were just knocking people around. Yeah. Kind of miss it.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "45:11-45:21",
    "text" : "Oh yeah. I mean, but obviously these guys Yeah, but they uh I don't think they lasted as long either. Or maybe they did and now they're all just a little Yeah."
  },
  {
    "timestamp" : "45:24-45:25",
    "text" : "Not in life, yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Exactly. Oh man, I I suffered a beating. I'm telling you, my helmet was two sizes too small. I had like black and blue ears just by putting the helmet on.",
    "speaker" : "Mike Melo",
    "timestamp" : "45:25-45:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Mm was too big. Okay, you sound like Treams.",
    "timestamp" : "45:37-45:39"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Sound like Andrew Brown. Hey, Andy was there through it, okay? They didn't have anything else. Alright, I was like I was like third string like fullback.",
    "timestamp" : "45:40-45:48"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. Yeah. Yeah, me too.",
    "timestamp" : "45:49-45:50"
  },
  {
    "timestamp" : "45:51-45:52",
    "speaker" : "Mike Melo",
    "text" : "They didn't care about me."
  },
  {
    "speaker" : "Andy",
    "text" : "I was I was six two, a hundred and fifty pounds, they had me a at running back. Would it help me? We got the dregs. We got the dregs of the uh equipment.",
    "timestamp" : "45:52-46:04"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah man, I I I just remember I might have not even been 100 pounds and I'm fullback? What kind of coach was running this thing? Coach Oh it was dude",
    "timestamp" : "46:04-46:15"
  },
  {
    "speaker" : "Andy",
    "text" : "Well he was varsity. We weren't on varsity. We weren't even the freshman team.",
    "timestamp" : "46:15-46:20"
  },
  {
    "timestamp" : "46:20-46:22",
    "text" : "That's right. He was in the vicinity.",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:23-46:24",
    "text" : "Was that who it was?"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "46:25-46:31",
    "text" : "Oh, I know c I think it's and then there was uh some uh marine guy that was there."
  },
  {
    "speaker" : "Andy",
    "text" : "Um Oh yeah.",
    "timestamp" : "46:31-46:33"
  },
  {
    "timestamp" : "46:33-46:37",
    "speaker" : "Mike Melo",
    "text" : "Whatever that guy uh I forget the kid's name. I don't know."
  },
  {
    "text" : "Something like that, yeah.",
    "timestamp" : "46:38-46:39",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know. Um we I don't think we did because I made friends with all the seniors, so Oh yeah, managed to bypass all that, but we may have seen some hazing back in the day.",
    "timestamp" : "46:39-46:52",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "46:52-46:55",
    "text" : "Yeah. Yeah, a lot of what?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "47:00-47:16",
    "text" : "Yeah. Everywhere too. You go to the restroom. You go to the restroom, people are taking crabs with like the stalls, you know, wide open. Um I think we were afraid to take showers. I pretty much washed up in the lake nearby uh when we went to camp. I mean, yeah."
  },
  {
    "text" : "Oh, I didn't shower that whole that whole camp. I just fuck it. Did not shower.",
    "speaker" : "Andy",
    "timestamp" : "47:16-47:20"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:24-47:25",
    "text" : "I'm not sure I did either."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:27-47:31",
    "text" : "No, you don't have to be a few years. No, you don't want to be a freshman in those showers."
  },
  {
    "text" : "Dude, I've been a freshman in showers. It's not that bad.",
    "timestamp" : "47:32-47:35",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "47:36-47:38",
    "speaker" : "Mike Melo",
    "text" : "These are different. They're a different animal."
  },
  {
    "speaker" : "Greg",
    "text" : "I don't know if they exist nowadays. You just strut in there, dick hanging, you'll be fine. My dick was not hanging. It was tucked away. I was talking.",
    "timestamp" : "47:38-47:49"
  },
  {
    "text" : "Like I said, I have to hide my like I had to put makeup on my ears so they wouldn't laugh at like my bruised ears from It's a different time.",
    "speaker" : "Mike Melo",
    "timestamp" : "47:50-48:01"
  },
  {
    "timestamp" : "48:02-48:06",
    "speaker" : "Andy",
    "text" : "Yeah. And seeing dick is one thing, but like having it touching you is is something else."
  },
  {
    "text" : "Whoa.",
    "timestamp" : "48:06-48:06",
    "speaker" : "Greg"
  },
  {
    "text" : "Like making himself look feminine. Just hang it on your shoulders. What what happened, Andy? Well it wasn't us, but uh didn't shoulder.",
    "timestamp" : "48:07-48:17",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:17-48:30",
    "text" : "I don't know if we should be talking about this, but maybe no, it you cannot cut this. This needs to be stated. That some crazy shit was going down and we were we were silent and we let it happen. Okay.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "So do you do you want to describe the helicopter or should I?",
    "timestamp" : "48:31-48:33",
    "speaker" : "Andy"
  },
  {
    "text" : "You can go for it, but I can vouch for it. You you're not explanatory. Yeah.",
    "timestamp" : "48:33-48:38",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "No, I don't think it is.",
    "timestamp" : "48:38-48:39"
  },
  {
    "text" : "We won't say his name, but there's a gentleman. All right, well there you go. There's a gentleman who can do things with his balls that I've never seen uh since then or heard of. Yeah.",
    "timestamp" : "48:39-48:51",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "48:51-48:55",
    "text" : "Yeah. He was able to twist them around the shaft multiple times.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "And make it spin like a helicopter.",
    "timestamp" : "48:55-48:57"
  },
  {
    "text" : "Yeah. And then he would release it and it would kind of rotate as if it were trying to take off from his body. It was oddly hypnotic, I have to say.",
    "speaker" : "Andy",
    "timestamp" : "48:58-49:07"
  },
  {
    "timestamp" : "49:10-49:28",
    "speaker" : "Mike Melo",
    "text" : "Well, yeah, that too, but you know, we won't talk about that. Um You know, he would he would take out his member and gently place it in front of sleeping guys' face faces and then gently wake them up so they They woke up with wiener in their face. I believe this is called sexual harassment, guys. I I think so."
  },
  {
    "speaker" : "Greg",
    "text" : "That's just boys being boys.",
    "timestamp" : "49:28-49:30"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:32-49:39",
    "text" : "But somehow uh Andy and I love how I love how on topic we've been this whole time. The Oh yeah. This is still football."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "49:40-49:47",
    "text" : "I will say somehow Andy and I uh avoided to uh uh avoided most of that. I don't know how, but I don't either."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:47-49:58",
    "text" : "Well I avoided it because I was friends with you and you somehow We're like the the pet of all the the senior offensive linemen."
  },
  {
    "text" : "Yeah, that's right. They like they they protected me and then they kind of let me uh like I remember one time being woken up and everybody was uh wearing just underwear in their helmets. And they're like, hey Milo, what's uh let's go bang on everybody's cabin door and I thought this was insane and I was sleeping. So most people were forced to do it, but I was like, nah, uh you mind if I sit this one out? And they were cool with it. So I have no idea. I did not partake. For the record, I was not part of the sexual harassment of Andy Brown or anybody else.",
    "speaker" : "Mike Melo",
    "timestamp" : "49:58-50:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Nope. This is true. I'll vouch for that. But this is where he got his nickname from. This is where Milo came from.",
    "timestamp" : "50:27-50:33"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's true.",
    "timestamp" : "50:34-50:35"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep.",
    "timestamp" : "50:35-50:35"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "So because I was selected uh to do the Matthew Slater where I would have to do like the speech, you know, because they thought it was funny, like this hundred five-pound kid, hey, would have him like do the rah-rah thing. So as I was doing it Um some guy, the team captain, got my name wrong and he thought it was hilarious. So uh nobody knew who I was before and then I became known as uh a guy for my uh mispronounced name. So it was fantastic.",
    "timestamp" : "50:36-51:04"
  },
  {
    "speaker" : "Andy",
    "text" : "He was Milo from then on.",
    "timestamp" : "51:04-51:06"
  },
  {
    "text" : "They they you know, I was friends with those guys. They They were great. I'll bet you were. Yeah. All right. Anyways, moving on.",
    "timestamp" : "51:06-51:16",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Speaking speaking of dicks, how about uh the Colts kicker Mike Vanderk? That guy's a dick.",
    "timestamp" : "51:16-51:23",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:24-51:25",
    "speaker" : "Mike Melo",
    "text" : "He was pretty good though."
  },
  {
    "text" : "Uh when he was sober, yeah.",
    "speaker" : "Andy",
    "timestamp" : "51:25-51:27"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "51:28-51:32",
    "text" : "Well even when he wasn't, can you imagine kicking a feel more like smashed?"
  },
  {
    "timestamp" : "51:32-51:39",
    "speaker" : "Andy",
    "text" : "Uh Yeah, that would be tougher. It's not exactly performance enhancing, is it? Although it'll probably calm the nerves depending on how many you had."
  },
  {
    "text" : "Oh true. True. So I mean it's like golf, right? A little swing oil.",
    "timestamp" : "51:39-51:45",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, exactly. Just a little uh liquid courage.",
    "speaker" : "Andy",
    "timestamp" : "51:45-51:48"
  },
  {
    "timestamp" : "51:48-51:49",
    "text" : "Yeah",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "51:49-51:51",
    "text" : "You don't want those nerves jangling.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "51:52-52:01",
    "text" : "Uh speaking of kickers though, I don't know why, but again, third week in a row, I have Lee Johnson's name down with a big star next to it. So"
  },
  {
    "timestamp" : "52:02-52:24",
    "speaker" : "Andy",
    "text" : "I thought the punting in this game wasn't that great. Uh kicking in the end zone by like ten yards. Yeah, like the Colts punch is kicking it literally out of the back of the end zone on a punt. Like I know it was windy, but like come on dude. They don't punt from their own side of the field ever. Like you should learn how to drop it inside the 20, I would think."
  },
  {
    "timestamp" : "52:25-52:36",
    "speaker" : "Steve",
    "text" : "I'm gonna give I don't want to spoil my best of the game, but I'm gonna Brable first Mike Brabel appearance. Yeah."
  },
  {
    "timestamp" : "52:36-52:38",
    "speaker" : "Mike Melo",
    "text" : "Oh, that's right. Yeah."
  },
  {
    "text" : "That was good.",
    "speaker" : "Andy",
    "timestamp" : "52:39-52:39"
  },
  {
    "timestamp" : "52:40-52:51",
    "speaker" : "Mike Melo",
    "text" : "Some might say that's the first connection of Brady and Vrabel, which the rumors have stated that if he leaves New England, he could join Vrabel in Tennessee."
  },
  {
    "timestamp" : "52:51-52:52",
    "text" : "Well, alright.",
    "speaker" : "Andy"
  },
  {
    "text" : "Twenty years later, baby.",
    "timestamp" : "52:52-52:54",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "52:54-52:57",
    "speaker" : "Greg",
    "text" : "I don't I heard he likes country music too. Fuck."
  },
  {
    "speaker" : "Andy",
    "text" : "Brable or Brady?",
    "timestamp" : "52:58-52:59"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh Brady. What He's eclectic. Yeah. Tennessee going to Nashville. I mean it makes sense. I don't feel it.",
    "timestamp" : "52:59-53:10"
  },
  {
    "text" : "I don't feel you should you should write that up, Greg, and get that out there. Because if you don't, Shafter will.",
    "timestamp" : "53:10-53:17",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I'll just email Felger.",
    "timestamp" : "53:18-53:20",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:21-53:31",
    "text" : "Oh Felger's all the fuck over it already. I promise you that. So Greg, I I'm a little disappointed in you that you haven't actually brought up Ty Law yet."
  },
  {
    "timestamp" : "53:32-53:51",
    "text" : "Oh man, he's an absolute stud. That's better. Marvin Harrison, they're like talk they gave his numbers like all those times he played the pass before, like six touchdowns in five games or something. Tyler steps in and just bully balls. You know? Just shoving around the field, doing whatever he wanted with him.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "He really was.",
    "timestamp" : "53:52-53:52"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "53:52-53:57",
    "text" : "He's the best athlete in the secondary the Pats have ever seen."
  },
  {
    "timestamp" : "53:57-53:58",
    "speaker" : "Andy",
    "text" : "You think so?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, from like size, speed, ball skills.",
    "timestamp" : "53:59-54:02"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:03-54:06",
    "text" : "He wasn't surprisingly. Gilmore's good, but big guy. Yeah."
  },
  {
    "text" : "Some might say he's in the Hall of Fame.",
    "timestamp" : "54:06-54:09",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true. Some could say that. Yeah. Yeah.",
    "timestamp" : "54:10-54:13"
  },
  {
    "speaker" : "Greg",
    "text" : "Even Otis was pretty good. Yeah. O T I S, baby.",
    "timestamp" : "54:13-54:17"
  },
  {
    "text" : "Although who who on yeah, because Otis uh was end of the the second quarter, the Colts were driving for a score. And then uh Peyton threw a pick to Otis Smith. Well, 78 yards RV.",
    "speaker" : "Andy",
    "timestamp" : "54:18-54:33"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "54:34-54:34",
    "text" : "Oh my god."
  },
  {
    "speaker" : "Andy",
    "text" : "That could that return. But who threw the uh the the block to get Oda Smith actually around the corner and into the end zone?",
    "timestamp" : "54:35-54:45"
  },
  {
    "text" : "Die Law.",
    "speaker" : "Greg",
    "timestamp" : "54:45-54:46"
  },
  {
    "timestamp" : "54:46-54:49",
    "speaker" : "Andy",
    "text" : "That's right. The lead blocker."
  },
  {
    "speaker" : "Greg",
    "text" : "That's right.",
    "timestamp" : "54:49-54:50"
  },
  {
    "timestamp" : "54:50-54:59",
    "text" : "And then uh Peyton Manning getting thrown out of the club by Anthony Pleasant or some defensive lineman. On the replay they're trying to like.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "55:04-55:06",
    "text" : "The beginning phase, dude. It's so good to see it again.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh man, I wrote that yeah. At least eight different times in that game.",
    "timestamp" : "55:06-55:11"
  },
  {
    "speaker" : "Greg",
    "text" : "So many times this. Oh. It's so perfect.",
    "timestamp" : "55:11-55:23"
  },
  {
    "timestamp" : "55:24-55:27",
    "text" : "And just kind of throw his hands up. What are you doing?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "55:27-55:30",
    "speaker" : "Greg",
    "text" : "Yeah. It's like, dude, this is a bad thrall."
  },
  {
    "speaker" : "Andy",
    "text" : "It was beautiful. Although I have to say I forgot how obnoxious Manning was pre-snap. And it gave me flashbacks to playing Madden back in the day. Yeah. Where they had like programmed that in that he would just make audibles until the clock ran out and then he would hike the ball. And you're sitting there waiting like I Just just hike the ball. We know what's happening here. I I have this game on easy. I'm gonna sack you on this play because that's why I have it on easy. So just fucking get over it and like call a play.",
    "timestamp" : "55:32-56:00"
  },
  {
    "text" : "Yeah, he was the worst. He uh he was fun to watch, but uh it's hard to like the guy",
    "speaker" : "Mike Melo",
    "timestamp" : "56:01-56:08"
  },
  {
    "timestamp" : "56:10-56:24",
    "text" : "I started liking him as soon as he started making commercials. So you started trading meat. Yeah. He's got like a little YouTube series. So have any of you watched it? No. Oh, is that in the clips?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:25-56:27",
    "speaker" : "Mike Melo",
    "text" : "Where he like breaks down stuff or something?"
  },
  {
    "timestamp" : "56:27-56:35",
    "speaker" : "Andy",
    "text" : "Yeah, because he did one on uh Brady's overtime drive. against the Chiefs in the playoffs last year. And it's actually really good because obviously."
  },
  {
    "text" : "Because he's got a show now too. Really?",
    "speaker" : "Greg",
    "timestamp" : "56:38-56:40"
  },
  {
    "text" : "I thought it was a good thing.",
    "speaker" : "Andy",
    "timestamp" : "56:40-56:41"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "56:43-56:49",
    "text" : "Oh, I remember that. Yeah, where he goes around like interviewing like famous players like Franco Harris and shit."
  },
  {
    "timestamp" : "56:50-56:52",
    "speaker" : "Andy",
    "text" : "Are you sure that's not a state farm commercial?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "56:53-56:54",
    "text" : "Or it's sponsored."
  },
  {
    "timestamp" : "56:56-57:00",
    "speaker" : "Steve",
    "text" : "I like him when he started doing commercials. So like what his third year in the league? Right."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:00-57:02",
    "text" : "Yeah, uh whenever he did cut that meat."
  },
  {
    "text" : "Oh, I know um I know one of the uh guys in that commercial. He got to share some screen time with uh Peyton Manning. I think he was the guy that was asking him to sign the uh loaf of bread.",
    "speaker" : "Mike Melo",
    "timestamp" : "57:03-57:14"
  },
  {
    "text" : "You get screen credit for that?",
    "timestamp" : "57:17-57:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "57:19-57:22",
    "text" : "I don't think so, but he probably got a good chunk of change."
  },
  {
    "timestamp" : "57:22-57:27",
    "speaker" : "Andy",
    "text" : "Alright, all right. What's it what's he doing now? He's lobby that was obviously like a stepping stone to start him, right?"
  },
  {
    "timestamp" : "57:27-57:37",
    "speaker" : "Mike Melo",
    "text" : "He is doing some fun. His name is Jesse Gavin. He is doing some great videos online. He's also a successful commercial actor, so shout out to Jesse Gavin."
  },
  {
    "timestamp" : "57:37-57:40",
    "speaker" : "Andy",
    "text" : "Hell yeah. I actually recognize that name probably from you, I would imagine."
  },
  {
    "timestamp" : "57:40-57:45",
    "text" : "Is this the guy that you banged, Mike? Yeah, would you bang him? What?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "57:47-57:49",
    "speaker" : "Greg",
    "text" : "Would you have sex with him, Mike?"
  },
  {
    "timestamp" : "57:49-58:18",
    "speaker" : "Mike Melo",
    "text" : "Would I? Or this is not the same guy that like hooked up the uh hookup of Tom Brady and Aaron Rodgers. These are two separate people, gentlemen. Yeah, yeah. Sure they're under the stands. In this day and age, guys, I mean, come on. Really Come on, you're better than that. No, no we're not. Plus, I think my girlfriend has got home, so she's not gonna like any of this. So hush hush."
  },
  {
    "timestamp" : "58:21-58:23",
    "speaker" : "Greg",
    "text" : "Would you bang her?"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "58:23-58:34",
    "text" : "Um I I you know I don't want to Would you bang me, Mike? I don't want to I don't want to hear dirty laundry, but uh you Greg, you kinda look like Tom Brady, I'm not gonna lie."
  },
  {
    "speaker" : "Greg",
    "text" : "So my mom says it all the time. Yeah.",
    "timestamp" : "58:34-58:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:38-58:46",
    "text" : "So she says that to all of us, Greg. No. She doesn't say it to me. Sorry, Steve."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Um last thing I'll say on Peyton Manning though is um I I did love how he sort of managed to bypass the whole HGH thing and we never hear about it again. So kudos to him for uh shucking the system.",
    "timestamp" : "58:46-59:01"
  },
  {
    "text" : "Yeah. Why you think he did the man?",
    "timestamp" : "59:01-59:04",
    "speaker" : "Greg"
  },
  {
    "text" : "His wife seems like she could be on HGH. I mean I don't know. It seems like a plausible story to me, right? No.",
    "speaker" : "Mike Melo",
    "timestamp" : "59:05-59:10"
  },
  {
    "text" : "No, I have a strong opinion on this. Okay. for Brady and Deflate Gate and then turn around and witch hunt Manning. Okay. All right. Homerism at its finest.",
    "timestamp" : "59:11-59:22",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "59:23-59:27",
    "speaker" : "Andy",
    "text" : "You gotta be consistent. Do you realize what podcast this is?"
  },
  {
    "timestamp" : "59:27-59:39",
    "speaker" : "Greg",
    "text" : "Yeah. Oh God."
  },
  {
    "timestamp" : "59:40-59:53",
    "speaker" : "Mike Melo",
    "text" : "Destroyed his phone, Mike. Yeah. You don't do that? Evidence number one out of three hundred and fifty-two, and we'll go over it every one of them. We could do that. There's time."
  },
  {
    "timestamp" : "59:53-59:57",
    "speaker" : "Andy",
    "text" : "I I'm pretty sure the people on this on this podcast could do that."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I don't know. I What what that whatever that report was.",
    "timestamp" : "59:58-01:00:01"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:00:02-01:00:03",
    "text" : "Specter. The Specter report."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Specter, yes, yeah, like five hundred pages of the city.",
    "timestamp" : "01:00:03-01:00:05"
  },
  {
    "speaker" : "Andy",
    "text" : "You should get that guy in the pod.",
    "timestamp" : "01:00:06-01:00:07"
  },
  {
    "timestamp" : "01:00:09-01:00:15",
    "speaker" : "Mike Melo",
    "text" : "Well, and who's the investigator? I don't know. I don't know. We we we can we can get him. I'm sure he's not gonna be a little bit more."
  },
  {
    "timestamp" : "01:00:16-01:00:17",
    "speaker" : "Andy",
    "text" : "We'll make some phone calls."
  },
  {
    "text" : "Look, we're gonna get to the bottom of this. Someday Brady's gonna write his expose because his guilt is gonna haunt him. He's a fucking cheater.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:00:17-01:00:23"
  },
  {
    "text" : "He's uh even if we do get him on the podcast, we're gonna end up asking him if he can do like the helicopter dick thing.",
    "timestamp" : "01:00:24-01:00:32",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:00:32-01:00:37",
    "text" : "Oh shit. Asking if if he'd fuck Mike everybody",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh guys, we're here to talk football and we haven't even gotten to the second half, okay?",
    "speaker" : "Mike Melo",
    "timestamp" : "01:00:39-01:00:44"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:44-01:00:50",
    "text" : "All right. Well the third quarter didn't have much in it, so let's just jump to the fourth quarter."
  },
  {
    "text" : "I actually didn't watch the third quarter.",
    "timestamp" : "01:00:50-01:00:52",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:52-01:02:13",
    "text" : "Alright, good, because don't worry about it. You missed a couple turnovers and that was it. Fourth quarter was where all the action happened. It's four touchdowns scored in the fourth quarter. Three of them by three of them by the Patriots did uh I mean, well, one of them Peyton Manning had a hand in. Because the uh the Colts scored at the touchdown right at the end of the third quarter. Um to pull it a little bit closer, it was 23-7 at the end of the third quarter, and the Patriots immediately went down and score a touchdown. Which is very patron-esque. Um that was the screen pass to uh Antoine Smith, where he rumbled for like forty, fifty yards. And then uh two plays later, Kevin Falk ran in for touchdown, which you don't see very often. Um and then like two plays later, Colts have the ball, and that was the Tylaw pick six. And that was the game. Even though Peyton would uh follow that up with a a touchdown drive of his own eventually threw a touchdown on fourth down and went for two, missed it. It's now what 44 to 13 and the game is over. And I don't think Peyton Manning actually saw the field after that. They brought in Uh the hell is his name? Mark Ripon. Oh hell yeah. Redskins fame. Yes. Yeah."
  },
  {
    "timestamp" : "01:02:14-01:02:16",
    "text" : "Probably start on that team right now.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:02:16-01:02:21",
    "speaker" : "Steve",
    "text" : "Definitely could. He can be the next coach."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:02:22-01:02:25",
    "text" : "May as well, right? The London Redskins."
  },
  {
    "speaker" : "Andy",
    "text" : "Ooh. Feels nice. I feel like they probably changed the Redskins part.",
    "timestamp" : "01:02:26-01:02:30"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:02:31-01:02:32",
    "text" : "Maybe. Snyder's."
  },
  {
    "timestamp" : "01:02:34-01:02:37",
    "text" : "Ooh, Red Co, not Bell.",
    "speaker" : "Andy"
  },
  {
    "text" : "My bad. Um I did find it interesting that uh there is video evidence out there of Bill Belichick celebrating touchdowns. I mean he's fist pumping, he's clapping. Um I don't know what year that stopped. I mean there's rumors that he sold his soul, which uh I think we can all agree on. But maybe it happened then, but uh there is evidence of him celebrating and smiling.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:02:38-01:03:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:04-01:03:06",
    "text" : "Yeah, because I mean I remember he this year."
  },
  {
    "timestamp" : "01:03:07-01:03:08",
    "speaker" : "Mike Melo",
    "text" : "What's that?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:03:08-01:03:10",
    "text" : "This year is 2001."
  },
  {
    "timestamp" : "01:03:11-01:03:14",
    "speaker" : "Andy",
    "text" : "I don't know, because he was still celebrating in Right."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "I think like I mean if we really want to like discuss when he sold his soul, I feel like it was after 2002.",
    "timestamp" : "01:03:14-01:03:20"
  },
  {
    "speaker" : "Andy",
    "text" : "I was gonna say after two thousand four, because that was when he was he was still celebrating 'cause remember that was the end of the uh Charlie Weiss um And Romeo Cornell, like the three of them, and they were all like hugging at the end and like he was hugging. Right, yeah.",
    "timestamp" : "01:03:20-01:03:35"
  },
  {
    "timestamp" : "01:03:38-01:03:43",
    "speaker" : "Mike Melo",
    "text" : "The Kool-Aid on him and his dad, and like, well, his dad's super old, that could have killed him. Yep, yep, I remember that."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that's a good point, actually. So I think it was after that. He didn't win for a couple of years. And then sold a soul, and that was 2007.",
    "timestamp" : "01:03:44-01:03:50"
  },
  {
    "text" : "You're right, because the then the culmination of that was probably oh seven. We saw little little signs of that. And then here we are now.",
    "timestamp" : "01:03:50-01:03:57",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:03:58-01:03:58"
  },
  {
    "timestamp" : "01:04:01-01:04:06",
    "speaker" : "Mike Melo",
    "text" : "I never thought of it that way, but yeah, you're you're right. That was probably the last intimate moment he ever had."
  },
  {
    "text" : "That's the devil trying to collect his spy gate. Yeah.",
    "timestamp" : "01:04:06-01:04:10",
    "speaker" : "Steve"
  },
  {
    "text" : "Now if you were him, I mean let's just say hypothetically the devil approaches you, whatever, and he's like, you know, giving you this deal where you're gonna get Let's say eight Super Bowls, by the time you die, you coach until you're 85, right? That's a pretty good run.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:04:11-01:04:25"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:25-01:04:26",
    "text" : "I'm in."
  },
  {
    "text" : "Um, you know, social media goes crazy, you're beloved. Then you burn eternally, but like who cares? Because like there's no social media in hell. Who gives a shit? So would you do that?",
    "timestamp" : "01:04:26-01:04:38",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yes.",
    "speaker" : "Andy",
    "timestamp" : "01:04:38-01:04:39"
  },
  {
    "text" : "You would 100%?",
    "timestamp" : "01:04:39-01:04:40",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "01:04:41-01:04:43",
    "text" : "It depends. What what is hell?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Wow.",
    "timestamp" : "01:04:44-01:04:45"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:45-01:04:51",
    "text" : "Is hell watching cause it cause if hell was watching somebody else break all your records, that would suck"
  },
  {
    "text" : "Oh fuck, I didn't even think about that. And I would eat them alive for eternity. Man, you're bringing up great points today, Andy. I I I know",
    "speaker" : "Mike Melo",
    "timestamp" : "01:04:52-01:05:01"
  },
  {
    "timestamp" : "01:05:03-01:05:07",
    "text" : "You'll have to listen to hour two of the podcast until I start breaking bringing up good points.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yeah, well you're you're definitely bringing a different perspective to the table.",
    "timestamp" : "01:05:08-01:05:13"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:13-01:05:44",
    "text" : "Absolutely. Alright, I think that's uh that covers most of the games. Let's let's do some best and worst. Anybody want to go first I know Steve already gave his best, Steve. You got a worse? What was your best again? I've already forgotten. It was like an hour ago. Mike Vrabel sighting. Oh, that's right. The yeah, the beginning of the Mike Burble. I would think so. First in most people's lives. It's not like you played much on the Steelers. So I like that. Do you have a worst? Uh I have another best. Does that count? Fuck it. Yeah, let's go. We're a patio's podcast."
  },
  {
    "text" : "As many best as you want. They cut to like John Bon Jovi and Robert Kraft sitting together. Did they? Yeah.",
    "timestamp" : "01:05:44-01:05:51",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:05:54-01:06:00",
    "speaker" : "Mike Melo",
    "text" : "I wrote down the note that Robert Kraft looked like a man who didn't need to pay for hand jobs."
  },
  {
    "timestamp" : "01:06:02-01:06:04",
    "speaker" : "Andy",
    "text" : "I mean you could say that because his wife was sitting next to him."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:06:05-01:06:10",
    "text" : "Okay. Well way to make it real. How can you do that?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:10-01:06:16",
    "text" : "Too soon. Rest in peace, Myra. Alright, uh Greg, give me your best and worst."
  },
  {
    "text" : "My best was Manning's favorite wide receiver, Ty Law. And my worst is uh Jerome Pathens future, um, oatmeal brain and just general like you know unsteadiness and mood swings Oh shit.",
    "speaker" : "Greg",
    "timestamp" : "01:06:16-01:06:38"
  },
  {
    "speaker" : "Andy",
    "text" : "You got lit up a bunch in this game. Like from the first play.",
    "timestamp" : "01:06:38-01:06:42"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "From the get go. I think that's the darkest worst moment. we've had.",
    "timestamp" : "01:06:43-01:06:47"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't think so. Last week we talked a lot about 9-11.",
    "timestamp" : "01:06:47-01:06:50"
  },
  {
    "text" : "So yeah. I forgot about that.",
    "timestamp" : "01:06:50-01:06:52",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah. There was a twin tower joke in there somewhere. Uh all right, Mike, your best and worst.",
    "timestamp" : "01:06:52-01:06:58",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Um all right, best. I mean I have a few honorable mentions just uh quickly like the uh the uh fought 28-yard screen in the fourth. Um so Brady got like hammered, but he kept his composure, completed a pass. And I was just picturing like Bletto like running across the field, like closing his eyes, like throwing like crossbody, like tucking and rolling. So But yeah, Brady didn't do that. Uh so that was pretty great.",
    "timestamp" : "01:06:58-01:07:25"
  },
  {
    "speaker" : "Andy",
    "text" : "And even just the fact that like they sent Brady out to to run a fourth and three like throwback scream pass late in the fourth quarter. It was it was showing the trust that they had in him even at that point. It was pretty cool.",
    "timestamp" : "01:07:25-01:07:40"
  },
  {
    "timestamp" : "01:07:40-01:08:08",
    "speaker" : "Mike Melo",
    "text" : "Yeah. And then another um just quick aside, I just they they threw up a graphic of like what Foxboro Stadium was versus like you know, what ended up being Gillette Stadium. And I mean it they're like it it was a six million dollar stadium. The new one's like three twenty five million. I mean th there's like fifty-three thousand bench seats in Foxborough, which were like cold and uncomfortable, zero in uh in Gillette, sixty eight thousand chairbacks. You Apparently that was like a hot salon."
  },
  {
    "timestamp" : "01:08:09-01:08:10",
    "text" : "Actual chairs instead of benches.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:08:10-01:08:29",
    "text" : "Yeah, yeah. So I thought that was pretty cool. And then uh the last honorable mention would be uh Brady just randomly talking on the sideline with like a line kid or whatever that was. Uh um he was just talking to some random dude, not even on the the Patriots team and just being a normal guy."
  },
  {
    "timestamp" : "01:08:30-01:08:34",
    "speaker" : "Andy",
    "text" : "He is he is a normal guy. Incredibly handsome."
  },
  {
    "text" : "Right. Well, after 2007 when he sold his soul, and we could talk about that next week. Oh yeah, I think we'll have to save that. And then yeah, so my my best moment was actually when they had a uh oh man, there's too many like commentator things, but I mean uh the commentator All right, there's two great ones. One is the commentator debating through the commercial. Um why didn't they go for two? Right. So they k they the Colts kick like a f and they're like, why don't they go for two? And they're breaking down the math and they're going, with three touchdowns and three two-point conversions, they could take the lead. And they're legitimately talking about this. I thought that was fantastic.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:08:35-01:09:13"
  },
  {
    "timestamp" : "01:09:13-01:09:15",
    "text" : "Yeah. Uh culture down twenty four points.",
    "speaker" : "Andy"
  },
  {
    "text" : "Exactly. It was it was so funny. Um another great moment that I liked was they they had a poll which O and two team had the best chance of making the playoffs.",
    "timestamp" : "01:09:15-01:09:24",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "That was gonna be my worst, yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:09:28-01:09:30"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh, that was the best for me. I thought it was",
    "timestamp" : "01:09:30-01:09:31"
  },
  {
    "timestamp" : "01:09:33-01:09:44",
    "speaker" : "Andy",
    "text" : "Of the NFL team starting 0-2, which has the best shot at making the playoffs? Buffalo, Detroit, Kansas City, Minnesota, Tennessee, or Washington? And then like eventually they realize Wait, the the the Patriots aren't on this list."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:09:45-01:10:00",
    "text" : "Yeah, I mean the commentators like maybe they could uh they could use it and have a chip on their shoulder and I could just picture like Belichick, like, you know, after the game goes. Yeah, yeah. Like did you guys see that CBS like left us out of a pole? Like so that was pretty funny. And then the worst moment."
  },
  {
    "timestamp" : "01:10:03-01:10:03",
    "text" : "Oh hell yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:10:05-01:10:18",
    "text" : "Um Lord Malloy would be ranting and raving. Oh god yeah. And then uh the worst moment for me was just seeing Peyton run up the middle for ten yards and a touchdown. Because how does that even happen? Yeah, that was tough."
  },
  {
    "text" : "But if Peyton's pretty spry he was quick. If Peyton's running for touchdowns, you know you're doing something right though. Cause that ain't his thing.",
    "speaker" : "Andy",
    "timestamp" : "01:10:18-01:10:25"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That's right.",
    "timestamp" : "01:10:26-01:10:26"
  },
  {
    "text" : "I like those. All right, my best. Um following a failed third down conversion where Peyton Manning thought they got it. uh Manning ran over to the referee and was like trying to convince him that the spot was wrong. And Brian Cox is standing on the sideline waving at him, waving goodbye. That was awesome. Will you catch that?",
    "timestamp" : "01:10:27-01:10:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mom",
    "text" : "It's crazy.",
    "timestamp" : "01:10:48-01:10:49"
  },
  {
    "timestamp" : "01:10:50-01:12:06",
    "speaker" : "Andy",
    "text" : "He was so in Manning's head. Brian Cox had himself a fucking game. So that was definitely my best. Um Honorable mention would be the fact that you saw the Patriots run Troy Brown on the jet sweep. That like as he's coming in motion, they just hike it real quick, turn around and hand it to him. And it wasn't as smooth as you see it nowadays, but like, you know, you can bell check ahead of the game as always. Um My worst was gonna be the uh the 0-2 graphic. But instead I will say it's the uh audio from this from the old Foxboro Stadium where it sounded like we were listening to a high school football game. Like you could hear the um You could hear the the stadium announcer announcing the the result of the play. It's like Antoine Smith up the middle for two yards Like as as you hear the announcers saying the same thing. And then you could actually because I was listening to this on headphones and I could hear like a lot of fan chatter. And so I wrote down a few that I heard. Um One of the cheers was way to go O line looking good so far. I heard that one. It was probably like three plays into the first drive."
  },
  {
    "timestamp" : "01:12:06-01:12:06",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:12:06-01:12:07",
    "text" : "Which was great."
  },
  {
    "text" : "I heard that too.",
    "timestamp" : "01:12:07-01:12:07",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I was like, good for them.",
    "timestamp" : "01:12:07-01:12:09"
  },
  {
    "speaker" : "Greg",
    "text" : "Super.",
    "timestamp" : "01:12:09-01:12:09"
  },
  {
    "text" : "Yeah. And then another one was uh it's okay, Peyton, which uh right one. I don't know if it came from a Colts fan. Um And then there was another one, uh, don't walk away from me, you idiot. And then there was the guy repeating, I have it as repeating five times, get me more cheeseburgers. He just kept repeating that as there's like commentating going on. Yeah. And then like towards the end of the game, another guy uh He must have been talking shit to a Colts fan 'cause he's like, Are you guys gonna lose in the first round again for the third year in a row? Like That's that's the uh the taunting of a guy who's never been there before. Yeah, who just hasn't seen the playoffs in a long fucking time. Yeah, exactly. To a Colts fan. It's like what you you gotta get to the playoffs and lose again? Huh? That that must suck, huh? What do the playoffs feel like? No, that was uh I don't know if it's the worst, but it was uh I think my worst is probably the uh the Gary Glitter fact. The fact they stopped playing that song because he's a a kitty diddler.",
    "speaker" : "Andy",
    "timestamp" : "01:12:12-01:13:25"
  },
  {
    "timestamp" : "01:13:26-01:13:49",
    "speaker" : "Steve",
    "text" : "I have a worst. I just thought of it. That's right. I had always thought Brady's first start was that game in Indianapolis that we're gonna watch later Oh. I forget who it was, but he pat and throws runs and game. Yep. I was fully expecting to turn that game on, and I was like, wait, it's in Foxbro?"
  },
  {
    "timestamp" : "01:13:52-01:13:54",
    "speaker" : "Andy",
    "text" : "I mean this is yourself a good game to watch though."
  },
  {
    "text" : "It was. He was pretty steady. You know, uh no mistakes, nothing flashy. Just solid Brady.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:13:54-01:14:01"
  },
  {
    "text" : "I did I I was a little disappointed that his first touchdown didn't go to Kevin Falk on that screen pass though. Because he he it was a shoestring tackle at like the three-yard line. And that should uh that was the that was the fourth and three uh screenplay too. Right. So that would have been a hell of a first touchdown and throw. But we're gonna have to wait for that for next week. So that's the that's what in the game, that's what we call a teaser. We were gonna tease that. What are we teasing exactly? We're teasing uh Tom Brady's first touchdown pass.",
    "timestamp" : "01:14:01-01:14:32",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, and who are we teasing uh with that tidbit of uh yeah we're teasing my uh our mom. Oh, hi Mrs. Brown.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:14:32-01:14:40"
  },
  {
    "timestamp" : "01:14:40-01:14:51",
    "text" : "So she'll tune in next week and listen to uh us talk about the Patriots at the Chargers. At the Chargers? Home Versa Chargers? Find out six weeks.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:14:52-01:14:53",
    "speaker" : "Mike Melo",
    "text" : "Yeah, it's called a teaser camp."
  },
  {
    "text" : "We're real good at teasing. Uh and the best part is uh That's not next week. Next week is at the Dolphins.",
    "speaker" : "Andy",
    "timestamp" : "01:14:55-01:15:01"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Alright. I'm done.",
    "timestamp" : "01:15:04-01:15:06"
  },
  {
    "timestamp" : "01:15:07-01:15:14",
    "text" : "All right. On that note, we will see everybody next time on the Patriots Dynasty Podcast.",
    "speaker" : "Andy"
  }
]