[
  {
    "speaker" : "Mom",
    "timestamp" : "00:00-00:19",
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid. Stupid. You still want to listen? Go right ahead. I am not your mother."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:21-00:43",
    "text" : "Alright, so this is, like we talked about, the super special episode. We finally gotten to our first Super Bowl of the dynasty. And with us today we have uh no offense to our other guests, but probably our most famous guest, I would say. Uh former Patriots linebacker and three time Super Bowl champion Matt Chatham. Matt, thanks for joining us."
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "00:43-00:49",
    "text" : "Well, thanks for having me on. This is fun and I'm glad it worked out. This is uh quarantine time, so we've all got a lot of time on our hands."
  },
  {
    "timestamp" : "00:49-01:00",
    "speaker" : "Andy",
    "text" : "Yes, we do. Uh it has been it's been okay so far, at least for me. I don't know how it's been for you, Matt, but uh it's actually starting to finally drag this past week."
  },
  {
    "timestamp" : "01:01-01:22",
    "speaker" : "Matt Chatham",
    "text" : "Yeah, I think we're kind of reaching that point, right, where it's kinda the m the the monotony of it all. Uh I I was having a blast with family time. We're having a great time uh getting closer and spend all more time we otherwise wouldn't have but we're I think we're running out of stuff to do. It's like I can you can only w you can only watch so many movies. You know, you can only make so many different meals and then it's like okay what else what else is out there?"
  },
  {
    "text" : "Yeah, that's exactly We would rewatch every game from the dynasty. This podcast really worked. It was the perfect timing for it. Yep. If only we had planned it that way. But uh yeah, I thought it'd get easier once the weather got nicer, but now I just sit outside and do nothing instead of sitting inside and doing nothing. Just literally running out of shit to do",
    "speaker" : "Andy",
    "timestamp" : "01:22-01:46"
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "01:47-01:47",
    "text" : "There you go."
  },
  {
    "timestamp" : "01:47-02:23",
    "speaker" : "Andy",
    "text" : "Yeah. Um so yeah, so I wanted to get into the the Super Bowl 36 in 2000, but first wanna kind of Just touch a bit on on you and your your journey as a pager, because you it from we've talked about this on our podcast kind of throughout this season, but you're kind of that true Belichikian success story of that, the the kind of system that Belichick has has put in place over these past 20 years uh of of players a lot like yourself. Um And I I would put myself sort of in that group of uh uh that two thousand team."
  },
  {
    "timestamp" : "02:23-03:17",
    "speaker" : "Matt Chatham",
    "text" : "So my I'll do my my bio real quick. Uh I was actually a Ram initially. I was non-director free agent from the University of South Dakota. That's an FCS program for for New England listeners. So we're similar to it was Division II at the time. It's it's one double A or FCS now, but that's comparable to like a UNH or Maine or or UMass at the time or something like that. So it's that size school. Uh, I was an undrafted guy. Uh I was like, you know, sort of in that realm of preseason All American heading into your senior season. Uh maybe a guy like that has a chance at the NFL but you really kinda don't know. You know, you're kinda just on the cusp of uh being really good at this level, what does that mean? Do I have a chance at the next? All that kind of stuff. And I went to my version of the senior bowl at FCS level. They have this. No longer exists, but it was called the Snow Bowl back then. It was inside North Dakota State's uh North Dakota State is uh they've actually had in uh ESPN Game Days gone there but in the last couple of years, but"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:19-03:28",
    "text" : "It's the same. Yeah, because uh me and Greg both went to UNH, so we kind of have an idea of the Lord, North North Coast State year after year after year."
  },
  {
    "text" : "I mean I I I've told this on you know many a media medium, I guess, since I've been doing this stuff, but uh Planet North Dakota State is as cool of an environment as anything I ever saw in the NFL. It's smaller, obviously, but it's it's like an arena football game. It's like tight on top of the wild. Um but anyway, so I went up to that that senior bullish kind of game for the small schools and uh performed pretty well, but I kind of jacked up my MCL. Uh came away with a little sprain, played through it, but uh in the sort of workouts after I was not combine ready and I was a combine alternate anyway at the time so you really need the testing against bigger time guys and you know the exposure to bigger time players to sort of make that case and I you know I was able to do the bench and I was able to do some of the stuff they used to have a leg press thing like a leg Cybex tests like type thing that was part of combine testing. But there's only a few things I could do. And that hurts you. So then I go on, you know, so I mean I I think it's part of the story. I go undrafted. Um I thought I was gonna be a middle or late round guy and then I don't get drafted. I'm offered a deal by the Rams, Colts and Browns. Kinda just through my agents guidance choose the Rams in part because we thought that was the most vulnerability outside linebacker kind of thing where maybe you could make a roster. And uh I was there in '99, and uh that was my rookie season. That's the year the Rams won the Super Bowl, and uh I was It's a really goofy story. Uh Leonard Little was uh a you know, really good player for them. The first round draft picked the year before in ninety-eight. Yeah. Uh and Leonard had unfortunately gotten in that uh the deal with the uh the drunk driving accident. Oh yeah, we talked about it. Yeah, so Leonard and so that's my position. I think that was in part some of my agents thinking at the time about why that would be a great place to go. Looks like Leonard, you know, their their starter won't be there kind of thing. So maybe the veter the veteran moves into that spot, you can slide in and win a backup job. That's a great opportunity. But uh that off season in ninety nine, uh it was announced that uh it was time served and you know different times in nineteen ninety nine than now obviously. You know, if some if you were an accident you're involved in an accident like that, you're probably gonna miss a year, if not more. Uh but back then it was I think it had happened late in the season in ninety eight, and he upsat for those games and then they made that decision later that summer. So it was a weird situation, not like Belichick type stuff, but they they you know where he keeps it cryptic and you know you just you never know where your standing is on the team with the Rams. Um my position coach just came to me and was like, well, okay, uh Leonard's back and uh he's a really huge part of what we do and that means you're Jay basically not gonna probably make the team now. It's like, dude, it's like July. Yeah. So, you know, we hadn't even gotten to preseason games yet. We'd had inter squad stuff, I think, with Tennessee or something like that. Um, but I pretty much learned before even getting to the preseason games that hey you're you're fighting for a practice squad job and in my head I'm like, that's bullshit, you know. Like I wanna I could I could have gone I could have gone to Cleveland, I could have gone to Indy, I'm a I couldn't make a roster here. Um so I I did a little petulant thing I guess in retrospect and was like, all right, well I'm not gonna I'm not gonna go through these two a days uh for no without an op opportunity to actually make a team. So I left. Uh, which is weird. And so, you know, I went to Charlie Army, who was the GM at the time, and I had a pretty good relationship with Coach Vermil. I mean, I think he liked me. That was one of the places much like New England. that keeps a lot of uh undrafted guys. London Fletcher is one example, but the Rams brag about how many undrafted guys they bring up, much like you know the Patriots do. They they find a lot of a lot of those kinds of gems. type idea. But I went to him was like, man, I I I just want to play in the NFL. And it looks like there's no opportunity here. He says, oh well you can be on practice squad and eventually move up. And for a kid in 99 Coming from small school, practice squad to me meant like hold a bag and you know be somebody else's dummy. And I was like, I'm not doing that.",
    "timestamp" : "03:28-07:13",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "07:13-07:13",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, exactly. But I mean that obviously is not really what it is in the practice world. I mean I think in retrospect after growing up a little bit you realize that is sort of an on the cusp thing and there are opportunities there, but I didn't see it that way as a young kid. So I went back to school. So in 99, I still was under Full Ride Scholarship at USD and I wanted to finish up my degree. So I left camp. I left camp and um They have a designation sort of uh where they kind of continue to hold your rights, like a futures contract kind of thing. And so ninety-nine, which would have been my rookie year, I went back to school. Uh and so then, you know, Charlie's calling in like November and my agent's calling and they're saying, Okay, do you still want to do this? Yeah, and I'm like, Yeah, I do. And I graduated that fall and then uh I came back uh the next offseason in two thousand as if that were sort of my rookie season again. And then that's the year where I went all the way through camp and uh thought I made the roster for the Rams. Got my playbook at the end of the fourth preseason game and uh Went through the weekend, stayed at a hotel and holiday in in our city and thought, hey, I made it. And uh we got to like Monday-ish or maybe it was Sunday, sometime over that weekend. where I m thought I'd made the cut. I came to the team meeting, had my new playbook for the work for week one, and uh there was a r uh there was a uh an injury at one of the uh receiver spots and they came to me and said hey we're we're we're gonna be a little thin uh we're gonna have to bring an extra wide receiver body in for week one Basically, you must be number fifty three. That's kind of what I learned, I think, in MC. I made it, but I'm fi but I'm fifty-three, you know. I'm fifty-three on the fifty-three. So they they said, Hey, we're gonna in a you know, we're gonna put you on practice squad for just a week. We're gonna have to release you right now. Just to take a little transaction, hide you, bring you back when this thing's done. I was put on waivers and uh Scott Bioli, you know, how you're here at New England, claimed me. So what I thought was just gonna be a little, hey, sucks, you won't get to play in week one, but you're still be on the team thing. Um you're exposed to waivers, anyone can get ya and uh Scott apparently had been a had been an advocate of mine, have known more about me than I and I had no interaction with the team prior with New England prior to them doing that. But Um, so I was claimed. So then all of a sudden I'm on a plane up here and I played in week one with the Pats in two thousand Bill's first year and got you know, I see I love Scott Pioli for all he did for my career. But it was a total surprise. So for me and and I I I know I spent a lot of time on that story, but the background there to what the Ram thing meant to me was was kind of different. You know, the reason that the fact that we ended up playing though that particular team and all one championship was was cool for me because my my story had kind of started with them, never really got going. Um and it's no fault of their own. I mean I I think they were still, you know high on me, but you know, the Patriots do this a lot too, where they'll expose the guy to waivers and hope to keep him on practice well for a while and retain them. But Rams tried to do that that with me and somebody else grabbed me. So I still kinda have a soft spot for that place. They were patient with me leaving you know, leaving them prior to camp uh and coming back. But uh it just didn't work out and I ended up in this place and oddly enough that that ended up being the replayed the",
    "speaker" : "Matt Chatham",
    "timestamp" : "07:15-10:23"
  },
  {
    "speaker" : "Andy",
    "text" : "Wow. Yeah. I uh 'cause yeah, we tried to do some some research on you before we did this and uh none of that is in your Wikipedia, I have to say. Yeah. It needs to be updated.",
    "timestamp" : "10:23-10:34"
  },
  {
    "timestamp" : "10:35-10:43",
    "speaker" : "Greg",
    "text" : "Yeah, I think I know what I'm doing this afternoon. So so what what was like were you a fan of a team growing up then?"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "So when you live in Iowa I don't know if it's i i it's not something I think you'd understand as a New Englander because you've got a team, right? You obviously have the pass, you go far enough south, maybe you're far enough south into you know Connecticut, maybe you're a Giants fan or something. But if you live in this region, there's there's generally a team that is affiliated with you, uh, you know, even if you're out as far as Western Matt. I mean you're you're part of New England. You had a team. If you live in Iowa, you don't have a team. You kinda I Iowa is the Iowa Hawkeyes. I mean Hayden Fry, you know, that sort of storied uh college place, much like Nebraska, Nebraska Cornhuskers, they if you live in Nebraska, your pro team is your college team. kind of thing. It's like an Alabama site type idea. Iowa's very much the same way. So there was a lot of my friends, uh I lived in Sioux City, Sioux City, Iowa. I was it's comparable size. It's just short of a hundred thousand. It feels a little Worcesterish, you know, it's a very blue-collar town, comparable in size, I guess, to that. Uh, but we, you know, so you have just a blend of people because you kind of sit in the middle. There are NFL fans, but Some are Chiefs fans, some are Vikings fans, some are Bears fans, some are Packers fans. You get enough uh Sioux City actually sits in three states. It's Iowa, South Dakota, and Nebraska, depending on what part of town you're in. And so the western portion, some of those people, because they sit in Nebraska will be Broncos fans. So Wow. Again, another long winded long-winded way to say you kinda don't have a team. Yeah, yeah you kinda just cheer for who you cheer for, because we sit literally like in the middle of maybe four or five markets, you know, six hours in every direction. So I was a Raiders fan, which is kinda goofy, which has n nothing to do with any of that, but uh I was a big uh I like Howie Long quite a bit. Um, you know, he was defensive lineman stud guy that I I just kinda dug his game but I was a safety number forty two. Ronnie Lott wore that obviously for a while. And I kinda dug Ronnie and I was a big tall skinny kid that played safety initially before I got I grew and became a linebacker. So yeah, I was kind of a Raiders fan, which for me was was neat because my very first preseason game wasn't a regular season game, unfortunately. My first my first time where I got to wear an NFL uniform in game situation. and go against another team. It was against the Raiders. A first preseason game there uh for the Rams. So that was cool. Ten Browns out there running around the field and you're just like Eiser's biggest saucers. It's that was that was a really, really cool day.",
    "timestamp" : "10:44-13:00"
  },
  {
    "text" : "So you're the second Raiders fan we've had on, and neither of them are from either Oakland or LA. The other one we had on he got into the Raiders through hip hop, actually.",
    "timestamp" : "13:00-13:11",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "13:11-13:14",
    "text" : "Yeah. Yeah, they got a brand through that. Yeah."
  },
  {
    "timestamp" : "13:15-13:37",
    "speaker" : "Matt Chatham",
    "text" : "So what's your I would I would I would say like starter jackets guys, like the satin jackets and all through like the I'm a you know eighties kid and Yeah. Early nineties and high school and all that. So like, yeah, Raiders were like one of those brands that, you know, Raiders, the Bulls were kind of that way too. Just like These are huge eighties, nineties brands that if you didn't have an affiliation you probably were cheering for one of those just by default."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:37-13:40",
    "text" : "Yeah, I think yeah, that was the Cowboys for me growing up."
  },
  {
    "text" : "Cowboys for you.",
    "speaker" : "Matt Chatham",
    "timestamp" : "13:40-13:41"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. So I was a little a little behind you. Um yeah, so the the Cowboys were the the team you rooted for if you didn't didn't watch football, I think. Right, right. Right.",
    "timestamp" : "13:41-13:53"
  },
  {
    "timestamp" : "13:54-13:58",
    "text" : "So what was your connection to the Steelers since you clearly just went on like a revenge tour in two thousand one?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Yeah, right. No no Steelers love whatsoever. Yeah, I I don't you know what I would say this though. When you're like a kid from non-NFL world. You know, like if you're here locally, uh you can grow up in Fram, you can grow up in Dorchester or whatever, you're a a Franklin kid or whatever, you're from some small area here. You can maybe even if it's just once a year, once every two years, three years, four years, or whatever it is. You can go to Schaefer Stadium or Patriot Stadium or whatever, Sullivan's all you can it you can have sort of brushes with NFL life. You can go to an NFL stadium, you can drive by an NFL stadium. So you're around it, at least you're aware of it. Uh I I out there, like just even the sight of those iconic helmets, like give you like you know, like goosebumps. Like you walk on the field and it's just that, you know, the old steel curtain look. And it's just so cool when you're you know, those are the things I've only seen on TV. And I I never had been to an NFL game in my life, uh, until I played in one.",
    "timestamp" : "13:59-14:54"
  },
  {
    "speaker" : "Greg",
    "text" : "Well.",
    "timestamp" : "14:54-14:54"
  },
  {
    "timestamp" : "14:55-15:15",
    "text" : "So I y like w yeah. So when we you know when I had uh gone up through college at the University of South Dakota We have a school in our conference back then. It does the conference doesn't exist anymore, but it was called the NCC. So that was North Dakota State, South Dakota State, South Dakota, South Dakota State. All all those schools, Northern Colorado was in there and Mankato, a lot of good hockey schools, St. Cloud State. freaking hockey program.",
    "speaker" : "Matt Chatham"
  },
  {
    "timestamp" : "15:15-15:15",
    "text" : "Yep.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:15-15:50",
    "speaker" : "Matt Chatham",
    "text" : "Uh and Minnesota Mankato. I think they're actually called Minnesota State now, but Mankato State had had a team um in our conference. I was schooling a conference and they have uh They host the Vikings training camps and have for years and years and years. And one time a year they get to play a home game in what used to be the Metrodome. So that was my one little brush with I got to play a road game against Mankato in the Metrodome, but it sucked because there, you know, the Met the Metrodome's huge and there were like two, three, four thousand fans in the stand, so it just was like trickling down the front row kind of deal. Terrible environment."
  },
  {
    "timestamp" : "15:51-15:53",
    "text" : "It looks like a red skin. Yeah, I was gonna say I've been a revolution scary.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:55-16:19",
    "speaker" : "Matt Chatham",
    "text" : "It's it's that it's that feel. So yeah, so uh my whole point of bringing that up is just when you are a kid like me without really any NFL sort of brushes You see a Steelers helmet across from you, you see a Raiders helmet across me, you see a Niners helmet, a Packers helmet. I mean those things just it just it gives you the goosebumps. It's just such a cool thing, even if you didn't necessarily cheer for one of them or cheer against."
  },
  {
    "text" : "Yeah, that makes a lot of sense. Did you have like a favorite away stadium to go to?",
    "speaker" : "Steve",
    "timestamp" : "16:19-16:24"
  },
  {
    "text" : "Uh so this is a this is a corny as hell kind of story, but uh I I I still laugh about it because it was my one moment. So I I'd played Um, I don't think I got to go to um to Lambo where the Packers are at until well into my career. I I think I played there, I ended up playing there a few times, maybe once or twice with the Jets. Um Once, I think maybe just once with the Packers with the Patriots. I was the Patriots for six years and I feel like maybe we had one trip there in the six. I maybe none. I know we play the Packers at home.",
    "speaker" : "Matt Chatham",
    "timestamp" : "16:25-16:55"
  },
  {
    "timestamp" : "16:55-16:55",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "16:55-18:35",
    "speaker" : "Matt Chatham",
    "text" : "But it w I hadn't been there a lot. So I feel like, you know, I'd been in the NFL for a handful of years by then, four, five, six years, something like that. And I think it was my first trip. to Green Bay. And I think the first one was actually a preseason game that we came back and played there later in the regular season. I think that's correct. But anyway, it was my first time in Lambeau, right? And that's that's kind of like a big deal again to like a football fan because even if you you know If you're ambivalent with the Packers thing, cheer form, not cheer form, still just being in Lambo is kind of, you know, it's like a Fenway kind of thing for for baseball. So I I just remember this is corny as hell, but back in the early days, uh I I'll give uh Tom Brady credit for this. Brady was one of the very first guys that I knew Uh actually our strength coach Mike Wochik and Tom were the two sort of forefront guys uh on this uh that had iTunes libraries on their laptops. This is before even like the iPod stuff got started, but Tom had like iTunes library really, really early. He'd always be on his Apple, and this is before Apple computers were really cool or new or whatever. This was this was kind of just like the early days of Apple, and Tom would be up at like ungodly hours. downloading songs and making these playlists and this is em you know during the two thousand season. This is like right when like iPod I think came out uh the uh the iPod, the handheld thing came out like after the two thousand season. I think it was like the two thousand one off season. Yeah that that's and anyway so Yeah, somewhere in that range. And you know, I had like an extensive CD collection and cassettes and all that kind of stuff. So we were all trying to download shit to our laptops. and make these playlists. But Tom was like an assassin with this stuff. Like he was so into it. And I was like, okay, you know, I got my I already have my CDs. I don't get this, Tom. I don't really understand what you're doing with these digital things."
  },
  {
    "text" : "I had my vinyls Tom.",
    "timestamp" : "18:35-18:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "What are you doing? So anyway, he was like really, really into that and I was a little late to the game, but part of the incentive to get it on your iPod was because we had one of those attachments, uh like a little adapter that would allow you to plug it into the to the little weight room. So the the the Patriots weight room, you if you could get your own playlist in there, you could sort of control the thing. And it's not because obviously Tom had seniority at any time like that. He was just a guy who had a playlist. And everyone else is fucking popping in a cassette tape or something, right? So he did that and it kind of incentivized a lot of us to go out and like figure the shit out. So so we went and buy bought iPods and I started to make my own stuff and ungodly amount of hours he'd spend where I remember uh What is that? Ghetto Boys. Damn it feels good to be a gangster. I remember downloading that song overnight. My office was like upstairs in the loft. And it would It was downloading the song, and from the time I went to bed, it took till morning to download like that single song on like Nap's Napster or whatever that was.",
    "timestamp" : "18:39-19:37"
  },
  {
    "text" : "And it would be And you better hope it was the right song and not just the file that was named that way. Oh yeah. Exactly. This is the closest I've ever felt to Tom Brady in my life, I have to say.",
    "timestamp" : "19:38-19:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "And it would just It would just play like you know, like I'd be sitting there and half asleep at one o'clock, two o'clock, three o'clock, whatever, and it would pop on uh like the song songs partially downloaded and would start playing and you wake up like what the fuck is it there? But anyway, so I had I had this like I had gotten to the point where I had, you know, had a pretty robust library and w had had my pregame playlist exactly as I wanted. It was still on that first first or second sort of uh generation iPod. And I had it with me and I always took it out to pre-game warm-ups. And we were now in Green Bay uh for this first time that I've ever met been to Lambeau and Lambo's um the walkway from uh the locker room to the field is unusually long. Like Denver's a little bit that way in the new stadium in Nvesco, but most of them, you know, you're fifty yards, maybe a hundred yards, you know, you're you're close. Lambeau has this weird like tunnel. The tunnel's really long and really steep, but then it kind of winds back through sort of the underbelly of the stadium. So it takes it takes like a it's a long walk and you're going through these sort of hallowed halls kind of feel. And I just remember I back at the time I just had my iPod on shuffle. So no particular playlist ready to roll. So every one of the 800-ish songs or whatever could possibly pop up at any moment. And I had hit play and I started walking down this like windy thing. I don't remember exactly what song was on, but as I hit that, uh as I'm walking anyway, but as I come down that final tunnel stretch and I pop right out the the the the tunnel, you look and you see the field for the first time Um looks like we made it pops on. That uh who sings that? Looks like we made it. What who the hell sings that? Uh it's corn it's corn Corny as hell, you know, like seventies. Uh yeah, yeah. Oh my gosh, I built the whole I built the whole story up and I can't think of his name. But uh that was kind of my like, oh, you know, like the The angels, whatever, kind of looks like we made it. And I'm walking out on the Lambo. Uh and just I I will always really get a a kick out of that and and chuckle every time I think of it because the way the song timed up right as I hit this iconic sort of uh football venue. Barry Malo. Barry Manlow, there you go. Barry Manloff.",
    "timestamp" : "19:47-21:57"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, we'll dub that into this. Oh yeah, there you go.",
    "timestamp" : "21:59-22:02"
  },
  {
    "text" : "Perfect.",
    "speaker" : "Andy",
    "timestamp" : "22:03-22:04"
  },
  {
    "text" : "Yeah, over over my singing.",
    "speaker" : "Greg",
    "timestamp" : "22:04-22:05"
  },
  {
    "speaker" : "Andy",
    "text" : "Please. So you mentioned uh South Dakota State. They were a rival of yours at the time. Is that right?",
    "timestamp" : "22:07-22:14"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Yep, so so Venateri is is uh a few years older than me. I think he was a senior when I was a f a senior when I was a freshman, I believe, or either a senior sophomore, something like that. He's a couple years out ahead of me. And that's our rival, yeah. He' So South Dakota State, um, another guy you might may or may not know. This is gonna take some hardcore NFL fanness, but uh Steve Steve Haydn was a tight end for the Browns, played about the same amount of years as I did, somewhere in that 8-9-ish range, something like that. Steve was Steve was alongside Kellen Wenslow when he was there. So Wenslow uh Junior, whatever his name. He was uh Wenslow and Haydn were their two tight end sets and Haydn and I are the exact same age. Uh so he was at state all four years that I was at U. And so he's an NFL prospect. I'm an NFL prospect. And we played against each other all four. So we've had a surprisingly so there was another running back, James White. Um James, oh my god, I didn't do that. Yeah, I've heard him, I've heard him. Why can't I? I literally cannot think of the back's name. Holy shit, this is terrible of me. USD had another running back that was small. uh kind of like James body white uh James body type so the very very similar that way but anyway oh gosh it's so bad I made it go on air and not know this but we had a running back that was really really good that went to South Dakota uh from South Dakota that went to the Browns also around that time And once again, it's you know, uh I'm sure that'll come to me later. But point was, you know, we have a handful of of NFL guys come through there. There's uh some brushes with uh South Dakota.",
    "timestamp" : "22:15-23:42"
  },
  {
    "speaker" : "Andy",
    "text" : "But you didn't have any beef with Adam when you were on the pants? Not really.",
    "timestamp" : "23:42-23:46"
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "23:46-26:14",
    "text" : "I mean I I kinda give him a hard time now. Um you know, he's a kicker, so I don't think you would get real real into the whole like rivalry stuff. He just does his job, does it exceptionally well obviously but uh I gave him some shit uh so two years I so I I call uh games for ESPN. Generally I'm up here uh doing, you know, maybe uh it used to be UMass games, then BC, then Syracuse, UConn. I kind of stay regional. I don't travel much because of NFL obligation. But um generally I'm doing games up in this northeast and then when it comes playoff times I'll end up doing a UNH game, Maine, uh go down to James Madison, things like that. Um But we had uh uh two years ago, South Dakota State actually advanced to I believe it was the final four uh of of the FCS playoff sort of bracket. And uh maybe it was still just the final eight stage when I had this particular game. But anyway, they were down at a school called Kennesaw State, which is in Atlanta. And they have Kennesaw State has like a newish, like two, three, four year old stadium. It's like one of those built a venue just for c for soccer. So they have like a minor league soccer team where they build those really cool sort of low sitting but like you know, brand new with like Uh eating decks right on top of the seats is really cool, really cool little stadium. But s South Dakota State was uh actually their opponent And for all these years where I I do the the the BCS stuff through the regular year, but then when bowl season starts, I don't do bowls, I do the playoff game. So I get into I I g I'm always wanting these assignments where, yeah, give me South Dakota State or give me North Dakota State schools I used to do and they never give them to me. I always keep me with the Northeast stuff. So I got a South Dakota State assignment, so I was really fired up about it. So I was yes, Texan Adam and Mel like, oh I'm gonna talk so much shit on the air. Like I was gonna be the most biased call, biased call in the history of ESPN. But no, I I actually held my tongue in the uh The uh the head coach there now uh is the same guy that was there when I was the head coach of South Coast State the same guy as when I was there. uh years and years ago and we have to do the coaches conference during the week. And I I you know, so we did a co coaches call with the other broadcasters and the SPN crew and stuff and And uh I got on and I kinda just bit my tongue and didn't say a whole lot. And he he he he came on and gave a little spiel and he entered He said, Hello, Matt. Oh yeah, of course I remember you, Matt. We we kinda had a little little coyote and jackrabbit back and forth, but then we had to dive into it. So I knew I'd be I'd sort of been put on notice that like, okay, I gotta I gotta call this straight."
  },
  {
    "speaker" : "Greg",
    "text" : "I mean I mean Zolak does that every Sunday, right?",
    "timestamp" : "26:15-26:18"
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "26:20-27:38",
    "text" : "Yeah. So it was fun. So like behind sort of the scenes. They always have a production uh room where you where food's available for crew and staff before any game really uh at the NFL or college level. But I went down to sort of the uh the officials' room and where all the food was being served. And I was going to grab a few plates and take it back up to the booth. And in the hallway is this whole crew of the South Dakota State cheerleaders. So there's, you know, 15 of these. Young girls and they're like blue and yellow stuff and I'm like they're not gonna these girls are young as shit. I'm in my early forties, not gonna have any idea who I am Um, so I'm just gonna ask 'em to take a picture and they'll recognize me with my my little ESPN garb or whatever being down here that, oh, it's just must be one of the bro the broadcasters or some random dude. So I asked them to take a picture and I they all got around me and kind of arms around everyone and we're all gonna smile and I said on three one two three go YOTS now YOTS is the South Dakota thing. So none of uh you know, I had the our producer or whatever take in the photo. one of the guys was down there with me and I got them all to one, two, three, go, yo, it's an A and they all kind of gave me a funny look and it it snapped and then I sent it back to Adam and uh had some fun with that. But But unfortunately once the game got going, I'm not I'm being facetious out of it. Called a straight game. I would almost be accused of maybe being too complimentary for state on that video."
  },
  {
    "text" : "Yeah. That's how it happens.",
    "speaker" : "Andy",
    "timestamp" : "27:38-27:40"
  },
  {
    "text" : "It does.",
    "timestamp" : "27:41-27:42",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "We have no love loss for uh South Dakota City either because they beat the crap out of you too ago. Oh really? Okay. Back in yeah. Back in uh 2017.",
    "speaker" : "Andy",
    "timestamp" : "27:42-27:51"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Jackrabbits, yeah. I think they've outlawed that now. They don't allow us to do it, but uh they'd always we always there was always a dead rabbit every time, every time the schools played. Uh 'cause you know, we're we're the coyotes. Uh very emphasis uh emphasis on coyotes, it's not coyote. That's that's it's that's uh sacrilegious to say that. That's that's not the correct pronunciation. So it's coyotes, not coyote. But anyway we th those that were actually, you know, it's like a natural predator kind of situation with coyots and rabbits. So uh any any one of those games there's always a a dead dead jackrabbit, and they're really big. It's not like your regular bunny. It's like a large jackrabbit thrown on the field on the field, thrown on the field, thrown in the court, whenever we'd have any kind of thing but I I think they got in some trouble for that and probably an animal rights thing or something.",
    "timestamp" : "27:53-28:37"
  },
  {
    "timestamp" : "28:39-28:56",
    "text" : "I just made the realization that Yat in your Twitter bio is coyote. I was I was gonna ask you about it and I Googled it. Oh, that's it. Yeah, and it said it was the past tense of yeet. And I was like, oh no, Chatham is putting past tense yeet.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "No, that's not it. No, and and w I'm so proud of my school. I I feel like I I grew I I I grew up at the wrong time. Obviously the Patriots stuff worked out swimmingly as far as timing there, but USD right now is like I said it's an FCS school so it's comparable in size to the stuff the schools we mentioned out here. But we have a dome that's called the Dakota Dome. And uh it it's uh Very similar. Gosh, but there's really they don't really build them out here in the northeast. It's it you know the Metrodome was a bigger version of this back in that day, the Silver Dome in Detroit, all these kind of 80s, 90s. uh more eighties, seventies, eighties builds have kind of come and gone. But the Dakota Dome is still there. They put a solid s uh uh ceiling over the top of it now so it's not the old bubble top. But they're putting solid seating on both sides. So anyone who's bored listen to this podcast we got all this We got all this time on our hands. When you jump jump off jump off here and go to uh go to uh I think it's like Coyote I don't know. When USD's website, whatever it is, University of South Dakota's website, they've got like this Stadium progression thing right now. They're putting solid seating on both sides. So now you've got this like 20,000 seat gorgeous pack to the to the gills uh FCS program that looks like nothing in the country. And I'm just like, gosh, I want to go. I want can I go back? It's sick. I mean i you're you're obviously familiar with U and H you know what that venue's like. It's nice since they updated the same well. No, it's not the same. And uh Maine is is solid enough, but it's you know, it's just the big metal stands kind of thing.",
    "timestamp" : "28:57-30:27"
  },
  {
    "text" : "Right.",
    "timestamp" : "30:27-30:27",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "You see this venue and you're like, holy shit, that's a that's an FCS school. I mean I I I do B C I do BC games, you know, regularly throughout throughout these years and you know that's alumni stadium but it's you know it's a 40-ish thousand state seat aluminum stands kind of thing. It's pretty basic. This is sick user. Oh my god.",
    "timestamp" : "30:27-30:45"
  },
  {
    "timestamp" : "30:46-30:47",
    "text" : "I got it up on Google right now.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "It's unbelievable. Yeah. It's ridiculous. It's supposed to be ready for the season, but I don't know if it's gonna be ready or not with all this stuff going on.",
    "timestamp" : "30:47-30:54"
  },
  {
    "timestamp" : "30:57-31:02",
    "speaker" : "Steve",
    "text" : "Right, true. So you played when they built the news stadium as well for the Pats. What was that like?"
  },
  {
    "timestamp" : "31:02-34:05",
    "text" : "Like locker rooms and all that. Yeah, I think uh I had two seasons obviously at the old place. So again with the contrast of the Rams stuff, I I started that first you know, my first out of South Dakota thing and you're in a division two school at the time, so you know the facilities are nothing like the NFL. So I'm all excited to go, I'm going to the NFL. It's first class. And The the Rams were in this place called uh their training facilities in Earth City. So Earth City is like this gorgeous uh like you know. full training facility out in the burbs kind of thing. So glass facility, racquetball courts, indoor field, uh, basketball court. Uh, you know, it's just gorgeous. Meeting rooms are sick, like everything's really nice first class. The field looks like a golf course. Like it's just like nothing I've ever seen in my life. And uh I'm like that that's the NFL. That's what it's supposed to be like, I guess, right? And then, you know, the dome is downtown, the TWA TWA Dome. And those are like the facilit facilities that like I've made it. I'm in the NFL. Yay. This is what it's supposed to be like. And then when I got released and you were shuffled off here and I I get I stayed out at the Weston uh at the n at the airport. So, you know, they they fly into Logan, stay overnight at this really nice Weston next to the ho Uh uh it's not a West End anymore. I think it's hilled now. But anyway, the one right next to the airport. So you're like, okay, I'm in downtown Boston. This is cool, and this is a badass hotel. This is nice, okay. Drive down ninety-five, ninety-three, ninety-five. We all do. Exactly. And then I I get out and I'm like, wait, that? Like old old Patriots Stadium and it's like, ah, it's still it's kind of a college bowl, so that's big, it's still big and that's cool and everything. But and then I get instead of staying any more nights in the nice West End, we're put up in the end zone ho the end zone motel across the street from the stadium. And uh God bless, we had some really good times there. The owners are really nice people at the time. I think that's changed ownership, but it's a shitle. I mean it's not like a really nice place. But we had a you know party scene kind of ho motel, but it did not have an NFL feel to it. No. Um but then the stadium itself, you know, like you go into our meeting rooms were Uh, you know, like the the chairs that have the the desk that kind of folds, like a folding chair with a folding arm thing to write on. Like that's I mean, with partitions like you would have at, you know, some office complex kind of thing. Like The rooms weren't really divided. We had like the standing rolling partitions and seats that roll up and like it was like I'm like, holy shit, this is the NFL. Like and for me, I I would say it w the facilities weren't that much better than what I knew at South Dakota. So I'm sorry. So it was two good two good years of that though. And uh it was still cool. On game day, uh, you know, the stadium from the field looks pretty sweet, but The facilities aren't nearly as nice. But then when they built the new thing, it was called CMGI Stadium before the Gillette the you remember that? The Gillette flip. Um But I have a bunch of I have a box somewhere with a bunch of CMGI logoed stuff because that, you know, announced launch. There's CMGI was written all over everyone.",
    "speaker" : "Matt Chatham"
  },
  {
    "timestamp" : "34:07-34:14",
    "speaker" : "Andy",
    "text" : "The goo the like Yahoo of the Northeast at the time, I think. Like they were a big deal and then they they went under in the dot com bubble."
  },
  {
    "text" : "Exactly. Yeah.",
    "speaker" : "Matt Chatham",
    "timestamp" : "34:15-34:16"
  },
  {
    "timestamp" : "34:16-34:21",
    "speaker" : "Greg",
    "text" : "So did you do training camp at at Bryant or was it at"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Yeah, I think I did two training camps at Bryant, maybe three. Um at at one point, Coach Belichick flipped it to uh to uh to up here and we would we started staying at an extended stay or what are those called like the residence inn or something like that over in Foxborough so that we could you know so instead of the on college we were staying back here in the woods in Foxboro and then would come over here and do it at the stadium. But yeah, we the we were, I think we got maybe, maybe three or four camps here at at the stadium. And It's absolute night and day. I mean, one quick story from that, I had so when I grew up out in South Dakota, um, you know, going to school at the University of South Dakota, I grew up in Iowa, but at USD Um, we actually had two coaches. I had this uh coach Walt Housman, House we call him. House is a rock star legend. He's uh I don't know if you remember a few years ago, they had the L LA KISS. uh that uh the team that was owned by the band kiss and they had a reality show on one of those TLC or something like that. Nope haven't seen that. Anyway.",
    "timestamp" : "34:22-35:20"
  },
  {
    "timestamp" : "35:20-35:23",
    "speaker" : "Andy",
    "text" : "Is it on Netflix? 'Cause I'm looking for shit to watch right now."
  },
  {
    "timestamp" : "35:25-38:29",
    "speaker" : "Matt Chatham",
    "text" : "I don't know, maybe it's one of those ones you can find online, but it was one of those reality shows that follows an arena team around and the whole joke, you know, it was like Gene Simmons owns a football team and like, you know, it was Uh anyway, it was it was crazy, but House was the defensive coordinator for that team. He's my old coach from way back when, but House is from New Hampshire. So House has got the accent. Not not not not hardcore at East Boston, but like still a New England It's gonna sound very New England to a South Dakota kid. So House is, you know, a South Dakota guy, and we have this other guy uh that was uh a strength coach and uh He was from out here and had much more of a, you know, very, very heavy Boston accent kind of thing. And so that strength coach was So uh getting the story quickly. So I'm at training camp at Bryant, like you'd mentioned. I'm out there on the field in 2000, head spinning, you know, it's oh it couldn't have been two thousand. Sorry, it had to be two thousand one because I missed training camping. two thousand 'cause I was in St. Louis. So my first my first Bryant training camp, oh one I guess. So I'm out there on the field and the way it always works is you only do autographs. I kinda still do this now. You only do autographs. with uh by position group. So they don't let, you know, they today's running backs, today's linebackers, today's tight ends, today's quarterbacks, whatever it is. So when you're walking off the field, coach would encourage you is like if it's not your day, don't go over and do it because then everyone will be expected to dive in. So they did it sort of in in sequences. So I I it was one of those days where I knew our group wasn't supposed to go over there, so when it was our time to go, we just had to walk off the field. But you know, a lot of people yell out to you and want you to come stop and sign something. And This guy is yelling and again I'm some n you know young guy that I'm not the guy people's uh who are pining for their my autograph, right? But for some reason there's this guy who'd had his shirt off, uh huge guy, uh um shirt off the entire time, like, you know, like uh, I don't know, Ray Bans or whatever. Like he's just like He's just screaming my name throughout the impractice. Big barrel chested guy. He's hammered. Probably. trying to get my attention the entire time. All the other linebackers are busting my balls like, who the fuck is that? That just was just won't stop standard aim. And then when we went by, I I did I I may have ignored I don't know if I waved or acknowledged, but I certainly didn't stop because we were told not to. Just you know, I'm doing what I'm told. It's not our day. We can't stop the sign. Well anyway, that guy was Tom Jenkins, who was my strength coach at USD. Now he I I had no clue that that was him. And so this is before like, you know Uh I'm I guess I probably had an email. Uh so I'm getting a text message months later about why did you punk me in front of all my friends and why did you not acknowledge me? And I'm like what like like what? Oh Jenks, my bad dude. So anyway that was that was like my my that that if you can imagine that voice in South Dakota, we had two hardcore New Englanders throughout that throughout my four years. So It was uh was always a little piece of that in my life even before I knew really what this was all about out here."
  },
  {
    "timestamp" : "38:29-38:32",
    "text" : "He should have tweeted at you with like a big chunk of meat or something.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "38:34-38:58",
    "speaker" : "Matt Chatham",
    "text" : "Yeah, but again, this is before this is pre tw this is pre-social media. I maybe had a cell phone. Yeah, I probably had a cell phone in a one. Yeah, I probably like right towards the end of college, I think midway through college in like ninety-seven or eight, I think I got my first big chunky cell phone. But it's not like, you know, you didn't text people really that much then and it maybe it was an email, but I didn't fucking know. I think my wife and I shared an email when I first went to the NFL. So it's Like it's how do you get a hold of one another back then at least."
  },
  {
    "text" : "Yeah, I it it baffles me how we managed to do it, get by with landmines and shit.",
    "timestamp" : "38:58-39:03",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "39:04-39:04",
    "text" : "Right, right.",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "By the way, I'm looking up this LA KISS and their jerseys are outrageous.",
    "speaker" : "Greg",
    "timestamp" : "39:05-39:11"
  },
  {
    "timestamp" : "39:11-39:12",
    "text" : "Outrageous, yeah.",
    "speaker" : "Matt Chatham"
  },
  {
    "timestamp" : "39:12-39:16",
    "speaker" : "Greg",
    "text" : "It's exactly what you'd expect if someone from KISS designed a uniform."
  },
  {
    "timestamp" : "39:16-40:00",
    "text" : "Yeah. Yeah. And how Wall Housman's his name. House is a stud. He was a really good offensive lineman, I believe, at Iowa, that went on to play for a couple years in the NFL, but his knees got got really jacked up. But House was You know how reality shows are. Like they always try to hone in on a few of the big, big personality guys. And House is just wild. The screamer, they just good good dude. All the players love him. Probably has a dip in at all n all times. Big cat lover. Like he's just He's a he's a very eccentric guy, one of my favorite coaches of all time, really smart football guy. But House was like this, you know, I'm again I'm coming from some div some two Division II school. And you know, fifteen, twenty years later, there's this reality show with my old defensive coordinator on there. And it's like, oh well you shot you guys are getting to see what what I got to see. This is hilarious.",
    "speaker" : "Matt Chatham"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, he is from New Hampshire. We're from New Hampshire as well originally. Uh he's from Merrimack. Yeah. Merrimack. There you go. He coached at uh St. Anselm College, which is literally five minutes down the street from me.",
    "timestamp" : "40:00-40:12"
  },
  {
    "timestamp" : "40:12-40:53",
    "speaker" : "Matt Chatham",
    "text" : "Yeah, House is I believe House is retired now, but uh Just a great guy. Good dude. Coached all throughout Arena and then small college stuff with us. And I He I love it. He used to actually come up to Patriots camp and uh when you know, the arena's obviously trying to arena football's trying to pick at guys that look like may not make a roster, you know, like there's something to them that can still play, they're good players. But they're gonna get snipped on fifty-three and they might be a part of that next ten. Uh so he was always he was always up here in those later years evaluating, trying to who hey, chat him, who's Who's not gonna make it but do you like? I love that stuff. It's great."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "40:54-41:01",
    "text" : "It's like Kurt Warner, right? He was uh he's an Iowa guy too, isn't he? Did you did you interact with him when you when you were at the Rams for that little bit?"
  },
  {
    "text" : "Very little. So remember ninety nine's the that off season when uh when the ACL gets blown out, uh Trent Green's ACL gets blown out. And uh so uh by my little story earlier about how when I left camp that was I left camp uh the week of the first preseason game. So this announcement had come right around that time, had the little meeting. Uh I went through a practice or two after they told me that. And uh I stood there for the entire two and a half hours just watching and I was furious. Like I said, the old whole emotional reaction thing. But anyhow, so I didn't actually uh see the it was Rodney too. I think it was Rodney Harrison went through through uh Trent Sneak. That's right. And that in that preseason game. But that happened, I believe, a week or two into preseason, maybe the third week, something like that. So I I missed that part. So In fairness, the time when I was there, Kurt was just, you know, backup quarterback. And my draft class, uh or my class, I wasn't I wasn't one of the undrafted guys, but Uh Joe Germain was in that group. Remember I'm from Ohio State.",
    "timestamp" : "41:02-42:02",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "42:02-42:02"
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "42:02-42:20",
    "text" : "Uh uh Joe Germain was the other. Could he be the second? Could he be the third? So at the time I left, I really you know, it wasn't the Kurt Warner story yet. So Had a few interactions with him, but not a ton, but obviously a super decent guy, but I didn't get to see him be the kind of player he became until I was I was finished. Yeah."
  },
  {
    "timestamp" : "42:20-42:23",
    "speaker" : "Greg",
    "text" : "He was the second topic on drafted Iowa."
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Yeah, but that's a c uh that was another school. He went to the University of Northern Iowa and that's another school sort of in the FCS, same conference as USD now. So that's a competitor, but cool school. I I went to there for recruiting trip and it was one of the One of my coolest uh memories. Uh there was uh you remember Offspring? You remember the band Offspring from uh first ever CD?",
    "timestamp" : "42:25-42:46"
  },
  {
    "speaker" : "Greg",
    "text" : "Ix Nay on the armbreak.",
    "timestamp" : "42:47-42:48"
  },
  {
    "timestamp" : "42:48-44:09",
    "text" : "Yeah. So that that uh oh I'm blanking on that one song. It uh I'm I'm terrible about bringing up song names but you're not remembering the name. But um I remember on that recruiting trip it was one of those like, you know, almost like uh Johnny be good, that old movie, like one of the sickest uh recruiting trips I ever remember. You go into this house party after we'd left the game and uh they had actually opened the back door. and then opened the front door and they ran a uh slip and slide all throughout the home. And and and they had kegs at one side where they had opened the top of the keg and were living in that run down the slip and slide. slides. Whatever that song was from Offspring, that da da da da da da blanket it was it was the their hit early on there in the keeping separated mid nineties. Yeah, no, not King Torah. Uh you'd hear it. Later nuts. Uh, whatever it is. Uh I I I you we'll come up with it. But they they killed the lights in the house and they started playing that song and there's you know like two hundred people in this old house. and they flip on the kegs running down the slip and slide out from the back door out the front door of the home and people running through the backyard and sliding through up the front of the house. while that offspring song plays. That that's how I remember Northern Iowa.",
    "speaker" : "Matt Chatham"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm pretty sure that's how Greg's Easter just went too. Just by myself. Oh all right. Well I mean we've we've kept you longer than uh we told you we would. Um boys, do you have any last questions you wanted to ask Matt before we mercifully let him go?",
    "timestamp" : "44:10-44:29"
  },
  {
    "text" : "I'm I'm I'm a little interested in like the build up to the Super Bowl, like that Super Bowl media week and the extra. So we didn't actually talk about the Super Bowl, did we?",
    "speaker" : "Steve",
    "timestamp" : "44:29-44:37"
  },
  {
    "text" : "Oh yeah, sorry we did that part. That's fine. That's all I had all the time in the world. Unfortunately I do have all the time in the world right now, I think. Um but So I I well I'll just say this. It was weird. Uh especially getting to experience the next two and you know the pace of the week, you know, based on the one we had Houston and Jacksonville, those next couple, that's kind of what it's supposed to feel like.",
    "speaker" : "Matt Chatham",
    "timestamp" : "44:37-44:56"
  },
  {
    "timestamp" : "44:56-44:56",
    "speaker" : "Andy",
    "text" : "Mm-hmm."
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "But you'll remember I the Rams had a an incredible advantage, I would say. Not incredible, but but a a nice one because they won at home against the Eagles to go to the Super Bowl. We won on the r we won on the road against the Steelers. And you'll remember this is the 9-11 year. So we'd lost a a week we've lost a week of uh the season where the NFL paused things during the year. And uh When we lost that week, uh the basically what was chewed up was the that extra week of the Super Bowl. So there wasn't two weeks. There's just one. So when you went on the road against the Steelers I want to say the AFC game was the afternoon game. I believe it was on that on that Sunday. So, you know, we're clinch we're clinching early evening. And we're having our trophy party uh there on the field and then we gotta hop on a plane and and fly back to Voxboro and then go to New Orleans the next day. So you know, if if you're St. Louis, you beat Philly you're at least homes and then the guys all go back to their houses, grab their bags, and you probably meet the next morning you take off on a flight for New Orleans. We had to fly back. So we had to fly back in the middle of the night, you know, obviously the Drinks are flown, we're having a blast. You know, you're you're making it the Super Bowl work, but we have to, you know, late night flight from Pittsburgh back to New England, but everyone's got to be back the next morning with their bags packed at the stadium. And ops is, you know, the the guys that work in operations for the team are trying to put together a Super Bowl plan on the fly. Uh but I just remember being, you know, maybe you sleep a little on the plane or maybe not, but you're arriving back in the middle of the morning. You gotta go home pack a bag for an entire week stay in New Orleans and you're back at the stadium, maybe at noon. I don't remember exactly the times, obviously, but something like that. Like the flip is so quick. And now you've got your bags packed for a week. Coach Belichick's coming in with his itinerary that they've probably put together on the flight, I guess. I I don't know when one that would have time for all that. But and then we're turning around and jumping on the jet and and going to New Orleans. So it was quick, it was a whirlwind, you did not really have an opportunity to let it all sink in. But then that evening and I think Monday night, uh I I would imagine we touched down maybe sometime that afternoon or something like that. We went, there was a group of 10, 12 of us, something like that. Um Emerald Legacy was uh has this restaurant called NOLA and had was hosting a handful of us. And so We you know, we ate at at at Emerald's place and he kinda hosted the dinner was really cool. You know, again you're kinda like celebrity eyes, kinda like just head spin on like getting into all these cool things. But we went there to Nola's real quick, had a really great dinner that night with a handful of guys and then we're down to Bourbon Street, uh, for kind of our one night out, 'cause it's a one night where you don't have a a curfew or whatever and you kind of just l let loose. And a bunch of the Rams guys were down there as well. I think Larry Larry Flint's. I know this is obviously not a highbrow place, but Larry Flint has one of those sort of uh uh bal balcony hangover uh bourbon street kind of places for beads and all that stuff. So bunch of those guys were in there, which are some of my old friends from From St. Louis and then a bunch of us after leaving Nolas went up there and we kinda hung out a little bit. It was kinda weird the two teams are kinda interacting down on Berber Street the night before it all gets going. But It was that quick though that you just basically arrived there after I mean shoot it was twenty four hours from um we're sitting at dinner at NOLA's twenty four hours from when we were in the stadium in Pittsburgh the day before, right? It's crazy and after having gone back to knowing one and back again. And then you have your wild night out there. It got pretty pop. And then the next morning the next morning you're doing media day. So that that whole in in in the stadium pictures. Yeah. It was that fucking quick. So that's what Tuesday was. And then you're into Wednesday practice week. So all I remember about I don't remember a lot of the details other than just like little anecdotes like that because it happened so freaking fast. So that's that was one of the ones where when people I'll remember stories like individual things that we did in Houston or in Jackson were way better than New Orleans. New Orleans was like, whoa, that came quick. Like it just, you know, you you're into a game plan like basically the very next day and just trying to get up to speed really quickly and play a game. Wow.",
    "timestamp" : "44:56-49:01"
  },
  {
    "speaker" : "Greg",
    "text" : "That's crazy.",
    "timestamp" : "49:01-49:01"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:01-49:06",
    "text" : "Yeah, it doesn't take a lot of time to uh study that Rams walkthrough tape either, you know, all their practices."
  },
  {
    "text" : "Exactly. It's almost as if that didn't happen.",
    "timestamp" : "49:08-49:11",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I read that article on the athletic that you wrote about that, so I was like, we gotta bring that up.",
    "timestamp" : "49:13-49:18"
  },
  {
    "timestamp" : "49:20-51:38",
    "speaker" : "Matt Chatham",
    "text" : "Yeah, it just it drove me nuts, especially since I have a lot of respect. independent of that one situation with a lot of those guys in that in St. Louis that bought into it. I don't know why they did, but I can understand that when you you know, when you've had disappointment and loss that you would want to believe that something like that was at the heart of it. But it it just it's just not true. So and that's a crazy thing. Like, you know, we just uh it was such a quick week. And uh I think one of the things that when people wanted to find a way of how are we so good on defense, you know, we must have known something. We must have had some secret. blah blah blah. Like it was so incredibly helpful for us to have played them really tight and lost at that, you know, remember that home game that we had with them in November, December, what it was with the Rams. That was so helpful to kind of flesh through what really worked for us. that we could now build a game plan around it. Also look at, you know, all the times that the Rams have been just smoking people um and allowing their receivers and backs and tight ends to just run off the line untouched. That was to me one of the first real hardcore Belichick game plans that was, you know, really what won it for us. If if you'd have if we'd have adopted if we'd adopted a different game plan and we'd have done something comparable to what you'd seen all the other teams that had tried to slow them down do We probably got beat, you know. But we it it it took a a very particular approach to beat those guys and coach taught it to us again in this sort of expedited manner because it was such a quick week, but it was like you can't you can't learn everything in this environment. You just can learn here quickly what you can't do. They can't free release off the line. You know, Ernie Conwell, stud, big blocking tight end, but very athletic. And uh Williams, the other tight end, they've they've got really good athletic tight ends and all those receiver groups, from Isaac Bruce to my draft class uh or my rookie class, uh Tori Holt. And uh, you know, uh Horn, I think Horn was still there. Uh blanking on the other third receiver's name, but Rick Ricky Poll, well obviously Paul, yeah. Obviously Marshall and Ricky Poll. And uh, you know, it's just it's just an incredibly talented group. If you let them build on you and, you know, get easy releases off the line and make their break at twelve to fifteen yards are gonna murder you. But if you beat 'em up at the line, you know, that's I don't know. It's just it was one of the first times where we where I think approach won a game that I can r that I'm aware of. I mean I'm not a big NFL historian guy, but it was just yeah how incredibly important the approach that we adopted. you know, play to play that role in the outcome."
  },
  {
    "speaker" : "Andy",
    "text" : "Well I mean it was similar to Belichick's game plan against um the Bills when he was the defensive coordinator for the the Giants too. I think that's inlogic. Told them that they wanted Thurman Thomas to run for a hundred yards, and if he did, they would win the game. Sort of thing. It had shades of that at least.",
    "timestamp" : "51:38-51:54"
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "51:55-51:55",
    "text" : "Shades of that."
  },
  {
    "text" : "There you go. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "51:55-51:56"
  },
  {
    "text" : "For me anyway.",
    "timestamp" : "51:56-51:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:57-51:57",
    "text" : "I don't know."
  },
  {
    "text" : "I wasn't there.",
    "timestamp" : "51:58-51:58",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:59-52:05",
    "speaker" : "Steve",
    "text" : "Do you have any like uh guys you played with that you still keep in touch with? Do you have any like really close friends on the team?"
  },
  {
    "timestamp" : "52:05-52:55",
    "speaker" : "Matt Chatham",
    "text" : "We're talking Patriots stuff? Patriots, Jets, anywhere all online. Patriots, yeah. So I I would say the the th the the group of Guys, that uh that stays in touch the most is really your position group. So, you know, it Larry is also one of my good buddies, and is and I were obviously together here for For for five of those six years and is has gone on to do uh a lot of different things in coaching. You know, he was a Special teams assistant at the for the Giants for several years before he got his first coordinator job uh with the Texans, had that for a few seasons, and now he's the assistant up in Seattle. And it it does kind of suck having, you know, one of your boys that was you were tight as with uh live on the other side of the country. But, you know, so we just kinda yeah, you're unfortunately forced to keep contact through texting and and stuff like that."
  },
  {
    "text" : "We recommend starting a podcast because we did.",
    "speaker" : "Andy",
    "timestamp" : "52:56-53:01"
  },
  {
    "timestamp" : "53:02-53:03",
    "text" : "It helps, so there you go.",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "53:03-53:03",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. I it's I mean it's generally that it's for I'm fortunate that that a few of the guys still live around here. Patrick Pass was he's my uh Patrick's my uh my neighbor on virtually everything I did as a pro at specialty. So on the kickoffs on the L three, Patty Patty is the L two, so he's right next to me on on punt team, I'm the guard, Pat's the tackle. So Pat and I were kind of like uh I don't know, wing my wingman or whatever, something like that and just about everything we did. We were always alongside one another coordinated really well together. So Patty still lives down here in Rhode Island. I think it's a Lincoln guy. Um so I do see him some you know, I wish saw more. My Joe Andrews, he's local. Um Copeland has got his place down in uh And East Greenwich, he opened up that line cider brewing place. So he's incredibly busy with that. Yeah. Uh Cope isn't doing as much media anymore. So he dipped his toe in that, did for a few years of media. But he's really involved in that brewery and it it sounds like it's pretty badass. I usually just I actually physically haven't been down there, but I've I've gotten cases of his stuff. It's really good. So Highly recommended if anyone's going down there that line Cope's got his hands on that stuff. But yeah, Russ Hochstein. Russ Hochstein is uh is a Nebraska kid. Uh went to the University of Nebraska and uh grew up in Hardington, which is a town not too far from where I was in Sioux City. But ho Hochstein is I'd say Russ is kind of the preeminent example of what happens to a lot of guys in the NFL. You go to your host city or you know the city that you kind of grew up in, you settle there. Russ is two towns away and I see Russ once or twice a year. And he's a great dude. We get along really well. Our families get along great. But you just you just end up I live in Rentham and I basically see Rentham people now. So it's it sucks. Like they're, you know, yeah you It's you know K Fawk was here for years, but then now he's moved back down to Louisiana.",
    "timestamp" : "53:03-54:51",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "That's right, yeah.",
    "timestamp" : "54:52-54:52",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:52-55:33",
    "speaker" : "Matt Chatham",
    "text" : "Um I think I've I think I've oh cr Fourier is obviously doing radio, so he's local. Um trying who else who else is still here? It's kind of it. Yeah, Wiggy's still here. Yeah, obviously he and I he and I worked for for years together on Nesson, but now he does he's doing all radio and no TV anymore. So I but I I all those names that I mentioned, we're all around here, but we're all kind of live in different towns. We see each other a little, but not a lot. Brewski's obvious here, Brute, but Bru is down in Bristol a few days a week, but he lives in North Otterboro, so he's not too far away. So you know, yeah, honestly, even though you're here ish, it's I think we talk through text messages more than we do in person, which is I think just more life than I think."
  },
  {
    "text" : "Yeah, I think that's a common thing.",
    "speaker" : "Andy",
    "timestamp" : "55:33-55:35"
  },
  {
    "timestamp" : "55:35-55:40",
    "speaker" : "Steve",
    "text" : "So I mean we have to ask the obvious question of like, do you have the phone number for Troy Brown?"
  },
  {
    "timestamp" : "55:43-55:58",
    "speaker" : "Andy",
    "text" : "Troy Brown. Yeah, because we are the Browns. Um we we also we were discussing this last night, we're gonna ask you, and then we got a discussion. Does is Troy Brown the type of guy that actually has a cell phone? Because he strikes me like he may not."
  },
  {
    "text" : "Yeah. I definitely am not going to be able to give that one out.",
    "timestamp" : "55:58-56:02",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "Like how how early was he on the uh iPod train?",
    "timestamp" : "56:05-56:08",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Ooh, I don't remember. So okay, so i I have to be uh deliberate here and and so the the the groups don't lift together necessarily. So that my whole thing was the line bac the linebacker group, sometimes D line would go in with us as well. Maybe tight ends 'cause we're all like mid I think we're called the What do they say? Lightweights, middleweights, heavies or something like that. So I think we're always in the middle group. So the receivers and maybe the running backs and the DBs and stuff, they all work out together. Quarterbacks are with them. And then the middleweight stuff, which is us, linebackers and and maybe the D-line. Now D-line's more heavy. So mo mostly linebackers and tight ends and Maybe the fullbacks or whatever. We work out together. So uh whatever Troy music Troy's listening to, we're probably not in lifting groups very that often. So it's just more it's more your body type guys. Let's",
    "timestamp" : "56:09-56:56"
  },
  {
    "speaker" : "Greg",
    "text" : "He was probably listening to classical.",
    "timestamp" : "56:57-56:58"
  },
  {
    "text" : "I don't know. I don't know I don't know Troy's musical taste. That's where I can't answer.",
    "timestamp" : "57:06-57:09",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "Foiled. Oh, Greg, uh you wanted to ask about Brian Cox, didn't you?",
    "timestamp" : "57:12-57:19",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I mean just from watching all the games in 01, he's like one guy that like stood out as someone that like It didn't jump to to mind like looking back, but when we actually go through watching the games, you're like, wow, Brian Cox is electric. Like just from like a personality standpoint and just and from a play standpoint too.",
    "speaker" : "Greg",
    "timestamp" : "57:20-57:41"
  },
  {
    "timestamp" : "57:41-58:43",
    "text" : "Um so yeah, and he had a he had a really interesting role on that team and something that uh so uh uh Brian wasn't there in 2000. The 2000 team was the team that was five and eleven. And uh, you know, I don't know what the exact number was, maybe half. It it seemed like half, maybe it wasn't quite that dramatic, but there was a real house clean from between two thousand and two thousand one. So Cox was one of those new off-season free agents in the O1 crew. Roman Pfeiffer was the other one. So Pfeiff is a stud, really just a tremendous pro, really lucky to have uh played with him all those years. But Fife came in and Cox came in and those are kind of the do new two new additions to the linebacker room. And um Andy remember Andy Andy Katzomore had had those neck problems. So Andy was having surgeries and his career was ending. It was kind of all happened around that same time. Cox was coming in as Andy was kind of going out. And uh I believe TJ Ted Johnson, he's you know, obviously the really good player for the for the organization for years, but TJ had had I think it was his bicep thing then at the time. I don't remember.",
    "speaker" : "Matt Chatham"
  },
  {
    "speaker" : "Andy",
    "text" : "But he was a back thing.",
    "timestamp" : "58:44-58:45"
  },
  {
    "text" : "Maybe yeah. He was a little banged up at the time Cox came in, so it was timely that Brian could pop in and play Mike linebacker and that was at the days before Bruce was a Mike. Brewski was more of a will, otherwise weak side linebacker. So your Mike is traditionally your big hammer guy and Cox is tall. I think he's we're about the same height, six, four, five type guy. Uh but Brian was heavy. Like he was I mean he was like what I weigh now, unfortunately. But I mean he was like two sixty type and I was more of a two fifties type. But Cox was just one of the thickest, um, on contact, heaviest hitters, at least at a linebacker that I'd ever really been around. And and the crazy part is Bryan was pretty shitty in the weight room and I I I joked at that because he was such a he was such a he's such an absolute animal on the field. Yeah. Which was always a good was always a good, you know, reminder that it's not just the weightlifter guys that necessarily hit the hardest or play the best for anything like that. And Cox is a pre-eminent example of that. He was really poor at at things like bench press and things like that, which you wouldn't expect because he was absolute assassin on the field. But uh the reason I said his his role was unique is Brian was kinda like the much, much older vet when he was brought in on one and he was kind of a you know I don't know, uh, speed dial to the front office kind of guy like Bill would have him in you could tell a lot to how are things in the locker room and you know, he was sort of meant to be kind of the the go-between and uh enforcer a little bit, you know. And so uh Brian I actually had a little tension um because I'd gotten in trouble for a couple I had two personal fouls in one game against the Broncos early. And uh the Cox has Co yeah, coach had laid in coach had laid into me in postgame, and then Cox said something to me in the locker room. And we, you know, and didn't get to blows, but it was tense between he and I. And I I'm telling you this because I I love Brian, he's a great guy. And uh that we were tense then and because he was the sort of the older guy towing the line of the coaches and I was uh just leave me the fuck alone guy I'm just trying to do my job here. I'm not trying to fuck up. It's just, you know, I had a couple of bad calls. Um but anyway, so it it's funny because then as I grow and become a vet And then Cox moves into coaching. Brian was my coach. So he was in New York when I was in New York. So B. Cox was brought down there with he was brought down there with Man Genie. So it was funny 'cause that one year Cox was, you know, you know, the hit he has against uh Indianapolis that really turned the tide of that game, one of the big blow up shots over the middle. And uh, you know, Cox was just such a a stud for that early group of us, emotional leader kind of guy. But he was also, I think one of the biggest lessons I got from Brian was his toughness and just that he played with one of the worst injuries I've ever seen. He basically had a broken foot. And when you break your foot, you can't fucking run. Uh and he would put You know, like you'll see offensive linemen that'll do that like club thing where they put the giant club on a hand and you know, maybe it even maybe it's even a close fist and they don't have fingers and they're able to you know they're able to play. uh semblance of the normal game. Cox did that with a foot. And like I've never s I've never seen that before. Like he's getting it shot up. If you look at the way he had it taped, his foot was like a club foot. Like he had so much tape on his ankle. And he it or foot, I don't know exactly where the break was, but he had a break somewhere there down in his foot. And he was so big, you know, in the mid season and late season with us, but He wasn't really healthy, yet played through that thing through the playoffs. And I wanna if I recall, I don't think he had much of a role in the Super Bowl. I think by then he was it it was a little more reduced because he was so fucked up physically. But I just remember, you know, I went through some things later in my career. I had I I shredded my toe. I had the a seismoid tear basically like, you know, when someone has an ACL reconstruction, I kind of had one of those for my foot. Like I absolutely shredded my foot and I used to have to take a pair of shoes and I get a new pair of shoes for each game and have to cut a little X out of the side so my sesmoid joint could stick out the side of my shoe. Like because there's not enough room in the shoe for width. Like my I mean I had a fucked up toe. Like I basically shouldn't have been shouldn't have been out there, was getting it shot up and was just limping along. But I always remember You know, I I like thinking, okay, Brian played with his broken. I've got a stress fracture, I've got a badly dislocated toe. I can barely walk. But I do remember as an older playing going, okay You know, fucking Brian got out there and B c Backs went out and played on a broken foot. And I was similarly limited. You could tell Beacox was limited too, but his whole thing was off the ball, middle linebacker by that point. He's like, I can still take three hard strides and hit the shit out of the guard in front of me. I can't cover anyone at this juncture. I'm not gonna be able to pass rush, but what can I still do with my body limited this way? And I just I don't you always was a good example for me 'cause I remember he figured it out, he played through the pain, take what you gotta take to get out there. And I had a very similar situation to that later in my career that I had to deal with and I always kinda thought back to how Cox was A little bit inspiring that way. But um yeah, no, he was he was an important guy uh in those in those in that O one run because he was a very emotional leader and uh he dealt with a lot to get the game day himself. his role kinda ebbed and flowed like a lot of guys have happened, but uh you know, I was glad I got to play with him there and even though there was a little tension early on and you got to be my coach later on, it ended up being a guy that I that I really respected.",
    "timestamp" : "58:47-01:04:05",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "Yeah, 'cause I remember I think he got Uh it's like a chop block or something against the the Broncos is is how he broke it. Uh because he was all fired.",
    "timestamp" : "01:04:05-01:04:15",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, swinging on the guy because he just dove at his feet. I absolutely remember that. It was in the Broncos game. You're right. Yeah, I remember that.",
    "timestamp" : "01:04:16-01:04:21",
    "speaker" : "Matt Chatham"
  },
  {
    "timestamp" : "01:04:21-01:04:38",
    "speaker" : "Andy",
    "text" : "But then he came back like five weeks later and we were talking about it. We had no idea how that was possible to come back with a broken leg in five weeks. Because he came back. I think the right We were talking about how he came back. I believe so."
  },
  {
    "text" : "Yeah, I d hamstrings suck, man though. I I hate those things. I I've I've gone through that 'cause it sounds like such a it sounds like kind of a pussy entry. Oh your hammies. But like once you pour in one of those things, they never heal. And if you happen to have a job where which requires you to open up, open up and go full speed, I covered kickoffs, obviously, for my whole career. Hamstrings suck. Like you like you would. You'd literally rather just break the arm. Break the arm, break the bone, clean, clean break, let it heal. Hamstrings are kind of those things where you get a tear in them or they start to open up and they never heal and you can't run. And it's just you know, oh my hammy. It just sounds like something that's not like as cool as like I broke my leg or I you know, I separated my shoulder or something. Like hamstrings sound terrible. I pull the muscle. But it if you no, I don't know. I just know it I I I dealt with that one season and for my job you have to sit over there, sit over there, sit over there, then run down and cover a kickoff and maybe play a few plays on defense and it's just when your hammies are jacked up it's not It's not good. So I can imagine being a guy like that where you have to run forty yards downfield, run back to the huddle, run twenty-five yard out cut, and then go down a round fifteen. Like if your hammies are jacked up, it's it's a pain in the ass to say that much.",
    "speaker" : "Matt Chatham",
    "timestamp" : "01:04:39-01:05:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Greg, don't you have hamstring issues?",
    "timestamp" : "01:05:46-01:05:48"
  },
  {
    "text" : "I have no, I have like knee tendinitis stuff.",
    "speaker" : "Greg",
    "timestamp" : "01:05:49-01:05:52"
  },
  {
    "timestamp" : "01:05:53-01:06:06",
    "speaker" : "Andy",
    "text" : "I thought it was hamstring. Yeah. Oh, so I've been giving you crap for hamstring issues for no reason. My apologies. Greg Greg used to play soccer at uh at UNH, so He's the closest thing we have to a Matt Chatham in our family."
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "01:06:06-01:06:41",
    "text" : "There you go. UNH is UNH is a cool school, man. I I'm just uh I I'm I'm sad that they didn't have uh the hockey season got cut short because I've I've I've I try to do uh hockey east hit like as many venues as we can a year 'cause my kid's uh eleven year old kid uh Really good hockey player and we don't get up the B's game very often, so we try to hit every venue we can on hockey. So UNH is one I haven't hit. I've never been up to my to Maine's. I don't think I've been I haven't been to Merrimack yet either. I think we had hit just about everything and this was gonna be the offseason where we're gonna tick off those last few. Yeah, yeah. And then the season got got stunted."
  },
  {
    "speaker" : "Andy",
    "text" : "Best late plans, right?",
    "timestamp" : "01:06:42-01:06:44"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "There you go.",
    "timestamp" : "01:06:44-01:06:45"
  },
  {
    "timestamp" : "01:06:45-01:06:51",
    "text" : "Yeah. All right. Well, Matt, uh, we've we've taken one of your time.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:06:53-01:07:00",
    "speaker" : "Matt Chatham",
    "text" : "So much for a 20 minute interview. Is that accurate? I th I think I took your time too. I just just talk and talk and talk."
  },
  {
    "speaker" : "Andy",
    "text" : "I I took the day off today because what the hell else am I gonna do with PTO this year this year, you know? Yeah. I I am good to go.",
    "timestamp" : "01:07:00-01:07:07"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, I'm work I'm working today.",
    "timestamp" : "01:07:07-01:07:09"
  },
  {
    "speaker" : "Andy",
    "text" : "You're on the clock right now. Yeah. Uh all right. But uh yeah, I think uh I have no other Nothing else on my list that that I want to bring up.",
    "timestamp" : "01:07:10-01:07:22"
  },
  {
    "timestamp" : "01:07:23-01:07:28",
    "speaker" : "Greg",
    "text" : "Well shout out is uh the the Razor show, right? That's your uh podcast."
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Yeah, so the yeah, the ra the Razor show on the athletic is is up, but we haven't done any episodes since the offseason broke. So it's Jeff Howe's there now. Obviously Jeff Howell's our our lead reporter guy and I'm the analyst. Um but uh the Razor Show has been I think we did one episode after the Super Bowl and it's kind of set dormant. So If you're bored and you want to go listen to episodes from last year, they're up, but we haven't been we haven't been razor showing uh this offseason yet. So Nick Underhill was the other writer, obviously up with us at the at the athletic, and Nick has now moved back down to New Orleans. So It's just Jeff and I right now and we're we're not doing much. I'm just an in-season writer, so I'm not really doing a whole hell of a lot right now. But if you're bored and you want to go look at old stuff, it's it's all there archived. Let's put it that way.",
    "timestamp" : "01:07:29-01:08:11"
  },
  {
    "timestamp" : "01:08:12-01:08:15",
    "speaker" : "Andy",
    "text" : "Yeah, we'll throw a link in the show notes for that. Yeah. All right, Matt."
  },
  {
    "timestamp" : "01:08:15-01:08:29",
    "speaker" : "Matt Chatham",
    "text" : "Still doing Nessen. Nesson's the plug. There you go. So Nessen is uh we're I think we're actually starting to well but this is gonna be The show will be shown later, so maybe not by then. Maybe by then we'll actually be on on TV again. Who knows? But right now we're just doing the from home stuff."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh man. Beautiful. All right. Well, thank you again, Matt. This has been fantastic. Yeah, it's been awesome for myself. My pleasure. Thanks for having me with us. Yeah. My pleasure. Alright, yeah. Take care, guys. Take care. Take it easy. Bye now. Bye-bye.",
    "timestamp" : "01:08:31-01:08:53"
  }
]