[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid. You still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:19"
  },
  {
    "speaker" : "Andy",
    "text" : "Welcome back to the Patriots Dynasty Podcast. Week 17. We're actually keeping track. And we are down in North Carolina, we've decided. That's right. For Patriots at Panthers. Last game of the regular season. A lot on the line here, at least for the Patriots, not so much for the Panthers, which we'll get into. But before we do, gentlemen, how are you?",
    "timestamp" : "00:21-00:48"
  },
  {
    "speaker" : "Greg",
    "text" : "Doing fantastic.",
    "timestamp" : "00:48-00:50"
  },
  {
    "timestamp" : "00:50-00:56",
    "speaker" : "Andy",
    "text" : "Moy Bien. Okay, you guys you welcome to my hometown. That's right, yeah. We're down."
  },
  {
    "timestamp" : "00:56-00:58",
    "text" : "Go on a raise up.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Take your shirt off.",
    "timestamp" : "00:59-01:00"
  },
  {
    "timestamp" : "01:01-01:03",
    "speaker" : "Andy",
    "text" : "Something about North Carolina or South Carolina?"
  },
  {
    "speaker" : "Steve",
    "text" : "I think he says for all Carolinas.",
    "timestamp" : "01:04-01:06"
  },
  {
    "text" : "Does it?",
    "timestamp" : "01:06-01:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07-01:15",
    "speaker" : "Greg",
    "text" : "No. Yeah. No. It's North Carolina. Yeah? PD P North Carolina. Yeah, yeah."
  },
  {
    "timestamp" : "01:15-01:21",
    "speaker" : "Andy",
    "text" : "South Carolinas get uh get offended if you m confuse them. Because we know North Carolina's do."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:22-01:31",
    "text" : "Dude, people get Pissed off if you call Raleigh Durham one thing. Really? Really? Yeah. And they're like, this is an airport called the Raleigh Durham Airport."
  },
  {
    "timestamp" : "01:33-01:34",
    "text" : "They consider them two separate cities",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:34-01:38",
    "speaker" : "Greg",
    "text" : "They are two separate cities. You son of a bitch."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:40-01:42",
    "text" : "They're literally like right next to each other."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Well they're like 15, 20 miles apart. Yeah.",
    "timestamp" : "01:42-01:47"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true.",
    "timestamp" : "01:47-01:48"
  },
  {
    "text" : "And then those fucking losers over in Chapel Hill. Yeah. Yeah.",
    "timestamp" : "01:48-01:53",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:53-01:58",
    "speaker" : "Andy",
    "text" : "And now you live in Durham. So you are kind of the expert on what to call it."
  },
  {
    "text" : "That's right.",
    "timestamp" : "01:58-01:59",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "02:00-02:03",
    "speaker" : "Andy",
    "text" : "So stat check, what what do we call that area?"
  },
  {
    "speaker" : "Greg",
    "text" : "The triangle. The whole area? Just Steve is correct. It's called the triangle. All right, great.",
    "timestamp" : "02:04-02:13"
  },
  {
    "timestamp" : "02:13-02:19",
    "speaker" : "Andy",
    "text" : "What are the three points of the triangle? Raleigh, Durham, and who the hell cares? Charlotte."
  },
  {
    "speaker" : "Greg",
    "text" : "Wait. Nope. Nope.",
    "timestamp" : "02:19-02:21"
  },
  {
    "timestamp" : "02:21-02:23",
    "text" : "Chapel Hill. There you go, Andy.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "All right.",
    "timestamp" : "02:24-02:24"
  },
  {
    "timestamp" : "02:25-02:28",
    "text" : "You know they call those only cities in North Carolina, right?",
    "speaker" : "Andy"
  },
  {
    "text" : "You know what they call where I live? The same version of the triangle? What? The triad. No, the DMV.",
    "speaker" : "Steve",
    "timestamp" : "02:28-02:36"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:37-02:39",
    "text" : "Oof. Wait. That's not a great nickname."
  },
  {
    "text" : "Maryland, Virginia, Delaware. No. No? Delaware? DC?",
    "timestamp" : "02:39-02:47",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:47-02:50",
    "text" : "Yeah, the district, Maryland and Virginia. Yeah."
  },
  {
    "timestamp" : "02:50-02:57",
    "speaker" : "Andy",
    "text" : "With the district. You know what they call where I live? Cow Hampshire. Londonderry."
  },
  {
    "speaker" : "Steve",
    "text" : "Vegas.",
    "timestamp" : "02:58-02:59"
  },
  {
    "text" : "Majganistan. That's probably more accurate these days, yeah.",
    "timestamp" : "03:00-03:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "We couldn't afford a house in Derry, so they moved us to Londonderry.",
    "timestamp" : "03:05-03:09"
  },
  {
    "text" : "Uh well speaking of angry North Carolinans, we actually know one. So we thought we'd have him on the podcast to talk about his home team. Oh, Bobby. Enjoy that right now So with us today we have a special guest. Uh it is our I'd say top three brother-in-law, would you boys agree?",
    "speaker" : "Andy",
    "timestamp" : "03:12-03:43"
  },
  {
    "text" : "Top two, come on.",
    "speaker" : "Bob",
    "timestamp" : "03:44-03:44"
  },
  {
    "text" : "Top five. But it is it is our sister's husband, Ellie's husband, Bobby Bridges. And this is the point where Gregory says his name with the answer Oh Bobby. There it is. Oh what the hell? So um my first question that leads into my first question which is uh Bob we we didn't have a choice to be in the Brown family, but you did and you chose this. Why?",
    "timestamp" : "03:45-04:13",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Bob",
    "text" : "Well, I regret it every day, but at this point I'm stuck. Um No, you you guys are great. I mean obviously I love Ellie, but uh the family is a nice icing on the cake.",
    "timestamp" : "04:15-04:26"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "04:27-04:31",
    "text" : "Hey you're you're the icing on the cake too, Paul. Thanks, Greg."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:36-04:46",
    "text" : "Yikes. So Bob, uh, for those of you who don't know, uh born and raised in I wasn't North Carolina? I can never remember which Carolina, Bob."
  },
  {
    "speaker" : "Bob",
    "text" : "They're not the same, Andy, but I'll I'll I'll I'll handle that early slight and just move on. Uh I'm from North Carolina.",
    "timestamp" : "04:47-04:53"
  },
  {
    "text" : "No, it's at least I got it right.",
    "speaker" : "Andy",
    "timestamp" : "04:54-04:55"
  },
  {
    "speaker" : "Bob",
    "timestamp" : "04:56-04:56",
    "text" : "You did."
  },
  {
    "timestamp" : "04:57-04:59",
    "text" : "I had a fifty-fifty shot.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "04:59-05:01",
    "text" : "How far from Charlotte were you, Bob?",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh about an hour. All right.",
    "timestamp" : "05:01-05:03",
    "speaker" : "Bob"
  },
  {
    "timestamp" : "05:04-05:07",
    "speaker" : "Andy",
    "text" : "But you were kind of in the in the woods of North Carolina, right?"
  },
  {
    "speaker" : "Bob",
    "timestamp" : "05:07-05:08",
    "text" : "That is true."
  },
  {
    "timestamp" : "05:08-05:10",
    "text" : "Uh does your town have a name?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "05:11-05:14",
    "speaker" : "Bob",
    "text" : "Rumor has been we even have a post office, my friend."
  },
  {
    "timestamp" : "05:14-05:16",
    "text" : "Oh, is that new?",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh a little bit.",
    "timestamp" : "05:16-05:18",
    "speaker" : "Bob"
  },
  {
    "timestamp" : "05:20-05:35",
    "speaker" : "Andy",
    "text" : "All right. So so you grew up in kind of the woods of of North Carolina. Um and and The Panthers weren't a thing until you were probably what like nine or ten, I would think. They came in the league in ninety five."
  },
  {
    "speaker" : "Bob",
    "timestamp" : "05:35-05:37",
    "text" : "I mean ninety-five, so I was ten. That's right."
  },
  {
    "text" : "So then did you get into football with the Panthers or were you already a football fan?",
    "timestamp" : "05:38-05:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "05:45-07:12",
    "text" : "I would say more or less with the Panthers. I would say the the as I remember it now, um I was like sort of a sports fan, but like when I was a kid, like young, it was all the Braves. My dad loved the Braves, watched the Braves all the time. Uh, and you know, this was their heyday. This was like Maddox, Glavin, those guys. I remember watching the last out of the World Series we won in '95. So I was all about the Braves, you know, you've got college basketball, everybody talks about UN Seek going on. And then honestly, at this time, I was a Hornets fan. So I remember my dad me to a game. in one of those years and around that time period with a a friend of his who got tickets and going to see the Hornets playing uh Michael Jordan and the Bulls. And I remember that I've still got the ticket saved. Um in like my scrapbox thing. Anyway, so football is far off the radar. Like my grandpa was a Redskins fan, and like the Redskins were kind of the team of the territory. But I didn't really pay attention to it. We didn't have a team. It was like baseball. And then I was personally a little bit into the hornets. And you know you had other stuff going on. So no. Football not on the radar at all as far as the L's concerned. But Oh yeah, unofficially, but big time. I think arguably geographically, yeah, but like culturally that that was the thing. Like it there there's still a little bit of friction there. There are still like holdout red skins.",
    "speaker" : "Bob"
  },
  {
    "speaker" : "Greg",
    "text" : "Wow. Dude, there aren't even Redskins fans in DC anymore. Oh I I had a question about the Hornets. Is that the Muggsy Boggs era?",
    "timestamp" : "07:14-07:26"
  },
  {
    "speaker" : "Bob",
    "text" : "Biz. Good memory.",
    "timestamp" : "07:27-07:28"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "07:29-07:30",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "07:30-07:42",
    "speaker" : "Bob",
    "text" : "Yeah. Anyway, the way it played out was basically like, you know, this is a couple of years down the road, but when the Hornets thing happened and then they fucking left and everybody was pissed. Right. Um Oh wait, hey, we're allowed to curse on this podcast."
  },
  {
    "speaker" : "Mom",
    "text" : "Oh yeah.",
    "timestamp" : "07:42-07:42"
  },
  {
    "text" : "Oh fuck yeah. Anyway, when the fucking hornets owner fucking left town, um I was already starting to get into the Panthers, you know, they have that early burst of success in their second season.",
    "timestamp" : "07:42-07:53",
    "speaker" : "Bob"
  },
  {
    "timestamp" : "07:53-07:56",
    "speaker" : "Speaker 6",
    "text" : "They did. Didn't the Jaguars as well?"
  },
  {
    "timestamp" : "07:57-08:08",
    "speaker" : "Bob",
    "text" : "But man, the Hornets leaving and then the Braves dynasty kind of falling apart. It was like perfect timing for me than going to high school. It was like then all of a sudden all in on the Panthers and the football."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:08-09:12",
    "text" : "All right. Yeah, because yeah, like Steve, like Bobby was saying, um the second year for both because they both came in in ninety-five and in both teams second year randomly, they both made it to the conference championship of each uh each conference obviously. Yeah. So so actually both teams lost to the obviously the eventual teams won Super Bowl and that was the Super Bowl that the Patriots played the uh Packers. Yeah. So But that was kind of a a strange thing, where it because it was a bit of an anomaly too. They they didn't have a winning season Outside of that for a while. Like in 90 they started ninety-five, they had that winning season in ninety-six, and then the next one wasn't until 2003. Who was their quarterback? Burline. And before that, Greg?"
  },
  {
    "text" : "Uh I have no idea.",
    "timestamp" : "09:13-09:15",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Started with the team. How about Bob? Do you know who the original starting quarterback for the Carolina Panthers was?",
    "timestamp" : "09:15-09:21"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "09:21-09:22",
    "text" : "Oh, I don't remember."
  },
  {
    "text" : "It was one Kerry Collins.",
    "timestamp" : "09:22-09:24",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "09:24-09:27",
    "speaker" : "Bob",
    "text" : "I was gonna say, because first pick, right?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I think so.",
    "timestamp" : "09:27-09:28"
  },
  {
    "speaker" : "Bob",
    "text" : "Wait, no, I we didn't pick him in the very first year, did we?",
    "timestamp" : "09:28-09:32"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, ninety-five. But he wasn't one overall. He was five for some reason.",
    "timestamp" : "09:32-09:37"
  },
  {
    "text" : "Fair enough. Yeah, that's a whole nother story with that fucking guy and his drunken nonsense. My dude used to drive there were there was a re Really?",
    "timestamp" : "09:39-09:51",
    "speaker" : "Bob"
  },
  {
    "timestamp" : "09:52-09:53",
    "speaker" : "Greg",
    "text" : "Oh, so he fits right in in Carolina."
  },
  {
    "speaker" : "Bob",
    "text" : "Well it was super annoying actually when he when he Easy now. It was anyway, it was super annoying when he went to the Giants and like semi-resuscited career for a few years. Everybody was like, Really this fucking washout asshole?",
    "timestamp" : "09:54-10:06"
  },
  {
    "text" : "Yeah. Goodness. So yeah, so we're we're kind of getting into the the the Panthers right now in 2001. And this is the end of the George Seaford era. Did you have any comments about that? Because I actually read about George Seafort recently randomly. Because I mean",
    "speaker" : "Andy",
    "timestamp" : "10:06-10:27"
  },
  {
    "timestamp" : "10:27-10:54",
    "speaker" : "Bob",
    "text" : "When you first pitched this, like I probably would have done it no matter what the game was, but when you told me when it was, I was actually I was actually kind of excited to do this because the thing you have the interesting thing about this game is like It's it's kind of interesting what we just talked about with the Bagwars connection and like the randomness and like the connections. Because then this moment was like This was the very this this was the lowest moment in the entire franchise's history."
  },
  {
    "timestamp" : "10:54-10:56",
    "speaker" : "Greg",
    "text" : "Yeah. This game could qualify, right?"
  },
  {
    "text" : "This this game truly. It was like the capstone of the lowest period. So like end of Seaford, the one in 15 season that was ultra embarrassing. Uh it was like winning that first game against Minnesota. We lost 15 straight. Um the team totally gave up on George Seaford, which is like kind of the subtext of all of it. Like truly they s they like literally weren't playing at that point. Guys were not like showing up and trying hard, guys were faking injuries. It was like super embarrassing because like the team had that initial high and like folks in the Carolinas were really excited. And I remember that being like a really embarrassing low point of like are they gonna lose the fan base? I actually looked this up today in prep for this. That that final game, this game against the Pats, I think they only had sixteen thousand people in attendance. And so there were Yeah, well it was it wasn't just that they were bad, it was like it was that they openly gave up. And like that was the public talking point of like how embarrassing this team and this coach and the morale were. Um the other thing that happened here is the Ray Caruth thing overshadowed all this. Do you guys remember that?",
    "timestamp" : "10:56-12:01",
    "speaker" : "Bob"
  },
  {
    "text" : "Oh, that was this year.",
    "speaker" : "Andy",
    "timestamp" : "12:01-12:02"
  },
  {
    "timestamp" : "12:03-12:22",
    "speaker" : "Bob",
    "text" : "No, it wasn't well, the incident wasn't this year. That was ninety-nine, but this it was still playing out. And I remember I looked it up today to confirm this. It was in this middle of this shit show season that he was actually convicted. Wow. And so that got all dredged back up, and it was just like the fucking low point for the franchise."
  },
  {
    "text" : "Yeah. Good Lord.",
    "timestamp" : "12:23-12:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Bob",
    "text" : "I mean we got Chris Wankey trotting himself out there. Oh man, the team game up. But the interesting thing is then after this was is what began really like I mean, in my personal like kind of experience the golden age of Panthers football, like and you know, interestingly, it put us on a crossroads to meet again in that Super Bowl two years later, the Jake Delum era.",
    "timestamp" : "12:25-12:45"
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly.",
    "timestamp" : "12:45-12:45"
  },
  {
    "timestamp" : "12:48-12:54",
    "speaker" : "Bob",
    "text" : "Um this was then me going right from end of high school into college and and all those seasons, which I remember quite fondly."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and um just to go back to CIFA real quick, I I was reading, and I was reading because it's the uh we're all lockdown right now. But I was reading a book by Mike Lombardi, who was the old GM of the Patriots. And before that he was actually the GM of the Forty Niners and his whole thing about Seafort was that uh 'cause he he took over for Walsh and the Forty Niners when the well Bill Walsh when they were winning all those Super Bowls and everything and they were that dynasty. And he took over from them and basically what he was saying is that he knew how to run that system, but he didn't know how to create it himself. So Bill Walsh created this system and ran it successfully with Montana forever. And then Seaford took over and kept it going. And won a C Super Bowl the first year he in like when he was the head coach of the 49ers. Uh got to the conference championship a few times. won another Super Bowl and then lost in the division around a couple times and then moved on. And that was like moving from Montana to Young and everything like that. So I think From what I remember of him coming in, there was a lot of high hopes from from Carolina Panth Panthers fans. Is that is that something you remember or Am I just making that up as like an outsider?",
    "timestamp" : "12:55-14:12"
  },
  {
    "speaker" : "Bob",
    "timestamp" : "14:12-14:40",
    "text" : "No, that's right. I mean it was interesting because he like Richardson, who is the owner of at the time, um, was like already known as a pretty patient owner. And so, you know, we started out with Dom Capers who like, say what you want about the guy was like pretty popular and pretty energetic and like the seemed to that initial success and like was you know, it didn't work out and he had a bunch of like kind of bad mediocre to bad seasons and left, but like he was generally liked and respected for like starting the franchise."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "14:40-14:40"
  },
  {
    "speaker" : "Bob",
    "text" : "And then they they clearly at that moment had like higher hopes. And we're kinda aimed big and we're like, we're gonna get this like Coach Griffith Championship pedigree. We think our team around quickly And then it was just a shit show. And it was really clear this is a guy who was used to coaching basically ready-made championship teams, which News Flash was not the Carolina Panthers circa 2000.",
    "timestamp" : "14:40-15:01"
  },
  {
    "text" : "This is true. So I think outside of this well actually no before I get to that. Um as a Panther fan, how do you view the Patriots? Like I what what do you think of the Patriots?",
    "timestamp" : "15:03-15:18",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Bob",
    "text" : "Yeah, I mean you don't have to hold back.",
    "timestamp" : "15:22-15:25"
  },
  {
    "speaker" : "Andy",
    "text" : "This is a uh a pro pages podcast, but where we scan the the the whole gamut of their cheaters to the wrong.",
    "timestamp" : "15:26-15:36"
  },
  {
    "timestamp" : "15:36-16:20",
    "speaker" : "Bob",
    "text" : "So Yeah, I don't think there's honestly a lot there. I mean You know, that Super Bowl we played was, you know, at the end of the day, it kind of gets forgotten in the in the whole big sp spectrum of things. But like it ended up being a really exciting game. Um And you know, we were like clear underdog in that game and ended up like coming within, you know, the field goal. Yeah. And so it's not like they were like hard feelings per se. And then beyond that, it's like then how often do we meet? You know what I mean? It's like NFC, AFC. The only other game I really remember in all the stretch was like, I think 2013. 13 or 15, but I think 13. We have this game where we played you guys. Oh yeah. I just remember the equally non-called hold on Kowski in the end zone to win that game."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, we all remember that too.",
    "timestamp" : "16:20-16:22"
  },
  {
    "speaker" : "Bob",
    "text" : "Uh yeah, yeah, I remember that one.",
    "timestamp" : "16:23-16:25"
  },
  {
    "speaker" : "Greg",
    "text" : "And Brady was yelling at the refs on the way out. I remember pissed. And Belichick.",
    "timestamp" : "16:26-16:31"
  },
  {
    "text" : "Super pissed.",
    "timestamp" : "16:31-16:32",
    "speaker" : "Bob"
  },
  {
    "speaker" : "Greg",
    "text" : "So was it pass interference, Pop?",
    "timestamp" : "16:32-16:34"
  },
  {
    "timestamp" : "16:35-16:42",
    "text" : "It was I mean it was definitely clearly within the boundaries of being called a hold.",
    "speaker" : "Bob"
  },
  {
    "timestamp" : "16:42-16:48",
    "speaker" : "Greg",
    "text" : "Okay. Fair. But you don't get every call, you know. That's you don't you don't get every call."
  },
  {
    "timestamp" : "16:48-16:55",
    "speaker" : "Bob",
    "text" : "It's end of the game. Yeah. It's gonna like make or break the it was like liter clearly the game will Like ending play, you're it was home in Carolina."
  },
  {
    "text" : "Yeah. Yeah. And then they review it and then they're like, uh, we're gonna Let it stand, fuck it, whatever.",
    "timestamp" : "16:55-17:06",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Bob",
    "text" : "I mean to be clear, also a super fucking legit play from Keekly, who knew what he was doing. Yeah. And could have been called a hole.",
    "timestamp" : "17:06-17:13"
  },
  {
    "timestamp" : "17:14-17:23",
    "text" : "Yeah. And m I think he probably took a calculated risk knowing that it was Gronkowski and you may as well because there are Times where he get the call.",
    "speaker" : "Andy"
  },
  {
    "text" : "You either do everything you can or this motherfucker is fucking spiking on your fucking face.",
    "speaker" : "Bob",
    "timestamp" : "17:24-17:28"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:29-18:12",
    "text" : "Exactly. So I was I was looking this up too, and I feel like outside of this one game in 2001, the Patriots and Panthers don't really play like boring games. You know there was uh there was one in two thousand nine apparently that I don't remember at all. The Patriots won at home twenty to ten, but the other ones It was 2013 is the one we're talking about. 2420 with the the Luke Keegley. It was twenty seventeen, more recently. I think that was one of um Stefan Gilmore's first games, wasn't it?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "18:12-18:13",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:13-18:17",
    "text" : "And uh the Panthers got exposed. Yeah, exactly."
  },
  {
    "timestamp" : "18:17-18:17",
    "speaker" : "Greg",
    "text" : "Yeah"
  },
  {
    "timestamp" : "18:18-18:59",
    "speaker" : "Andy",
    "text" : "And the Panthers won that one right, the N 3330 on some dubious um there was like a defensive holding penalty called After uh Cam got sacked on third down or something like that. He kept the drive alive and then went and kicked the the field goal. And then of course the Super Bowl. So There haven't been many games where they haven't been exciting. So I th I I almost when I was looking this up, kind of wanted to put the Panthers in that kind of low-key uh Uh nemesis isn't the right word, but just kind of like it is almost a bit of a rivalry, even though they don't play each other very often"
  },
  {
    "text" : "It's true, although this this game and that team are long dead. I mean, I would now thinking back about this put Panthers history in three eras and this game was the very this was the dead end of the first era of Panthers football.",
    "speaker" : "Bob",
    "timestamp" : "18:59-19:12"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:13-19:13",
    "text" : "Okay."
  },
  {
    "text" : "And then the John Fox era was really the second era. And then the like Ron Rivera Cam Newton era, which honestly maybe is now Maybe we call it the end of the third era right now. Anyway, those those are the errors so far.",
    "speaker" : "Bob",
    "timestamp" : "19:13-19:25"
  },
  {
    "timestamp" : "19:25-19:34",
    "speaker" : "Greg",
    "text" : "Yeah. Apparently that the The Panthers have sold out every home game since two thousand and two. So starting in that second era. Wow."
  },
  {
    "speaker" : "Bob",
    "text" : "Yeah, that makes sense. That makes sense from my perspective, from a like upward trajectory of the franchise and like So what I said about the Redskins thing earlier, like, that was like that was an actual conscious narrative by the franchise at that time. Like they knew they were constantly under threat to actually win fans over. And there were a lot of conscious decisions. So calling them the Carolina Panthers was a very calculated decision. Like they've been in Charlotte, North Carolina. And Charlotte's, you know, semi-on the border, but it was very conscious to try to grow a large fan base, knowing they had an uphill battle decline. with college basketball, with the Redskins, with baseball. Um and honestly, it's really since 2002 and up that they've actually been able to successfully like they basically put that argument rest that they weren't going to be able to thrive as a small market franchise.",
    "timestamp" : "19:34-20:18"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I would agree with that. So so is Charlotte a Pantherstown? Just cause Raleigh, Raleigh Durham, not really, in my experience. So I live in Durham and that is definitely like college basketball. Yep. Like UNC, Duke, NC State are definitely the highest priority. Football fans that are local are probably they're like, yeah, I'm a Panthers fan, but it's not like You get Patriots fans back home who are like ride or die, you know. Mm-hmm.",
    "timestamp" : "20:18-20:55"
  },
  {
    "timestamp" : "20:55-21:13",
    "speaker" : "Bob",
    "text" : "I think that's totally true. And I think that that part of the state will always put college sports first and foremost. I think Charlotte and Western North Carolina are different. And honestly, the thing that gets forgotten to what I just said is like put A huge part of their fan base is South Carolina, which has always been more football territory anyway."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "21:13-21:13",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "21:14-21:29",
    "text" : "Um and like they do draw a huge base of their support there. Um particularly like the black portion of the fan base. is really really heavily draws on like the black population of South uh Carolina, which is part of the reason why CAM has been such a big deal.",
    "speaker" : "Bob"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "21:29-21:30"
  },
  {
    "timestamp" : "21:33-21:36",
    "speaker" : "Greg",
    "text" : "So you are you glad Cam's gone?"
  },
  {
    "text" : "No, I'm super sad.",
    "speaker" : "Bob",
    "timestamp" : "21:36-21:37"
  },
  {
    "timestamp" : "21:38-21:40",
    "speaker" : "Greg",
    "text" : "Good. Hey, we get it."
  },
  {
    "timestamp" : "21:40-21:44",
    "speaker" : "Bob",
    "text" : "It's it's a very it's a very sad moment for the franchise and for everybody."
  },
  {
    "text" : "Yep. What do you think about Bridgewater?",
    "speaker" : "Andy",
    "timestamp" : "21:44-21:47"
  },
  {
    "timestamp" : "21:47-22:22",
    "text" : "I mean, it's a savvy signing. Like, you know, if you look at the market and where the league's at right now, sure. It's like a decent contract. It's like It makes sense. And like, you know, you got to view this through the prism of newish owner who wants to make his mark and new coach. Sure, fine. But at the same time, from a standpoint of what we've accomplished, like it's tough. And it's really sad to see things end this way. And You know, the injuries really derailed the last two years and like I still look back on that stupid ass preseason game last season when they played Cam and didn't need to and he hurt his foot.",
    "speaker" : "Bob"
  },
  {
    "text" : "Yeah, against the past.",
    "timestamp" : "22:21-22:22",
    "speaker" : "Greg"
  },
  {
    "text" : "Um it's just like you can't help but wonder how things play out differently with everybody, with Ron, with Cam the season. It's like hard to stomach that. And I've been a little on the outside of it the last year and a half, but It's just it's just tough thinking about it should have played out differently. And Cam, uh, can I mean I I would posit Cam's the most important player in franchise history in many ways And he doesn't get, I think in retrospect it'll be interesting to see how his narrative plays out because it's tough because he's been under constant fire the whole time. that he's been our quarterback and a lot of it has been undeserved in my opinion.",
    "speaker" : "Bob",
    "timestamp" : "22:22-22:59"
  },
  {
    "text" : "Yeah. I agree. I don't know if he he doesn't like Do himself that many favors with his dude puts his foot in his mouth five times a season, but and he it the way like his have you seen his like Cryptic uh font. Oh yeah. Oh man.",
    "timestamp" : "22:59-23:16",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Bob",
    "text" : "This font is so stupid. Like like honestly, if I could talk to Cam, I would be like, hey man, look, I love you. And let me tell you all the reasons why I'm a huge fan. Also, let me tell you three stupid ass things you can think don't help you call us, man. Can you just cut that shit out?",
    "timestamp" : "23:16-23:28"
  },
  {
    "timestamp" : "23:28-23:30",
    "speaker" : "Steve",
    "text" : "Let's hear let's hear the three things, Bob."
  },
  {
    "speaker" : "Bob",
    "text" : "Yeah. Well the the the fucking Instagram font or whatever it is. I you know I don't do the social media thing, but the f I knew what the font is and it's dumb. Um I don't know man. You know, the fashion thing's interesting. I I think it's more the like he didn't do himself favors early on with like the pouting And it's like, hey man, it's actually good for you to be fucking pissed, but you're not taking notes on how that's accepted. Like Brady can be pissed. But like you you can't you can't it it just came across as pouty early in his career and I think it's from a guy who like was used to just being successful. Yeah. Um and like honestly it the thing that the narrative that was wrong was that it impacted the team because I really don't think it ever did. I think that the players always had his back and understood where he's coming from and took it the right way of my dude really fucking wants to win. Um but from a broader narrative standpoint he just like that that shit really sank him. But then I mean Th we could spend a whole nother podcast going into ha the the way which all of this shit was unfairly judged through a through a lens of race and like the the way his like charisma and sort of defiance and like fashion, like honestly all of that stuff is like he's really unfairly criticized for.",
    "timestamp" : "23:30-24:46"
  },
  {
    "timestamp" : "24:46-24:49",
    "speaker" : "Andy",
    "text" : "Sounds like you start your own podcast, Bob."
  },
  {
    "text" : "Yeah, maybe.",
    "timestamp" : "24:49-24:50",
    "speaker" : "Bob"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:50-25:03",
    "text" : "Maybe one day. Plenty of time on your hands. All right, so my last question, we may have already touched on this. Um, what is your favorite Patriots Panthers game?"
  },
  {
    "speaker" : "Bob",
    "text" : "Hmm Favorite Patriots Panthers game. Uh yeah, we kinda talked through them a little bit. I I mean, the honorable mention, that two thousand thirteen game I remember well. Ellie and I were living in Williamsburg. I was watching on my T V and I remember it you know you have those memories watching a football or any sports where like a game happens and like you win or or whatever happens and like You just have that fucking high. Like I remember I it was like it was like I think it was Sunday night football and it was like mad fucking late. It was like 11. I had to be up ridiculously early for school the next year. I drank like fucking eight beers or something. I was like, this is stupid. I'm gonna feel like shit tomorrow. But I had to just I just like had to go out. I like went and fucking took a walk around the neighborhood and put my headphones in because I was just so jacked up. Um and I just remember that. But that I mean I still can't put that in first place because like that Super Bowl in 2003 just meant so much. Like it really just sparked for me personally, it sparked like a turbocharged phase of like I mean, I would say Panthers and football, but honestly sports fandom in general. Like I don't Without that, I don't know if I become a read ESPN ever several times every day, kind of sports fan. I really don't.",
    "timestamp" : "25:03-26:15"
  },
  {
    "text" : "Yeah, I would agree with you. Probably what happened to me too in two thousand one with the Patriots getting the first time.",
    "timestamp" : "26:16-26:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:22-26:24",
    "speaker" : "Greg",
    "text" : "Yeah, I was gonna say it's gotta be some parallel there, right?"
  },
  {
    "timestamp" : "26:25-26:26",
    "text" : "Yeah, absolutely.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. I've always thought that of like would I be a huge football slash Patriots fan if it wasn't for the Pats? Right. It was Red Sox City before all this happened, you know? Mm-hmm.",
    "timestamp" : "26:26-26:38"
  },
  {
    "timestamp" : "26:39-26:51",
    "speaker" : "Andy",
    "text" : "Oh yeah, the Patriots were always that laughing stock of No, they'll eventually fuck this up somehow. It's just a matter of how they're gonna do it. Yeah. Which I think is probably pretty common in a lot of a lot of towns with a lot of sports too, you know? A lot of teams."
  },
  {
    "speaker" : "Speaker 6",
    "text" : "I was like Bob with the Bruins when I was a little kid. I have my first Bruins game ticket for 97 when the Fleet Center opened.",
    "timestamp" : "26:52-26:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "26:59-27:00"
  },
  {
    "timestamp" : "27:01-27:02",
    "text" : "Fleet Center. Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "27:02-27:11",
    "speaker" : "Andy",
    "text" : "Right. Jesus, that's a throwback. Alright, do you boys have any other questions for Bob? Oh yeah. Alright, let's hear it."
  },
  {
    "speaker" : "Speaker 6",
    "text" : "Uh who's your favorite Panthers player, both all time and now?",
    "timestamp" : "27:11-27:16"
  },
  {
    "speaker" : "Bob",
    "text" : "All time is Steve Smith. Um he really represented that second era of Panthers football in so many ways. It was like the underdog status, the chip on his shoulder. It was the fact that like the Panthers don't have a lot of swagger, but Steve Smith had a fucking mountain of swagger and wasn't afraid to tell you. Um there's just so many moments, like Uh I I always remember the moment when he like destroyed Fred Smoot on the Vikings and ruined his career and told him to ice up after the game.",
    "timestamp" : "27:18-27:48"
  },
  {
    "text" : "I forgot about that.",
    "timestamp" : "27:48-27:50",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:50-27:59",
    "speaker" : "Bob",
    "text" : "Well, in the in the playoff run they went to the Super Bowl, the play that I'll always remember is we played the Rams in the divisional round and it went to like double overtime."
  },
  {
    "timestamp" : "27:59-28:00",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "text" : "And that was like low-key, you know, it's interesting. It was past the like um great show on turf rams, but it was still like kind of the remnants of that with Mark Bulger. And they were 12 and 4 that year and like on paper a lot better than us. And I remember double overtime. I just remember the it was like I I think it was the first play of double overtime. And it was just like Steve Smith, um, straight up, slant route, up the cut through the cornerback and the safety, just streaking down the field, catching the ball into the end zone. And like I was watching the play at some friend's house and uh Things got heated, right? It was a back and forth game. Um, but I I'll I'll never forget that play. And I remember my friend's mom after that. We were over there with a bunch of guys, not all of whom were actual football fans It was like me and my friend Daniel and a bunch of other kids we just hung out with. And after the game, my friend like everybody gradually moved away from the room that I was watching the game in because of you know, my composure. Um I remember my friend's mom saying to me later after that game, she's like, if the Panthers had if the Panthers had lost this game, I don't I don't think I would have let my son's hanging out with you anymore. So definitely, definitely Steve Smith. Like he's he's in my mind the most iconic player in Britain.",
    "speaker" : "Bob",
    "timestamp" : "28:00-29:14"
  },
  {
    "text" : "And funnily enough, his first season was this two thousand and one season.",
    "timestamp" : "29:15-29:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Bob",
    "text" : "It was, it was, and made the Pro Bowl as a as a return man.",
    "timestamp" : "29:19-29:22"
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly, yeah.",
    "timestamp" : "29:23-29:23"
  },
  {
    "timestamp" : "29:23-29:27",
    "text" : "But then two thousand three was the Super Bowl season was really his breakout of the receiver.",
    "speaker" : "Bob"
  },
  {
    "timestamp" : "29:28-29:28",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Bob",
    "text" : "Yeah, we actually started to catch balls. Yeah. Current, I mean, if we're counting last season, um I mean, wow, Keekly. It's just like, I'm not ready to process his retirement. So I'll put that there. But honestly, like also low-key, like Greg Olson, and he's one of the rare players who's come to the Panthers who has a transplant who wasn't drafted by us, has become, I would argue, like in the like We might go so far as like top ten Pantheon in terms of like important voices for the franchise.",
    "timestamp" : "29:28-30:00"
  },
  {
    "text" : "Wow, who drafted Greg Olson?",
    "timestamp" : "30:01-30:02",
    "speaker" : "Speaker 6"
  },
  {
    "text" : "Uh the Bears.",
    "speaker" : "Bob",
    "timestamp" : "30:04-30:05"
  },
  {
    "speaker" : "Speaker 6",
    "timestamp" : "30:05-30:09",
    "text" : "Oh. Oh, that's right. Yeah, they did, yeah. I've always associated with the Panthers."
  },
  {
    "text" : "Yeah, you see, exactly. Yeah. And I don't I can't really think of another guy for the Panthers who's in that level with the franchise who we didn't draft Like they low-key have had a lot of success with like franchise level players they've drafted. Transplants, not so much. Um, which is why I think Olson stands out so much. And like it's also an indicator of like how sour things have gotten in the past three to four years with ownership and and the management that like he went out pretty vocally being like, yeah, fuck these guys. And like When Cam posted his shit about recently about like don't try to pretend like I asked you for this trade, all of a sudden like responded to that shit and was like, yeah, that sounds right. Um And like Olsen has enough capital to publicly fucking call the team out on shit like that. But anyway, sad to see both those guys go.",
    "speaker" : "Bob",
    "timestamp" : "30:09-31:01"
  },
  {
    "timestamp" : "31:01-31:13",
    "speaker" : "Andy",
    "text" : "So it's it's it kind of almost feels like another parallel with the Patriots this year and they're it feels like they're almost kind of cleaning house as well with with Brady leaving and Everybody else seeming to be getting signed otherwise."
  },
  {
    "timestamp" : "31:13-31:15",
    "speaker" : "Bob",
    "text" : "Yeah, new era, man."
  },
  {
    "text" : "Yeah. So We feel your love.",
    "timestamp" : "31:15-31:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "31:19-31:24",
    "text" : "Who's your least favorite Panther? Also Steve Smith."
  },
  {
    "speaker" : "Bob",
    "timestamp" : "31:24-31:27",
    "text" : "That's a really interesting question. Oh man."
  },
  {
    "timestamp" : "31:27-31:28",
    "speaker" : "Greg",
    "text" : "There's a lot."
  },
  {
    "speaker" : "Bob",
    "text" : "The fact that you haven't already said, Bob. No, I'm trying to think about that for a moment of like who pissed me off the most.",
    "timestamp" : "31:31-31:37"
  },
  {
    "speaker" : "Greg",
    "text" : "Jimmy. Jimmy Clausen.",
    "timestamp" : "31:37-31:39"
  },
  {
    "timestamp" : "31:40-31:51",
    "speaker" : "Bob",
    "text" : "Pawson was just like not to even be considered a, you know what I mean? She's like, this guy, get the fuck out. Um, Lee's favorite Panther. Man, who was really frustrating over the years?"
  },
  {
    "text" : "I mean Greg Hardy, but that was more like What an idiot.",
    "timestamp" : "31:52-31:57",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Bob",
    "text" : "Yeah, yeah.",
    "timestamp" : "31:57-31:58"
  },
  {
    "timestamp" : "31:58-32:00",
    "speaker" : "Greg",
    "text" : "Not like frustrating as much as like fuck that guy."
  },
  {
    "speaker" : "Bob",
    "text" : "Yeah, no, what a what a what a just like not good person. Um I would say least favorite panther I'm trying to figure out the guys. There were always the guys who you never trusted, right? Like in the big moment who were always like, you know what? You just, nope, get off the field.",
    "timestamp" : "32:01-32:21"
  },
  {
    "text" : "Like a Rashid Cornwall type of guy.",
    "speaker" : "Andy",
    "timestamp" : "32:23-32:26"
  },
  {
    "speaker" : "Bob",
    "text" : "Yeah, I would say every number two receiver in Panthers history, because they've all sucked. Except for Mousin Muhammad.",
    "timestamp" : "32:26-32:32"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:32-32:34",
    "text" : "Yeah. That's funny."
  },
  {
    "timestamp" : "32:35-32:36",
    "speaker" : "Andy",
    "text" : "That's a good one."
  },
  {
    "text" : "It is true. And if you if you look at like that team that Cam Newton took to the Super Bowl the 15 and 1 team. What a joke, yeah. Their receiving core is laughable.",
    "timestamp" : "32:36-32:46",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "32:46-32:47",
    "text" : "It's truly laughable.",
    "speaker" : "Bob"
  },
  {
    "text" : "Give me some names, Craig. It's it was uh I mean Ted Ginn was basically the number one. Ted Ginn.",
    "timestamp" : "32:47-32:53",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "32:54-32:56",
    "text" : "Um touchdowns that season.",
    "speaker" : "Bob"
  },
  {
    "timestamp" : "32:57-32:58",
    "text" : "Devin Funches, right?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Bob",
    "timestamp" : "32:59-32:59",
    "text" : "Yeah."
  },
  {
    "timestamp" : "33:00-33:03",
    "speaker" : "Greg",
    "text" : "And then from there it's dudes like you wouldn't even recognize their name."
  },
  {
    "text" : "No.",
    "speaker" : "Bob",
    "timestamp" : "33:04-33:04"
  },
  {
    "text" : "Holy shit. Let's see, yeah. All right. So uh top receiving guys. Let's do it by yards. Uh Greg Olson led the team in receiving yards. That makes sense. Ted Ginn. Jericho Kotchery.",
    "speaker" : "Andy",
    "timestamp" : "33:05-33:20"
  },
  {
    "speaker" : "Bob",
    "text" : "Oh, that's right. Swan song Cochery. I love Kotchery. That's an NC State guy.",
    "timestamp" : "33:20-33:25"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, there you go. Homegrown boy. Uh Devin Funcius and then Corey Brown. Who's our cousin?",
    "timestamp" : "33:25-33:33"
  },
  {
    "timestamp" : "33:33-33:44",
    "text" : "Vaguely familiar. They called him Philly Brown. Yeah. Oh Philly Brown. Yeah, a bunch of dudes that really didn't really didn't have business starting in the NFL, much less on the Super Bowl team.",
    "speaker" : "Bob"
  },
  {
    "timestamp" : "33:45-33:49",
    "speaker" : "Andy",
    "text" : "Yeah, you're not kidding. And after that, uh your fullback Mike Tolbert."
  },
  {
    "timestamp" : "33:49-33:52",
    "speaker" : "Bob",
    "text" : "Tolbert Love Tolbert."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh he went to the uh Pro Bowl that year apparently",
    "timestamp" : "33:53-33:56"
  },
  {
    "speaker" : "Bob",
    "text" : "Yeah, Tilbert Tilbert was good people. His impact was probably overstated on the field, but he was he was good people.",
    "timestamp" : "33:57-34:04"
  },
  {
    "timestamp" : "34:04-34:20",
    "text" : "That's fair. So here's a uh here's just a little tidbit for you, just that you you can uh take to your Panthers parties. Steve Smith, you know his his actual name? Hmm Stevon Stavon Latrol Smith.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Bob",
    "timestamp" : "34:20-34:21",
    "text" : "Interesting."
  },
  {
    "timestamp" : "34:22-34:34",
    "speaker" : "Greg",
    "text" : "So there you go. You wanna know uh Ray Caruth's real name? Yes. Ray, Ray Lamar Theodis Wiggins"
  },
  {
    "timestamp" : "34:35-34:36",
    "speaker" : "Bob",
    "text" : "Right."
  },
  {
    "speaker" : "Greg",
    "text" : "Wait. What? His last name's not Caruth? I think it was his stepdad or something like that.",
    "timestamp" : "34:36-34:42"
  },
  {
    "timestamp" : "34:42-34:49",
    "speaker" : "Bob",
    "text" : "I mean, low-key, there's been a lot of controversy. Like that shit was Stirred up in the last year or two because he got released from jail like a year or two ago."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh. Did I know that?",
    "timestamp" : "34:50-34:52"
  },
  {
    "speaker" : "Bob",
    "text" : "Yeah, and then basically decided to continue being a really awful person in the public eye. Like he started off with he's like, you know what, I'm gonna apologize. And then took that apology really south. Uh um how much do you do you guys remember didn't know the story",
    "timestamp" : "34:53-35:09"
  },
  {
    "timestamp" : "35:09-35:12",
    "speaker" : "Greg",
    "text" : "I I read about it a bit today."
  },
  {
    "timestamp" : "35:13-35:59",
    "speaker" : "Bob",
    "text" : "The headline is he paid a guy, a friend of his, to um shoot like do a drive-by shooting at the car of his girlfriend who was pregnant with his eight month old unborn child and So she dies. They do an emergency C selection, deliver the baby. The baby, however, had like cerebral palsy and other things because it spent like 70 minutes without a oxygen during this whole process. Anyway, the baby is still alive. He's a he's a guy. His name's Chancellor. He's alive now. His grandmother. The girl's mom is taking care of him. This motherfucker, Ray Cruth, gets out of jail and has the gall to be like, guys, I won't apologize. And also I'd like to get custody of my son and everybody's like Charlotte lost Charlotte lost his fucking mind."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:59-36:01",
    "text" : "Can't imagine why."
  },
  {
    "speaker" : "Bob",
    "text" : "It's like, hey man, you spend 90 years in prison. I You just quietly fucking disappear somewhere. Jesus Christ. Jesus. That's pretty bad. Anyway, so that's ongoing. That's a thing.",
    "timestamp" : "36:01-36:11"
  },
  {
    "timestamp" : "36:14-36:20",
    "speaker" : "Greg",
    "text" : "Well, all right. There's a new leader in the clubhouse for least favorite Panther."
  },
  {
    "text" : "There's never really an argument if you come down to it. He truly tarnished the franchise in a way that was like I don't see anybody topping that.",
    "timestamp" : "36:22-36:32",
    "speaker" : "Bob"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "36:32-36:34",
    "text" : "Yeah. He was a first round pick too."
  },
  {
    "timestamp" : "36:34-36:36",
    "speaker" : "Bob",
    "text" : "He was. Wow."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:36-36:38",
    "text" : "Was he any good on the field?"
  },
  {
    "text" : "He was for one season and then he was like injured and shit.",
    "timestamp" : "36:39-36:42",
    "speaker" : "Bob"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he was alright. Yeah, I didn't put up much numbers. Alright. Fuck 'em.",
    "timestamp" : "36:43-36:48"
  },
  {
    "text" : "So Bob, are the Patriots your number two team now? Or is it like the North Carolina Panthers in Buffalo?",
    "timestamp" : "36:49-36:56",
    "speaker" : "Speaker 6"
  },
  {
    "text" : "Steve. Steve. Steve, there's no such thing as a number two team. There are 32 teams and you cheer for one and you don't cheer for the other 31. All right, well that's my philosophy.",
    "timestamp" : "36:58-37:10",
    "speaker" : "Bob"
  },
  {
    "speaker" : "Andy",
    "text" : "Let me tweak that a little bit. Um are you going to root for Cam Newton wherever he goes this year? That's a conversation we've been having with Brady.",
    "timestamp" : "37:11-37:19"
  },
  {
    "text" : "I'm gonna I'm gonna hope Cam does well because I really think he deserves a shot. I think if he gets healthy, I think he can be good. And no, I want I want Cam to do well. I'm not gonna cheer for his team, but I hope Cam does well. And I think it's important that he does well.",
    "speaker" : "Bob",
    "timestamp" : "37:19-37:36"
  },
  {
    "timestamp" : "37:36-37:39",
    "text" : "What if he goes to the peaches, then will you cheer for his team?",
    "speaker" : "Speaker 6"
  },
  {
    "speaker" : "Bob",
    "text" : "I'm not gonna cheer for his team. No, I've already made this clear, Steve. Um but I will support Cam and I I hope he does well.",
    "timestamp" : "37:39-37:45"
  },
  {
    "timestamp" : "37:45-37:50",
    "text" : "But what about your wife? And your two daughters. I mean, they're all Patriots fans.",
    "speaker" : "Speaker 6"
  },
  {
    "speaker" : "Bob",
    "text" : "Yeah that that's that's fine. I don't I don't I don't support them in that.",
    "timestamp" : "37:51-37:55"
  },
  {
    "speaker" : "Speaker 6",
    "timestamp" : "37:56-37:59",
    "text" : "She's such an unsupportive dad and husband. God Bob."
  },
  {
    "speaker" : "Bob",
    "text" : "Yeah",
    "timestamp" : "37:59-38:00"
  },
  {
    "text" : "Not gonna win games. I am who I am. All right, transitioning that to my next question. Who's your favorite brother-in-law?",
    "speaker" : "Speaker 6",
    "timestamp" : "38:01-38:07"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:10-38:14",
    "text" : "All right, let's uh let's roll off of that. Who's your least favorite brother in law? There we go."
  },
  {
    "text" : "Is it just based on this podcast or in general?",
    "speaker" : "Bob",
    "timestamp" : "38:14-38:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh do both.",
    "timestamp" : "38:18-38:19"
  },
  {
    "text" : "Yeah, great. Great. Yeah. I'm gonna You know what? This is going to be lengthy. On the podcast, I'm going to start next. I'm going to do an episode on this, all right? So you guys have to stay tuned.",
    "timestamp" : "38:20-38:30",
    "speaker" : "Bob"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, I love it All right. Well, we've kept you long enough away from your family. But we appreciate you doing this, Bob. Thanks for joining us.",
    "timestamp" : "38:31-38:41"
  },
  {
    "timestamp" : "38:42-38:43",
    "speaker" : "Bob",
    "text" : "Indeed, this has been great."
  },
  {
    "text" : "Oh, yeah, it it It usually isn't, but yes, I appreciate that.",
    "timestamp" : "38:49-38:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "We don't really talk about the game. Yeah, exactly. Fair enough.",
    "timestamp" : "38:54-38:57"
  },
  {
    "speaker" : "Andy",
    "text" : "But I think uh we'll have to have you back the next time we talk about the Panthers because that will be in 2003 in the Super Bowl.",
    "timestamp" : "38:58-39:04"
  },
  {
    "timestamp" : "39:05-39:07",
    "speaker" : "Bob",
    "text" : "Count me in. So alright, love it."
  },
  {
    "text" : "And this time we'll actually have you on for like the whole game because that one is actually probably one you'll want to watch.",
    "timestamp" : "39:07-39:12",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Bob",
    "timestamp" : "39:12-39:13",
    "text" : "Indeed."
  },
  {
    "speaker" : "Andy",
    "text" : "Cool. All right. Thanks a lot, Bob.",
    "timestamp" : "39:13-39:15"
  },
  {
    "timestamp" : "39:15-39:18",
    "speaker" : "Bob",
    "text" : "Thanks, Bob. Thanks, dudes. Carry on."
  },
  {
    "text" : "Talk to you soon. I guess we're back. I don't know how to transition out of that. I don't remember how we ended it.",
    "speaker" : "Andy",
    "timestamp" : "39:18-39:27"
  },
  {
    "text" : "Thanks, Bobby. It's week 17. You don't even have your transitions down yet, Andy. Jesus.",
    "timestamp" : "39:27-39:32",
    "speaker" : "Greg"
  },
  {
    "text" : "I do, but not for uh interviews because we haven't ever done one before. That's a good point. Yeah, so. Alright, well I guess now that Bobby has told us how much the 2001 Carolina Panthers have sucked. We should probably start there, don't you think? I was I was personally surprised at how uh little I knew about the Panthers, for one. And also that this was kind of Their lowest of the low moments in history. And then like when Bobby said, because I hadn't watched a game when we did the the interview, and when Bobby said that there was only like what 16,000 people this game.",
    "speaker" : "Andy",
    "timestamp" : "39:33-40:12"
  },
  {
    "timestamp" : "40:13-40:15",
    "speaker" : "Steve",
    "text" : "Oh yeah, it seemed like less."
  },
  {
    "text" : "Yeah, I was gonna say, like I don't even think it was half that. And of those, they were saying like sixty percent were Patriots fans.",
    "speaker" : "Andy",
    "timestamp" : "40:15-40:22"
  },
  {
    "text" : "I will say though, you said they quit on a team and they actually played pretty hard for a one and fourteen team. I thought it was like, you know, you see the end score. Which I don't forget what it was, but it was a shitload to nothing and you're like, well, we must rolled them over right away. But it really wasn't like that. Yeah.",
    "timestamp" : "40:22-40:39",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I thought that in the first half I thought they competed. Definitely did. So the the second half was hot garbage.",
    "timestamp" : "40:39-40:47"
  },
  {
    "text" : "They were pro football reference says it's s the attendance was seventy-one thousand.",
    "speaker" : "Greg",
    "timestamp" : "40:47-40:52"
  },
  {
    "text" : "I was gonna bring that up. No way. Because I looked it up to get an actual number. Yes, it's 71,907.",
    "timestamp" : "40:52-40:58",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "40:59-41:03",
    "speaker" : "Greg",
    "text" : "Maybe as a typo, it's supposed to be 17 instead of seven one."
  },
  {
    "timestamp" : "41:04-41:14",
    "speaker" : "Steve",
    "text" : "I mean maybe they sold that many tickets, but there was like they was it was empty. You would like look at the lower bowl and you'd see some people sitting at the top of the lower bowl and you're like, what are you doing? Move down."
  },
  {
    "speaker" : "Andy",
    "text" : "So it reminded me. of the few games, uh MLS games I've gone to at Gillette Stadium for like the revolution back in the day where you get free tickets because they couldn't sell it.",
    "timestamp" : "41:15-41:26"
  },
  {
    "speaker" : "Greg",
    "text" : "I How dare you disrespect the reps like that?",
    "timestamp" : "41:27-41:29"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm not. I'm just I'm just equating this where they would shut down the top bowl so that it wouldn't look as empty.",
    "timestamp" : "41:29-41:35"
  },
  {
    "timestamp" : "41:35-41:41",
    "speaker" : "Greg",
    "text" : "And they put everybody on one side of the fields. Yeah. Opposite the camera. Yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "41:42-41:46",
    "text" : "The Redskins do that too. They've like blocked off part of their upper bowl."
  },
  {
    "text" : "Right, exactly.",
    "speaker" : "Andy",
    "timestamp" : "41:46-41:46"
  },
  {
    "speaker" : "Steve",
    "text" : "Like they've like put like permanent like fencing. Remember Greg when we went, we were sitting against that fencing. Yes, like feats behind us and they had like it was like f like chain link fenced and like tarps over it.",
    "timestamp" : "41:47-41:57"
  },
  {
    "text" : "Jesus.",
    "speaker" : "Andy",
    "timestamp" : "41:57-41:57"
  },
  {
    "speaker" : "Steve",
    "text" : "So it's like to like have their percentage full be higher.",
    "timestamp" : "41:58-42:01"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "42:01-42:01"
  },
  {
    "speaker" : "Andy",
    "text" : "Ten years before it was cool. Yeah. So yeah, uh a bit about these Panthers. I mean we've heard a little bit from Bobby already, but um As we discussed there they would finish one in fifteen, which the commentators pointed out nicely at the end of this game that they won their first game of the season and then went on to lose the rest of them, and that was the longest s uh losing streak in an NFL season ever. Nobody had lost more than fifteen games in a row.",
    "timestamp" : "42:07-42:37"
  },
  {
    "speaker" : "Steve",
    "text" : "Then the Lions are like, hold my beer.",
    "timestamp" : "42:38-42:40"
  },
  {
    "text" : "Right. Eventually that would be broken uh a few years after this, but that was for a single season, right? Yes, yeah, yeah. For for one season. It was the mo it was the longest losing streak in one season.",
    "speaker" : "Andy",
    "timestamp" : "42:40-42:53"
  },
  {
    "text" : "Who has the longest losing streak ever? Is it the old Bucks or was it the Lions?",
    "timestamp" : "42:54-42:59",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "42:59-43:02",
    "speaker" : "Greg",
    "text" : "I guess the Bucks. I think it's the Bucks, yeah. I agree."
  },
  {
    "text" : "Oh, the Browns, I don't know what theirs look like those two years where they went one in 32. That's gotta be up there, depending on when that win came. Cause then they go one in fifteen and then ow in sixteen the next year? I'm gonna say the bucks because fuck the bucks.",
    "speaker" : "Andy",
    "timestamp" : "43:03-43:21"
  },
  {
    "text" : "Yeah, there was a I think I looked at it briefly and it was like twenty-three straight games or something. That's not great. Uh yeah, we talked about um George Seaford already. Well, not anymore. They got Brady now. They're about to go on a 23 game winning streak. What was longer?",
    "speaker" : "Greg",
    "timestamp" : "43:21-43:41"
  },
  {
    "text" : "The Bucks losing streak or the Patriots winning streak when they went like, was it 03-04? Where they won a ton in a row?",
    "timestamp" : "43:41-43:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "43:48-43:55",
    "text" : "One in a row, right? I believe it was. They did win a shitload in a row. I remember that. I think it was twenty-one in a row.",
    "speaker" : "Andy"
  },
  {
    "text" : "That's the longest active NFL win streak.",
    "timestamp" : "43:55-43:58",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "43:58-43:59",
    "speaker" : "Andy",
    "text" : "Yes."
  },
  {
    "speaker" : "Steve",
    "text" : "Or all time, yeah.",
    "timestamp" : "44:00-44:02"
  },
  {
    "text" : "Yeah, yeah. And uh you could say the Patriots have the most the longest single season winning streak as well, because they won 18 games in a season.",
    "timestamp" : "44:02-44:10",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "44:11-45:14",
    "speaker" : "Greg",
    "text" : "That's true. So um I was I was looking up uh the best the best way to describe their season Yeah. And uh I don't know if you've ever been on Urban Thesaurus, but it's fucking awesome. Wait, does an Urban Thesaurus? Really? Yeah, where it just gives you like equivalent words. I only knew about the dictionary. Yeah, I do. I suggest you go to Urban the Source at some point because it's so funny. So I put in dumpster fire. Some of this shit is hilarious. Trash crepade. Hobo salad. Dead man's dumpster diving. Oh boy Necropyro bestiality. As you go along. Alaskan fire dragon. Libido sewer. Fuck. I could read this shit all day. There's like 600 of them."
  },
  {
    "timestamp" : "45:15-45:18",
    "text" : "Oh my god. I think we might have a new podcast idea.",
    "speaker" : "Mom"
  },
  {
    "speaker" : "Steve",
    "text" : "Good lord. I did not know about the subside. This whole podcast has been worth it just for that one little nugget of knowledge.",
    "timestamp" : "45:22-45:31"
  },
  {
    "speaker" : "Andy",
    "text" : "Right?",
    "timestamp" : "45:32-45:33"
  },
  {
    "speaker" : "Greg",
    "text" : "I wish we knew this so we could ask Bobby that question of what better describes this season?",
    "timestamp" : "45:33-45:38"
  },
  {
    "text" : "Of these four options, what would you choose? Dumpster fire, anal backdraft. What were the other ones?",
    "timestamp" : "45:39-45:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't think it's pseudo-pyrohomo necro bestialiac.",
    "timestamp" : "45:48-45:53"
  },
  {
    "text" : "Alright, now we're getting crazy.",
    "speaker" : "Steve",
    "timestamp" : "45:54-45:56"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:56-46:30",
    "text" : "Yeah. Uh so speaking of dump to friars, this coaching staff. Uh we talked about George Seaford already. Some of the other coaches you may recognize, Mike McCoy. Remember him, Chargers coach from like 2013-2016? He was their wide receivers coach. And then also Greg Roman, you might recognize, who is currently the offensive coordinator for the Baltimore Ravens. And that record today. All right."
  },
  {
    "speaker" : "Greg",
    "text" : "He's in high demand.",
    "timestamp" : "46:31-46:32"
  },
  {
    "timestamp" : "46:33-46:50",
    "speaker" : "Andy",
    "text" : "He really is. Yeah. He wasn't back then, if you look at this offense. Uh because I I did my best to come up with names for you guys on this offense. There really aren't any. The Winky Man. Yeah. Uh former Heisman winner? Is that what they said?"
  },
  {
    "timestamp" : "46:50-46:52",
    "text" : "Yeah, apparently he was really good in college.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And uh the The uh who are the the commentators? The commentator duo of Kevin Harlan and Craig James, our own Craig James were doing this game.",
    "timestamp" : "46:52-47:03"
  },
  {
    "speaker" : "Steve",
    "text" : "I did I actually like them. Me too. I like Craig James. Yeah.",
    "timestamp" : "47:03-47:06"
  },
  {
    "timestamp" : "47:07-47:07",
    "speaker" : "Andy",
    "text" : "They did all right."
  },
  {
    "text" : "And if that's coming from Andy, you know they were great.",
    "speaker" : "Steve",
    "timestamp" : "47:09-47:11"
  },
  {
    "text" : "They're definitely not the A team, though. I will say that. And I think they knew it, so they were just having fun with it, which is why",
    "timestamp" : "47:11-47:17",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:18-47:29",
    "speaker" : "Steve",
    "text" : "Like when he calls out the block like the on the touchdown run that got called back. Yeah. And then the rest of immediately he's like, what a great block. Like in the play. And then yeah, on that guy."
  },
  {
    "text" : "Yeah, Compton.",
    "timestamp" : "47:30-47:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. I love Compton wearing the visor. It's like like drizzling overcast in December. There's snow in North Carolina. Got the visor on.",
    "timestamp" : "47:32-47:44"
  },
  {
    "timestamp" : "47:44-47:59",
    "speaker" : "Andy",
    "text" : "Yeah, it was. It was like 36 degrees and like freezing rain, and you could see snow around the sidelines and stuff. Yeah. I don't think it snowed down there, Greg. I'm surprised anybody was able to get to the stadium. Once a year? Figured they would have shut down the state."
  },
  {
    "speaker" : "Greg",
    "text" : "So Chris Winky, fun fact, he spent six years at the Blue Jays before going to Florida State. So he was twenty s he was twenty-six no sh when he enrolled at Florida State. So he must have been, I don't know, close to thirty by the time he got drafted. Because I remember that. He was what was the other guy that from Oklahoma State? Yes, Brain and Wheat. He was the same type of guy.",
    "timestamp" : "48:01-48:27"
  },
  {
    "text" : "Yeah. Huh. Uh it didn't help him much that that uh that time in the on the Blue Jays, I don't think. His completion percentage, I looked it up, was fifty-four percent on the year. For the Panthers. I think Drew Redzo average fifty-six. That sounds low. 54 is not great. It's he's he completes just barely one of every two passes. Um and all a lot of those are to the other team. He had 11 touchdowns and 19 interceptions.",
    "speaker" : "Andy",
    "timestamp" : "48:27-49:01"
  },
  {
    "text" : "Yeah, he threw a couple of bad pick sixes in this game.",
    "speaker" : "Steve",
    "timestamp" : "49:01-49:06"
  },
  {
    "speaker" : "Andy",
    "text" : "He threw more than a couple. He just got lucky that one of them got called back for holding on the return. The one to tie law was so bad though.",
    "timestamp" : "49:09-49:16"
  },
  {
    "timestamp" : "49:16-49:27",
    "speaker" : "Steve",
    "text" : "Just none of them. The second one like got deflected, right? And that's you can call it unlucky. It wasn't a great throw, but a little unlucky. The uh one to tie law. It's just awful."
  },
  {
    "timestamp" : "49:27-49:42",
    "speaker" : "Andy",
    "text" : "Yeah, so that he just I don't know if it's a uh a flaw of his that nobody knew about, but the guy couldn't throw an out pattern to save his life. Literally every single interception that he threw. was on an out pattern and he just hit the defensive back right in the hands."
  },
  {
    "timestamp" : "49:42-49:44",
    "speaker" : "Steve",
    "text" : "With nobody in front of him."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:44-49:46",
    "text" : "Oh yeah, no nobody"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:46-49:56",
    "text" : "I did I have a note here, but Steve Smith was a guy that was in targeting. And this was rookie year. And Bobby said it took him a couple years to figure it out. I don't know. Steve Smith flashing this game."
  },
  {
    "timestamp" : "49:56-50:26",
    "speaker" : "Andy",
    "text" : "A little fumbled. I was just gonna say, so uh like Bobby was saying, Steve Smith's first few years was more of a kick returner and once the Pro Bowl for kick returns in this season. But his kick returning in this game was god awful. Awful. Well, like every time he I mean, and there was a bunch of kickoffs, Patriots scored thirty-eight points in this game. And every single one of them, he ran directly into the nearest defender and got just ragdolled every time, it felt like."
  },
  {
    "timestamp" : "50:26-50:32",
    "speaker" : "Steve",
    "text" : "Yeah. But like as a receiver, he was pretty solid. I mean he had that one big play that got called back."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep.",
    "timestamp" : "50:32-50:32"
  },
  {
    "timestamp" : "50:33-50:37",
    "speaker" : "Steve",
    "text" : "He was I have a note on here. He's He's spinning the ball down 31 six."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:38-50:55",
    "text" : "Literally every time he caught the ball, he would he would catch it near the sidelines. Uh instead of stepping out, he would hit the guy, uh the defender, and try to like lower his shoulder into him and get knocked out of bounds anyway because he's so small, and then spin the ball and start yapping. Like he's not a big thing. Like you said 31 to 6. Yeah"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "50:56-51:01",
    "text" : "So the time."
  },
  {
    "text" : "I will say uh there weren't many plays that I thought he was butthole naked open",
    "speaker" : "Andy",
    "timestamp" : "51:02-51:07"
  },
  {
    "timestamp" : "51:09-51:12",
    "text" : "It's an interesting way to describe naked, but sure.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "51:12-51:14",
    "speaker" : "Andy",
    "text" : "That was his quote, remember?"
  },
  {
    "text" : "Oh. Yeah. They made the mistake of putting them behind a desk at a halftime show. Which w I don't know what gave them the idea that that would go well. I don't either, but",
    "speaker" : "Greg",
    "timestamp" : "51:15-51:27"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:27-51:37",
    "text" : "But I think that was his quote was you gotta yeah, something about being butthole naked open. We talked about ad nauseum in the uh the the episode where we're all together."
  },
  {
    "text" : "Yeah, Steve.",
    "timestamp" : "51:37-51:38",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:38-51:38",
    "text" : "Come on."
  },
  {
    "timestamp" : "51:38-51:39",
    "speaker" : "Greg",
    "text" : "Pay attention."
  },
  {
    "speaker" : "Steve",
    "text" : "No, I was drinking a lot in that episode.",
    "timestamp" : "51:40-51:42"
  },
  {
    "speaker" : "Andy",
    "text" : "No kidding. Didn't show it all, don't worry.",
    "timestamp" : "51:43-51:46"
  },
  {
    "timestamp" : "51:47-51:58",
    "speaker" : "Greg",
    "text" : "I like I like him because he's like You know there's a lot of like false bravado in the NFL. You know the Josh Normans of the world."
  },
  {
    "timestamp" : "51:58-52:00",
    "speaker" : "Steve",
    "text" : "Yeah The come at me bros."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:00-52:11",
    "text" : "Yeah. He strikes me as like legitimate crazy man bravado where he authentically believes he's that much better than everybody."
  },
  {
    "timestamp" : "52:11-52:21",
    "text" : "Yeah. And I I I would I would be willing to bet that he would fight literally anyone. Yeah. Like a him versus thinking he would be able to to win every fight.",
    "speaker" : "Andy"
  },
  {
    "text" : "Do you think TO is in that? Like how do you how do you put TO?",
    "timestamp" : "52:22-52:24",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:26-52:28",
    "text" : "TO was a bit self-aware for me, you know."
  },
  {
    "timestamp" : "52:28-52:33",
    "speaker" : "Andy",
    "text" : "Yeah, similar but not the same. It's more like he knew what he was doing almost."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:33-52:42",
    "text" : "Yeah, he knew what he was doing. He was he was like playing the media to a certain degree. Oh, definitely. Whereas Steve Smith is just like he's out of his mind"
  },
  {
    "text" : "Yeah, I think Tio was more of a showman.",
    "timestamp" : "52:43-52:45",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "52:45-52:45"
  },
  {
    "timestamp" : "52:45-52:54",
    "speaker" : "Andy",
    "text" : "Like he was gonna put on a show and he was talented enough to do that. Like he was gonna pull the Sharpie out of his sock or go stand on the the star in Dallas, you know, that's what I mean."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, that's fair.",
    "timestamp" : "52:54-52:55"
  },
  {
    "timestamp" : "52:58-53:01",
    "text" : "Who else is authentic crazy man bravado?",
    "speaker" : "Greg"
  },
  {
    "text" : "Who's the closest comp to that?",
    "speaker" : "Steve",
    "timestamp" : "53:02-53:03"
  },
  {
    "timestamp" : "53:04-53:07",
    "speaker" : "Greg",
    "text" : "Heinzons always struck me as like that."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "53:07-53:08",
    "text" : "Nah, he's too quiet."
  },
  {
    "text" : "Yeah, he was too quiet. But he was He was fearless though, you know in the same way that Steve Smith is. I actually wrote a I wrote a blog on it, Andy.",
    "timestamp" : "53:08-53:22",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "53:22-53:24",
    "text" : "You did? Uh on what? On Steve Smith?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It was actually on Jalen Ramsey when he was being a clown.",
    "timestamp" : "53:24-53:28"
  },
  {
    "text" : "Oh yeah yeah yeah what's our website called? Brownbrosports. com Should probably know that apparently you've been writing uh recently too, huh? Oops",
    "timestamp" : "53:28-53:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Isn't it uh isn't it linked on the Patriots Dynasty site as well?",
    "timestamp" : "53:43-53:47"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh maybe.",
    "timestamp" : "53:48-53:50"
  },
  {
    "timestamp" : "53:50-53:51",
    "text" : "I don't let you know.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "53:52-53:55",
    "speaker" : "Greg",
    "text" : "Did you even read the blog I wrote recently?"
  },
  {
    "speaker" : "Andy",
    "text" : "Based on the podcast?",
    "timestamp" : "53:55-53:56"
  },
  {
    "text" : "Yeah, I have about Alex Van Pel.",
    "timestamp" : "53:57-53:59",
    "speaker" : "Greg"
  },
  {
    "text" : "No, I didn't know you wrote it.",
    "timestamp" : "54:00-54:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:01-54:12",
    "text" : "Yeah, it's a the title of the blog is Alex Van Pelt is your wife's favorite player. And I it's just there's not many words in it, it's just pictures of him looking like a stud.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, the fifty shades of Rex or whatever it was.",
    "speaker" : "Steve",
    "timestamp" : "54:20-54:22"
  },
  {
    "speaker" : "Greg",
    "text" : "That's when it started getting weird. Yeah. That was when it started getting good. Yeah, and then you stopped writing. Oh, Kobe Bryant. He's another one that was like authentic compass.",
    "timestamp" : "54:22-54:34"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah.",
    "timestamp" : "54:34-54:35"
  },
  {
    "timestamp" : "54:35-54:36",
    "text" : "That's a great comp.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. What about um Pedro?",
    "timestamp" : "54:36-54:41"
  },
  {
    "text" : "He's also a little quiet.",
    "speaker" : "Steve",
    "timestamp" : "54:43-54:44"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:45-54:48",
    "text" : "Uh uh he wasn't really though."
  },
  {
    "timestamp" : "54:49-54:52",
    "speaker" : "Steve",
    "text" : "But Manny Tateo, there is a good comp."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I'll give you that. Manny like putting on a show. All right, uh spee speaking of the Panthers game. Way the fuck off track yet again. Um Any other names you guys recognized? Uh like I I agree put together a list.",
    "timestamp" : "54:52-55:12"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "55:13-55:16",
    "text" : "I did not recognize was their running back. Richard Hudley."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "55:17-55:17"
  },
  {
    "speaker" : "Steve",
    "text" : "Dude, what was his final stat line?",
    "timestamp" : "55:18-55:20"
  },
  {
    "timestamp" : "55:21-55:22",
    "speaker" : "Andy",
    "text" : "He was a lot."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "55:23-55:30",
    "text" : "He was crushing him though. He had like a hundred yards by like mid second quarter."
  },
  {
    "speaker" : "Andy",
    "text" : "Twenty-one carries, a hundred and sixty-eight rushing yards.",
    "timestamp" : "55:31-55:34"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, and like a hundred of those plus came by in the first quarter and a half. Yeah, that's not like it's it was a close game.",
    "timestamp" : "55:34-55:41"
  },
  {
    "text" : "So just for uh some context He led the led the team in rushing with six hundred and sixty-five yards.",
    "timestamp" : "55:42-55:50",
    "speaker" : "Andy"
  },
  {
    "text" : "And he got a hundred and seventy yards.",
    "timestamp" : "55:50-55:51",
    "speaker" : "Steve"
  },
  {
    "text" : "He got almost hundred and seventy in this game.",
    "timestamp" : "55:52-55:54",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh my god. Yeah, they had the worst rushing offense in the league, and they're like sitting there just gashing the Patriots over and over.",
    "speaker" : "Steve",
    "timestamp" : "55:54-56:00"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "56:00-56:00"
  },
  {
    "text" : "Like we fumbled on the one yard line, right? Yep. So there was yeah, they were like kicked we had like three and gold goals and got a field goal out of it or some shit like that.",
    "timestamp" : "56:00-56:10",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, okay. Yeah, so Yeah, so the first round the Patriots had uh like they got first and goal from like the four or the five. Uh and they actually scored a the touchdown that you talked about, but they got called back for holding Mike Compton on the fantastic block that Craig James had. Uh and then they end up settling for field goal. And then uh like a few plays later, Winky throws his first pick six of the game. Yeah. Tylaw, who outrun Steve Smith, which I thought was pretty cool.",
    "timestamp" : "56:10-56:40",
    "speaker" : "Andy"
  },
  {
    "text" : "Gave Steve Smith stiff arm on the wall. If you need a visual of that pick six, just imagine the one in the Super Bowl on the other side of the field.",
    "speaker" : "Greg",
    "timestamp" : "56:40-56:49"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "56:49-56:50"
  },
  {
    "text" : "Yep. That throws it behind the receiver. Tyler just catches it.",
    "timestamp" : "56:52-56:55",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "56:55-56:59",
    "text" : "Except Chris Wicky wasn't pressured at all and just threw a terrible pass.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "56:59-57:00",
    "speaker" : "Greg",
    "text" : "That's true."
  },
  {
    "timestamp" : "57:01-57:32",
    "text" : "Um and so they get the they get the ball back and literally the next play, Winky throws another what should have been a pick six, yeah, to O to Smith, which only wasn't because it got called back for holding on the return. By whoever the defender was. Um, so the Pats get the ball on like on the 35, convert a fourth and two, get to fourth and goal from like the two. And as Antoine Smith is running into the end zone, he fumbles it on the goal line. And the Panthers recover.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Then like their first play from that first play from the one yard line was a handoff to that dude and he ran to like the twenty-five. Then like you into like the forty-five, and this is like, oh my god.",
    "timestamp" : "57:33-57:44"
  },
  {
    "timestamp" : "57:44-57:54",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, it was He he was basically the entire Panthers offense. The entire game, really. Um"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he had more rushing yards than Winky had passing yards.",
    "timestamp" : "57:55-58:00"
  },
  {
    "speaker" : "Steve",
    "text" : "And he stopped getting the ball in the second quarter too, which is crazy. Yeah.",
    "timestamp" : "58:04-58:08"
  },
  {
    "text" : "It was not great. Yeah, Carolina finished with 193 total rushing guards. Which is brutal. And no touchdowns. Um but the name of the game was turnovers. Carolina had six of them. So the Patriots three, which still not great. But I I mean, I don't know how you guys felt about this, but watching this game, I didn't think I can see how this team won the Super Bowl. Because like you said, going into this, you know, the this game is uh absolute drubbing. It ends 38 to 6. And you're like, oh yeah, I I I feel like I remember them just like beating the shit out of the Panthers. And kind of in the passing defense, yeah, because the Patriots defense outscored the Panthers offense technically, because they had two pick sixes. But they were getting gashed in the run and the commentators were talking about how, you know, they have to worry about I think it was the Steelers running game and The Ravens as well who had won the Super Bowl the year before. You don't want to you don't want to face them and all this stuff. Right, exactly.",
    "timestamp" : "58:10-59:18",
    "speaker" : "Andy"
  },
  {
    "text" : "Well, I mean I think it was like you can if you look at it from like Belichick's view, right? Where like complimentary football and it's not just about the off because the offense was not very good. But there is a you know, the defense the they punted and got him down to the one, right? And then the defense held him and then they punted it too far and Troy Brown took that to the house. And that's like Defense, special teams creates defense, creates special teams that creates touchdown, blah, blah, blah.",
    "speaker" : "Steve",
    "timestamp" : "59:18-59:46"
  },
  {
    "text" : "Steve, I was gonna make the same point. Damn. Unbelievable. Unbelievable. I had it written down in my notes. Belichick football.",
    "timestamp" : "59:47-59:57",
    "speaker" : "Greg"
  },
  {
    "text" : "It was actually a very similar return to that Steelers game.",
    "timestamp" : "01:00:00-01:00:03",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:00:03-01:00:05",
    "text" : "Yeah. Very astute of you, Steve."
  },
  {
    "speaker" : "Steve",
    "text" : "It was too deep, and then Troy took it right up the gut. Yeah.",
    "timestamp" : "01:00:06-01:00:08"
  },
  {
    "speaker" : "Greg",
    "text" : "And then you're like, is the punter gonna get him? Yeah. Yeah.",
    "timestamp" : "01:00:08-01:00:14"
  },
  {
    "speaker" : "Andy",
    "text" : "Dude, as soon as you got past that first wave, there wasn't somebody within like 20 yards of Troy Brown in that combat.",
    "timestamp" : "01:00:14-01:00:19"
  },
  {
    "timestamp" : "01:00:20-01:00:26",
    "speaker" : "Greg",
    "text" : "Has Troy Brown ever been tackled by a punter or kicker? Probably not. Never."
  },
  {
    "speaker" : "Steve",
    "text" : "Cause he's never really returned a kick against Adam Benateri, apparently.",
    "timestamp" : "01:00:28-01:00:32"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that's right. Right, yeah.",
    "timestamp" : "01:00:32-01:00:33"
  },
  {
    "timestamp" : "01:00:33-01:00:36",
    "speaker" : "Andy",
    "text" : "Oh, that would be That would be a matchup."
  },
  {
    "timestamp" : "01:00:36-01:00:40",
    "text" : "I'd say Oklahoma drill with Vinatari and Troy Brown.",
    "speaker" : "Greg"
  },
  {
    "text" : "Like in 2020 too. Like current Troy Brown and current Vinatari. That would be amazing.",
    "timestamp" : "01:00:41-01:00:46",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "My money's on current Troy Brown. I don't care.",
    "timestamp" : "01:00:46-01:00:49"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:49-01:00:49",
    "text" : "Yeah."
  },
  {
    "text" : "Troy Brown, he's shifty, man.",
    "speaker" : "Andy",
    "timestamp" : "01:00:49-01:00:51"
  },
  {
    "timestamp" : "01:00:53-01:00:55",
    "speaker" : "Steve",
    "text" : "Well, he's our cousin. You gotta bet on him."
  },
  {
    "text" : "I guess. Well, uh speaking of Troy Brown, this is probably a good time to bring this up. He was playing uh Like in front of his family. They were talking about how Yeah. I think it was in the paper that he like this because he's from I think he's from North Carolina. I'm gonna keep getting more confused. I don't I honestly don't care about the fact that there's two Carolinas. No offense, Greg. I mean you can take offense if you want. I don't really think. You don't care that there's two? I do, but I I don't care to If somebody tells me they're from one of them, I I'm not going to remember which one.",
    "timestamp" : "01:00:56-01:01:28",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01:29-01:01:44",
    "speaker" : "Greg",
    "text" : "They're culturally very different, Andy. Maybe you should read a book. Not about the Carolinas. Get your head out of your ass. Get your dick out of your hand. Oh boy."
  },
  {
    "text" : "Uh So Troy Brown comes uh comes home to his home state. Uh they're talking about how he bought like a hundred tickets for this game for like friends and family and I think he brought like a Pee-Wee football team to the game or something like that. Um And this is a great game to watch if you're a Troy Brown fan. Like I said, he had that 61-yard punt return for a touchdown. He also eventually set the all-time Patriots single season reception record, which if you remember, it was like I think it was like right before the half.",
    "timestamp" : "01:01:45-01:02:21",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:21-01:02:23",
    "speaker" : "Mom",
    "text" : "And he made the catch that that set the record."
  },
  {
    "timestamp" : "01:02:24-01:02:36",
    "text" : "But then it got challenged and overturned because he didn't completely catch it. And they kept like showing him the camera on him. He just like laughing and smiling. You can tell he's like kind of Pissed off and doesn't want to show. He's like, God, that was that was fucking record.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:37-01:02:38",
    "text" : "And then when he did it, they didn't say any shit either.",
    "speaker" : "Steve"
  },
  {
    "text" : "Exactly, yeah. And it didn't happen much longer afterwards, but",
    "timestamp" : "01:02:39-01:02:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, no like video montage. I was I was expecting something.",
    "timestamp" : "01:02:44-01:02:48"
  },
  {
    "timestamp" : "01:02:48-01:02:53",
    "speaker" : "Steve",
    "text" : "Maybe with Drew Brees, they stopped the fucking game and like goddamn plaque out there. Where's Troy Brown's plaque?"
  },
  {
    "timestamp" : "01:02:54-01:03:03",
    "text" : "Dude, that's true. Oh that was the worst. They did it again this year, too. Oh, brutal. When he did the touchdown record this year.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:03:03-01:03:06",
    "speaker" : "Steve",
    "text" : "Yeah. No, no, no. The regular season touchdown record."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Right. Exactly. On a Monday night game. And I had friggin' Michael Thomas, who was the last, and they just pulled him in like the second quarter. It was like 38-0, and all the announcers would talk about is Drew Brees. Of course. Yeah. I was so mad.",
    "timestamp" : "01:03:06-01:03:24"
  },
  {
    "speaker" : "Steve",
    "text" : "But back to why this is a great Troy Brown game is that Antoine Smith uh running touchdown, like I think it's a first touchdown for the offense in the first quarter. If you watch Troy Brown has his guy, the cornerback, on like roller skates, and he's like pushing him all the way back in the end zone from like 25 yards out. Oh yeah. That's classic Troy Brown right there. Just Blocking like a beast on the edge to get Tuan the untouched hands on.",
    "timestamp" : "01:03:24-01:03:52"
  },
  {
    "speaker" : "Greg",
    "text" : "It's also a good tie law game.",
    "timestamp" : "01:03:54-01:03:56"
  },
  {
    "text" : "It was a great touch against Tyler.",
    "speaker" : "Steve",
    "timestamp" : "01:03:56-01:03:58"
  },
  {
    "text" : "I thought it was a fantastic Otis Smith game. He had two picks which technically returned both for a touchdown. One got called back. He broke up a ton of deep passes. We probably should have had like three or four picks in this game. You just can't catch. But and uh I was gonna say it was for my best, but um There was one play where he was lined up on the far side of the field and he he came on a corner blitz and you got to watch the entire thing unfold. And it felt like watching um like a National Geographic thing where you could like see the lion like hunting, like coming down on the on the prey. You're like, oh he's gonna get him, he's gonna get him, he better throw that football. And Chris Winky just didn't even feel him like for a second. He got lit up. That was that was just fantastic television. Yeah, because that was a camera angle and everything.",
    "timestamp" : "01:03:59-01:04:50",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:04:52-01:05:19",
    "text" : "Yeah I have I have a note on here. That missed tackle by Winky and then the high step pick six, that's Otis's like pick six in the fourth quarter, is the gif of Winky's career. You think so? Yeah, to sum it up. Hey, you're great in the pros, but then down 31-6, make it 31-8, make the third pick six of the game.",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh yes it's winking the poop.",
    "speaker" : "Andy",
    "timestamp" : "01:05:19-01:05:23"
  },
  {
    "text" : "'Cause it was never any good, right?",
    "speaker" : "Greg",
    "timestamp" : "01:05:25-01:05:28"
  },
  {
    "speaker" : "Andy",
    "text" : "No, no, not the NFL.",
    "timestamp" : "01:05:28-01:05:30"
  },
  {
    "speaker" : "Greg",
    "text" : "Rip Van Winky.",
    "timestamp" : "01:05:31-01:05:32"
  },
  {
    "speaker" : "Steve",
    "text" : "Nicely done. You just Coming up with these or are these already existing?",
    "timestamp" : "01:05:34-01:05:38"
  },
  {
    "timestamp" : "01:05:38-01:05:43",
    "speaker" : "Greg",
    "text" : "Oh no, I'm not sure. Chris, I wish I wish I were an Oscar Meyer winky."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:05:44-01:05:46",
    "text" : "Yeah, you you're you're fine."
  },
  {
    "text" : "Oh, he's digging deep for these.",
    "speaker" : "Andy",
    "timestamp" : "01:05:47-01:05:49"
  },
  {
    "timestamp" : "01:05:49-01:06:00",
    "speaker" : "Greg",
    "text" : "He's up to his elbow. It's a website called the Berman Files. No, it isn't. You hear you hear a name like Winky and you're like, there's a nickname for that."
  },
  {
    "timestamp" : "01:06:01-01:06:04",
    "speaker" : "Steve",
    "text" : "Yeah, we're there all amazing websites today."
  },
  {
    "text" : "Oh yeah. I know, right?",
    "timestamp" : "01:06:04-01:06:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:06:10-01:06:38",
    "text" : "Oh there was one there was one where I didn't want to interrupt you guys on the uh Well is that the uh yeah, so the dumpster fire one? Purple headed Christian meat missile. How does that have anything to do with dumpster fire? Who knows, dude? But it's just sometimes words go well together. Yeah, get give me that one more time. Purple headed Christian meat missile."
  },
  {
    "speaker" : "Andy",
    "text" : "Kirk Cousins real name. That was his nickname in high school. Holy shit. Oh, I have one more th thing about Troy Brown that I forgot to bring up at the beginning of this and before we got sidetracked. Again. Uh before this game, um Pro Bowlers were announced. Brady and Malloy both made the Pro Bowl, but Troy Brown didn't, which is kind of bullshit because he had like one of the best seasons. receiving in the league and he was also like yeah exactly so um there's a Boston Globe article about it And everybody was pissed for him, apparently. And uh this is what the the globe had to say. His friends and fans were angry upon learning Troy Brown had been overlooked for the AFC Pro Bowl team, but not Brown himself. No big deal, said Brown, who will officially be named an alternate to the Pro Bowl later this week. A lot of great players who were selected ahead of me. There's nothing I can say about it. A lot of guys in here on the team weren't happy about it, but it's out of my control. The important thing is that I have the respect of my teammates and that we're heading into the playoffs and trying to get to the Super Bowl. I'm not upset or angry or anything like that. I've just tried to go out every week and do whatever it takes to help the team. Fucking Troy Brown. Oh man. I want to give 110%. Fucking love him. That's just who he is though. Oh yeah. He's like, oh no, that's okay.",
    "timestamp" : "01:06:40-01:08:08"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:10-01:08:14",
    "text" : "Always been my favorite Patriots player. Forever. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Have you seen that Brendan Fraser movie where he's like the sweaty guy in the locker room?",
    "timestamp" : "01:08:14-01:08:19"
  },
  {
    "timestamp" : "01:08:20-01:08:22",
    "speaker" : "Steve",
    "text" : "Troy Brown is the sweaty guy in the world."
  },
  {
    "timestamp" : "01:08:22-01:08:24",
    "speaker" : "Greg",
    "text" : "What the fuck? Brendan Fraser is."
  },
  {
    "timestamp" : "01:08:24-01:08:25",
    "text" : "Where are we tying this in?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:08:26-01:08:54",
    "text" : "Yeah, where is they're interviewing him and he's talking about, oh I just gave 110%. That sounds familiar actually. What? Never mind. You cut this part. Killed it. But I'm going to send you guys the link after and you'll be like, oh man, that's funny. Every time I hear a player give a bullshit response like that That's all I think of that.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, that's just who he's always been though.",
    "timestamp" : "01:08:56-01:08:57",
    "speaker" : "Andy"
  },
  {
    "text" : "That's why I like Belichick loves it. I mean, that could have been Belichick like wrote that response for him. Right. All I care about is winning. I don't care about individual accolades. I just with my team. You know, we're going to the playoffs, right? Like Yeah. That's classic Beljack. And then I'll take the Beljack and load that for 'em, right?",
    "timestamp" : "01:08:57-01:09:16",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't care about the roster bonus I get for the uh Pro Bowl, you know? Couple extra million. I just I just like he was just happy he was playing, man.",
    "timestamp" : "01:09:16-01:09:26"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:09:32-01:09:36",
    "text" : "I have not read that and you mail that to me if you have it."
  },
  {
    "text" : "Yeah, I can get it too. It's uh I don't think it was written by Troy Brown, but it kinda has a feel like it was, so I know we had a hand in it. It's got some interesting stuff to it.",
    "timestamp" : "01:09:36-01:09:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:09:48-01:09:50",
    "speaker" : "Greg",
    "text" : "I would hope he had it handy."
  },
  {
    "timestamp" : "01:09:51-01:09:54",
    "speaker" : "Andy",
    "text" : "It was it was very well, I think it was like ghost written for him, you know?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:09:54-01:09:54"
  },
  {
    "timestamp" : "01:09:55-01:10:00",
    "text" : "But it still it still sounds like Troy Brown, is what I'm saying. It's a good book.",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, Greg, I have a stat check note. What like who was the last coach or what other coaches were traded for a pick? Because the commentators are talking about how Belchak was traded for a pick. He was.",
    "speaker" : "Steve",
    "timestamp" : "01:10:00-01:10:12"
  },
  {
    "timestamp" : "01:10:12-01:10:13",
    "speaker" : "Greg",
    "text" : "Docker Rivers."
  },
  {
    "text" : "Gruden. Gruden's the obvious answer, right? Gruden. Who we'll see next week. But has there been anybody since then? Not that I can remember.",
    "speaker" : "Steve",
    "timestamp" : "01:10:13-01:10:21"
  },
  {
    "speaker" : "Greg",
    "text" : "Doc Rivers.",
    "timestamp" : "01:10:22-01:10:23"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:10:25-01:10:25",
    "text" : "Was he?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:10:26-01:10:26",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:10:26-01:10:27",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:10:29-01:10:30",
    "speaker" : "Andy",
    "text" : "I can't think of any off the top of my head."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:10:31-01:10:38",
    "text" : "Tony Gungee. Really? Really? Yeah. Oh wait, no, that's the Gruden one."
  },
  {
    "text" : "Wait.",
    "timestamp" : "01:10:38-01:10:38",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:10:39-01:10:42",
    "speaker" : "Greg",
    "text" : "Yeah. Hmm."
  },
  {
    "timestamp" : "01:10:42-01:10:44",
    "speaker" : "Steve",
    "text" : "Oh here we go."
  },
  {
    "timestamp" : "01:10:50-01:10:53",
    "speaker" : "Andy",
    "text" : "Herm Edwards apparently. What?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:10:53-01:10:55",
    "text" : "Who paid a pick for Herm?"
  },
  {
    "speaker" : "Andy",
    "text" : "So knowing Kansas City was interested in hiring him to succeed the retiring Dick for Miel, Edwards attempted to strong arm the Jets into a contract extension and include a raise. His move didn't work. The two teams eventually settled on a deal in which Kansas City sent the Jets a fourth a fourth pick. Oh, it's a fourth pick or a fourth round pick, in exchange to release Edwards from his contract. Uh Mike Holmgren from the Packers to Seahawks. Eight-year contract valued at four million dollars a year in total control over football operations. Lured Homegren to Seattle in ninety-nine. Homegren was not only Coach, but also executive vice president of football operations and general manager. The Packers received the Seahawks second round pick, 47th overall in the 99 draft. And Bill Parcells.",
    "timestamp" : "01:10:55-01:11:40"
  },
  {
    "timestamp" : "01:11:42-01:11:51",
    "text" : "Yeah. Yeah, he so Holmgren was pre Belichick, but post Parcells? No.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:11:53-01:11:56",
    "speaker" : "Andy",
    "text" : "Uh Homegroom it was Homegroom was ninety-nine."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:11:57-01:12:01",
    "text" : "And Parcells was right around then, right? Seven."
  },
  {
    "timestamp" : "01:12:01-01:12:34",
    "speaker" : "Andy",
    "text" : "Yeah. So this is good. Uh blah blah blah. Yeah. All right. Oh yeah. So he chet's name, Bill Belchek, Parcel Subsistence head coach, and signed Paul Sales as a consultant. The Patriots Balkton NFL Commissioner Paul Taglibu worked a deal that gave the Patriots, the Jets third and fourth round picks in ninety-seven, a second round pick in ninety-eight, and a first round in ninety-nine. On top of that, the Jets also donated $300,000 to a Patriots charity in exchange for New England releasing parcels."
  },
  {
    "timestamp" : "01:12:35-01:12:40",
    "text" : "Wait, so for parcells we got a first, a second, a third, and a fourth?",
    "speaker" : "Steve"
  },
  {
    "text" : "Yes. Wow. And $300,000 donated to a patrons charity.",
    "timestamp" : "01:12:40-01:12:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:12:46-01:12:49",
    "text" : "And then Belchek was just a first rounder, right?",
    "speaker" : "Steve"
  },
  {
    "text" : "That we have to do that. I believe so. Here we go. The Patrons were awarded Wait, what? The Patriots were awarded the Jets fifth round pick in 2001 and seventh round pick in 2002. That doesn't make sense. Oh, okay. No, here we go. NFL Commissioner Paul Tagelou awarded the Jets the Patriots first round pick in 2000 and fourth and seventh round pick in 2001. And the Patriots got the Jets fifth round pick in O one and seventh round pick in O two. Yes, also some late pick five and a first. And a first.",
    "speaker" : "Andy",
    "timestamp" : "01:12:50-01:13:26"
  },
  {
    "speaker" : "Steve",
    "text" : "Is this like a you don't see coaches being traded like it does not happen often fifteen years.",
    "timestamp" : "01:13:27-01:13:33"
  },
  {
    "speaker" : "Andy",
    "text" : "It's basically those five. Yeah. Yeah. And two of those were the same guys going back and forth between the pages and the city.",
    "timestamp" : "01:13:33-01:13:39"
  },
  {
    "timestamp" : "01:13:40-01:13:44",
    "speaker" : "Steve",
    "text" : "Parcells, Homegren, all within four years."
  },
  {
    "text" : "Yeah, give or take. So maybe that was the the coach trading era. Of the NFL.",
    "timestamp" : "01:13:45-01:13:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Wonder if that'll ever come back? Probably not. I think what's harder to find a franchise QB or a franchise coach.",
    "timestamp" : "01:13:52-01:13:59"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:14:01-01:14:09",
    "text" : "Good question. And I guess that goes back to the question, would you rather start a team with Belichick or Brady?"
  },
  {
    "speaker" : "Steve",
    "text" : "Well at this point I think it's somewhat obvious, right? Brady has up Couple years left, Belichick has however long he wants.",
    "timestamp" : "01:14:11-01:14:17"
  },
  {
    "timestamp" : "01:14:18-01:14:30",
    "speaker" : "Andy",
    "text" : "I meant like from the beginning, I probably want the coach, I would think. Let me just look at um what's his name from the Chiefs, Andy Reed."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:14:30-01:14:30"
  },
  {
    "speaker" : "Andy",
    "text" : "Like He's he's been able to do it at least. He's elevated any team he's been on.",
    "timestamp" : "01:14:31-01:14:37"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:14:37-01:14:38"
  },
  {
    "speaker" : "Andy",
    "text" : "I think you could say the same with Bill Parcells too. Parcells would always create playoff teams. He was never quite as successful without Belichick, but he was still he took the Cowboys to the playoffs, right? Same with the Jets, took them to the playoffs. Yeah. So Alright, you got anything else you want to talk about in this game or you want to do best and worst?",
    "timestamp" : "01:14:38-01:15:03"
  },
  {
    "speaker" : "Steve",
    "text" : "Let me uh review my notes ease here.",
    "timestamp" : "01:15:04-01:15:06"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:15:07-01:15:09",
    "text" : "Did you see Chris Slade out there?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:15:09-01:15:10",
    "text" : "Yes."
  },
  {
    "text" : "I didn't actually see him out there, but he was on the list of players on this team.",
    "timestamp" : "01:15:11-01:15:15",
    "speaker" : "Andy"
  },
  {
    "text" : "They they called him out a little bit Did they?",
    "timestamp" : "01:15:15-01:15:17",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, I d I missed that. This was his uh this was his kind of swollen song after however many years of the Patriots. This is his last season in the NFL. He was actually third on the team with two and a half sacks though. This is the only season without uh not on the Patriots.",
    "timestamp" : "01:15:17-01:15:33"
  },
  {
    "timestamp" : "01:15:33-01:15:55",
    "speaker" : "Steve",
    "text" : "I did have a note that like Brady had 17 TDs, 10 INTs, and then throws two more. in this game. So we ended the year with what, seventeen and twelve and that's his Pro Bowl. Yeah. Which is crazy. I mean like today to think about like, oh yeah, he's got seventeen DDs and twelve INTs. It's like That's not even replacement level."
  },
  {
    "timestamp" : "01:15:57-01:15:58",
    "speaker" : "Andy",
    "text" : "Yeah, I mean it was a different game."
  },
  {
    "text" : "Actually no. He did throw a touchdown. He threw one to Wiggins.",
    "timestamp" : "01:15:58-01:16:02",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he did, yeah. You know you're right.",
    "timestamp" : "01:16:10-01:16:12"
  },
  {
    "speaker" : "Steve",
    "text" : "Which I have a note on here that's probably important. Like Wiggins had a couple catches in this game. And then you'll have a huge catch against the Raiders. Spoiler. Hopefully maybe this game.",
    "timestamp" : "01:16:12-01:16:25"
  },
  {
    "text" : "Or will he? Find out next week. So so you're right, he threw eighteen touchdowns this season. Um Did anybody know? Uh here's a here's a quiz for you. How many did he throw in the playoffs this in 2001? Touchdowns? Yeah. Um because this surprised me.",
    "timestamp" : "01:16:25-01:16:48",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:16:48-01:16:49",
    "speaker" : "Greg",
    "text" : "One."
  },
  {
    "text" : "Ooh. Greg Brown nailed it and won.",
    "timestamp" : "01:16:50-01:16:53",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. David. In the Rams game. In the Super Bowl. Yeah, right before I had a game.",
    "timestamp" : "01:16:53-01:16:56",
    "speaker" : "Greg"
  },
  {
    "text" : "Yep. It's the only touchdown he threw.",
    "timestamp" : "01:16:57-01:16:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:16:59-01:17:03",
    "speaker" : "Greg",
    "text" : "He ran for one against Oakland. Brady threw one against Pittsburgh."
  },
  {
    "text" : "You mean Bell uh Bledsoe.",
    "timestamp" : "01:17:03-01:17:05",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:17:05-01:17:06",
    "speaker" : "Greg",
    "text" : "Bloodsock, yeah."
  },
  {
    "text" : "Which was the same one that Brady would throw in the Super Bowl.",
    "speaker" : "Andy",
    "timestamp" : "01:17:07-01:17:10"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. I uh I I looked into that Ray Carew thing a little more that we talked out talked about with Bob. Yeah Yeah.",
    "timestamp" : "01:17:10-01:17:23"
  },
  {
    "timestamp" : "01:17:23-01:17:24",
    "speaker" : "Andy",
    "text" : "Anything juicy?"
  },
  {
    "text" : "Well, the only thing I think of note is how he got caught and arrested.",
    "speaker" : "Greg",
    "timestamp" : "01:17:24-01:17:30"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:17:30-01:17:32",
    "text" : "Oh boy. Yeah, we didn't touch on that."
  },
  {
    "text" : "Yeah, so he He hires the guy that shoots his eight month pregnant wife or girlfriend, right? She duh she didn't die immediately. She like went into a coma. And when they like arraigned him or whatever, he paid the bail, like a three million dollar bail. So he got out. And then she died after that. So that's when he tried to like escape in the trunk of a car of a friend. They said when they arrested him, he was like holed up in like the trunk of a car with Thirty nine hundred dollars worth of cash, bottles to hold his own urine. This sounds familiar. Candy bars and a cell phone.",
    "timestamp" : "01:17:32-01:18:17",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I feel like this was actually on the news where they had like surround the cops had surrounded the car and they were like pulling him out of the trunk.",
    "timestamp" : "01:18:17-01:18:22"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, where was he trying to get helicopter footage of it? California.",
    "timestamp" : "01:18:22-01:18:26"
  },
  {
    "text" : "And then you have uh that former boss of Nissan. Did you hear about that guy?",
    "speaker" : "Steve",
    "timestamp" : "01:18:28-01:18:34"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:18:34-01:18:35",
    "text" : "No."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah, that's indicted in Japan for like defrauding Nissan and stuff, and he like fled the country in a violin case.",
    "timestamp" : "01:18:35-01:18:42"
  },
  {
    "text" : "I'm gonna go to the city.",
    "speaker" : "Andy",
    "timestamp" : "01:18:43-01:18:44"
  },
  {
    "timestamp" : "01:18:51-01:18:56",
    "speaker" : "Greg",
    "text" : "That's the most Japanese thing ever. Everybody else gotta be in a cello case. He's a fucking violin."
  },
  {
    "speaker" : "Andy",
    "text" : "Breaker is in a goddamn car pissed in a bottle of violin. He's in a goddamn Nissan probably. Oh Jesus.",
    "timestamp" : "01:18:57-01:19:08"
  },
  {
    "timestamp" : "01:19:09-01:19:26",
    "text" : "Yeah, I actually remember that. The only other note I had was They were talking about the fans at the stadium. The they said forty for forty percent were wearing Patriots gear. Yeah. And that they heard a Let's Go Jets fan or changes fans.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:19:27-01:19:29",
    "text" : "Yeah, way to give away my worst.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So yeah, let's touch on that because um uh we uh we kind of almost talked about at the beginning, but uh this game did have playoff implications for the Patriots because They had to win this game and the Jets had to beat the Raiders for the Patriots to get the number two seed in a first round bye. And of course Our friend fucking Ron Borges decided that would be a terrible idea. And so he wrote a bunch of articles in the Boston Globe the week before saying, um That was probably a good idea for the Patriots to lose this game so that they would play wildcard weekend. What? Playing three games would be better than whoever they would face and all this extra time off would be That's retarded. That's Ron Borges. Typical Ron Bog. And the best thing was uh the day after the game, he had to do uh another article that basically said that all the players would prefer the the extra week off. Yeah. And had to walk back literally everything he said.",
    "timestamp" : "01:19:32-01:20:39"
  },
  {
    "speaker" : "Steve",
    "text" : "Well when they opened the game they had a graphic cup and it was like Patriots are the number two seed. I mean there was a bunch of people like 10 and 5 or whatever.",
    "timestamp" : "01:20:39-01:20:46"
  },
  {
    "timestamp" : "01:20:47-01:20:47",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:20:47-01:20:51",
    "speaker" : "Steve",
    "text" : "And I was like, because I don't I don't see the scores before I watch the games."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:20:51-01:20:51"
  },
  {
    "text" : "Because I like to be surprised, I guess.",
    "speaker" : "Steve",
    "timestamp" : "01:20:52-01:20:54"
  },
  {
    "timestamp" : "01:20:55-01:20:55",
    "text" : "All right.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:20:55-01:21:27",
    "speaker" : "Steve",
    "text" : "And I was like, man, how do we go from like number two to playing a wild car weekend? And then like halfway through the Yeah, second quarter like, oh yeah, if the Jets the Jets can beat Gopeland today then uh the Patriots get a bye and I was like Fucking Jets. I would root for them anyways. I would root for the Jets to lose and play on Walcott Weekend. If Rob Board just wrote that column, said, you know what? We should play on Walk on root weekend because fuck the Jets and fuck Curtis Martin, I would be like, yes. That's what it should have been. Fuck everybody at that stadium who is chinting, let's go jets, fuck them."
  },
  {
    "timestamp" : "01:21:28-01:21:30",
    "speaker" : "Greg",
    "text" : "Ooh, Steve. Fiery."
  },
  {
    "text" : "But This will be good. And I'm um sad that Mike's not here for this one. But um the Jets won it on a last second field goal thanks to um The the um uh heroic seemed like a strong word for a holder on a on a field goal attempt, but Tom Tupa Uh got a bad snap, but still managed to to pull it up and set it up for the fuck's their kicker. I don't even care. John Hall. To to to kick the game-winning field goal. So the Jets won 24-22, right? The end of the game. Yeah. So Tom Tupa is the reason the Patriots dynasty began.",
    "speaker" : "Andy",
    "timestamp" : "01:21:31-01:22:10"
  },
  {
    "text" : "That's fine. I mean they gave us the Raiders game, which is awesome, and we'll talk about that next week. All ends well, but fuck the Jets. I'll give you my best.",
    "speaker" : "Steve",
    "timestamp" : "01:22:10-01:22:19"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:22:19-01:22:21",
    "text" : "All right. Best of worst."
  },
  {
    "timestamp" : "01:22:21-01:22:22",
    "speaker" : "Steve",
    "text" : "Get right a bit, Steve."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:22:23-01:22:23",
    "text" : "Come on."
  },
  {
    "timestamp" : "01:22:24-01:22:58",
    "speaker" : "Steve",
    "text" : "So they uh the commentators were like Brady had a hard count and it was like third and six or something like that, right? And he gets a hard count. And gets uh offsides and they're like, oh yeah, you know, Brady's hardcow is part of his arsenal. And like literally while they're talking about how this This hard count is part of his own Brady busts out the quarterback sneak. I don't know if I don't I can't remember a Brady QB sneak like that. During the season? Nothing not nothing stuck out."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:22:58-01:23:05",
    "text" : "On the not on the quick. Not on like the yeah, just like the the hurry up, get to the line and do it real quick. Yeah."
  },
  {
    "text" : "And I was like, that's that's his like number one.",
    "speaker" : "Steve",
    "timestamp" : "01:23:06-01:23:08"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:23:10-01:23:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:23:11-01:23:17",
    "text" : "And to be fair, Steve. Neither you nor I have watched any of the games this year, so we could have to I watch them."
  },
  {
    "timestamp" : "01:23:17-01:23:54",
    "speaker" : "Andy",
    "text" : "I don't know if we saw the articles. Yeah, no, I feel like it may have came up once. But it may have been the one of the games that you guys were on is just me and Mike. I mean like the fucking early Dolphins game. But yeah, no, they they they were it hadn't happened often, if at all. So this is this first, yeah. The beginning of what was a legendary run of him converting on two yards. Yeah, that's true, one yard at a time. Uh that's great. Alright, and your worst was the Jet stuff? Yeah, fuck them. Yeah, that's fair. All right, Greg, what about you?"
  },
  {
    "timestamp" : "01:23:54-01:24:14",
    "speaker" : "Greg",
    "text" : "All right. So my best, there was a couple there was a couple instances where they they put in the uh you know like the in-game highlight package where they give you the update around the league. Oh, you might be stealing my best, yeah. Well there was two. Okay. I'll leave the one I think you're gonna go with."
  },
  {
    "timestamp" : "01:24:14-01:24:17",
    "speaker" : "Andy",
    "text" : "No, no, you you can do them both. I'm sure I can find something else."
  },
  {
    "timestamp" : "01:24:17-01:24:26",
    "text" : "Okay. Well the first one was a uh Chris Fumatuma Fala sighting. Yeah. Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:24:26-01:24:29",
    "speaker" : "Andy",
    "text" : "Oh yeah, we'll we'll get to talk about him next week, I think. But yeah."
  },
  {
    "timestamp" : "01:24:31-01:24:31",
    "speaker" : "Steve",
    "text" : "Enough said."
  },
  {
    "timestamp" : "01:24:33-01:24:36",
    "speaker" : "Greg",
    "text" : "Chris Ferman, he's one bad mafala."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:24:38-01:24:41",
    "text" : "I like that pronunciation on the first go too."
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, uh I've thought a lot about that man's name in my life. Oh my god, he's one of the bestumafala.",
    "timestamp" : "01:24:41-01:24:50"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:24:51-01:25:02",
    "text" : "Up there with uh Tim Biyakabatuka and um Uh oh Manawanui. So both first try. How about that?"
  },
  {
    "speaker" : "Greg",
    "text" : "So the other one was the one I think you were thinking of was Keith the tractor trailer. Yes. Intercepting the running at like probably 60 yards.",
    "timestamp" : "01:25:02-01:25:14"
  },
  {
    "text" : "Wait, did he do this for the Patriots? Because I saw that and I was like, I feel like I've seen that play with him in a different jersey. Or maybe I'm just remembering that.",
    "timestamp" : "01:25:15-01:25:22",
    "speaker" : "Steve"
  },
  {
    "text" : "Wasn't that Ted Washington? Yeah, the 31-0 game.",
    "speaker" : "Andy",
    "timestamp" : "01:25:26-01:25:29"
  },
  {
    "text" : "Yeah, I think so. Yeah.",
    "timestamp" : "01:25:29-01:25:30",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:25:30-01:25:39",
    "speaker" : "Andy",
    "text" : "But no, it because I mean we've seen other nose tackles return uh fumbles or or interceptions. Like we've seen Vince Wolford do it a couple times."
  },
  {
    "timestamp" : "01:25:40-01:25:42",
    "speaker" : "Greg",
    "text" : "And it's it's always awesome."
  },
  {
    "timestamp" : "01:25:42-01:25:45",
    "speaker" : "Andy",
    "text" : "But I've never seen anybody move as slow as Keith Traylor did in this."
  },
  {
    "timestamp" : "01:25:46-01:25:56",
    "speaker" : "Greg",
    "text" : "Well and the best part is he gets like forty yards in. Yeah. And he starts looking around for someone to pitch the ball to because you could tell he was just so beat. He's like, fuck this."
  },
  {
    "speaker" : "Andy",
    "text" : "Somebody take this thing. And he couldn't find anybody. So he so at the end he just kind of fell over. Nobody tackled him. He just kind of like went down in a heap at the five yard line. He was just all done.",
    "timestamp" : "01:25:56-01:26:06"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:26:07-01:26:10",
    "text" : "Fat man touchdowns or fat man returns are the best."
  },
  {
    "timestamp" : "01:26:10-01:26:16",
    "text" : "Oh, they're so good. Like the referee was outrunning them and like having to like just jog to slow down a bit. I just looked it up.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:26:17-01:26:27",
    "text" : "He has another 62 yard return. That was 67. Wow. 62 and 97. Did he score? Nope, he hasn't scored a touchdown."
  },
  {
    "text" : "I bet he didn't. He just runs out of juice.",
    "speaker" : "Andy",
    "timestamp" : "01:26:27-01:26:30"
  },
  {
    "speaker" : "Steve",
    "text" : "And the best I will say when uh Will Fork does it, he actually looks like athletic about it. He did well Will Fork is sure we'll talk about it.",
    "timestamp" : "01:26:30-01:26:39"
  },
  {
    "timestamp" : "01:26:41-01:26:44",
    "speaker" : "Andy",
    "text" : "Yeah. He he's he's thrown a stiff arm at one on one of 'em."
  },
  {
    "timestamp" : "01:26:45-01:26:47",
    "speaker" : "Greg",
    "text" : "He transfers the ball from one arm to the other."
  },
  {
    "text" : "Yeah, yeah. He's holding it like an actual football player instead of like a loaf of bread.",
    "speaker" : "Andy",
    "timestamp" : "01:26:48-01:26:51"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:26:52-01:26:55",
    "text" : "I mean the all-time worst is Leon Lett."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:26:56-01:26:56"
  },
  {
    "text" : "He put shame to the fat man name. Yeah. He did, he did, yeah. Don BB.",
    "speaker" : "Greg",
    "timestamp" : "01:26:57-01:27:01"
  },
  {
    "timestamp" : "01:27:02-01:27:08",
    "text" : "Yep. Nice deep dive. I like that. Yeah. Alright, so what's your worst then?",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh I hadn't really thought of it. The only other note I had in here was is when they uh I guess I could spin into a worst. They were talking about Brady and like they had m you know, they have the meetings the night before.",
    "speaker" : "Greg",
    "timestamp" : "01:27:08-01:27:22"
  },
  {
    "timestamp" : "01:27:22-01:27:23",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "And and they said that he was wearing baggy blue jeans and it was hanging barely on his fanny. Sign of the times, yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:27:23-01:27:33"
  },
  {
    "speaker" : "Andy",
    "text" : "And a backwards baseball cap.",
    "timestamp" : "01:27:33-01:27:35"
  },
  {
    "timestamp" : "01:27:35-01:27:42",
    "text" : "Yeah. He was barely on his fanny. They tell you the kids these days.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:27:45-01:28:19",
    "speaker" : "Andy",
    "text" : "That's a pretty good one. All right, I'll give you that. All right, let's see. What's what's my best here? Um I got a lot of worse in this game. This is a sloppy game. Oh, so sloppy. Um One of my best was um the infographics they put up, just the title of one of them, was Panthers or Pussycats. Ooh, just show it was just showing how they ranked last in like everything and With second to last and everything else. That's a week 17."
  },
  {
    "text" : "Yeah, it's a week 17 graphic. No one's watching this game, right? We can we can go with the Pussycat's graphic.",
    "timestamp" : "01:28:20-01:28:27",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:28:28-01:28:31",
    "text" : "Jokes on them. It's 2020. We're watching it."
  },
  {
    "text" : "It was so good. Um let's see. I feel like Yeah, that's probably as as best it's gonna get for stuff we haven't talked about. Um I think the worst was basically all of garbage time at the end of this game. There was uh Patriots uh fourth so this is how the fourth quarter went. Brady tried to hit Patton deep on uh on third down, up like, I don't know, two touchdowns already Um oh they're up 24-6 and they just he's just like going deep just for the hell of it. And so they punt uh the next play, Winky fumbles a snap, the patch recover, and Brady scores a touchdown. And then um Smith finally gets his pick six. This is still in the fourth quarter. And then at the end, like The Panthers is still kind of trying to go for it, but um it's like fourth and really long. The pass jump off sides on the fourth down play. And Winky drops back. He's got a free play, drops back, and gets blindsided, drops the football. And it literally just like sits there. Like nobody goes to recover it because like it doesn't fucking matter. It's a free play anyway. So like eventually one of the Patriots players jumps on it. And uh And so and this is all in a play that just like doesn't fucking count. And then so the the the Panthers get uh an a duo over now it's like fourth and two instead of fourth and seven.",
    "timestamp" : "01:28:32-01:30:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:30:06-01:30:11",
    "speaker" : "Greg",
    "text" : "Well that was uh that was a foreshadowing for Cam Newton in the Super Bowl. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "It's Panther style.",
    "timestamp" : "01:30:12-01:30:13"
  },
  {
    "text" : "Nah, I don't want to I don't want to pick that up.",
    "speaker" : "Greg",
    "timestamp" : "01:30:13-01:30:15"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:30:16-01:30:33",
    "text" : "It was, yeah. Wiggie's just like sitting there watching the ball. He's like, yeah, I'm good. Um and then so they have fourth and two, which they could have converted, but and then Winky goes and almost throws yet another interception to Otis Smith. And that's basically how the game ended. And it was just like running out the clock. Yeah, it was just like such a shit show."
  },
  {
    "text" : "They had their chance, I'm telling you, because their running back was gashing us. It was awful. It was good. He just committed a bunch of dumb penalties and Winky was just could not stop throwing picks.",
    "timestamp" : "01:30:33-01:30:44",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:30:44-01:31:12",
    "text" : "Uh a couple other honorable mentions for worse. Um Steve Smith fumble on the kick return was his eighth fumble on kick returns that season. Yeah, I had that note too. He's talking eighth and he's he still made the the Pro Bowl. Yeah. Different game back then. And then on the opening kickoff, Patrick Pass returned it. Yeah. Tackled as he was going out of bounds and hit the plastic tarp. And slid so far that he hit the the benches and injured himself.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Dude, he was jacked up the whole game. Like he kept playing, but tell his shoulder is fucked up from like Yeah. Hitting that bench I could have been.",
    "timestamp" : "01:31:13-01:31:19"
  },
  {
    "timestamp" : "01:31:19-01:31:29",
    "speaker" : "Andy",
    "text" : "Yeah, because he made a couple of tackles on Steve Smith on kick returns. But yeah, he was all like yeah, he would come limping off every time. Remember when Reggie started with that was that fucking play?"
  },
  {
    "text" : "In the Super Bowl? Or in the Super Dome?",
    "speaker" : "Steve",
    "timestamp" : "01:31:30-01:31:32"
  },
  {
    "text" : "Yep. Oh yeah yeah yeah. Didn't he try to kind of remind me of that? Yeah he did.",
    "speaker" : "Andy",
    "timestamp" : "01:31:33-01:31:37"
  },
  {
    "timestamp" : "01:31:37-01:31:38",
    "text" : "He sued the super dome.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:31:39-01:31:40",
    "speaker" : "Andy",
    "text" : "It was something, yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:31:41-01:31:43",
    "text" : "Or it might have been the Rams old stadium."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, it was one of those domes. Oh and I had one more cement on the outside. Yeah.",
    "timestamp" : "01:31:43-01:31:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it had a cement ring before they hit the the actual like stadium wall. And that's what he he slid on and and yeah tore his shape.",
    "timestamp" : "01:31:49-01:31:57"
  },
  {
    "timestamp" : "01:31:57-01:32:07",
    "speaker" : "Steve",
    "text" : "Yeah, that that uh when he did that, I was like, that looked like Reggie Bush. Cause like he's flying and then like all of a sudden it's a bunch of shit."
  },
  {
    "text" : "Yeah, and he's there's no way to stop. He literally slid on his stomach. Yeah like five ten yards at full speed into the the footing of the the those metal benches that they have on the sidelines. But I had one more um trivia note that I thought was pretty cool on Winky's second interception, the one to Otis Smith that got called back, that was tipped. The receiver that tipped it was Donald Hayes, who the year after would actually be playing for the Patriots and catching touchdowns for them.",
    "timestamp" : "01:32:07-01:32:40",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:32:41-01:32:43",
    "text" : "Wasn't he a Dolphins guy?",
    "speaker" : "Speaker 6"
  },
  {
    "speaker" : "Andy",
    "text" : "Donald no, Donald Hayes was with the Panthers for one, two, three, four years. This was his last year as the Panthers and then",
    "timestamp" : "01:32:44-01:32:52"
  },
  {
    "timestamp" : "01:32:52-01:32:55",
    "speaker" : "Greg",
    "text" : "You're thinking of Donald Driver, Steve."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah, yeah. Probably true.",
    "timestamp" : "01:32:55-01:32:58"
  },
  {
    "timestamp" : "01:32:58-01:33:01",
    "speaker" : "Steve",
    "text" : "Packers and for the Path in O2."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:33:04-01:33:11",
    "text" : "One of the many of those uh one-hit wonders that would be on Tom Brady's list of 77 different receivers."
  },
  {
    "speaker" : "Steve",
    "text" : "So many of them. Oh, I have one note before we wrap it up.",
    "timestamp" : "01:33:12-01:33:21"
  },
  {
    "text" : "Give it to me.",
    "speaker" : "Andy",
    "timestamp" : "01:33:22-01:33:22"
  },
  {
    "text" : "The end of the second half.",
    "timestamp" : "01:33:23-01:33:26",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:33:26-01:33:26",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:33:27-01:33:30",
    "speaker" : "Steve",
    "text" : "When they had the Hail Mary chance, the Panthers did."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah",
    "timestamp" : "01:33:30-01:33:31"
  },
  {
    "text" : "And in the first half? Yeah, the first half. And the Patriots rushed one player. And then someone blitz. Like literally they rushed one. They did. And then then one of the linebackers blitzed in like literally the other four guys like Nolly off the end, yeah, eventually. And he forced a fumble. And the commentators even better than that.",
    "speaker" : "Steve",
    "timestamp" : "01:33:31-01:33:53"
  },
  {
    "speaker" : "Andy",
    "text" : "Is that a fumble? Like no, it's a tuck rule. Yes. It it was the tuck rule. Yeah. And it came into effect yet again. This is the second time we've seen it this season because it came into effect in the first Jets game too, back in week two.",
    "timestamp" : "01:33:53-01:34:07"
  },
  {
    "text" : "Yeah, everyone remembers I mean you can always point to that first Jets game and be like, oh well yeah, this is where it happened at once. I like I don't think anyone's really thought of this.",
    "speaker" : "Steve",
    "timestamp" : "01:34:07-01:34:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but that was literally the play that ended the first half was Yep.",
    "timestamp" : "01:34:16-01:34:19"
  },
  {
    "speaker" : "Steve",
    "text" : "It was clearly a fumble. It was clear fumble. It was actually a very similar kind of hit.",
    "timestamp" : "01:34:19-01:34:24"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:34:25-01:34:30",
    "text" : "Almost exactly. Yeah, he was pulling the ball down and got hit and it came."
  },
  {
    "speaker" : "Steve",
    "text" : "Got hit from his right side from a guy blitzing like free.",
    "timestamp" : "01:34:30-01:34:33"
  },
  {
    "timestamp" : "01:34:33-01:34:34",
    "speaker" : "Andy",
    "text" : "Yep."
  },
  {
    "speaker" : "Steve",
    "text" : "And got the wall.",
    "timestamp" : "01:34:34-01:34:35"
  },
  {
    "timestamp" : "01:34:35-01:34:41",
    "speaker" : "Greg",
    "text" : "So you're saying that The Tuck and the Patriots game, the Raiders game was a fumble too then."
  },
  {
    "speaker" : "Steve",
    "text" : "No, because it wasn't.",
    "timestamp" : "01:34:41-01:34:42"
  },
  {
    "text" : "You just said that this one was clearly a fumble.",
    "speaker" : "Greg",
    "timestamp" : "01:34:46-01:34:48"
  },
  {
    "text" : "Well in today's game, yes, it is clearly a fumble.",
    "speaker" : "Steve",
    "timestamp" : "01:34:49-01:34:52"
  },
  {
    "timestamp" : "01:34:52-01:34:53",
    "text" : "Oh.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Is it though? Did they change a tuck rule? Oh interesting. If you'd watch the game, Greg, you'd know.",
    "timestamp" : "01:34:53-01:35:02"
  },
  {
    "timestamp" : "01:35:04-01:35:10",
    "text" : "I did not see that part. Watch more than usual. Yep.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:35:11-01:35:18",
    "speaker" : "Andy",
    "text" : "I'll give you credit for that. All right. Anything else anybody wanted to to touch on here? I think that's all my notes."
  },
  {
    "text" : "Yep. Foreshadowing next week. Raiders, one of my favorite games of all time.",
    "speaker" : "Steve",
    "timestamp" : "01:35:18-01:35:23"
  },
  {
    "text" : "Yeah, I think you're not alone in that.",
    "timestamp" : "01:35:23-01:35:25",
    "speaker" : "Andy"
  },
  {
    "text" : "The snowball.",
    "timestamp" : "01:35:27-01:35:28",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "The snowball. That's right.",
    "timestamp" : "01:35:28-01:35:30"
  },
  {
    "speaker" : "Greg",
    "text" : "Let it snow.",
    "timestamp" : "01:35:30-01:35:31"
  },
  {
    "timestamp" : "01:35:33-01:35:47",
    "speaker" : "Andy",
    "text" : "We will see you next week for a playoff edition of the Patriots Dynasty Podcast. Thanks for listening. I'm dreaming of a wall. Stop."
  },
  {
    "speaker" : "Mom",
    "text" : "Stop to stop stop.",
    "timestamp" : "01:35:47-01:35:48"
  }
]