[
  {
    "timestamp" : "00:00-00:19",
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to To. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother."
  },
  {
    "text" : "Okay. Welcome back to the uh uh special edition really of the Pagers Dynasty Podcast, the playoff edition. We have made it to the playoffs, boys. Congratulations. How you feeling about that?",
    "speaker" : "Andy",
    "timestamp" : "00:22-00:37"
  },
  {
    "text" : "Just like the rest of the Patriots Nation in two thousand and one, I didn't think we'd make it this far.",
    "speaker" : "Steve",
    "timestamp" : "00:38-00:44"
  },
  {
    "text" : "It's just another game. Business as usual.",
    "speaker" : "Greg",
    "timestamp" : "00:45-00:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh I don't believe you. I appreciate I appreciate the tone.",
    "timestamp" : "00:50-00:55"
  },
  {
    "text" : "It's only the greatest game. Of the dynasty. I'm saying it. I'm saying it.",
    "speaker" : "Greg",
    "timestamp" : "00:56-01:02"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04-01:13",
    "text" : "Immediate. Coming out firing. Let's let's start with that then. I wanna I wanna I want your your take on this. Defend your hot take."
  },
  {
    "text" : "Dude, the scene? I mean if you love football You gotta love this game. You know what I'm saying? Just the snow coming down and droves. Yeah. Coming down to the last play, controversy. Brady putting his stamp on the league. It's just everything. Like there's so many players that had like their coming out party today too. Like Brusky, Seymour, Tylaw, like it was just an unbelievable game.",
    "speaker" : "Greg",
    "timestamp" : "01:14-01:41"
  },
  {
    "text" : "It really was. I mean I I'm not gonna Argue with you. I think it's definitely up there. I don't know if it's the best game ever. Yeah. But top five at the very least. I'm with Andy, yeah. In in memorable games, I think maybe.",
    "timestamp" : "01:42-01:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "The best atmosphere. Yeah. Last game at Foxborough. Like there's so many things. It's unbelievable. Yeah. Maybe I would take a point.",
    "timestamp" : "01:59-02:09"
  },
  {
    "timestamp" : "02:09-02:15",
    "speaker" : "Steve",
    "text" : "I would go so far as to say best non-Super Bowl. Okay."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:16-02:27",
    "text" : "Okay. I can I can only think of one other game, best non-Super Bowl game that probably give this a run for its money, and that was the one against the Ravens. Yeah, I'll see that too."
  },
  {
    "timestamp" : "02:27-02:28",
    "text" : "That was a good game.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "02:28-02:37",
    "text" : "But this is better than that because like to all the things Greg noted, right? Brady's coming out party in the snow. Last game Fox Brosta had a ton of character.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:37-02:46",
    "text" : "That's true, yeah. Yeah, just the the imagery of every time guys would butt heads the puff of snow would come off the top of their helmets sort of thing."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:47-02:54",
    "text" : "And the Raiders wearing black? Or like, you know, the black trim on that Made it even better because the snow versus the black looked so sick."
  },
  {
    "timestamp" : "02:55-03:02",
    "speaker" : "Greg",
    "text" : "It was pretty good. Anytime money gets tackled, they wake up and walk uh they get up and they got a face full of snow."
  },
  {
    "timestamp" : "03:04-03:22",
    "text" : "Pretty much every Antoine Smith run ended with him just like a complete face mask full of snow. It's the most football football game ever. It's up there. It's definitely up there. I will, yeah, I'll give you that. Alright. I think you've converted me. To the best ever.",
    "speaker" : "Andy"
  },
  {
    "text" : "That was easy. The best ever.",
    "speaker" : "Greg",
    "timestamp" : "03:22-03:24"
  },
  {
    "timestamp" : "03:24-03:27",
    "speaker" : "Andy",
    "text" : "Best ever so far on this podcast for sure."
  },
  {
    "speaker" : "Greg",
    "text" : "That's for sure.",
    "timestamp" : "03:28-03:29"
  },
  {
    "speaker" : "Andy",
    "text" : "So let's talk about this game. This yeah, like we said, last ever game at Foxboro Stadium. Uh it was actually supposed to be Uh a few weeks ago at their last home game, but this uh the it was supposed to be demolished by now already. Yeah. But it was um still standing because they had one more game to play in it, and that was this one. So hell of a way to end. Uh going up against the Raiders who finished first in the AFC West and I remember them being good. I don't remember I didn't remember how good they actually were. Um Just in terms of numbers, they uh Rich Gannon was a pro bowler. He had 27 touchdowns and nine interceptions on this season, which is the best like interception percentage in the league. Yeah. He was fourth in the league in touchdown passes, fifth in passing yards. Like he the wide receivers were Tim Brown, Jerry Rice, who both had over a thousand yards and both had nine uh receiving touchdowns. Like this was a fucking stacked offense.",
    "timestamp" : "03:31-04:28"
  },
  {
    "text" : "I think they were getting old though, weren't they?",
    "timestamp" : "04:30-04:32",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I mean I think this was like the end of Jared Ice's career, obviously. I think It was either this year or the year after was when he went to um Seattle for his last year. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "04:33-04:43"
  },
  {
    "text" : "They went to the Super Bowl the next year though.",
    "timestamp" : "04:43-04:46",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "04:46-04:51",
    "speaker" : "Andy",
    "text" : "They did, yeah. Was he on that team? I think I think he I think he was, yeah. That makes sense."
  },
  {
    "timestamp" : "04:52-05:00",
    "speaker" : "Greg",
    "text" : "Right, because Gruden would Gruden would leave Oakland after this year, right, to go to Tampa, and then they would play each other in the Super Bowl next year."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "05:01-05:07",
    "text" : "Right. I actually have a really hardcore Raiders fan, so we interviewed him about this. Oh that's right we did."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, let's uh let's go to that real quick.",
    "timestamp" : "05:07-05:09"
  },
  {
    "text" : "Oh boy. Alright, uh we got my friend Navi joining us. Navi is the biggest Oakland Raiders fan that I know. Actually the only Oakland Raiders fan that I know. Oh yes. Oh I'm sorry. Sorry. So I've known Navi for I don't know close to ten years or so.",
    "timestamp" : "05:13-05:37",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "05:37-05:38",
    "speaker" : "Andy",
    "text" : "God damn."
  },
  {
    "timestamp" : "05:38-05:44",
    "speaker" : "Steve",
    "text" : "He's always been a doctor. Raiders guy. Hey man, your brother's a good guy."
  },
  {
    "timestamp" : "05:46-05:49",
    "text" : "See everybody everybody keeps saying that, but I don't know if they know the real Steve Brand.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "05:53-05:55",
    "text" : "The third of July is a a great tradition, you know.",
    "speaker" : "Navi"
  },
  {
    "timestamp" : "05:55-06:07",
    "speaker" : "Steve",
    "text" : "There's a after a great Fourth of July party and hobby's maybe take too many blue blue shots, yeah. So this is our payback making him relive the Patriots Raiders playoff."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:07-06:11",
    "text" : "Well he said uh before we started this, he said he actually went back and rewashed his game."
  },
  {
    "timestamp" : "06:12-06:16",
    "speaker" : "Navi",
    "text" : "Yeah, that's crazy. Yeah, I actually just rewatched it. I just finished up like an hour ago."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I mean it it was an exciting game. Yes. Yeah. I mean the ending Yeah. I I think the uh it's it's it would be like us going back and watching the two thousand seven Super Bowl. It's an exciting game, but doesn't end the way I want it to, so I don't know if I'll ever watch it again. No, yeah.",
    "timestamp" : "06:17-06:34"
  },
  {
    "speaker" : "Navi",
    "text" : "I mean it felt It felt just dominance by the Raiders until the fourth quarter and you know, second half actually, Brady was just on fire just thinking dunked passes and You know, the snow definitely came into a factor where everybody's slipping. I mean, even David Patton was slipping, but he was still catching the ball.",
    "timestamp" : "06:35-06:51"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, David Patton seemed to catch more balls after he had fallen down than beforehand, I felt like in this game.",
    "timestamp" : "06:51-06:56"
  },
  {
    "speaker" : "Navi",
    "timestamp" : "06:57-07:06",
    "text" : "Yeah, I'd say the exact same. Like, you know, like every time he caught a ball that was like a first down, like it was like a ten yard pass, he would fall down, get back and catch it."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he's like on his own.",
    "timestamp" : "07:06-07:07"
  },
  {
    "text" : "Do you remember watching this game the first time, Navi? Yeah. How old are you?",
    "speaker" : "Steve",
    "timestamp" : "07:07-07:13"
  },
  {
    "text" : "Yeah, hang on, let's let's uh let's rewind a little bit. So uh are you are you from the Oakland area originally?",
    "speaker" : "Andy",
    "timestamp" : "07:13-07:20"
  },
  {
    "timestamp" : "07:20-08:03",
    "text" : "No, no, I'm born and raised in Northern Virginia. Um little backstory how I became a Raider fan is really uh just hip hop actually was like one like the one way that, you know, the Raider brand was always shown. I was like always a young kid that loved hip hop. Um, you know, and then just hearing about the Raiders defense back in the days, how like dirty, how hardcore they were. Bo Jackson, you know, was everywhere you're playing, you know, the Bo Jackson Techno Bowl game. But really how it truly became a Raider fan was Watching the Michigan Ohio State game and watching Charles Woodson just take that punt, return back for a touchdown.",
    "speaker" : "Navi"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:03-08:06",
    "text" : "Oh yeah. Is that the one we did the Heisman pose at the end?"
  },
  {
    "text" : "Yeah, it was kinda like my first like, you know, college football game that I actually like vividly remember. I'm like, man, that fucking just badass. And little you know, next you know, he's drafted by the Raiders Boom. Got all the colored jerseys, you know, for the Charles Whitman. I got the white, got the black, got the silver. You know, it was just from then on out it was just based on",
    "timestamp" : "08:06-08:29",
    "speaker" : "Navi"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:30-08:32",
    "text" : "The more version of Tylaw for Greg."
  },
  {
    "text" : "Yeah. Every single variation of jersey, like Pro Bowl Ty Law jerseys, which apparently they make.",
    "timestamp" : "08:33-08:41",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, it was just like, you know, just like getting older and like, you know, just kind of like looking back at the Raiders. You know, I'm looking at Jack Tatum, Lester Hayes, all of them just whooping people's asses, playing dirty. Yeah, Ted Hendrix, the linebackers can go on and on, you know, the tradition's like no other. Like The Raiders are just you know, you can't put a city name in front of them. They're just the Raiders.",
    "speaker" : "Navi",
    "timestamp" : "08:48-09:12"
  },
  {
    "timestamp" : "09:13-09:14",
    "speaker" : "Steve",
    "text" : "So how do you feel about that movie?"
  },
  {
    "speaker" : "Navi",
    "text" : "Do you even like it's go from a thirteen I love it, 'cause you go from a thirteen point three sales, income tax or whatever, you know, state tax to a zero. All these all these players are gonna look at it like, hey, I get more money now. Yeah. In my pocket.",
    "timestamp" : "09:14-09:29"
  },
  {
    "timestamp" : "09:30-09:37",
    "speaker" : "Andy",
    "text" : "I still think we can move Gillette to New Hampshire for that exact same reason. Not just because it'd be closer for me."
  },
  {
    "speaker" : "Navi",
    "text" : "Hey man, Vegas, that scene looks like Uh what's that Star Wars? Yeah, it looks awesome.",
    "timestamp" : "09:38-09:45"
  },
  {
    "timestamp" : "09:45-09:46",
    "speaker" : "Steve",
    "text" : "Like the Death Sorry. Yeah."
  },
  {
    "timestamp" : "09:47-09:48",
    "text" : "Death story now.",
    "speaker" : "Navi"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "09:48-10:00",
    "text" : "Yeah. It it is seems like the perfect fit though. The Raiders, like like you said, that whole brand of like the black hole plus Venus. It seems like a Like that's a way more of a fit than like the Chargers in LA."
  },
  {
    "speaker" : "Navi",
    "text" : "The Chargers in LA they should they should be the nomad team. They shouldn't even have a home game.",
    "timestamp" : "10:01-10:06"
  },
  {
    "timestamp" : "10:06-10:06",
    "speaker" : "Steve",
    "text" : "I know."
  },
  {
    "text" : "They should be playing on the road all you know. Yeah. But yeah, I mean the Vegas Stadium, I mean, who's gonna say no to a free two billion dollar brand new stadium? Right. Exactly. You know. But um yeah, from there's nothing but the Raiders and I've gone through the the black hole, the dark dark, dark days of being a Raiders fan.",
    "speaker" : "Navi",
    "timestamp" : "10:06-10:32"
  },
  {
    "text" : "So I don't think anybody's gonna be a little bit more than a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of There were a few of them in there. This wasn't that time though. This was uh this was a good time to be a Raiders fan with the John Gunn.",
    "speaker" : "Andy",
    "timestamp" : "10:32-10:39"
  },
  {
    "text" : "Yeah, this was a good time. This was uh That tuck roll was the change of the you know, the guard of the Raiders. That team right there that played the Patriots and that tuck roll, that was That and then following season was a very veteran team. Like you had barely any young players on the team I mean I think Charlie Gardner might have been one of the youngest players on the team. Charles Woodson might have been one of the youngest players on the team.",
    "timestamp" : "10:39-11:06",
    "speaker" : "Navi"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "11:07-11:09",
    "text" : "Yeah, they mentioned it in the broadcast too."
  },
  {
    "text" : "Yeah, they did mention it. Um, I mean they did have a first round pick, Eric Gibson from Florida State, but I mean he was, you know, they're they're sprinkling in young guys, but",
    "timestamp" : "11:09-11:23",
    "speaker" : "Navi"
  },
  {
    "text" : "Yeah. But I mean the Patriots are were kind of a similar story too because Belichick had literally uh they've been talking about it all season how they had gone in and brought in like eighteen or twenty veteran free agents and all of them were like ten plus year vets just to to get that that sort of like set in the tone of the like what the team's gonna be.",
    "speaker" : "Andy",
    "timestamp" : "11:23-11:45"
  },
  {
    "text" : "I mean you could have done that back in the day, but now I feel like it was just a young man's game. These guys are just smarter, faster, and just better, you know, coming out. You don't have two hundred forty pound linebackers that are playing three downs. No.",
    "speaker" : "Navi",
    "timestamp" : "11:45-11:59"
  },
  {
    "text" : "Exactly, yeah. Those those middle linebackers are there just to stop the run, sort of thing.",
    "speaker" : "Andy",
    "timestamp" : "12:03-12:07"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Yeah. Yeah. Brian Cox is of the world.",
    "timestamp" : "12:07-12:10"
  },
  {
    "text" : "Right, yeah.",
    "speaker" : "Andy",
    "timestamp" : "12:10-12:10"
  },
  {
    "speaker" : "Navi",
    "timestamp" : "12:13-12:16",
    "text" : "I forgot about Roman Pfeiffer was on like on your team."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "12:16-12:16"
  },
  {
    "timestamp" : "12:18-12:21",
    "speaker" : "Navi",
    "text" : "You know, looking at uh who's that Pleasant guy or something? I was on the deepest line."
  },
  {
    "timestamp" : "12:22-12:22",
    "speaker" : "Andy",
    "text" : "I remember Pleasant."
  },
  {
    "speaker" : "Navi",
    "text" : "Yeah, I just remember playing man, I'm like, holy shit man, this is like a memory like a trip back memory lane.",
    "timestamp" : "12:23-12:27"
  },
  {
    "speaker" : "Steve",
    "text" : "I know. 'Cause you I just I on I honestly forgot Jerry Rice was even in this game.",
    "timestamp" : "12:28-12:34"
  },
  {
    "speaker" : "Navi",
    "text" : "Oh man, y I mean they had two thousand",
    "timestamp" : "12:34-12:36"
  },
  {
    "timestamp" : "12:38-12:42",
    "speaker" : "Andy",
    "text" : "Yeah, they both had Tim Brown both had a thousand yards each."
  },
  {
    "timestamp" : "12:42-12:48",
    "speaker" : "Steve",
    "text" : "Weren't they only like thirty yards apart in the whole season too? They're both over like eleven hundred yards. Yeah, nine touchdowns."
  },
  {
    "speaker" : "Navi",
    "text" : "And then uh Charlie.",
    "timestamp" : "12:48-12:49"
  },
  {
    "speaker" : "Steve",
    "text" : "Didn't know Jerry Rice was that good. outside of Sam Fran.",
    "timestamp" : "12:49-12:52"
  },
  {
    "timestamp" : "12:53-13:36",
    "text" : "Dude, he I mean, let's just forget about his Seattle Seahawks days, but he was a beast for the Raiders. I mean you look at it now, it was like Bruden wanted Antonio Brown to be his Jerry Rice. But let's not revisit that last summer debacle but Uh yeah, I think we can all agree on that. That was a headache, man. That was the worst hangover I ever had. But um no, I mean you had those two receivers, you had Charlie Gardner who had like I don't know, seventy five catches on the year. Um James Jett barely sprinkled in there. Then you have John Ritchie and uh our tight end was uh Roland Williams before Doug Jolly and all these other guys came around but I mean John Richie was catching balls out the backfield. That's a big boy.",
    "speaker" : "Navi"
  },
  {
    "timestamp" : "13:36-13:42",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, just the size of the the players in these old games as Yeah."
  },
  {
    "timestamp" : "13:42-13:44",
    "speaker" : "Navi",
    "text" : "I mean a linebacker now is a lineman."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, every single one of these guys looks like they could play fullback with no problem in today's NFL.",
    "timestamp" : "13:45-13:51"
  },
  {
    "text" : "Definitely, definitely. But yeah, I mean That that team right there man, like PTSD, man, that that talk rule is just a nightmare. I forgot about it until you sat the other day and I was like, this motherfucker",
    "timestamp" : "13:52-14:04",
    "speaker" : "Navi"
  },
  {
    "timestamp" : "14:07-14:08",
    "text" : "Well that's what I think.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:11-14:17",
    "speaker" : "Navi",
    "text" : "I mean, that team was like a off and on again team that year 'cause I mean they closed the season out with three losses."
  },
  {
    "text" : "They did, yeah. So actually I wanted to ask you about this because you'll probably know better than we will, because the last loss which gave Patriots this the two seed was to the New York Jets. And I feel like I remember something because then they had to play the Jets like six later in the in the wild card. Yep. And I feel like I remember a story about how The Raiders played the first game kind of pretty vanilla because they didn't want to give anything away. The Jets had to show what they had to be because they needed to win to get in the playoffs and and the Raiders didn't. Yeah, yeah.",
    "timestamp" : "14:17-14:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Navi",
    "timestamp" : "15:00-15:15",
    "text" : "Um I wouldn't put it past Gruden, you know. saying, hey, let's just you know, just dog this one out or, you know. I wouldn't think he would actually say it, but you know, he kept it very vanilla I mean they whooped their Jets ass the next week."
  },
  {
    "timestamp" : "15:15-15:24",
    "text" : "They did, yeah. And that I actually watched the highlights for that. That was a really good game. Charlie Garner.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Navi",
    "timestamp" : "15:25-15:27",
    "text" : "Charlie Gardner, local Virginia kid, man."
  },
  {
    "text" : "Oh no kid.",
    "speaker" : "Andy",
    "timestamp" : "15:27-15:28"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "15:28-15:31",
    "text" : "I had forgotten who Charlie Gardner was, to be honest. I was like, oop."
  },
  {
    "timestamp" : "15:31-15:33",
    "speaker" : "Navi",
    "text" : "He was a beef for us."
  },
  {
    "text" : "Who's your favorite player on that team?",
    "speaker" : "Steve",
    "timestamp" : "15:35-15:37"
  },
  {
    "speaker" : "Navi",
    "text" : "My favorite player on that team was Charles Woodson, hands down. I mean if you want to go away from all time. Yeah. I mean I really love Jack Tatum's game. I feel kind of a asshole for saying, you know, him the guy was Insane and like just ruthless. Yeah, you know.",
    "timestamp" : "15:37-16:01"
  },
  {
    "text" : "Yeah, kind of a bit of a scumbag like after football, but I mean Yeah. Playing for the Raiders is what was he, a linebacker at the in those days?",
    "timestamp" : "16:02-16:10",
    "speaker" : "Andy"
  },
  {
    "text" : "Jack Hayden was the he was the inbox safety for them the strong safety.",
    "timestamp" : "16:10-16:14",
    "speaker" : "Navi"
  },
  {
    "text" : "Oh that's right.",
    "timestamp" : "16:14-16:15",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah Uh I mean the cheat you know, the obvious thing is to be Charles Wilson all time fa Raider 'cause that personally made me but um I would have to go it's a it's a toss up between Howie Long and uh Uh you can't say Bo Jackson, he wasn't there that long. I'd say him and Marcus Allen. Marcus Allen running all over the Bescue highlights that I watched. I mean living here is Yeah, I just can't stop bringing it up to all these guys around here. But no, how is long is like my favorite raider. Uh one because he's a loc he lives around here and I actually met the guy once. Funny story like I literally opened the door to a friend's girlfriend's house and him and his younger son um We're at the front door and I was like hungry over and I was like, Wait, who the fuck? And I like how to close it open I was like uh That's how it was. Crazy. Yeah. It was it was through I was like, oh this is the worst way to meet somebody. Yeah, and then you know, bringing it back to like the movie Broken Arrow, I don't know if you ever watched that. Um Uh who was that? Long time ago. Remember that movie Broken Arrow? Uh, yeah, yeah. How long was in it, you know? That guy was just a rush. Yeah.",
    "speaker" : "Navi",
    "timestamp" : "16:16-17:35"
  },
  {
    "speaker" : "Andy",
    "text" : "Jesus. That's a throwback right there, no kidding.",
    "timestamp" : "17:37-17:41"
  },
  {
    "text" : "Yeah. So there's there's too many raiders to say, but like my favorite all-time raider, if I can say Charles Woodson would be Hobby Long.",
    "timestamp" : "17:42-17:49",
    "speaker" : "Navi"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "17:49-17:54",
    "text" : "All right. How did you feel about that uh the Gruden trade when it went down?"
  },
  {
    "timestamp" : "17:55-18:47",
    "text" : "That was the El Nicosin for us, Al Davis. trading him for a first round pick who ended up being Philip Buchanan from the U, my favorite college team, but still it wasn't worth it. I mean, fast forward to next season, you know, Bill Callahan's our coach and coming up, we gotta play Gruden in the Super Bowl, and this guy knows literally every single play. And uh from the stories that you know we heard is Callahan literally sabotaged the Super Bowl and played right into Gruden's hands and You could hear like in highlights on NFL films, James heard John Lynch is clearly saying that's the play. You know, they're literally calling out the space. It's going here, it's going there. I'm just sitting here like, alright, this is the worst movie you ever could have done. You Like we could have kept Gruden, gone to Super Bowl, won a fucking Super Bowl. Yeah I'll take it.",
    "speaker" : "Navi"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "18:47-18:50",
    "text" : "Did Gooden like force his way out? I don't remember like how that all came about."
  },
  {
    "text" : "No, he didn't force he didn't force his way out at all. Um I think it was something to do with ego a little bit, but I mean we won't know the true story. Gruden obviously came back and, you know, Mark Davis loves Gruden and Al Davis always did love Gruden but You know, who knows?",
    "timestamp" : "18:50-19:10",
    "speaker" : "Navi"
  },
  {
    "text" : "Yeah, there's some dark times that's between the two times he was there.",
    "timestamp" : "19:10-19:14",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. Really th there's it's probably something that happened behind closed doors, but",
    "speaker" : "Navi",
    "timestamp" : "19:15-19:19"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I mean it's probably similar to the the Brady Belichick thing too. Like you you'll probably never know.",
    "timestamp" : "19:19-19:25"
  },
  {
    "text" : "You'll never know exactly what actually happened. Yeah, we'll definitely never know 'cause Greetin won't ever say um the next person Amy Trask won't ever say who's cla Al David's right hand woman But, you know, that was the end of the Raiders because right then and there that was like that bad omen after that Super Bowl defeat, which I sat at my friend's house in his basement, took off my jersey and didn't say a word the rest of the game. Like we're getting our ass kicked. I'm like, this is fucking stupid. And then here it comes.",
    "timestamp" : "19:25-19:59",
    "speaker" : "Navi"
  },
  {
    "speaker" : "Andy",
    "text" : "I felt that for our first half in a Super Bowl before.",
    "timestamp" : "19:59-20:02"
  },
  {
    "speaker" : "Navi",
    "text" : "Yeah, yeah. It it's painful, man. It's shitty. I'd rather you know, have anything else happen. I don't know what I can describe, but Yeah, no, I it's a worst job.",
    "timestamp" : "20:03-20:14"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "20:14-20:15"
  },
  {
    "text" : "Yeah. I don't know.",
    "timestamp" : "20:16-20:16",
    "speaker" : "Navi"
  },
  {
    "speaker" : "Andy",
    "text" : "Just with everything the way it it's happened. Just it doesn't matter.",
    "timestamp" : "20:20-20:23"
  },
  {
    "speaker" : "Navi",
    "text" : "I don't know. I mean you guys You guys are spoiled. You guys Cora being fired and then your best player gets traded and then you got Brady leaving.",
    "timestamp" : "20:24-20:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "20:37-20:37"
  },
  {
    "speaker" : "Navi",
    "timestamp" : "20:37-20:39",
    "text" : "The Cel or the Celtics."
  },
  {
    "text" : "Uh yeah, the Celtics and the Bruins, I think, were both in first place when both seasons got suspended, so we'll never know what happened to them either. So Tough time in Boston Sports right now. All all with like a month of each other.",
    "speaker" : "Andy",
    "timestamp" : "20:39-20:50"
  },
  {
    "timestamp" : "20:53-20:56",
    "speaker" : "Steve",
    "text" : "What? It's not football season anymore, it's basketball season."
  },
  {
    "text" : "But those kids that were born. that will never like never say shit about anybody else because they've seen so many championships come through that city. It's unreal.",
    "speaker" : "Navi",
    "timestamp" : "20:56-21:08"
  },
  {
    "timestamp" : "21:08-21:12",
    "speaker" : "Andy",
    "text" : "Yeah, it's it's bananas. I I don't understand"
  },
  {
    "text" : "Yeah, we'll see. I mean it'll be you know, trust the process, pretty much, right?",
    "timestamp" : "21:16-21:20",
    "speaker" : "Navi"
  },
  {
    "timestamp" : "21:24-21:25",
    "speaker" : "Andy",
    "text" : "I mean that's it's work so far."
  },
  {
    "text" : "Like obviously we love RKK",
    "timestamp" : "21:30-21:31",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Navi",
    "text" : "He's a f he's a good guy, but he's a you know, he needs to obviously sell some assets and get somebody with fatter pockets 'Cause him waiting for Vegas and all this Vegas money is gonna take time and I don't know what the hell he's thinking. He's definitely brought the franchise down, even though he's trying to do good. But you know, cash flow is definitely an issue. Everybody knows that. Uh you know, we'll have some rumors, but you know, on on the way the contracts are being made, they're a little funny, you know, their money up front because there won't be money later. I don't know, but he's a good guy, good intentions, shitty owner When it comes to like, you know, pockets wise, he's probably one of the poorest owners. Which sucks because people want their money now, not later. You know",
    "timestamp" : "21:34-22:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I think they're got that awesome haircut though.",
    "timestamp" : "22:19-22:21"
  },
  {
    "text" : "That definitely makes up for it.",
    "speaker" : "Steve",
    "timestamp" : "22:21-22:22"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "22:23-22:24",
    "text" : "Oh my god."
  },
  {
    "timestamp" : "22:25-22:32",
    "text" : "That's a badass haircut. I have been on bring back the ball cut. campaign for a long time now. And Greg does too.",
    "speaker" : "Steve"
  },
  {
    "text" : "You know, you see him going up to those UFC games and those hockey games wearing all white wa all white suit.",
    "timestamp" : "22:32-22:38",
    "speaker" : "Navi"
  },
  {
    "timestamp" : "22:38-22:51",
    "text" : "Yeah, the tracksuits. It's almost like negative swag, but it's kind of like looped back around.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Navi",
    "text" : "Exactly.",
    "timestamp" : "22:51-22:52"
  },
  {
    "text" : "It's so bad it's good.",
    "speaker" : "Andy",
    "timestamp" : "22:53-22:54"
  },
  {
    "speaker" : "Navi",
    "timestamp" : "22:55-23:03",
    "text" : "Exactly. So bad it's good. I agree, I agree. I'm just glad we're out of that shithole stadium that smells like shit"
  },
  {
    "timestamp" : "23:03-23:07",
    "speaker" : "Andy",
    "text" : "Yeah. Well, I mean this this was us in two thousand one. Getting out of a shit house."
  },
  {
    "text" : "How many games have you been at the old Raider stadium?",
    "speaker" : "Steve",
    "timestamp" : "23:08-23:11"
  },
  {
    "text" : "Uh I tr I didn't go to many. I only been there twice. Um I've gone all around. My favorite stadium to visit and watch a game was Nashville. So anytime the Raiders play there I would always try and get there.",
    "speaker" : "Navi",
    "timestamp" : "23:11-23:22"
  },
  {
    "timestamp" : "23:23-23:25",
    "speaker" : "Steve",
    "text" : "Yeah, me and Greg went to that one. Yeah."
  },
  {
    "timestamp" : "23:26-23:42",
    "text" : "Yeah, it wasn't our clear. I enjoyed it. We we won recently down there. Um Was on TV, got a text message from my mom, put your fucking jersey back on. Drunk ass.",
    "speaker" : "Navi"
  },
  {
    "timestamp" : "23:44-23:46",
    "speaker" : "Steve",
    "text" : "Were you shirtless again?"
  },
  {
    "timestamp" : "23:46-24:22",
    "speaker" : "Navi",
    "text" : "Uh, yep, because we were in the FM, we were uh we were right behind the goalposts, second row. It was hot as balls that day, we were wearing black jerseys, but Tavius Murray scored, he threw the football, started celebrating. We took off our jer I took off my jersey, I was hammered. And waving it around all happy and shit and next time I get that text message, put your fucking jersey back on. I'm like, alright, alright. On TV Yeah. But no, I definitely you know, I loved going there to the Raider Stadium, you know, for the games, but man, it smelled like shit and weed. Two combos."
  },
  {
    "timestamp" : "24:24-24:26",
    "speaker" : "Andy",
    "text" : "That's what it looks like it smells like on TV."
  },
  {
    "text" : "Uh they're smoking in the stands.",
    "speaker" : "Navi",
    "timestamp" : "24:26-24:28"
  },
  {
    "timestamp" : "24:29-24:29",
    "text" : "Oh yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "They just don't give a fuck there.",
    "timestamp" : "24:34-24:36",
    "speaker" : "Navi"
  },
  {
    "timestamp" : "24:36-24:40",
    "speaker" : "Steve",
    "text" : "Yeah. That's what I'm saying. That's why it works perfectly for Vegas."
  },
  {
    "speaker" : "Navi",
    "text" : "Yep. Yeah. Yep. Yeah. No rules, baby. Yeah. It'll be it'll be weird to see how Vegas turns out because I feel like the first few years it'll be like a show for all these away fans to come to. Yeah, but they gotta spend like eight to hundred thousand dollars for like a shitty seat.",
    "timestamp" : "24:40-24:59"
  },
  {
    "text" : "That's crazy.",
    "speaker" : "Steve",
    "timestamp" : "24:59-25:00"
  },
  {
    "timestamp" : "25:01-25:10",
    "speaker" : "Navi",
    "text" : "It's gonna be insane for the prices in Vegas. We'll see. I mean I'll be going there with Greer to see a Bills game, so let's see how much money we fork over for tickets."
  },
  {
    "timestamp" : "25:10-25:15",
    "speaker" : "Steve",
    "text" : "Oh, tons. But think about the in that game betting you can do from your seat. Oh yeah."
  },
  {
    "text" : "That's true, yeah, you can make that money back.",
    "speaker" : "Andy",
    "timestamp" : "25:15-25:17"
  },
  {
    "text" : "Yep, that is true. That's very true. I'm not a big guy to go to games and watch 'em because I love watching all football games and like gambling. So it's like hopefully I go to a game that's like a prime time game where it's the only game there.",
    "speaker" : "Navi",
    "timestamp" : "25:18-25:31"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know if that's gonna be against the Bills, but just throw that.",
    "timestamp" : "25:32-25:34"
  },
  {
    "speaker" : "Navi",
    "text" : "Yeah, so we listen to Gary too much did. That is true, that is true.",
    "timestamp" : "25:43-25:47"
  },
  {
    "timestamp" : "25:49-25:59",
    "speaker" : "Andy",
    "text" : "So uh A couple more questions, uh real quick. Sounds good. Uh as a writers fan, how do you see the Patriots? Like what do you think of the Patriots?"
  },
  {
    "text" : "At first I hated him and then I hated Brady a lot. But then like social media Brady coming out and just the way he like just put out these videos and like his T B twelve stuff. 'Cause I don't know. I love Tom Brady the person. Just 'cause like how like cool and like you know like call nature is and then there's Brady the Patriot. I mean you gotta give 'em respect. I I being young, you hate you know, teams. Growing older I appreciate But yeah, I still fucking hate button for that topic.",
    "speaker" : "Navi",
    "timestamp" : "26:00-26:36"
  },
  {
    "speaker" : "Andy",
    "text" : "So I I don't know if you'll actually have an answer to this one, but do you have a favorite Patriots Raiders game?",
    "timestamp" : "26:38-26:45"
  },
  {
    "speaker" : "Navi",
    "timestamp" : "26:46-26:50",
    "text" : "No, because we haven't won against guys in a long time."
  },
  {
    "speaker" : "Andy",
    "text" : "I guess it's kind of true. The Jack Tatum game, I guess.",
    "timestamp" : "26:51-26:55"
  },
  {
    "text" : "I don't even know when's the last time we beat you guys.",
    "timestamp" : "26:55-26:58",
    "speaker" : "Navi"
  },
  {
    "text" : "Couldn't tell ya. It's I think it's been a while.",
    "timestamp" : "26:59-27:01",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, play enough. Yeah, the last time we uh got close was when Gronk was playing and I think we barely lost that game. I think it was like a it was a very close game if I remember. It was like, I don't know, ten thirteen or something like that. But that's probably the post You know, if I'm trying to think it was even on the Raider team that year.",
    "timestamp" : "27:02-27:25",
    "speaker" : "Navi"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so let's see. The last time the Raiders beat the Patriots was 2002, week eleven.",
    "timestamp" : "27:29-27:40"
  },
  {
    "text" : "No, that was the following season, yeah.",
    "speaker" : "Navi",
    "timestamp" : "27:42-27:44"
  },
  {
    "timestamp" : "27:44-27:48",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, it would have been, yeah. The revenge game, I suppose."
  },
  {
    "timestamp" : "27:48-27:51",
    "text" : "Yeah, you can call it that. Twenty seven, twenty to twenty-seven.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:51-28:07",
    "text" : "Twenty-seven twenty, yeah. And then that was kind of it. And then before that was nineteen well, actually that's not true. Before that the last time it was eighty one when they were still in Oakland, but I'm sure the LA Raiders beat them at some point too."
  },
  {
    "speaker" : "Navi",
    "timestamp" : "28:07-28:32",
    "text" : "Yeah, yeah. Oh they did. They definitely did I remember seeing a highlight. Yeah. Yeah, I that's we haven't beat you guys in forever. I can't tell you what my favorite rare game is. I don't remember the two thousand two game to be honest. It's a blur to me. I gotta like go back."
  },
  {
    "text" : "I've always wondered what people thought of them drafting Jamarcus Russell. Like when you drafted him, were you hyped? Fuck no. Uh you just knew right away.",
    "speaker" : "Steve",
    "timestamp" : "28:35-28:44"
  },
  {
    "text" : "I believed in Lane Kiffin. If he got Calvin Johnson, he would have found a way to do something else. Oh yeah. Yeah, it's and then it's like the drop. Yeah, I mean, I would have loved to have him I w was that the Aaron Rod no Aaron Rogers year was when we drafted Robert Gallery. So the Undertaker, the guy from Iowa over You know, Aaron Rodgers. We could have used a quarterback.",
    "speaker" : "Navi",
    "timestamp" : "28:44-29:13"
  },
  {
    "timestamp" : "29:13-29:14",
    "speaker" : "Andy",
    "text" : "Oops."
  },
  {
    "speaker" : "Navi",
    "text" : "You know, imagine Aaron Rodgers and Calvin Johnson on the same team. And the Raider uses.",
    "timestamp" : "29:15-29:20"
  },
  {
    "text" : "Oh yeah. Yeah. That would have been uh borderline unstoppable.",
    "speaker" : "Andy",
    "timestamp" : "29:21-29:25"
  },
  {
    "speaker" : "Navi",
    "text" : "Pretty much. And then you got Jerry Porter over there, you know, who's our young buck receiver. That would have been a nice little uh few years there.",
    "timestamp" : "29:26-29:33"
  },
  {
    "timestamp" : "29:33-29:39",
    "speaker" : "Andy",
    "text" : "That would have been alright, wouldn't it? Yeah. Instead you had typical Raiders living in the wood on the show."
  },
  {
    "timestamp" : "29:39-29:44",
    "speaker" : "Steve",
    "text" : "What if uh you know they called out a fumble? What if we dressed the Shava Johnson?"
  },
  {
    "text" : "Steve Brown, I'm pretty sure that's every single uh franchise fans other than the Patriots, if we're being honest.",
    "speaker" : "Andy",
    "timestamp" : "29:44-29:50"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:51-29:52",
    "text" : "That's true. Yeah."
  },
  {
    "text" : "I don't even know when's the next time we're gonna draft a quarterback that I mean I think our quarterback of the future is already on the team of Marcus Mariota, but that's just me.",
    "timestamp" : "30:00-30:06",
    "speaker" : "Navi"
  },
  {
    "text" : "Ooh, that's really that's a hot take.",
    "timestamp" : "30:06-30:08",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "30:09-30:09",
    "text" : "Yeah.",
    "speaker" : "Navi"
  },
  {
    "timestamp" : "30:09-30:15",
    "speaker" : "Steve",
    "text" : "Uh you know we don't release these immediately, so like I don't know. That might be still by the time this comes out."
  },
  {
    "text" : "Yeah, this this might come out eight weeks from now, so in two months that might actually be a little hot type. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "30:15-30:22"
  },
  {
    "speaker" : "Navi",
    "text" : "Um, I mean Derek did great in the system, but the guy's not mobile enough, he's not confident enough to use his legs. And to make smarter plays. Like the guy for fuck's sakes he ran out of bounds on fourth and goal or something like that. Like I remember like he was close to the end of just give somebody the time to make a play, like give somebody a chance. Marcus Mariota would have never done that stupid ass play and get booed out of your fucking stadium in the last game of the season. I just feel like he's a truck for the offense. That's just me. But you know, this Mayock's number one quarterback. There's a reason why his contracts like packed with incentives.",
    "timestamp" : "30:22-30:59"
  },
  {
    "text" : "Oh that's right. Yeah.",
    "timestamp" : "30:59-31:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:01-31:10",
    "speaker" : "Navi",
    "text" : "I mean he could two years he could make up to forty seven million dollars. That's nuts. Even though he's a base seven seven and a half. Yeah. Crazy."
  },
  {
    "timestamp" : "31:10-31:11",
    "text" : "That's a lot.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Navi",
    "text" : "Like what acting you'd be like, what the fuck? Like there's a small leash for Derek Carr this year, I feel like.",
    "timestamp" : "31:11-31:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:18-31:20",
    "text" : "Yeah, it does seem like that."
  },
  {
    "speaker" : "Navi",
    "text" : "It's good I I mean with that contract the way it is, it just feels weird. I mean, yeah, they'll probably be happy with Car for a few weeks, but like when they start losing and they like you know, are losing because the pass game's not working or he's just fucking up, Mario's gonna be right there.",
    "timestamp" : "31:21-31:35"
  },
  {
    "timestamp" : "31:35-31:36",
    "speaker" : "Andy",
    "text" : "That's true, yeah."
  },
  {
    "speaker" : "Navi",
    "text" : "That's the actual first active quarterback we've had that can actually challenge him to take his job.",
    "timestamp" : "31:37-31:43"
  },
  {
    "timestamp" : "31:44-32:02",
    "speaker" : "Andy",
    "text" : "Yeah, the yeah, the the names of backup quarterbacks in Oakland has not been No, I think our best has been Matt McGloyne. Oh my goodness. Best is a is uh I think you're using that word loosely, but yeah."
  },
  {
    "text" : "Yeah, I'd even throw Bruce Krakowski in because he beat Pittsburgh and Pittsburgh with Lewis Murphy. I remember that Um Jason Campbell was decent until he got hurt, but You know.",
    "speaker" : "Navi",
    "timestamp" : "32:02-32:14"
  },
  {
    "speaker" : "Steve",
    "text" : "The old Redskins guy, right?",
    "timestamp" : "32:14-32:16"
  },
  {
    "speaker" : "Navi",
    "text" : "Yeah, I mean he was decent until he got hurt and then here comes Hugh Jackson tossing a first round pick.",
    "timestamp" : "32:16-32:22"
  },
  {
    "text" : "Carson fucking Palmer, but Well Palmer was alright.",
    "timestamp" : "32:22-32:26",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Navi",
    "text" : "He was alright man, but he didn't want to play for the Raiders. He went from the Bengals to the Raiders. Come on.",
    "timestamp" : "32:27-32:32"
  },
  {
    "text" : "What were your thoughts on the Rainy Moss era?",
    "timestamp" : "32:33-32:35",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Navi",
    "text" : "Oh, the Rainy Moss area was just garbage. Andrew Walters trying to throw Rainy Moss the ball and Rainy Moss did not want to be there. The guy was half speed. He just didn't give a fuck. He was getting paid. It's true.",
    "timestamp" : "32:37-32:50"
  },
  {
    "timestamp" : "32:51-32:55",
    "text" : "Were you like pissed when he came to the Patriots and was awesome? Or are you like, yeah, of course that happened?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Navi",
    "text" : "Of course that was gonna happen. Everybody knew that was gonna fucking happen. I just wish we would have got something better than a fourth round pick.",
    "timestamp" : "32:55-33:01"
  },
  {
    "timestamp" : "33:01-33:07",
    "speaker" : "Andy",
    "text" : "That's true. Yeah, they actually gave up more for Wes Welker that year. They gave up like a second and something else."
  },
  {
    "text" : "Never fucking trade with the Patriots. I mean we gave up a first for fucking Richard Seymour.",
    "timestamp" : "33:09-33:14",
    "speaker" : "Navi"
  },
  {
    "text" : "That's true.",
    "timestamp" : "33:14-33:15",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Navi",
    "text" : "When we the best thing Richard Seymour ever did was punch Big Ben in the face.",
    "timestamp" : "33:15-33:19"
  },
  {
    "timestamp" : "33:21-33:30",
    "speaker" : "Andy",
    "text" : "That's right. To be fair, that that's gotta be like a top ten moment. Yeah. Like that that's the Raiders you're talking about. That's that Raiders defense and that attitude you're talking about."
  },
  {
    "speaker" : "Navi",
    "text" : "I think that was actually the game that Bruce Kakkowski threw Lewis Murphy, the game winning touchdown too.",
    "timestamp" : "33:31-33:36"
  },
  {
    "timestamp" : "33:37-33:43",
    "text" : "Oh, you might be I don't remember this at all. Yeah. That game was good at it. It was a complete shit show.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:44-33:46",
    "speaker" : "Steve",
    "text" : "I mean that's totally worth a first round pick though, right?"
  },
  {
    "timestamp" : "33:46-33:57",
    "text" : "Yeah. Yeah, I think we can all agree on that. Oh absolutely I'll take him over uh uh who's the old guy?",
    "speaker" : "Navi"
  },
  {
    "text" : "Cordell Stewart.",
    "timestamp" : "33:58-33:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Navi",
    "text" : "No, uh Man they got on Fox.",
    "timestamp" : "33:59-34:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, Terry Brad?",
    "timestamp" : "34:03-34:04"
  },
  {
    "speaker" : "Navi",
    "text" : "Terry Brash. I'll take Big Ben over Terry Brasha as the greatest steeler quarterback.",
    "timestamp" : "34:04-34:08"
  },
  {
    "text" : "Ooh, that's another hot take. He was full of 'em.",
    "speaker" : "Andy",
    "timestamp" : "34:08-34:10"
  },
  {
    "speaker" : "Navi",
    "timestamp" : "34:11-34:20",
    "text" : "That is yeah, fire. Terry Brashaw was his stats were shit. I mean, you know, there was just more like Yeah. He was like the Trent Dilfer of the team."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:20-34:27",
    "text" : "I was gonna say, yeah, he was he was kind of the Trent Dilfer of the that that uh what do they call them steel curtain defenses?"
  },
  {
    "text" : "Yep, you have what other questions you got?",
    "speaker" : "Navi",
    "timestamp" : "34:30-34:32"
  },
  {
    "timestamp" : "34:34-34:38",
    "text" : "Uh that was all the ones I had. Steve, you got any questions?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "34:39-34:45",
    "text" : "No, I definitely wanted to know how you felt about Randy Moss. So I'm glad I got that out there."
  },
  {
    "text" : "Yeah. Uh what's funny actually is about the Randy Moss thing is, um I bought a Randy Moss jersey Oh no. And then I believe we traded him one year later. No no no. Oh sorry, hold on. Rewind, rewind. So I had a Napoleon Harris jersey. He was a linebacker. I remember the rate. Yeah. Yeah. He was good, right? Yeah. And um You know, I was super excited, like dang, I got a jersey. You know, this linebacker's gonna be here for a while, he's a beast, getting a hundred and fifty something tackles. Next off season, gets traded to Minnesota for Randy Moss. I'm like, oh shit. What am I this jersey? It's gonna go you know, right in the closet, never used again. Spent like I don't know, fifty, sixty bucks at a time for those jerseys. Did I get her any more? That didn't last long.",
    "timestamp" : "34:45-35:39",
    "speaker" : "Navi"
  },
  {
    "text" : "I will say, and I remember this very clearly, Greg in his infinite jersey collection had a Raiders ran uh Jerry Rice. I remember correctly.",
    "speaker" : "Steve",
    "timestamp" : "35:43-35:53"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:54-36:00",
    "text" : "Did he? I thought it was a Charles I thought he had a Charles Woodson jersey. 'Cause he would collect any jersey of defensive backs who were number two."
  },
  {
    "speaker" : "Steve",
    "text" : "Twenty four. Yeah. Nice. I'm almost positive 'cause no, he definitely did. There's a picture of me dressing up on Halloween where I have that on backwards. The years that we had to put them in I'll see if I can dig it and we'll text it to you. But I'm oh yeah, I'm I'm actually a hundred percent positive Greg had a Jerry Rice Raider street.",
    "timestamp" : "36:00-36:21"
  },
  {
    "timestamp" : "36:23-36:28",
    "speaker" : "Andy",
    "text" : "I knew we I knew we had to that same thing. But yeah that that that would make sense too."
  },
  {
    "text" : "Yeah, that's a nice that's a nice jersey to have there. I still have my Tim Brown Adidas jersey. Then I have a Bo Jackson jersey I got from China. Don't have any of my Charles Woodson jerseys. Ooh, breaking news, Raiders and Eli Apple deal fall apart.",
    "speaker" : "Navi",
    "timestamp" : "36:28-36:41"
  },
  {
    "timestamp" : "36:43-36:44",
    "speaker" : "Andy",
    "text" : "I saw that earlier."
  },
  {
    "timestamp" : "36:46-36:56",
    "text" : "Um yeah, I don't have any of my Charles Wilson jerseys anymore. I don't know what happened to them, they probably got taken. You know, here and there, but a Bo Jackson jersey will be there.",
    "speaker" : "Navi"
  },
  {
    "timestamp" : "36:57-36:59",
    "speaker" : "Steve",
    "text" : "We'll uh we'll see if Greg still has his Charles."
  },
  {
    "speaker" : "Navi",
    "timestamp" : "37:00-37:02",
    "text" : "We'll go to you if we can find it."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:02-37:03",
    "text" : "Yeah, yeah."
  },
  {
    "speaker" : "Navi",
    "text" : "I'll have to Thank you for having me on your podcast.",
    "timestamp" : "37:03-37:07"
  },
  {
    "speaker" : "Andy",
    "text" : "Navi, we appreciate it. Thanks for uh giving us a different perspective.",
    "timestamp" : "37:07-37:11"
  },
  {
    "speaker" : "Navi",
    "text" : "Hey, anytime. Take it easy. Alright later guys.",
    "timestamp" : "37:11-37:20"
  },
  {
    "speaker" : "Steve",
    "text" : "Well after all that, we're still not friends, so thanks, Navi.",
    "timestamp" : "37:26-37:29"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "37:31-37:32",
    "text" : "Great transition."
  },
  {
    "timestamp" : "37:33-37:50",
    "speaker" : "Andy",
    "text" : "He just uses you for your Fourth of July parties. I get it. That's all right. I'm sure he's not the only one. Nope. Uh So yeah, he uh not a big fan of what was his name? The the Callahan Bill Callahan, yeah. Not a big fan of him"
  },
  {
    "timestamp" : "37:51-37:57",
    "speaker" : "Greg",
    "text" : "Which is completely understandable, I think. So he was a big uh Gruden fan though, yes?"
  },
  {
    "timestamp" : "37:57-37:58",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "37:58-37:59",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, yeah."
  },
  {
    "text" : "What do you guys think of Gruden? I don't know.",
    "timestamp" : "37:59-38:05",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "38:05-38:08",
    "speaker" : "Andy",
    "text" : "I'm not as high on him as I feel like everybody else seems to be."
  },
  {
    "text" : "I feel like a lot of people hate on him. Ever since he did Monday night.",
    "timestamp" : "38:09-38:14",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "38:14-38:21",
    "text" : "Like Yeah, I mean he was a bit of a caricature on Monday Night Football. I think that was just him playing that that role, you know?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "38:24-38:31",
    "text" : "Yeah, and the QB camp that he does where he just loves everybody. Everybody loves everybody. You got a lot of shit for that."
  },
  {
    "timestamp" : "38:31-38:37",
    "text" : "I haven't heard him say critical thing at all. Unless it was like on hard knocks.",
    "speaker" : "Steve"
  },
  {
    "text" : "I didn't even watch that.",
    "timestamp" : "38:38-38:40",
    "speaker" : "Andy"
  },
  {
    "text" : "He was good on hard I liked him on hard knocks. Really?",
    "timestamp" : "38:42-38:44",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:44-38:48",
    "text" : "I heard a lot of criticism o uh about him specifically on hard knocks."
  },
  {
    "timestamp" : "38:48-38:59",
    "speaker" : "Greg",
    "text" : "Every coach gets criticism for that show though. I thought he was I thought he was a good players coach. I don't know how good of an X is nose guy he is, but Yeah. He's a good motivator."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:59-39:03",
    "text" : "He was supposed to be a pretty good offensive mind, isn't he?"
  },
  {
    "timestamp" : "39:04-39:09",
    "speaker" : "Greg",
    "text" : "That's what I thought. I think at this point in his career, people were pretty high on him."
  },
  {
    "text" : "Well let's put a uh a number on the Raiders wins here in the twenty twenty season.",
    "timestamp" : "39:10-39:15",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Hmm nine wins.",
    "timestamp" : "39:17-39:20"
  },
  {
    "timestamp" : "39:23-39:29",
    "speaker" : "Greg",
    "text" : "Who's playing quarterback? Is it still Carr?"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh Nathan Peterman.",
    "timestamp" : "39:30-39:31"
  },
  {
    "text" : "No, they brought in someone to challenge Carr. Oh yeah, who they brought in.",
    "speaker" : "Steve",
    "timestamp" : "39:32-39:35"
  },
  {
    "timestamp" : "39:37-39:38",
    "speaker" : "Greg",
    "text" : "He loves Peterman."
  },
  {
    "timestamp" : "39:41-39:42",
    "speaker" : "Steve",
    "text" : "They brought him Mariota."
  },
  {
    "speaker" : "Andy",
    "text" : "That's right, yeah. Because that was his hot take. That was Navi's hot take, was uh",
    "timestamp" : "39:43-39:47"
  },
  {
    "timestamp" : "39:47-39:51",
    "speaker" : "Steve",
    "text" : "Variota will be the starter and the next franchise quarterback."
  },
  {
    "timestamp" : "39:51-39:52",
    "speaker" : "Andy",
    "text" : "Yes."
  },
  {
    "speaker" : "Steve",
    "text" : "So I'm definitely picking against Navi. Let me give you like six wins.",
    "timestamp" : "39:52-39:56"
  },
  {
    "timestamp" : "39:58-40:12",
    "text" : "I could see them doing okay. More than more. I'm going ten. I'm going ten wins. I'm going ten. Based on no research. And not even knowing half the roster, I'm going ten wins.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "40:13-40:15",
    "speaker" : "Steve",
    "text" : "That's how hot takes are born, Greg. That's right."
  },
  {
    "timestamp" : "40:15-40:22",
    "text" : "And then you defend them Till you die. Even if you don't believe them when you're dying, you defend them till you die.",
    "speaker" : "Greg"
  },
  {
    "text" : "No, you just cover them up with more hot takes, like, oh yeah, but what about this hot take?",
    "timestamp" : "40:23-40:27",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "What's uh you want to hear my worst ever sports take? Of course. Always okay. Aaron Hernandez will be a better career player than Rob Gunkowski. Oh yeah. Who's passionate? Passionate about that one. I was like, he's just a more fluid athlete. Whoops.",
    "timestamp" : "40:29-40:49"
  },
  {
    "timestamp" : "40:52-40:54",
    "speaker" : "Steve",
    "text" : "I don't want to hail a gunfire."
  },
  {
    "text" : "Yeah, among other things.",
    "speaker" : "Greg",
    "timestamp" : "40:54-40:56"
  },
  {
    "text" : "Alright, let's talk about the actual fucking game we came here to talk about.",
    "speaker" : "Steve",
    "timestamp" : "40:57-41:00"
  },
  {
    "text" : "So we'll talk about this all the way around. Yeah, alright, so just real quick, uh I know Navi mentioned it in the in the interview, but Uh I want to touch on it again that they the Raiders actually lost their last three games regular season. And it was a weird situation where in week 17, if they had won that game They would have gotten the two seed instead of the Patriots, but they lost to the Jets, who they then had to play the next week in the wildcard game like six days later and they beat the Jets. And it was one of those things I I kind of remember and he he wasn't completely clear on it, but uh it was something like The Rangers played super vanilla in week 17, so they wouldn't give the Jets anything just in case they didn't beat them. And then they pulled out all the stops in the playoffs and ran over them 38-24. So that's how the the Raiders actually got here. Just like putting up numbers and uh running back Charlie Gardner had like he iced the game with an eighty yard touchdown run with a few minutes left.",
    "timestamp" : "41:01-42:10",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "42:11-42:15",
    "speaker" : "Steve",
    "text" : "Dude, I had no idea who Charlie Gardner was. I remember the name."
  },
  {
    "timestamp" : "42:17-42:23",
    "speaker" : "Greg",
    "text" : "But did he play on uh the 49ers? Maybe uh yeah, for a couple years."
  },
  {
    "timestamp" : "42:25-42:33",
    "speaker" : "Andy",
    "text" : "Look at it. I started in Philly From ninety-four to ninety-eight and then two years in San Francisco before four years in Oakland."
  },
  {
    "timestamp" : "42:33-42:38",
    "speaker" : "Steve",
    "text" : "Wasn't there like a back named Hearst back there too? When the nine Maurice Hearst, yeah. Yeah."
  },
  {
    "timestamp" : "42:38-42:52",
    "speaker" : "Greg",
    "text" : "I remember. This is when StatCheck goes wrong. It must be Garner, not Gardner. Yes. Charlie Gardner was a recurring character in the second season of Girl Meets Worlds. Which turns out is a show."
  },
  {
    "text" : "Oh, don't don't talk to Mike Mello about that though.",
    "speaker" : "Andy",
    "timestamp" : "42:52-42:55"
  },
  {
    "speaker" : "Greg",
    "text" : "He's very sounding like that. Does he know about Girl Girl Meets World? Not Boy Meets World.",
    "timestamp" : "42:56-42:59"
  },
  {
    "text" : "Uh I think he basically wrote that. He wrote a reunion for Boy Meets World. He wrote the whole script and everything and tried to shop it around and then that came out. I apparently I guess there was it was some similarities between what he wrote and what came out and so",
    "timestamp" : "43:00-43:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. I'll talk yeah, not talking about that. Oh well, that's hilarious. Charlie Gardner. Good looking guy. Yeah? What about Charlie Gardner?",
    "timestamp" : "43:15-43:28"
  },
  {
    "text" : "Spell check? Gardner. He's he's Charlie Gardner the third, by the way. So good for him.",
    "timestamp" : "43:30-43:40",
    "speaker" : "Andy"
  },
  {
    "text" : "But yeah, he looked pretty sprightly in this game though. I mean he looked untackable. Yeah, he he he was a tenacious guy, you know, like a bulldog runner. I always respect those guys.",
    "speaker" : "Greg",
    "timestamp" : "43:42-43:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he was just that he was the the stereotypical always keep your legs moving and good things will happen as a running back sort of guy.",
    "timestamp" : "43:53-43:59"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "44:00-44:00"
  },
  {
    "timestamp" : "44:00-44:14",
    "speaker" : "Andy",
    "text" : "Like he he didn't really Make any moves. He he wasn't beating anybody. He just like would just keep going and eventually somebody would fall off and he'd get an uh an extra eight yards from it, sort of thing. All right."
  },
  {
    "text" : "I say that we do a best and worst for each quarter, like one, two, and three, and then we can talk about the fourth and overtime.",
    "speaker" : "Steve",
    "timestamp" : "44:14-44:21"
  },
  {
    "timestamp" : "44:21-44:21",
    "speaker" : "Greg",
    "text" : "Yes."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:22-44:25",
    "text" : "Boy. All right, that's aggressive. You go first then."
  },
  {
    "speaker" : "Steve",
    "text" : "Uh Best in the first quarter was the three screens in a row from the Patriots",
    "timestamp" : "44:26-44:34"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's how they started the game. Yeah.",
    "timestamp" : "44:34-44:36"
  },
  {
    "text" : "Even Phil running backs.",
    "timestamp" : "44:36-44:38",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:38-44:41",
    "speaker" : "Andy",
    "text" : "Even Phil was calling them out. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Uh the worst was 0 for 6 on third downs, both teams combined. That was terrible. Yeah, it wasn't great. A lot of punting in that first quarter.",
    "timestamp" : "44:43-44:53"
  },
  {
    "text" : "Um there wasn't a lot of best, I think, in this first quarter. I'll go with uh the fact that they had the yellow line. The yellow first down line was back for this game because it was uh A prime time game, which thank fucking god, because you couldn't actually see the the yard markers unless they had the the guys with the leaf blowers out there. During commercial breaks.",
    "timestamp" : "44:53-45:14",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:14-45:17",
    "text" : "I like how they're putting it on the end zone line too.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:17-45:18",
    "text" : "Yeah. Oh yeah."
  },
  {
    "timestamp" : "45:18-45:19",
    "speaker" : "Greg",
    "text" : "That was helpful."
  },
  {
    "timestamp" : "45:19-45:20",
    "speaker" : "Andy",
    "text" : "It was very helpful."
  },
  {
    "speaker" : "Greg",
    "text" : "That guy on the Raiders lost track of it on one play.",
    "timestamp" : "45:21-45:24"
  },
  {
    "timestamp" : "45:24-45:35",
    "speaker" : "Andy",
    "text" : "Yeah, I mean that was gonna be my worst for the second quarter was the was the uh when the Patriots punted it. Yeah, he let it he let it bounce. He was sitting in the end zone thinking he was on the five. Let it bounce into the end zone."
  },
  {
    "speaker" : "Greg",
    "text" : "For an accident touchback. I remember that play too for some reason. Yeah, so there's like a few plays in this game that stick out in my memory and they're like kind of obscure.",
    "timestamp" : "45:35-45:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah, I I'm the same way. There was something I completely forgot about though, which we'll get to. Um so that was my my best. My worst was Um oh the Raiders on the first drive uh challenged the first down. Oh yeah. And even though it looked like they got it, it still got spotted short. So they didn't get the first down on third down and had to punt anyway. And the punt was a few.",
    "timestamp" : "45:45-46:12"
  },
  {
    "timestamp" : "46:13-46:20",
    "speaker" : "Steve",
    "text" : "But that slowed the game down so much. Like that's why there was a million punts in the first half, is because like literally the first drive challenge."
  },
  {
    "timestamp" : "46:21-46:24",
    "speaker" : "Andy",
    "text" : "Yes. And challenges back then took like forty five minutes."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "46:28-46:39",
    "text" : "And they were like Oh yeah, you win the challenge, but you don't get the first down because they moved the ball ahead two inches. So here's your timeout back. And then we gotta go back and explain that to each of the coaches. And it's just like holy shit."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I I said it was a first down though, right? Yeah, it was it was supposed to be it should have been. They got the call wrong. That's the first Screw job of the Raiders of the Night.",
    "timestamp" : "46:39-46:49"
  },
  {
    "timestamp" : "46:50-47:03",
    "speaker" : "Andy",
    "text" : "Oh, that that actually reminds me. So talking about that, uh in because I watched the highlights of the the Raiders Jets game the week before just to see how that went. And the Jets got a whole bunch of calls that went against them too. Like they they got the screw job in that game. So maybe."
  },
  {
    "text" : "Well, it's speaking of karma, what what is it, nineteen seventy six? The phantom passing of the phantom uh roughing the passer.",
    "timestamp" : "47:05-47:14",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:14-47:16",
    "text" : "Yep, yeah, yeah. Oh yeah."
  },
  {
    "timestamp" : "47:16-47:17",
    "speaker" : "Greg",
    "text" : "Pat's Raiders. Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:17-47:19",
    "text" : "So now we're even is what you're saying."
  },
  {
    "text" : "Well No, I mean um to to clearly point out a hole in your logic, you're just you're calling it karma because you want to justify that the pat's got the good end of the calls here.",
    "timestamp" : "47:20-47:31",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean you can put words in my mouth all you want, but no.",
    "timestamp" : "47:33-47:35"
  },
  {
    "text" : "Yeah. The Raiders got jobbed in this game.",
    "timestamp" : "47:36-47:40",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "47:41-47:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Exactly.",
    "timestamp" : "47:42-47:42"
  },
  {
    "text" : "I mean, yeah, I don't know, jobbed.",
    "speaker" : "Steve",
    "timestamp" : "47:45-47:46"
  },
  {
    "timestamp" : "47:46-47:52",
    "text" : "They they had a couple of calls I went against them. Objectively, if I was a Raiders fan, I'd be pissed.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "What other Raiders fan, you wouldn't be objective.",
    "timestamp" : "47:52-47:54"
  },
  {
    "timestamp" : "47:57-48:17",
    "text" : "Uh the well, we'll get to we'll get to the Yeah, we will the infamous one later. Yeah. Let's All right, give us your conversation. The worst is clearly Steve just springing this on us. I have no idea what any of this happened in what quarter.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, Greg didn't watch the game, clearly.",
    "timestamp" : "48:17-48:19"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "48:19-48:23",
    "text" : "I no, I watched the game, but I'm not like writing best and worst for each quarter."
  },
  {
    "speaker" : "Andy",
    "text" : "Neither.",
    "timestamp" : "48:23-48:24"
  },
  {
    "text" : "But I mean, for for the f beginning of the game, the best has got to be the environment, right? Yeah, yeah. Like when they pan to the crowd and his dudes with their shirts off and like the screen looks like you're getting a bad reception because it's just Yeah White coming down and angle.",
    "speaker" : "Greg",
    "timestamp" : "48:24-48:40"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "48:41-48:44",
    "text" : "No sitting down because the bleachers are colder than the air."
  },
  {
    "text" : "Everybody was standing the entire game. The entire game. The entire game. And just it it's just one of those it's one of those things when you turn on a snow game for football and like you see the whole field covered in white except for the lines that they've you know Yeah. Leaf blown. It's just it's so cool.",
    "speaker" : "Greg",
    "timestamp" : "48:44-49:04"
  },
  {
    "speaker" : "Steve",
    "text" : "I remember we were in the library and like we were waiting for the game to start and I was looking outside the window and it was like it was snowing. I was like, damn, it's really coming down out there. That was like a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit",
    "timestamp" : "49:04-49:15"
  },
  {
    "text" : "So just so, you know, people who don't didn't live in the Brown House growing up know the library isn't actually the library, it's just a room in our house. That God christened the library. I didn't even know books.",
    "timestamp" : "49:16-49:26",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Actually.",
    "timestamp" : "49:28-49:28"
  },
  {
    "timestamp" : "49:29-49:33",
    "speaker" : "Andy",
    "text" : "But because our father's a deadhead, it was called the Jerry Garcia Memorial Library."
  },
  {
    "text" : "Yeah. And that's where we had the TV.",
    "timestamp" : "49:34-49:36",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "49:36-49:37"
  },
  {
    "speaker" : "Steve",
    "text" : "That's where we went to church.",
    "timestamp" : "49:37-49:39"
  },
  {
    "timestamp" : "49:39-49:42",
    "speaker" : "Andy",
    "text" : "No, yeah, no reading happened in that room."
  },
  {
    "text" : "But it is a it is a unique thing to because I was trying to think of like how many like true snow games are there, right? Because it takes like a pretty s precise timing to hit a snow game perfect. Where it's you know this game it snowed the entire way through. Yeah, which almost never happens, you know.",
    "timestamp" : "49:44-50:05",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "50:05-50:13",
    "text" : "It was like heavy snow. Yeah, it's like a dusting and It was I mean, think about how much snow fell in those three hours."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, it was still like legitimately accumulating. Yeah.",
    "timestamp" : "50:13-50:16"
  },
  {
    "timestamp" : "50:17-50:35",
    "speaker" : "Greg",
    "text" : "Cause I mean, typically in a s good snowstorm you only get like two to three hours of like real serious snow anyways, right? Right. So if you hit you have to hit it perfectly during game time to get like a game like this. And it just and nailed it, you know, like it it didn't stop snowing the whole game."
  },
  {
    "text" : "It like let up a little bit at halftime, like it lightened up, and then by like fourth quarter overtime it started snowing like heavy again too. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "50:35-50:44"
  },
  {
    "text" : "Fourth quarter over time was you could tell it was like really accumulating. Yeah.",
    "timestamp" : "50:44-50:49",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, that was a hot mess. Uh yeah, I mean, can you think off the top of your head? Like five snow games that you've watched? Titans game. Yeah, okay, the Titans.",
    "speaker" : "Andy",
    "timestamp" : "50:51-51:02"
  },
  {
    "timestamp" : "51:03-51:07",
    "speaker" : "Greg",
    "text" : "Cardinals game we went to. Remember that? That was my first Peaches game."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "51:07-51:07"
  },
  {
    "text" : "Really?",
    "timestamp" : "51:07-51:07",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Um yeah, that was the end of the 08 season when the Patriots whooped the shit out of the Cardinals, who eventually went to the Super Bowl. Uh there was one in yeah. There was one in Chicago. Uh the Patriots played in Chicago and Brady threw a touchdown to Dion Branch with like three seconds left in the half because he was wide open.",
    "timestamp" : "51:08-51:27"
  },
  {
    "timestamp" : "51:28-51:30",
    "text" : "But it wasn't accumulated really on that one, right?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "51:30-51:36",
    "speaker" : "Andy",
    "text" : "I think I mean the feel was white. I remember that. I think it was still snowing. I I don't know how much it was accumulating."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "51:36-51:37"
  },
  {
    "speaker" : "Andy",
    "text" : "But yeah, it's it's what, four games in the past twenty years that we can think of off the top of our head.",
    "timestamp" : "51:37-51:41"
  },
  {
    "text" : "Of course they flashback the snowplow game, which I forgot was three to nothing. Yeah.",
    "timestamp" : "51:41-51:47",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "51:50-51:55",
    "speaker" : "Andy",
    "text" : "But did they they had the guy there, didn't they? Jesus. Yeah, didn't they have the guy there?"
  },
  {
    "timestamp" : "51:56-52:05",
    "speaker" : "Steve",
    "text" : "Yeah. Oh no, it was like maybe the end of the regular season they had him come out and do like a wave to the crowd in like the last game that they thought in Foxboro."
  },
  {
    "text" : "Oh yeah, that's what it was. Yeah, and we did talk about it already, whenever that game was. Oh, wasn't it against the Dolphins? Yeah. I think it was. For sure. That makes sense. That's a dick move. I love it. Greg, you want to shit on that too? Yeah. Patricia. I like that. I like that. Very good. Uh so I would also say that um just the running game in general in the first quarter, not great. No. It's just Antoine Smith did not get going in this game.",
    "speaker" : "Andy",
    "timestamp" : "52:05-52:38"
  },
  {
    "text" : "Outside those first three screens, they didn't have shit else going on that quarter. No, they really didn't.",
    "timestamp" : "52:38-52:44",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, I guess that takes us to the second quarter. Um, I think everybody's worst is probably James Jett catching a touchdown.",
    "timestamp" : "52:45-52:54"
  },
  {
    "speaker" : "Steve",
    "text" : "With three fucking catches all year. Yeah.",
    "timestamp" : "52:54-52:57"
  },
  {
    "timestamp" : "52:58-52:58",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "52:58-52:59",
    "speaker" : "Steve",
    "text" : "I thought that was crazy."
  },
  {
    "speaker" : "Andy",
    "text" : "But that's so like Patriots defense too is they take away the things you do best. And they actually even talked about it in this game where I think it was uh John they were talking about John Gruden saying like we have no idea what they're gonna throw at us, but we know they're gonna take away what we do well, so and then James Jett catches a touchdown. Which is there a better name for a wide receiver than James Jett?",
    "timestamp" : "53:00-53:20"
  },
  {
    "text" : "That's up there, yeah.",
    "timestamp" : "53:21-53:22",
    "speaker" : "Steve"
  },
  {
    "text" : "I mean there was Rocket Ismail. That's true. But that was that was a nickname. That's true. But James Jett, like, that's a great fucking name.",
    "speaker" : "Andy",
    "timestamp" : "53:22-53:32"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "53:34-53:42",
    "text" : "Maybe if you had like a silent D on the end, you know, then it could be like T D at the end. But yeah. That's wrong."
  },
  {
    "text" : "Good effort, but I don't think so.",
    "speaker" : "Andy",
    "timestamp" : "53:43-53:45"
  },
  {
    "timestamp" : "53:46-53:50",
    "speaker" : "Steve",
    "text" : "Wait, what? Like J-E-T-T and then I got D."
  },
  {
    "timestamp" : "53:52-53:58",
    "speaker" : "Greg",
    "text" : "J-E-T-T-D. Steve just wants a D. Oh, Steve, that that is the stretch of all stretches."
  },
  {
    "text" : "No way, man.",
    "timestamp" : "53:59-53:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "54:00-54:01",
    "text" : "Silent Delic."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "54:03-54:11",
    "text" : "Or you can just call him Jane's Jetted. Yeah, you could. And then you can go by Jane's Jet T D."
  },
  {
    "timestamp" : "54:12-54:28",
    "speaker" : "Andy",
    "text" : "He could. Maybe he did, who knows? Yeah, Raiders fans. If he didn't, he should have. You'll have to reach out to Stephen and let him know of that missed opportunity. Uh second quarter."
  },
  {
    "speaker" : "Steve",
    "text" : "I had a different worst actually.",
    "timestamp" : "54:29-54:30"
  },
  {
    "speaker" : "Andy",
    "text" : "For what, the first quarter or the second quarter?",
    "timestamp" : "54:31-54:32"
  },
  {
    "timestamp" : "54:32-54:42",
    "speaker" : "Steve",
    "text" : "Are we second quarter? All right. Right after that touchdown, Brady gets the ball back and just Sales one for an interception."
  },
  {
    "text" : "Yeah, I I watched that play a few times. I I don't know who he was throwing it to.",
    "timestamp" : "54:42-54:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Like what a Like they it's like we can't do anything on offense. They score a touchdown, they move the ball a little bit and get a touchdown. We hit the ball back. Brady like two plays it and just sails it, throws a pick on like R40.",
    "timestamp" : "54:47-54:59"
  },
  {
    "timestamp" : "55:00-55:33",
    "speaker" : "Andy",
    "text" : "Yeah, that wasn't great. That was probably the low point, I think, of this game. At least for me. But he was forcing it. Oh, definitely. He definitely was, but I don't even know who was forcing it to. There wasn't anybody like really in two, three feet over his head. It wasn't all that he needed to account for it. He's kinda looked at it. Yeah, I think it was Troy Brown was the closest guy and he's like, that was that wasn't to me. Which I love Troy Brown. I think that's been well established. Did not have his best game this game."
  },
  {
    "speaker" : "Greg",
    "text" : "Charles Woodson.",
    "timestamp" : "55:34-55:34"
  },
  {
    "text" : "Well I think also I th I think it was the the weather too didn't help him. He Yeah he's quick. He f he fumbled two punts. He wasn't beating anybody because he couldn't get his footing, so he couldn't he couldn't juke anybody. Um and they tried to do a reverse with him. I think it was in the second quarter. And it got blown up and he lost like seven or eight yards, which never happens. It's Troy Brown we're talking about. Like you'll find a way to reverse field again and and still get a first down.",
    "speaker" : "Andy",
    "timestamp" : "55:36-56:04"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Didn't have a great and was as good.",
    "timestamp" : "56:04-56:08"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:09-56:32",
    "text" : "Yeah, oh yeah. And we touched on this in the interview, but it felt like every catch David Patton had, he had fallen over already in the route. He would get up just in time to make the catch, like half the time he was on his knees. Still making the catch. And it was uh yeah, it was. It was kind of it was not the Troy Brown game in this game, for sure."
  },
  {
    "timestamp" : "56:34-57:09",
    "speaker" : "Steve",
    "text" : "Uh my best though was right after that pick Brady threw. I think they maybe got one first down or not. They're kinda right outside field goal range, probably right where he kicked the field goal. Yeah. And it was a f a third and medium when we blitzed and Otis came all the way across the entire formation, picked up Their best receiver Brown coming on a crossing route. Yep. Like I didn't think Otis was that fast, to be honest. But he like closed it and made an awesome play on the ball to force him to punt. And that that might have been the punt that went into the end zone. It was, yes."
  },
  {
    "text" : "And I just is an unsung hero for this team.",
    "timestamp" : "57:09-57:14",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "57:14-57:16",
    "text" : "Definitely. He really is, yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "For just the whole year. I mean this game he played pretty well too, but having watched these games, I mean, I've been surprised what a playmaker he was.",
    "timestamp" : "57:16-57:26",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "57:26-57:57",
    "text" : "See, that was one of the things that I remembered about this defense was Otis Smith for some reason. Him and Ty Law were just unbeatable. And I think this game was For on both sides, I think the um the defensive backs on in on both these defenses were top-notch. It was like they were putting on a clinic between Ty Law, Otis Smith, and Charles Woodson. Like you that that's that's film that you could use to teach other cornerbacks how to play defense.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "57:57-58:13",
    "text" : "You know who like made a huge impression on me on this game as a youngin'? Yeah. But like And yeah, I was right, but like Jane's jet like burned them burned us for a touchdown Wiggins came out of nowhere and fucked them too.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:13-58:14",
    "text" : "Yeah."
  },
  {
    "timestamp" : "58:15-58:17",
    "speaker" : "Steve",
    "text" : "Well, it's like the only time he did."
  },
  {
    "text" : "I had I wrote this down that this was his best game as a pro.",
    "speaker" : "Andy",
    "timestamp" : "58:18-58:20"
  },
  {
    "text" : "He had 10 catches, 70 yards. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "58:21-58:24"
  },
  {
    "speaker" : "Greg",
    "text" : "And now he hosts the morning show for KISS 107 whatever.",
    "timestamp" : "58:25-58:29"
  },
  {
    "speaker" : "Steve",
    "text" : "And I bet he doesn't wear gloves doing that either.",
    "timestamp" : "58:29-58:32"
  },
  {
    "timestamp" : "58:32-58:36",
    "text" : "He's the only guy out there no gloves. It's on WEI, isn't it? I think.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:36-58:40",
    "speaker" : "Greg",
    "text" : "Wiggy. Didn't he do like a like a pop culture one? Did he?"
  },
  {
    "timestamp" : "58:40-58:41",
    "speaker" : "Andy",
    "text" : "Oh maybe."
  },
  {
    "speaker" : "Greg",
    "text" : "I'm pretty sure he did. I think he's doing sports radio now. Wiggy in the morning or something like that. Yeah, yeah, yeah.",
    "timestamp" : "58:41-58:48"
  },
  {
    "speaker" : "Andy",
    "text" : "Something like that. But yeah, no, yeah, Steve, you're right. I think he was the only one out there that didn't have gloves on. And he was the leading receiver or at least one of them. It's amazing. Yeah. Oh, it's fantastic. So yeah, oh you did. You l you led the Patriots in catches. Him and Tim Brown both had 10 catches in this game. One of these things is not like the others.",
    "timestamp" : "58:48-59:14"
  },
  {
    "timestamp" : "59:15-59:21",
    "speaker" : "Steve",
    "text" : "On the third down conversion rate for both teams combined in the first half was one for thirteen."
  },
  {
    "text" : "Yeah, I mean that kind of goes back. I I felt like the Rays were actually moving the ball. It felt",
    "timestamp" : "59:24-59:30",
    "speaker" : "Andy"
  },
  {
    "text" : "In the second quarter they slowed down as well after that touchdown.",
    "timestamp" : "59:32-59:34",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "59:34-01:00:18",
    "text" : "They did, yeah. Well, in the first in the first quarter they were moving the ball. And then I felt like the the Patriots actually started Like after the touchdown pass, the Patriots started to to just bring pressure from everywhere. No blitzing it for like every play. And that slowed him down a bit. But It felt like they were playing their game. The Patriots just it felt like they were just going out there and being super conservative. And I remember that about this game. Yeah. Speaking in the first half, being like. Start throwing the ball like you you're gonna you're gonna get left behind. Yeah, and but the pages are content to just run it straight up the middle three times with Antoine Smith and and go three and out. Oh yeah. And you actually started to hear some boos in the second quarter with this. When they're they ran a draw on third and long.",
    "speaker" : "Andy"
  },
  {
    "text" : "That's that's classic Belichick though. And like him? It's gotta be. He d I mean this this has been consistent since this day, right? Of him like playing the Playing the game as it's like presenting itself rather than like playing your game, you know?",
    "timestamp" : "01:00:18-01:00:39",
    "speaker" : "Greg"
  },
  {
    "text" : "We're gonna do this, this, this, and that. It's like, all right, we're gonna try these couple things and see what works and then figure it out.",
    "timestamp" : "01:00:41-01:00:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "This is the guy that kicked off in overtime. Because he wanted the wind at his best. You know, it's like that that's that's to me saying I care more about like the external factors than my own team, you know?",
    "timestamp" : "01:00:45-01:00:59"
  },
  {
    "text" : "Oh, so when you were shitting on me the other day when I said Belletrack was kicking it short on purpose.",
    "timestamp" : "01:01:00-01:01:05",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01:06-01:01:27",
    "text" : "Yeah, I did I disagree with it. I disagree with it. I d honestly And I I mean obviously he's a better coach than I am, right? But from like a player's standpoint, if I was playing in this game, I'd be like, dude, let's throw the ball. Like let us make plays, you know? So I I could see how it'd be frustrating for the players and for the fans, you know?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:01:27-01:01:28"
  },
  {
    "text" : "But that's probably why he's better than us, is because all that ends all, Greg. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:01:28-01:01:33"
  },
  {
    "timestamp" : "01:01:33-01:01:36",
    "speaker" : "Andy",
    "text" : "Yeah. I mean it it was the right decision at the end."
  },
  {
    "speaker" : "Greg",
    "text" : "But yeah, I and I think But who knows? Maybe they throw the ball, they come out aggressive in the beginning and win by three touchdowns. You don't know.",
    "timestamp" : "01:01:36-01:01:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:01:42-01:01:45",
    "text" : "That's true, but then it wouldn't be a classic, would it?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:01:45-01:01:46",
    "text" : "That's true."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:01:46-01:02:31",
    "text" : "Yeah. And also I I mean they came out in the s second half, I thought, chucking the ball around, even though they're only down what seven nothing. Um especially that first drive of the third quarter. Um Brady hit Patton on two like long passes and they get it inside the five and they're still chucking it into the end zone and Brady Brady missed a couple of like easier throws. Like they did that play what they always do, the hard play action, and he tosses it over the line. And he overthrew, I'm assuming it was Wiggins. Um And then the play after he had somebody else wide open and just completely sailed it on him too, and they had to settle her for a field goal. Yeah, he sucks."
  },
  {
    "text" : "He only threw for three hundred and fifteen yards in a driving snowstorm. That's true, which surprised the shit out of me after watching",
    "speaker" : "Greg",
    "timestamp" : "01:02:33-01:02:42"
  },
  {
    "speaker" : "Andy",
    "text" : "The first half. Because I don't did he have any passing yards in the first half?",
    "timestamp" : "01:02:42-01:02:45"
  },
  {
    "speaker" : "Steve",
    "text" : "He was four for nine with a pick, and he like threw like a real bullet to Troy Brown right at the end of the second half.",
    "timestamp" : "01:02:46-01:02:53"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that's right, yeah.",
    "timestamp" : "01:02:53-01:02:54"
  },
  {
    "speaker" : "Steve",
    "text" : "And I got confused because the announcers were they're saying that he has a nice stroke. Like is that is that football or not football? Football, not football.",
    "timestamp" : "01:02:54-01:03:04"
  },
  {
    "speaker" : "Greg",
    "text" : "He did have a nice stroke. Who did? In fact, Tom he made it he made his name off his stroke.",
    "timestamp" : "01:03:06-01:03:13"
  },
  {
    "text" : "Made a couple kids too. Just like that swimmer. Made a name off his stroke.",
    "timestamp" : "01:03:16-01:03:24",
    "speaker" : "Andy"
  },
  {
    "text" : "But yeah, I think that like that bullet by Brady at the end, like it was pretty close to the end of the second half.",
    "timestamp" : "01:03:25-01:03:30",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:03:31-01:03:32",
    "speaker" : "Andy",
    "text" : "Yeah, I think it was the last try."
  },
  {
    "text" : "He was rifling it through there. And they were like, oh, all right, let's try open it up a little bit in the past game. Yeah. And the Raiders did too.",
    "speaker" : "Steve",
    "timestamp" : "01:03:32-01:03:40"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:03:40-01:04:00",
    "text" : "Yeah, yeah. It's kind of insane that they threw he threw the ball 52 times for 300 yards and they scored 16 points. I mean that's that's what I'm talking about, yeah. And and it didn't feel like I mean there was no like turnovers in the red zone. Usually when you get those kind of numbers is like a reason."
  },
  {
    "timestamp" : "01:04:00-01:04:01",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "I don't know. I just think they got conservative at weird times.",
    "timestamp" : "01:04:01-01:04:04",
    "speaker" : "Greg"
  },
  {
    "text" : "That's that's what it felt like, yeah. Then they were just I don't know. All of a sudden the drive was just end. And it it never felt like they were at least in the first half, it never felt like they were even challenging. I think oh they had one drive. Yeah, their first drive of the game they drove down, but then they tried to go for it on fourth and three 'cause they were like just outside of field goal range, I think. And didn't convert and that felt like that was as far as they got. At least in the first half.",
    "speaker" : "Andy",
    "timestamp" : "01:04:05-01:04:33"
  },
  {
    "timestamp" : "01:04:34-01:04:40",
    "text" : "Yeah. At times it felt like they were just trying to run off the clock. I'm like, guys, second quarter.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:04:42-01:04:46",
    "text" : "And you're and you're down seven nothing. Like you you gotta score at some point.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:04:46-01:04:46",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:04:47-01:04:57",
    "speaker" : "Andy",
    "text" : "But yeah, I mean if I told you at the first half after the first half that um Tom Brady would be the leading passer in this game, you Probably would have disagreed with me."
  },
  {
    "timestamp" : "01:04:58-01:04:58",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:04:58-01:05:03",
    "speaker" : "Andy",
    "text" : "But cause Rich Gannon I thought was actually doing well in that first half. He's moving the ball a bit. Yeah."
  },
  {
    "text" : "We did better in the third. Like this hurt looking eraseton.",
    "speaker" : "Steve",
    "timestamp" : "01:05:04-01:05:07"
  },
  {
    "timestamp" : "01:05:08-01:05:13",
    "speaker" : "Andy",
    "text" : "Yeah. Oh yeah. And yeah, I think Rice had a bunch of catches just in that third quarter, didn't he?"
  },
  {
    "timestamp" : "01:05:13-01:05:19",
    "text" : "Yep. Until they stuck Ty Law on him. Yeah, and then that was the end of that.",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh but yeah, Rich Gannon, like you said, Greg, uh pretty through it 52 times with 312 yards. Rich Gannon, 31 attempts, only had 159 yards.",
    "timestamp" : "01:05:20-01:05:30",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:30-01:05:33",
    "speaker" : "Greg",
    "text" : "Yeah. See it didn't feel like it played out like that."
  },
  {
    "speaker" : "Andy",
    "text" : "That's what I mean, yeah. It didn't feel like that at all. But uh all right yeah, third quarter Patriots settle for field goal Raiders do the same thing Uh Raiders had two field goals in this game and the one that I had forgotten, which I think we gotta give um what's his name, Janikowski?",
    "timestamp" : "01:05:33-01:05:53"
  },
  {
    "speaker" : "Greg",
    "text" : "The Polish powder keg.",
    "timestamp" : "01:05:53-01:05:55"
  },
  {
    "text" : "Yeah. He kicked In in that third quarter. He kicked the living shit out of me. He kicked a 45-yard field goal that would have been good from probably about 60.",
    "timestamp" : "01:05:55-01:06:04",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, the same one that Viniteri snuck through, he was hit in the back netting ten yards up. Yeah. I I love Janikowski.",
    "timestamp" : "01:06:04-01:06:13",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:14-01:06:15",
    "text" : "God's an absolute animal."
  },
  {
    "timestamp" : "01:06:16-01:06:22",
    "text" : "Like come on. Like that guy is just a mouth breather, you know? Just a mongrel.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but boy can that man kick a football.",
    "timestamp" : "01:06:22-01:06:25"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:06:26-01:06:30",
    "text" : "Yeah, you could just do one thing. Yeah. And they were like, we're riding this thing to the top."
  },
  {
    "timestamp" : "01:06:31-01:06:43",
    "speaker" : "Andy",
    "text" : "And but he never even tried to do anything else. Have you ever I I think it was him where there's videos of like On kick returns, and he's the last guy, and you just like let's the guy go. You just even like try to make a tackle or trip like you're just like, no, fuck it, that's not my job."
  },
  {
    "speaker" : "Greg",
    "text" : "And he clearly never like tried to work out or like take care of his body or something. He's just like a square. Yeah. He's like a rectangle.",
    "timestamp" : "01:06:43-01:06:53"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:56-01:07:13",
    "text" : "He yeah, but it reminds me of it, you know. Of our father like running around on a soccer field. Like just the dad bought, yeah. Not exactly smooth motion or anything. But could kick the shit out of things. Janikowski's good for him."
  },
  {
    "speaker" : "Greg",
    "text" : "I mean that's a good place to be in. He played a million years too. Yeah.",
    "timestamp" : "01:07:13-01:07:16"
  },
  {
    "text" : "Kicker in the two. He probably was. It'd be so awesome.",
    "timestamp" : "01:07:19-01:07:24",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:07:25-01:07:25",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "I'll say his uh field goals are set up by Ty Law. Back to back red zone possessions, ty-laws, or maybe not red zone, but within field goal range. They threw a tie-law on both of them.",
    "timestamp" : "01:07:26-01:07:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:07:40-01:07:46",
    "text" : "Yeah, Tyler put on the clinic in this game. Yeah. The number 24 is both of them. Yeah. Tyler played awesome."
  },
  {
    "text" : "Yeah. He he led the team in tackles. Did you see that? No. Ty Law did? Yeah, 12 tackles and two pass breakups. Holy shit.",
    "timestamp" : "01:07:46-01:07:54",
    "speaker" : "Greg"
  },
  {
    "text" : "And both those passive breakups on third down in the red zone. Yeah.",
    "timestamp" : "01:07:55-01:07:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I felt like more pass breakups than that, I have to say.",
    "timestamp" : "01:07:59-01:08:01"
  },
  {
    "text" : "I think he this is his type of game though. You know, like a physical get your hands on the guy. Yeah. It's just Tylaw's style, like punish him whenever you get a chance. He's he's an amazing tackler.",
    "timestamp" : "01:08:02-01:08:14",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:08:15-01:08:18",
    "text" : "If there would have been like Peyton Manning back there, he would have thrown like six picks.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:08:19-01:08:22",
    "text" : "Oh there's another CEL game that I forgot about.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:08:22-01:08:25",
    "speaker" : "Andy",
    "text" : "Oh yeah. Oh good call. Yeah, yeah."
  },
  {
    "timestamp" : "01:08:26-01:08:32",
    "speaker" : "Greg",
    "text" : "That's my favorite all-time single performance title against Peyton Manning. Yeah."
  },
  {
    "text" : "Uh you know who uh flashed a little bit in this quarter? Who's that? I put a note about is Bobby Hamilton.",
    "timestamp" : "01:08:34-01:08:42",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:08:43-01:08:48",
    "speaker" : "Andy",
    "text" : "Yeah, he was starting to get some pressure all by himself. And actually even uh Navi mentioned him. Yeah."
  },
  {
    "timestamp" : "01:08:50-01:08:59",
    "text" : "Really? Yeah. Yeah. He's just like sneaky like Otis, like he talked about earlier. Kind of like a sneaky contributor to this dynasty. Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, but he also l one of those guys who doesn't move particularly athletically.",
    "timestamp" : "01:09:02-01:09:07",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "No.",
    "timestamp" : "01:09:07-01:09:07"
  },
  {
    "text" : "It's like if Janikowski was playing defensive tackle or defensive end or whatever it was. Just a big goofy dude, but man, can he move when he needs to.",
    "timestamp" : "01:09:08-01:09:18",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "But I got a question. Yeah. Who would you rather sleep with, Janikowski or Rothlisberger?",
    "timestamp" : "01:09:22-01:09:29"
  },
  {
    "timestamp" : "01:09:30-01:09:34",
    "speaker" : "Steve",
    "text" : "Like we're just sharing a bed sleeping with? No, you know what I mean."
  },
  {
    "timestamp" : "01:09:40-01:09:46",
    "text" : "I feel like Janikowski would be gentler. Yeah. Rothburger's gonna take it.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:09:48-01:09:50",
    "text" : "Have you seen Rothsburger recently?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:09:50-01:09:51",
    "text" : "Looks like a mountain man."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:09:52-01:09:57",
    "text" : "He looks disgusting. Yeah. Disgusting."
  },
  {
    "timestamp" : "01:09:57-01:10:07",
    "speaker" : "Andy",
    "text" : "And this coming with a man who shaved only half his beard. Which half did you shave? The left or the right?"
  },
  {
    "speaker" : "Greg",
    "text" : "I can't The left. Yeah. You shave your left, okay. Side beard. Something. So an uh a good anecdote from that. When I was I played soccer in college until my senior year, and then my senior year I stopped playing. But I was still drinking aggressively. And it was a little I gained a couple pounds, you know, as you do. As you do, yeah. And the the you know how like the moment of rock bottom where you turn your life around and start eating healthier and shit? Yeah. Was one of Ellie's old boyfriends Told me that I looked like Rothless Berger. I was like, I gotta do something about this. Oh.",
    "timestamp" : "01:10:07-01:10:49"
  },
  {
    "timestamp" : "01:10:50-01:10:59",
    "text" : "Is that the one that couldn't eat pizza? Yeah, Ian. Yeah. Yeah. Oh yeah, because remember we did the the Domino's five five five deal. Wasn't it me and you, Greg, and him?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:00-01:11:01",
    "text" : "Yeah. I think so.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:11:01-01:11:15",
    "speaker" : "Andy",
    "text" : "Because we used to just do it in race so you could eat the pizza the quickest. And we both finished ours and he wouldn't let us look at his box. And when we opened it, he had like three quarters of a pizza left. So I believe we have some finish that too."
  },
  {
    "text" : "Those days are beyond those those days are behind me, Andy.",
    "timestamp" : "01:11:17-01:11:20",
    "speaker" : "Greg"
  },
  {
    "text" : "Are they?",
    "timestamp" : "01:11:20-01:11:21",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:21-01:11:23",
    "speaker" : "Greg",
    "text" : "I don't want to end up looking at Benny."
  },
  {
    "timestamp" : "01:11:27-01:11:31",
    "speaker" : "Andy",
    "text" : "What about the brown double double, Greg? You don't do that anymore?"
  },
  {
    "text" : "Yeah, those were dark days too. That was right around the same time. I can't believe we would do that. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:11:31-01:11:37"
  },
  {
    "timestamp" : "01:11:37-01:12:10",
    "speaker" : "Andy",
    "text" : "Because there's there's a uh a thing going around. I saw it on Twitter the other day. Where it's like, oh, if somebody were to pay you thirty five hundred dollars, uh, but you had to eat, I think it was two Uh what's the Burger King? Not Burger King uh McDonald's Big Macs. Two Big Macs, two large fries, and two things of nuggets and uh four sodas in 90 minutes. 90 minutes. Yeah. Would you do it? For 3500 bucks."
  },
  {
    "timestamp" : "01:12:10-01:12:11",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:12:11-01:12:17",
    "text" : "I thought to myself, we used to do that for lunch and then go continue to clean pools. Fucking stupid.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:12:18-01:12:33",
    "text" : "I d I don't think my body could handle that anymore. Like I if I eat dinner too fast now, I like have mud butt. It could be healthy food, but I just went too quick. It's just I'm s I'm like a fragile stomach guy now."
  },
  {
    "timestamp" : "01:12:33-01:12:39",
    "text" : "I am not. I I I've never really died Speed of intake, uh speed of outtake.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "No, no, it's a real thing, dude. Did not know that. Oh yeah. I think it's because I don't chew enough.",
    "timestamp" : "01:12:39-01:12:46"
  },
  {
    "text" : "Oh yeah, I I never chew enough.",
    "timestamp" : "01:12:47-01:12:49",
    "speaker" : "Andy"
  },
  {
    "text" : "And then it just starts rumbling. I can feel the rumbling and like an hour later and I'm like, God damn it, Greg, chew your food.",
    "speaker" : "Greg",
    "timestamp" : "01:12:49-01:12:55"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:12:57-01:12:59",
    "text" : "I get salad poos like crazy."
  },
  {
    "speaker" : "Greg",
    "text" : "That's all the roughage.",
    "timestamp" : "01:13:00-01:13:01"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, yeah, yeah.",
    "timestamp" : "01:13:01-01:13:03"
  },
  {
    "text" : "You gotta cut down on the leafy greens there, Steve.",
    "timestamp" : "01:13:04-01:13:07",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "When I eat a salad, I only eat a fucking salad, so I have like massive salads.",
    "timestamp" : "01:13:08-01:13:12"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:13-01:13:23",
    "text" : "Seems to have like ten pounds of lettuce. Yeah. Oh man. Speaking of rough it's here. Let's talk about this fourth quarter."
  },
  {
    "timestamp" : "01:13:23-01:13:26",
    "speaker" : "Greg",
    "text" : "Well we miss did we just skip the third quarter?"
  },
  {
    "speaker" : "Andy",
    "text" : "We talked about it. Okay.",
    "timestamp" : "01:13:26-01:13:27"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't want to gl gloss over this, but I forgot about the um incidental face mask penalty. 'Cause that came up. Oh yeah.",
    "timestamp" : "01:13:31-01:13:39"
  },
  {
    "timestamp" : "01:13:39-01:13:48",
    "text" : "Yeah, that's come up a couple times like early in the season. But yeah, the incidental, which was what, five yards, and then the the intentional was fifteen.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I kind of like that.",
    "timestamp" : "01:13:49-01:13:50"
  },
  {
    "text" : "I like that it's hard to like police, right? Like what's in the dental and what's not.",
    "speaker" : "Steve",
    "timestamp" : "01:13:51-01:13:56"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:13:56-01:14:02",
    "text" : "Well, I thought that 15 yards for something where you didn't mean to do it seems a bit extreme."
  },
  {
    "timestamp" : "01:14:02-01:14:04",
    "speaker" : "Andy",
    "text" : "Yeah, especially if you just brush it, you know."
  },
  {
    "speaker" : "Steve",
    "text" : "Right? So that why not just meet in the middle and say all are ten?",
    "timestamp" : "01:14:04-01:14:07"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:14:07-01:14:22",
    "text" : "Yeah, that's what they should have done. Oh yeah. Look at us solving problems. Yeah. Where's the NFL? Let's let's get them on the phone. Get Roger on the on the pod. Yeah. Oh, let's do it. What's he doing now?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:14:23-01:14:23"
  },
  {
    "speaker" : "Andy",
    "text" : "I saw that there was a uh there's a conspiracy theory going around that he's the one that created this whole panic so that he doesn't get booed at the draft.",
    "timestamp" : "01:14:24-01:14:32"
  },
  {
    "timestamp" : "01:14:34-01:14:36",
    "speaker" : "Greg",
    "text" : "You know, that has legs."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:14:36-01:14:43",
    "text" : "Right. So I think we should find out where he's staying. He says, doesn't he have a house in Maine that he's probably staying at? So we'll go there and boo him."
  },
  {
    "speaker" : "Greg",
    "text" : "He's got a house in Maine?",
    "timestamp" : "01:14:43-01:14:44"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:14:44-01:14:44"
  },
  {
    "text" : "Where in Maine? Oh.",
    "timestamp" : "01:14:46-01:14:47",
    "speaker" : "Andy"
  },
  {
    "text" : "On the coast somewhere.",
    "timestamp" : "01:14:48-01:14:49",
    "speaker" : "Steve"
  },
  {
    "text" : "That son of a bitch, dude. How dare he?",
    "timestamp" : "01:14:50-01:14:52",
    "speaker" : "Greg"
  },
  {
    "text" : "Well, like during the whole deflate gate, some dude hired a plane to fly over his house. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:14:52-01:14:57"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and Pete would like leave signs and shit around his his front gate because of course it's a gated house. Yeah.",
    "timestamp" : "01:14:58-01:15:04"
  },
  {
    "text" : "I don't like his kind in Maine. No. No. Gingers? I mean like well adjusted, yeah, rich people.",
    "timestamp" : "01:15:04-01:15:15",
    "speaker" : "Greg"
  },
  {
    "text" : "Or just rich people in general.",
    "timestamp" : "01:15:15-01:15:16",
    "speaker" : "Andy"
  },
  {
    "text" : "Maine doesn't like that's true. That's true. That's why I like Maine. Because you're poor? Well in in personality, yes.",
    "speaker" : "Greg",
    "timestamp" : "01:15:17-01:15:28"
  },
  {
    "text" : "Uh rich in looks though, right? Yes.",
    "speaker" : "Andy",
    "timestamp" : "01:15:31-01:15:34"
  },
  {
    "text" : "Oh Christ. All right, fourth quarter.",
    "timestamp" : "01:15:35-01:15:38",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:15:38-01:15:59",
    "text" : "Oh actually, oh one more thing in the third quarter. Uh to kind of prime the pump of what was to come, uh Brady got stripsacked on His well on the second drive of the the half. On second down. Yeah. Got strip sack managed to recover his own fumble. But yeah. Super lucky. Sign of things to come, yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:16:00-01:16:02",
    "speaker" : "Greg",
    "text" : "Consider my pump primed."
  },
  {
    "timestamp" : "01:16:02-01:16:13",
    "text" : "Oh baby. Oh man, the visual on that one is tough. I don't know if I can transition. You're gonna have to do it for me.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, build up the fourth quarter. Let's get it like you're like doing the TV, like coming back from commercial for the start of the fourth.",
    "timestamp" : "01:16:13-01:16:21"
  },
  {
    "timestamp" : "01:16:22-01:16:23",
    "speaker" : "Andy",
    "text" : "Lead me into it, huh?"
  },
  {
    "speaker" : "Greg",
    "text" : "No, you know what I mean, Steve. What Can you can you lead us into the fourth quarter here? Like build some tension a little bit.",
    "timestamp" : "01:16:26-01:16:34"
  },
  {
    "speaker" : "Steve",
    "text" : "Now, the moment you've all been waiting for. Patriots Raiders down by 10. The Patriots just got sacked to kill a nice drive, and the Raiders convert a quick first to open the fourth quarter.",
    "timestamp" : "01:16:34-01:16:50"
  },
  {
    "text" : "That's good. That was good.",
    "timestamp" : "01:16:52-01:16:54",
    "speaker" : "Greg"
  },
  {
    "text" : "That was good.",
    "speaker" : "Steve",
    "timestamp" : "01:16:54-01:16:55"
  },
  {
    "text" : "Is it accurate though?",
    "timestamp" : "01:16:55-01:16:56",
    "speaker" : "Greg"
  },
  {
    "text" : "Yes. My notes. That's one of my notes.",
    "timestamp" : "01:16:57-01:17:00",
    "speaker" : "Navi"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:17:01-01:17:03",
    "text" : "Patriots finally put a nice drive together."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep.",
    "timestamp" : "01:17:03-01:17:04"
  },
  {
    "speaker" : "Steve",
    "text" : "Then they got sacked. Right around midfield. Yeah. You get back to the Raiders and they get the quick person. And I was like, oh man, you know, Raiders put a nice drive together there. They're inside, you know, ten. Eight minutes left.",
    "timestamp" : "01:17:04-01:17:19"
  },
  {
    "speaker" : "Mom",
    "text" : "Yeah.",
    "timestamp" : "01:17:19-01:17:19"
  },
  {
    "timestamp" : "01:17:20-01:17:23",
    "speaker" : "Steve",
    "text" : "They had to burn a turn timeout, like twelve minutes left on the third down."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. Yeah, they were cavalier with their timeouts, which I don't think I actually came back to bite him, but it felt pretty typical. Because they were actually talking about um uh fucking what's his name? Rich Gannon, the quarterback, and how he was A bit of a loose canon. Ah, I didn't even mean to do that, but uh fucking Christ. Um but yeah, and the quote I wrote down was I don't remember, one of the commentators said it is talking about when they interviewed John Gruden and what he had to say about Rich Gannon, it was you need a good night's sleep to deal with Rich Gannon on game day. He's high maintenance. Yeah. So it's a good job this was a night game because he got a lot of sleep. And apparently like the two of them would just like bitch and moan at each other like during games, just like go after each other. Because Rich Cannon who'd been around since eighty seven, which do you know who he was drafted by?",
    "timestamp" : "01:17:24-01:18:19"
  },
  {
    "speaker" : "Greg",
    "text" : "Minnesota.",
    "timestamp" : "01:18:20-01:18:21"
  },
  {
    "timestamp" : "01:18:21-01:18:24",
    "speaker" : "Andy",
    "text" : "No. Your New England Patriots."
  },
  {
    "timestamp" : "01:18:24-01:18:24",
    "text" : "No.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. The fourth round pick, 98th overall in the 1987 draft by the New England Patriots.",
    "timestamp" : "01:18:25-01:18:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "We drafted Rich Gannon?",
    "timestamp" : "01:18:31-01:18:32"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:18:33-01:18:38",
    "text" : "We drafted Rich Gannon. Holy shit. Just goes to show what kind of downtimes they were."
  },
  {
    "text" : "And then just traded them?",
    "speaker" : "Greg",
    "timestamp" : "01:18:38-01:18:39"
  },
  {
    "timestamp" : "01:18:40-01:18:51",
    "speaker" : "Andy",
    "text" : "I don't know how he left the team, but how many years? No, yeah. Because he star yeah, his first year was in Minnesota. So he never actually played for New England, but he was drafted by them."
  },
  {
    "text" : "Damn.",
    "timestamp" : "01:18:51-01:18:52",
    "speaker" : "Navi"
  },
  {
    "timestamp" : "01:18:52-01:18:59",
    "speaker" : "Andy",
    "text" : "So I don't know what happened there, but I don't know, maybe a listener will tell us. Maybe a Minnesota Vikings fan if there are any left."
  },
  {
    "text" : "He had a pretty good career.",
    "timestamp" : "01:19:00-01:19:02",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:19:02-01:19:27",
    "speaker" : "Andy",
    "text" : "He did, yeah. But this was kind of the peak of his career was like 99, 2000. Well 99 through 2002, really. Made the Pro Bowl all four years. 2000, 2002, he made he was a All pro first team. First team all pro even. But yeah, the O his Oakland days were were his uh his real peak."
  },
  {
    "timestamp" : "01:19:29-01:19:31",
    "text" : "Can't too many players say that.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:19:32-01:19:39",
    "text" : "That's true. Well some old school old school Raiders guys out there probably.",
    "speaker" : "Andy"
  },
  {
    "text" : "You can definitely see Brady like turn it on in this fourth quarter.",
    "timestamp" : "01:19:39-01:19:42",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so yeah.",
    "timestamp" : "01:19:43-01:19:44"
  },
  {
    "timestamp" : "01:19:44-01:19:49",
    "speaker" : "Steve",
    "text" : "Like he had an awesome delivery right as he's getting like form tackled Kevin Falk."
  },
  {
    "timestamp" : "01:19:49-01:19:58",
    "text" : "Yeah, so yeah, so in that his first like full drive of the fourth quarter. He he went nine straight completions, I think it was on that drive.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:19:59-01:20:01",
    "speaker" : "Greg",
    "text" : "Yeah, he let the ponies out of the stable. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "They said, you know what?",
    "timestamp" : "01:20:01-01:20:02"
  },
  {
    "speaker" : "Greg",
    "text" : "Fuck it. We're gonna start trucking the ball because we're down too. Took the reins off and Tommy just took over.",
    "timestamp" : "01:20:02-01:20:06"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. But in True Pages fashion, did not throw a touchdown, but instead runs it in for the touchdown probably everybody who's listening to this actually remembers.",
    "timestamp" : "01:20:06-01:20:16"
  },
  {
    "text" : "But before that, was the uh he thrown like a wide receiver on the boundary. It was Patton maybe who like it bounced off his hands. Yep. And then Wiggins came right behind him and grabbed it and like toe-tapped his feet inbounds.",
    "speaker" : "Steve",
    "timestamp" : "01:20:17-01:20:31"
  },
  {
    "text" : "Yeah. Why Wiggins was even there. I don't know. Because I remember that play too, yeah.",
    "timestamp" : "01:20:31-01:20:38",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:20:38-01:20:53",
    "text" : "There's a couple plays where Wiggins was in suspect locations. Yeah, there was. Jesus Wiggins, chill out.",
    "speaker" : "Greg"
  },
  {
    "text" : "He was having himself a fucking day. He was having a great time.",
    "speaker" : "Andy",
    "timestamp" : "01:20:53-01:20:55"
  },
  {
    "text" : "Yeah. I have a note on here because like on that Brady touchdown, I mean obviously we've all seen it a million times.",
    "speaker" : "Steve",
    "timestamp" : "01:20:56-01:21:03"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "01:21:03-01:21:03"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh I have Beakert, that old middle linebacker from the Raiders. Yep. He's like the OG Brian Erlacher. It's the same kind of like Brady Jukes right goes left that he got Erlacher on in that Bears game. Yeah.",
    "timestamp" : "01:21:03-01:21:16"
  },
  {
    "speaker" : "Greg",
    "text" : "It does have that similar feel. It looked slow motion though. I remember thinking it was pretty poor attempt at tackling because Brady just kind of like fell forwards, not so much juked. Yeah.",
    "timestamp" : "01:21:17-01:21:30"
  },
  {
    "timestamp" : "01:21:31-01:21:41",
    "speaker" : "Steve",
    "text" : "I have a I have a stat check question for you, Greg. Sure. What's the longest TD run of Brady's career? Because that was like eight yards. It was longer than I remembered."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:41-01:21:44",
    "text" : "Ooh. That's a great question."
  },
  {
    "text" : "'Cause they're all like 'cause a million one yarders.",
    "speaker" : "Steve",
    "timestamp" : "01:21:44-01:21:47"
  },
  {
    "timestamp" : "01:21:47-01:21:54",
    "speaker" : "Andy",
    "text" : "Yeah, oh yeah, he's got a bunch of those. Twenty two yards. That was his longest run. I know he scored a twenty two yard touchdown though."
  },
  {
    "timestamp" : "01:21:55-01:21:56",
    "speaker" : "Greg",
    "text" : "Oh yeah, longest run."
  },
  {
    "text" : "And I love like the announcers being like, oh look at Tom Brady celebrating because he's so young, you know, youthful. It made me think of that um Julian Edelman punt return touchdown against the Broncos.",
    "timestamp" : "01:21:58-01:22:11",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:22:12-01:22:23",
    "text" : "Oh, where he ran down to wait, were you in the end zone? I'm gonna say this may have been his longest touchdown run."
  },
  {
    "speaker" : "Greg",
    "text" : "How m how many yards was it?",
    "timestamp" : "01:22:23-01:22:25"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:22:25-01:22:26",
    "text" : "Six."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he might be right.",
    "timestamp" : "01:22:27-01:22:29"
  },
  {
    "timestamp" : "01:22:29-01:22:32",
    "speaker" : "Andy",
    "text" : "I don't think there's one that was longer."
  },
  {
    "timestamp" : "01:22:32-01:22:34",
    "speaker" : "Greg",
    "text" : "I don't yeah, because he didn't make it."
  },
  {
    "timestamp" : "01:22:34-01:22:39",
    "text" : "According to uh patriotsdynasty. info, if you do some searching.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:22:40-01:22:42",
    "text" : "Yo, that is wild.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Does he have a five-yard? He does have a five-yard touchdown scramble against the Broncos. I don't remember this game. When was this? 2013. Oh, the 2013 AFC Championship.",
    "timestamp" : "01:22:42-01:22:55",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. He had a choop move in that one.",
    "timestamp" : "01:22:56-01:22:59",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so is so how about this? Tom Brady, uh playoff runner. All his longest touchdown runs come in the playoffs. Ooh.",
    "timestamp" : "01:22:59-01:23:07"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:23:08-01:23:14",
    "text" : "Every status about Tom Brady. That's a stat. Longest touchdown run."
  },
  {
    "text" : "Yeah. Six whole yards. He has a handful from four. Was this his first touchdown run as well?",
    "timestamp" : "01:23:15-01:23:21",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:23:23-01:23:28",
    "speaker" : "Greg",
    "text" : "Remember what we're really pushing our capabilities here in the stats department."
  },
  {
    "timestamp" : "01:23:28-01:23:30",
    "speaker" : "Andy",
    "text" : "Yeah, that's that's a tough one."
  },
  {
    "speaker" : "Steve",
    "text" : "But we just watched every game this year, which is all the games he'd started up to this point, and I don't remember him I don't remember any like QB sneaks, you're right, yeah.",
    "timestamp" : "01:23:30-01:23:38"
  },
  {
    "timestamp" : "01:23:38-01:23:45",
    "text" : "Yeah. I feel like This could be yeah, this is his only run. His only touchdown run of 2001.",
    "speaker" : "Andy"
  },
  {
    "text" : "Look at that. His first and his longest.",
    "speaker" : "Greg",
    "timestamp" : "01:23:47-01:23:50"
  },
  {
    "timestamp" : "01:23:50-01:23:56",
    "speaker" : "Andy",
    "text" : "Yeah, it was all downhill from here. More uphill really for him if you watch him run."
  },
  {
    "text" : "This is the first point in the game that it looked like we had a chance though.",
    "speaker" : "Greg",
    "timestamp" : "01:23:58-01:24:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, when they actually drove the ball down and they were just moving it. Easily it seemed like.",
    "timestamp" : "01:24:02-01:24:07"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:24:07-01:24:19",
    "text" : "And even like when we gave it back to them, there was like a third and one. They did a quick s a quick snap. Like we were definitely not ready. And that took it under five minutes of play. And then you're like, ooh, I don't know. Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:24:19-01:24:22",
    "text" : "Yeah, because the Raiders got that first down, like you said, on that play."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:24:22-01:24:23",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:24:23-01:24:33",
    "speaker" : "Andy",
    "text" : "Which Yeah, I think I feel like Yeah, it was they almost held him and then they didn't like it was third and short and yeah, like you said, they did the quick snap."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:24:33-01:24:35",
    "text" : "And they got like eight or nine yards in that quick snap, like stretch play."
  },
  {
    "text" : "Yeah, exactly. Um and then I have written down the Pats get the ball back with 335 left. Get one first down and then punt it. So nowhere.",
    "timestamp" : "01:24:36-01:24:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:24:47-01:25:12",
    "speaker" : "Greg",
    "text" : "Well, can we back up a little bit as far as like these like fourth quarter comeback situations like sure it's it's gotten to a point now where it feels inevitable, right? Oh god, yeah. Like that Super Bowl against the Rams. You were like, yeah, you know, they're not scoring, but It's gonna happen. You know? It's just a matter of when. Yeah."
  },
  {
    "timestamp" : "01:25:12-01:25:12",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:25:12-01:25:26",
    "speaker" : "Greg",
    "text" : "But I I don't I don't get the feeling, and just from like reading a couple of the articles from around here, it it it felt like that was the opposite. back then of it was it was a w when does this fall apart, not you know, when are they gonna pull it out of their ass?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:25:26-01:25:58",
    "text" : "And we've talked about that. In regards to Drew Bledsoe as well, because that was kind of the knock on him. It was he would he would hang in there the whole game, but then you'd have that last drive that you needed to have and something would go wrong. Yeah. It wasn't necessarily Bledsoe's fault, but Often enough it was like he'd throw a bad play or he's you know he's getting sacked, he's throwing it over his shoulder, sort of thing. Yeah, that sort of shit. Because he's just trying to put the team on his back. But yeah, this is kind of the beginning of that. that different feel, like you said."
  },
  {
    "speaker" : "Greg",
    "text" : "And that's where I think like Brady distinguishes himself. Not only from the rest of the league, but from like the coaching staff. Where like the staff puts him in a place where he can win games, but like when it gets to crunch time And you need this guy to start swinging the ball if Tommy gets out there and just starts slinging.",
    "timestamp" : "01:26:00-01:26:19"
  },
  {
    "timestamp" : "01:26:19-01:26:23",
    "text" : "Yeah. Like he just doesn't seem bothered by Any sort of pressure.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:26:25-01:26:31",
    "speaker" : "Greg",
    "text" : "He just thrives in it, you know? Yeah. It looks like he gets another gear when he's in those like crunch time moments."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:26:32-01:26:40",
    "text" : "I've had to say this so many times, oh does Belichick or Brady? And it's like, hey, it's both like Belichick. puts you in a position to get there and Brady has that extra gear."
  },
  {
    "timestamp" : "01:26:40-01:26:41",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:26:43-01:26:44",
    "text" : "Brady will win you the Super Bowls.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. And you could even see it uh from Brady's third start when he was playing the Chargers. And I know you guys weren't there for that episode, I think it's just me and Mike, but he pulled them from like way down late. To the point where I was watching the game and I'm thinking, I I think I'm watching the right game. I don't but they they come back and win this. And this is literally his third start and the one where he threw his first touchdown pass to Terry Glenn. And he pulled him back and then won an overtime. That's his third game ever. And so you kind of even saw it early. Um, but then you don't really see it again the rest of the season. Up until this.",
    "timestamp" : "01:26:44-01:27:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:27:25-01:27:29",
    "text" : "Yeah. We'll s we'd see it a lot more in the next few years.",
    "speaker" : "Greg"
  },
  {
    "text" : "To the point where it was more surprising when it didn't happen.",
    "speaker" : "Andy",
    "timestamp" : "01:27:30-01:27:33"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that's like the Eagles. Yeah.",
    "timestamp" : "01:27:34-01:27:38"
  },
  {
    "speaker" : "Andy",
    "text" : "From the Eagles Super Bowl. Yeah.",
    "timestamp" : "01:27:38-01:27:40"
  },
  {
    "timestamp" : "01:27:42-01:27:45",
    "speaker" : "Steve",
    "text" : "If he didn't get stripsacked, he was about to"
  },
  {
    "text" : "And he still almost did.",
    "timestamp" : "01:27:45-01:27:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "But that was the best thing about Brady, is there was there's so few times where you're like, oh I would have. Because he just did. Yeah.",
    "timestamp" : "01:27:48-01:27:54"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:27:55-01:27:56",
    "text" : "He always did."
  },
  {
    "speaker" : "Greg",
    "text" : "You know, even like coming back against Atlanta where it'd be like There were so many points in that game where you'll be like, even if they don't win this, you're gonna you're gonna look back fondly on how Brady played. Yeah. But that wasn't enough. He just he still did it. Which is like I think he just as hard as Getting there, you know?",
    "timestamp" : "01:27:56-01:28:15"
  },
  {
    "timestamp" : "01:28:16-01:28:33",
    "speaker" : "Andy",
    "text" : "Yeah. And go back to both your points uh about whether it's Bill or or Tom. Uh we can go back to the game where Belichick took the wind in overtime. against the the Broncos in that game. Because Brady pulled them all the way back in that game too, remember? They were down like twenty four nothing or something at halftime."
  },
  {
    "text" : "Mm-hmm. Oh, is that that game? It was fucking freezing. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:28:34-01:28:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Was that the game where your yeah, your beer was freezing because you weren't drinking it quick enough?",
    "timestamp" : "01:28:37-01:28:41"
  },
  {
    "text" : "Yeah. It was we were like two rows from the top of the stadium and it was like 10 degrees.",
    "speaker" : "Greg",
    "timestamp" : "01:28:41-01:28:48"
  },
  {
    "speaker" : "Andy",
    "text" : "And uh a shit.",
    "timestamp" : "01:28:48-01:28:50"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. And we were down twenty-four-nothing at halftime.",
    "timestamp" : "01:28:51-01:28:54"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:28:55-01:28:57",
    "text" : "Yeah, I came with you state for that game. It's crazy."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:28:57-01:29:08",
    "text" : "Yeah, we said that if if if the Patriots didn't score in their opening drive in the second half, we were gonna leave. And then they scored, and then scored again, and they scored again, and we're like, we ain't fucking leaving."
  },
  {
    "text" : "That might have been that Jules Pun return game that I Reference earlier, right?",
    "timestamp" : "01:29:08-01:29:13",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, I think you did have one in that game. No, it wasn't it wasn't that one though.",
    "timestamp" : "01:29:13-01:29:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It was the Muff Welker one where he waved it off.",
    "timestamp" : "01:29:17-01:29:20"
  },
  {
    "timestamp" : "01:29:20-01:29:26",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, but I think I I thought um Edelman had a part return for touchdown that game too though."
  },
  {
    "timestamp" : "01:29:26-01:29:30",
    "speaker" : "Greg",
    "text" : "No, he had that weird one where he took like the bubble screen that he dove from the five-yard line."
  },
  {
    "text" : "Yeah, he did have that one, yeah.",
    "timestamp" : "01:29:30-01:29:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That was great. That was iconic.",
    "timestamp" : "01:29:31-01:29:33"
  },
  {
    "speaker" : "Steve",
    "text" : "So the Raiders game.",
    "timestamp" : "01:29:36-01:29:37"
  },
  {
    "text" : "That's what we gotta do. That's what this is for. So yeah, well let's talk about this comeback, shall we?",
    "timestamp" : "01:29:40-01:29:46",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:29:47-01:29:57",
    "speaker" : "Steve",
    "text" : "Patriots down thirteen to three. Yeah. We blitz On the next third down, get the ball back."
  },
  {
    "text" : "Yep. And go absolute nowhere. They get one first down and then have to punt it right back. So the Raider to get the ball with 241 left.",
    "timestamp" : "01:29:57-01:30:07",
    "speaker" : "Andy"
  },
  {
    "text" : "There's a sweet another grab by Andrew Wiggins in there with the bat the ball between his two hands and catches it, just being super lucky again. Yeah.",
    "timestamp" : "01:30:08-01:30:15",
    "speaker" : "Steve"
  },
  {
    "text" : "So dangerous.",
    "timestamp" : "01:30:17-01:30:18",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:30:19-01:30:23",
    "speaker" : "Steve",
    "text" : "Did Phil Sims gets hit by a snowball from a guy on the ground. Oh, that's right."
  },
  {
    "text" : "That was awesome. And he's like, Greg, I think that was aimed at you. You could tell he was like initially pissed too. He was. He's like, I can see the guy who did it. Yeah. Dude imagine being that guy that threw that. He could he can watch this game on YouTube for years to come and be like, it was me.",
    "timestamp" : "01:30:24-01:30:46",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:30:48-01:30:52",
    "speaker" : "Andy",
    "text" : "Honestly, I can imagine you being the guy that threw that up. Oh dude, he's a legend."
  },
  {
    "text" : "And he's got people like us watching this game being like, did you see that part where fucking Kel Sims get hit by a fucking snowball?",
    "speaker" : "Greg",
    "timestamp" : "01:30:54-01:31:00"
  },
  {
    "speaker" : "Steve",
    "text" : "Plot twist, it was frozen beer.",
    "timestamp" : "01:31:01-01:31:04"
  },
  {
    "timestamp" : "01:31:05-01:31:07",
    "speaker" : "Andy",
    "text" : "If we can find out who that is, we should have him on the podcast."
  },
  {
    "text" : "Yeah. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:31:07-01:31:08"
  },
  {
    "timestamp" : "01:31:08-01:31:10",
    "speaker" : "Andy",
    "text" : "Guest of honor."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:31:11-01:31:13",
    "text" : "Put an A P B or whatever that thing is called."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:31:14-01:31:19",
    "text" : "Yeah. So then the Patriots are three for eleven on third down."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:31:20-01:31:33",
    "text" : "Yeah, not great. Yeah, yeah, Rays got the ball back with 241 and basically go three and out. Can't come because they they had a third and one and couldn't convert again, which is Second time."
  },
  {
    "speaker" : "Greg",
    "text" : "Seymour drive. Seymour monster on that play. Oh my god.",
    "timestamp" : "01:31:33-01:31:37"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:31:37-01:31:43",
    "text" : "Seymour was yeah on the third, but like Lawyer came flying in on the second down, too. Like both those guys."
  },
  {
    "text" : "Bruce, how about that hit by Brucey? Yeah. Up the middle.",
    "timestamp" : "01:31:45-01:31:49",
    "speaker" : "Greg"
  },
  {
    "text" : "Laura Malloy, I I had that he was just The only guy out there who looked like he could still like lay the wood. Because everybody else is kind of like skating around. And every once in a while you see Lloyd Malloy come out of nowhere and just thump somebody. And he was the only one who was able to like actually get a thumping on somebody. That's fantastic. Him and actually uh and what's his name? Fuck, I I'll remember it one day. Your friend's name, Steve. Navi. Yeah, there you go. So Navi actually was the one to call this out that Roman Pfeiffer had a great game in this game. Like he was the only one that could tackle Charlie Gardner, I thought. Apparently that was just me. Cool.",
    "timestamp" : "01:31:49-01:32:34",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I that did not uh that did not jump out to me at all.",
    "timestamp" : "01:32:34-01:32:37"
  },
  {
    "text" : "Oh.",
    "timestamp" : "01:32:38-01:32:38",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:32:39-01:32:43",
    "speaker" : "Steve",
    "text" : "Although we did have a signed Roman Pfeiffer football card, so Yeah."
  },
  {
    "text" : "For the Rams, but still. I probably still have it somewhere kicking around. That would be awesome. Hell yeah.",
    "timestamp" : "01:32:43-01:32:50",
    "speaker" : "Andy"
  },
  {
    "text" : "Roman Pfeiffer. That guy was mad probably worth as much as your fucking Pokemon cards, Dandy. Yeah, those are your Pokemon cards. I collect football cards, bro. Yo, I hit a Charizard holographic, dude. That thing is it's worth more than money. It's worth it's worth memories.",
    "speaker" : "Greg",
    "timestamp" : "01:32:50-01:33:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Didn't you give that to my nephew?",
    "timestamp" : "01:33:09-01:33:11"
  },
  {
    "text" : "Did I? Yeah. You gave all the cards to him. Oh, good. At least he can use them.",
    "speaker" : "Greg",
    "timestamp" : "01:33:12-01:33:19"
  },
  {
    "text" : "There go the memories.",
    "timestamp" : "01:33:20-01:33:21",
    "speaker" : "Andy"
  },
  {
    "text" : "I know you guys said Troy had a bad game, but he had a pretty solid punt return in this up until he fumbled it a second time.",
    "speaker" : "Steve",
    "timestamp" : "01:33:24-01:33:31"
  },
  {
    "speaker" : "Andy",
    "text" : "So, yeah, and that actually leaves me uh No, I'm gonna save the I'm gonna save something for you.",
    "timestamp" : "01:33:31-01:33:36"
  },
  {
    "speaker" : "Greg",
    "text" : "I know what you're saving.",
    "timestamp" : "01:33:37-01:33:38"
  },
  {
    "timestamp" : "01:33:38-01:33:39",
    "speaker" : "Andy",
    "text" : "I don't know if you do."
  },
  {
    "speaker" : "Greg",
    "text" : "I'm just gonna spoiler it right now. Larry is a two fumble regarding it.",
    "timestamp" : "01:33:39-01:33:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Motherfucker. You're looking at my fucking notes. How am I looking at your notes, dude? I want to say Larry Iso unsung hero of this game. Without Larry Izio it's the Patriots have two fumbles 'cause Troy Brown fumbled two punts and Larry Iso recovered both of them. Yeah, without that, two of those drives are ended immediately. One of those is the one that leads up to the fourth quarter. This one now, which I don't know. Does that does somebody want to take the reins on this one? Because this is a pretty important drive here.",
    "timestamp" : "01:33:43-01:34:18"
  },
  {
    "text" : "That's all we're gonna say about Larry Izzo?",
    "speaker" : "Greg",
    "timestamp" : "01:34:18-01:34:20"
  },
  {
    "text" : "What else you got? Special teams captain. Yeah, this is this is this is coming out party. This put him on the list. Um do I might email I'll find him on this list. Let's find out.",
    "timestamp" : "01:34:21-01:34:40",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, he was only like he was 27, been in the league. Four or five years. Yeah. Yeah. So you've been around. I made the Pro Bowl the year before.",
    "timestamp" : "01:34:40-01:34:52"
  },
  {
    "timestamp" : "01:34:53-01:35:03",
    "text" : "Yeah, I thought he was pretty awesome at that point. Yeah, with Miami. Was this his first year on the Patriots?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It was, yes. Yes. Oh. Making his mark.",
    "timestamp" : "01:35:03-01:35:07"
  },
  {
    "text" : "First of eight years on the Patriots.",
    "speaker" : "Andy",
    "timestamp" : "01:35:08-01:35:10"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:35:10-01:35:12",
    "text" : "Good for him. That's what I want."
  },
  {
    "text" : "Matthew Slater's for Matthew Slater was Matthew Slater.",
    "timestamp" : "01:35:12-01:35:15",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:35:15-01:35:28",
    "text" : "Yeah, wouldn't it be sweet to play in like a big game, but not have the pressure of actually having to perform, but just like accidentally fall on two fumbles and be like, dude, I contributed. You know? That's always been my dream."
  },
  {
    "timestamp" : "01:35:28-01:35:31",
    "speaker" : "Andy",
    "text" : "So that's exactly who I would be too. I would be that guy."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:35:31-01:35:35",
    "text" : "Yeah. I would be the guy that can't blow it, but he can save it."
  },
  {
    "text" : "You know? Oh yeah. That that role player. Who's probably the glue guy on the sidelines too? That's why he's already captain. You know? Great locker room guy. Maybe not the most skill, but you know.",
    "timestamp" : "01:35:36-01:35:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:35:47-01:35:50",
    "speaker" : "Steve",
    "text" : "Yeah, I warmed up the closer so good in the bullpen."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but I mean just like uh but that kind of goes to the the point of this Belichick system too is he has these guys in there, even in 2001, which maybe some of that's a bit lucky or this early, but We also talked like way back at the beginning of this season how Belichick had brought in um teen different uh free agents and they were all like tenure veterans.",
    "timestamp" : "01:35:51-01:36:16"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:36:16-01:36:16",
    "speaker" : "Steve"
  },
  {
    "text" : "And so guys like Izo is not quite that, but I mean he's a veteran in this league. Brought him in just to play special teams, and now he's got two fumble recoveries in what at this point is the most important thing in the season.",
    "speaker" : "Andy",
    "timestamp" : "01:36:17-01:36:27"
  },
  {
    "text" : "Pro Bowl Dolphin special teamer that he signs as a free agent.",
    "timestamp" : "01:36:28-01:36:31",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:36:32-01:36:32",
    "speaker" : "Andy",
    "text" : "Right, exactly."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:36:33-01:36:40",
    "text" : "That's a classic Bellcheck move. Probably paid way more than the pay him."
  },
  {
    "text" : "Oh, probably. Yeah, because you'll pay those middle level guys more than any other middle level guys will make. Yeah. It's the Belichick system, right? Definitely is. So yeah, so like you said, Troy Brown actually had a really good punt return until he fumbled it, but luckily the Pats recovered. Um So they started out, I think, like right around midfield, right?",
    "speaker" : "Andy",
    "timestamp" : "01:36:41-01:36:59"
  },
  {
    "speaker" : "Steve",
    "text" : "Nah, yeah, right around there.",
    "timestamp" : "01:37:00-01:37:01"
  },
  {
    "text" : "I was at this point in the game it was really tough to tell where anybody was. Yeah. I had no idea. And event and like you could actually hear the the the announcer. Like in in like not in the broadcast, but like the announcer in the stadium announcing where the ball was sometimes just because nobody had any fucking clue.",
    "timestamp" : "01:37:02-01:37:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I like the old school announcer too. Over the loudspeaker too. Yeah.",
    "timestamp" : "01:37:22-01:37:27"
  },
  {
    "speaker" : "Andy",
    "text" : "It feels like a high school game. Yes. They should bring that back. Antoine Smith, Smith, Smith, Smith. Yeah. Six yard gain on the carry. Carry, carry, carry. Yes, dude. Dude. I love that.",
    "timestamp" : "01:37:27-01:37:39"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:37:40-01:37:41",
    "text" : "That's very sweet."
  },
  {
    "text" : "It does have a good feel to it, doesn't it?",
    "speaker" : "Greg",
    "timestamp" : "01:37:41-01:37:42"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:37:43-01:37:43",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:37:43-01:37:46",
    "text" : "Just gives me the right feel on it. It's like Christmas, you know?",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Well that's why you when you started watching this game, that's what you that's what you uh sent us. Picture of you watching the game of the snow, saying it feels like Christmas.",
    "timestamp" : "01:37:46-01:37:54",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It's right, it does.",
    "timestamp" : "01:37:54-01:37:55"
  },
  {
    "timestamp" : "01:37:55-01:37:56",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:37:58-01:38:07",
    "speaker" : "Greg",
    "text" : "So first and ten at their own forty-six, two minutes left, down by three. Yep. Sprady time."
  },
  {
    "timestamp" : "01:38:07-01:38:17",
    "speaker" : "Andy",
    "text" : "Brady moves the ball a little bit, and now all of a sudden it is second and ten on the Raider 42 with a minute 47 left. They moved the ball a little bit, not a ton."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:38:17-01:38:22",
    "text" : "Brady had a first down scramble in that moving the ball, which he did. I totally forgot about."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:38:23-01:39:01",
    "text" : "Yeah, well, and this is this is the difference between this is what Drew uh Tom Brady brings to the the Patriots offense that Drew Blitzer doesn't remember. A big running element. Yeah, exactly. Which nobody's ever said about him since. Even though he's a thousand yard rusher. Yeah. Oh man, that still gets to me. Yeah, so second and ten, Raider 42, minute 47 left in the game. That is old. College teammate comes running off of his right side. Very unbrady-like."
  },
  {
    "timestamp" : "01:39:01-01:39:06",
    "speaker" : "Steve",
    "text" : "At least now it is to not see he got blown up a bunch in this f this season."
  },
  {
    "timestamp" : "01:39:06-01:39:23",
    "speaker" : "Andy",
    "text" : "Yeah, I mean I knew it was coming, so I was watching for Woodson to come on that blitz. And he didn't hide it. He took like three steps towards the line of scrimmage before Brady hiked the ball. It was you know, if you if I I would assume most quarterbacks would see that coming, at least these days."
  },
  {
    "speaker" : "Steve",
    "text" : "But well I mean just overall this season Brady got blown up like blind side hit a lot more than I remembered.",
    "timestamp" : "01:39:23-01:39:31"
  },
  {
    "timestamp" : "01:39:31-01:39:32",
    "speaker" : "Andy",
    "text" : "Yeah, no I agree."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:39:34-01:39:37",
    "text" : "Blindside hit Brady's taken, like couldn't tell you."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:39:37-01:39:46",
    "text" : "Yeah. Well he was also sacked, I think, the most uh in his career in this season. Yeah. 45 times guy."
  },
  {
    "text" : "Surprised he didn't get hurt because he didn't have elongated tendons at this point either. Maybe he did get hurt.",
    "speaker" : "Greg",
    "timestamp" : "01:39:48-01:39:55"
  },
  {
    "timestamp" : "01:39:55-01:40:01",
    "text" : "Well he did get hurt. Just not in this game. We'll get to that. That's true. That's true.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:40:02-01:40:02",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "text" : "Stay tuned next week. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:40:03-01:40:05"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:40:05-01:40:06",
    "text" : "The real dynasty."
  },
  {
    "text" : "So the commentators were like doubtfully a fumble. But then like they played it for the replay on the fans, and you could hear the fans all know about the tuck rule. Yeah. I think it's only that. Don't give me that, Steve. Everybody knew the tuck rule.",
    "timestamp" : "01:40:11-01:40:26",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:40:27-01:40:42",
    "text" : "No, they didn't disagree with that. You're out of your mind. That's a tough call. They saw the slightest movement on of the arm forwards and like any fan in the world that's pissed drunk in the fourth quarter, they go, I take a complete. Yeah."
  },
  {
    "timestamp" : "01:40:42-01:40:51",
    "speaker" : "Steve",
    "text" : "Which is exactly what's happened, but we have the real existing of like if his arm is like not all the way back and tucked in, then it's a incomplete versus a fumble."
  },
  {
    "speaker" : "Andy",
    "text" : "No, they had no idea. I mean they were ready to boo heavily when uh Walt Coleman, whoever the fuck it was, came back from his review. But yeah, I mean we've talked about this alright. We've seen this twice. Once in the Jets game where it was Vinnie Testa Verde. Uh I think it was the first Jets game, right? Where he did the same thing.",
    "timestamp" : "01:40:51-01:41:12"
  },
  {
    "speaker" : "Steve",
    "text" : "Mm-hmm.",
    "timestamp" : "01:41:12-01:41:13"
  },
  {
    "timestamp" : "01:41:13-01:41:41",
    "speaker" : "Andy",
    "text" : "And then uh just Last week for us. Uh yeah, in the in the last game of the season, where it was right, the end of the half in what was the name? Winky. Yep. There was Chris Winky was the quarterback and he it was the exact same thing where it was this botched Hill Mary and he it was almost exactly this same motion too where he was tucking it down, he fumbled it and basically threw it right into the ground. You just recovered it and could have walked in for a touchdown, but they blew it dead. Same thing."
  },
  {
    "timestamp" : "01:41:41-01:41:51",
    "speaker" : "Steve",
    "text" : "Is if you watch closely, Woodson hits Brady in the head. With his arm, which is a personal foul, fifteen yards."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:41:51-01:41:56",
    "text" : "Automatic first out. Yep. Steve incidental face mask."
  },
  {
    "timestamp" : "01:41:58-01:42:06",
    "text" : "It was roughing the passer. That was a fumble. I'm just I'm just pissed the the refs missed that rough in the passer call.",
    "speaker" : "Steve"
  },
  {
    "text" : "It's a fumble now. It wasn't then. Dude, it's it's a fumble. It was the right call at the time. Because there was a tuck rule at the time.",
    "timestamp" : "01:42:06-01:42:15",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:42:15-01:42:26",
    "text" : "Even that tuck rule, like that's meant to be like you lose control of it on a pump fake, right? No. No, it gets jarred loose."
  },
  {
    "timestamp" : "01:42:26-01:42:32",
    "speaker" : "Steve",
    "text" : "They were saying that the throwing motion encapsulates like the cocking the all the way forward and then the pull back in and then it reaches."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:42:33-01:42:34",
    "text" : "As long as his arm is moving forward, it's a fumble."
  },
  {
    "text" : "It doesn't have to slip out of your arm.",
    "timestamp" : "01:42:35-01:42:37",
    "speaker" : "Steve"
  },
  {
    "text" : "I think it's a fumble.",
    "speaker" : "Andy",
    "timestamp" : "01:42:38-01:42:40"
  },
  {
    "timestamp" : "01:42:40-01:42:52",
    "speaker" : "Steve",
    "text" : "I mean if you look at it in real speed, yeah, it's like a fumble. And today's day and age, sure it's a fumble. But In today's day and age, it's also a personal foul hit to the head. Steve."
  },
  {
    "speaker" : "Greg",
    "text" : "I'd be ripshit if I was a uh a Raiders fan. You know? Like they get off on a technicality.",
    "timestamp" : "01:42:55-01:43:01"
  },
  {
    "timestamp" : "01:43:02-01:43:12",
    "text" : "As Navi has told me hundreds of times, that call cost them two Super Bowls. He was convinced they were about to start their own dynasty.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, he did say that.",
    "speaker" : "Andy",
    "timestamp" : "01:43:12-01:43:13"
  },
  {
    "timestamp" : "01:43:13-01:43:17",
    "speaker" : "Steve",
    "text" : "And Gruden wouldn't have left and then they would have won the next year too."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:43:19-01:43:25",
    "text" : "Yeah, I mean that's fair. They were a good team. But you know, some teams get lucky."
  },
  {
    "text" : "He completely ignores beating the Steelers and the Rams, but you know, besides the point.",
    "timestamp" : "01:43:26-01:43:30",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:43:31-01:43:38",
    "text" : "And the fact that there's still like under two minutes left in this game are still losing, technically.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, but if they get that the game's over. It's kneel down time.",
    "timestamp" : "01:43:38-01:43:43"
  },
  {
    "text" : "Sure. But the Steelers were a wagon. The Rams are even more of a wagon. Like those are two of the best teams in NFL.",
    "timestamp" : "01:43:44-01:43:51",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. They were like a a class above everybody else.",
    "timestamp" : "01:43:52-01:43:55"
  },
  {
    "speaker" : "Steve",
    "text" : "It was the Super Bowl. Okay.",
    "timestamp" : "01:43:55-01:43:57"
  },
  {
    "timestamp" : "01:43:59-01:44:00",
    "text" : "Yeah, yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:44:00-01:44:15",
    "speaker" : "Greg",
    "text" : "I mean there's sometimes in your sports fandom you have to admit that the other team got jobbed. And to me, this is one of those cases, you know Where I could if I was on the other side of this call, I would be rip shit."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah.",
    "timestamp" : "01:44:16-01:44:16"
  },
  {
    "text" : "You know salty about the city. So I have all the sympathy. I have all the sympathy in the world for for Raiders fans for this.",
    "timestamp" : "01:44:16-01:44:24",
    "speaker" : "Greg"
  },
  {
    "text" : "I'd be I'd be pissed at my parents for bringing us up as Raiders fans personally, but I have a note on here.",
    "timestamp" : "01:44:24-01:44:29",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:44:30-01:44:34",
    "text" : "I'm surprised Grun's snow on his hat didn't melt. He's so hot.",
    "speaker" : "Steve"
  },
  {
    "text" : "That's a good one.",
    "speaker" : "Andy",
    "timestamp" : "01:44:36-01:44:37"
  },
  {
    "text" : "That's a very Greg Gumble thing to say.",
    "speaker" : "Greg",
    "timestamp" : "01:44:37-01:44:39"
  },
  {
    "text" : "But even so, um I have another point, like They were on the forty-two. They couldn't kick the field goal there, right? If they stop 'em on the third ensuing third and ten, this would just be a footnote.",
    "timestamp" : "01:44:42-01:44:54",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:44:55-01:45:17",
    "speaker" : "Andy",
    "text" : "Yep. And instead Brady hits Patton immediately for a first down, twenty-eight. Yep. And and this kind of goes back to Tom Brady again, just not like he he he's been doing this all season. He's been up and down, but every time he makes a mistake like that or something, the next play, they one, the Patriots let him throw the ball. And two, he goes out and just slings it and it usually good things happen."
  },
  {
    "timestamp" : "01:45:21-01:45:26",
    "speaker" : "Steve",
    "text" : "I mean it's easy to say, but um when you're reeling from a call like that, not going your way, definitely can't pass it."
  },
  {
    "speaker" : "Greg",
    "text" : "That's a momentum shifter for sure.",
    "timestamp" : "01:45:26-01:45:28"
  },
  {
    "speaker" : "Steve",
    "text" : "They had like they had at least one more chance and then obsc over time and all that.",
    "timestamp" : "01:45:31-01:45:35"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, they got jobbed.",
    "timestamp" : "01:45:39-01:45:40"
  },
  {
    "timestamp" : "01:45:42-01:45:44",
    "speaker" : "Andy",
    "text" : "Agree to disagree. It was the right call."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:45:47-01:45:49",
    "text" : "Well what's your opinion on this, Andy?"
  },
  {
    "text" : "I just told you my opinion. I mean yeah, it was it's a it's a shitty rule and I can understand why they feel like they got robbed, but it was called to the letter of the law at the time. Just sucks that it got overturned too, you know?",
    "speaker" : "Andy",
    "timestamp" : "01:45:49-01:46:04"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, but uh in the other ones like I bet more refs than not would call that uh fumble.",
    "timestamp" : "01:46:04-01:46:10"
  },
  {
    "text" : "It sorta reminds me of that um Des Bryant catch versus the Packers. Remember that? Yeah. Yeah. Which like that's great.",
    "speaker" : "Steve",
    "timestamp" : "01:46:10-01:46:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Greg, you really think that uh another referee in Foxborough in that game, in that stadium, is gonna call that against the Patriots? Yeah. I don't know that they would.",
    "timestamp" : "01:46:21-01:46:31"
  },
  {
    "speaker" : "Greg",
    "text" : "I know, but I think home field advantage is a real thing. But it wouldn't have even been a controversy if they were just like if they didn't even review it, you know?",
    "timestamp" : "01:46:35-01:46:43"
  },
  {
    "speaker" : "Andy",
    "text" : "It wouldn't have been a controversy if the pages lost either. It's only because the Patriots managed to pull it out of the end.",
    "timestamp" : "01:46:43-01:46:49"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, it's exactly and that game that call changed the result of the game. Yeah. Yeah. Yeah. That's what I'm saying. You can say like a letter of the law, this and that. Well then fine, fuck the law. You know what I'm saying? Like somebody made this law up that's an idiot. You know",
    "timestamp" : "01:46:49-01:47:10"
  },
  {
    "text" : "And that's why they changed.",
    "speaker" : "Mom",
    "timestamp" : "01:47:10-01:47:11"
  },
  {
    "text" : "I'd still be p and that's even worse because now you're admitting that the fucking call is dumb to begin with. You know? I agree. So I I would just be rip shit. I'd st I wouldn't be over it. Now, you know, twenty years later.",
    "timestamp" : "01:47:12-01:47:25",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:47:26-01:47:32",
    "speaker" : "Steve",
    "text" : "My point though is that they had chances to change the outcome of the game and make it a footnote. They didn't."
  },
  {
    "text" : "Yeah, but that's you know",
    "speaker" : "Greg",
    "timestamp" : "01:47:32-01:47:34"
  },
  {
    "text" : "Even in overtime.",
    "speaker" : "Steve",
    "timestamp" : "01:47:35-01:47:35"
  },
  {
    "text" : "You can say that about any game.",
    "timestamp" : "01:47:36-01:47:37",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:47:41-01:47:44",
    "text" : "They made the play. Let's get there. So we all know what happens, right?",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. What happens?",
    "timestamp" : "01:47:45-01:47:47",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:47:48-01:48:04",
    "speaker" : "Andy",
    "text" : "Adam Vinateri, 45 yards out, when blown in his face. Actually was blown in his back, according to the commentators. Squeaks a 45-yard field goal in probably like six inches of snow at this point. Like it's just piling up around him."
  },
  {
    "speaker" : "Greg",
    "text" : "Another iconic reaction to like celebration. That little double hop skip thing and then the hard fist pump and the points of the silent goosebumps.",
    "timestamp" : "01:48:05-01:48:16"
  },
  {
    "text" : "I'd also assumed that like they cleared the snow. Not in that one. But that's actually the later field goal. Like this one kicked it in like three inches of snow.",
    "timestamp" : "01:48:17-01:48:28",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:48:28-01:48:34",
    "speaker" : "Greg",
    "text" : "That's what I'm saying. Yeah. Like he he buried that. And you couldn't even see the damn thing either. No, yeah."
  },
  {
    "timestamp" : "01:48:34-01:48:36",
    "text" : "You just had to listen to the crowd. Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Which It's a pretty good call by the commentator actually.",
    "timestamp" : "01:48:37-01:48:41"
  },
  {
    "speaker" : "Andy",
    "text" : "What which one?",
    "timestamp" : "01:48:42-01:48:43"
  },
  {
    "speaker" : "Greg",
    "text" : "Whoever whoever did the does the play by play.",
    "timestamp" : "01:48:44-01:48:48"
  },
  {
    "text" : "What was the call?",
    "timestamp" : "01:48:49-01:48:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh well he just he didn't lose it, right? 'Cause I I feel like everybody lost sight of it, but he was like, It's up and it's good, because that's how I knew it was good. You should call it good even before the refs now indicated.",
    "timestamp" : "01:48:50-01:49:02"
  },
  {
    "text" : "Yeah. But I I thought you were going to talk about how uh I think it was The radio broadcast probably um of which I guess we probably didn't have here, but I I came across it. Uh Gino Capoletti. Yeah. Yeah, Gill and Gino. Yeah, that's it. And uh and the overtime field goalie basically said, I'm just gonna let the crowd's reaction tell you whether or not it's good. And then he just didn't say anything. Like kick is down, and then he just like didn't say anything. And you just heard the crowd go bananas. Like that's a great call.",
    "speaker" : "Andy",
    "timestamp" : "01:49:04-01:49:35"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:49:37-01:49:52",
    "text" : "And there are a there's there's a I can't remember what plays there were, but there were a few plays in this game where I could hear their call in my head just because I've seen the replays with their call on it so many times. Yeah, there's something that's kind of lost."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. I did miss the uh I don't remember, at least on the calls in my head, that they say that he missed four of his last five from forty-five plus. They said he made four of his last five. I had a I have a miss here.",
    "timestamp" : "01:49:53-01:50:09"
  },
  {
    "timestamp" : "01:50:09-01:50:13",
    "speaker" : "Greg",
    "text" : "We should get Connor on the pod. We'll have him clear it up for us."
  },
  {
    "timestamp" : "01:50:14-01:50:26",
    "text" : "Yeah, I do I do remember that uh of the ones that like when I was looking at it of the ones that um Vinateri would miss, they were usually from longer. So that wouldn't surprise me",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I mean you can be an average kicker if you hit the big ones. That's all you really need to do.",
    "timestamp" : "01:50:28-01:50:34"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, as long as you hit the late ones, nobody remembers the early ones.",
    "timestamp" : "01:50:34-01:50:37"
  },
  {
    "timestamp" : "01:50:37-01:50:49",
    "speaker" : "Greg",
    "text" : "Exactly. Which is Basically what that whole argument was about was Kostowski's a more accurate kicker, but yeah. Vinateri's gonna go down as the better kicker because"
  },
  {
    "text" : "Because he's got the iconic kicks.",
    "speaker" : "Andy",
    "timestamp" : "01:50:49-01:50:51"
  },
  {
    "text" : "The clutch. Yeah, the clutch kicks.",
    "timestamp" : "01:50:51-01:50:53",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:50:53-01:50:53",
    "speaker" : "Andy",
    "text" : "Yep."
  },
  {
    "text" : "Which I think is a fair assessment too of how you grade those types of players.",
    "timestamp" : "01:50:54-01:50:58",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I agree. Uh yeah, probably. I think there's probably some grayer in there because I mean you could also argue that Goskowski didn't have the chance to make those iconic kicks. Like he just w didn't have the opportunities, you know? He wasn't kicking game winning field like you didn't have the opportunity to kick a game winning field goal in the playoffs. So yeah. But yeah, I mean I like you said I think you're right that when people look at it, that's what they're gonna that's what they're gonna remember.",
    "timestamp" : "01:50:58-01:51:22"
  },
  {
    "timestamp" : "01:51:23-01:51:23",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "So now we're in overtime. Because the Raiders actually got the ball back after that field goal, 22 seconds left, and just took a knee. Which probably a bad decision. Yeah, it's twenty-two seconds, but still like put up a try.",
    "timestamp" : "01:51:25-01:51:41"
  },
  {
    "text" : "I don't know, snowing like crazy. Yeah, and might be the heaviest snowball game right here.",
    "speaker" : "Steve",
    "timestamp" : "01:51:41-01:51:47"
  },
  {
    "text" : "And I don't know if you guys noticed, but Rich Gannon was he was definitely struggling fourth quarter.",
    "speaker" : "Greg",
    "timestamp" : "01:51:47-01:51:54"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:51:54-01:51:54"
  },
  {
    "text" : "With like his grip. There's a couple like bubble screens that he floated him. And I was like, ooh, I think this heavier snow is starting to get to 'em.",
    "speaker" : "Greg",
    "timestamp" : "01:51:54-01:52:03"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's true. Yeah, I think they were talking about how the temperature dropped so the balls were getting harder. Football, not football. Um which I think is probably why Vinateri's kick is a bit more impressive in the fourth quarter with all that snow and cold than maybe um Janikowski's was in the in the third quarter, even though they're both the exact same distance. Pretty much from the same spot on the field, too. Both forty-five yarders going left to right.",
    "timestamp" : "01:52:04-01:52:32"
  },
  {
    "timestamp" : "01:52:32-01:52:35",
    "speaker" : "Steve",
    "text" : "Wait, now you do switch to the half or the quarter?"
  },
  {
    "timestamp" : "01:52:36-01:52:37",
    "speaker" : "Andy",
    "text" : "You switch a quarter."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. So once the same spot.",
    "timestamp" : "01:52:37-01:52:39"
  },
  {
    "text" : "Have you watched football before, Steve?",
    "speaker" : "Andy",
    "timestamp" : "01:52:39-01:52:41"
  },
  {
    "timestamp" : "01:52:42-01:52:43",
    "text" : "No, no.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Your first ever game. This is a good one to watch.",
    "timestamp" : "01:52:44-01:52:46"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:52:46-01:52:50",
    "text" : "Yeah. Thanks for having me, guys."
  },
  {
    "text" : "Wait, they play quarters?",
    "speaker" : "Andy",
    "timestamp" : "01:52:50-01:52:52"
  },
  {
    "text" : "I thought it was periods.",
    "timestamp" : "01:52:52-01:52:53",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Thought it was thirds. Just play four of them. Over time, Raiders call heads. It's tails. Patriots like the state never fails.",
    "timestamp" : "01:52:54-01:53:04"
  },
  {
    "timestamp" : "01:53:04-01:53:07",
    "text" : "Patriots always win coin tosses, too.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:53:07-01:53:08",
    "speaker" : "Andy",
    "text" : "The important ones they do, yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:53:09-01:53:17",
    "text" : "Yeah, right. I just think of like things that would make me mad if I w wasn't a Patriots fan. It's like, how the fuck do they always win the goddamn coin toss?"
  },
  {
    "timestamp" : "01:53:18-01:53:24",
    "text" : "Always the important ones. Yeah. It's like field goal kicking. You don't have to win the early ones. Yeah, exactly.",
    "speaker" : "Steve"
  },
  {
    "text" : "You've got to win the four ones.",
    "timestamp" : "01:53:25-01:53:26",
    "speaker" : "Andy"
  },
  {
    "text" : "Fails never fails. Yeah, it's like three that come to mind. Yeah. Falcon Super Bowl.",
    "speaker" : "Greg",
    "timestamp" : "01:53:26-01:53:32"
  },
  {
    "text" : "Yep.",
    "timestamp" : "01:53:32-01:53:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Chiefs AFC championship game.",
    "timestamp" : "01:53:33-01:53:35"
  },
  {
    "text" : "This one. Yeah. Yeah. Just overtime games in general. The ones that they need.",
    "speaker" : "Andy",
    "timestamp" : "01:53:36-01:53:41"
  },
  {
    "text" : "They get goddamn cheaters.",
    "speaker" : "Greg",
    "timestamp" : "01:53:41-01:53:43"
  },
  {
    "text" : "Uh but did you see that um one of the guys out for the overtime coin toss was Drew Bledsoe? Really? That was pretty badass, yeah. That is sweet. Yeah. So he is out. I mean Obviously the the Raiders called the the coin toss, but I like to think that Bledzo had something to do with it. I think he him where he was standing was was blocking the wind, and so it didn't have that extra half a flip. So because of that it landed tails. Yeah.",
    "timestamp" : "01:53:45-01:54:11",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Ooh, hey, I'm looking at the box score, by the way. Sorry to interrupt, but the the kickoff the right at the end of regulation there. Tackle made by Matt Chatham. Shout out. Yes. All right. Love it. Get him on the pod. All right. It's a great tackle. It was an unbelievable tackle. It was a good tackle. Yeah.",
    "timestamp" : "01:54:12-01:54:32"
  },
  {
    "text" : "For that late. And I mean, and he's one of those That's why they didn't try and get any points.",
    "timestamp" : "01:54:33-01:54:37",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:54:37-01:54:38",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, because they they pinned him deep late and he's got a big thing. He started the dynasty.",
    "speaker" : "Andy",
    "timestamp" : "01:54:38-01:54:42"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:54:42-01:54:43"
  },
  {
    "timestamp" : "01:54:44-01:54:57",
    "speaker" : "Andy",
    "text" : "Well he's one of those role players that like we talked about that that this patriot system is built on. He's he's one of those Those guys that you don't hear uh uh uh much about, but he's he's that like foundation that all these other great things happen are built on."
  },
  {
    "timestamp" : "01:54:57-01:55:00",
    "speaker" : "Steve",
    "text" : "I got a name for you on that same thing, J. R. Redman."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I would put it.",
    "timestamp" : "01:55:00-01:55:01"
  },
  {
    "text" : "This uh first drive overtime, first play, I think it might be the exact same one as that Rams Super Bowl final drive.",
    "timestamp" : "01:55:02-01:55:12",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:55:13-01:55:38",
    "speaker" : "Andy",
    "text" : "So I actually wrote down all the plays in the last drive. So yeah, actually, and even before that, I think another guy you can throw in here is Patrick Pass, because he's returning kickoffs in this game, which I didn't realize he did that. I feel like they seem to have a different guy back there every time. Because I remember for two weeks I had written down and we never brought it up, but there was some guy named Ben Kelly who I'd never heard of. And he was returning kicks and that's all he did, and you never saw him again."
  },
  {
    "speaker" : "Steve",
    "text" : "Starting speaking of that, Riddick Parker was a starter on the Patriots for this game. Who? Yeah. You just make that up. Oh, it's one of my notes. Like when they did their the introductions even. Holy shit. What position did he play?",
    "timestamp" : "01:55:39-01:55:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Defensive tackle apparently. Steve Brown is correct.",
    "timestamp" : "01:55:55-01:55:58"
  },
  {
    "text" : "Riddick Parker. Riddick Parker What? Never heard of him.",
    "timestamp" : "01:55:59-01:56:03",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Never heard of him again. Started this game. All right, back to unsung heroes, because he's just unsung.",
    "timestamp" : "01:56:04-01:56:15"
  },
  {
    "text" : "Very unsung. I mean I the least sung of them all.",
    "speaker" : "Greg",
    "timestamp" : "01:56:17-01:56:21"
  },
  {
    "text" : "I mean if the guys who are doing this stupid podcast don't actually know who he is, that's that's that's pretty unsung. Yeah, so Patrick Pass actually returned the o this uh overtime kickoff to the page 34, so that's a great start. Yeah. Um and then like you said, Steve, this was basically the the Redmond and Wigan show. It was a quick pass in the middle of Redmond and then a screen to Redmond for the first down where he broke a tackle down the sideline, which is another one of those like random plays I remembered. Yeah. And he broke it and ran for like fifteen yards on like second and six sort of thing. And then it was quick out to Wiggins, screen to Redmond, quick slant to Wiggins, middle to Wiggins, Redmond run up the middle, and uh and then a quick pass to Troy Brown to break the streak. And this is where we get to the point where I've forgotten about this, but this is some ballsy shit too. Like this is some game-winning play calling and all of it. The Pats have fourth and four on the 28-yard line. And instead of kicking the field goal there, even though I mean uh they're going in the opposite direction, so they're kind of kicking into the wind. So what's that? What's I think it's seventeen. I think you line up seven yards behind the line of seven.",
    "speaker" : "Andy",
    "timestamp" : "01:56:23-01:57:36"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, yeah, you're right. It's the same field goal they had at the end of regulation.",
    "timestamp" : "01:57:36-01:57:41"
  },
  {
    "timestamp" : "01:57:41-01:57:58",
    "text" : "Yeah, give or take, but this one's kind of into the wind, so yeah, you know what? Fuck it, we're going for it. Four they go for it. Yeah. And I think it was Greg who was talking about this play where um Wiggins thought it was to him, but it was actually to to Patton. And so Wiggins is diving out stretched for a ball that's not actually thrown to him.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:57:59-01:58:03",
    "speaker" : "Greg",
    "text" : "And and Patton's just like sitting in a mound of snow, what up to his waist."
  },
  {
    "text" : "He's probably already on the ground, he just can't see because it's like three inches of snow between his and his thighs.",
    "speaker" : "Steve",
    "timestamp" : "01:58:07-01:58:11"
  },
  {
    "timestamp" : "01:58:12-01:58:12",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Like imagine if Wiggins like gets his hand on that.",
    "timestamp" : "01:58:12-01:58:17"
  },
  {
    "timestamp" : "01:58:18-01:58:19",
    "text" : "Yeah. And knocks it out.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:58:22-01:58:36",
    "text" : "See, that's my fear. You know how I said my goal was to be the the guy that jumps on the fumble? My fear is I'm the guy that like goes for the ball. misses it and like actually tips it away from the intended receiver. And uh everyone hates me for life. Yeah."
  },
  {
    "text" : "Idiot Greg, you're even supposed to be there. You're the uh Colombian soccer player that scores an own goal against the United States in the World Cup.",
    "timestamp" : "01:58:37-01:58:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Or the uh Steve Bartman.",
    "timestamp" : "01:58:45-01:58:47"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:58:47-01:58:48"
  },
  {
    "timestamp" : "01:58:49-01:58:49",
    "text" : "Yep.",
    "speaker" : "Steve"
  },
  {
    "text" : "The Bill Buckner.",
    "timestamp" : "01:58:50-01:58:51",
    "speaker" : "Andy"
  },
  {
    "text" : "You're that asshole. But bats get out of jail free again.",
    "timestamp" : "01:58:51-01:58:56",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:58:56-01:59:00",
    "text" : "Yeah. Yeah. Is there any controversy in that one, Greg? You wanted to stir up?",
    "speaker" : "Andy"
  },
  {
    "text" : "No, that was a great play call. Great throw.",
    "speaker" : "Greg",
    "timestamp" : "01:59:00-01:59:02"
  },
  {
    "timestamp" : "01:59:03-01:59:07",
    "text" : "I'll say Antoine Smith's best play came up with that after that, staying in bounds.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so yeah, because then that at this point it's just like run the ball at the middle with Antoine. So two straight up the middle for no gain basically. And then on third down, I don't remember which commentator said it's like Uh they have to pass it here, and I I would be shocked if they didn't like do a play action throw and have Brady put the ball in Brady's hands. And all they did was hand it off to Antoine, right tackle, and he ran for first down and fell down inbounds.",
    "timestamp" : "01:59:08-01:59:34"
  },
  {
    "text" : "Well well why is it a good play to land and bounce?",
    "timestamp" : "01:59:34-01:59:38",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:59:40-01:59:44",
    "speaker" : "Andy",
    "text" : "I don't yeah, I don't think he meant to land and bounce. I was just going off what Steve said."
  },
  {
    "speaker" : "Greg",
    "text" : "Steve, care to comment?",
    "timestamp" : "01:59:45-01:59:46"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:59:46-01:59:49",
    "text" : "Yeah, you take take as much time off the clock as you can."
  },
  {
    "speaker" : "Andy",
    "text" : "Just in case you miss a field goal. That's a good call. Yeah. Yeah. Even though like the just a little bit of a few years, prepare for any oh you plan for the tie.",
    "timestamp" : "01:59:49-01:59:56"
  },
  {
    "speaker" : "Greg",
    "text" : "I thought it when he fell down that he did it intentionally, and then I was like, wait a second. I bet it was just like an instinct. I bet it is. Yeah. Well you know you know what it is. It's like tight game, uh we're like in field goal range. We're running down the game here.",
    "timestamp" : "01:59:58-02:00:15"
  },
  {
    "speaker" : "Steve",
    "text" : "Yep.",
    "timestamp" : "02:00:16-02:00:16"
  },
  {
    "timestamp" : "02:00:17-02:00:18",
    "speaker" : "Greg",
    "text" : "Stink says stay in bounds. Yeah."
  },
  {
    "text" : "Cause like how how uh pissed you get when like you know that person stay in bounds, they run out of bounds, and you're just like, ah Yeah, what are you doing?",
    "timestamp" : "02:00:19-02:00:26",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. But I no, here here's here's a theory for you. Uh the Patriots were going against the wind, so if they don't score here. The Raiders are pinned deep and they would have less time to drive down with the win to the other side to kick a field goal and hopefully the Patriots can hold them and then if we get a second overtime now the Patriots have the win at their back.",
    "timestamp" : "02:00:26-02:00:47",
    "speaker" : "Andy"
  },
  {
    "text" : "Boom. Done.",
    "timestamp" : "02:00:48-02:00:49",
    "speaker" : "Steve"
  },
  {
    "text" : "Wait. They have the wind right now.",
    "timestamp" : "02:00:50-02:00:53",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "02:00:53-02:00:54",
    "text" : "They're against the wind.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "02:01:01-02:01:12",
    "speaker" : "Andy",
    "text" : "time off the clock now as you can before you try this field goal, just so the Raiders don't have as much time to to use the win to their advantage. Yeah, in your face, Greg."
  },
  {
    "timestamp" : "02:01:13-02:01:17",
    "speaker" : "Steve",
    "text" : "That's a deep cut. That was definitely going how Antoine Smith's head as he's turning that."
  },
  {
    "text" : "You can tell I do yoga because that was a fucking stretch. But it's probably true.",
    "speaker" : "Andy",
    "timestamp" : "02:01:17-02:01:22"
  },
  {
    "timestamp" : "02:01:25-02:01:26",
    "text" : "It's okay stuff.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh well, I mean because it could go either way too, right? Yeah. Wouldn't you",
    "speaker" : "Greg",
    "timestamp" : "02:01:26-02:01:31"
  },
  {
    "text" : "How does it go the other way? You playing for a triple over time?",
    "speaker" : "Steve",
    "timestamp" : "02:01:33-02:01:36"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, because you're talking about so much time left that like if you're thinking about like how long an average drive takes how much time was left when they kicked the field goal? Like seven minutes or something like that, wasn't it? I don't actually know. Yeah, there's eight minutes left when he makes that run.",
    "timestamp" : "02:01:36-02:01:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so but yeah, and then you know, three more runs up the middle, which brings it down to six and a half minutes. So that's that's half the that's half the quarter right there. Yeah.",
    "timestamp" : "02:01:54-02:02:05"
  },
  {
    "timestamp" : "02:02:05-02:02:08",
    "speaker" : "Steve",
    "text" : "And they wouldn't be starting on the 34 like we did."
  },
  {
    "speaker" : "Andy",
    "text" : "Right. They'd be starting at their own five yard line basically at this point. Yep.",
    "timestamp" : "02:02:08-02:02:12"
  },
  {
    "text" : "So then you stop them deep in their own zone. Get the ball back and now you're against the wind again. But then the wind changes.",
    "timestamp" : "02:02:12-02:02:20",
    "speaker" : "Greg"
  },
  {
    "text" : "Well no, because yeah, yeah, then you run the clock out and you switch the other side and you kick an easy field goal.",
    "speaker" : "Andy",
    "timestamp" : "02:02:20-02:02:24"
  },
  {
    "timestamp" : "02:02:25-02:02:28",
    "speaker" : "Greg",
    "text" : "I think you guys are projecting too much for six and a half minutes."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:02:28-02:02:35",
    "text" : "Nope. I think you're just a goddamn hater. Get off this fucking podcast and go join a Raiders podcast."
  },
  {
    "text" : "Maybe I will. All right.",
    "speaker" : "Greg",
    "timestamp" : "02:02:35-02:02:37"
  },
  {
    "speaker" : "Andy",
    "text" : "There aren't any Raiders podcasts.",
    "timestamp" : "02:02:38-02:02:39"
  },
  {
    "text" : "Bill Romanowski's out there. Put him on the pod. Yeah.",
    "timestamp" : "02:02:40-02:02:44",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Get Romanowski on the pod.",
    "timestamp" : "02:02:44-02:02:46"
  },
  {
    "timestamp" : "02:02:46-02:02:48",
    "speaker" : "Andy",
    "text" : "You and Charles Woodson."
  },
  {
    "timestamp" : "02:02:49-02:02:56",
    "speaker" : "Steve",
    "text" : "Yep. That would be cool. Oh, Greg, you did have a Jerry Rice Raiders jersey, yeah?"
  },
  {
    "text" : "I had a Jerry Rice and I had a Charles Woodson.",
    "timestamp" : "02:02:57-02:03:01",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "02:03:06-02:03:57",
    "speaker" : "Andy",
    "text" : "Yeah, with the silver numbers. Yeah. Mm. Pretty bad. So there's not much left in this game. Yeah, bring us home. Yeah. So it was just Antoine up the middle and then that kind of Brady quote unquote sneak. Where he's basically just like moving the ball into the middle of the field to make the field goal easier. And then the Patriots line up for a field goal and the Raiders try to ice the kicker. Which was a great decision because that just lets the Patriots line help clear the snow so that uh Vinateri has an easier uh footing and an easier way to kick a field goal which he does from 23 yards out to win the game and now you got snow angels you got celebrations And you've got football for another week."
  },
  {
    "speaker" : "Greg",
    "text" : "And the official retirement of Foxboro Stadium.",
    "timestamp" : "02:04:00-02:04:02"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:04:03-02:04:03",
    "text" : "Yep."
  },
  {
    "text" : "What a way to go. Uh imagine being at that game.",
    "timestamp" : "02:04:03-02:04:06",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "My God.",
    "timestamp" : "02:04:07-02:04:08"
  },
  {
    "timestamp" : "02:04:08-02:04:14",
    "text" : "Iconic. Yeah. Yeah. The greatest game of the Patriots dynasty.",
    "speaker" : "Greg"
  },
  {
    "text" : "I was so hyped watching this game over again. Yeah. It was ridiculous.",
    "speaker" : "Steve",
    "timestamp" : "02:04:15-02:04:20"
  },
  {
    "speaker" : "Greg",
    "text" : "It was very enjoyable.",
    "timestamp" : "02:04:20-02:04:21"
  },
  {
    "timestamp" : "02:04:21-02:04:31",
    "text" : "I was I was still nervous watching it though. Yeah. I knew how it ended, but I was still like, whoa, whoa, whoa, oh my god, what's happening? These these boys better figure it out quick.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "02:04:32-02:04:41",
    "speaker" : "Greg",
    "text" : "I d I didn't get that feeling. It's because you didn't watch the game quick. I watched the game. How would I know about that thing that I called out Andy on?"
  },
  {
    "speaker" : "Andy",
    "text" : "Which one?",
    "timestamp" : "02:04:42-02:04:43"
  },
  {
    "text" : "Larry Izzo.",
    "timestamp" : "02:04:43-02:04:44",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, you son of a bitch. Haircut.",
    "timestamp" : "02:04:45-02:04:49"
  },
  {
    "timestamp" : "02:04:53-02:05:00",
    "text" : "My final note on all the I have pages of notes is just God I miss sports.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "02:05:01-02:05:03",
    "text" : "Yeah. I did get that feeling."
  },
  {
    "speaker" : "Steve",
    "text" : "I was like, oh fuck.",
    "timestamp" : "02:05:06-02:05:08"
  },
  {
    "speaker" : "Greg",
    "text" : "That's true. I go back to the back life. Yeah.",
    "timestamp" : "02:05:09-02:05:13"
  },
  {
    "text" : "Yeah. It's that feeling.",
    "timestamp" : "02:05:13-02:05:14",
    "speaker" : "Steve"
  },
  {
    "text" : "Alright, so then give me your best and worst, Steve.",
    "timestamp" : "02:05:15-02:05:18",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, well I wasn't prepared for this.",
    "timestamp" : "02:05:18-02:05:21"
  },
  {
    "speaker" : "Andy",
    "text" : "You broke the best of the words every fucking quarter Holy shit. Alright, Greg, give your best and worst.",
    "timestamp" : "02:05:22-02:05:30"
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, someone go go first, Andy. I gotta think of mine.",
    "timestamp" : "02:05:30-02:05:35"
  },
  {
    "speaker" : "Andy",
    "text" : "All right, all right. Um Let's see, I got a couple of bests. There's small things. One was uh Richard Seymour, horse crawling the shit out of Rich Gannon. Yeah, and I think it was like the third quarter.",
    "timestamp" : "02:05:35-02:05:49"
  },
  {
    "timestamp" : "02:05:49-02:05:54",
    "speaker" : "Greg",
    "text" : "Like when the when you're defense in Dominican Sioux, like it was just like you just"
  },
  {
    "speaker" : "Andy",
    "text" : "Reached out one of those real long arms, grabbed him by the back, and just like just went straight limp himself and just fell straight to the ground. Just yanked Ganon straight back and Ganon was pissed.",
    "timestamp" : "02:05:55-02:06:05"
  },
  {
    "timestamp" : "02:06:06-02:06:13",
    "speaker" : "Greg",
    "text" : "I wonder how it feels to be that strong. Where you just grab a grown human and just like deadweight yourself and that guy gets raged off."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, just literally a human being. Yeah. An athletic human being. Big powerful man. Oh my god. So that was one. And then there was another one. Um Charles Woodson was returning punts. And so he fair caught one and Lonnie Paxson came over and just like punched the ball out of his hand after the play was over, just to be a dick, because that was that it was just how that game was going at that point. And I love the pettiness of it. From Lonnie Paxson, your fucking um long snapper, who then would make himself famous for doing the uh The Snow Angels after the game winner.",
    "timestamp" : "02:06:14-02:06:53"
  },
  {
    "text" : "Another iconic image.",
    "timestamp" : "02:06:53-02:06:55",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "02:06:55-02:07:19",
    "text" : "Yeah. Uh I think I remember this one now. Um My worst was the Raiders. They tried to go no huddle. Um, because apparently like that was a thing that they did and they would always try to catch people off guard and Rich Gainon was this wily veteran and they tried to go no huddle and immediately a call for a false start. Back to it again. Just never went back to it again.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, dumbfox.",
    "timestamp" : "02:07:20-02:07:22"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:07:22-02:07:27",
    "text" : "Yeah. So good for them. No huddle in the snow on the road."
  },
  {
    "speaker" : "Steve",
    "text" : "False star is what you get, you idiots.",
    "timestamp" : "02:07:27-02:07:29"
  },
  {
    "text" : "Right, and I think it was in like the first quarter too. And that was supposed to be like he was making a big deal of it. Like, oh, they're going in there, they're no huddling, like this is gonna cause a patient's problems all night. And then it just they never went back to because of the false start. Alright. That feels like the Raiders. Do any of you else have any? Or do we waste them all in the quarters?",
    "timestamp" : "02:07:29-02:07:50",
    "speaker" : "Andy"
  },
  {
    "text" : "I got one more best.",
    "timestamp" : "02:07:50-02:07:52",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:07:53-02:07:53",
    "text" : "Give it to me."
  },
  {
    "timestamp" : "02:07:54-02:08:11",
    "speaker" : "Steve",
    "text" : "First huddle of the game. Tom Brady trots out there. And you can see on the TV fee. He like points at someone on a sideline and gives them like a nice grin. And I just look super relaxed for like his first playoff game in the snow and you know."
  },
  {
    "speaker" : "Greg",
    "text" : "California boy.",
    "timestamp" : "02:08:12-02:08:13"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, he's like Trots out there and points someone out and gives them like a smile and just like gets down to business.",
    "timestamp" : "02:08:13-02:08:20"
  },
  {
    "timestamp" : "02:08:21-02:08:31",
    "speaker" : "Greg",
    "text" : "He never did look shook at all throughout the show. Yeah, that's my worst is that Tom doesn't play for us anymore."
  },
  {
    "timestamp" : "02:08:31-02:08:36",
    "speaker" : "Andy",
    "text" : "Yeah, because today's the day that he he wrote that article too."
  },
  {
    "text" : "Yeah. I read it on the denial stage.",
    "timestamp" : "02:08:38-02:08:41",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:08:42-02:08:45",
    "text" : "And then I was miserable, so I sent it to you guys so that uh you could share my misery."
  },
  {
    "text" : "Oh I clicked the link and I saw what it was and then I immediately X'd out.",
    "timestamp" : "02:08:46-02:08:49",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, I never read your texts anyway, so I just missed it.",
    "timestamp" : "02:08:49-02:08:53"
  },
  {
    "text" : "Can't read, doesn't watch the games.",
    "timestamp" : "02:08:57-02:08:59",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:09:01-02:09:12",
    "speaker" : "Andy",
    "text" : "Because he's like Rainman, he just remembers these games without having to watch them again from when they happen live. That's right. He's got his fucking uh scrapbook of all the the Boston Globe articles."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, this this game did bring up a whole lot of memories though. Like I really sitting in the basement watching it. This is the one where dad scraped his hands on the ceiling, right?",
    "timestamp" : "02:09:14-02:09:26"
  },
  {
    "timestamp" : "02:09:26-02:09:27",
    "speaker" : "Andy",
    "text" : "No, that was a Super Bowl."
  },
  {
    "timestamp" : "02:09:28-02:09:43",
    "speaker" : "Greg",
    "text" : "That was a Super Bowl. Yeah, because I remember that. I don't remember exactly where we were on that one. I remember scrapbooking after the game, you know, collecting all the Boston Globes, cutting out our all my favorite things, get my mom to laminate 'em."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that's right, you did, wouldn't she? Oh yeah, I still have the poster boards.",
    "timestamp" : "02:09:44-02:09:48"
  },
  {
    "text" : "Laminated poster boards with all the newspaper clippers.",
    "speaker" : "Greg",
    "timestamp" : "02:09:48-02:09:51"
  },
  {
    "text" : "How much do you think that costs you? She was just running a preschool and you're fucking Using her entire lamination budget on you.",
    "speaker" : "Andy",
    "timestamp" : "02:09:51-02:09:57"
  },
  {
    "timestamp" : "02:09:58-02:10:02",
    "text" : "You know, I never considered that, Andy. Yeah, lamination shock",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:10:03-02:10:10",
    "text" : "Ten year old Greg. Yeah. So it's a big ass piece of lamination. Yeah, it was pretty big."
  },
  {
    "text" : "It was worth it because he still got him.",
    "timestamp" : "02:10:10-02:10:12",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:10:13-02:10:48",
    "speaker" : "Andy",
    "text" : "That's right. That's true, yeah. So they they've uh w they paid their money's worth. Oh, I had I had one last question I wanna uh wanna ask you boys. Um How much money would it take for you to attempt to tackle Antoine Smith in his prime? Cause I'm pretty sure I would break probably a couple bones. If I if I said to you, all right, we're gonna do the what is the Oklahoma drill, and if you If you stop him from getting past you, I'll give you X amount of money. What would that money need to be for you to actually get in there? I have to stop him?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:10:48-02:10:53",
    "text" : "Yeah, it's a theoretical number because I'm not gonna stop him. So I'm just gonna give it a little bit more. Or at least try."
  },
  {
    "timestamp" : "02:10:54-02:10:55",
    "text" : "I mean yeah, you'll slow him down.",
    "speaker" : "Andy"
  },
  {
    "text" : "I'll try like with like a 1% effort and just be like, eh, and let him run by me.",
    "timestamp" : "02:10:55-02:11:00",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:11:00-02:11:08",
    "speaker" : "Andy",
    "text" : "No, you actually have to make it a a tackle attack. Am I wearing am I wearing Zanfon Smith? Yeah, oh yeah. Full pads."
  },
  {
    "text" : "So I was gonna throw my body at him, let him truck stick me, and then he's on his way?",
    "timestamp" : "02:11:08-02:11:12",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah",
    "timestamp" : "02:11:12-02:11:13"
  },
  {
    "timestamp" : "02:11:13-02:11:15",
    "speaker" : "Steve",
    "text" : "Just once. I'll do it for like five, ten grand."
  },
  {
    "text" : "Here's a question. How much would you pay in today's dollars to attend this game if you knew the outcomes? Yeah.",
    "speaker" : "Greg",
    "timestamp" : "02:11:17-02:11:25"
  },
  {
    "text" : "I would take out a Does everybody know the outcome?",
    "timestamp" : "02:11:26-02:11:29",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "No. You can tra you can pay like five grand, go back in time and attend this game. Yeah. And then you transport it right back.",
    "timestamp" : "02:11:29-02:11:37"
  },
  {
    "timestamp" : "02:11:37-02:11:45",
    "speaker" : "Steve",
    "text" : "I would like the same Antoine Smith drops me. To go back in time to watch this game, without a doubt. Those two are equal."
  },
  {
    "timestamp" : "02:11:46-02:11:47",
    "text" : "That's fair.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I like that answer. Like so he he just hits me, I black out, and then I wake up at the game. Boom.",
    "timestamp" : "02:11:47-02:11:52"
  },
  {
    "text" : "Oh yeah. Alright. Alright.",
    "speaker" : "Andy",
    "timestamp" : "02:11:52-02:11:55"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm remortgaging the house, you know? Yeah, probably true. Every dime I have.",
    "timestamp" : "02:11:56-02:12:02"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:12:03-02:12:06",
    "text" : "401k is just my wife's 401k see a later."
  },
  {
    "speaker" : "Greg",
    "text" : "I'll take the penalty.",
    "timestamp" : "02:12:07-02:12:09"
  },
  {
    "speaker" : "Andy",
    "text" : "I sold both the cars. I don't know what to tell you.",
    "timestamp" : "02:12:11-02:12:14"
  },
  {
    "speaker" : "Steve",
    "text" : "An absolutely iconic game to go to, especially it being the last game in the stadium too. Right. Oh god, yeah. Take the benches home with you.",
    "timestamp" : "02:12:14-02:12:21"
  },
  {
    "text" : "How long do you think it took people to get home from that though? Over time down at old Foxboro Stadium at fucking eight thirty at night. Oh my god.",
    "timestamp" : "02:12:21-02:12:28",
    "speaker" : "Andy"
  },
  {
    "text" : "In this with a foot of snow on the ground. Exactly. That's been like accumulating sh since you parked. But it probably is still there.",
    "timestamp" : "02:12:29-02:12:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:12:37-02:12:44",
    "text" : "And you can even like like shovel it out too because like where are you gonna put that snow trying to get out? Oh god."
  },
  {
    "text" : "The game was a Saturday game. And they were like, you know what, when we build a new stadium, we should just build in the same place. Because it's really working out the traffic. Fucking idiots.",
    "timestamp" : "02:12:46-02:12:58",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "02:12:59-02:13:05",
    "text" : "But now you can park there for free in one of the back lots, but uh you're not allowed to leave for an hour after the game.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That's a good idea.",
    "timestamp" : "02:13:07-02:13:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. That's what I'd last.",
    "timestamp" : "02:13:08-02:13:10"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Or if you go to a game of grant, he loses his phone and then you lose him and You stand around for two hours waiting to find out where the fuck he is. So not pay for that privilege.",
    "timestamp" : "02:13:11-02:13:23"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, fair enough.",
    "timestamp" : "02:13:24-02:13:25"
  },
  {
    "text" : "And then Steve bitches for the rest of his breathing life about it.",
    "timestamp" : "02:13:26-02:13:30",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "All right. Will you guys have anything else you want to talk about in this game? I think we've pretty much covered literally every play, it feels like. Yeah. Uh it was worth it though. I mean this was this was one of those iconic moments in the dynasty.",
    "timestamp" : "02:13:34-02:13:51"
  },
  {
    "timestamp" : "02:13:51-02:13:54",
    "speaker" : "Steve",
    "text" : "Even the Steelers game next week is the same way."
  },
  {
    "timestamp" : "02:13:54-02:14:02",
    "text" : "Yeah. In a different in a different way though. Because it's it's not at home, but you're going into you're going into Pittsburgh.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yep",
    "timestamp" : "02:14:02-02:14:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Three Rivers Stadium or is this Heinz Field at this point? I don't remember. Four Rivers Stadium. Four rivers? I thought it was three rivers.",
    "timestamp" : "02:14:03-02:14:10"
  },
  {
    "timestamp" : "02:14:10-02:14:12",
    "speaker" : "Steve",
    "text" : "Three rivers. It's four."
  },
  {
    "speaker" : "Andy",
    "text" : "Are you are you just being a dick now or is it it's actually Heinz Field, so it doesn't fucking matter anyway. Catch up stadium. Yeah. I feel like this is like early Heinz Field though. Yeah. We'll find out next week. All right. Well, this has been a special playoff episode of the Patriots Dynasty Podcast.",
    "timestamp" : "02:14:13-02:14:36"
  },
  {
    "timestamp" : "02:14:36-02:14:46",
    "speaker" : "Greg",
    "text" : "And we'll see you for another one. I'm cutting it. I'm done now. You're done? You're all done? You're never done. I got to my favorite game. It's all going out on top. All right. Yeah, it's just downhill from here."
  },
  {
    "text" : "That's right. Well, you weren't watching the game anyway, so that's fine.",
    "timestamp" : "02:14:46-02:14:49",
    "speaker" : "Andy"
  },
  {
    "text" : "So next week, we will see you again for another special playoff episode of the Pages Dynasty Podcast. See you later.",
    "speaker" : "Navi",
    "timestamp" : "02:14:51-02:14:59"
  },
  {
    "timestamp" : "02:15:00-02:15:01",
    "speaker" : "Mom",
    "text" : "See you later."
  }
]