[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:18",
    "speaker" : "Mom"
  },
  {
    "text" : "Welcome back to the Patriots Dynasty Podcast. This is a 2002 season working our way through. We're on uh week 14 against the Buffalo Bills. with Drew Bletto's return to Gillette Stadium, even though he never actually played there. That's good. But before we get into this game, we have a very special guest on. Someone I personally am super excited to talk to. And we have with us today Brian Morey. And um you may not recognize the name, but you'll recognize what he does. So I'm actually gonna let him explain what he's doing these days. Brian, how are you?",
    "timestamp" : "00:23-01:02",
    "speaker" : "Andy"
  },
  {
    "text" : "I'm doing well guys. Thanks for having me. Um yeah, I'm I'm the executive director of the Patriots Hall of Fame, presented by Raytheon Technologies. And uh, you know, after uh uh covering the team back in two thousand two for Patriots Football Weekly, but um yeah, do it running the museum now, having a great time doing that and uh getting to talk a little Patriots history more",
    "speaker" : "Brian Morrey",
    "timestamp" : "01:02-01:23"
  },
  {
    "text" : "Yeah. And you're also doing the um Pats from the Past podcast too, correct?",
    "timestamp" : "01:23-01:28",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:28-01:36",
    "speaker" : "Brian Morrey",
    "text" : "That's correct. Which is uh something we enjoy doing and talking to a lot of alumni about their careers and Yeah, just kind of reminiscing a little bit."
  },
  {
    "text" : "Yeah. For those that haven't listened to it, I highly recommend it. It's uh it's the top of my my playlist whenever it comes out. It's uh There's some great stories that that you wouldn't expect to hear from here. Yeah. Uh I actually enjoyed the the one about Andre Andre Tippett. And uh Just kind of like how he was a little a little salty about his his time with the Patriots. I was surprised about that. Because that was kind of my first ever real Uh like first name I recognize on the Patriots, you know, growing up.",
    "timestamp" : "01:37-02:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "Well, and there was a lot of guys, you know, that you talk to, you know, uh I'll give you a quick story and I probably shouldn't share it But uh these are the best.",
    "timestamp" : "02:10-02:18"
  },
  {
    "timestamp" : "02:18-02:19",
    "speaker" : "Andy",
    "text" : "Yeah, good start."
  },
  {
    "text" : "When we brought when we brought uh we you know a lot of the Hall of Famers will come back from induct for induction. And uh so in two thousand nine when uh Robert Kraft decided to induct Billy Sullivan On the in the fiftieth anniversary season for the team, obviously the original owner and the founder of the of the Patriots, uh uh John Hannah said to me, You know, whatever you do, don't sit me anywhere near the Sullivan family",
    "timestamp" : "02:21-02:47",
    "speaker" : "Brian Morrey"
  },
  {
    "timestamp" : "02:48-02:50",
    "text" : "Because he was bad blood there.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "02:51-03:23",
    "speaker" : "Brian Morrey",
    "text" : "He well he was salty. I mean that that I'm not sure he ever got o got over his holdout and I think seventy seven maybe it was. where um, you know, him and Leon Gray both held out on the left side of the offensive line there and I think he just felt like you know, they the Sullivan's weren't committing financially to the success of the team and so he uh he was a bit salty about that and you know if you know John he doesn't necessarily hide his opinions so So he said that. I was like, okay, John, whatever."
  },
  {
    "speaker" : "Steve",
    "text" : "How long you been the director of the Hall of Fame?",
    "timestamp" : "03:26-03:28"
  },
  {
    "speaker" : "Brian Morrey",
    "timestamp" : "03:29-04:07",
    "text" : "Uh since since it opened in 2008, I actually went back so I was at the Patriots from nineteen ninety-seven to two thousand five, uh covering the team as the editor of Patriots Football Weekly Yeah. And then left in two thousand five and went down to work at uh the score in Providence. I I co-hosted an afternoon drive talk show with Scott Cordici down in Providence from three to seven on weekdays. And then when the when the whole thing was under construction, uh I went back to the Patriots in December of two thousand seven and help finish the exhibit development and uh and get the building opened and uh then every hint."
  },
  {
    "text" : "So you're in charge of kind of like designing all the exhibits and things like that and putting those together?",
    "speaker" : "Andy",
    "timestamp" : "04:07-04:13"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "Yeah, I mean we have a great group that does that and and thankfully the craft's very committed to it, um, you know, in in terms of uh the fan experience and really staying committed to uh to making sure that the Hall of Fame stays updated. You know, we've probably spent, you know, since two thousand since winning the Super Bowl against Seattle in two thousand fourteen you know, they've probably spent close to three million dollars renovating the building. So you know, they're really committed to making sure that the fans are getting their a great experience there. And and to be honest with you, I think when we opened our Super Bowl gallery was just okay. And the impetus to really change that was the the win over Seattle, the way that game finished with Malcolm Butler. And it really made us pause and think and and make some changes. We actually gutted uh the the gallery and the gallery in front of it, which was called the fan zone. and we we really expanded the Super Bowl exhibit. And then of course when the when the Falcon Super Bowl happened You know, we had to do something special for that and so we actually built floor out over the pro shop and expanded the exhibit even further. Uh and then we had that ho home win against the Rams, so that was easy.",
    "timestamp" : "04:14-05:30"
  },
  {
    "timestamp" : "05:32-05:36",
    "speaker" : "Andy",
    "text" : "So they're actually making your job harder every time they win a Super Bowl, is what you're saying."
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "Well yeah, they uh you know what though? It it it's invigorating. I I truly love it. I mean I love the When we get to do something new like that, that that really, you know, kinda gets me going. Uh and you get motivated to do that stuff. Um so, you know, if they want to keep adding trophies, we'll figure out where to put 'em.",
    "timestamp" : "05:36-05:53"
  },
  {
    "text" : "I know. How does somebody get into a job like that? Because did you have any experience in this sort of thing?",
    "timestamp" : "05:57-06:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Brian Morrey",
    "timestamp" : "06:04-07:29",
    "text" : "I I had none and I made that very clear in fact when I had you asked 'cause so when I was they had reached out to me about coming back and they didn't really have the role defined yet Um, but they knew that, you know, they knew me, I knew them, I knew the culture. So I think so when I sat with Jonathan Kraft Before I decide to accept the position, I said to him, you know I have no idea what I'm doing, right? And he says and he said to me, you'll learn. And that to me was kind of that was kind of exciting that he had that faith in me knowing I had never run a museum and didn't really know that business and then I would learn it. And you know, maybe some would argue whether I have or not, but um you know, I I I I actually went out and bought books on how to run a museum and I read 'em. And I just dove in and you know, the exhibit part of it was easy for me 'cause that's just the storytelling But it was all the other things that go into operating a museum and I'm still learning. You know, there's still things that come up uh from year to year that I learn. But you know, the exhibit part, the storytelling part, that that's still very exciting for me and and and the other stuff was a great challenge that I hope I've learned. And uh I think, you know, we've run a pretty good venue for the last twelve years. So it's been it's been great. I've loved it."
  },
  {
    "timestamp" : "07:30-07:41",
    "speaker" : "Steve",
    "text" : "For all our listeners or like all three of them or whatever Uh uh for mom. Uh what is the uh like ticket price? Like when you guys open, like what's the availability for a beautiful coverage?"
  },
  {
    "speaker" : "Brian Morrey",
    "timestamp" : "07:43-08:22",
    "text" : "We haven't been open since March fifteenth, but typic typically in a non COVID situation, uh, we're open um seven days a week Uh we're open Monday through Friday 10 to 5, Saturday 10 to 9, and Sunday 10 to 7. We are looking at reopening very soon. Um you know, depending on when this is aired, but I mean so yeah, we we should be open in September. Oh okay. But we're gonna be limit our our hours will be limited, I think. Right. You know it'll maybe just be just weekends to start off."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that makes sense. See how it goes and then go from there.",
    "timestamp" : "08:22-08:25"
  },
  {
    "timestamp" : "08:25-08:33",
    "speaker" : "Steve",
    "text" : "So let's address the question on all of our minds. Um Troy Brown is as awesome as we all think he is, right?"
  },
  {
    "text" : "Yeah, we're a very pro-Troy Brown uh podcast.",
    "timestamp" : "08:34-08:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "Okay, so so that's a great question. So What I will tell you on that is that when I was covering the team, people would ask me my favorite player. And I would say, I'd have to say Troy Brown Because I was talking to Troy one day and he made this comment to me that has always stuck with me. He said, I come in every day and just make sure my stuff is still in my locker Meaning he never took one day in the NSL for granted. He came in every day trying to prove that he belonged And I thought that was a great message and something that's always stuck with me and something that I try to keep as far as my mentality goes that, hey, nothing is guaranteed, nothing is promised to us You know, come in and justify your job every day that you come in. And that's what he did. Fantastic.",
    "timestamp" : "08:37-09:30"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:30-09:49",
    "text" : "I love it. Yeah. The more I mean we we were Troy Brown fans growing up because our last name is Brown, so it fit and you know he was the Troy Brown you see on on TV. He was that that prototypical patriot. Um but the more we hear about 'em, the happier I am with that decision."
  },
  {
    "timestamp" : "09:50-10:02",
    "speaker" : "Brian Morrey",
    "text" : "In fact, in fact at the top of the show I heard you talk about the the Bill two thousand two visit Did July oh no that wasn't the game, it was two thousand four where he intercepted Drew. Yes."
  },
  {
    "text" : "Yes. Yeah, well we'll get to that. But he was always just that guy who when you needed a play, he's the one that'll get it for you.",
    "speaker" : "Andy",
    "timestamp" : "10:02-10:12"
  },
  {
    "timestamp" : "10:12-10:22",
    "speaker" : "Brian Morrey",
    "text" : "Absolutely. And there's a n there's a few guys like that. You know, the old clique was, if you need eight, he gets you nine. If you need three, he gets you four. Kevin Falk would be another guy in that category."
  },
  {
    "speaker" : "Andy",
    "text" : "Agreed.",
    "timestamp" : "10:22-10:22"
  },
  {
    "text" : "You know, guys that just I mean, before I was even covered the team, I still remember vividly the play he made in nineteen ninety six lying on his back against the Giants in week in the final week of the season when they clinched uh when they clinched the division in a in a bye in the playoffs. Yeah on a it was a third long play and he was literally lying on his back when he caught the ball.",
    "speaker" : "Brian Morrey",
    "timestamp" : "10:23-10:44"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "10:44-10:51",
    "text" : "I don't remember this play I'm Googling at right now. Finally found someone who knows more about Troy Brown than I do."
  },
  {
    "timestamp" : "10:52-10:58",
    "speaker" : "Brian Morrey",
    "text" : "Jesus. And of course you got the play in two thousand and one in the Super Bowl that put them in field goal range."
  },
  {
    "timestamp" : "10:57-10:58",
    "speaker" : "Andy",
    "text" : "Yep."
  },
  {
    "text" : "Sixty-four max all in was the play call on that. Max max protection. Everyone running ink.",
    "speaker" : "Brian Morrey",
    "timestamp" : "11:00-11:07"
  },
  {
    "text" : "That's amazing. And of course you have the uh the 2001 AMC Championship game two where he has a wherewithal to scoop up the the block kick and lateral it. So that it goes for a touchdown instead of just a a big game at the end of the half there.",
    "speaker" : "Andy",
    "timestamp" : "11:08-11:23"
  },
  {
    "text" : "I really like this direction this interview is taking just talking about how awesome Troy Brown is.",
    "speaker" : "Steve",
    "timestamp" : "11:23-11:28"
  },
  {
    "timestamp" : "11:29-11:53",
    "speaker" : "Brian Morrey",
    "text" : "Right. Well the funny story button for touchdown that games I don't know if you guys how well you guys remember this, but they they punted the ball. And he didn't feel it and it bounced, took a big Steelers bounce, it ended up being like a sixty yard punt and the Steelers were penalized on the play. W I can't remember exactly for what size or something. And when they respotted the ball, they spotted it on the wrong hash mark."
  },
  {
    "timestamp" : "11:54-11:54",
    "text" : "Yes.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "On the re-kick. And so while he was trying to angle the kick, he didn't get it on the right angle. Troy caught it and took it back to the house And of course, you know, making guys run down the field two times in rope and punch coverage is always challenging. I think if I'm not mistaken, uh Gerard Cherry uh was like the vice guy on the punt and he I think he him I think he blocked their gunner all the way back into the end zone.",
    "timestamp" : "11:54-12:18"
  },
  {
    "text" : "Yeah. And that was the guy that committed the penalty too.",
    "timestamp" : "12:19-12:21",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, he ran out of bounds and then he was back in immediately. And that's what the penalty was.",
    "timestamp" : "12:21-12:25",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. Oh we did you have we watched it recently? Yes. We just did two thousand one a couple of weeks ago.",
    "timestamp" : "12:25-12:34",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "Well I think the first receiver that season never catch a hundred passes in the season.",
    "timestamp" : "12:35-12:40"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:39-12:41",
    "text" : "Yep, he sure was."
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "And when he took an old big Pro Bowl.",
    "timestamp" : "12:41-12:43"
  },
  {
    "timestamp" : "12:43-12:51",
    "speaker" : "Andy",
    "text" : "And uh he he didn't go to the Pro Bowl that year, did he? He was Oh was he an alternate?"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "Yep.",
    "timestamp" : "12:51-12:52"
  },
  {
    "timestamp" : "12:52-12:54",
    "speaker" : "Steve",
    "text" : "He ended up going. That's his only one."
  },
  {
    "timestamp" : "12:54-13:02",
    "speaker" : "Brian Morrey",
    "text" : "Oh he went. I remember the picture of the the Tobo guys at the Super Bowl 'Cause they left right to the Super Bowl to go to Hawaii."
  },
  {
    "timestamp" : "13:02-13:22",
    "speaker" : "Andy",
    "text" : "Right, right. Yeah, that was a whirlwind that year. Pretty exciting. Yeah, I remember his I think we talked about it. His uh his first cat his his a hundredth catch actually got overturned. 'Cause it it hit the ground or something, rebobbled it. And so he had to go and do it again to get the hundredth catch after made a big deal of it. Yeah."
  },
  {
    "speaker" : "Brian Morrey",
    "timestamp" : "13:23-13:25",
    "text" : "If memory serves it's it's with a hundred and one."
  },
  {
    "text" : "Yeah, probably. One of the two. Oh yeah. And then it looked like a punt return from there. Just making guys look really, really ugly.",
    "timestamp" : "13:26-13:38",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "13:38-13:46",
    "speaker" : "Brian Morrey",
    "text" : "Although I believe he did catch the pass from David Patton at Indianapolis. David Patton threw for a touchdown, ran for a touchdown and caught a touchdown."
  },
  {
    "timestamp" : "13:46-13:53",
    "text" : "Yep, that was him. Oh but I I like how this is just turning into the Troy Brown happy hour. This is it yeah, this is perfect.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "13:55-13:58",
    "text" : "Uh, he caught the touchdown pass of Adam Vegetarian, St. Louis.",
    "speaker" : "Brian Morrey"
  },
  {
    "text" : "He did, yep, on the fake uh fake extra point or something? I don't remember what it was.",
    "timestamp" : "13:59-14:04",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "Yeah, fake field goal. I think that was oh four because I think it that was also the game. T-Wayne started playing defensive back.",
    "timestamp" : "14:04-14:10"
  },
  {
    "text" : "Yeah, I'm sitting here watching a Troy Brown highlight video and they just showed that stripper Marlon McCree.",
    "speaker" : "Steve",
    "timestamp" : "14:11-14:16"
  },
  {
    "timestamp" : "14:16-14:18",
    "speaker" : "Andy",
    "text" : "Oh what is that? How do we forget that?"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "Huge fight. Without that fight it was Yeah. Well we wouldn't have had to endure the final minute loss in Indianapolis, but",
    "timestamp" : "14:20-14:29"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, we don't talk about that. Well, we will eventually, but we won't enjoy it, I'm pretty sure. Maybe we'll just watch the first half of that game. Yeah, skip it",
    "timestamp" : "14:30-14:39"
  },
  {
    "timestamp" : "14:40-14:42",
    "speaker" : "Brian Morrey",
    "text" : "Twenty one to three at the break."
  },
  {
    "text" : "Yeah. Very good. Yeah, and then we'll just yeah, we'll we'll pretend like that was the Super Bowl and",
    "speaker" : "Andy",
    "timestamp" : "14:42-14:47"
  },
  {
    "text" : "That's right, because we would have wanted that here too.",
    "timestamp" : "14:48-14:51",
    "speaker" : "Brian Morrey"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that was yeah, that was the Super Bowl that game, because either team was gonna beat the Bears. Yeah Absolutely. Um all right, I w yeah I want to talk a little bit about your podcast. Um My first question is uh when you had Ty Law on, did he let you keep the ball of he brought?",
    "timestamp" : "14:51-15:12"
  },
  {
    "text" : "He did it. In fact, he was fine on something.",
    "speaker" : "Brian Morrey",
    "timestamp" : "15:12-15:16"
  },
  {
    "text" : "Oh yeah, we can hear that part. I just didn't know if we got to keep it.",
    "speaker" : "Andy",
    "timestamp" : "15:16-15:20"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "But yes, he gave me a battle, yes. Very good by the way.",
    "timestamp" : "15:22-15:24"
  },
  {
    "text" : "All right. Yeah, we've uh we did a um uh in in the two thousand one AFC Championship game we did uh uh Drew Bledsoe. celebration so we bought his wine and drank that for her.",
    "speaker" : "Andy",
    "timestamp" : "15:25-15:37"
  },
  {
    "text" : "Oh nice.",
    "speaker" : "Brian Morrey",
    "timestamp" : "15:38-15:38"
  },
  {
    "timestamp" : "15:41-15:43",
    "speaker" : "Andy",
    "text" : "Yeah I was only they could find it actually because I'm the only one that's still"
  },
  {
    "timestamp" : "15:48-15:57",
    "speaker" : "Brian Morrey",
    "text" : "When we brought the 2001 team back for its fifteenth anniversary, uh he supplied the wine at the event, so it was nice. Oh man. He and David Hewitt, who also has his own wine."
  },
  {
    "timestamp" : "15:58-16:00",
    "text" : "David Hewitt has his own wine.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "16:00-16:01",
    "speaker" : "Brian Morrey"
  },
  {
    "speaker" : "Andy",
    "text" : "Add it to the list, boys. We're gonna have another Damon Hewitt episode.",
    "timestamp" : "16:01-16:04"
  },
  {
    "text" : "The Damon Hewitt appreciation. Is it the real Damon Hewitt or is it like Josh McDaniel? Did you know that Bledsoe's business partner is Josh McDaniels? But it's not the it's not the Josh. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "16:04-16:17"
  },
  {
    "text" : "Yeah, the Patriots offensive coordinator is Josh McGaniels, but it's not C, Josh McDaniels.",
    "timestamp" : "16:22-16:27",
    "speaker" : "Brian Morrey"
  },
  {
    "speaker" : "Andy",
    "text" : "It's a different one. That's awesome. We should do a tie law. Yeah, I think we absolutely should do a tie law episode where we drink his vodka, but I think that might get a little",
    "timestamp" : "16:30-16:43"
  },
  {
    "text" : "Messier than wine up. Or had a painting.",
    "speaker" : "Brian Morrey",
    "timestamp" : "16:44-16:47"
  },
  {
    "text" : "And then we go to his his trampoline park after.",
    "speaker" : "Greg",
    "timestamp" : "16:48-16:51"
  },
  {
    "text" : "Oh that's he sold those Oh we did? So now it has to get into the V1 business.",
    "speaker" : "Brian Morrey",
    "timestamp" : "16:51-16:58"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "16:58-17:03",
    "text" : "Oh tough. That's good because that was broken combo."
  },
  {
    "timestamp" : "17:03-17:08",
    "speaker" : "Steve",
    "text" : "Broken ankle went to happen anyway. Or at least throw it up, did someone's chief good."
  },
  {
    "text" : "But didn't uh wasn't there a a sport that they had back in the day where it was trampoline basketball? Slam ball, that's right. Yeah, that show is sweet.",
    "timestamp" : "17:08-17:15",
    "speaker" : "Andy"
  },
  {
    "text" : "Well you know you know who was good when we did you know who told a funny story. I don't know if you heard the Lawyer Malloy podcast.",
    "speaker" : "Brian Morrey",
    "timestamp" : "17:15-17:21"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah.",
    "timestamp" : "17:21-17:21"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "But if you've heard the story about when he went to the Super Bowl in St. Louis I mean in New Orleans against the Rams in Super Bowl thirty six, when he gets to his hotel room he's got this really small hotel room. And Richard Seymour comes by and he's like, oh man, you should see my hotel room. I got this great big room. It's awesome. And Laura Malloy was like What is what what are you talking about? The rookie got a better room than I did? Yeah. So he goes down the bill And he goes, Coach, uh, you know, I don't I don't wanna sound like ungrateful or like I'm not focused or anything, but you know, my hotel room sucks. And Bill was like, Really, Lawyer? That's what you're worried about? So Lawyer was like, you know what? Yeah, you're right, coach, I'm sorry. And he walks away. So later on, Bill's assistant goes up to him, Bill's assistant bears goes up to him and says, hey, here's the key to your new room. So so lawyers like, oh, awesome. Thanks He goes up to the room and he goes in the room and and there's a treadmill in the room. And he's like, Oh, I got this awesome room And uh co so coach sees him later in the day and he goes, How do you like your new room? He's like, Oh coach, thanks so much. It's awesome He goes, Well I I don't know why, but they put a treadmill in my room And and Bill goes Yeah, because it was my room. Bill gave him his room. Oh crap. He walked away. He's like, oh, thanks, coach.",
    "timestamp" : "17:21-18:53"
  },
  {
    "text" : "Yeah, what do you say to that? Did Bill stay in his room, in the other room?",
    "timestamp" : "18:54-18:59",
    "speaker" : "Steve"
  },
  {
    "text" : "I think I think so.",
    "speaker" : "Brian Morrey",
    "timestamp" : "18:59-19:01"
  },
  {
    "timestamp" : "19:02-19:08",
    "speaker" : "Andy",
    "text" : "I mean that makes sense. It only created the best defensive game plan in the history of the league that night."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:10-19:12",
    "text" : "From Laura Mulloy's craft room."
  },
  {
    "text" : "Yeah. I wonder if we can get that room, if we can go down to Yeah, book the hotel room.",
    "timestamp" : "19:12-19:17",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "19:17-19:19",
    "text" : "It was the Fairmont Hotel.",
    "speaker" : "Brian Morrey"
  },
  {
    "text" : "See? There we go. Let's find out what room it was. We could probably afford the cheap room. The small one.",
    "timestamp" : "19:20-19:26",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "But we traveled so I traveled with the team and back then We would stay on you know, as a writer for Patrick's Football Weekly, we would stay on the floor with the players. Like there was no separation. So like Ty Locke could have been sleeping in the room next door to me. Now that doesn't happen. A couple of years later they'll they'll change that whole thing and we got put separate floors and the players have their own floors but but that that Super Bowl I shared the same floor with a bunch of the players so you'd walk out of your room and there would be Ty and Laura walking down the hall.",
    "timestamp" : "19:27-19:59"
  },
  {
    "speaker" : "Andy",
    "text" : "That is so cool.",
    "timestamp" : "20:01-20:02"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "But not anymore. But the best part about that was when you get off the elevator there'd be tubs with drinks and stuff and snacks and drinks at right on your floor, which was pretty cool. You get spoiled.",
    "timestamp" : "20:03-20:13"
  },
  {
    "timestamp" : "20:13-20:18",
    "speaker" : "Andy",
    "text" : "Yeah, free shit. Yeah. I mean, it's a Super Bowl, right? Gonna go all out."
  },
  {
    "timestamp" : "20:21-20:24",
    "speaker" : "Steve",
    "text" : "It's only $121. Let's go."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:24-20:31",
    "text" : "Oh, alright. Yeah, we'll ask for the we'll ask for the lawyer Malloy. Thanks, Cole. Yeah."
  },
  {
    "text" : "Yeah, there isn't it it didn't get New Orleans as fast as further towards Texas, I think that really took the brunt of that. Yeah. Lake Charles, I think it was.",
    "timestamp" : "20:34-20:44",
    "speaker" : "Brian Morrey"
  },
  {
    "timestamp" : "20:44-20:49",
    "speaker" : "Andy",
    "text" : "Yeah, it sounds familiar. All right. Um did you boys have any questions you want to ask Brian?"
  },
  {
    "speaker" : "Steve",
    "text" : "I've got I have one, but I'll save it for the end here. Because we don't know what I'm gonna ask.",
    "timestamp" : "20:49-20:53"
  },
  {
    "text" : "It's true. I I I got a question. How how does the how does the decision making how are how are the decisions made and who gets into the the hall of fame? For the Patriots specifically?",
    "timestamp" : "20:55-21:08",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Brian Morrey",
    "timestamp" : "21:08-23:37",
    "text" : "Yeah, that's that that's a really big question. So every year in about April, a lot of media people that have covered the team in focus occasionally there's Andre Kippet is on it. Occasionally there's another Hall of Famer who might invel invite Steve Nelson or Steve Grogan just to get some of that perspective from players who played you know, back in the seventies and eighties. Um, and then, you know, media members, a couple of staff, it was Fred Kirsch, who ha who's the Vice President of Content for the Patriots. Paul Perillo covers the team for Patriots Football Weekly still. Matt Smith from the from our production studio. Guys that have been around for quite a while. So that committee meets and Anyone can nominate a player who has been retired for at least four years. Um, so or coach for that matter, head coach So you s so if I want to nominate a player, I will stand up. I'll say I'd like to nominate Laura Malloy. Might give a couple reasons why, but we really we go through a nomination process And then we go through each nominee and discuss or debate their merits. So, you know, those conversations pretty much stay in the room. Um, because you know, there's reporters in the room obviously, but we like to keep it private so people can speak their mind on on either for or against a player or coach. Um, you know, people can report on their own opinions all they want and just not really reporting on other people's opinions. Um so once we go through the whole nomination process, discuss the nominees. Everybody's given a ballot and you can vote for your top three choices, five points for first place, three points for second place, one point for third place, and the top three vote getters become our finalists and they go on patriots. com for the fans to vote and determine who that years in Dun B will be. We also have a senior selection committee. So every It's kind of sporadic, maybe every three years, could be longer, could be could be quicker, but the Senior Selection Committee, uh which is made up of the ten most senior members of that year's committee. Uh can meet and decide if there's a player who has been retired for twenty-five or more years and has been a previous finalist but not selected by the fans. The senior selection committee can in can can vote that person in with eight out of ten votes."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "23:38-23:38",
    "text" : "Cool."
  },
  {
    "timestamp" : "23:38-24:41",
    "speaker" : "Brian Morrey",
    "text" : "So it's a pretty rigorous process at that point. You know, it's it's really to make up it it really came out of uh of John Morris not being elected by the fans. John Morris was the first player that the committee voted number one that the fans didn't and it happened like two to three years in a row. And so we decided that there needs to be a mechanism in place Because John Morris was a sev a center in the sixties and seventies and there's gonna be a lot of fans that don't remember him. You know, it's not like he was catching touchdown passes, you know. So so we put the system into place where the senior committee 'Cause if if a player had been elected a finalist by the committee and was retired for twenty five or more years and got eight of ten votes from the senior committee, that they would be inducted. So there's been John Morris Uh Houston Antoine and who did we just do? Um a couple years ago. Uh Leon Gray has other three players that have been inducted by the senior committee."
  },
  {
    "timestamp" : "24:42-24:48",
    "text" : "That's really cool. Interesting. Can you can you nominate as many people as you want in that like first nomination?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "You could. Yeah.",
    "timestamp" : "24:49-24:50"
  },
  {
    "speaker" : "Steve",
    "text" : "How many typically are like raised?",
    "timestamp" : "24:51-24:53"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "Uh there's usually probably a dozen or so.",
    "timestamp" : "24:54-24:57"
  },
  {
    "text" : "And then like You you gotta think that there's like a glut of Hall of Patriots, Hall of Famers coming up ish, right?",
    "timestamp" : "24:58-25:05",
    "speaker" : "Steve"
  },
  {
    "text" : "Well and and so yes and so there you know, you you run into this situation where our players from you know, earlier errors gonna be not gonna have a less of a chance and and frankly, yeah. Yeah. I mean they are, but But you know, the guys who especially the guys who are part of multiple Super Bowl teams and were major contributors on those teams, well, you know, they're probably in in many cases, and not all cases, but in many cases, more worthy anyway. So, you know, it it kinda fits the bill. You know, I I look at Pro Football Hall of Famers and how long it took Andre Tippett to get in. Right. And Andre Tippett, you know, if it wasn't for Lawrence Taylor in that era, he's the best linebacker out there. And so but the Patriots weren't very good for a lot of those years, or certainly weren't competing for championships. You know, they were competitive a number of times, but they weren't a perennial playoff team. They didn't really compete for championship consistently and I think that hurt Henry. Conversely the guys who won championships here, I think that you know, that that's a feather in their cap and And is it the end all be all no, but I think that it's a it's a piece of the puzzle. If you're a if you're a solid contributor or a above average player on a on championship teams, I think that matters",
    "timestamp" : "25:06-26:24",
    "speaker" : "Brian Morrey"
  },
  {
    "timestamp" : "26:24-26:28",
    "speaker" : "Greg",
    "text" : "Yeah. So speaking of piece of the puzzle."
  },
  {
    "timestamp" : "26:30-26:34",
    "speaker" : "Brian Morrey",
    "text" : "And by the way, I'm just a member of the committee, so I have no say in who gets elec inducted."
  },
  {
    "timestamp" : "26:37-26:51",
    "speaker" : "Greg",
    "text" : "So there's been a lot of discussion in like the Pro Football Hall of Fame and other Hall of Fames of like how do you evaluate off the field stuff? Is that something that comes into those conversations when you're doing it? Good question."
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "Um, I I you know, uh we haven't had a lot of guys where I think that's been an issue, uh, whose name has come up I mean I could tell you that I think Rodney Harrison was hurt for a couple of years by his suspension. Hmm. When he got suspended So I think that hurt him, but eventually, you know, I think the the committee came around on that. Um, you know, there are people there are still some people in the room that were big advocates for what he did. um on the field and the impact that he made and the impact he made inside the locker room. I think, you know, when push came to shove, that kind of rose to the top But that's the only time I can think of an issue that we've had with an obstacle of the field and things.",
    "timestamp" : "26:51-27:40"
  },
  {
    "timestamp" : "27:41-27:43",
    "speaker" : "Andy",
    "text" : "Bill Parcells almost ca in terms of like"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "Well Bill Parcel has been a finalist. Bill Parcel has been a finalist three or four times now.",
    "timestamp" : "27:44-27:49"
  },
  {
    "timestamp" : "27:49-27:51",
    "speaker" : "Steve",
    "text" : "I'm a hard no"
  },
  {
    "timestamp" : "27:51-27:58",
    "speaker" : "Andy",
    "text" : "Yeah, I th I think there's a lot of uh divisiveness around uh between fans about whether or not to have him in."
  },
  {
    "text" : "Well like Remember? I used to hate Curtis Martin and then I shifted all my hate from Curtis Martin to Bill Parcells. Right.",
    "timestamp" : "27:58-28:04",
    "speaker" : "Steve"
  },
  {
    "text" : "And I think you're not alone in that.",
    "timestamp" : "28:05-28:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "28:06-28:13",
    "text" : "I could make I could make it's one of those things where if I was on a debate team I could argue either side on the Parcells thing.",
    "speaker" : "Brian Morrey"
  },
  {
    "timestamp" : "28:13-28:13",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Brian Morrey",
    "timestamp" : "28:13-28:36",
    "text" : "And so I'll give you my opinion in that, you know, I think the big argument I and I obviously read this every year, whether it's the you know, everybody at the Boston Globe writing it or whatever, right? Shaughnessy this year. Okay. I think Shaughnessy wrote this year, there's no Patriots Hall of Fame without Bill Parsels in it. Which you know, I obviously I respect him, but I don't I certainly don't agree with him on that."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, you respect him?",
    "timestamp" : "28:36-28:37"
  },
  {
    "timestamp" : "28:40-31:16",
    "speaker" : "Brian Morrey",
    "text" : "Well, that's besides the point. But so so what I will say is about Coach Parcells is the big argument that I hear people make is that She brought instant credibility to the Patriots. Right. Okay? In a time where they had none. And there's no I don't that's not debatable, right? That's true. But I always argue that credibility because he had two Super Bowl rings on his won those with the Giants. I put them in the That doesn't put him in the Patriots all thing just because he had credibility. Now, his record his record in four years was 32 and 32. But I throw out the first year. In the first year he was remaking that team, changing the culture, which he did. He changed the culture. Okay And then, you know, if you look at the players he drafted that that continued to make impacts after he was gone, you got Bledsoe, Troy Brown, Chris Slave, Willie McGuinness Curtis Martin, Ted Johnson, Kennedy Brudsky, Lawyer Malloy, Terry Glenn. Although you can't really give him credit for Terry Glenn, so I take that roll. Um But but you know, so so there are a number of guys that he drafted And he changed the culture for sure. Now, throughout the first year, the second year they're three and six. They run off seven in a row and make the playoffs Yeah. You know that was the year it's the the seven game winning streak that started with Bledsoe's forty five of seventy game in Foxborough against the Vikings, twenty six twenty overtime win. Okay, so then they win seven in a row, they finish with beating Chicago and they play actually Cleveland uh Bill Belichick's Cleveland Browns in the wild card game and they lose They come back in ninety-five with some higher expectations and they go six and ten. Bledsoe separates his non-throwing shoulder during the season. Parcells plays him through it, he struggles, and they go six and ten. During that season, you know, Parcells didn't do a uh didn't do his press conference after the game in Kansas City Said he was dehydrated, comes home from that game and asks for the final year off his contract. His people reach out to the owners to the craft, ask for the final year off his contract So they give it to him and putting in the stipulation into his contract that he can't coach anywhere else in nineteen ninety seven. So um so they go through the ninety-five season and they get to the draft Now he wants to draft, I think it was a defensive lineman from Clemson, and Bobby Greer wanted to draft Terry Glenn."
  },
  {
    "text" : "Right",
    "speaker" : "Greg",
    "timestamp" : "31:16-31:16"
  },
  {
    "text" : "So Robert has to step in and make a decision. Do I go with my head coach or my personnel guy? Well my head coach is in the final year of his contract and has for the ninety seven year to be eliminated from his contract. My personnel guy is in it for the long haul.",
    "timestamp" : "31:17-31:34",
    "speaker" : "Brian Morrey"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "31:34-31:34"
  },
  {
    "speaker" : "Brian Morrey",
    "timestamp" : "31:34-31:47",
    "text" : "So he goes with Bobby. Rightly or wrong, but he decides he goes with Bobby, they draft Terry Glenn And which leads to the if they want you to cook the meal, then they should at least let you shop for the groceries."
  },
  {
    "text" : "Buy the groceries.",
    "timestamp" : "31:47-31:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "31:50-31:53",
    "text" : "So, you know, I didn't know he'd already asked for the last year out of his contract.",
    "speaker" : "Brian Morrey"
  },
  {
    "text" : "That's crazy. I didn't know that either, yeah.",
    "timestamp" : "31:53-31:55",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "31:55-35:03",
    "text" : "Yeah. And and then, you know, during the ninety six Super Bowl season, his house was to sale. So, you know, I mean I think that there's a lot of things that enter into the frame. And so the supporters of his Hall of Fame candidacy Sites first of all, I think the media supports him more so than the fan base as a whole. And I think the media enjoyed covering him. You know, he's he's a very charismatic guy. I never covered him by the way. I started covering the team right after he left. But so I don't have any personal experiences with him So those guys, I think all the media, he filled their notebooks, he gave them great quotes, he was good T V. They all like him. They all enjoy covering him. So I think that that's a part of it. Um And he definitely, you know, he definitely had a major impact. Now, people talk about the guys he drafted that were part of the Super Bowl teams in the early two thousands, and that's true. However They also don't bring up the fact that after he left with those guys, ten and six, nine and seven, eight and eight, five and eleven And it wasn't until 2001 when Coach Belichick brought in a lot of good veteran leader guys, Roman Pfeiffer, Brian Cox, Anthony Pleasant. Otis Smith. You know, a number of guys that were Mike Vrabel. Okay. Um that w David Patton. These guys that were veteran guys that really added some character to the locker room because and and and listen I'm not taking anything away from those Parcell's draft picks. They were all tremendous, but weren't I don't think they were ready to step into leadership roles when Parcell's left. Okay, and so they really evolved and I think that bringing in those character guys into the locker room was helpful. Even the guy like Brian Cock D didn't have a great reputation, you know. Had his incidents and um but Billy coached I'll never forget in two thousand one, you know, week two And they were playing the Colts in week three, Brady's first start, and the Colts had scored eighty-five points or something in the first two games and the Patriots had struggled to 0-2 And nobody gave the Patriots a chance. And Brian Cox stood in front of his locker that week and he basically said, well, I won't quote him He said Peyton I'll quote some of him, he said, Peyton Manning puts his pants on just like I put my pants on. And I'm not the kind of guy to Blank another man's blank. Okay? And and and he said one week in this league has nothing to do with the next. And they went out and won forty-four to thirteen. You know, um Brady Brady didn't have huge numbers, but Antoine Smith rushed for ninety something yards. Uh they had a couple interceptions for touchdowns. Ty Lon had one, Otis Smith had one",
    "speaker" : "Brian Morrey"
  },
  {
    "text" : "Um and didn't Brian Cox set the tone in that game with a hit on whoever that wide receiver was? He laid out one of the Colts wide receivers early.",
    "speaker" : "Andy",
    "timestamp" : "35:03-35:14"
  },
  {
    "text" : "Um drawn Python. Yeah. Let's look through my notes.",
    "speaker" : "Steve",
    "timestamp" : "35:20-35:24"
  },
  {
    "timestamp" : "35:27-35:31",
    "text" : "See we're losing you a bit there, Brandon.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:32-35:39",
    "text" : "Yeah. That's what I said but slower."
  },
  {
    "text" : "You still there, Brian? You guys got me?",
    "speaker" : "Andy",
    "timestamp" : "35:40-35:42"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "35:42-35:43"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:43-35:50",
    "text" : "Oh yeah, we got you back now, yeah. We lost you there for a second. Yeah, that's a whole lot better."
  },
  {
    "timestamp" : "35:50-35:52",
    "speaker" : "Greg",
    "text" : "Yeah, you sound great. Did I lose ya? No."
  },
  {
    "speaker" : "Andy",
    "text" : "No, well we lost you for a second. I can still see ya. Yeah, no, you're back. Can you hear us? No. No, you can't. We got you. Thumbs up. Yeah, still there. I can see you, I just can't hear ya. Oh oh really? Uh turn the volume up. Hello? Hey! All right, we can hear you. But we you can't hear us. Oh I gotcha.",
    "timestamp" : "35:53-36:22"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "You got me?",
    "timestamp" : "36:23-36:23"
  },
  {
    "text" : "Yeah, we got ya.",
    "timestamp" : "36:24-36:25",
    "speaker" : "Andy"
  },
  {
    "text" : "Alright, sorry about that. It was Jerome Pathound. Yeah. And you know, but those guys really kind of carried the torch a little bit that season and brought you know Roman Pfeiffer. I mean you couldn't have a better guy in the locker room than Roman Pfeiffer. And when you added those guys to the Troy Browns and the Teddy Brewski's and the Ted Johnson's that were already in the room I think that that made all the difference in the world. And then, you know, getting everybody to buy into the whole team concept and and get leave the egos at the door. you know, made a big difference as well. So, you know, I I I just think that when you talk about Coach Parcells, yes, those guys made an impact. But it it it it it was later on and took some time. It wasn't like when Coach Parcell left, you know, that culture change didn't stay. Pete Carroll brought his own culture in.",
    "speaker" : "Brian Morrey",
    "timestamp" : "36:25-37:20"
  },
  {
    "timestamp" : "37:20-37:21",
    "text" : "Right",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "And so, and at that time it didn't work, and that was a there was a number of reasons for that. But so You know, I I think that people that say Coach Parcell's in our Hall of Fame is a no-brainer, I don't agree with that. I think it's a great debate. I think it would be a great induction ceremony, don't get me wrong.",
    "timestamp" : "37:21-37:39"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, that speech would be great.",
    "timestamp" : "37:39-37:41"
  },
  {
    "timestamp" : "37:42-37:47",
    "speaker" : "Brian Morrey",
    "text" : "But and and I'm not I'm not trying to take anything away from the guy. He's a pro football hall of famer, hands down."
  },
  {
    "timestamp" : "37:47-37:51",
    "text" : "Yeah. Yes. I'll give him that, but not Pat's Hall of Fame.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "37:51-38:24",
    "speaker" : "Brian Morrey",
    "text" : "And some of the debates we've had in the room center around a guy's Amount of time with the team. So Curtis Martin, three years. Randy Moss, three years. Even Rodney came up because Rodney I think was here for six, but he was injured for a couple of those. So But no one seems to really be bothered by the fact that Parcells was only here for four. So, you know, like I said, it's a great debate. I don't think it's a no-brainer by any stretch. I can't argue with people that say he changed the culture and brought credibility to the team. He did those things."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:25-38:25",
    "text" : "Absolutely."
  },
  {
    "speaker" : "Brian Morrey",
    "timestamp" : "38:26-38:57",
    "text" : "But I don't think it lingered when he left. So I don't now the other thing people try to argue is that um you know Bill Belichick wouldn't be here if it wasn't for Bill Parcells. And there's definitely some truth to that. Um, you know, Bill Bill Belichick was introduced to Robert Kraft in nineteen ninety-six. And so m maybe Bill Belichick is in here, if it wasn't for Bill Parcells. I don't fall into the camp that Bill Parcells deserves any credit for what Bill Belichick has done here."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, I agree with that.",
    "timestamp" : "38:57-38:59"
  },
  {
    "text" : "So that's my two cents on that. Did that toe the line enough?",
    "timestamp" : "38:59-39:04",
    "speaker" : "Brian Morrey"
  },
  {
    "timestamp" : "39:05-39:09",
    "speaker" : "Andy",
    "text" : "No, I mean I think you're not going to be able to do that. I feel like you didn't take a bald enough stance, but yeah."
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "I mean I I listen, I I think it would be great if he if it would be a great ceremony for sure. I just you know I think it's I just think it's it's a great debate. I don't think it's a no-brainer, is my point.",
    "timestamp" : "39:10-39:20"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:21-39:28",
    "text" : "Yeah, I think I'm in the same boat. So uh is so Steve's a hard no. I'm I'm in the middle with Bride, so that must mean Greg's a hard."
  },
  {
    "text" : "you know, uh debate and and there are people that think like Shaughnessy that you know there is no Hall of Fame without him in it. And then there are people that do not forgive the way he left. Yeah. I mean he didn't fight home with the team from the Super Bowl. I think again, a piece of the puzzle. Like I've argued I've argued actually in the meetings Well, we need to consider Chuck Fairbanks because he was Bill Parcells before Bill Parcell's here. He took over a downtrodden franchise in the early 70s And he drafted multiple Patriots Hall of Famers, including two Pro Football Hall of Famers and John Hannah and Mike Haynes. You know, but Stanley Morgan, Steve Nelson, Steve Grogan, uh, you know, a number of guys through that through that period of the seventies. I mean Daryl Stingley, who obviously is in the Hall of Fame and his career was cut short, but uh Pete Brock, Tim Fox Sam Cunningham. You know, and he had that 76 team on the cusp of a championship when they got screwed by Ben Dreith on a phantom roughing the passer call. They were the only team to beat Oakland that year and they hammered Oakland in the regular season. Oakland went on to win the Super Bowl. And the Patriots left with a bitter taste. Took twenty-five years, by the way, to get it. We gotta revenge rule. But uh and then the seventy-eight team was the first team to win the division, but Fairbanks left under a similar cloud of controversy. You know, he had accepted a college job, I think at the University of Oklahoma. And uh the Sullivan family got wind of it going into their final game in Miami and so I guess suspended him would be the right word. For the final game and the coordinators coached the game in Miami. They reinstated them for the playoff game against Houston. They got buried by the Oilers And uh and then he was gone. And so there was a similar controversy around his departure, and again, I think that's a piece of the puzzle.",
    "timestamp" : "39:32-41:29",
    "speaker" : "Brian Morrey"
  },
  {
    "text" : "Yeah. That doesn't sound as much like that's on him as maybe the way Parcell's left though. That almost sounds like ownership.",
    "timestamp" : "41:29-41:36",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "Yeah, I mean listen, I think that that That Parcell's put it this way, I know that when Parcells when when Parcells was hired before Kraft bought the team. Right. When Robert bought the team, one of his first calls came from Coach Parcel saying he was thinking about leaving. So I think it was it was always a year-to-year thing. And I think his career Bears that out. Like he left here, he went to the Jets short term, then to the Cowboys short term. Then he was with the Dolphins for a little bit, right? Or vice versa on the Dolphins and Cowboys. So he kind of jumped around a little bit And I but I think he was just I think that phone call was probably made to feel out ownership. But you know, Robert gave him what he wanted. I mean he went and signed David Meggett to a a good sized contract. Uh they traded Irving Fryer. Um they signed Bob Cratch and and um uh Roberts, the other offensive linemen that he had coached with the Giants. I mean he was doing what Parcells wanted him to do. And then over time I think You know, I'm sure both sides would would admit to making mistakes in that relationship, but I think the trust between the two eroded and it led to kind of a bitter breakup.",
    "timestamp" : "41:36-42:47"
  },
  {
    "text" : "Yeah. And and you know, that sort of thing happens, especially in business, but Uh, I think a lot of businesses don't have fans attached to the outcomes of those situations. Yeah. You find yourself in having these conversations about football when you wouldn't about web development, for instance, or marketing or Right. Whatever it is that Greg does.",
    "timestamp" : "42:47-43:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:08-43:10",
    "text" : "Greg doesn't even know what Greg does.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "43:10-43:11",
    "text" : "No, he doesn't.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:12-43:15",
    "speaker" : "Greg",
    "text" : "Whatever it is, I'm in the hall of fame of it."
  },
  {
    "timestamp" : "43:17-43:20",
    "speaker" : "Brian Morrey",
    "text" : "Well I'm not many. I just work in one."
  },
  {
    "text" : "That still counts. You're in the Hall of Fame of Hall of Fame hunters.",
    "timestamp" : "43:20-43:26",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "43:27-43:29",
    "speaker" : "Brian Morrey",
    "text" : "They don't give me a red jacket."
  },
  {
    "timestamp" : "43:29-43:30",
    "text" : "Dude, they should make a hall of fame.",
    "speaker" : "Steve"
  },
  {
    "text" : "By the way, those red jackets are nice. I don't believe it. They're way nicer than the ones I get in Canton.",
    "timestamp" : "43:31-43:36",
    "speaker" : "Brian Morrey"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I'll buy one from China for thirty-five bucks.",
    "timestamp" : "43:37-43:40"
  },
  {
    "text" : "Yeah, we'll send you one. We'll put your name on it.",
    "timestamp" : "43:40-43:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "But they're custom made, so nice.",
    "timestamp" : "43:49-43:51"
  },
  {
    "timestamp" : "43:51-43:55",
    "speaker" : "Andy",
    "text" : "Yeah, fair. Steve, you had uh you have one last question for Brian?"
  },
  {
    "timestamp" : "43:55-44:17",
    "text" : "Yeah, um it's more of a favor than a question. Uh I just, you know, I could die happy if Troy Brown knows who I am or knows who we are, really. So we gotta tell them about the Patriots Dynasty podcast. Yeah, so hey, there's these Brown brothers that just love you, Troy. And you don't even have to listen to it.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Brian Morrey",
    "timestamp" : "44:18-44:46",
    "text" : "Unfortunately, I I don't think I'm even allowed to see him right now Well those and those guys get tested every single day right now. So they're in like their own little bubble in terms of in the stadium. Um so we're not I'm not anywhere I haven't seen a player. You know, so I'm in no hurry. I gotta I can I gotta hurry the rest of my life Yeah, we're going through every day of the Brown brothers. Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:47-44:47",
    "text" : "That's right."
  },
  {
    "speaker" : "Brian Morrey",
    "timestamp" : "44:48-44:50",
    "text" : "What can Brown do for you?"
  },
  {
    "timestamp" : "44:52-44:59",
    "speaker" : "Andy",
    "text" : "Well we were gonna do a a podcast about the the Cleveland Browns and do Browns on Browns. There you go. Um but there's not many games to talk about."
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "I wanna know what your thoughts are on week two of two thousand two against Buffalo.",
    "timestamp" : "45:00-45:04"
  },
  {
    "timestamp" : "45:04-45:05",
    "text" : "Oh, you want to get into this?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:05-45:12",
    "text" : "We can we can talk about it if you if you want to listen to the podcast, we could tell you already done that one. We're we're on to the second one.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "45:13-45:15",
    "speaker" : "Brian Morrey",
    "text" : "I know in 2002 we couldn't stop the run."
  },
  {
    "text" : "Now we crushed Blood Cell then.",
    "timestamp" : "45:16-45:18",
    "speaker" : "Steve"
  },
  {
    "text" : "But that actually came about in the Kansas City game, which might have been week three.",
    "timestamp" : "45:19-45:23",
    "speaker" : "Brian Morrey"
  },
  {
    "timestamp" : "45:23-45:37",
    "speaker" : "Andy",
    "text" : "That's when it kicked off. Yep. And uh Steve actually called it because it was one last play to tie the game up at the end of the game."
  },
  {
    "timestamp" : "45:37-45:38",
    "speaker" : "Brian Morrey",
    "text" : "Exactly, yes."
  },
  {
    "text" : "Oh yeah, throw us a sort of thing.",
    "speaker" : "Andy",
    "timestamp" : "45:41-45:42"
  },
  {
    "timestamp" : "45:45-45:51",
    "speaker" : "Brian Morrey",
    "text" : "That was then that was the year they brought Steve Martin in. He was like the big free agent acquisition."
  },
  {
    "timestamp" : "45:51-45:54",
    "speaker" : "Steve",
    "text" : "Yeah, I saw him in this game I'm about to talk about. Yeah."
  },
  {
    "timestamp" : "45:54-45:56",
    "text" : "I think he I I don't think he worked out that well.",
    "speaker" : "Brian Morrey"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:56-46:17",
    "text" : "No. No, no. I was actually reading uh was it War Room by uh by Michael Holley. Yes, thank you. Um and that was actually in there about how Belichick was so angry over his tape that that's all they did one day was just go over how bad he was on tape."
  },
  {
    "timestamp" : "46:18-46:26",
    "text" : "Yeah, well they certainly struggled that year. They lost that game in San Diego where they couldn't stop LT, although no shame in not being actually Priest Holmes is pretty good too.",
    "speaker" : "Brian Morrey"
  },
  {
    "speaker" : "Andy",
    "text" : "But both of those well, I think Priest Holmes went for almost 200 yards. LT did go for 200 yards.",
    "timestamp" : "46:26-46:33"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "46:33-46:34",
    "speaker" : "Brian Morrey"
  },
  {
    "text" : "And then who was it that was on the Dolphins at that point?",
    "speaker" : "Andy",
    "timestamp" : "46:34-46:37"
  },
  {
    "speaker" : "Brian Morrey",
    "timestamp" : "46:37-46:38",
    "text" : "Uh Lamar Smith, maybe."
  },
  {
    "speaker" : "Andy",
    "text" : "Lamar Smith, I think. Yep. And then but I mean so those those two games and they lost to the Packers and the Broncos after that Yeah, that that by the way.",
    "timestamp" : "46:39-46:50"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "By the way, they wore blue on blue in those two games.",
    "timestamp" : "46:51-46:53"
  },
  {
    "text" : "They did.",
    "timestamp" : "46:54-46:54",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "And after that, Belichick said we're never doing that again.",
    "timestamp" : "46:54-46:58"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:58-47:02",
    "text" : "Is that why? I was actually wondering if that was the case, because that does sound like a Belichick thing."
  },
  {
    "timestamp" : "47:02-47:11",
    "speaker" : "Brian Morrey",
    "text" : "And then they, you know, when the NFL brought out the color rush uniforms, they they they caved and and and went with them. Not sure they had a choice."
  },
  {
    "speaker" : "Steve",
    "text" : "And now they're wearing them again, right? And this is their new uniform now. That's that's their f actual uniform.",
    "timestamp" : "47:11-47:16"
  },
  {
    "text" : "Well the top is now yeah, the top is essentially their new top. But that uh yeah, are they wearing it blue on blue at home?",
    "timestamp" : "47:16-47:22",
    "speaker" : "Brian Morrey"
  },
  {
    "speaker" : "Steve",
    "text" : "I think it's blue on blue.",
    "timestamp" : "47:22-47:23"
  },
  {
    "timestamp" : "47:23-47:24",
    "text" : "Oh they might be. Yeah, you might be ready.",
    "speaker" : "Brian Morrey"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "47:25-47:27",
    "text" : "It's like real similar to the color rush stuff"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "I know the jersey is basically that same exact jersey.",
    "timestamp" : "47:27-47:30"
  },
  {
    "speaker" : "Andy",
    "text" : "Right, yeah, yeah. But um yeah, so they lost those four games in 2002, and uh that is the longest losing streak. In the past 20 years.",
    "timestamp" : "47:30-47:41"
  },
  {
    "text" : "In the Belichick era.",
    "timestamp" : "47:41-47:42",
    "speaker" : "Brian Morrey"
  },
  {
    "text" : "Four past it.",
    "timestamp" : "47:43-47:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "We have another eighteen years.",
    "timestamp" : "47:45-47:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, they've done it a couple times.",
    "timestamp" : "47:47-47:49"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "Um They've lost three in a row a couple times.",
    "timestamp" : "47:49-47:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Not very often. Yeah.",
    "timestamp" : "47:52-47:54"
  },
  {
    "timestamp" : "47:54-47:56",
    "speaker" : "Steve",
    "text" : "We have a website to figure this out, right?"
  },
  {
    "speaker" : "Andy",
    "text" : "We do, yeah. Patriots Dynasty. info.",
    "timestamp" : "47:56-47:58"
  },
  {
    "timestamp" : "47:58-47:59",
    "speaker" : "Steve",
    "text" : "Patriots Dynasty. info."
  },
  {
    "speaker" : "Andy",
    "text" : "Um I think uh it's a tough one. Yeah, I can't uh whippers happening it may have been like Uh around the beginning and end of a season sort of thing. Yeah, yeah.",
    "timestamp" : "48:02-48:17"
  },
  {
    "text" : "So I'll so I'll tease something for you. So we over the we we just We're kind of finishing up with the first year, but we did an exhibit throughout last year called Yes, it's still a dynasty, where we compared the Patriots uh since 2001 to every team in the NFL and the dominance is remarkable. And don't listen to anyone tells you that tells you they win because they're in the AFC East, because they dominate every division. They have an over 700 winning percentage against every division except the AFC West, and it's like 643 against the West. So So anyway, that exhibit is now kind of ending its run and we're transitioning to the All Dynasty team, which will celebrate the individuals. That made up the dynasty. So we had fans vote throughout last season on Patriots. com to help pick that team. And that will be unveiled here in the next couple, two, three weeks. Okay.",
    "timestamp" : "48:17-49:14",
    "speaker" : "Brian Morrey"
  },
  {
    "timestamp" : "49:14-49:18",
    "text" : "I did that. I did that vote. It's so much higher than you think.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I know. I've I've tried to put that team together.",
    "timestamp" : "49:18-49:20"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "49:21-49:23",
    "text" : "Like narrowing down like, oh pick three cornerbacks."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's what I was gonna say. Who who'd your second Who who would the the second quarterback be? So but so who's your kicker? Who's your kicker? We've had that talk too.",
    "timestamp" : "49:24-49:34"
  },
  {
    "text" : "We've had this to me. I will multiple who who was selected, but you know. I do too.",
    "timestamp" : "49:34-49:41",
    "speaker" : "Brian Morrey"
  },
  {
    "text" : "Yeah. I mean it has to be Vinitary. It has to be.",
    "timestamp" : "49:42-49:45",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:46-49:48",
    "text" : "I mean, yeah."
  },
  {
    "timestamp" : "49:49-50:00",
    "speaker" : "Greg",
    "text" : "Who's your quarterback? Get the fuck out of here. Scott Zolak. Scott. You would I'd vote Benzolac."
  },
  {
    "speaker" : "Steve",
    "text" : "I fucking love that guy. I just looked it up. There is no three game losing streaks either. Really? There's a couple uh I saw one four in five games, but no three in a row.",
    "timestamp" : "50:00-50:13"
  },
  {
    "speaker" : "Andy",
    "text" : "Wow. Oh.",
    "timestamp" : "50:13-50:16"
  },
  {
    "timestamp" : "50:16-50:17",
    "speaker" : "Steve",
    "text" : "Yeah, they'd be pretty good."
  },
  {
    "timestamp" : "50:20-50:25",
    "speaker" : "Brian Morrey",
    "text" : "Hey, a lot of five game winning streaks though. Oh yeah, a couple of those."
  },
  {
    "text" : "We're actually yeah, we're coming up on the uh the big winning streak. Once we get through the 2002 season, this is we're we're doing a lot watching a lot of losses this season, but uh we'll never watch this many. in the season again.",
    "timestamp" : "50:25-50:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Brian Morrey",
    "timestamp" : "50:38-50:43",
    "text" : "Yeah, after the uh starting with the Tennessee game in two thousand three, you'll have a nice run."
  },
  {
    "text" : "Yeah. Yeah. After that Washington game.",
    "timestamp" : "50:43-50:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That's looking forward to it.",
    "timestamp" : "50:45-50:46"
  },
  {
    "text" : "Correct.",
    "timestamp" : "50:46-50:47",
    "speaker" : "Brian Morrey"
  },
  {
    "timestamp" : "50:47-50:48",
    "speaker" : "Andy",
    "text" : "Yes, me too."
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "Which if Daniel Graham had only come down with that pass at the end of that game, they might have been able to win that one too.",
    "timestamp" : "50:49-50:54"
  },
  {
    "timestamp" : "50:54-50:56",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, that was even a close one."
  },
  {
    "timestamp" : "51:01-51:30",
    "speaker" : "Brian Morrey",
    "text" : "Uh uh I'll give you a quick story on the Tennessee game. I don't know if you guys remember this, but so Steve McNair runs for a touchdown in that game. To get, I think that made it like 38 to 30, which was the final score, because Ty Law had just returned an interception for touchdown before that and limped into the end zone. McNair scores a touchdown at the same time that David Ortiz doubles off Keith Falk."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, in the playoffs.",
    "timestamp" : "51:30-51:31"
  },
  {
    "text" : "ALDS I think it was because Folk was still playing for Oakland at the time. And there's so many fans in the stands that have their headphones in listening to the Sox game. that McNair scores a touchdown and the fans start cheering. And then they showed I think they showed on the screen after that Ortiz's double. But I remember after the game talking to Richard Seymour and he was pissed.",
    "speaker" : "Brian Morrey",
    "timestamp" : "51:32-51:58"
  },
  {
    "text" : "Not bad.",
    "speaker" : "Andy",
    "timestamp" : "51:59-51:59"
  },
  {
    "timestamp" : "51:59-52:09",
    "text" : "He was like, if you want to watch the Red Sox, go to the Red Sox. I love that. But it was just a uh funny anecdotal story about that game that I remember.",
    "speaker" : "Brian Morrey"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:09-52:12",
    "text" : "I remember that, yeah. I realized it was that game"
  },
  {
    "text" : "And that started the the twenty one game win streak.",
    "timestamp" : "52:14-52:17",
    "speaker" : "Brian Morrey"
  },
  {
    "timestamp" : "52:17-52:20",
    "speaker" : "Andy",
    "text" : "It did. It it angered them so much."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "52:29-52:31",
    "text" : "Boom, mission accomplished now."
  },
  {
    "timestamp" : "52:31-52:34",
    "text" : "Exactly. Oh man. Yeah, we don't talk about that.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yep. So uh right guys, anything else?",
    "timestamp" : "52:35-52:41",
    "speaker" : "Brian Morrey"
  },
  {
    "timestamp" : "52:42-52:46",
    "speaker" : "Steve",
    "text" : "Yeah, just let Troy Brown know that we love him and we think he's the man."
  },
  {
    "text" : "Passing on Troy Brown's love. Love for Troy Brown. Got it.",
    "timestamp" : "52:46-52:50",
    "speaker" : "Brian Morrey"
  },
  {
    "timestamp" : "52:52-52:54",
    "speaker" : "Andy",
    "text" : "Thank you so much for doing this. This has been awesome."
  },
  {
    "text" : "Thanks, Brian.",
    "speaker" : "Steve",
    "timestamp" : "52:54-52:55"
  },
  {
    "text" : "Thanks, Brian.",
    "timestamp" : "52:55-52:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "See you later.",
    "timestamp" : "52:56-52:57"
  },
  {
    "speaker" : "Andy",
    "text" : "Talk to you soon.",
    "timestamp" : "52:57-52:58"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:58-52:59",
    "text" : "Yeah."
  },
  {
    "text" : "That's pretty pretty good.",
    "speaker" : "Steve",
    "timestamp" : "53:02-53:03"
  },
  {
    "timestamp" : "53:05-53:28",
    "text" : "Pretty good. All right. So that was Brian from the uh Pages Hall of Fame. But what we're really here to talk about is the return of mom's golden boy, Drew Bledsoe. to the hallowed halls of what used to be Foxboro Stadium, but isn't because he never actually played in Gillette Stadium.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "So it's not really a return. It's a first time.",
    "timestamp" : "53:28-53:31"
  },
  {
    "text" : "It isn't it isn't.",
    "timestamp" : "53:31-53:32",
    "speaker" : "Andy"
  },
  {
    "text" : "It's like nope. It's like driving past your old house that you grew up in, but then they knocked it down and built another house like a little bit over and now your old house is a parking lot. And a nicer house Yeah.",
    "speaker" : "Steve",
    "timestamp" : "53:32-53:42"
  },
  {
    "text" : "Yeah, and they're way more successful now.",
    "speaker" : "Greg",
    "timestamp" : "53:44-53:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. You're like, damn, the house looks nice. Oh man, look at those nice cars parked out there as you're driving by in the jalobi",
    "timestamp" : "53:47-53:54"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, as soon as you left, they won the lottery.",
    "timestamp" : "53:53-53:56"
  },
  {
    "timestamp" : "53:58-54:28",
    "speaker" : "Andy",
    "text" : "That very next year. Yeah. Uh amazing. Uh so yeah, but I think the announcers and like the the broadcast really wanted this to be a good game. Like the whole intro to it was Bloodsoe's coming back to the place that he built and uh he like the patrons were nothing without him and now he's come back to get vengeance on the team that let him go because of Drew uh Tom Brady and all this stuff."
  },
  {
    "text" : "They'd already kind of played that in the other game in Orchard Park.",
    "timestamp" : "54:28-54:31",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "54:31-54:41",
    "text" : "They did, but this was more like it did, but this was like he's coming home and like how are the fans gonna react? And apparently gave him a standing ovation, which They definitely gave him a standing though. As you should, yes.",
    "speaker" : "Andy"
  },
  {
    "text" : "Mm-hmm.",
    "speaker" : "Steve",
    "timestamp" : "54:41-54:41"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "54:42-54:55",
    "text" : "Well, it was a big game for the standings too. It was, yeah. Talking about the seven and five Pats against the six and six Bills. So I mean Right. This is to to decide the division. This is a big game."
  },
  {
    "text" : "Yeah, and I think the Patriots needed to stay in first place with the Dolphins, I want to say. Maybe even the Jets too. Um and the Bills game game behind. So it was One of those it was like the the only year that there was parity in the AFC East, isn't that what we've been saying?",
    "speaker" : "Andy",
    "timestamp" : "54:55-55:12"
  },
  {
    "text" : "Yeah, the past like the last time we lost.",
    "speaker" : "Steve",
    "timestamp" : "55:12-55:15"
  },
  {
    "text" : "Yeah. Um we've already like you said though, we've already talked about these bills. We know that they'll finish eight and eight. Um last in the AFC East. Do not make the playoffs. Uh we talked about Greg Williams in the last time.",
    "timestamp" : "55:15-55:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "55:32-55:55",
    "text" : "They uh back this season they were having people introduce the teams. We already I forget who we were crapping on for oh Uh Joey Harrington, you guys are shit hunting for being a nerd. And they had the same thing where like somebody talks about what the game plan's gonna be. Yeah. And we had Troy Brown, you know, and Troy Brown's just saying, you know, we just gotta go out there and give it our all and, you know. Gotta spread the ball around to all do our job."
  },
  {
    "text" : "Not including me.",
    "timestamp" : "55:57-55:58",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "55:58-56:03",
    "text" : "And then they had Greg Williams and he's going out there being like You gotta kill the head first.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:06-56:08",
    "text" : "Well he didn't say that, otherwise I would have broken wrote it down."
  },
  {
    "timestamp" : "56:08-56:13",
    "text" : "But when they said like, okay, now Greg Williams is gonna talk about the bills, it's like, well, I know what to expect.",
    "speaker" : "Steve"
  },
  {
    "text" : "I got my pencil ready. I'm like, oh come on, give me a give you a quote. But it wasn't.",
    "speaker" : "Andy",
    "timestamp" : "56:13-56:16"
  },
  {
    "speaker" : "Greg",
    "text" : "Attack the ACL.",
    "timestamp" : "56:17-56:18"
  },
  {
    "speaker" : "Andy",
    "text" : "No, but he was all like. I don't know. This is stupid coach garbage instead of Greg Williams garbage. So that was a shame.",
    "timestamp" : "56:20-56:28"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. You never know what goes on behind closed doors, you know?",
    "timestamp" : "56:29-56:32"
  },
  {
    "timestamp" : "56:32-56:36",
    "speaker" : "Steve",
    "text" : "That's true, yeah. Well unless it's Troy. I bet Troy's saying the same thing behind closed doors, you know."
  },
  {
    "speaker" : "Greg",
    "text" : "You never know, Steve. You never know.",
    "timestamp" : "56:37-56:39"
  },
  {
    "speaker" : "Steve",
    "text" : "I think we uh yeah. I think we know. I mean we've already talked to like three people who know Troy Brown and they all said he's the man. Yeah, yeah, but they barely just say about him.",
    "timestamp" : "56:40-56:48"
  },
  {
    "speaker" : "Andy",
    "text" : "That's about how he'll go and check his uh his own locker. Troy Brown would go check his own locker to make sure that Uh every morning.",
    "timestamp" : "56:48-56:57"
  },
  {
    "timestamp" : "56:58-57:00",
    "text" : "I'm just saying, never meet your heroes.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:00-57:03",
    "text" : "Well especially heroes are favorite."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "57:03-57:10",
    "text" : "Yeah. Aaron Hernandez donated a lot of money to charity, but I tell you what He wasn't that cool."
  },
  {
    "speaker" : "Steve",
    "text" : "Do you try to like hint at what you're like behind closed doors, Greg? I think we do.",
    "timestamp" : "57:13-57:17"
  },
  {
    "timestamp" : "57:18-57:22",
    "speaker" : "Greg",
    "text" : "I got some skeletons, baby. So don't you. Let's be honest with each other here."
  },
  {
    "text" : "Uh we getting into those right now? Is that what we're doing?",
    "timestamp" : "57:23-57:27",
    "speaker" : "Andy"
  },
  {
    "text" : "Well I do have uh I did do a little bit of a dive on Travis Henry.",
    "timestamp" : "57:27-57:31",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "57:31-57:37",
    "text" : "Okay. Perfect segment. Well checked past.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "57:37-57:44",
    "text" : "Well to back to like the the bills this year. I I did uh I found there, you know how they used to do those yearbook?"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "57:44-57:44"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "57:45-57:47",
    "text" : "Video montages on like VHS."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:48-57:51",
    "text" : "So I found their two thousand two thousand Patriots one."
  },
  {
    "text" : "Yeah, yeah. So I found the two thousand and two Bills yearbook. And it was appropriately titled A Work in Progress. It is so funny.",
    "timestamp" : "57:51-58:02",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "58:02-58:08",
    "speaker" : "Andy",
    "text" : "And then uh the Patriots one was entitled too. No, building for the future."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah, building for the future. Building for the future. Yeah, it's all those bullshit taglines. Yeah. But they were uh talking about uh signing Bledsoe and like getting all these quotes from players, talking how much how much they loved them and how he's like a blue-collar guy that fits in in Buffalo. And one of the guys said, uh, there's no highfalutin ways he's a true Buffalonian.",
    "timestamp" : "58:08-58:31"
  },
  {
    "text" : "What?",
    "speaker" : "Andy",
    "timestamp" : "58:32-58:33"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "58:33-58:38",
    "text" : "Highfalutin, Andy. We're not a highfalutin podcast over here."
  },
  {
    "timestamp" : "58:38-58:41",
    "text" : "No, we are not. We're big dick dummies over here.",
    "speaker" : "Andy"
  },
  {
    "text" : "We're steak, steak and potatoes kind of podcast.",
    "timestamp" : "58:42-58:45",
    "speaker" : "Greg"
  },
  {
    "text" : "My collar is literally blue right now.",
    "timestamp" : "58:46-58:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "58:49-58:54",
    "text" : "You are wearing a blue collar. High flute."
  },
  {
    "timestamp" : "58:55-58:58",
    "speaker" : "Steve",
    "text" : "Does that mean like you're playing the flute and you're like keeping it high?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "58:58-59:01",
    "text" : "Pompous or pretentious is what google. com says that the water is a good thing."
  },
  {
    "timestamp" : "59:01-59:05",
    "speaker" : "Steve",
    "text" : "Wait, wait, wait, wait, wait, wait. So Travis Henry knows a word that I don't?"
  },
  {
    "text" : "No, I don't think it was Travis Henry. Yeah, it was someone was saying about blood, so okay, okay.",
    "timestamp" : "59:05-59:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "It wasn't I thought it was a quote from Travis Henry here.",
    "timestamp" : "59:10-59:12"
  },
  {
    "timestamp" : "59:14-59:21",
    "speaker" : "Andy",
    "text" : "Yeah, but what does the uh the other website say about what's the definition from um Urban Dictionary? Urban dictionary, yeah. Ooh."
  },
  {
    "speaker" : "Steve",
    "text" : "Stat check.",
    "timestamp" : "59:21-59:22"
  },
  {
    "text" : "Uh synonyms. Cynonyms. Hoity toity and la ti-da.",
    "speaker" : "Greg",
    "timestamp" : "59:22-59:26"
  },
  {
    "timestamp" : "59:28-59:29",
    "speaker" : "Steve",
    "text" : "All right, got it."
  },
  {
    "timestamp" : "59:30-59:41",
    "speaker" : "Greg",
    "text" : "Urban dictionary, here we go. Hifalutin. Uh groundless assumption of a higher status or affection than actually contained."
  },
  {
    "speaker" : "Steve",
    "text" : "That's that's not very That's not very good.",
    "timestamp" : "59:41-59:44"
  },
  {
    "timestamp" : "59:45-59:51",
    "speaker" : "Greg",
    "text" : "Well, Urban Dictionary has like real definitions too. They're not just like funny ones. We need Urban Thesaurus."
  },
  {
    "timestamp" : "59:52-59:58",
    "speaker" : "Steve",
    "text" : "Yes, I think you're right. We should just go right there every time. Wasting our time in urban dictionary dictionary terms."
  },
  {
    "speaker" : "Greg",
    "text" : "High flute. I thought it had something to do with a flute.",
    "timestamp" : "59:58-01:00:01"
  },
  {
    "timestamp" : "01:00:02-01:00:05",
    "text" : "Andy can't spell it. He's trying to go spet stat check it right now. Can't you figure it out?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:00:05-01:00:12",
    "speaker" : "Andy",
    "text" : "Yeah, I'll try to find high flutin' and for some reason I'm on high asshole. On our dictionary. Yes, Greg."
  },
  {
    "timestamp" : "01:00:12-01:00:23",
    "text" : "Fancy schmancy. Um oh god, it gets a little dark there. Uh zooted Gucci. That's Gucci.",
    "speaker" : "Greg"
  },
  {
    "text" : "That's high falo.",
    "timestamp" : "01:00:24-01:00:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Dank, obviously. Mukin. Mookin.",
    "timestamp" : "01:00:25-01:00:30"
  },
  {
    "timestamp" : "01:00:30-01:00:31",
    "speaker" : "Steve",
    "text" : "Okay. Like Mookie?"
  },
  {
    "text" : "Hi Mookin. New Jersey's bachelor degree? I don't understand that. And then somehow we end up at Cum Dumpster. I feel like it's one of those like How many like uh ways can you get to Nicholas Cage? Urbenthosaurus just always ends up at cum dumpster.",
    "speaker" : "Greg",
    "timestamp" : "01:00:32-01:00:48"
  },
  {
    "text" : "All links lead to cum dumpster. Yeah, it's Kevin Bacon. It's like the seven degrees of Kevin Bacon and every day. That's what it is, yeah. Kevin Bacon from cum dumpster. Yeah. Ah shit. All right. Love it. So what do you what else about Travis Henry other than he's highfalutin? Speaking of speaking of complex barriers. Nicely done.",
    "speaker" : "Andy",
    "timestamp" : "01:00:51-01:01:12"
  },
  {
    "text" : "Yeah, so um I went back all the way through to like his high school years. He was the he's from Florida. He was Mr. Florida football in his senior year.",
    "timestamp" : "01:01:13-01:01:24",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:01:25-01:01:26",
    "speaker" : "Steve",
    "text" : "Florida."
  },
  {
    "timestamp" : "01:01:26-01:01:27",
    "speaker" : "Greg",
    "text" : "Yeah, which is a huge deal."
  },
  {
    "timestamp" : "01:01:28-01:01:31",
    "speaker" : "Andy",
    "text" : "It's from frostproof frostproof Florida. Frostproof."
  },
  {
    "timestamp" : "01:01:34-01:01:41",
    "speaker" : "Steve",
    "text" : "That's tough. Frost proof. Yeah, that's the first thing. And then he went to permanent frost. Yeah. Bruno."
  },
  {
    "timestamp" : "01:01:42-01:01:47",
    "speaker" : "Greg",
    "text" : "So he ran for 4,000 plus yards and 42 touchdowns in his senior year."
  },
  {
    "text" : "Sh in it in one year?",
    "speaker" : "Andy",
    "timestamp" : "01:01:47-01:01:49"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, in 14 games, which averages about 300 yards a game and three touchdowns.",
    "timestamp" : "01:01:49-01:01:54"
  },
  {
    "text" : "Fuck me.",
    "timestamp" : "01:01:54-01:01:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Like every game.",
    "timestamp" : "01:01:55-01:01:56"
  },
  {
    "text" : "Quarterbacks don't do that.",
    "timestamp" : "01:01:57-01:01:58",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, so he was pretty highly touted coming out of the out of high school. He went to Tennessee, but I guess he was sharing carries with Jamal Lewis.",
    "speaker" : "Greg",
    "timestamp" : "01:02:01-01:02:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, well, yeah.",
    "timestamp" : "01:02:09-01:02:10"
  },
  {
    "speaker" : "Greg",
    "text" : "So it took him a while to really get going. Um he was nicknamed Cheese by his strength coach strength coach for being as tough as a block of government cheese.",
    "timestamp" : "01:02:10-01:02:23"
  },
  {
    "timestamp" : "01:02:24-01:02:25",
    "speaker" : "Andy",
    "text" : "That's a stretch. Like we were just."
  },
  {
    "text" : "It's such a strength coach thing to say too.",
    "speaker" : "Greg",
    "timestamp" : "01:02:29-01:02:31"
  },
  {
    "timestamp" : "01:02:31-01:02:33",
    "speaker" : "Andy",
    "text" : "I guess so. Get a cheese."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:02:34-01:02:37",
    "text" : "I was raised on on government cheese."
  },
  {
    "speaker" : "Andy",
    "text" : "That turned out okay.",
    "timestamp" : "01:02:38-01:02:39"
  },
  {
    "speaker" : "Greg",
    "text" : "Breast milk? No. Government breast milk.",
    "timestamp" : "01:02:41-01:02:43"
  },
  {
    "text" : "We couldn't afford breast milk. My mom just made breast cheese.",
    "timestamp" : "01:02:44-01:02:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:50-01:03:08",
    "speaker" : "Greg",
    "text" : "Yeah, so he uh he ends up getting drafted in the second round. All right. Um 2001 NFL draft. Oh, in in the draft so I kind of went down another rabbit hole when they said his Wonderlook score was a nine."
  },
  {
    "speaker" : "Andy",
    "text" : "Out of how many? 27.",
    "timestamp" : "01:03:09-01:03:11"
  },
  {
    "text" : "50. Oops. We'll c we'll come back to the to the Wonderlook score because I have more on that. Yeah. So, I mean, we all kind of know what he did in uh his career. You know, he had to bounce around a few teams, had one Pro Bowl year. Um So let's get to his personal life, the more interesting stuff. He was actually married once at age 19 to a woman that was six years older than him. Um As of when when this article was written, he had eleven children by ten different women. And And he's in jail, so he obviously can't pay his child support payments. Well Why is he in jail, you may ask? Well On September 30th, 2008, Henry was arrested by the DEA after allegedly being involved in a multi-kilogram cocaine transaction that occurred in Colorado.",
    "timestamp" : "01:03:11-01:04:15",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Multi-kilogram?",
    "timestamp" : "01:04:15-01:04:17"
  },
  {
    "speaker" : "Greg",
    "text" : "Multi-kilogram cocaine.",
    "timestamp" : "01:04:17-01:04:20"
  },
  {
    "text" : "That's that's a shitload. Oh, wait for",
    "timestamp" : "01:04:20-01:04:24",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh Henry portrayed by court documents as quote the ruthless money guy in a cocaine trafficking ring, faced ten years to life on federal drug trafficking charges. Uh they reached a plea agreement and Ten years in prison, plus four million dollars in fines, plus at least $170,000 a year in child support payments. Which is unrelated, but that's why he can't pay his child support.",
    "timestamp" : "01:04:24-01:04:59"
  },
  {
    "text" : "Holy shit.",
    "timestamp" : "01:04:59-01:05:00",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "But he's out now then, you're right. Ten years, two thousand eight?",
    "timestamp" : "01:05:00-01:05:03"
  },
  {
    "timestamp" : "01:05:03-01:05:07",
    "text" : "Uh yeah. Yeah. Did you get him on the pod?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "See what he has to say for himself. We can't pay him, Andy. How's he gonna pay its tales report?",
    "timestamp" : "01:05:10-01:05:14"
  },
  {
    "timestamp" : "01:05:14-01:05:15",
    "speaker" : "Andy",
    "text" : "He's gonna work."
  },
  {
    "text" : "Yeah, that's fair.",
    "timestamp" : "01:05:15-01:05:15",
    "speaker" : "Steve"
  },
  {
    "text" : "Well, we'll start a GoFundMe.",
    "timestamp" : "01:05:16-01:05:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "170,000. Yeah.",
    "timestamp" : "01:05:24-01:05:25"
  },
  {
    "timestamp" : "01:05:26-01:05:30",
    "speaker" : "Andy",
    "text" : "All right. If we can get $170,000, maybe we'll get Travis. How much is that per kid?"
  },
  {
    "speaker" : "Greg",
    "text" : "Well ten or eleven kids, right?",
    "timestamp" : "01:05:31-01:05:33"
  },
  {
    "timestamp" : "01:05:34-01:05:34",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:35-01:05:35",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:05:35-01:05:36",
    "text" : "Not even that much, right?",
    "speaker" : "Andy"
  },
  {
    "text" : "That's not even that much money. Yeah.",
    "timestamp" : "01:05:37-01:05:38",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Like 17 grand for a child. Not even. Yeah, it's probably about a thousand bucks a month per kid.",
    "timestamp" : "01:05:38-01:05:43"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean that's up to 170 grand a year.",
    "timestamp" : "01:05:43-01:05:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Damn, man. I mean they do say that kids are expensive, but fuck.",
    "timestamp" : "01:05:47-01:05:53"
  },
  {
    "text" : "Dude, he should have stayed with the lady married at 19. All this could have been avoided.",
    "speaker" : "Greg",
    "timestamp" : "01:05:53-01:05:58"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:59-01:06:02",
    "text" : "That's true. You love the one you're with, Greg."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:06:02-01:06:11",
    "text" : "Yeah, that's why I stay with Kelly is You know, I don't wanna I don't want to I don't want to impregnate all these women if we break up, you know."
  },
  {
    "text" : "That's what it is It'll be all over me Speaking of being all over things, is that your Travis Henry deep dive?",
    "speaker" : "Andy",
    "timestamp" : "01:06:11-01:06:23"
  },
  {
    "timestamp" : "01:06:24-01:06:29",
    "text" : "Uh yes, that is the Travis Henry. I got some more stuff on the Wonderlick, but that's That's what I got on it, Henry.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:29-01:06:36",
    "text" : "Oh all right. But I'm more interested in scoring nine on a Wonder League."
  },
  {
    "text" : "Yeah. So I mean I was like, is nine good? So I looked it up and it's it's quite clearly not good. It's one of the one of the lowest scores that In history. Reed. Um well the lowest ever was a four by Darren Davis So I was like, you know, I was like, hey, let me figure I want to see like what kind of questions they got on here. So I actually took the Wonderlick test.",
    "timestamp" : "01:06:37-01:07:03",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, you can take it, right? So we have to guess what again?",
    "speaker" : "Steve",
    "timestamp" : "01:07:03-01:07:05"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:07:08-01:07:09",
    "text" : "Well I I took it two times."
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "01:07:10-01:07:10"
  },
  {
    "timestamp" : "01:07:11-01:07:15",
    "speaker" : "Greg",
    "text" : "So you wanna try and guess my average score out of fifty out of fifty."
  },
  {
    "text" : "Mm-hmm.",
    "speaker" : "Andy",
    "timestamp" : "01:07:15-01:07:16"
  },
  {
    "timestamp" : "01:07:17-01:07:17",
    "speaker" : "Steve",
    "text" : "Nine"
  },
  {
    "timestamp" : "01:07:20-01:07:32",
    "text" : "That'd be perfect. You just couldn't even you're just sitting over here talking shit out of me, K. So yeah, so here's the thing. I I think you have a tiny tiny penis. So I'm gonna say 35. Ooh, yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07:32-01:07:35",
    "speaker" : "Greg",
    "text" : "You are a big point, Andy."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:07:36-01:07:40",
    "text" : "So so either way, either way, you're kind of fucking yourself"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:07:39-01:07:43",
    "text" : "Travis Travis Henry's definitely a big dick dummy. You know?"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean it's like the lower the war, the bigger your dick.",
    "timestamp" : "01:07:44-01:07:47"
  },
  {
    "speaker" : "Steve",
    "text" : "You come out like I got a board, baby.",
    "timestamp" : "01:07:47-01:07:49"
  },
  {
    "speaker" : "Andy",
    "text" : "It's the eleven kids, right? I ain't going to the pro I'm going pro.",
    "timestamp" : "01:07:49-01:07:52"
  },
  {
    "speaker" : "Greg",
    "text" : "Plus the eleven kids. Yeah. So I took it the first time and I got a twenty-nine. And then I got the second time I got a thirty-six.",
    "timestamp" : "01:07:52-01:08:02"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:08:02-01:08:02",
    "text" : "Oh."
  },
  {
    "timestamp" : "01:08:04-01:08:07",
    "speaker" : "Greg",
    "text" : "So pretty good. Brady got Brady got a 33."
  },
  {
    "timestamp" : "01:08:08-01:08:09",
    "speaker" : "Andy",
    "text" : "So you're right in that range."
  },
  {
    "timestamp" : "01:08:09-01:08:16",
    "text" : "I'm like yeah, I'm in the Brady smarts and looks range. Oh it's a shame that Brady's got a small dick Right.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:08:17-01:08:21",
    "speaker" : "Steve",
    "text" : "But he had a massive hog until he went to Tampa Bay and then it shrunk. Right, yeah."
  },
  {
    "text" : "So the thing about it though is it's it's fifty questions. Uh but it's only 12 minutes. Right. Yeah. So it's really uh you're racing against time, which I think the first time I was like, I ran out of time. But the the And my guess is a lot of those people are getting nines or like single digits are just sitting there. They don't know how to take the test rather than they all the questions you could probably figure out if you had enough time.",
    "timestamp" : "01:08:22-01:08:49",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:08:49-01:08:49",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "But a lot of them are like They vary in difficulty, so if you know how to take the test of like, all right, skip the hard ones and go to the ones that are easy. But that being said, some of the questions are I got I screenshotted some of them. I'll ask you this one. Which of the following numbers is the smallest? 33 or thirteen? Like that shouldn't take you 15 seconds to figure out, you know.",
    "timestamp" : "01:08:49-01:09:17",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:09:17-01:09:18",
    "text" : "Yeah, it's six.",
    "speaker" : "Brian Morrey"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:09:18-01:09:18"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:09:21-01:09:23",
    "text" : "The sixth month of the year is"
  },
  {
    "timestamp" : "01:09:25-01:09:29",
    "text" : "February, March, April, May, June. Even that's not fifteen cents.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Everybody should get that one. Yeah. But then there's other ones. Yeah, there's other ones like this one. Four individuals invest in real estate together and agree to split the profits equally and invest 12,000, X, 6,000, Y 25,000, Z 7,000. If the profits for the first year were twelve thousand, 120,000, why I received blank less than if the profits were divided in proportion to how much they invested. Like that one, I mean you could probably figure it out, but it's gonna be more than 15 seconds for sure, right? Right. So thought it was pretty interesting. You want to hear some notable names? Oh, notable scores. Yeah, yeah.",
    "timestamp" : "01:09:29-01:10:04"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:04-01:10:08",
    "text" : "Are we talking top or bottom? Or we got both. All right."
  },
  {
    "speaker" : "Greg",
    "text" : "You want to start on the top or want to start on the top?",
    "timestamp" : "01:10:08-01:10:10"
  },
  {
    "text" : "Let's save the bottom for for last. I want to savor it.",
    "timestamp" : "01:10:11-01:10:13",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:10:13-01:10:19",
    "speaker" : "Greg",
    "text" : "Okay, so there's one person ever that's got a Perfect score."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh was it Fitzpatrick? Ryan Fitzpatrick? He did go to Harvard.",
    "timestamp" : "01:10:20-01:10:23"
  },
  {
    "timestamp" : "01:10:24-01:10:25",
    "speaker" : "Greg",
    "text" : "Fitzpatrick got a 48."
  },
  {
    "timestamp" : "01:10:25-01:10:27",
    "speaker" : "Andy",
    "text" : "That's what I yeah, I knew he got real high."
  },
  {
    "speaker" : "Greg",
    "text" : "Perfect. Pat McAnally, some fifth round pick in 1975.",
    "timestamp" : "01:10:28-01:10:32"
  },
  {
    "text" : "What did he play? What position? Wonderlick's been around that long too.",
    "timestamp" : "01:10:32-01:10:35",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, I guess so.",
    "timestamp" : "01:10:35-01:10:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Damn. What position did he play?",
    "timestamp" : "01:10:36-01:10:38"
  },
  {
    "text" : "Uh I don't know. Most of these are quarterbacks though. These guys that are high up there. Mike Mamula got a 49. The other 48 on here is a New England Patriot.",
    "timestamp" : "01:10:38-01:10:50",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh, well you just said half his first name, didn't you? Mike? Lonnie Paxton?",
    "speaker" : "Andy",
    "timestamp" : "01:10:51-01:10:57"
  },
  {
    "text" : "No.",
    "timestamp" : "01:10:58-01:10:58",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:10:58-01:11:00",
    "speaker" : "Andy",
    "text" : "Oh, I thought you said Lonnie. What positions he play?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:11:00-01:11:01"
  },
  {
    "text" : "Tight end",
    "timestamp" : "01:11:01-01:11:02",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Aaron Hernandez.",
    "timestamp" : "01:11:02-01:11:04"
  },
  {
    "text" : "He's on the other list.",
    "timestamp" : "01:11:07-01:11:08",
    "speaker" : "Greg"
  },
  {
    "text" : "No, Gronkowski's on the bottom end of the list.",
    "timestamp" : "01:11:09-01:11:11",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:11:13-01:11:14",
    "speaker" : "Andy",
    "text" : "Imagine that."
  },
  {
    "speaker" : "Steve",
    "text" : "Rod Rutledge.",
    "timestamp" : "01:11:14-01:11:16"
  },
  {
    "timestamp" : "01:11:17-01:11:21",
    "speaker" : "Andy",
    "text" : "So it's not your main wiggins. Yeah, definitely Wiggy. It's not Fourier."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:11:22-01:11:27",
    "text" : "Is this someone in this era that we've been watching and so Fourier?"
  },
  {
    "timestamp" : "01:11:27-01:11:27",
    "text" : "No.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:11:28-01:11:29",
    "text" : "Ben Coates.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:29-01:11:32",
    "speaker" : "Greg",
    "text" : "Cam Cleveland. Ben Watson."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:32-01:11:39",
    "text" : "Oh yeah, he's a smart dude. Fuck I should have missed that. Forget about the Ben Watson era. Damn. All right."
  },
  {
    "timestamp" : "01:11:41-01:11:51",
    "speaker" : "Greg",
    "text" : "Gardner Minshew got a 42. Oh shit. Yeah. So he's not as dumb as he looks. Exactly. That's what I'm saying. He's got he knows what he's doing."
  },
  {
    "text" : "He's like, he's got a huge dick. The fucking swag and the mustache and the headband. He's like, well, that guy is foss",
    "speaker" : "Steve",
    "timestamp" : "01:11:51-01:11:58"
  },
  {
    "text" : "The Flint?",
    "timestamp" : "01:11:59-01:11:59",
    "speaker" : "Greg"
  },
  {
    "text" : "Clearly not. Yep. Nope.",
    "speaker" : "Steve",
    "timestamp" : "01:11:59-01:12:01"
  },
  {
    "text" : "Calvin Johnson of 41. Megatron. Oh. Yeah. I thought that was pretty surprising. There's not many receivers on here. Eli Manning, 39. Tony Romo, 37.",
    "timestamp" : "01:12:02-01:12:15",
    "speaker" : "Greg"
  },
  {
    "text" : "Somebody take it for him. Yeah, his brother took it for him someone.",
    "speaker" : "Andy",
    "timestamp" : "01:12:15-01:12:18"
  },
  {
    "text" : "Josh Allen, 37.",
    "timestamp" : "01:12:19-01:12:21",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:12:22-01:12:32",
    "text" : "Wow. Wait, hang on. Is there any questions about not throwing in exceptions on this? I'm gonna guess no.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Where did Josh Allen go? Like Montana? Something like that. Wyoming?",
    "timestamp" : "01:12:33-01:12:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:12:37-01:12:38",
    "text" : "Big open space."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. So let's let's look at the bottom half of the list here.",
    "timestamp" : "01:12:39-01:12:42"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:12:42-01:12:48",
    "text" : "Yeah, thank you. Getting good stuff. Mary's Hernandez and Grong. Who thought who scored higher?"
  },
  {
    "speaker" : "Greg",
    "text" : "There's a lot of great names down here. Donovan McNabb got a 14 or 15. Or Jim Kelly got a 15. Wow. Lamar Jackson 13. Uh Ray Lewis 13.",
    "timestamp" : "01:12:50-01:13:10"
  },
  {
    "timestamp" : "01:13:10-01:13:11",
    "text" : "God damn.",
    "speaker" : "Andy"
  },
  {
    "text" : "Darrell Revis a 10. Sebastian Janikowski got a nine. That is perfect. That's perfect. Yeah. Talk about a big dick dummy, definitely. Big dick dummy. Vince Young. So here's an interesting one. Vince Young got a six. And then he he was readministered the test the following day and got a 16. Really?",
    "speaker" : "Greg",
    "timestamp" : "01:13:12-01:13:38"
  },
  {
    "speaker" : "Andy",
    "text" : "Wow.",
    "timestamp" : "01:13:38-01:13:38"
  },
  {
    "text" : "So that's why I'm saying like a lot of this probably has to do with like Yeah. Did you study? Did anyone explain how to do this to you?",
    "timestamp" : "01:13:39-01:13:47",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:13:47-01:13:56",
    "text" : "There's so much of like draft prep that they should be like you uh you can just go on the internet and take a wonder lick test like You know, before you go to the combine, take a bunch of Wonderlake tests that you know. Yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Take two.",
    "timestamp" : "01:13:56-01:13:57"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:13:57-01:13:57"
  },
  {
    "timestamp" : "01:13:57-01:14:11",
    "speaker" : "Greg",
    "text" : "I mean, and you know what I think probably has to do with it? Like standardized standardized testing is a lot of like It's your mental approach. So people that like, if it's not your skill, I think it's a lot easier to like shut down and be like, I'm not even gonna try."
  },
  {
    "text" : "Yeah. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:14:11-01:14:11"
  },
  {
    "text" : "It's almost like with me, weightlifting with me, right? I I can't do it, so I was always just like, I don't want to do it because I suck at it, you know? But if yeah, if they actually put the time in and a little effort, I bet they could score like reasonable scores. This is to me Or all people that are like, I don't see any value in this, so I'm just kind of bullshitting it.",
    "timestamp" : "01:14:12-01:14:30",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "When I was in college, I would like take a test and get down to just a couple of 50-50 answers on like a multiple choice sess. I bring a coin to me and I just flip the coin and then mark down heads or tails. But I do it pretty quick so everyone's staring at me because I'm just flipping coins and writing down my answers. Yeah. That sounds about right, Steve. If the coin came up heads and I really wanted to be tails, I'd put the tails together.",
    "timestamp" : "01:14:30-01:14:53"
  },
  {
    "timestamp" : "01:14:55-01:15:13",
    "speaker" : "Greg",
    "text" : "That's a good point. And that's some of the the other thing is like I don't think there's anything you don't give points off for a wrong answer. So these people that got like a A seven? You could literally, they're all like four uh choice questions. You could yeah you guess every time you get better. Right."
  },
  {
    "timestamp" : "01:15:13-01:15:14",
    "text" : "Yeah. Just by long.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Frank Gore got a six. Like that's it's clearly not indicative of like how good of a career you're gonna take.",
    "timestamp" : "01:15:15-01:15:21"
  },
  {
    "text" : "That's what I'm gonna say. Yeah, maybe it's actually probably More more indicative the lower you get, the more focused you are on football. You obviously weren't studying how to take tests.",
    "speaker" : "Andy",
    "timestamp" : "01:15:21-01:15:31"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. And then the two lowest are that guy Darren Davis. And then Morris Claiborne, that cornerback from uh Dallas. He got a four. Wow.",
    "timestamp" : "01:15:31-01:15:42"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:15:43-01:15:52",
    "text" : "You almost have to try. Yeah. Man."
  },
  {
    "speaker" : "Andy",
    "text" : "Four like I think I would specifically have to try to get a four. Right. It would be harder for me to get a four than to get like a three.",
    "timestamp" : "01:15:53-01:16:00"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but you haven't been hitting the head a whole shitload.",
    "timestamp" : "01:16:00-01:16:03"
  },
  {
    "speaker" : "Andy",
    "text" : "I've been hitting the hell a lot.",
    "timestamp" : "01:16:05-01:16:07"
  },
  {
    "text" : "What's your name? Ooh, the tough ones first. Spe spend six minutes on his name.",
    "timestamp" : "01:16:08-01:16:14",
    "speaker" : "Greg"
  },
  {
    "text" : "What is your favorite color? Blue. No, no, no, yellow. Uh all right, so speaking of of failures, let's talk about these bills.",
    "timestamp" : "01:16:15-01:16:28",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:16:28-01:16:32",
    "text" : "What do you guys give this as a watchability score? Greg, you go first."
  },
  {
    "text" : "Uh I would say watch the first half.",
    "timestamp" : "01:16:33-01:16:36",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:16:37-01:16:38",
    "text" : "Yeah, that's fair.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. So I mean it's kind of I would say let's say four. I'll go three and three and a half.",
    "timestamp" : "01:16:39-01:16:46"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:16:46-01:16:46"
  },
  {
    "speaker" : "Greg",
    "text" : "Let's go three and a half because The good thing is it's one of those games where you don't have to watch the whole thing. You watch the first half and then you can just turn it off.",
    "timestamp" : "01:16:47-01:16:54"
  },
  {
    "speaker" : "Andy",
    "text" : "And you don't really even watch like the first quarter and the fourth quarter.",
    "timestamp" : "01:16:54-01:16:58"
  },
  {
    "text" : "Right.",
    "timestamp" : "01:16:59-01:16:59",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Because the first quarter the Patriots score three times on all three drives. With uh a blood zone interception like mixed in there. Yeah, just sprinkled in. A classic blood zone interception. Yep. Uh and then he yeah, it was uh a batted ball that got batted straight up and Seymour picked it. Uh which sandwiched uh two Tom Brady touchdown passes, one to Patton and one to a back shoulder to Donald Hayes of all people.",
    "timestamp" : "01:16:59-01:17:26"
  },
  {
    "timestamp" : "01:17:26-01:17:55",
    "speaker" : "Steve",
    "text" : "I was I was I was watching that and I was like, where's Hayes been all year? And I think I figured it out. Because on there's a one on the field goal, the first drive, where Branch got hurt. Yes. And because he's out, Hayes is in. Right, yeah. So Hayes got kind of like he was their big signing in the offseason. And I thought he's like, he's been pretty decent when he's in there. Yeah. But ranch came in as a rookie and just took his job. He did, yeah. Yeah, I think that's exactly what happened."
  },
  {
    "timestamp" : "01:17:56-01:17:59",
    "text" : "Donald Ruther Rutherford B. Hayes.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, not bad.",
    "timestamp" : "01:17:59-01:18:01"
  },
  {
    "speaker" : "Greg",
    "text" : "That's great. I like it when you guys like my nicknames.",
    "timestamp" : "01:18:01-01:18:07"
  },
  {
    "timestamp" : "01:18:08-01:18:13",
    "speaker" : "Andy",
    "text" : "Uh let me try one. Drew uh lung bled, so? Okay, okay."
  },
  {
    "speaker" : "Greg",
    "text" : "What do you mean?",
    "timestamp" : "01:18:14-01:18:14"
  },
  {
    "timestamp" : "01:18:14-01:18:16",
    "speaker" : "Andy",
    "text" : "His his lung bled."
  },
  {
    "text" : "Oh, long blood. I thought it said long, long blood, so.",
    "timestamp" : "01:18:17-01:18:20",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Apparently so what I I was reading again and oh it was the new book that came out. Uh the new patrons book Dynasty or something like that. And um and like the first chapter is about Bledsoe being in the hospital and apparently the hit sheer like broke his um Rib, right? Like a bunch of ribs, yeah. And one of them like poked through an artery in his lungs, and so it filled up the space around his lungs with blood which collapsed the lung. So what they did is they put a two because they they could have like they were supposed to go in and like cut him open to to drain it. But if they did that, it would they would have had to cut all the muscles that he used to throw the football with. So they basically just stuck a tube in there and sucked the blood out and then had another tube where like in his arm that would like put the blood back in where it was supposed to go. And they're like, so we're gonna do this for a couple hours. And if it works, we won't have to cut you open and you'll maybe be able to play football again. And if it doesn't, This could be the end of your career right now. Ah, it's crazy. Damn. Super fucking sketchy.",
    "speaker" : "Andy",
    "timestamp" : "01:18:23-01:19:33"
  },
  {
    "timestamp" : "01:19:33-01:19:36",
    "speaker" : "Greg",
    "text" : "Yeah, I don't think I was ever aware of how serious of an injury that was."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, me neither. I mean I knew it, but like I didn't know what I'm not",
    "timestamp" : "01:19:37-01:19:40"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:19:40-01:19:41",
    "text" : "detail. That's crazy."
  },
  {
    "text" : "Yeah. Yeah, it's nuts that that's only now coming out, it feels like.",
    "timestamp" : "01:19:41-01:19:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "We're gonna hook you up to a sump pump. And hopefully this works.",
    "timestamp" : "01:19:45-01:19:49"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:19:49-01:19:58",
    "text" : "We're just gonna circulate your blood like you're a fucking uh dialysis patient. Well, I was gonna say like a fucking uh hose on a pool, but like a fucking fish."
  },
  {
    "timestamp" : "01:19:58-01:19:59",
    "speaker" : "Greg",
    "text" : "Vampire?"
  },
  {
    "text" : "Like a fish tank.",
    "timestamp" : "01:19:59-01:20:00",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh.",
    "speaker" : "Greg",
    "timestamp" : "01:20:00-01:20:00"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:20:00-01:20:06",
    "text" : "Pump the water in, pump the water out, pump the water in, pump the water out. Now it's clean. And it's where it's supposed to be."
  },
  {
    "speaker" : "Greg",
    "text" : "I think dialysis is the better uh",
    "timestamp" : "01:20:06-01:20:08"
  },
  {
    "text" : "Yeah, but that's not nearly as funny of a visual. Two bloods are hooked up to a fucking fish tank.",
    "timestamp" : "01:20:09-01:20:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It's a Chinese fire drill, right, Steve?",
    "timestamp" : "01:20:15-01:20:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Hey, that's rage.",
    "timestamp" : "01:20:19-01:20:20"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:20:20-01:20:26",
    "text" : "No, it's not. For the the a red blood cell Chinese fire drill."
  },
  {
    "speaker" : "Greg",
    "text" : "Red blood cell.",
    "timestamp" : "01:20:27-01:20:28"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh So yeah, so that was kind of that was the first quarter and then the last quarter was um Blood Soul Throw More Interceptions and Peerless Price fumbling, which made me feel real good because he was talking a bunch of trash. being down three touchdowns the entire game.",
    "timestamp" : "01:20:29-01:20:48"
  },
  {
    "timestamp" : "01:20:48-01:21:01",
    "speaker" : "Steve",
    "text" : "I mean the game was closer than you'd think though. I mean we ran out 17-0 immediately. Yeah. And we only won by 10. Well, it was 10, but there was a point where like the bills were getting a little momentum."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:01-01:21:13",
    "text" : "It was gone. It was, but there was a CD. After the first CD, yeah, in the third quarter, but Then blood they turn the ball over three times in a row in the fourth quarter. Yeah. So the only classic blood so game."
  },
  {
    "text" : "I think we said this last time we picked the Bills, but his His stats are even more blood so this game.",
    "timestamp" : "01:21:14-01:21:19",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:21:19-01:21:24",
    "speaker" : "Andy",
    "text" : "Yeah, give me a stat, because it's it's super typical Bledsoe."
  },
  {
    "timestamp" : "01:21:25-01:21:31",
    "speaker" : "Greg",
    "text" : "32 of 51 for 328 yards, two touchdowns, and four interceptions. Yeah."
  },
  {
    "timestamp" : "01:21:32-01:21:44",
    "speaker" : "Andy",
    "text" : "And most of those 300 yards came in garbage time because he's hucking the ball in the fourth quarter literally every play. But I think didn't he like set some record for 300 yard games by Buffalo Bill in a season?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:21:44-01:21:44",
    "text" : "Really?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I think I wrote it down. Oh yeah, no, he he crossed 305 completions, which was a Bill's record in week 14, which is impressive. But he also threw four interceptions on the day, which is the most he's ever thrown since 1999.",
    "timestamp" : "01:21:45-01:22:02"
  },
  {
    "timestamp" : "01:22:02-01:22:04",
    "text" : "That is the most shocking stat of the night.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:22:04-01:22:08",
    "speaker" : "Andy",
    "text" : "Yeah, but he went that many years without throwing four interceptions in a game."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:22:08-01:22:09",
    "text" : "Three. Yeah."
  },
  {
    "timestamp" : "01:22:09-01:22:10",
    "speaker" : "Andy",
    "text" : "Three?"
  },
  {
    "timestamp" : "01:22:10-01:22:12",
    "text" : "Three years. Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "Well, I mean, that's a long time for him. I mean he sat out all 2001, so that makes sense. sense yeah so i gotta say i wrote this down because there there's a lot of shots of drew bled so in this game as you would expect and in terms of like the patriots have had really handsome quarterbacks over the years i think drew bledsoe is underrated in that Of course. I think he's a handsome dude. I think a very chiseled face and very just like well he's underrated because think about the other handsome people coming through there. Yeah. I mean early Drew Bloodsoul wasn't that handsome with the bowl cut and the The chin button.",
    "timestamp" : "01:22:13-01:22:43",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:22:43-01:22:49",
    "text" : "Brady wasn't with the chin butt? Yeah, he didn't look right with the chin button. Yeah, what did happen to Brady's chin butt? Nobody asked that.",
    "speaker" : "Steve"
  },
  {
    "text" : "The man's had some work done to things.",
    "speaker" : "Andy",
    "timestamp" : "01:22:50-01:22:52"
  },
  {
    "speaker" : "Greg",
    "text" : "That's suspicious.",
    "timestamp" : "01:22:53-01:22:54"
  },
  {
    "speaker" : "Andy",
    "text" : "If you live with who he lives with, you you would have work done too, regardless of how beautiful you think you are.",
    "timestamp" : "01:22:54-01:22:59"
  },
  {
    "timestamp" : "01:22:59-01:23:07",
    "speaker" : "Steve",
    "text" : "If I got my chin butt erased and then I could You know, marry someone with as much money and prestige as Giselle, I'll probably do that too."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:23:07-01:23:07",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "So where is he on your hunkometer then?",
    "timestamp" : "01:23:07-01:23:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:23:11-01:23:43",
    "text" : "Uh good question. So I mean let's let's how many dildos out of six? How many Buffalo Bills dildos? Uh I mean Old Tom like not old Tom Brady, but like wait, we're talking about Drew. I know, but I'm I'm I'm putting my lip like like post-chin butt Tom Brady is probably my number one. I I personally would put Drew Bledsoe over Jimmy G. Cliff King Cliff Kingsbury?"
  },
  {
    "speaker" : "Steve",
    "text" : "He's gotta be on that list. He's an attractive dude. No way. I'm gonna put Jimmy G the top. He's supermodel. Yeah. Jimmy GQ. What a nickname. Yeah.",
    "timestamp" : "01:23:43-01:23:53"
  },
  {
    "timestamp" : "01:23:54-01:23:59",
    "speaker" : "Greg",
    "text" : "I don't know. He doesn't quite do it for me. Something's not quite right."
  },
  {
    "text" : "He's got the rugged good looks and the boyish. handsomeness that you always talk about Greg. I don't know, there's you know there's something off. Yeah, there's just yeah. Do you guys think Danny Amendola is ugly? No, I think him and uh Jimmy G look similar.",
    "speaker" : "Steve",
    "timestamp" : "01:24:00-01:24:15"
  },
  {
    "speaker" : "Greg",
    "text" : "No. I think Julian's the best looking one.",
    "timestamp" : "01:24:15-01:24:18"
  },
  {
    "text" : "Yeah, I alright. That's you just think that because Julian has a crazy beard. It's a quality. You respect that he could look good, but now the old You look like a dump, but now you look like a real dump, so to say.",
    "speaker" : "Steve",
    "timestamp" : "01:24:19-01:24:30"
  },
  {
    "speaker" : "Greg",
    "text" : "Then when Julian chases beard, he just looks like that's actually a valid point, Steve. So I just came to a realization of this Drew Bledso poster I used to have. Do you remember? Yeah, poster that said ten reasons Drew Bledzel will kick your butt.",
    "timestamp" : "01:24:30-01:24:52"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Yes. too.",
    "timestamp" : "01:24:52-01:24:57"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:24:57-01:25:00",
    "text" : "Did you get it like a a school fair too? Like a book fair something?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:25:01-01:25:17",
    "text" : "The book fair. Yeah. Book fair. I also got the the law firm one with lawyer. That was my go-to. That was my go-to. I I found this poster though. Do you guys got a computer in front of you to look it up? Yeah. Yeah. If you want to talk about the the hunkometer."
  },
  {
    "text" : "Drew Bledsoe. Shit, man. What do I Google to find it?",
    "timestamp" : "01:25:18-01:25:21",
    "speaker" : "Andy"
  },
  {
    "text" : "Drew Bledsoe. Ten reasons Drew Bledsoe will kick your butt.",
    "timestamp" : "01:25:21-01:25:24",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Image. This one.",
    "timestamp" : "01:25:24-01:25:25"
  },
  {
    "timestamp" : "01:25:26-01:25:34",
    "speaker" : "Steve",
    "text" : "Oh my god, I remember that. There's a ton of like nice you know studio quality photoshots here with him bigger with nice lighting."
  },
  {
    "timestamp" : "01:25:34-01:25:38",
    "speaker" : "Greg",
    "text" : "If I'd call them night. I probably still have this poster."
  },
  {
    "text" : "Really?",
    "timestamp" : "01:25:38-01:25:38",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Because it was in the shrine so it's probably in in the basement right now.",
    "timestamp" : "01:25:38-01:25:42"
  },
  {
    "speaker" : "Steve",
    "text" : "We could dig that out. We're here.",
    "timestamp" : "01:25:43-01:25:44"
  },
  {
    "text" : "So how about this? What if if we find it? Can we give it away as a as a prize?",
    "timestamp" : "01:25:45-01:25:51",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:25:52-01:25:52",
    "speaker" : "Greg",
    "text" : "Oh, dude."
  },
  {
    "text" : "Would you be alright with that?",
    "timestamp" : "01:25:53-01:25:54",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh handy, that's that's a tall ask.",
    "timestamp" : "01:25:54-01:25:58",
    "speaker" : "Greg"
  },
  {
    "text" : "It is the tall ask is finding it because you have so much shit in that basement. There's like 15 boxes of your crap.",
    "timestamp" : "01:25:58-01:26:04",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:26:04-01:26:06",
    "speaker" : "Greg",
    "text" : "Dude, it's all from the shrine."
  },
  {
    "text" : "I had one box with my name on it. I went I went through it while I was home. Half the shit in there is yours",
    "timestamp" : "01:26:06-01:26:12",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:26:14-01:26:16",
    "speaker" : "Greg",
    "text" : "All my stupid outfits are in there too."
  },
  {
    "text" : "No, chicken wing hats get given away too. We're gonna give away all of Greg's uh childhood possessions.",
    "speaker" : "Andy",
    "timestamp" : "01:26:22-01:26:28"
  },
  {
    "speaker" : "Steve",
    "text" : "As long as you don't throw away my fur coat, I'll be let's read the uh the reasons, Greg. Hit them with us.",
    "timestamp" : "01:26:29-01:26:36"
  },
  {
    "timestamp" : "01:26:37-01:26:44",
    "speaker" : "Greg",
    "text" : "Well there's no there's no real reason. So it's just ten photos. Yeah. But five of them are these like"
  },
  {
    "text" : "They're they're not quite black and white, but they're like sepia or sepia, however you pronounce that, or it's like alloy which black and white?",
    "speaker" : "Andy",
    "timestamp" : "01:26:44-01:26:51"
  },
  {
    "timestamp" : "01:26:51-01:27:02",
    "text" : "Studio type like I'm in a dark room. And he's like lifting weights in three of them. One he's doing like a bicep curl with a with a uh sleeveless shirt on.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:27:06-01:27:06",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "It's just it's so ridiculous. I I I actually remember having those conversations with myself as a kid where like what are the ten reasons? And like looking at each other being like Oh, he's got good footwork. There's one where he's handing it off. He's like, oh, he's a great he's a great play action. Good good uh decision maker. Yeah.",
    "timestamp" : "01:27:08-01:27:27"
  },
  {
    "speaker" : "Steve",
    "text" : "Not putting a pick on this play.",
    "timestamp" : "01:27:30-01:27:32"
  },
  {
    "text" : "He's got good mental toughness. That's the one with him looking pensive. That's right. Yeah. Oh, that's a that's a quality. Yeah, if we find that. We will we will let the listeners know. And I think I think we're gonna keep doing what we're doing with the uh the best.",
    "speaker" : "Andy",
    "timestamp" : "01:27:33-01:27:49"
  },
  {
    "timestamp" : "01:27:50-01:27:51",
    "speaker" : "Steve",
    "text" : "Yeah, just write us a review."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, the best review. Well we're going to be able to do that. He's memorized that. You didn't even have to read that off of anything. Yeah, that's the way to go. Andy, you know I can't read. It'll be in the show notes. That's true. So yeah, if you want to rate us for a chance to win If we can find Greg's poster of Drew Bledsoe.",
    "timestamp" : "01:27:51-01:28:09"
  },
  {
    "timestamp" : "01:28:10-01:28:30",
    "text" : "It's probably down there somewhere. Classic Drew Bledsoe softcore porn. Yeah. I mean he's a beautiful man in these pictures though. I just don't think you I can't think he's better looking than Jimmy G. And Danny Amandola, would you say Danny Amendola or Drew Bledsoe's? That's real deep, deep.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:28:32-01:28:35",
    "speaker" : "Andy",
    "text" : "He is. I think I'm still on the Bledsoe train though."
  },
  {
    "text" : "Andy is my number two. Andy, do I need to leave the room? Hang on, let's see.",
    "speaker" : "Steve",
    "timestamp" : "01:28:35-01:28:40"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:28:42-01:29:02",
    "text" : "Shirtless. Drew Budso shirtless. Let's just say oh the first picture of Drew Bledsoe shirtless. All right, let me just give you uh an array of what's happening here. The first one is what looks like rookie Drew Bledsoe. with um Bill Parcells in those old school starter jackets that that make you look super puffy and fat."
  },
  {
    "timestamp" : "01:29:03-01:29:10",
    "speaker" : "Steve",
    "text" : "He's fat. Yeah, although nobody's topless. One of the top results is Tom Brady's combine pitcher, which I'm a big fan of. Yeah, that's what I was getting to."
  },
  {
    "timestamp" : "01:29:10-01:29:18",
    "text" : "Are you gonna go to the the Super Bowl gay guy guide? The gay guy guide to the big game, Super Bowl X L V I I.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Let's uh how is your blood so part of the Super Bowl?",
    "timestamp" : "01:29:18-01:29:21"
  },
  {
    "speaker" : "Andy",
    "text" : "A man eating vagina, a giant turtle, gay rights supporters. Oh, this is the 49ers Ravens one. Why is Drew Bledsoe in there? That's not Drew Bledsoe. That's Kaepernick holding a turtle Sammy. I don't know why that showed up.",
    "timestamp" : "01:29:21-01:29:37"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, not a lot of Drew Budzo shirtless photos. Oh. Andy's very upset.",
    "timestamp" : "01:29:38-01:29:42"
  },
  {
    "text" : "Yeah. So I guess I can't I can't say for sure that Drew Bledsoe's my number two because yeah, that's a shame.",
    "timestamp" : "01:29:43-01:29:48",
    "speaker" : "Andy"
  },
  {
    "text" : "You were just googling Drew Bledsoe's shirtless? Yeah. Yeah. Good God. Doesn't cut nothing comes up. Welcome to the podcast, Greg. Where's the thing? Google Blood So Naked. All right.",
    "speaker" : "Greg",
    "timestamp" : "01:29:48-01:30:03"
  },
  {
    "speaker" : "Steve",
    "text" : "Drew Bledsoe Porn. Porn hackers look like Drew Bledsoe.",
    "timestamp" : "01:30:03-01:30:09"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:30:10-01:30:11",
    "text" : "Deepfake, baby."
  },
  {
    "speaker" : "Steve",
    "text" : "David, stop stop reading Drew Bledsoe Wonderlick score. Ooh.",
    "timestamp" : "01:30:12-01:30:16"
  },
  {
    "speaker" : "Greg",
    "text" : "Ooh, let's figure that one out. What do you guys think it is? If you had to guess.",
    "timestamp" : "01:30:17-01:30:21"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh it's like a 20 25, right in the middle. 29. Ooh.",
    "timestamp" : "01:30:21-01:30:27"
  },
  {
    "timestamp" : "01:30:27-01:30:32",
    "speaker" : "Andy",
    "text" : "You gotta guess? I thought I already looked it up. Yeah, so did I."
  },
  {
    "timestamp" : "01:30:32-01:30:34",
    "text" : "Dude, 36.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:30:35-01:30:41",
    "speaker" : "Andy",
    "text" : "Oh, this has 37. Oh, even better. He outsmarted Tom Brady."
  },
  {
    "text" : "Dude, our boy is wicked smart.",
    "timestamp" : "01:30:42-01:30:43",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:30:44-01:30:47",
    "speaker" : "Andy",
    "text" : "Blaine Gabbard scored a 42? Yeah, I saw that one."
  },
  {
    "text" : "I didn't bring it up because It didn't fit my narrative.",
    "timestamp" : "01:30:47-01:30:51",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:30:51-01:31:00",
    "text" : "Give me uh Brandon Whedon. Remember the old Cleveland guy? Yeah. I bet they're like, well, he's he's older, but he's got a really high Wonderling score.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:31:01-01:31:09",
    "text" : "27. No, never mind. Josh McCown 30. Andy Dalton 29. In case you were wondering. I wasn't.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Gronkowski got a 32",
    "timestamp" : "01:31:09-01:31:11"
  },
  {
    "text" : "Is that better than you, Greg? Wait, that he had somebody take that foot.",
    "speaker" : "Andy",
    "timestamp" : "01:31:12-01:31:17"
  },
  {
    "speaker" : "Greg",
    "text" : "What about Hernandez? Ooh, that's a good one, Steve.",
    "timestamp" : "01:31:17-01:31:21"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:31:22-01:31:23",
    "text" : "Guesses?"
  },
  {
    "text" : "I think his is probably pretty bad.",
    "timestamp" : "01:31:24-01:31:26",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:31:26-01:31:32",
    "text" : "I'm gonna say less than twenty. I'm saying he's just like super smart psychopath. No, less than twenty. Beat Gronk. He's a",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I didn't see anything for it.",
    "timestamp" : "01:31:33-01:31:34"
  },
  {
    "text" : "He definitely went to the combine. Aaron Hernandez Wonderling.",
    "timestamp" : "01:31:35-01:31:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:31:39-01:31:43",
    "text" : "Oh, 17. I nailed it."
  },
  {
    "timestamp" : "01:31:43-01:31:44",
    "speaker" : "Steve",
    "text" : "Yeah. All right."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh man, we're just we're just gonna do this, huh?",
    "timestamp" : "01:31:47-01:31:49"
  },
  {
    "text" : "We already heard Gray Lewis.",
    "timestamp" : "01:31:50-01:31:51",
    "speaker" : "Steve"
  },
  {
    "text" : "Tyree Kill, Wonder Lake, 27.",
    "timestamp" : "01:31:52-01:31:54",
    "speaker" : "Andy"
  },
  {
    "text" : "Not bad. Not bad. Who just like comes off as wicked dumb?",
    "timestamp" : "01:31:55-01:32:00",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:32:02-01:32:07",
    "speaker" : "Andy",
    "text" : "I mean, take your pick. Well, what about Cam Newton, do you think? Higher or lower than Brady?"
  },
  {
    "timestamp" : "01:32:09-01:32:11",
    "speaker" : "Greg",
    "text" : "Slightly lower. I'm saying high 20s."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:32:12-01:32:17",
    "text" : "Low is Brady? 32. Give me 33 plus one."
  },
  {
    "speaker" : "Andy",
    "text" : "21. 21. Which is below the NFL quarterback average of 26. Who's who's a fucking idiot?",
    "timestamp" : "01:32:17-01:32:25"
  },
  {
    "timestamp" : "01:32:25-01:32:28",
    "text" : "What about Terrell Owens? That'll be an interesting one.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:32:29-01:32:31",
    "text" : "Tyrell. No.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:32:32-01:32:34",
    "text" : "What? This is easy yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:32:34-01:32:35",
    "speaker" : "Andy",
    "text" : "Uh give us a guess."
  },
  {
    "speaker" : "Greg",
    "text" : "See this could go either way. Right. It's either really high or really low. I'm going really low, like at twelve. Half.",
    "timestamp" : "01:32:36-01:32:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Lower.",
    "timestamp" : "01:32:44-01:32:45"
  },
  {
    "text" : "Lower?",
    "timestamp" : "01:32:45-01:32:46",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:32:47-01:32:48",
    "speaker" : "Andy",
    "text" : "By half."
  },
  {
    "timestamp" : "01:32:48-01:32:48",
    "speaker" : "Greg",
    "text" : "Six?"
  },
  {
    "text" : "What this says.",
    "speaker" : "Brian Morrey",
    "timestamp" : "01:32:49-01:32:50"
  },
  {
    "text" : "Wow. What about Jerry Rice?",
    "timestamp" : "01:32:52-01:32:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "See, cause he strikes me as someone that would be like, this thing is stupid, I'm not doing it, you know?",
    "timestamp" : "01:32:56-01:33:00"
  },
  {
    "speaker" : "Andy",
    "text" : "Yikes. Jerry Rice 15.",
    "timestamp" : "01:33:01-01:33:04"
  },
  {
    "timestamp" : "01:33:05-01:33:06",
    "text" : "Dude, we could do this all day.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:33:07-01:33:15",
    "speaker" : "Steve",
    "text" : "You should just go down the list of the what's your list, Greg, where you all the guys are the bunch of babies Oh yeah yeah yeah what's that Hall of Fame call?"
  },
  {
    "speaker" : "Andy",
    "text" : "The Breeder Hall of Fame probably.",
    "timestamp" : "01:33:15-01:33:16"
  },
  {
    "text" : "Yeah, I don't think I had a I don't think I had a",
    "timestamp" : "01:33:18-01:33:21",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, we we should put the uh the wonder scores next to those and and do like uh a power ranking where it's kids times wonderlich score. That's a good point.",
    "speaker" : "Andy",
    "timestamp" : "01:33:21-01:33:29"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:33:30-01:33:34",
    "text" : "Your power rank because clearly wonder's size of your dick correlation."
  },
  {
    "text" : "Oh yeah, yo, we should do a scientific mathematical deep dive into This is Andy's way of trying to go measure Drew Budso's dick.",
    "speaker" : "Andy",
    "timestamp" : "01:33:35-01:33:42"
  },
  {
    "timestamp" : "01:33:42-01:33:46",
    "speaker" : "Steve",
    "text" : "Hello, Drew. Yeah, that's for science project I'm doing."
  },
  {
    "timestamp" : "01:33:48-01:33:54",
    "speaker" : "Greg",
    "text" : "It's a science project. It is fascinating though."
  },
  {
    "text" : "It was.",
    "timestamp" : "01:33:54-01:33:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:33:55-01:33:56",
    "text" : "Poor Vince Young."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:33:56-01:34:08",
    "text" : "Yeah, he had a he had a rough go. of it just yeah just feel bad for him yeah all right should we talk you want to do best and worse in this game I mean there's not much happened outside of those two quarters"
  },
  {
    "timestamp" : "01:34:08-01:34:14",
    "speaker" : "Greg",
    "text" : "Sure, you want to give them a quick uh recap of the game though from start to finish? Because I don't think we said the final score."
  },
  {
    "speaker" : "Steve",
    "text" : "That's a good point.",
    "timestamp" : "01:34:14-01:34:15"
  },
  {
    "speaker" : "Andy",
    "text" : "Final score 27-17, your New England Patriots. thanks to a garbage time Bills touchdown, which I thought mirrored the last Bills drive in the the time when we played him in Buffalo where they drove they drove from like they they drove from their own twelve, drove all the way down the field and started like chucking it in the end zone and it looked like they weren't gonna get a touchdown out of it anyway. But this time they did even though it didn't matter.",
    "timestamp" : "01:34:15-01:34:40"
  },
  {
    "timestamp" : "01:34:40-01:34:49",
    "speaker" : "Steve",
    "text" : "And they were like, Drew Butts already had four pecs. The commentators like, whoa, I don't know about this. Maybe you should just not sling it. But come on. It is Drew fucking blood cell. You know."
  },
  {
    "text" : "Drew Blood cell.",
    "timestamp" : "01:34:49-01:34:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:34:50-01:34:50"
  },
  {
    "timestamp" : "01:34:50-01:34:57",
    "speaker" : "Andy",
    "text" : "You know it's coming. Oh yeah. So and Mold's made this like Circus one-handed ridiculous spinning catch too."
  },
  {
    "speaker" : "Steve",
    "text" : "Their other touchdown was a clear OPI. Yeah. The commentators were like, we're 100 yards away and we can even see the fans are right. Yeah. It was But yeah, we go up 17-0 immediately. Yeah. The Bills get that one touchdown and kind of turns around. So it's what 17-7 at one point, I believe.",
    "timestamp" : "01:34:57-01:35:17"
  },
  {
    "text" : "Or 20. No, they they didn't score until the second half.",
    "speaker" : "Andy",
    "timestamp" : "01:35:17-01:35:21"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but it was like 20 to 7. The Bills had some good momentum. Yeah. Another field goal, 2010. At that point you're like, okay.",
    "timestamp" : "01:35:21-01:35:27"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:35:27-01:35:58",
    "text" : "Yeah, and then and then the the Patriots tried to like do the backbreaker thing where they tried to end around. But it was too uh Daniel Graham, I think, was the guy running the end around and he fumbled it. Uh so they ended up going three and out on that. And so you're like, ah fuck, this you can feel the shift happening. Um but then PL's price fumbles. like first play of the drive and then the pages score a touchdown Antoine Smith and then from there Bloodside just starts throwing it"
  },
  {
    "timestamp" : "01:35:59-01:36:05",
    "speaker" : "Steve",
    "text" : "Where was that um whatever it's called? The Philly special calling it now?"
  },
  {
    "text" : "Oh yes. So that was gonna be I was right at the end of this second quarter.",
    "timestamp" : "01:36:05-01:36:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:36:11-01:36:15",
    "text" : "And more we'll put this in the the show notes. Did you see this, Greg? This play?",
    "speaker" : "Steve"
  },
  {
    "text" : "I don't think so.",
    "timestamp" : "01:36:15-01:36:16",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:36:17-01:36:25",
    "text" : "So they had two touchdowns. By the by the end of the first half, they'd had two touchdowns called back on penalty. So it could have been instead of 17.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:36:25-01:36:59",
    "text" : "Both uh both of them were called back on Kevin Falk. He scored two touchdowns in this game and uh one was a running touchdown where he just like ran it untouched from the Dion branch when we got hurt. Well then they had three touchdowns called back because I remember towards the end of the game, yeah, Falk had a TV call back. It was like a long touchdown run where he got on touch, but it was called back for holding, and it was like a bullshit call. Um but this one, Greg. Uh was called back. And I mean you remember this play working?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:36:59-01:37:03",
    "text" : "Uh because they've tried it in other Oh yes, I did see this."
  },
  {
    "timestamp" : "01:37:03-01:37:21",
    "speaker" : "Andy",
    "text" : "So it's basically If you guys remember from the Dolphins, I don't know if it's happened yet. Have we talked about it? The where Kevin Falk takes a direct snap. Uh Brady out of the shotgun and runs to his right and then does a throwback to Brady. In this case scores a touchdown."
  },
  {
    "text" : "And this is this would have been Brady's first and only ever received. He never caught one. And uh they that was such a bullshit call. They said Brady was moving at the snap.",
    "speaker" : "Steve",
    "timestamp" : "01:37:21-01:37:33"
  },
  {
    "text" : "No, they said Falk was moving at the snap, which I mean it's fine because he was moving sideways though, so it should technically have been",
    "speaker" : "Andy",
    "timestamp" : "01:37:34-01:37:41"
  },
  {
    "speaker" : "Steve",
    "text" : "Either way.",
    "timestamp" : "01:37:43-01:37:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Shift, but yeah. So yeah, it was it was a bullshit callback, but it was the exact same play that they ran against Miami where it worked. Which I think we've already seen. Yeah, because Brady talked about turning uh uh uh a touchdown into a forty yard game or something like that. Uh but this is the exact same play and it worked perfectly, but they got called back, which was bullshit. So that's my best hand worker.",
    "timestamp" : "01:37:44-01:38:06"
  },
  {
    "timestamp" : "01:38:07-01:38:15",
    "text" : "My horse is Bernie not dancing in the end zone a little bit more, you know. He was he was clear. I think he saw it. Yeah, you should have.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:38:15-01:38:17",
    "speaker" : "Andy",
    "text" : "Yeah, you feel like young Brady would do that back in those days."
  },
  {
    "timestamp" : "01:38:17-01:38:26",
    "speaker" : "Steve",
    "text" : "He he was more fired up than he is. No celebrating in Tampa. Bruce Arians, little hard ass. Brady loves getting yelled at by him. We'll find out"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so that was brutal. And the other two touchdowns that were called back also brutal. But it was like But at the end of the day, the page is still one.",
    "timestamp" : "01:38:28-01:38:34"
  },
  {
    "speaker" : "Steve",
    "text" : "There's a bunch of missed opportunities, but it was 20 to 10 at one point and the Bills definitely had momentum. Yeah. And then they just kind of stuff started throwing picks. Eric started dropping the ball and they just kind of shot themselves in the foot. Yep. Yeah, we're gonna end up running touchdown to close it out. Yeah.",
    "timestamp" : "01:38:34-01:38:50"
  },
  {
    "timestamp" : "01:38:50-01:39:18",
    "text" : "There's a classic blood cell interception in there too, where he's like in the grasp and he just like chucks it into traffic and it's like, oh boy. Yeah in the middle of the middle of the field. Never gonna work, but desperation play. Yeah. So I I was looking at the like uh box score And that last drive that started on their own twelve, uh, that ended in the touchdown to molds.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yep.",
    "speaker" : "Andy",
    "timestamp" : "01:39:18-01:39:18"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:39:19-01:39:23",
    "text" : "He Bledsoe attempted 15 passes in that one drive."
  },
  {
    "text" : "Oh he did. In a row. One, two, three, four, five.",
    "timestamp" : "01:39:23-01:39:27",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:39:28-01:39:31",
    "speaker" : "Greg",
    "text" : "There's a couple like quarterback runs though."
  },
  {
    "timestamp" : "01:39:33-01:39:38",
    "speaker" : "Andy",
    "text" : "Uh no. Oh yeah, those one, yeah. Drew blood cell middle for ten yards."
  },
  {
    "text" : "Yeah. Left guard for one yard.",
    "speaker" : "Greg",
    "timestamp" : "01:39:39-01:39:42"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:39:42-01:40:05",
    "text" : "That's amazing. Yeah. You're just putting the team on his back, baby. I mean that's what he but apparently the week before he had done something similar. But that's what I'm saying. He's like he sees the the new family's house that looks really nice, and then he goes back to the house and Orchard Park and was like, man, this is just like my old house. It's true."
  },
  {
    "timestamp" : "01:40:06-01:40:38",
    "text" : "Yeah. But I mean last week, who was they who oh he played uh they played the Dolphins and they beat the Dolphins, right? Um and it was in in Buffalo in the snow and he threw 177 of his 306 yards uh on his last three completions were all just like huge plays that that like went for touchdowns and that's what won the game. Fuck ridiculous. The dude can throw a football. I'll still give him that. Not always for his own team, but uh",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That's all that matters.",
    "timestamp" : "01:40:39-01:40:40"
  },
  {
    "text" : "Yeah. Also something interesting that they showed a stat on the field, or on the field, Jesus, on the screen, was after 12 games in 2001, the Patriots are almost exactly the same spot. as they were this year. And yet somehow they didn't win the Super Bowl.",
    "timestamp" : "01:40:40-01:40:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Hmm.",
    "timestamp" : "01:41:00-01:41:00"
  },
  {
    "text" : "Alright, wanna wrap this baby up?",
    "timestamp" : "01:41:01-01:41:02",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:41:02-01:41:11",
    "text" : "Let's wrap this up. Alright. Well give me your best and worst, Greg. My best and worst, sure. Uh my best",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:41:12-01:41:16",
    "text" : "Is Yoshi game once."
  },
  {
    "text" : "I think I already used them all. I mean, Drew Bledsoe's performance could probably be both best and worst.",
    "timestamp" : "01:41:19-01:41:26",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:41:27-01:41:27",
    "text" : "I agree."
  },
  {
    "text" : "You know, 50 pass attempts, 300 yards, four picks, two touchdowns, two sacks thrown in there too. It's just The most bledsoe stat line you could ever imagine.",
    "timestamp" : "01:41:27-01:41:38",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:41:38-01:41:41",
    "speaker" : "Andy",
    "text" : "And the and the even the interceptions were very bled so-esque."
  },
  {
    "timestamp" : "01:41:42-01:41:45",
    "speaker" : "Greg",
    "text" : "Yeah. Yep. It was a very fitting return."
  },
  {
    "speaker" : "Andy",
    "text" : "It was. Exactly what you want.",
    "timestamp" : "01:41:45-01:41:46"
  },
  {
    "speaker" : "Steve",
    "text" : "Steve? Uh, all right. My I don't know if this is the best or a worst, but the Patriots punted from the Bills 30. They did like late in the game.",
    "timestamp" : "01:41:46-01:41:57"
  },
  {
    "speaker" : "Greg",
    "text" : "Fucking Belichick, dude. He s he sucks.",
    "timestamp" : "01:41:57-01:42:02"
  },
  {
    "speaker" : "Andy",
    "text" : "That was after the Fault touchdown I got called back. Yeah. Yeah. And so there's instead of like even because they Vinateri missed a field goal from about the same spot. The last drive. So he's like, fuck it, we're punting.",
    "timestamp" : "01:42:04-01:42:14"
  },
  {
    "speaker" : "Steve",
    "text" : "But from the 30. Yeah. You get roasted in today's social media work.",
    "timestamp" : "01:42:14-01:42:18"
  },
  {
    "timestamp" : "01:42:18-01:42:22",
    "speaker" : "Andy",
    "text" : "47-yard field goal into the winds wasn't happening."
  },
  {
    "timestamp" : "01:42:22-01:42:45",
    "speaker" : "Steve",
    "text" : "And then I don't know if this is the best or the worst, but the commentators are talking about how uh Chucky, John Gruden, used to be a ball boy at Indiana. For uh what's the famous coach there? The Colts? No Bob Knight. Yeah, Bob Knight. Oh really? John Gruned as a little kid, Bob Bob Knight's ball boy."
  },
  {
    "text" : "God. Oh my god. Oh that's a good thing.",
    "timestamp" : "01:42:46-01:42:50",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:42:50-01:42:53",
    "speaker" : "Greg",
    "text" : "Dude, do you think there's a picture on the internet of that? Probably, right?"
  },
  {
    "text" : "I think you're gonna find it if there is.",
    "speaker" : "Andy",
    "timestamp" : "01:42:54-01:42:56"
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "Andy Reid takes the picture on the internet.",
    "timestamp" : "01:42:57-01:42:59"
  },
  {
    "text" : "Yeah, it's like it's like is he like breaking down film to like, oh my god, this guy's so good at the basketball.",
    "timestamp" : "01:42:59-01:43:05",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't think Chucky breaks down film. Doesn't Chucky's that kind of dude.",
    "timestamp" : "01:43:05-01:43:10"
  },
  {
    "speaker" : "Steve",
    "text" : "You've never seen QB camp, buddy. Everybody steps in there is the best ever. Y C Grand.",
    "timestamp" : "01:43:10-01:43:17"
  },
  {
    "text" : "That's right.",
    "speaker" : "Andy",
    "timestamp" : "01:43:17-01:43:18"
  },
  {
    "timestamp" : "01:43:19-01:43:23",
    "text" : "Spider. Left Y. I don't know.",
    "speaker" : "Steve"
  },
  {
    "text" : "No, the whole person's not on the wonder line. Name display long",
    "speaker" : "Andy",
    "timestamp" : "01:43:25-01:43:31"
  },
  {
    "speaker" : "Greg",
    "text" : "Another best Ty Law had a pick in this game, right?",
    "timestamp" : "01:43:33-01:43:36"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:43:36-01:43:37",
    "text" : "Yeah, he did."
  },
  {
    "timestamp" : "01:43:37-01:43:44",
    "speaker" : "Greg",
    "text" : "Yeah. I'm gonna have to call out Ty Law every time he makes an interception, just so people realize how frequent it actually is."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:43:44-01:43:45",
    "text" : "It it does come up a lot."
  },
  {
    "text" : "It's really like every other game Tyla's getting a pick.",
    "timestamp" : "01:43:46-01:43:48",
    "speaker" : "Greg"
  },
  {
    "text" : "We also call out Troy Brown stat line for every game.",
    "timestamp" : "01:43:48-01:43:50",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:43:51-01:44:12",
    "text" : "I was just about to say that exactly if you're calling out Ty Long, call out Troy Brown, because he was breaking ankles in this game. Those quick bubble screens to him. Oh yeah. And he's just one over the quarterback. And you can just feel the fear radiating off that quarterback. Yeah, well he broke this guy's ankles all over. It looked like he was gonna like cut inside and he just like jumped outside the guy and he just literally fell over. It was amazing."
  },
  {
    "text" : "Oh is that one of his three catches for 27 yards? Sick. No, I'm just saying like we don't gotta we don't gotta wash his balls every game, you know?",
    "timestamp" : "01:44:13-01:44:25",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:44:25-01:44:28",
    "text" : "Yes we do. What the fuck podcast do you think this is?"
  },
  {
    "text" : "I mean Tyler Law but Troy Brown no You also forgot to mention uh his one carry for twenty-one yards. Thank you very much.",
    "timestamp" : "01:44:28-01:44:34",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yes, I got that up.",
    "timestamp" : "01:44:35-01:44:37"
  },
  {
    "speaker" : "Andy",
    "text" : "How many yards does Ty Law have?",
    "timestamp" : "01:44:37-01:44:38"
  },
  {
    "speaker" : "Greg",
    "text" : "It doesn't fit doesn't fit my narrative. Peerless price. Peerless actual retail price had a good game. Nine for 105.",
    "timestamp" : "01:44:39-01:44:50"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, well, yeah, how many of that came in garbage time? There were those were all the completions in of the 15 that uh Blood Cells through in the fourth quarter.",
    "timestamp" : "01:44:51-01:44:59"
  },
  {
    "text" : "No, you had that one and I was Molds with that OPI touchdown. I think Mold's had both touchdowns.",
    "speaker" : "Steve",
    "timestamp" : "01:44:59-01:45:03"
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, Ruben Brown, did they have an offensive lineman catch a pass in this game?",
    "timestamp" : "01:45:04-01:45:08"
  },
  {
    "speaker" : "Steve",
    "text" : "No, it must be a bat of ball or something.",
    "timestamp" : "01:45:09-01:45:11"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:45:12-01:45:27",
    "text" : "One reception for negative six yards. Reuben Brown, the guard. Yeah. That's our cousin, baby. It's worth watching the game probably to see that play. Fat guy with a ball on his hands. Fucking love that stuff."
  },
  {
    "speaker" : "Brian Morrey",
    "text" : "That's never a bad thing.",
    "timestamp" : "01:45:28-01:45:29"
  },
  {
    "timestamp" : "01:45:30-01:45:37",
    "speaker" : "Andy",
    "text" : "Yeah. Alright, boys. We'll see if any of these are correct next week on the Pages Dynasty Podcast."
  },
  {
    "speaker" : "Mom",
    "text" : "See you later.",
    "timestamp" : "01:45:38-01:45:38"
  }
]