[
  {
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:21-00:25",
    "text" : "Alright. Welcome. Shut up."
  },
  {
    "text" : "All right.",
    "speaker" : "Greg",
    "timestamp" : "00:28-00:28"
  },
  {
    "text" : "Uh welcome back to the dregs of the 2002 season on the Patriots Dynasty podcast.",
    "timestamp" : "00:29-00:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Dog days of summer.",
    "timestamp" : "00:36-00:38"
  },
  {
    "text" : "Yeah. Literally and figuratively, I think. Yep. Struggling through the longest losing streak of the Patriots dynasty. This is 2002 week eight hosting the Denver Broncos. Uh duders want to get it out the way. They don't win this one either. That's the fucking Broncos back in the early 2000s. It's kind of a given. I mean Lombardi's five oh that's what you're rate in this game that you didn't watch? Five out of six.",
    "timestamp" : "00:38-01:13",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:14-01:16",
    "text" : "I asked you how many Lobardies.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:16-01:26",
    "text" : "Oh I thought you said five Lobardies. No, I didn't watch it. No kidding. Two? I'm gonna go two. You're gonna give it that many?",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I mean not the worst one of their losing streak, but certainly not particularly entertaining.",
    "timestamp" : "01:27-01:34",
    "speaker" : "Steve"
  },
  {
    "text" : "Well what one what one's been worse than this in this losing streak? That's a good question. Because I'm about to give this a one unless it explains me otherwise. I wouldn't watch this again. The only the only reason it's getting a one is because they wore their all blues again. The Miami one was way worse.",
    "timestamp" : "01:35-01:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:59-02:07",
    "text" : "Where um Jason Taylor just absolutely dominated us and we had absolutely nothing. We had ten yards passing in the first half."
  },
  {
    "speaker" : "Andy",
    "text" : "You bring up a valid point. I wonder what we rated that one. Zero? That one might have got a one, yeah. We're not writing this down.",
    "timestamp" : "02:08-02:14"
  },
  {
    "speaker" : "Steve",
    "text" : "This is a little peg above that, but yeah. No, I'm gonna be one and a half.",
    "timestamp" : "02:14-02:20"
  },
  {
    "speaker" : "Greg",
    "text" : "No, Steve gave it a zero because I remember it was the first ever rating we did and he went as low as as possible on the rating scale. And I was like, dude, that's not how you're supposed to rate things.",
    "timestamp" : "02:20-02:31"
  },
  {
    "text" : "So we may have given that one a one then. So this is probably like a one and a half. I'll give it a two. I'll give it a one and then just the like not the ball of the Lombardi, but like just the the stub of it. Oh yeah, okay. Yeah. Like one not quite one and a half, but one and the the bad half.",
    "timestamp" : "02:31-02:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I'll do the opposite, where I'll do one and the ball.",
    "timestamp" : "02:50-02:52"
  },
  {
    "timestamp" : "02:53-02:55",
    "text" : "All right. But not all the way.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "But not the stop.",
    "timestamp" : "02:55-02:56"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:58-03:07",
    "text" : "Alright. Uh so yeah, the at the end of this game. Uh it was probably closer than it should have been. Broncos twenty-four, Patriots sixteen."
  },
  {
    "timestamp" : "03:08-03:11",
    "text" : "See, I like at least we kind of kept fighting the whole game.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:12-04:07",
    "speaker" : "Andy",
    "text" : "They did like rolled over in Miami. Although um there were some comments in the Globe the next day from Brady. Um After yesterday's loss to the Broncos, New England's fourth straight, young Brady issued some challenges to his teammates. Quote, I like the guys in this room. Don't get me wrong, said the 25-year-old quarterback. But it might need to be a little more important to them. You look at these last four games, you see the other guys playing like it really means something. We've got to figure out how much this means to people. You and it's continued on the other page. Got to play like your life is on the line. Maybe guys aren't playing like it's their livelihood. Certain guys play like that every play. They try to make their mark This is his like first full season as a starter, twenty-five years old, calling out teammates like that?"
  },
  {
    "timestamp" : "04:07-04:11",
    "speaker" : "Steve",
    "text" : "I think it's a different media world back then though."
  },
  {
    "timestamp" : "04:11-04:12",
    "speaker" : "Andy",
    "text" : "Maybe."
  },
  {
    "timestamp" : "04:12-04:21",
    "speaker" : "Steve",
    "text" : "He says that now. Whew! That's going on. The talk radio, Skip Bayliss, and Shannon Sharp are just gonna shout out each other about it. For the next two weeks."
  },
  {
    "text" : "Shannon Sharp, speak of the devil.",
    "timestamp" : "04:21-04:23",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yes, he is in this game. Correct, yeah. He actually played really well.",
    "timestamp" : "04:23-04:27"
  },
  {
    "text" : "Yeah, look how far he's fallen to his current state. Why do you think because he went from respected football player to like an absolute clown show?",
    "timestamp" : "04:27-04:40",
    "speaker" : "Greg"
  },
  {
    "text" : "He is the worst like halftime show guy. You can't understand him.",
    "timestamp" : "04:40-04:45",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "04:45-04:45",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "04:45-04:48",
    "speaker" : "Andy",
    "text" : "That whole halftime is just them all yelling over each other."
  },
  {
    "text" : "Well he's with he's with Skip Bayless now, right? Oh yeah. And that that's the worst combination of personalities in all the sports.",
    "timestamp" : "04:49-04:57",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I've never seen it, honestly.",
    "timestamp" : "04:57-04:59"
  },
  {
    "speaker" : "Steve",
    "text" : "Do yourself a favor, keep it that way.",
    "timestamp" : "05:00-05:01"
  },
  {
    "speaker" : "Greg",
    "text" : "Me either. I'm gonna go out and say I like Colin Cowherd though.",
    "timestamp" : "05:02-05:08"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "05:08-05:09",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yep.",
    "timestamp" : "05:09-05:09"
  },
  {
    "text" : "Yeah, you said that in the last episode.",
    "timestamp" : "05:10-05:12",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "05:12-05:18",
    "speaker" : "Greg",
    "text" : "Give him another try. I know he's kind of a fire flames hot take guy, but give him another try."
  },
  {
    "text" : "I don't like any of them. Rodney Harrison's it. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "05:18-05:23"
  },
  {
    "timestamp" : "05:23-05:25",
    "text" : "Mike Florio.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "He doesn't really have any takes. He's just like, here's the facts.",
    "timestamp" : "05:26-05:29"
  },
  {
    "text" : "He's a nerd.",
    "timestamp" : "05:30-05:31",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. You can throw Mike Reese in there too. Mike Reese is like very much a Here's a well-reasoned take. Well that's not gonna get you clicks, is it?",
    "timestamp" : "05:31-05:42"
  },
  {
    "speaker" : "Andy",
    "text" : "No quick, Greg, quick, give us a hot take.",
    "timestamp" : "05:42-05:45"
  },
  {
    "timestamp" : "05:46-05:55",
    "speaker" : "Greg",
    "text" : "On I just did anything. I don't care. I just said Shannon Sharp is the worst analyst in all the sports. It's a pretty hot take. All right."
  },
  {
    "speaker" : "Andy",
    "text" : "I can clip that. We'll we'll put that on Twitter. We'll tag him in it too. See what he says.",
    "timestamp" : "05:55-06:02"
  },
  {
    "text" : "He'd be like, what the fuck? This goddamn podcast call me out I'm gonna destroy them.",
    "timestamp" : "06:03-06:09",
    "speaker" : "Steve"
  },
  {
    "text" : "That would probably be the best thing that ever happened to us, you really.",
    "timestamp" : "06:09-06:12",
    "speaker" : "Andy"
  },
  {
    "text" : "Because then Troy Brad would know who we are and my life would be complete.",
    "timestamp" : "06:13-06:17",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's true. Yeah, you want to do your your weekly call out now at this point? If anybody knows Troy Brown to introduce him to this podcast, so you can die out.",
    "timestamp" : "06:18-06:26"
  },
  {
    "speaker" : "Steve",
    "text" : "Please. That would be amazing.",
    "timestamp" : "06:27-06:29"
  },
  {
    "speaker" : "Andy",
    "text" : "All right, so that segment's over with what's next.",
    "timestamp" : "06:30-06:32"
  },
  {
    "text" : "Remember uh for Christmas, my girlfriend got me a Malcolm Brown jersey because she knew I loved the Troy Brown. And Malcolm Brown was on the Patriots and she just like looked it up and said, Oh Brown. Wait, really? Yeah, I have a Malcolm Brown jersey sitting in my closet.",
    "timestamp" : "06:32-06:49",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That's a pretty deep cut. That's I mean that's pretty legit if you were to wear that out, but great idea, poor execution.",
    "timestamp" : "06:50-06:55"
  },
  {
    "timestamp" : "06:56-06:57",
    "speaker" : "Steve",
    "text" : "Yes, I agree."
  },
  {
    "timestamp" : "06:59-07:02",
    "speaker" : "Andy",
    "text" : "Is that why you're not together anymore? Mm-hmm."
  },
  {
    "text" : "You don't know me. Really, you thought you knew me, but you don't. You everybody who loves me knows how much I love Troy Brown because of package deal.",
    "timestamp" : "07:03-07:15",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean that's fair.",
    "timestamp" : "07:15-07:16"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, except for her.",
    "timestamp" : "07:19-07:20"
  },
  {
    "timestamp" : "07:28-07:32",
    "text" : "I mean we could talk about this game if you wanted. Yeah. Do you want to talk about the Broncos?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "They had an awesome skill position group.",
    "timestamp" : "07:34-07:37"
  },
  {
    "text" : "Yeah, Greg, you got any thoughts on this skill position group?",
    "timestamp" : "07:38-07:41",
    "speaker" : "Andy"
  },
  {
    "text" : "Well busy watching like the nineteen ninety-eight highlights instead of this game, but the nineteen ninety-six was a stacked roster for Denver.",
    "timestamp" : "07:41-07:51",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:53-07:54",
    "text" : "Let's hear it."
  },
  {
    "speaker" : "Greg",
    "text" : "Well, they won the Super Bowl that year, right?",
    "timestamp" : "07:54-07:56"
  },
  {
    "text" : "Super relevant. Was that ninety six? Yeah, probably.",
    "timestamp" : "07:56-07:59",
    "speaker" : "Andy"
  },
  {
    "text" : "This is the Mike Shanahan error. This is this is like right in the midst of it, yeah. Yeah. He was ninety-five to two thousand and eight is Mike Shanahan? Something like that. Do you think he's a good coach, Andy? Yeah. Okay. Good. I also have a winning record against uh",
    "timestamp" : "08:00-08:17",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "08:18-08:19",
    "speaker" : "Andy",
    "text" : "Beltrex Barriches."
  },
  {
    "timestamp" : "08:19-08:21",
    "speaker" : "Greg",
    "text" : "Did he see he's an excellent coach?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. The commentators are saying that him and Brian Greasy don't talk at all.",
    "timestamp" : "08:22-08:26"
  },
  {
    "timestamp" : "08:27-08:32",
    "speaker" : "Andy",
    "text" : "Is that what they were saying? Because I missed like what they were talking about. I thought they were just talking about other coaches."
  },
  {
    "timestamp" : "08:32-08:38",
    "speaker" : "Steve",
    "text" : "No, they were talking about Greasy and Shanahan don't talk and all goes through Kubiak. Who was the OC at the time?"
  },
  {
    "text" : "Oh, that makes more sense because I missed who they were talking about.",
    "speaker" : "Andy",
    "timestamp" : "08:38-08:41"
  },
  {
    "text" : "Which I mean it doesn't make any sense. Not even pleasantries? No. Yeah, he's cool. He's like that. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "08:41-08:51"
  },
  {
    "speaker" : "Greg",
    "text" : "That's very Nazi Germany, you know? Like follow your command, you know?",
    "timestamp" : "08:51-08:58"
  },
  {
    "text" : "I don't know if that's a Nazi Germany thing.",
    "timestamp" : "09:01-09:03",
    "speaker" : "Steve"
  },
  {
    "text" : "It's more like a General military thing perhaps.",
    "timestamp" : "09:03-09:06",
    "speaker" : "Andy"
  },
  {
    "text" : "What are you saying? All military is equivalent of Nazis, Andy? That's pretty suspicious. Speaking of hot takes. Yeah. God. What do you think of our defense budget in the United States, Andy?",
    "timestamp" : "09:06-09:21",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "09:24-09:30",
    "text" : "The Broncos defense wasn't nearly as good. The only guy that I really recognized was Delta O'Neill.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "09:30-09:32",
    "speaker" : "Greg",
    "text" : "Delpha. Delpha."
  },
  {
    "speaker" : "Steve",
    "text" : "What an amazing thing. Oh Al Wilson or John Mobley?",
    "timestamp" : "09:32-09:34"
  },
  {
    "text" : "Delpha.",
    "speaker" : "Greg",
    "timestamp" : "09:35-09:35"
  },
  {
    "timestamp" : "09:35-09:41",
    "text" : "Trevor Price? Come on. Trevor Burrus. You were never like awesome though, you know? Trevor Prix.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "What about Mark Atwater?",
    "timestamp" : "09:41-09:43"
  },
  {
    "timestamp" : "09:43-09:46",
    "text" : "He wasn't on that defense, Greg. Fuck Greg.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "09:47-09:52",
    "speaker" : "Greg",
    "text" : "Sorry, I was watching the 1996. John Alaway?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "09:52-09:57",
    "text" : "Did you did you actually watch this highlights at all, Greg? Because you missed the sweet tie law, interception."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Wait, interception or fumble recovery?",
    "timestamp" : "09:57-10:01"
  },
  {
    "timestamp" : "10:01-10:01",
    "text" : "Yes.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I and T.",
    "timestamp" : "10:02-10:02"
  },
  {
    "text" : "Both? Yeah, yeah, both.",
    "speaker" : "Steve",
    "timestamp" : "10:03-10:05"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh the the prime time on uh YouTube is only two minutes and thirty seconds. That's not very long. Of which like 45 seconds is I'm talking about the game. So I didn't see many plays, no, to answer your question. Did you have the whole thing? Yeah, of course. Did I watch it all two and a half minutes? Yes.",
    "timestamp" : "10:05-10:23"
  },
  {
    "text" : "How dare I question your track record?",
    "timestamp" : "10:26-10:28",
    "speaker" : "Andy"
  },
  {
    "text" : "Um I'm also on ProFootballreference. com. Shout out ProFootball Reference.",
    "timestamp" : "10:31-10:36",
    "speaker" : "Greg"
  },
  {
    "text" : "Hell yeah.",
    "speaker" : "Andy",
    "timestamp" : "10:36-10:36"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:37-10:38",
    "text" : "It's a sweet site."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "10:38-10:42",
    "text" : "It's the best site in the world. We wouldn't have nearly as much to talk about, I don't think."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "10:43-10:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Between that and Wikipedia.",
    "timestamp" : "10:43-10:44"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "10:45-10:48",
    "text" : "For the stat check guides is the key."
  },
  {
    "speaker" : "Greg",
    "text" : "I wish we had. We want to talk about Mike Shanahan's like stretch here.",
    "timestamp" : "10:48-10:52"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "10:52-10:52"
  },
  {
    "timestamp" : "10:53-11:03",
    "speaker" : "Greg",
    "text" : "So 95, he's his first year as the head coach. Uh ninety-seven and ninety-eight he he wins back to back Super Bowls. Right."
  },
  {
    "speaker" : "Steve",
    "text" : "By sort of the salary cap, right?",
    "timestamp" : "11:03-11:06"
  },
  {
    "text" : "I don't know.",
    "timestamp" : "11:07-11:08",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "11:08-11:11",
    "text" : "So John L would retire right after that one. Right.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "11:11-11:21",
    "speaker" : "Greg",
    "text" : "He only has one losing season until 2007. So 12 years he has one losing season. That's he's a pretty damn good coach."
  },
  {
    "text" : "Yeah, especially with uh LA retiring. Mm-hmm. That's a tough transition. And he had fucking greasy as quick.",
    "timestamp" : "11:22-11:28",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "11:28-11:36",
    "text" : "That was the only year was af 1999. Coming off a Super Bowl championship, they lost they were six and ten.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "11:37-11:38",
    "text" : "Yeah, yeah, that happens.",
    "speaker" : "Andy"
  },
  {
    "text" : "So I guess that's the floor for the Patriots this year.",
    "speaker" : "Steve",
    "timestamp" : "11:38-11:40"
  },
  {
    "timestamp" : "11:40-12:02",
    "speaker" : "Andy",
    "text" : "I wonder because they they um Set a stat in this game. It was what I wrote it down. The last Super Bowl champion to lose four straight games the next season was the Denver Broncos. So I'm wondering if it was that season. That would make sense. Yeah, if you're going six and ten, you probably lost a bunch in a row."
  },
  {
    "speaker" : "Greg",
    "text" : "And Mike Shanahan's record with running backs is just like hilarious.",
    "timestamp" : "12:05-12:10"
  },
  {
    "text" : "Oh yeah.",
    "timestamp" : "12:10-12:11",
    "speaker" : "Andy"
  },
  {
    "text" : "When did Clinton Portis get traded for the first-round pick to the Redskins? 2003? It has to be pretty soon. Because they had there was a Mike Anderson sighting in this and they immediately went right to Mike Anderson and he would crush it just as much as Portis.",
    "speaker" : "Steve",
    "timestamp" : "12:12-12:28"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, give us some names, Greg.",
    "timestamp" : "12:29-12:31"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "12:31-12:58",
    "text" : "Terrell Davis in the sixth round. Orlandis Gary in the fourth round. Mike Anderson in the sixth round. Portis in the second round, Tatum Bell, second round, Maurice Claret. That one didn't really work out. I have his jersey. Alfred Morris in a sixth round. There were some other guys in there, I think, but they're not on this list."
  },
  {
    "speaker" : "Andy",
    "text" : "But there's that's still solid.",
    "timestamp" : "12:58-13:00"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "13:01-13:04",
    "text" : "It was like one of those situations where you could literally plug in anybody."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:04-13:26",
    "text" : "Anybody here. That's what it felt like, yeah. And this year's plug-in was Clinton Portis because he was uh a rookie and the reason he was even starting was Terrell Davis retired in the preseason, kind of like out of the blue, kind of like a a groundk thing. And so they drafted so you said he was in the second round, Clinton Portis? Wait, Terral Davis just wasn't having fun anymore?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "13:27-13:28",
    "text" : "That's what it sounds like."
  },
  {
    "text" : "I mean he wasn't winning Super Bowls every year, right? Yeah.",
    "speaker" : "Andy",
    "timestamp" : "13:29-13:32"
  },
  {
    "text" : "So poor guy.",
    "speaker" : "Steve",
    "timestamp" : "13:32-13:34"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "13:35-13:40",
    "text" : "Terrell Davis is a pretty good story. Six round draft pick, he put up like insane numbers."
  },
  {
    "text" : "Hall of Fame, right? Just not very long though, right? Right. I I think he was like one of those guys where the Hall of Fame debate rages and he had a really short career. But I think he's in. I don't remember.",
    "timestamp" : "13:41-13:54",
    "speaker" : "Andy"
  },
  {
    "text" : "StatCheck? StatCek. He uh Dun dun dun I don't think so. He only played nineteen ninety-five to two thousand and one.",
    "timestamp" : "13:55-14:07",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "14:08-14:09",
    "text" : "Right, that's what I mean.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "14:10-14:13",
    "text" : "He really only he only only played four years."
  },
  {
    "text" : "Yeah, because he was injured for one of them, right?",
    "speaker" : "Andy",
    "timestamp" : "14:13-14:15"
  },
  {
    "speaker" : "Greg",
    "text" : "He was injured from 1999, 2000, and 2001. He never played more than eight games, but ninety-five. He had eleven hundred yards, fifteen hundred yards, seventeen hundred yards, two thousand yards. Right. So for like four years he like lit the world on fire.",
    "timestamp" : "14:16-14:33"
  },
  {
    "text" : "Yeah, and then wasn't it I remember us talking about it last season because I Don't know if he was playing or not, but they were saying that oh, I don't think he was playing. No, he wasn't. Because but they said he had some like unspecified leg injury and that's all they knew or something like that. It was something really kind of weird in the way they talked about was a little creepy.",
    "timestamp" : "14:33-14:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That's kind of crazy if you think about it. Tom Brady never faced Terrell Davis. That's true. Despite playing the Broncos at least his first two years.",
    "timestamp" : "14:55-15:05"
  },
  {
    "speaker" : "Greg",
    "text" : "We have migraines too, right? Remember we had the migraine in the Super Bowl?",
    "timestamp" : "15:05-15:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, was that him?",
    "timestamp" : "15:10-15:11"
  },
  {
    "text" : "Yeah. Remember those stories and he like couldn't he he couldn't see straight when he scored one of his touchdowns?",
    "timestamp" : "15:11-15:16",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "15:17-15:35",
    "text" : "Oh that's right. God, can you imagine? Like a regular headache and I'm like, I can't work. Today. You don't get he you don't get migraines. That's what I'm saying. I don't even get migraines. Actual headaches that he's scoring touchdowns in the Super Bowl.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:36-15:39",
    "text" : "Yeah, I wake up pung over it. I'm like, I can't work today. Exactly.",
    "speaker" : "Steve"
  },
  {
    "text" : "That's what I was saying.",
    "timestamp" : "15:39-15:41",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:41-15:49",
    "text" : "I wake up hung over and I just spend eighty percent of the day in the toilet and then still just still on the clock. It's still on the clock.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Working from home, baby. Yep.",
    "timestamp" : "15:49-15:51"
  },
  {
    "speaker" : "Greg",
    "text" : "Boss makes a dollar, I make a dime. That's why I'm shitting on company time.",
    "timestamp" : "15:53-15:57"
  },
  {
    "speaker" : "Andy",
    "text" : "That's right. Oh no, I'm at the age now where I wake up and I've pulled something just sleeping.",
    "timestamp" : "15:58-16:04"
  },
  {
    "text" : "You got those you probably got night terrors, huh?",
    "timestamp" : "16:07-16:09",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "16:09-16:22",
    "text" : "No, I actually I one night I I tried to roll over. And so I I pushed my hand down on the bed to push myself over, and it felt like I tore all the muscles in my in my pecs on one side and creep.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "16:22-16:25",
    "speaker" : "Steve",
    "text" : "Wait. Can we bring this back to how terrible Shannon Sharp is?"
  },
  {
    "speaker" : "Greg",
    "text" : "Wait, wait, wait. I want I had something to talk about on the sleeping situation.",
    "timestamp" : "16:26-16:32"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright. I don't know if I want to hear this. I'm not sure I do either.",
    "timestamp" : "16:33-16:36"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "16:36-16:40",
    "text" : "Sl sleepwalking. You guys ever like read about sleepwalking?"
  },
  {
    "text" : "I've heard of it, sure.",
    "speaker" : "Andy",
    "timestamp" : "16:41-16:43"
  },
  {
    "speaker" : "Greg",
    "text" : "It's really interesting. Like what's what's going on with sleepwalking? No. Can we get back to how terrible Shannon Sharp is? Don't you think it's weird that you can like stand up and walk around while you're asleep? That doesn't Does it pique your interest at all? Right.",
    "timestamp" : "16:44-17:02"
  },
  {
    "speaker" : "Steve",
    "text" : "You can like blow your load while you're sleeping. Walking is just regular",
    "timestamp" : "17:02-17:07"
  },
  {
    "timestamp" : "17:09-17:15",
    "speaker" : "Andy",
    "text" : "Cause you're asleep. If you take Ambient, that does some weird shit."
  },
  {
    "text" : "Yeah. You know, people have like got acquitted for murder or sexual assault by claiming that they were sleepwalking.",
    "timestamp" : "17:15-17:23",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "17:23-17:39",
    "speaker" : "Andy",
    "text" : "I can see that. I used to work with a buddy who uh took ambient and went to sleep and woke up and he had somehow taught himself how to use a 3D modeling program and 3D modeled a duck. And he went back in and he didn't know how to do it. He doesn't know how to use a program, but somehow in his sleep managed to do it."
  },
  {
    "timestamp" : "17:40-17:54",
    "text" : "Yeah, I listened to a podcast on sleepwalking the other day. That's why it's in my mind. Yeah, can we shout out a podcast here? Stuff you should know. You ever listen to that one?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I've heard that one, yeah.",
    "timestamp" : "17:55-17:56"
  },
  {
    "timestamp" : "17:56-18:00",
    "speaker" : "Greg",
    "text" : "You would love it, Andy. That's that's your sense of humor."
  },
  {
    "timestamp" : "18:00-18:03",
    "speaker" : "Andy",
    "text" : "Oh you think so? Yeah. What what are you trying to say?"
  },
  {
    "timestamp" : "18:03-18:06",
    "speaker" : "Greg",
    "text" : "I don't know, they're just kinda like nerds, but they're fuck you."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:07-18:07",
    "text" : "Oh"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "18:10-18:13",
    "text" : "Can we please talk about how shitty Shannon Sharp is?"
  },
  {
    "timestamp" : "18:13-18:17",
    "speaker" : "Andy",
    "text" : "Yes. Steve, give me your Shannon Sharp take. Is he better or worse than the Jets?"
  },
  {
    "timestamp" : "18:18-18:53",
    "speaker" : "Steve",
    "text" : "No, it's worse than the Jets. Regardless. When he scores that touchdown and you know I'm going with this. So he scores his touchdown. It's actually a pretty nice play. Cut T tapped his toes in the back of the end zone. And then like he goes to his shoes and like the tongue of the shoe, he like peels it off and it has some writing on there. But he like can't peel it off. It takes him five fucking minutes. And it takes him two tries, yeah. Yeah. I don't remember what was set on there. Yeah. It's like t seven point font. I don't remember what was on there."
  },
  {
    "speaker" : "Andy",
    "text" : "No, I yeah, because it wasn't even like it was almost like supposed to be part of his name, but it wasn't.",
    "timestamp" : "18:53-18:59"
  },
  {
    "timestamp" : "18:59-19:07",
    "speaker" : "Steve",
    "text" : "Yeah, it was like the greatest to ever do it or something just you know super douchey like that. He's like Terrell Owens, but just shitty."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:07-19:14",
    "text" : "Yeah, it's like the funny trying to be twelve Terrell Owens, but he wasn't good at it. When was the Joe Horn thing?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "19:15-19:17",
    "text" : "That would have been before this."
  },
  {
    "text" : "The Joe Horn Sharpie thing.",
    "speaker" : "Steve",
    "timestamp" : "19:17-19:19"
  },
  {
    "timestamp" : "19:20-19:27",
    "text" : "Stat check, I got you guys. Joe Horn. Because that will like kick this off. No, no, no. Terrell Owens Sharpie did.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "19:28-19:32",
    "speaker" : "Andy",
    "text" : "Didn't Joe Horn start this? He did the phone in the Yeah."
  },
  {
    "text" : "Well speaking of that one too, that it was 2003. Interesting. So it's right in the middle of all that. So this is before this. Yeah. Well, Terrell Owens. What the Sharpie was the first one? That's Don't ask don't ask that bitch Alexa. Two thousand and two. Huh. So this is 2002 as well. October 2002, which is it?",
    "speaker" : "Greg",
    "timestamp" : "19:33-19:56"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:56-20:01",
    "text" : "So this is Before all that. This game happened. Yeah."
  },
  {
    "text" : "Oh. So it's probably like the week before. Dude, that you know what always bothered me about that uh Joe Horn thing is when he takes the phone out and he goes to put it uh up into his ear and it's a flip phone and it's like flipped down and then he has to reflip it open. I don't know why.",
    "timestamp" : "20:02-20:18",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:18-20:21",
    "text" : "It's just one of those things that like Yeah, just didn't quite pull it off right."
  },
  {
    "timestamp" : "20:21-20:27",
    "speaker" : "Greg",
    "text" : "Yeah, it gives me the heebie jeebies. Yeah, I'm with you. Torello is the best to ever do it."
  },
  {
    "speaker" : "Steve",
    "text" : "That's what I'm saying. And Shannon Sharp was the worst to ever do it.",
    "timestamp" : "20:27-20:30"
  },
  {
    "speaker" : "Greg",
    "text" : "His execution was shit. It's all about the execution. Yeah, I haven't seen anybody. Popcorn in the face thing. Remember that? That was great. Isn't there something with a cheerleader too?",
    "timestamp" : "20:30-20:40"
  },
  {
    "timestamp" : "20:40-20:46",
    "speaker" : "Andy",
    "text" : "The pom-poms. Yeah, grab the pom-poms. They're not going to be a kneeling on the Dallas Star. Oh yeah. We got tackled for it."
  },
  {
    "timestamp" : "20:46-20:56",
    "speaker" : "Greg",
    "text" : "This is fucking this was like peak celebration time for And then Hojo Senko had like do some dumb shit too."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "20:56-21:01",
    "text" : "Who was like working out in their driveway doing uh sit-ups? That was TL."
  },
  {
    "timestamp" : "21:02-21:14",
    "text" : "That's my quarterback. Just my team. the most like newsworthy player in the NFL for hate Shannon Sharp.",
    "speaker" : "Andy"
  },
  {
    "text" : "Hall of Fame or TL Is he in the Hall of Fame? No, they won't put him in there because he's it was antics, which is so ridiculous.",
    "timestamp" : "21:15-21:24",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "21:24-21:25",
    "text" : "That is ridiculous."
  },
  {
    "timestamp" : "21:25-21:26",
    "speaker" : "Greg",
    "text" : "He was a beast."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "21:26-21:26",
    "text" : "Yeah."
  },
  {
    "text" : "He was like Anquan Bolden, but better. Yeah, his numbers are like second best ever for outside of Jerry Rice.",
    "timestamp" : "21:27-21:35",
    "speaker" : "Greg"
  },
  {
    "text" : "Okay. Second best water zero ever",
    "speaker" : "Andy",
    "timestamp" : "21:39-21:45"
  },
  {
    "timestamp" : "21:45-21:55",
    "speaker" : "Greg",
    "text" : "Statistically. Speaking of like Randy Randy Moss is like I think a better receiver, but he didn't have as many like long longevity that TO did."
  },
  {
    "speaker" : "Steve",
    "text" : "Speaking of assholes, Andy, how what do you think of the commentators?",
    "timestamp" : "22:00-22:04"
  },
  {
    "timestamp" : "22:05-22:12",
    "text" : "Uh I actually wasn't paying attention. They were the the usual what the fuck was it? Um I didn't even write them down.",
    "speaker" : "Andy"
  },
  {
    "text" : "It was uh Phil and Greg Gumble.",
    "speaker" : "Steve",
    "timestamp" : "22:12-22:16"
  },
  {
    "timestamp" : "22:16-22:17",
    "speaker" : "Andy",
    "text" : "Yeah, Phil Sims."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "22:18-22:24",
    "text" : "They did reference getting pegged by a snowball last time they're at Oxford in this game. Yeah."
  },
  {
    "text" : "I was skipping through it a bit.",
    "timestamp" : "22:24-22:26",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:26-22:30",
    "text" : "It was at the very end of the game when the Patriots fans are streaming out.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "22:31-22:31"
  },
  {
    "text" : "After the Broncos had a big pass play to ice it. And he's like, oh, one of them does does snowball at me on their way out.",
    "timestamp" : "22:31-22:40",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Fuck you, Phil Sims.",
    "timestamp" : "22:41-22:42"
  },
  {
    "speaker" : "Steve",
    "text" : "Gregbox.",
    "timestamp" : "22:42-22:43"
  },
  {
    "timestamp" : "22:44-22:46",
    "text" : "Greg Gombo? No.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "22:48-22:49",
    "speaker" : "Andy",
    "text" : "Yeah, he's fine."
  },
  {
    "speaker" : "Greg",
    "text" : "Wayne Brady makes Grunt Greg Gumble look like Malcolm X",
    "timestamp" : "22:49-22:53"
  },
  {
    "text" : "Shout out to show which is ridiculous because Phil Sims was calling Greg Gumble pumpkin. Oh no, pumpkin. Yeah, no, he's like, no one call you can't call me pumpkin. He's like, oh, I didn't call you pumpkin. I called you pumpkin. And then he spells it.",
    "timestamp" : "22:57-23:14",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "23:14-23:15",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "23:15-23:32",
    "text" : "And I wrote this down. P-N-K-I-N. Wait, what? You forgot the U, clearly, you know, like punk kin, but that just sounds like a real term of endearment to me. Yep.",
    "speaker" : "Steve"
  },
  {
    "text" : "I uh that was about the time where I started skipping forward. That was the first quarter. Yeah, exactly. And they were like measuring a first down or something like that. Yep. Boys, there's shit going on. Fuck about your pumpkin.",
    "speaker" : "Andy",
    "timestamp" : "23:34-23:47"
  },
  {
    "timestamp" : "23:48-24:02",
    "text" : "I had a someone apply to a job at my office and their the email address on there. Um Oh boy. Resume was like something like banana pudding at yahoo. com.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "24:03-24:37",
    "text" : "Oh, I have a way better one. Well let's hear it Steve. So like we are transitioning one golf course to another management company, like a small one in Michigan. And the dude's um email was uh his name was like Brad Gourney or something like that. And his name was Gorn Dog69. Yeah, like hotmail. He's like, I was like, who do you want me to give Facebook access to? He's like, yeah, you can give it to my email, Gorn Doc68. I was like We're at work, bro. You don't have like a like a work email."
  },
  {
    "timestamp" : "24:38-24:41",
    "text" : "Yeah, do you know Gmail they're free, you know?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "24:42-24:46",
    "text" : "Don't know if you knew that. I love the 69 at the end. It was the best."
  },
  {
    "speaker" : "Andy",
    "text" : "Should have been Gornstar. Gornography.",
    "timestamp" : "24:46-24:49"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "24:50-24:52",
    "text" : "There's a way a lot of way you can go with a lot of ways you can go with it."
  },
  {
    "timestamp" : "24:53-25:04",
    "text" : "Yeah. Good lord. Speaking of pornography, Willie McGuinness in this game made my pants tight.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:05-25:11",
    "text" : "You know what I had a bunch of flashbacks to? Um Adanta Hightower in the Seahawks Super Bowl.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh yeah?",
    "timestamp" : "25:11-25:12",
    "speaker" : "Andy"
  },
  {
    "text" : "Because he had an uh well Teddy actually had that running play hit, but there was actually some very similar Dante Hightower plays, maybe between Teddy and Willie.",
    "speaker" : "Steve",
    "timestamp" : "25:13-25:22"
  },
  {
    "text" : "Mm-hmm.",
    "speaker" : "Andy",
    "timestamp" : "25:22-25:22"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh because Teddy like Read the whole line, goal line run play, same direction as Marshawn Lynch was going, and then just bam made the most clean tackle of all time.",
    "timestamp" : "25:23-25:33"
  },
  {
    "speaker" : "Andy",
    "text" : "When you thought he was like Clinton Porrys is just gonna walk in.",
    "timestamp" : "25:33-25:36"
  },
  {
    "text" : "Yep. And then Willie did the whole like lineup wide that um Dante did in the uh Atlanta Super Bowl.",
    "speaker" : "Steve",
    "timestamp" : "25:36-25:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "25:44-25:44"
  },
  {
    "timestamp" : "25:45-25:53",
    "text" : "He had the strip sack, he like lined out wide and just blew right by the running back 'cause he like just misread it and He didn't actually get the the fumble, unfortunately.",
    "speaker" : "Steve"
  },
  {
    "text" : "No.",
    "timestamp" : "25:53-25:54",
    "speaker" : "Andy"
  },
  {
    "text" : "He almost did.",
    "speaker" : "Steve",
    "timestamp" : "25:54-25:55"
  },
  {
    "timestamp" : "25:55-25:57",
    "speaker" : "Andy",
    "text" : "Brian Greasy paid for that play."
  },
  {
    "text" : "Oh yeah.",
    "timestamp" : "25:57-25:58",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I think that moved them that sack moved them out of field goal range or they missed a long field goal because of it after that.",
    "timestamp" : "25:58-26:04"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "26:04-26:12",
    "text" : "Yep. Yeah. So that's not giving it two Lombardies. There was some like I was like flashing back to Super Bowls through this game. So it's worth it for that, I guess."
  },
  {
    "speaker" : "Andy",
    "text" : "This is it didn't remind me of any any super There were some good plays. I think my favorite Willie Megan's play was um When Denver tried to reverse. And he just saw it coming the entire way. Just didn't chase after the plane, just stood there and waited for the guy on a reverse. And he just like ran straight at him. It was Ashley Lele. Yes, it was. From Hawaii.",
    "timestamp" : "26:13-26:39"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:40-26:43",
    "text" : "Great name. That's a sick name, yeah. That is a sweet name"
  },
  {
    "speaker" : "Andy",
    "text" : "On the other hand, offensive line in this game? How many Lombardies do they get?",
    "timestamp" : "26:47-26:53"
  },
  {
    "timestamp" : "26:53-26:54",
    "speaker" : "Steve",
    "text" : "Negative one."
  },
  {
    "timestamp" : "26:56-27:02",
    "text" : "I think in this game you you would hit them with a Lombardi for their Like there was they had like one drive.",
    "speaker" : "Andy"
  },
  {
    "text" : "Just hit him with that, put some more dents in it, because it was this was bad. There was two sacks in the first seven plays, including our our punt. Yeah. They had four sacks all on third down.",
    "timestamp" : "27:04-27:16",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "27:17-27:25",
    "text" : "Yeah. I think the third downs was it was the tale of this game. Uh yeah. Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "27:26-27:32",
    "text" : "Even Belichick said that at like the halftime interview when back when he used to talk to reporters at halftime."
  },
  {
    "text" : "Right. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "27:32-27:33"
  },
  {
    "timestamp" : "27:34-27:38",
    "text" : "Which is crazy to see. Sometimes they're like, oh yeah, Belchek says more than one word.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Right, yeah. He actually said something. We're like oh for, at least in the first half, they were O. For four or five or six or something on third down.",
    "timestamp" : "27:38-27:48"
  },
  {
    "text" : "I can't remember what play it was, but I have a note from the third quarter that says, wow, a third down stop.",
    "timestamp" : "27:49-27:53",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, uh the Bron the Broncos went six for six on their first in the first half on third down conversions and then went oh for three after that. I think the only tie the only one they converted in the second half was um the long ball right after two minute warning to seal it, the forty yard pass. Which was a ballsy call.",
    "timestamp" : "27:54-28:15"
  },
  {
    "text" : "Yeah, if they hadn't turned it over the twice in the first half, it would have been even more of a blowout. But that tie loft pick was sick.",
    "timestamp" : "28:15-28:22",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "28:23-28:23"
  },
  {
    "text" : "There was I mean he definitely committed PI, but you know, not back then.",
    "timestamp" : "28:23-28:29",
    "speaker" : "Steve"
  },
  {
    "text" : "I think he did it on every well the thing is, uh because There was another interception later on in the game that got overturned. Oh, it was in the fourth quarter. Uh Malloy had the interception. in the end zone, but they called Ty Law for uh defensive holding, which probably should have been pass interference, but it was almost exactly the same As all the other holding he'd been doing throughout the game.",
    "timestamp" : "28:30-28:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "It's crazy to watch defensive backs and receipts back in 2002.",
    "timestamp" : "28:57-29:01"
  },
  {
    "speaker" : "Andy",
    "text" : "There's a lot of contact. Oh my god, it's crazy. Every single play is a penalty. Yeah. It would be these days. But yeah, this first quarter was the fact that it was only 7-0 Broncos at the end of it was bad. Although it was basically 14-0 because Denver scored in the first play of the second quarter.",
    "timestamp" : "29:01-29:21"
  },
  {
    "timestamp" : "29:21-29:32",
    "text" : "I was gonna list off some other shit that sucked. Tom Brady throwing a triple coverage INT. Dion Branch getting tackled by the punter on an awesome punt return.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "29:33-29:34",
    "speaker" : "Andy",
    "text" : "I'll I'll give him that one."
  },
  {
    "speaker" : "Steve",
    "text" : "The end of the third quarter where Tom Brady doesn't realize the clock is running out and he's looking at the game clock. Yeah. Not the game clock.",
    "timestamp" : "29:34-29:41"
  },
  {
    "timestamp" : "29:41-29:50",
    "speaker" : "Andy",
    "text" : "Very Brady-like. Oh yeah. Yep. Um Deion Branch fumbling the the kickoff. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "To be fair, he absolutely got blown up on that. Yeah.",
    "timestamp" : "29:52-29:55"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:55-30:08",
    "text" : "But that was so this is so their first drive, New England They get the ball to start the game. Brady gets sacked on third down. They go three and out. They punt. And the punt was like 20 something yards."
  },
  {
    "text" : "Uh brutal.",
    "speaker" : "Steve",
    "timestamp" : "30:08-30:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Uh Denver drives straight down, scores a touchdown. And then Pace get the ball back, branch gets hit on the kickoff, recovers it. Well, I don't know if he recovers it, but Pace recover it. Then they try the their usual end round to Troy Brown that always works, and that goes for negative yards. And then the next play, Brady gets sacked again, and then they punt. And uh Never actually fumbled that punt, but they recovered it. And then the next play was the deep ball that Ty Law picked off. Like this was a shit show to start.",
    "timestamp" : "30:09-30:42"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "30:43-30:43",
    "text" : "Yeah."
  },
  {
    "text" : "Absolute shit show.",
    "speaker" : "Andy",
    "timestamp" : "30:44-30:45"
  },
  {
    "timestamp" : "30:45-30:48",
    "text" : "Delta O'Neil got blown up on that poor guy.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "30:49-31:19",
    "text" : "Delta O'Neil does not know fair catch. Well the first one he did get a fair catch and he got lit up by his own guy. Yeah. Because the blocker just like who was blocking the gunner just like ran into him and like looked like Delton O'Neill was like seriously hurt. Now the second one, there's nobody near him, except for Patriots, and he doesn't call a fair catch and gets lit the fuck up again. And then I think from then on he didn't return a punt, he just let them all bounce over his head, didn't he?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:19-31:27",
    "speaker" : "Steve",
    "text" : "That's smart. Because we couldn't even stop it from going to the end zone anyways. Oh god. Or make it go more than 20 yards."
  },
  {
    "text" : "Yeah, just not great. So remember how we talked like in the playoffs about Patriots playing in all three facets? This was like exactly the opposite.",
    "speaker" : "Andy",
    "timestamp" : "31:27-31:35"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:36-31:41",
    "text" : "Oh yeah, and nobody covering Ed McCaffrey. Oh god. Yeah."
  },
  {
    "timestamp" : "31:42-31:45",
    "speaker" : "Andy",
    "text" : "I always loved Ed McCaffrey. The original McCaffrey."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, that's true. Are they related? Wait. Yeah, that's his song. Who's the other McCaffrey? Christian McCaffrey. Oh yeah. It's Ed's Ed's uh run CMC. Oh it's not. Yes it is. Is it really? Yes. Stat check I'll check it, but I'm I'm like pretty sure. I did not know Chris McCaffrey is Ed McCaffrey's son. Yeah, why do you think he's so good at football? That I mean it makes a shitload of sense now that I think about it, but I did not know that.",
    "timestamp" : "31:46-32:15"
  },
  {
    "text" : "Yeah, Christian McCaffrey, born in Colorado, the son of former Stanford NFL wide receiver Ed McCaffrey. Wow. And former Stanford soccer star Lisa McCaffrey.",
    "timestamp" : "32:15-32:27",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "32:27-32:30",
    "speaker" : "Andy",
    "text" : "Oh, so this kid had it maid. Yeah."
  },
  {
    "text" : "That's a blue blood.",
    "speaker" : "Steve",
    "timestamp" : "32:30-32:31"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "32:31-32:32"
  },
  {
    "timestamp" : "32:32-32:36",
    "speaker" : "Steve",
    "text" : "Wow. I I already liked Christian McCaffrey. Now I like him double."
  },
  {
    "text" : "I like him less. Fuck Ed McCaffrey.",
    "speaker" : "Andy",
    "timestamp" : "32:36-32:38"
  },
  {
    "timestamp" : "32:38-32:43",
    "speaker" : "Steve",
    "text" : "Why though Ed McCaffrey was the shit? He was like Ricky Prol, but not a douche."
  },
  {
    "text" : "How do you know?",
    "timestamp" : "32:44-32:45",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know. He just seemed like less of a douche Ricky Pro like was super butthurt about all these Super Bowls this time of year. And McCaffrey just fucking did his job.",
    "timestamp" : "32:46-32:58",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "McCaffrey's got the longest neck in football. No, there was a a cornerback for Merton Hanks. Yes. Merton Hanks, dude",
    "timestamp" : "32:58-33:09"
  },
  {
    "timestamp" : "33:09-33:16",
    "speaker" : "Andy",
    "text" : "It's funny you bring that up because the funky chicken dance."
  },
  {
    "timestamp" : "33:16-33:20",
    "text" : "Dude, I've been waiting to say this actually, because I just watched a video.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Right? Photoshopped.",
    "timestamp" : "33:21-33:24"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "33:24-33:39",
    "text" : "Yeah, if you're at home right now listening to this, Google Merton Hanks funky chicken dance. And it's some of the funniest shit you've ever seen. Because I I I started looking into the best celebrations. And and then this is on the list and I was like, oh fuck yeah, I forgot about that."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh my god. His head moves separately from his body. Oh, it's on a loop. I found a gift. Alright, we're posting this GIF in G. He's a DVD. In the show notes. This is amazing. This is amazing. I think Steve found it. Oh my god.",
    "timestamp" : "33:40-34:01"
  },
  {
    "timestamp" : "34:02-34:04",
    "speaker" : "Steve",
    "text" : "I didn't know this guy existed."
  },
  {
    "text" : "You don't remember this? I like I do.",
    "speaker" : "Andy",
    "timestamp" : "34:04-34:06"
  },
  {
    "speaker" : "Greg",
    "text" : "I didn't forgot to remember he was a defensive back. I thought he was like a receiver or something. But I forgot how good this was.",
    "timestamp" : "34:06-34:12"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Number 36 for the 49ers.",
    "timestamp" : "34:12-34:15"
  },
  {
    "timestamp" : "34:16-34:19",
    "speaker" : "Greg",
    "text" : "The the icky shuffle too, that was like a legendary one."
  },
  {
    "text" : "Obviously Billy White shoes scored goals in soccer. I used to the icky shuffle. That's my favorite one.",
    "timestamp" : "34:21-34:28",
    "speaker" : "Andy"
  },
  {
    "text" : "So you never did it?",
    "speaker" : "Greg",
    "timestamp" : "34:29-34:30"
  },
  {
    "timestamp" : "34:31-34:33",
    "speaker" : "Andy",
    "text" : "I didn't like Rex Soccer."
  },
  {
    "text" : "Ah, there's a I saw a highlight video of him defending Troy Brown. What? Yeah. I bet I didn't know. Baron Hanks is good too. Who else will be number 80 on the Patriots in like the old school Patriot Pat? Irving Fryer, maybe?",
    "timestamp" : "34:33-34:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "34:49-35:01",
    "speaker" : "Andy",
    "text" : "Yeah. I returned punts. Yeah, he was a good player."
  },
  {
    "timestamp" : "35:02-35:18",
    "text" : "He was like a pro bowler, wasn't he? I'll stat check that. Yeah, he's a four-time pro bowler, first time all pro. What? Yeah. You have four straight seasons as a pro bowler.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "35:18-35:21",
    "text" : "Can't believe I've never even heard of this guy. This is awesome.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "35:21-35:24",
    "speaker" : "Greg",
    "text" : "I mean he's 91 to 99, so yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "That was like my four interviews. Yeah, that's probably. That lines up. Like the end of the good 49ers. Troy. Tip is amazing. I need to stop watching it, we're getting way off topic How did he even come up? I don't even know how he got on to Martin Hanks. Long necks. Yeah. Oh, that's right. Yeah, yeah. That McCaffrey got nothing on Martin Hanks.",
    "timestamp" : "35:25-35:49"
  },
  {
    "timestamp" : "35:49-35:57",
    "speaker" : "Greg",
    "text" : "Speaking of long necks, I just listened to a podcast on dinosaurs. Just kidding."
  },
  {
    "timestamp" : "36:00-36:12",
    "speaker" : "Andy",
    "text" : "Could you imagine so I know we've joked about it before. About doing a a Browns on Browns podcast, a spin-off, where we do this but with the Browns. And it's awful because they don't ever win the games."
  },
  {
    "timestamp" : "36:13-36:16",
    "speaker" : "Greg",
    "text" : "Yeah, you just gotta talk about the humor and things, you know? I guess so."
  },
  {
    "speaker" : "Andy",
    "text" : "Although I do feel we we could we could change it just a little bit. And we could do Browns on Browns on Browns and only talk about players with the last name Brown who play for the Browns.",
    "timestamp" : "36:16-36:27"
  },
  {
    "timestamp" : "36:27-36:35",
    "text" : "That's gonna be a very short podcast. It's all when you use one episode, but why don't we just do Jim Browns with the last name Brown?",
    "speaker" : "Steve"
  },
  {
    "text" : "Jim Brown, you already got one, Steve.",
    "speaker" : "Greg",
    "timestamp" : "36:35-36:37"
  },
  {
    "timestamp" : "36:37-36:41",
    "text" : "Suck on that. We could do a whole episode on him alone. Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:42-36:43",
    "speaker" : "Greg",
    "text" : "You ever heard of him?"
  },
  {
    "timestamp" : "36:44-36:53",
    "text" : "He's only one of the best running backs to ever play, dick ed. We can do browns on browns and just do different NFL. Browns on Browns on Browns. We can do any sport.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "We can do any sport. Nah, browns on browns on browns.",
    "timestamp" : "36:54-36:56"
  },
  {
    "timestamp" : "36:57-37:03",
    "text" : "And we record all of them while we're sitting on the toilet. Browns on browns on browns on browns.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "37:08-37:11",
    "text" : "If that gets Croy Brown to notice me, then yes, I'm in.",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh too never played with the Browns. I guess we can't talk about them.",
    "speaker" : "Andy",
    "timestamp" : "37:13-37:16"
  },
  {
    "text" : "Well, we can just talk about any la athlete with the last name Brown. That's true.",
    "timestamp" : "37:16-37:21",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "37:21-37:48",
    "text" : "Says another thing on here of the list of celebrations, Steve Smith doing uh row the boat after he scored against the Vikings. the same year that they got caught in that that love boat scandal. That's some good trolling right there. That's clever. The Randy Moss mooning one is pretty sweet too. Yeah. That one like I didn't really underst I mean it's not that clever. It's because Joe Buck got so pissed about it for nothing."
  },
  {
    "text" : "Well no, the reason he did it was because the opposing team would always get mooned by the fans, like the Green Bay Packers fans. Like they were either entering or leaving. So he was doing it back to him. It's like, I don't know, that's cool.",
    "speaker" : "Andy",
    "timestamp" : "37:48-38:02"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "38:02-38:07",
    "text" : "That's like C. I would have liked it more if he'd actually butts it out the bare ass."
  },
  {
    "timestamp" : "38:07-38:22",
    "text" : "If he got his butt cheeks out, that would have been legend. Legendary, yeah. I mean what would they do? I don't know. They showed Janet Jackson's nipple on TV. I mean they She got away scot-free.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean he probably would have killed Joe Buck. So do you is that attempted manslaughter? Joe Joe Buck commits suicide live on air. He would have had a heart attack at the very least.",
    "timestamp" : "38:23-38:33"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "38:34-38:38",
    "text" : "God damn it. I think nudity should be encouraged, personally."
  },
  {
    "speaker" : "Andy",
    "text" : "I bet you do.",
    "timestamp" : "38:38-38:39"
  },
  {
    "text" : "You know, I'm I'm very European in that way.",
    "timestamp" : "38:39-38:42",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "38:42-38:42",
    "speaker" : "Andy",
    "text" : "I've seen you."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Let's take our let's take our dicks out. Let's take our tits out, and let's have ourselves a good old time. You score you score a Super Bowl, you wanna let your fucking dick hang around? You go ahead and do that, all right? Penis high fives. No. Okay, pumpkin. Do mushroom taps No. Nice throw, Brady. Yeah, nice catch, Randy. Just like it mashing just dodge mashing cockheads together. Oh Lord.",
    "timestamp" : "38:43-39:20"
  },
  {
    "timestamp" : "39:21-39:24",
    "speaker" : "Steve",
    "text" : "How do we end up here? I don't know. Maybe we don't have we knew this week."
  },
  {
    "timestamp" : "39:25-39:29",
    "speaker" : "Greg",
    "text" : "We knew this was gonna happen. Before we hit record."
  },
  {
    "speaker" : "Andy",
    "text" : "2002 has been rough. I'm not gonna lie.",
    "timestamp" : "39:30-39:33"
  },
  {
    "text" : "Well, it's also the dog days of quarantine. I think that has part to do with it.",
    "timestamp" : "39:34-39:39",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, that's true too. It all but if if it feels fitting though, doesn't it?",
    "timestamp" : "39:39-39:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Yeah.",
    "timestamp" : "39:43-39:43"
  },
  {
    "text" : "Suffering through this season while suffering through quarantine.",
    "timestamp" : "39:44-39:46",
    "speaker" : "Andy"
  },
  {
    "text" : "That's true. I feel every Patriots fan should watch these games though. I agree. Because like if this is the longest losing streak, it's which is crazy to think about. It's 2002. It's 2020 now. Right. 18 years ago.",
    "speaker" : "Steve",
    "timestamp" : "39:46-40:02"
  },
  {
    "text" : "They will not lose more than three games in a row from here on out.",
    "timestamp" : "40:03-40:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "40:07-40:21",
    "speaker" : "Steve",
    "text" : "That's crazy. And everyone thinks that like So expecting of it, but it wasn't like that all the time, you know. At this point in our lives, when we were little kids, we were like, oh, here we go again."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep.",
    "timestamp" : "40:22-40:22"
  },
  {
    "text" : "Well thank God we won that one Super Bowl, you know?",
    "timestamp" : "40:22-40:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. They can never take that one away from us. Yep. Wonder if this is what Eagles fans feel like. See I never got our one Super Bowl.",
    "timestamp" : "40:25-40:32"
  },
  {
    "text" : "I don't remember any of these games. It's gotta be more like Giants fans.",
    "timestamp" : "40:32-40:36",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, maybe.",
    "timestamp" : "40:37-40:38",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "40:38-41:10",
    "speaker" : "Steve",
    "text" : "Because like Eli Manning is shit. I meant to bring this up earlier. Like Terrell Davis burned bright for five years. And Eli Manning was a dimwit motherfucker dumbass for like twenty. Which would you rather have, like the the bright star Terrell Davis, or just Eli Manning plodding along through as many interceptions as he does touchdowns for 15 20 years. Oh, you mean two-time Super Bowl winner? Yeah. Every so often he gets a little brightness and that's it."
  },
  {
    "speaker" : "Andy",
    "text" : "Eli Manning is the most frustrating quarterback I've ever watched play football. He's just not good. I feel like the way Mark Sanchez out there. No, he's more frustrating. Because when he's out there, I feel like First down, second down, he makes horrendous decisions and like almost gets picked off both the times or something bad happens, like it gets sacked or he he He he accidentally fumbles the ball, but it was called an incompletion sort of bullshit. And then on third down, he just hucks up a Hail Mary and his super talented wide receivers managed to come down with it. And then you just repeat that over and over again until he scores or he forgets to breathe and stops breathing because, you know, he has to be reminded of that sort of thing. And uh they end up having to punt.",
    "timestamp" : "41:11-41:55"
  },
  {
    "timestamp" : "41:57-42:08",
    "speaker" : "Greg",
    "text" : "There's like quarterbacks. I agree with that take. I agree with that take. His face is so dumb. Like anytime they zoom in on him, he doesn't he doesn't look like he knows knows what he's doing."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "42:09-42:42",
    "text" : "But we can pull together a list of quarterbacks where like you're just waiting for the other shoe to drop and them to fuck up and throw a stupid pick. Yeah. Flacco, uh Tannehill, Sanchez. Tannehill. Yeah, dude, he's not good. We'll see. He's not. The Titans are gonna regret that contract super bad. Put it on the record. Yeah. What do you want me to do? Like send a certified letter to the Titans?"
  },
  {
    "timestamp" : "42:42-42:50",
    "text" : "I want let's timestamp this in the episode here and then let's do weekly updates when the season starts.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "42:51-42:57",
    "text" : "Says the guy who's not editing the podcast. You can timestamp your heart out.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "42:57-43:02",
    "speaker" : "Greg",
    "text" : "Andy, you signed up for this, okay? Me and Steve are the talent."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:04-43:08",
    "text" : "I'm gonna throw it I'm gonna throw another name in there. Uh Josh Allen."
  },
  {
    "timestamp" : "43:08-43:09",
    "speaker" : "Greg",
    "text" : "Don't you dare."
  },
  {
    "text" : "Josh Allen? Yeah. No, he's the main one. You're just waiting for him to make another mistake though. That's true. I don't think you watch enough Josh Allen. He doesn't make good decisions. He gets built out a ton. Because he can run.",
    "speaker" : "Steve",
    "timestamp" : "43:09-43:24"
  },
  {
    "text" : "And he can throw a deep ball.",
    "timestamp" : "43:25-43:26",
    "speaker" : "Andy"
  },
  {
    "text" : "Well, until he tries to run on the Patriots and gets absolutely fucking blown up and knocked out of the game. That was a dirty hit. No, it wasn't. Yeah, it wasn't.",
    "speaker" : "Steve",
    "timestamp" : "43:27-43:34"
  },
  {
    "text" : "It was a runner. Oh, well, surprise, surprise. The Patriots fan doesn't think that was a dirty hit. Surprise, surprise.",
    "timestamp" : "43:35-43:41",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh, so what does that make?",
    "speaker" : "Andy",
    "timestamp" : "43:41-43:42"
  },
  {
    "text" : "We've already talked about this on this podcast before, Greg. And I brought up that Tom Brady quote about the Nate Clemens hit and what he said after it. We've already we've already been down this road, bro. Exactly.",
    "timestamp" : "43:42-43:53",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "43:53-44:03",
    "text" : "And I I think we all agree that you guys see everything through the lens of a fan and that you don't you're not uh uh subjective. Objective.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Hey Greg, Greg, how does that fence suppose feel lodged that far up your asshole?",
    "timestamp" : "44:03-44:07"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "44:07-44:12",
    "text" : "Oh Oh, so now I have to pick a side of the fence, Andy?"
  },
  {
    "speaker" : "Andy",
    "text" : "No, but you can't be fucking sitting up there looking down on the rest of us because you're not gonna pick a side. How dual decide?",
    "timestamp" : "44:14-44:20"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "44:20-44:43",
    "text" : "Why? Because er because everything in life has nuance. Why do you think my face looks like this, Andy? That's the duality of man. Fuck Yeah, I told you it was an art exhibit that explains my philosophy on life. And god damn it I'm riding that fence because that's how I feel about things."
  },
  {
    "speaker" : "Andy",
    "text" : "No, because there's nuances to everything. All right. Who are you voting for this November?",
    "timestamp" : "44:46-44:51"
  },
  {
    "timestamp" : "44:51-44:59",
    "text" : "I'm an independent. A registered independent. And you know what? Ron Paul has a real good party.",
    "speaker" : "Greg"
  },
  {
    "text" : "I'm voting against the system as a whole.",
    "speaker" : "Andy",
    "timestamp" : "45:02-45:05"
  },
  {
    "speaker" : "Greg",
    "text" : "I am. I know.",
    "timestamp" : "45:05-45:07"
  },
  {
    "text" : "Don't get me all riled up.",
    "timestamp" : "45:08-45:10",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:11-45:13",
    "text" : "You know what riled me up?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "What's that?",
    "timestamp" : "45:14-45:14"
  },
  {
    "timestamp" : "45:15-45:28",
    "text" : "Some of our cornerbacks on these, Otis Smith and Terrence Wheatley. Like the third cornerback, even at this point, the second cornerback was a liability on the Patriots this time. It's starting to show up.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:28-45:38",
    "text" : "Also the fact they can't get any pressure on the quarterback too. Even on blitzes, they all get picked up. Yeah. When you give them Brian Greasy enough time to make completions, it's"
  },
  {
    "speaker" : "Steve",
    "text" : "But like Otis Smith matched up against uh Ed McCaffrey was just I mean you put Tom Brady behind the center instead of Brian Greasy, you would have been 56 and nothing.",
    "timestamp" : "45:40-45:50"
  },
  {
    "speaker" : "Greg",
    "text" : "Did Rod the Bod play in this game?",
    "timestamp" : "45:50-45:52"
  },
  {
    "text" : "Yes, he actually played really well too.",
    "speaker" : "Steve",
    "timestamp" : "45:53-45:54"
  },
  {
    "timestamp" : "45:55-46:09",
    "speaker" : "Andy",
    "text" : "And I think he underrated wide receiver. Way underrated. Yeah. But every time he caught the ball, he would pretend to juke and then just run straight at the defender and just lower his head and get another three or four yards. Well it's him and Ty."
  },
  {
    "speaker" : "Steve",
    "text" : "Rod was definitely the number one at this time.",
    "timestamp" : "46:09-46:11"
  },
  {
    "timestamp" : "46:11-46:12",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:12-46:21",
    "speaker" : "Steve",
    "text" : "And they they were battling all game. It was a great. And then Brian Greasey finally figured it out and just started looking at Ed McCaffrey every snap because Odis couldn't."
  },
  {
    "text" : "Because he was wide open. Yeah. Yeah. Those crossing routes every time.",
    "speaker" : "Andy",
    "timestamp" : "46:21-46:25"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "46:26-46:32",
    "text" : "Oh, I got another running uh Mike Shanahan running back name for you. Ruben Drones."
  },
  {
    "timestamp" : "46:34-46:39",
    "speaker" : "Steve",
    "text" : "He's the fullback, right? Was he? Yeah, he's in this game. He was in this game."
  },
  {
    "timestamp" : "46:39-46:44",
    "text" : "He was actually, yeah. Ruben. Maybe he was a fullback then, yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Pretty sure. All right. What do you got for uh play of the game, Greg?",
    "timestamp" : "46:45-46:54"
  },
  {
    "speaker" : "Greg",
    "text" : "Tylaw's interception.",
    "timestamp" : "46:55-46:57"
  },
  {
    "speaker" : "Steve",
    "text" : "You should definitely Google it because it's a good interception.",
    "timestamp" : "47:00-47:02"
  },
  {
    "text" : "That's great. It'll be on the website.",
    "timestamp" : "47:02-47:03",
    "speaker" : "Andy"
  },
  {
    "text" : "There you go. What's that website, Andy?",
    "speaker" : "Steve",
    "timestamp" : "47:04-47:06"
  },
  {
    "speaker" : "Andy",
    "text" : "Patriots Dynasty. info. This is uh slash game slash seventy-three.",
    "timestamp" : "47:07-47:11"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:11-47:12",
    "text" : "Is there an apostrophe?"
  },
  {
    "speaker" : "Andy",
    "text" : "What? No.",
    "timestamp" : "47:14-47:16"
  },
  {
    "speaker" : "Greg",
    "text" : "Like Patriots? I mean it's their dynasty, right? And it possessed",
    "timestamp" : "47:16-47:21"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh Lord. You try with an apostrophe and get back to me. Yeah, that goes.",
    "timestamp" : "47:22-47:28"
  },
  {
    "timestamp" : "47:29-47:45",
    "speaker" : "Steve",
    "text" : "Although a lot of web website addresses do have apostrophes, so I get where Greg is coming from on this. Suck it, Andy. They don't though. I can't do it. There's no such thing."
  },
  {
    "timestamp" : "47:47-47:56",
    "text" : "How do I get to it, Andy? I go to plays. List of all games. Game search. Dude, this is a good website. I've never been on here.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "48:03-48:10",
    "speaker" : "Andy",
    "text" : "Right. You should check out the the Brady page. It has every Tom Brady touchdown. Ooh, with gifts of each play."
  },
  {
    "text" : "Go watch this Tyler interception, Greg. Week eight. I'm I'm there right now. Dude, this is dope. Yeah that highlight you don't have the highlights. Like please oh yes you do it's under highlights.",
    "timestamp" : "48:11-48:24",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "48:24-48:26",
    "speaker" : "Andy",
    "text" : "Yeah I don't have that one up there yet though."
  },
  {
    "text" : "Bradia Teforia. This is my second play of the game here.",
    "timestamp" : "48:26-48:30",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "48:30-49:00",
    "text" : "No, this is actually my play of the game. Is it Yeah, because if you watch this highlight, Greg, you'll notice watch Troy Brown and this they all collapse on Troy. Leaving Fourier wide open. Is Troy at the top of the screen or the bottom? He's at the bottom. So Troy runs like a curl route right before the end zone and Fourier runs like a four guys on him. Yep. And everyone's like, yeah, it's going to Troy Brown. And their Fourier is legit wide, wide open.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "49:00-49:32",
    "text" : "My play of the game is Antoine Smith's rushing touchdown. Which uh we haven't said a lot this year on this podcast because it is only his second touchdown run of the season in weeks. Oof. Tough. Yeah, and he tweaked his knee, I think, on this play. Because when in he got he was dragging a guy and the guy like rolled up the back of his leg real bad But that and the play before it where he kind of ran to the left side and then snaked his way all the way back to the right and picked up like ten or fifteen yards.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "It was like one drive where they could run the ball and they just ran it all the way in the touchdown. Yeah, that was the one. Yeah, can't wait for Corey Dillon to show up.",
    "timestamp" : "49:32-49:43"
  },
  {
    "text" : "Yeah, yeah. I mean Antoine was still pretty good, but he wasn't as good as I remember him being, I think.",
    "speaker" : "Andy",
    "timestamp" : "49:43-49:48"
  },
  {
    "speaker" : "Steve",
    "text" : "He was better last year.",
    "timestamp" : "49:49-49:51"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:51-49:52",
    "text" : "He was."
  },
  {
    "text" : "This year he can chance it. True, yeah.",
    "timestamp" : "49:52-49:55",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "49:55-49:56",
    "text" : "And I feel like that's a good thing.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, they started throwing the ball a lot more this year.",
    "timestamp" : "49:56-49:59"
  },
  {
    "text" : "Yeah, and I think part of it Uh you can put it on the offensive line too. Like there's no time, but they're not getting any push off the ball or anything like that. It felt almost like this 2019 season. Where Sony Michel, you know, got a whole bunch of shit even though Yeah, it's tough to say it's Sony's fault, yeah. Right. Like he wasn't breaking all the tackles, but he was also had two guys on him as soon as he got the handoff every",
    "timestamp" : "49:59-50:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "50:25-50:32",
    "text" : "play so and they had the injuries same idea too. They had a bunch of injuries in the offensive line. Yeah, yeah, that it's been a bit of a carousel."
  },
  {
    "timestamp" : "50:33-50:41",
    "speaker" : "Greg",
    "text" : "Steve's a real Sony Michelle Stan. Oh yeah, Michelle. I'm a big Sony guy. I think he was overdrafted."
  },
  {
    "speaker" : "Steve",
    "text" : "Well, if he got picked one pick later, you would have said, oh, he's a second round running back. He's doing pretty good.",
    "timestamp" : "50:41-50:46"
  },
  {
    "text" : "No, I wouldn't. If you're drafting a running back in the first or second round these days, they better be like Alvin Kamara.",
    "timestamp" : "50:47-50:54",
    "speaker" : "Greg"
  },
  {
    "text" : "I agree. You gotta start catching the ball.",
    "timestamp" : "50:56-50:58",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "50:59-50:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:00-51:06",
    "speaker" : "Steve",
    "text" : "But if he starts grabbing balls. Well, like the problem is when you have Sony and there is definite run."
  },
  {
    "timestamp" : "51:09-51:22",
    "speaker" : "Andy",
    "text" : "Grabbing balls. You dirty girl. All right, anything else? You want to do best and worst?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:24-51:24",
    "text" : "No."
  },
  {
    "speaker" : "Andy",
    "text" : "Just worst.",
    "timestamp" : "51:26-51:27"
  },
  {
    "timestamp" : "51:28-51:39",
    "text" : "I already talked about all my worst. I may pick one of them. Pick one. The triple coverage INT. As soon as he threw it, I said, oh Lord. And then of course it's an interception.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "51:40-51:40",
    "text" : "Oh lordy.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "51:41-51:42",
    "text" : "Oh lord.",
    "speaker" : "Steve"
  },
  {
    "text" : "All right, no best.",
    "speaker" : "Andy",
    "timestamp" : "51:44-51:45"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:47-51:50",
    "text" : "I mean obviously Troy Brown getting Christian Fourier a touchdown."
  },
  {
    "text" : "Okay.",
    "timestamp" : "51:51-51:51",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:52-51:56",
    "speaker" : "Steve",
    "text" : "That shit doesn't still show up on the stat sheet, but you know who loves that? Bill Belichick."
  },
  {
    "timestamp" : "51:56-51:57",
    "speaker" : "Andy",
    "text" : "Fucking right he does."
  },
  {
    "text" : "Well, I mean, is that good a good play by Troy Brown or a bad play by the defense?",
    "speaker" : "Greg",
    "timestamp" : "51:57-52:02"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:02-52:06",
    "text" : "Both. It's a bad play by the defense because of the good play of Troy Brown. What do you what do you mean?"
  },
  {
    "timestamp" : "52:06-52:08",
    "text" : "He just ran the route he was supposed to.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "No, but yeah, but he's been so good running routes and catching balls in that area at that point.",
    "timestamp" : "52:08-52:12"
  },
  {
    "text" : "But it's a previously good play. It's not actually a good play on this play.",
    "timestamp" : "52:13-52:16",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Frank, don't sit here and tell me any negative things about Troy Brown. You can get the fuck out of here with that goddamn attitude. Watch the real fuck the whole fucking game, then come talk to me.",
    "timestamp" : "52:19-52:30"
  },
  {
    "text" : "Yeah, did you see Troy Brown's fumble in the third quarter?",
    "timestamp" : "52:30-52:33",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "52:33-52:41",
    "text" : "Nope. Yeah, Daggy, maybe you should watch the game. Clack that out of my memory. Yeah. Didn't he recover it? Yeah, he did.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:44-53:03",
    "text" : "I just I just named that off. Yeah, he didn't even pump at all. Yeah. Well he did, but he he jumped right on it. Did he? He fumbled in the third quarter? I don't know if it was the third quarter, but he he did drop one that he caught. Steve, Steve, Steve. Greg, Greg, Greg."
  },
  {
    "text" : "That He just targets in this guy to the dartboard.",
    "timestamp" : "53:03-53:07",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:07-53:23",
    "text" : "Rod Smith had 10 targets, 7 catches, 54 yards. Troy Brown, 9 targets, 7 catches, 59 yards. Ed McCaffrey was eight for eight with 116. The next New England Patriot, David Patton, five targets, zero catches, zero yards."
  },
  {
    "text" : "Yeah, he had a tough game.",
    "timestamp" : "53:23-53:24",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "53:26-53:46",
    "speaker" : "Andy",
    "text" : "Let's see who this was not good. Uh Dion branch, two targets, zero catches, zero yards. So the only wide receiver that the Patriots had who caught a pass was Troy Brown, and he caught seven on it. So eat a dick, Greg Brown, is what I'm trying to say. All right."
  },
  {
    "timestamp" : "53:46-53:58",
    "speaker" : "Greg",
    "text" : "My my best of the game is Clinton Portis. He's got twenty-six carries for a buck eleven and two touchdowns. That was a pretty impressive game from him. It wasn't like wouldn't you agree?"
  },
  {
    "speaker" : "Steve",
    "text" : "No. It was imagine that No. We've been watching a lot of other running backs absolutely carve the Patriots off before this.",
    "timestamp" : "53:58-54:06"
  },
  {
    "speaker" : "Andy",
    "text" : "And it didn't feel like he he was a hundred yard rusher. I was surprised when they showed the stat that he was.",
    "timestamp" : "54:07-54:11"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, if he was my starting fantasy fantasy running back, I'd be pretty happy with this performance.",
    "timestamp" : "54:11-54:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Mm-hmm. Would you have watched the game if he was just a little bit more than a little bit?",
    "timestamp" : "54:16-54:19"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't think you would have though because back then running backs would generate a lot more yards than that. Two tutties? I mean you're talking how much did uh Ladanian Tomlinson and Priest Holmes have on the Patriots? You're expecting a real big day. Yeah.",
    "timestamp" : "54:19-54:34"
  },
  {
    "timestamp" : "54:35-54:37",
    "speaker" : "Andy",
    "text" : "But he's still got his hundred and two touchdowns."
  },
  {
    "timestamp" : "54:37-54:46",
    "speaker" : "Greg",
    "text" : "So yeah, I'd be happy with that. Unless I think it's a bad day, but I don't know. My my second star is Ed McCaffrey, eight catches on eight targets for 116."
  },
  {
    "text" : "Yeah. I would have said nothing for him. You know who you should tell that to? The fucking Broncos podcast you're on.",
    "timestamp" : "54:46-54:52",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:53-54:59",
    "speaker" : "Greg",
    "text" : "Well, you know what, Andy? If you want to expand the appeal of this pro of this podcast, maybe we should, you know Wait, wait, wait, wait."
  },
  {
    "text" : "Why the fuck are we trying to expand the Appeal. It's 2002, week seven on a four-game losing streak.",
    "speaker" : "Steve",
    "timestamp" : "54:59-55:05"
  },
  {
    "speaker" : "Andy",
    "text" : "Week eight. Two thousand seven was the bye week last week. This is coming off a bye, by the way.",
    "timestamp" : "55:05-55:11"
  },
  {
    "text" : "Because like Michael Jordan said, like conservatives buy sneakers too, or something. I'm paraphrasing.",
    "timestamp" : "55:11-55:19",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "And yeah. You're trying to sell it to everybody. No, I'm not. We have our niche. If we're gonna sell it to everybody, this would be called like the NFL dynasty. Podcast, but it's not. It's a Patriots fucking dynasty podcast.",
    "timestamp" : "55:21-55:34"
  },
  {
    "speaker" : "Steve",
    "text" : "It'd be Browns on Browns.",
    "timestamp" : "55:35-55:36"
  },
  {
    "text" : "For all you listeners out there. Browns on Browns. That are hate listening to this. I'm with you guys. I'm on your side. Nobody is hate listening to this crack. Dude, I hate listening to uh Sports Hub all the time. Felgar and Maz. I've the only times I've ever listened to it is because they hate them.",
    "speaker" : "Greg",
    "timestamp" : "55:37-55:56"
  },
  {
    "timestamp" : "55:56-55:59",
    "text" : "Yeah. I do hate read like Jets subreddits",
    "speaker" : "Steve"
  },
  {
    "text" : "So you know what, let's let's let's actually reach out and see if anybody hate listens to us. If you do, let us know. On Twitter or Facebook or the video.",
    "speaker" : "Andy",
    "timestamp" : "56:00-56:09"
  },
  {
    "speaker" : "Greg",
    "text" : "That's what I hate about like Felgar and Maz is they both have the same opinions on everything. Yeah.",
    "timestamp" : "56:11-56:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:18-56:34",
    "text" : "So you're just trying to be contrarian just to mix it up a bit? Is that what you're saying? Yeah. Exactly what you're doing. You don't hold these thoughts at all. Yeah. Known this kid for how long? Uh I guess I just thought the better of him. No."
  },
  {
    "timestamp" : "56:34-56:54",
    "speaker" : "Steve",
    "text" : "Why would you think Greg has any good motivations at all or is nice or is rational or is cool or has a nice thought or is yeah. Smart. That's the duality of human nature though, you know? Like Me and you Andy are sitting over here like loving the Patriots and Greg over there is just being a fucking douche."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "56:56-57:00",
    "text" : "There it is. You guys just aren't as well rounded as me."
  },
  {
    "text" : "Well that's what it is, yeah.",
    "timestamp" : "57:00-57:02",
    "speaker" : "Andy"
  },
  {
    "text" : "You could you could learn a thing or two about my from my face, Steve Like what? You know what? I'm gonna start sending I'm gonna send you pictures before I go to bed every night of my face. Just to remind you when you wake up that you need to consider the duality of man.",
    "timestamp" : "57:03-57:19",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:19-57:30",
    "text" : "You know what? Here's a word for you. Here's a word for you that it's the word of the the week. And the word is enmity. E-N-M-I-T-Y. And that's what you can learn from Greg's face."
  },
  {
    "text" : "E N M. Yeah, it's a tough one to say. Enmity. Enmity. Ooh, that is a tough one to say. Yeah. The state or feeling of being actively oppressed or hostile s someone or something. Opposed, but yes.",
    "timestamp" : "57:35-57:51",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:52-57:56",
    "text" : "It's basically like pure unadulterated hate towards something."
  },
  {
    "text" : "That's Greg and Bill Bell check. That's how you feel about me.",
    "timestamp" : "57:56-58:00",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "No, that's how you feel. Yeah. That's what your face gives off. to the world.",
    "timestamp" : "58:00-58:06"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't know. I think people either hate it or love it because it's got a little bit of everything. You know like some chicks like like beard guy, some chicks like clean shave, well bada bang, bada bo. Check out this fucking style. Talking about cross appeal. No. I'm hitting that strip club bringing questionnaires. What? Bringing a questionnaire to the strip club Andy that says do you like beards or not?",
    "timestamp" : "58:06-58:40"
  },
  {
    "speaker" : "Andy",
    "text" : "I take it back. I don't want an explanation. So my best. Was Tom Brady wearing gloves on both hands? Because that was fucking goofy as shit.",
    "timestamp" : "58:45-59:01"
  },
  {
    "speaker" : "Greg",
    "text" : "Ooh, double gloving it. That's very teddy bridgewater of him.",
    "timestamp" : "59:01-59:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Right.",
    "timestamp" : "59:04-59:05"
  },
  {
    "timestamp" : "59:05-59:10",
    "speaker" : "Steve",
    "text" : "The commentators are talking about that. Oh, once you go gloves, you don't go back."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "59:10-59:13",
    "text" : "I do that for golf sometimes. Cool."
  },
  {
    "timestamp" : "59:13-59:15",
    "speaker" : "Steve",
    "text" : "Yeah. So does Jack."
  },
  {
    "timestamp" : "59:15-59:24",
    "text" : "I think it helps. Like why only wear one? And why not wear it when you putt? Yeah. When would I when would I ever want less stick?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "You know what you should really do? Wear boxing gloves. That's that's really what helps.",
    "timestamp" : "59:24-59:27"
  },
  {
    "text" : "Well no, those are too clumsy, Steve. Don't be ridiculous. Hockey gloves?",
    "speaker" : "Greg",
    "timestamp" : "59:28-59:32"
  },
  {
    "speaker" : "Steve",
    "text" : "It's a stick. Lacrosse gloves.",
    "timestamp" : "59:34-59:36"
  },
  {
    "timestamp" : "59:37-59:53",
    "text" : "The Jerry Rice stick'em gloves. Mm-mm. Yeah, that's right. Throw in shade. Don't worry about it. Uh my worst I think has been Greg performance on this podcast tonight. I agree. You know why?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "59:53-01:00:06",
    "text" : "Because I can see the other sides of things, Andy. Okay. I agree. I'm introspective. There's a word. Google it. I and D-R all speaking.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "You can't smell it. I know. Well.",
    "timestamp" : "01:00:06-01:00:09"
  },
  {
    "speaker" : "Greg",
    "text" : "Well. You wanna see my fucking literature SAT score? It'll bully tits off.",
    "timestamp" : "01:00:10-01:00:16"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:16-01:00:20",
    "text" : "He's googling right now as he says all this. It's fine. He'll spell it for us in a second"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah I don't remember what the SAT was out of, but mine was a fucking very high score for reading and literature.",
    "timestamp" : "01:00:20-01:00:27"
  },
  {
    "text" : "I still have my SAT scores. Bet they were higher.",
    "timestamp" : "01:00:27-01:00:32",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I bet you did poorly on humility.",
    "timestamp" : "01:00:32-01:00:34"
  },
  {
    "speaker" : "Steve",
    "text" : "That's not a score.",
    "timestamp" : "01:00:35-01:00:36"
  },
  {
    "text" : "It should be.",
    "speaker" : "Greg",
    "timestamp" : "01:00:37-01:00:38"
  },
  {
    "text" : "Oh, also a player of no Al Wilson in this game. Playing with a broken finger, broken middle finger.",
    "timestamp" : "01:00:42-01:00:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:47-01:00:51",
    "text" : "Yeah, again, I didn't know anybody in the Broncos defense. They had such generic names."
  },
  {
    "speaker" : "Andy",
    "text" : "Dude, Al Wilson was good.",
    "timestamp" : "01:00:51-01:00:53"
  },
  {
    "timestamp" : "01:00:53-01:00:53",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "He was he was the Pro Bowler on the team, him and Triple.",
    "speaker" : "Andy",
    "timestamp" : "01:00:54-01:00:56"
  },
  {
    "speaker" : "Steve",
    "text" : "That's so generic. Like Delta O'Neill? That'll stick in my mind.",
    "timestamp" : "01:00:57-01:01:03"
  },
  {
    "text" : "That's fair. I was gonna say I thought you were using that as a an example of generic. Clinton Portis",
    "timestamp" : "01:01:03-01:01:16",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01:16-01:01:23",
    "speaker" : "Greg",
    "text" : "Didn't Poole play for the Pats? Yes, pretty sure he did. He would join the Patriots the following season."
  },
  {
    "speaker" : "Andy",
    "text" : "Well, how about that? Can't beat him, join him. Or if you can beat him, join him anyway.",
    "timestamp" : "01:01:23-01:01:28"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, nobody of nobody of no yeah, right, Steve.",
    "timestamp" : "01:01:28-01:01:31"
  },
  {
    "text" : "I was like okay with not noting Tyrone Poole. Didn't he suck? Not really. We'll find out. Tune in next year",
    "timestamp" : "01:01:32-01:01:44",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:01:46-01:01:58",
    "text" : "Yeah, well I mean if we have anybody left at this point, I suppose we should thank them for listening this far. You can rate our podcast too Um if you want to give Greg feedback on what his face looks like."
  },
  {
    "speaker" : "Steve",
    "text" : "We are posting pictures of this with like each episode.",
    "timestamp" : "01:01:59-01:02:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. Yeah, we will be. So ratethispodcast. com slash patspod. Do you want me to send you some photos?",
    "timestamp" : "01:02:02-01:02:09"
  },
  {
    "text" : "Yes, please.",
    "speaker" : "Greg",
    "timestamp" : "01:02:09-01:02:10"
  },
  {
    "text" : "Greg, you have to send one like every week so you can see the progression. Right.",
    "timestamp" : "01:02:10-01:02:14",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I am I'm addicted to selfies now. No.",
    "timestamp" : "01:02:14-01:02:18"
  },
  {
    "text" : "That sounds right. You have addictive personality.",
    "timestamp" : "01:02:18-01:02:21",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:02:22-01:02:35",
    "text" : "This is true. I've I honestly, like I probab before I started doing this with my beard, I don't think like I ever took a selfie. Maybe like once or twice. I take one every night.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Seriously?",
    "timestamp" : "01:02:36-01:02:36"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:02:37-01:02:37"
  },
  {
    "timestamp" : "01:02:38-01:02:44",
    "text" : "Uh are you gonna put it all together as like one slideshow of like the as the beard flows off your face?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:45-01:03:06",
    "text" : "It just it looks so ridiculous that I can't I don't send them to anyone. I just have a phone full of my selfies that I like to get pictures and then I look at it and I laugh and then I do a silly face. Oh yeah. I'm addicted to it. I'm embarrassed by it. I have that's why I haven't sent it to anyone, but I I love doing it.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:03:06-01:03:14",
    "speaker" : "Steve",
    "text" : "That's okay, I already have yeah, yeah, I have no you know opinions of you of any high regard, so feel free to send them to me."
  },
  {
    "timestamp" : "01:03:15-01:03:20",
    "text" : "I know. You want to do a live one? Send them to me. I'll I'll I'll just put them on on Twitter for us.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:03:21-01:03:23",
    "text" : "You want me to do a live one here?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:03:23-01:03:27",
    "text" : "Okay, yeah. Send one to you right now. This will be the one that we post.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Just turn on your video.",
    "timestamp" : "01:03:28-01:03:29"
  },
  {
    "timestamp" : "01:03:30-01:03:37",
    "speaker" : "Andy",
    "text" : "No, please don't. I want to look at this picture for as as little as possible."
  },
  {
    "text" : "I could put it Alright, I just sent it to you. This is the most recent one from last night.",
    "speaker" : "Greg",
    "timestamp" : "01:03:38-01:03:46"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:03:47-01:03:50",
    "text" : "Have you figured out that like the high angle to like Yeah."
  },
  {
    "text" : "Yeah, I got a couple of those. Uh-huh. What?",
    "timestamp" : "01:03:50-01:03:54",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, if you've taken a selfie, Andy, you gotta like hold the camera up above your head. Gives you a better angle, makes you look thinner. Everyone knows that. Jesus Christ.",
    "timestamp" : "01:03:54-01:04:02"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh.",
    "timestamp" : "01:04:03-01:04:03"
  },
  {
    "timestamp" : "01:04:03-01:04:04",
    "speaker" : "Andy",
    "text" : "Take selfies."
  },
  {
    "text" : "I thought you meant for like the beard appearance. Yeah, you're not. Like when I take it like looking down my face, it like really like you can see the length of the hair. That's for I'm trying to get contrast. I'm not trying to get like Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:04:04-01:04:19"
  },
  {
    "text" : "It looks like you brushed that beard out a little bit.",
    "timestamp" : "01:04:19-01:04:22",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I still haven't received anything, so",
    "timestamp" : "01:04:23-01:04:25"
  },
  {
    "timestamp" : "01:04:27-01:04:29",
    "speaker" : "Steve",
    "text" : "That's that's a beard."
  },
  {
    "timestamp" : "01:04:30-01:04:35",
    "text" : "I'll show you what I'm talking about, the look down the camera one, Steve. I'll hit you with one of those right now.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh fuck me. That's I I'm not even gonna try to describe words can't do this justice. You'll just have to",
    "timestamp" : "01:04:35-01:04:45"
  },
  {
    "text" : "Yeah to tune in next week to see where Greg's stupid beard is now.",
    "speaker" : "Steve",
    "timestamp" : "01:04:46-01:04:50"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, I'm shaving it this weekend, by the way.",
    "timestamp" : "01:04:50-01:04:52"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:04:53-01:04:53",
    "text" : "What?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:04:53-01:04:54"
  },
  {
    "speaker" : "Steve",
    "text" : "Wait, wait, wait. You're not gonna let uh Liana and Audrey see it?",
    "timestamp" : "01:04:54-01:04:59"
  },
  {
    "speaker" : "Greg",
    "text" : "No, so here's what I'm thinking, right? I need a haircut too, and this upcoming weekend happens to be July the fourth. So I'm thinking Stripes on my head, star on my face.",
    "timestamp" : "01:04:59-01:05:13"
  },
  {
    "text" : "Okay.",
    "timestamp" : "01:05:13-01:05:14",
    "speaker" : "Andy"
  },
  {
    "text" : "Um I just feel the girls are gonna love it. They see the half beer, Greg. Just you know, hold out one more week.",
    "timestamp" : "01:05:16-01:05:24",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:05:24-01:05:26",
    "text" : "Steve, go go fuck yourself."
  },
  {
    "text" : "I just want to see it. I want to see it again in person, to be honest.",
    "timestamp" : "01:05:26-01:05:29",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:05:29-01:05:35",
    "text" : "Well, I I want you to shut the fuck up, but we can't all get what we want, can we?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean I'm joining us on the Patriots Dynasty podcast.",
    "timestamp" : "01:05:36-01:05:40"
  },
  {
    "speaker" : "Greg",
    "text" : "This has been thrilling, gentlemen.",
    "timestamp" : "01:05:42-01:05:43"
  },
  {
    "speaker" : "Andy",
    "text" : "I hate this.",
    "timestamp" : "01:05:43-01:05:44"
  },
  {
    "speaker" : "Greg",
    "text" : "I hate this podcast. I hate Steve the most, but I also hate you, Andy. Andy, I love you. Love you, Andy. How do you like retract sending text message?",
    "timestamp" : "01:05:44-01:05:59"
  },
  {
    "text" : "Can I You know what, Greg? I love you too. Did you see the second photo? Yeah, the Taco Wolves that's some long ass hair. Mm-hmm. It makes me wonder why you wanna be uh dude, I've all I've also been doing doing uh real life emojis.",
    "timestamp" : "01:05:59-01:06:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That series is wild. But I can't let those ones get out where I do like the the monocle one. I have a monocle one, you know",
    "timestamp" : "01:06:22-01:06:33"
  },
  {
    "timestamp" : "01:06:35-01:06:40",
    "speaker" : "Andy",
    "text" : "Are you in Slack anywhere? Because you can create your own Slack emojis."
  },
  {
    "timestamp" : "01:06:42-01:06:46",
    "text" : "No, these Microsoft Teams. Oh gross.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Andy, you are right on you are on the right path ending this. This is getting s ridiculous.",
    "timestamp" : "01:06:46-01:06:50"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, this is this is over. This has been over for a while. I'll just like this pages game.",
    "timestamp" : "01:06:51-01:06:55"
  },
  {
    "timestamp" : "01:06:55-01:07:10",
    "speaker" : "Greg",
    "text" : "Is this gonna be aired? I don't know. Yeah. Uh I' Dude, these selfies are electric. I'm going to 'em right now. There's some killer selfies in here."
  },
  {
    "speaker" : "Andy",
    "text" : "Speaking of electric. Next week, New England Papers travel to Buffalo. I'm not gonna ruin Steve.",
    "timestamp" : "01:07:10-01:07:19"
  },
  {
    "timestamp" : "01:07:20-01:07:24",
    "speaker" : "Greg",
    "text" : "Pat's at bills. Pat's at bills. I think you know it."
  },
  {
    "text" : "What better what better way to get off the schneid?",
    "timestamp" : "01:07:24-01:07:27",
    "speaker" : "Andy"
  },
  {
    "text" : "Than a Tom Brady in Buffalo. I mean because this is how I know that the streak ends because Tom Brady always wins in Buffalo. I can count on my hands the times Tom Late the I know each game where he's lost to the Bills.",
    "speaker" : "Steve",
    "timestamp" : "01:07:27-01:07:40"
  },
  {
    "timestamp" : "01:07:40-01:08:06",
    "speaker" : "Andy",
    "text" : "Is only lost, I think, three of them. Is that what we decided? Mm-hmm. Yeah. So And one of them he only played a half. So this might not be one of those, but you'll have to tune in next week on the Pagers Dynasty Podcast if you're Still with us after Gregory this week. We will see you then. Maybe. I guess. Yeah. The old later. Dear Jesus."
  }
]