[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom"
  },
  {
    "text" : "Welcome back to the Patriots Dynasty Podcast. Episode 2, Season 2, heading to Giant Stadium to take on the hated Jets. And Steve Brown's favorite player, Curtis Martin. Curtis, my favorite Martin. Steve, is he your favorite Martin?",
    "timestamp" : "00:22-00:38",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "00:39-00:42",
    "text" : "I should think of another like something to put in there instead.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "00:42-00:51",
    "text" : "Let me mull on. Yeah. So we got the brothers today and we also have Connor back. Connor, nice to see you again, bud.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "00:51-00:56",
    "speaker" : "Connor Ireland",
    "text" : "Well you can't see me, but thank you, Andy. It's good to be back. What's up, boys?"
  },
  {
    "text" : "Trust everybody's better that way. That none of us can see each other. I think we decided the only person we had who didn't have a face for radio was uh Mike. And he's not here. So and Kelly apparently.",
    "speaker" : "Andy",
    "timestamp" : "00:56-01:09"
  },
  {
    "timestamp" : "01:11-01:18",
    "speaker" : "Greg",
    "text" : "Oh boys. Boys Kelly just dropped an ahee ahead tuna steak right on my desk."
  },
  {
    "text" : "This is a rousing start. I can't wait to listen to you eat it while we're recording this.",
    "speaker" : "Andy",
    "timestamp" : "01:25-01:30"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:33-01:36",
    "text" : "What? You want me to give you want to give you a live review? Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, all right. Let's let's do it.",
    "timestamp" : "01:36-01:38"
  },
  {
    "speaker" : "Greg",
    "text" : "We got some peppercorn on top.",
    "timestamp" : "01:38-01:40"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "01:41-01:41"
  },
  {
    "timestamp" : "01:42-01:59",
    "speaker" : "Greg",
    "text" : "How well done is it? Oh Perfectly seared. Nice and juicy in the middle. We got a little we got a melon, avocado, tomato, you know, potpourri salad to go with it. Oh boy."
  },
  {
    "text" : "I don't like the right, but all right.",
    "timestamp" : "02:00-02:02",
    "speaker" : "Steve"
  },
  {
    "text" : "We'll go with it. Oh. Very refreshing to go with this tuna. Oh, four stars. Four out of how many?",
    "timestamp" : "02:03-02:11",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:12-02:14",
    "text" : "Yeah. Cool. Out of five? Out of ten."
  },
  {
    "speaker" : "Greg",
    "text" : "Three.",
    "timestamp" : "02:15-02:15"
  },
  {
    "timestamp" : "02:17-02:29",
    "speaker" : "Andy",
    "text" : "All right. Now they've got the scale down. Good job, Callie. Alright, off to a rousing start. Almost as rousing as the Jets start in this game."
  },
  {
    "timestamp" : "02:29-02:35",
    "speaker" : "Greg",
    "text" : "Sheesh. Are you gonna let me do the scouting report?"
  },
  {
    "text" : "Well let's yeah, let's uh preface this by saying that we've decided that we ramble a lot on these episodes. So we're gonna try something a little bit different today. We're gonna try to A little bit of a format, so we'll see how this goes. So yeah, you wanted to do a scouting report, um, preferably not on what you're eating or any other seafood, but um the jets You got anything on the jets? Yep.",
    "timestamp" : "02:36-02:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I got you. I got yeah, I got notes.",
    "timestamp" : "02:58-03:00"
  },
  {
    "text" : "Well it's here.",
    "timestamp" : "03:00-03:01",
    "speaker" : "Andy"
  },
  {
    "text" : "I'm just gonna I'm I'm gonna set the scene a little bit here because it's not just about the jets at this point, right? This is this is in the midst of New York versus Boston sports like culture. You know what I'm saying? So there's a lot of stuff going around like hanging around both these these cities at this point. So it's not just the Patriots, it's the Red Sox too. The Red Sox, you're uh you're looking at 1999 was the ALCS when the Yanks beat the Sox. Four games to one.",
    "timestamp" : "03:01-03:34",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "You're gonna be a little bit more than what's his name in too far? Too long? Leaving Pedro in?",
    "timestamp" : "03:34-03:40"
  },
  {
    "speaker" : "Greg",
    "text" : "No, not quite. That's that's that's a year from now. That's 2003. The Aaron fucking boone, which is also the same year as Don Zimmer getting thrown to the ground, if you remember that.",
    "timestamp" : "03:40-03:52"
  },
  {
    "timestamp" : "03:53-03:54",
    "speaker" : "Steve",
    "text" : "Oh, yeah, a little matador actually."
  },
  {
    "timestamp" : "03:55-04:19",
    "text" : "Uh-huh. Roger Clemens. Got signed with the Yankees in 1999, so two years ago. Dang. Um Pedro, I I think remember when he was talking about uh wake up Babe Ruth and I'll drill him in the ass. Oh yeah. That's right around this time frame. And then the whole like uh the Yankees are my daddy thing, but we'll forget that. Oh yeah",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "04:19-04:21",
    "text" : "Well that was two thousand four, wasn't it?",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. Yep. Um I just peak box.",
    "speaker" : "Greg",
    "timestamp" : "04:22-04:26"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "04:29-04:31",
    "text" : "Was in two thousand and three, Greggy."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "04:31-04:32",
    "text" : "Yeah."
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "04:32-04:32",
    "text" : "Yeah."
  },
  {
    "timestamp" : "04:33-05:10",
    "speaker" : "Greg",
    "text" : "Oh, you said fucking boon. Yeah. Yeah. Um so then the even the Jets and the Patriots have all sorts of controversy swung around, right? So it's the Bill Parcells leaving leaving the Pats. Going to the Jets. There was all stink about that. Some draft picks got traded. Uh, and then Bill Belichick, obviously. Rosina. Curtis Martin NYJ goes goes from the Exactly. And then who replaces um Parcells as well is Pete Carroll, who used to be a head coach of the Jets, which I did not know. 1994."
  },
  {
    "text" : "Big Carroll's a Jets head coach? Mm-hmm. Did not know that either.",
    "speaker" : "Steve",
    "timestamp" : "05:10-05:14"
  },
  {
    "timestamp" : "05:15-05:37",
    "speaker" : "Greg",
    "text" : "I had no idea. How did he get the USC? I have no idea. Couldn't have been that great, right? Yeah. So then Mo Lewis, obviously last year. Victor Green leads the Jets, comes to the pass after eight years in the Jets this offseason. And somehow The Jets come into this game as one-point favorites."
  },
  {
    "text" : "They did. I noticed.",
    "speaker" : "Andy",
    "timestamp" : "05:38-05:39"
  },
  {
    "speaker" : "Greg",
    "text" : "Like, what the fuck?",
    "timestamp" : "05:40-05:41"
  },
  {
    "timestamp" : "05:41-05:45",
    "speaker" : "Steve",
    "text" : "Wait, Patriots won the Super Bowl in back-to-back underdogs?"
  },
  {
    "timestamp" : "05:45-05:46",
    "text" : "Yep.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, so so they were underdogs last week and blew out the Steelers and the Jets uh squeaked by the Bills, I think it was, even though they are outgained and Like out everything'd, but it was only because they beat the the Bills last week because uh Chad Morton returned two kickoffs for touchdowns. And they won it overtime.",
    "timestamp" : "05:46-06:08"
  },
  {
    "speaker" : "Steve",
    "text" : "I just looked up uh Pete Carroll's time at the Jets.",
    "timestamp" : "06:08-06:12"
  },
  {
    "speaker" : "Andy",
    "text" : "Not great.",
    "timestamp" : "06:12-06:13"
  },
  {
    "timestamp" : "06:13-06:32",
    "speaker" : "Steve",
    "text" : "94 elevated at coach. Carol painted a basketball court in the parking lot of the teens practice facility where he and his coaches played three on three during their spare time They go six and five. In week twelve he got fakes biked by Dan Marino. Oh that was faked the clock and threw a touchdown."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "06:33-06:33"
  },
  {
    "timestamp" : "06:34-06:39",
    "text" : "And then they lost all of their remaining games to go six and ten and he got fired.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "06:40-06:43",
    "speaker" : "Andy",
    "text" : "Oh, he got fired and then hired by the Pats the next year."
  },
  {
    "text" : "No, he went to the Niners. For two years.",
    "timestamp" : "06:44-06:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:47-06:50",
    "text" : "Oh. Oh, it's not a head coach. Yeah, okay."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:50-06:50",
    "text" : "Yep."
  },
  {
    "speaker" : "Greg",
    "text" : "And the the the Jets actually got ravaged by the uh The Texans expansion draft too.",
    "timestamp" : "06:52-06:57"
  },
  {
    "timestamp" : "06:58-07:02",
    "text" : "They did. I noticed that. Who yeah, because there were some kind of big names that left.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:02-07:10",
    "speaker" : "Greg",
    "text" : "Yeah, the two biggest like salary cap hits from that expansion draft were both uh Jets cornerbacks Aaron Glenn and Marcus Coleman."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah that's no like there's a possible Hall of Famer Aaron Glenn, right? That one? Yes. Is he? No.",
    "timestamp" : "07:11-07:20"
  },
  {
    "timestamp" : "07:21-07:29",
    "speaker" : "Steve",
    "text" : "No. Like their defensive line, their linebackers were nasty. But their secondary, like year over year, had no no names."
  },
  {
    "timestamp" : "07:29-07:48",
    "speaker" : "Andy",
    "text" : "Yeah, they had three out of the four guys who were new. There's only one. who was the front there from last year. I don't remember who it was. Oh, they also lost uh Tom Tupa to the Bucks, right? That's awesome. That was a that was a big loss, I think, 'cause you didn't get anything about about him um being a uh quarterback as well. So what else you got, Craig?"
  },
  {
    "timestamp" : "07:48-07:56",
    "text" : "Yeah, so that's that's the same. That's all I got. All right. Oh uh Vinnie Tessaveri's still a quarterback, which is ridiculous.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. But didn't they well they didn't draft him this year, but uh the backup was Chad Pennington, right? Who I think I played years the the season before. Played a couple games the season before, but nothing really. I love Chad Pennington.",
    "timestamp" : "07:56-08:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "08:11-08:14",
    "speaker" : "Steve",
    "text" : "He's the winningest AFC East quarterback behind Brady, right?"
  },
  {
    "timestamp" : "08:14-08:17",
    "speaker" : "Andy",
    "text" : "I believe he is, yeah. I think so."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I believe. In what day frame? Well since Brady's been playing.",
    "timestamp" : "08:17-08:22"
  },
  {
    "text" : "Yeah, since 2001 probably.",
    "speaker" : "Andy",
    "timestamp" : "08:22-08:24"
  },
  {
    "timestamp" : "08:25-08:29",
    "text" : "Alright. Like Jim Kelly's gotta be up there. Oh yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, yeah, not ever.",
    "timestamp" : "08:30-08:31"
  },
  {
    "text" : "But it yeah in the last twenty years the second most wins by a quarterback in the AFC East, I think is Chad Pennington. I mean who else who else has any wins?",
    "timestamp" : "08:32-08:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "If it's magic, he padded his stats this year, right? He won sixty.",
    "timestamp" : "08:43-08:46"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he's won a few games here and there for every other AFC East team. Alright, so then should we get into the game now that we've set the scene here? Yep. Let's do it.",
    "timestamp" : "08:49-08:56"
  },
  {
    "speaker" : "Steve",
    "text" : "All right, Steve, you want to uh Well all right I'll just go out there and throw the final score. It was like 44-7. Yeah.",
    "timestamp" : "08:57-09:04"
  },
  {
    "timestamp" : "09:05-09:06",
    "speaker" : "Greg",
    "text" : "Shit stomping."
  },
  {
    "text" : "I watched every second of it. I loved it. Yep. How was that last quarter? Oh, it was amazing. You got a Jack Pennington sighting. That was the first probably his first ever snap.",
    "speaker" : "Steve",
    "timestamp" : "09:07-09:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:19-09:26",
    "text" : "There were uh one, two, three, four, five quarterbacks played in the fourth quarter. This can you name them?"
  },
  {
    "speaker" : "Steve",
    "text" : "Five.",
    "timestamp" : "09:26-09:26"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:27-09:35",
    "text" : "I can only So actually I I want to see if anybody else can can name any of them. So so how many can you name?"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "09:35-09:36",
    "text" : "Name what?"
  },
  {
    "timestamp" : "09:36-09:48",
    "speaker" : "Andy",
    "text" : "The the five quarters to play in the fourth quarter of this game. Oh well the five what? Quarterbacks that play the fourth quarter of this game."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Oh",
    "timestamp" : "09:48-09:49"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean I've got two of them wrong. Testaverde, Brady Brady and Testaverde, yep.",
    "timestamp" : "09:49-09:54"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Chad Pennington. Rohan Pennington.",
    "timestamp" : "09:55-09:58"
  },
  {
    "text" : "Rohan Davey actually did. He did it? He was he was in there for all three Neil to end the game. He were kneels. And Damon Hubert. Did Damon Hewitt get in there? Yeah. And he led a drive entirely of handoffs that finished with a Falk touchdown run.",
    "timestamp" : "09:58-10:14",
    "speaker" : "Andy"
  },
  {
    "text" : "I did not know that was Damian Hewart. I watched that game and I didn't realize it.",
    "speaker" : "Steve",
    "timestamp" : "10:15-10:20"
  },
  {
    "text" : "He was in there doing uh handoff for that entire drive. That's all he did. You had like five or six handoffs in a row. 'Cause they were just trying to run the clock out and the jets couldn't see.",
    "timestamp" : "10:20-10:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "This was like they were clearly trying to make K Falk a like a thing here.",
    "timestamp" : "10:29-10:33"
  },
  {
    "text" : "Well I think they had activated him over J. R. Redmond. But yeah, he was the number two everything. Even",
    "timestamp" : "10:34-10:44",
    "speaker" : "Andy"
  },
  {
    "text" : "Even when you go back and you rewatch that Rams Super Bowl game-winning drive, you're like, GR Redman, I thought that was Kevin Falk. You know, you just kind of assume Kevin Falk and the Pages dynasty are like one and one, which at some point they become. But I mean 2001 he didn't do anything really. He didn't even dress in that Steelers week one. So he wasn't even on the active roster for the first game.",
    "speaker" : "Steve",
    "timestamp" : "10:44-11:08"
  },
  {
    "timestamp" : "11:09-11:15",
    "speaker" : "Andy",
    "text" : "But in this game, Kevin Falk did, yeah. And he was the number two running back."
  },
  {
    "speaker" : "Steve",
    "text" : "James White, everyone.",
    "timestamp" : "11:15-11:16"
  },
  {
    "timestamp" : "11:18-11:19",
    "speaker" : "Andy",
    "text" : "Yeah, same same exact idea."
  },
  {
    "timestamp" : "11:19-11:27",
    "text" : "When White started out, he couldn't do anything either. In fact, the first year. James White was just everyone's calling a bust.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That's right. Not anymore. Yeah, he was I think he was the um the number two running back because Antoine Smith, uh yeah, Antoine Smith got dinged up. So he was the lead running back. And he was eventually returning punts. And I think he was returning kickoffs at one point too. Him and Dion branch. He was back there, I don't think he actually returned any but. So he was the uh the Troy Brown of the of this game, I think",
    "timestamp" : "11:27-11:56"
  },
  {
    "text" : "Yeah, so Pat's absolutely crushed him the whole game, but they really could have beaten him better. Troy Brown had that fumble on the one-yard line in the first quarter.",
    "timestamp" : "11:57-12:06",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, as he was going into score.",
    "timestamp" : "12:06-12:08",
    "speaker" : "Andy"
  },
  {
    "text" : "It was brutal.",
    "timestamp" : "12:08-12:09",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "12:09-12:12",
    "speaker" : "Andy",
    "text" : "That was a a very rare mistake from Troy Brown."
  },
  {
    "speaker" : "Steve",
    "text" : "That being said, Troy Brown in the first half, 10 catches, 107 yards. He like he doubled him up by himself.",
    "timestamp" : "12:13-12:25"
  },
  {
    "timestamp" : "12:25-12:25",
    "speaker" : "Andy",
    "text" : "Yes."
  },
  {
    "text" : "Just catching the ball.",
    "timestamp" : "12:26-12:27",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "12:27-12:43",
    "text" : "So there's something else I want to mention actually before we get any further. Um We've been talking about all these plays and if you actually want to watch them you can go to the website. So for this one it's patsdynasty. info slash games slash sixty-eight and you'll be able to see all of Troy Brown's big plays.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "12:44-13:04",
    "text" : "Especially including his uh wide receiver screen. What are you gonna say, Greg? Does that mean next week? Does that mean next week is slash sixty-nine? It might be. Nice. Ooh. I'm intrigued. Tune in next week. I can't wait. I'll dress up. Yeah. Maybe get a bottle of wine."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "13:05-13:06",
    "text" : "We know what you're having for dinner then."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "13:07-13:16",
    "text" : "Oh Jesus himself. Punani. You know what they say, Steve. Wine em dine 'em. 69. Oh, yeah."
  },
  {
    "text" : "If we if we had had more four thought we could have got uh Gronk on this. He loves him a good sixty-nine joke.",
    "speaker" : "Andy",
    "timestamp" : "13:16-13:21"
  },
  {
    "timestamp" : "13:22-13:25",
    "speaker" : "Steve",
    "text" : "Andy make sure you get that um No works."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:27-13:34",
    "text" : "I'm sure he's got nothing better to do right now, right? Oh Steve, they're all on here. Don't you worry about it. Did you want to talk about the fake remote?"
  },
  {
    "timestamp" : "13:35-13:43",
    "speaker" : "Steve",
    "text" : "He like fakes reverse in like one of the best ball fakes I've ever seen from Brady. And then he hits that dime. And he's always been good at it."
  },
  {
    "timestamp" : "13:45-14:10",
    "speaker" : "Connor Ireland",
    "text" : "That Steve, you just took one of my key talking points. Um that was a thirty nine yard pass pass to David Patton. I I wrote down that Brady's play action ability has always been elite. I mean he he sells the play action, the reverse, better than any quarterback ever."
  },
  {
    "timestamp" : "14:10-14:11",
    "speaker" : "Andy",
    "text" : "I agree."
  },
  {
    "text" : "And I think he's one of the few that still",
    "speaker" : "Connor Ireland",
    "timestamp" : "14:11-14:13"
  },
  {
    "speaker" : "Andy",
    "text" : "That's still preaching to him. Sorry, what you're saying?",
    "timestamp" : "14:14-14:17"
  },
  {
    "timestamp" : "14:18-14:21",
    "speaker" : "Connor Ireland",
    "text" : "Yeah, even like tuck the ball at the end. Charlie Weiss taught him up on that."
  },
  {
    "text" : "Yeah. Yeah, but he was a big thing. And they seemed to run reverses a ton last like I don't know, maybe even back in the day like this time. Last year they were running a ton. That certainly helps.",
    "timestamp" : "14:22-14:32",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yeah, Charlie Weiss. Charlie Weiss, baby.",
    "timestamp" : "14:32-14:35"
  },
  {
    "text" : "He was awesome.",
    "timestamp" : "14:35-14:36",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "14:37-14:50",
    "text" : "Yep. Should we talk about them?",
    "speaker" : "Andy"
  },
  {
    "text" : "Sure.",
    "timestamp" : "14:50-14:51",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Cause it's the introduction of Dan fucking Deerdorf. And the worst. Uh thanks, Craig. I appreciate the support. Whether or not you believe it, I'm not sure.",
    "timestamp" : "14:51-15:02"
  },
  {
    "timestamp" : "15:02-15:11",
    "speaker" : "Greg",
    "text" : "But I no, I no, I really do. I usually give you shit about this, but Dan Diador blows"
  },
  {
    "timestamp" : "15:11-15:46",
    "text" : "And so I and I used I used to think it was just him, but I paid special attention to this because I I've been kind of hyping it for a while about how much I hate Dan Deerdorf. But Dick Enberg, his partner, is probably as bad, if not worse. The two of them, I actually looked it up. There was a New York Times article written about how bad they are. Diodorf and Emberg repeatedly fumbled broadcasts of Rams Jets games. This isn't even like a Patriots game. This is just. Like they're just that bad. I and yeah, uh yeah, we'll link that in the show.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Did you read the article? Oh did I? Well what were they saying?",
    "timestamp" : "15:47-15:51"
  },
  {
    "speaker" : "Andy",
    "text" : "Um basically that they don't seem to understand what's going on in a football game. Um and they're talking about All right, let's see. Here we go. Here's a little bit. Uh Diedorf had a notably weak day. Analysts are paid for their opinions, but he had some disputable ones Sunday. He praised a dubious challenge by Jets coach Herman Edwards of a reception by the Rams Tory Holt. Saying it was a good tactic to stop the Rams momentum. The challenge was denied. In the context of Edward's history of bad clock management, the Jets lost a possibly crucial timeout. When the Rams scored two plays later, Deerdorf tried to justify his praise of Edwards' decision by saying that Edwards made the call because he sensed this coming. Huh? And it just goes on and on.",
    "timestamp" : "15:52-16:36"
  },
  {
    "timestamp" : "16:37-16:43",
    "speaker" : "Steve",
    "text" : "Well in this game, he told his partner, I love it when you talk geometry to me."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh we'll get to some quotes. That's funny.",
    "timestamp" : "16:43-16:46"
  },
  {
    "speaker" : "Steve",
    "text" : "Is it?",
    "timestamp" : "16:46-16:47"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:47-17:06",
    "text" : "Hang on, hang on, here's here's a uh here's the the payoff. Then came a real head scratcher. Jeff Wilkins lined up for the 31-yard game-winning field goal for St. Louis at a distance from which he rarely misses. Still, the disappointed Deerdorf said, I would have tried for the touchdown. Touchdowns are sure things with this offense. This is in overtime, by the way."
  },
  {
    "timestamp" : "17:08-17:08",
    "text" : "In overtime?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "17:09-17:09"
  },
  {
    "timestamp" : "17:10-17:13",
    "speaker" : "Steve",
    "text" : "That's a bad before you everyone gets a possession too."
  },
  {
    "text" : "Right, right. So it's it's first first girl wins.",
    "speaker" : "Andy",
    "timestamp" : "17:13-17:16"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "17:16-17:17",
    "text" : "That's bad."
  },
  {
    "timestamp" : "17:18-17:44",
    "speaker" : "Andy",
    "text" : "Yeah. But he uh he he did love Charlie Weiss's uh the direct snap to folk. It was uh Charlie Weiss has gone crazy and Charlie Weiss is unleashed He went on about that. Um on a this one was actually pretty good. On a I think it was like a f they they measured the the first down and it wasn't. And he said he's about two Jimmy Deans short of a first down here."
  },
  {
    "timestamp" : "17:44-17:46",
    "speaker" : "Greg",
    "text" : "What does that mean?"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh I think uh Jimmy Dean's with those sausages, right? Breakfast?",
    "timestamp" : "17:46-17:49"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah. Okay.",
    "timestamp" : "17:50-17:50"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:51-18:12",
    "text" : "It were real close. But then they showed Teddy Bruski. Going into locker room with um like wooziness and neck injuries and neck issues. And he didn't return. And uh Deirdorf says, oh, he might have gone in for a Brewski Which seems unprofessional for a guy who's getting his head looked at for a fucking possible concussion."
  },
  {
    "timestamp" : "18:13-18:21",
    "text" : "Yeah, well, we use a beard or relax. Hey, you know what Andy? You could You could use a brewski. Alright?",
    "speaker" : "Greg"
  },
  {
    "text" : "Chill out. No, this this is my first time I get to go into fucking Dan fucking Deerdorf. Oh Dick Emberg was worse. What did he do? What did he say? Uh well I don't know if it's racist, but he uh seems to assume that all Patriots wide receivers look the same. He was uh confusing David Patton and Donald Hayes multiple times.",
    "speaker" : "Andy",
    "timestamp" : "18:21-18:49"
  },
  {
    "timestamp" : "18:49-18:50",
    "speaker" : "Greg",
    "text" : "That's understandable."
  },
  {
    "text" : "Yeah, 'cause they're you know, one's five foot six and the other one's like six foot four. So that makes a lot of sense. Yeah, but the numbers aren't even anywhere close either.",
    "timestamp" : "18:51-18:58",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:58-19:02",
    "speaker" : "Greg",
    "text" : "He also called the team those wide receivers, they all look the same."
  },
  {
    "timestamp" : "19:02-19:36",
    "text" : "I guess so. Uh and he did he did that with all he got every single one wrong with a different wide receiver. It's pretty impressive. Uh he liked calling people David Patton. Um and then He couldn't quite understand how much yardage was needed for a first down. He struggled with this all day, but my favorite was at the beginning of the game, where it's um I think the Patriots ran for 13 yards. And on first down, he's like, oh, it looks like he has nearly enough for a first down. And he does on a thirteen yard game. So he does. Well he's three.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "He's all the way up in the box. He's up in the box, Andy. No isn't it?",
    "timestamp" : "19:36-19:40"
  },
  {
    "timestamp" : "19:41-19:45",
    "speaker" : "Andy",
    "text" : "Have you ever watched a game that I was even further away. I was watching from TV."
  },
  {
    "text" : "Also he's used to the metric system, so yards and all that can get confusing.",
    "timestamp" : "19:45-19:52",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:52-19:55",
    "text" : "What about when he called Lawyer Malloy a former jet?"
  },
  {
    "text" : "That wasn't good.",
    "timestamp" : "19:56-19:58",
    "speaker" : "Andy"
  },
  {
    "text" : "How did he fuck that up? I don't know.",
    "timestamp" : "19:59-20:01",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "He's probably thinking of Victor Green, right?",
    "timestamp" : "20:01-20:03"
  },
  {
    "text" : "No, it was right after Victor Green's pick six. He's like, and he comes back and gets a bunch of congratulations from his former players. I bet Laura Malloy lost that, the former Jet. Yeah. I was like, no way. I had to Google it while I was sitting there watching the game. I was like, yeah, thank God.",
    "speaker" : "Steve",
    "timestamp" : "20:03-20:18"
  },
  {
    "text" : "Oof, nope. Oh, he he liked to confuse Kevin Falk and Antoine Smith too. Did that a bunch. Um and then he also called the team the Bellateris Patriots after Villotary kicked the field goal at the half.",
    "speaker" : "Andy",
    "timestamp" : "20:18-20:34"
  },
  {
    "timestamp" : "20:35-20:40",
    "speaker" : "Greg",
    "text" : "Wait, wait, what? That's uh is that a pun? I don't think so."
  },
  {
    "timestamp" : "20:40-20:45",
    "speaker" : "Steve",
    "text" : "I don't know. It was tough to tell, yeah. I I don't I don't be right"
  },
  {
    "text" : "What why would you combine those two names? I think you just It's like Brangelina. Bellateri",
    "timestamp" : "20:46-20:54",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Wasn't you talking about Brady being a bachelor judging the Miss USA pageant too? Oh yeah. That was a little risque.",
    "timestamp" : "20:55-21:01"
  },
  {
    "timestamp" : "21:02-21:04",
    "speaker" : "Andy",
    "text" : "Yeah, well there was there was a lot of football, not football on this."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, Fox and the Hen House sort of thing.",
    "timestamp" : "21:04-21:06"
  },
  {
    "text" : "I think it's uh do you guys want uh want just a little slice of that?",
    "timestamp" : "21:06-21:10",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:11-21:12",
    "speaker" : "Greg",
    "text" : "Yeah. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah? All right. So He's a a foxy man himself. Um but he was talking about our our favorite wide receiver on this this program. He said, look at what has been the hallmark of Troy Brown's career. Going up, stretching out, exposing himself. Football, not football.",
    "timestamp" : "21:12-21:38"
  },
  {
    "text" : "Well, it's Troy Brown, so it's definitely football. The man lives, breathes, eats, sleeps, football.",
    "timestamp" : "21:38-21:43",
    "speaker" : "Steve"
  },
  {
    "text" : "But why is he talking about explosions?",
    "speaker" : "Andy",
    "timestamp" : "21:45-21:46"
  },
  {
    "timestamp" : "21:46-21:50",
    "speaker" : "Connor Ireland",
    "text" : "Sounds like some Sounds like some locker room talk to me."
  },
  {
    "timestamp" : "21:50-21:54",
    "speaker" : "Andy",
    "text" : "Oh, it could be locker room talk, you're right. Just boys being boys. Yeah."
  },
  {
    "timestamp" : "21:55-21:56",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "text" : "Just grab them by the football. I got it.",
    "timestamp" : "21:57-21:58",
    "speaker" : "Andy"
  },
  {
    "text" : "I guess that's part of football.",
    "timestamp" : "21:59-22:00",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "22:02-22:09",
    "text" : "Um all right, and then they were both going back and forth over something. I don't even remember what, but uh it ended with I didn't think you get it in this quick.",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, I was uh he was giving him a dig about Michigan. Losing.",
    "timestamp" : "22:09-22:13",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh yeah, I think you're right. Yeah. Yeah. So you th you think it was about the dig and not about something else? You don't think about the thing about the thing?",
    "timestamp" : "22:13-22:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "No, no, they were they were they were having they were having sex on on air.",
    "timestamp" : "22:19-22:24"
  },
  {
    "text" : "All right, good. And then I I think this one was actually our our boy Deodorf. He was fascinated the entire game with ball handling. Uh he especially Boomer Seison said Boomer Seizon was a m magnificent ball handler and ball faker. Um I don't I I understand ball handling. Ball faking, I think, might need some explanation.",
    "timestamp" : "22:25-22:55",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:56-23:01",
    "text" : "Have you ever heard someone call like another person's hands their cock feelers?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I have now, but no.",
    "timestamp" : "23:08-23:09"
  },
  {
    "text" : "That's a Dannyism. Or like your mouth your mouth is your cock taster. Ah. Like stop running your cock taster.",
    "speaker" : "Greg",
    "timestamp" : "23:10-23:20"
  },
  {
    "timestamp" : "23:21-23:24",
    "speaker" : "Steve",
    "text" : "Just Dan Dodar's got a dirty mind."
  },
  {
    "speaker" : "Andy",
    "text" : "He does. Ball your ball handlers. But now Tom Brady has also become a very adept ball handler.",
    "timestamp" : "23:24-23:31"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "23:31-23:34",
    "text" : "I think that that's I mean that part's true. We already talked about that."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:34-23:37",
    "text" : "Yeah, I suppose that is football, isn't it, in that regard?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "23:37-23:37",
    "text" : "Yeah."
  },
  {
    "text" : "What about Boomer though? Was he a good ball handler in the same way or was it different kind of eardoffs balls? That's all I had. I just wanted to bring that back in in memoriam of our our our Mike Mello.",
    "speaker" : "Andy",
    "timestamp" : "23:37-23:55"
  },
  {
    "speaker" : "Greg",
    "text" : "And then you'd have another twenty years of commentating games.",
    "timestamp" : "23:55-23:59"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. He's still doing. Didn't he just get replaced or something like that too?",
    "timestamp" : "24:00-24:04"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "24:04-24:05"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that's Dan Fouts.",
    "timestamp" : "24:05-24:06"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't know how he had such a long career.",
    "timestamp" : "24:06-24:08"
  },
  {
    "text" : "Which one? Neither do I. Theodorf? Fouts. Oh furall. Dan Dierdorf. He was easily my least favorite. And I th I think it will get worse. But for now, that's just the the intro to Dan Dierdorf. From me. Motherfucker is in the Hall of Fame. You sons of bitches.",
    "timestamp" : "24:09-24:31",
    "speaker" : "Andy"
  },
  {
    "text" : "Theodore?",
    "timestamp" : "24:31-24:32",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "24:32-24:33",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "Yeah, remember I told you that?",
    "speaker" : "Greg",
    "timestamp" : "24:33-24:34"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:35-24:38",
    "text" : "Yeah, but I I didn't want to look it up because I thought you might be kidding."
  },
  {
    "timestamp" : "24:38-24:44",
    "speaker" : "Greg",
    "text" : "No, he's a Hall of Famer. Son of a bitch. For what? So is Brent Jones."
  },
  {
    "text" : "Oh yeah, but that was. If you do something Something else though, isn't it? That wasn't like the real Hall of Fame. Jewish players Hall of Fame? Yeah, it was something like that. NCAA Hall of Fame or something or whatever his college was. I don't know, something like that. Oh, you got me all riled up again. Thanks, Greg.",
    "timestamp" : "24:44-25:02",
    "speaker" : "Andy"
  },
  {
    "text" : "Alright. Let's get back to the game. You can relax, Andy.",
    "speaker" : "Steve",
    "timestamp" : "25:03-25:06"
  },
  {
    "timestamp" : "25:06-25:10",
    "text" : "Bring me back, Steve. Bring me back. Talk to me about the second half.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:13-25:32",
    "text" : "More of the same first possession for the Jets, blind side blitz from Tabucky, scoop and score. With a tomahawk chop. Yeah, that was sweet. Their biggest play, and I think their leading rusher of for the day for the Jets was their fucking punter.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:33-25:34",
    "text" : "That was gonna be my best."
  },
  {
    "timestamp" : "25:36-25:40",
    "speaker" : "Steve",
    "text" : "And the only thing the Jets had going was they had a fit punt."
  },
  {
    "timestamp" : "25:42-25:47",
    "speaker" : "Connor Ireland",
    "text" : "It was also their first it was their first first down of a game. It was in the third quarter."
  },
  {
    "timestamp" : "25:48-25:48",
    "speaker" : "Andy",
    "text" : "It was."
  },
  {
    "text" : "Yeah. It was their uh it was their first first down of the game.",
    "speaker" : "Connor Ireland",
    "timestamp" : "25:49-25:53"
  },
  {
    "timestamp" : "25:53-25:56",
    "speaker" : "Andy",
    "text" : "Yeah. He was so and they were favorites."
  },
  {
    "timestamp" : "25:56-25:57",
    "text" : "Think about that.",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Yeah. They were favorites at home.",
    "timestamp" : "25:57-25:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:00-26:03",
    "speaker" : "Connor Ireland",
    "text" : "What talk about a shit stomping."
  },
  {
    "speaker" : "Greg",
    "text" : "So imagine buying tickets to that game.",
    "timestamp" : "26:04-26:07"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, it was raining too.",
    "timestamp" : "26:07-26:08"
  },
  {
    "text" : "Oh yeah.",
    "timestamp" : "26:09-26:09",
    "speaker" : "Greg"
  },
  {
    "text" : "Pissing it down.",
    "timestamp" : "26:10-26:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:10-26:27",
    "text" : "It was not a good thing. That's one thing you don't have to worry about as a Pats fan, is like Am I gonna pay a lot of money for tickets and show up and just be miserable the whole time? Yeah. I was thinking that too. Like they'll lose close games, but"
  },
  {
    "timestamp" : "26:27-26:32",
    "text" : "Yeah, like how often do the Patriots ever even get blown out? At home?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Well yeah, especially at home. I like legit can't think of one.",
    "timestamp" : "26:32-26:35"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:36-26:39",
    "text" : "Yeah. Losing by two scores at home. I don't know."
  },
  {
    "timestamp" : "26:39-26:49",
    "speaker" : "Andy",
    "text" : "Even Even like just in general, like how often I I don't know, how often does that even happen? Like that they're scattering Yeah."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "I think I can think of a I think what was the Ray Rice Ravens playoff game. That was a good one. Yeah. That's a good one. What was it? Opening night against the ch opening night against the Chiefs was that like two thousand that was pretty bad.",
    "timestamp" : "26:50-27:06"
  },
  {
    "timestamp" : "27:06-27:07",
    "speaker" : "Steve",
    "text" : "Ooh, yep."
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "27:08-27:13",
    "text" : "Eighteen or When what's his face went went nuts on us?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "27:13-27:14",
    "text" : "Kream Hunt."
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "27:14-27:17",
    "text" : "Uh Kareem Hunt, yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "There was that was it, two thousand like nine playoff game where they lost to Sanchez. And Rex Ryan. Oh yeah.",
    "timestamp" : "27:17-27:26"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:29-27:30",
    "text" : "I went to that game."
  },
  {
    "text" : "It was fucking miserable. Oh.",
    "timestamp" : "27:30-27:33",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah that yeah I watched that with or let's see.",
    "timestamp" : "27:33-27:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Well that's probably a good launch into my other stat here. They said at the beginning, if you notice the jets were wearing their road whites. And I guess they must have changed her name to include New York Jets this year as opposed to just Jets. Oh. Because they were still under five hundred at Giant Stadium. I think it was called back then what MetLife is now. Such a fucking loser approach. Like, oh, we had a pretty good road record last year. Let's wear a road to our own home that we play is named after a different team. And I bet they're still not above 500 in that stadium because they're the fucking jets and they suck.",
    "timestamp" : "27:38-28:19"
  },
  {
    "text" : "The place is a dump too.",
    "timestamp" : "28:19-28:21",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "28:21-28:24",
    "speaker" : "Steve",
    "text" : "It's a dump. It's no character there."
  },
  {
    "text" : "Hated that stadium. Have you been there, Connor? To MetLife?",
    "timestamp" : "28:24-28:28",
    "speaker" : "Greg"
  },
  {
    "text" : "To MetLife? No, I'm Metal Lance. Oh. Driven past Yeah, God, it's just gross looking over there. It's just a s it's like a swamp, huh?",
    "speaker" : "Connor Ireland",
    "timestamp" : "28:28-28:42"
  },
  {
    "speaker" : "Greg",
    "text" : "And it's middle of nowhere. There's no character. It's disgusting.",
    "timestamp" : "28:43-28:48"
  },
  {
    "text" : "There's nothing around it. It's like an industrial park.",
    "speaker" : "Steve",
    "timestamp" : "28:49-28:51"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "28:52-28:52",
    "speaker" : "Greg"
  },
  {
    "text" : "It's literally just surrounded it's surrounded by meadowlands and it's just gross and barren.",
    "speaker" : "Connor Ireland",
    "timestamp" : "28:55-29:02"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. And they can't even get 500 there because they're a bunch of pussies. Tell me to watch every second of this game and I loved it.",
    "timestamp" : "29:02-29:10"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. You know who else loved it? Bill Belichick. Yes. The amount of times they'd show him on the signs and he just had that smirk on his face. You know the one that he had when he was running the clock down against the Jets. This past year? On like that the the clock thing that the used against them. Yeah, and he had that just like shit eating grin on his face. Like just just like a half a smirk. He had that on this entire second half.",
    "timestamp" : "29:10-29:37"
  },
  {
    "timestamp" : "29:37-29:50",
    "speaker" : "Steve",
    "text" : "His best one was right after the Kevin Falk touchdown. Yeah. Which was his first of his career for sure. Really? I got a nice because he saw I saw Falk keeping the ball, so I'm assuming it's his first touchdown."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh. Uh well he was the starting running back in 2000, so I would have hoped he'd scored at least one rushing touchdown then. Huh. So maybe but maybe it's been a while. I think some someone needs to check his stats. All right, stat checker. Check it. And while you're doing that, I want to talk. Yeah, you're this you're the fucking stat guy. Dude, a mean tuna steak.",
    "timestamp" : "29:50-30:14"
  },
  {
    "speaker" : "Greg",
    "text" : "He's still eating it. Yeah, it's a big tuna steak.",
    "timestamp" : "30:15-30:18"
  },
  {
    "text" : "I thought you could eat.",
    "speaker" : "Andy",
    "timestamp" : "30:19-30:20"
  },
  {
    "text" : "Don't talk to me about eating, Andy.",
    "timestamp" : "30:22-30:24",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm just saying I can eat. I would have finished that by now. I'm looking it up. He scored a bunch of touchdowns before.",
    "timestamp" : "30:25-30:32"
  },
  {
    "timestamp" : "30:34-30:35",
    "text" : "Oops.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "It was his seventh touchdown, but alright. First of this year though. He definitely kept the ball. Yeah. I wonder if he kept all of them. I mean it's not like he was scoring a shit ton of touchdowns. May as well, right? Or maybe it's because they beat the Jets. Who knows? But I want to go back to the uh the fake punt because I think that drive was my turning point of this game. Because the Jets went three and out yet again. And then they did the fake punt, which converted their first first down. And then I think it was the very next play. They hit a big play to Santana Moss that drove a to the Patriots twenty yard line, like, oh shit, they might actually score some points here. And it's like 20 to nothing. So you know they score a touchdown, they're down two touchdowns, and this is all of a sudden a game. The very next play was Victor Green's 90-yard pick six. Um, and the same Victor Green who uh was the leading tackler for the Jets the year before, and they just like didn't want him back, I guess.",
    "timestamp" : "30:35-31:33"
  },
  {
    "text" : "Yeah, I don't know.",
    "speaker" : "Steve",
    "timestamp" : "31:33-31:34"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:34-31:36",
    "text" : "So we left on real bad terms?"
  },
  {
    "text" : "They they were definitely talking about that. I didn't know that much about it.",
    "timestamp" : "31:36-31:39",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:40-31:49",
    "text" : "No, me neither. Did either of you Connor or Greg do you either of you guys know anything about that? No. What? The Victor Greek to Green saga."
  },
  {
    "timestamp" : "31:50-31:59",
    "speaker" : "Connor Ireland",
    "text" : "Oh, y no. I I I probably b back when it was going on, but it it it had escaped me. Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "31:59-32:05",
    "text" : "But he retired as a jet, I guess, so it couldn't have been that bad. And that was like two years after."
  },
  {
    "text" : "Yeah, you put one year in New England, one year in New Orleans, and then he was gone.",
    "timestamp" : "32:06-32:10",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "32:10-32:29",
    "speaker" : "Greg",
    "text" : "Yeah. But he like signed he signed like a one day contract with the Jets so he could retire as a jet. So but interestingly the Wiki Wikipedia Didn't even have didn't have him as like you know they do like the additions and subtractions. He wasn't on there."
  },
  {
    "speaker" : "Andy",
    "text" : "No, he wasn't, was he?",
    "timestamp" : "32:30-32:31"
  },
  {
    "text" : "Which I think sounds like there's a conspiracy afoot. Hmm. Somebody's been washing the Wikipedias.",
    "timestamp" : "32:31-32:38",
    "speaker" : "Greg"
  },
  {
    "text" : "Maybe we should update the Wikipedias. But Green was also in the last game the one that forced and recovered the fumble on Jerome Bettis, too. So he's had himself a hell of a start to this season.",
    "speaker" : "Andy",
    "timestamp" : "32:38-32:50"
  },
  {
    "text" : "He probably drops off though. This is his last interception of his career.",
    "timestamp" : "32:51-32:54",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "32:54-33:22",
    "speaker" : "Andy",
    "text" : "Yeah, well he was kind of like the third safety on this team, because it was still Lawyer Malloy and Tabucky Jones were the starters. But the Patriots were at certain points running three safety sets out there, which I don't think you will ever see. Well, you might see again. Just because teams are going lighter now. Yeah. I think maybe to counter the whole spread offense and the RPO, you'll see m like a lighter but still guys that can take."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "33:23-33:25",
    "text" : "Their second round pick."
  },
  {
    "text" : "Yeah, that's true. And they drafted a bunch of like hybrid uh linebacker guys too, like outside linebackers. Same idea. But yeah.",
    "speaker" : "Andy",
    "timestamp" : "33:25-33:34"
  },
  {
    "speaker" : "Steve",
    "text" : "And the Patriots starting two CPUs back then, absolutely nasty.",
    "timestamp" : "33:35-33:39"
  },
  {
    "text" : "I feel like they won for the whole first half of this dynasty. Yeah. Because you go from Lloyd Malloy moving on directly to well maybe the whole dynasty. Because you go from Lloyd Malloy to Rodney Harrison to Pat Chung, right?",
    "timestamp" : "33:40-33:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Just gonna throw Pat Chung in there",
    "timestamp" : "33:56-33:58"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean you move McCordy back there.",
    "timestamp" : "33:58-34:00"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "34:00-34:09",
    "text" : "You don't think Pat Chung's a good safety? You can say it's Lawyer Malloy, Rodney Harrison, and Pat Chung. Which one of these doesn't belong?"
  },
  {
    "text" : "Yeah, I agree with that.",
    "speaker" : "Steve",
    "timestamp" : "34:09-34:10"
  },
  {
    "text" : "He didn't play long enough.",
    "timestamp" : "34:11-34:12",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "34:12-34:17",
    "text" : "Yeah, fucking right, dude. Yeah, you gotta go McCourty.",
    "speaker" : "Steve"
  },
  {
    "text" : "McCordy's a free safety. He would be the Tabucky Jones in this. Situation.",
    "timestamp" : "34:18-34:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:23-34:37",
    "text" : "Love it. Tabucky's been a nice surprise though watching these games again. Yeah He's a physical player. Yeah, he was he's a lot bigger than I remembered him too. Big big big boy, yep.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that that dude can lay the wood.",
    "timestamp" : "34:37-34:39"
  },
  {
    "timestamp" : "34:39-34:41",
    "speaker" : "Steve",
    "text" : "And has the best name on the team."
  },
  {
    "text" : "He does. I'm still sad our sister didn't name her firstborn to Bucky. That would have been great.",
    "timestamp" : "34:41-34:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "She's got chances.",
    "timestamp" : "34:49-34:50"
  },
  {
    "timestamp" : "34:51-34:56",
    "speaker" : "Andy",
    "text" : "Oh yeah, she does, yeah. She's got another one coming. So hopefully that'll be Tabucky."
  },
  {
    "text" : "Boys, we got an update on the tuna steak. Is it finished yet? Kelly didn't finish hers.",
    "speaker" : "Greg",
    "timestamp" : "34:57-35:03"
  },
  {
    "timestamp" : "35:03-35:10",
    "text" : "I got it I got another half of steak, baby. Let's go. Going overtime on this fucking tuna steak.",
    "speaker" : "Andy"
  },
  {
    "text" : "God damn. You're gonna need a new stat guy.",
    "timestamp" : "35:12-35:17",
    "speaker" : "Greg"
  },
  {
    "text" : "I think we already did.",
    "speaker" : "Andy",
    "timestamp" : "35:18-35:19"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "35:19-35:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Connor, you're the new stat guy.",
    "timestamp" : "35:21-35:23"
  },
  {
    "timestamp" : "35:24-35:28",
    "speaker" : "Connor Ireland",
    "text" : "What? No, no no no, that's that's not a good idea."
  },
  {
    "speaker" : "Andy",
    "text" : "So so what good are you though? What do you bring in the table here, Connor? Your good looks?",
    "timestamp" : "35:30-35:34"
  },
  {
    "text" : "Um I I told you, I'm um I'm color commentary. I I I provide keen insight into specific you know, plays within the game, nuances. Um Steve kind of stole my thunder br bringing up Brady's uh reverse play action play. I was gonna do um A pretty big deep dive into that, but he kinda ruined it like he does a lot of things. So um yeah.",
    "speaker" : "Connor Ireland",
    "timestamp" : "35:36-36:05"
  },
  {
    "speaker" : "Greg",
    "text" : "Well let's circle circle around. Let's circle back to the play action then.",
    "timestamp" : "36:05-36:10"
  },
  {
    "text" : "I guess it wasn't like the deepest of dives. Right? I think it's something that's oh that's I I think that's something that he's always been a lead at and it's and it has always played in his favor um throughout his career. Like he's just been inc an incredible um sleight of hand, you know, not just the play actions like you were talking about that the direct snaps to Kevin Falk. Um He's just always been good at that kind of um the game within the game kind of stuff.",
    "speaker" : "Connor Ireland",
    "timestamp" : "36:14-36:48"
  },
  {
    "speaker" : "Andy",
    "text" : "Do we know if that's something he was good at in college too, or is this something he learned when he got to the NFL? I don't actually know the answer to that.",
    "timestamp" : "36:48-36:56"
  },
  {
    "text" : "I don't know. But I there is something. You know like that feeling when you're watching a play though and he does like a hard play action. And then he st he like spins his head around and like immediately goes off his back foot and just rips one. And before the camera even pans, you're like, that's a that's a completion. There's like there's no better feeling than watching him do that. Like spin around and not waste any time and just whoop.",
    "timestamp" : "36:56-37:23",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "So I've gone through and I've been documenting all of his touchdowns as a Patriot, all those touchdown throws. And the amount of times he does that from the five-yard line where he just yeah, he does. He turns his back and bends over like in half as he's pretending to hand the ball off. And then just turns around and whips it basically at the goalpost and just hopes that his receiver is there. It's it's textbook at this point. There's probably like forty, fifty of them. granted of his 600 touchdowns, but still, like it's it that is, I think, the textbook Patriots offensive play. Like they ran it for years and it was unstoppable.",
    "timestamp" : "37:24-38:01"
  },
  {
    "speaker" : "Greg",
    "text" : "And like watching on TV, I feel like with Brady you can tell before you can see the receivers whether it's gonna be complete or not by his like body language as he throws it, you know? Yeah. If he's sitting there patting it. Happy feet. You can like, oh, he's throwing this away.",
    "timestamp" : "38:02-38:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "38:18-38:19"
  },
  {
    "timestamp" : "38:19-38:24",
    "speaker" : "Greg",
    "text" : "You know? But there's certain ones where he's like, zip. You're like, there's no way that's not caught."
  },
  {
    "speaker" : "Andy",
    "text" : "It's really as he's planting the back foot, it's coming out.",
    "timestamp" : "38:25-38:27"
  },
  {
    "text" : "You're like, oh yeah.",
    "timestamp" : "38:27-38:28",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Definitely. It doesn't it doesn't matter if the guy's covered. You know it's gonna be a completion.",
    "timestamp" : "38:29-38:32"
  },
  {
    "timestamp" : "38:33-38:43",
    "speaker" : "Greg",
    "text" : "And that speaks to his like preparation too, of like he's a clinical player of If it's not there, I don't I don't force it. But if it is there, I'm making that play, you know?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:44-39:20",
    "text" : "Oh, absolutely. And you just wonder how many times he's practiced that That whole like not not even just the the play action but even like the the jump twist that he did on the direct snap He literally could just stand there. And there wasn't there one play that he pretended to catch the ball and drop back for a pass when they ran that. And it was like they ran that as a like a draw play right up the middle instead of like a sweep. And the entire like defensive line bit on it too, because I thought he was actually dropping back for a pass. You you don't see that in any other quarterbacks, I don't think. I I've never seen anybody else do that where I thought I'd have to do that."
  },
  {
    "text" : "Tate Manning. Peyton Manning used to get blown a lot for his uh play action, if I remember correctly.",
    "timestamp" : "39:21-39:28",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, they only ever ran that one stretch play and then he would play action off of it.",
    "timestamp" : "39:29-39:34"
  },
  {
    "text" : "Yeah, but he was good at it, right?",
    "timestamp" : "39:34-39:35",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, that's true. To clear up Greg's uh comment for everybody listening, he didn't like Peyton Minn didn't blow it. He got blown.",
    "speaker" : "Steve",
    "timestamp" : "39:35-39:42"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, by like media and fans. Right. Yeah. Yeah. Brady. Which is to say that I'm not positive that he is that much better because it might might be a manufactured, you know.",
    "timestamp" : "39:42-39:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Fair enough. Yeah. And and Main would also do the uh he would also like walk away as if he was calling uh an audible as the direct snap happened. Which I think you said you do a couple times.",
    "timestamp" : "39:57-40:09"
  },
  {
    "timestamp" : "40:09-40:13",
    "text" : "Dude, I sneaky love Peyton now that he's retired. Me too.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know before.",
    "timestamp" : "40:17-40:18"
  },
  {
    "timestamp" : "40:19-40:34",
    "text" : "He's adorable. Did you did you hear about what they're doing? A golf tournament? No. Oh yeah, yeah, yeah. Tiger Woods and Pate Manning versus Brady and Mickelson. Yeah. That's fucking awesome. Yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, they had uh they had like a z they had a z they had a video chat today.",
    "timestamp" : "40:35-40:40",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "40:40-40:41"
  },
  {
    "text" : "Peyton went on Peyton went on today as in w for the folks listening, uh May seventh, twenty twenty. Um Payton went on payton went on a tangent today about I guess it's getting played in like Tampa or Florida somewhere.",
    "timestamp" : "40:41-40:56",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "40:56-40:56",
    "speaker" : "Andy",
    "text" : "Yes."
  },
  {
    "text" : "And Payton was like I wish they I I wish we were playing somewhere where they hate you, Tom, like Boston. It was so funny.",
    "speaker" : "Connor Ireland",
    "timestamp" : "40:57-41:05"
  },
  {
    "text" : "Didn't he say that uh the reason they were doing it in Tampa was because uh Brady was on house arrest? So they couldn't do it anywhere else because of all the shit that he been doing for breaking and entering.",
    "timestamp" : "41:05-41:16",
    "speaker" : "Andy"
  },
  {
    "text" : "Peyton was like, yeah. He's like, Yeah, we we gotta do it in Florida now since Tom's B and E is So in house arrest, he's got the uh what the ankle brace",
    "timestamp" : "41:16-41:27",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm telling you, I love him.",
    "timestamp" : "41:28-41:29"
  },
  {
    "timestamp" : "41:30-41:32",
    "speaker" : "Greg",
    "text" : "Dayton does it for me now."
  },
  {
    "text" : "Yeah, his uh his like commentary, he he was doing some like uh like film review thing, I think it was on YouTube or something. And it was actually really good and he did it on um Tom Brady's overtime drive against the Kansas City Chiefs the other year.",
    "timestamp" : "41:32-41:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "41:51-42:09",
    "text" : "Oh, are you talking about the details? Like Kobe does a detail and he'll talk about different it's like an ESPN thing called detail. Yep, Peyton did do one on Tom. But Yeah. Yeah, it's called Detail. Um It was amazing. Kobe's done one on like yeah."
  },
  {
    "text" : "It's a shame they didn't get him for Monday night, because I think he'd be really good at it.",
    "timestamp" : "42:10-42:14",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "42:14-42:22",
    "text" : "Oh yeah, I think he'd be another Tony Romo. He he can't be worse than fucking Booger. Dad fucking Deirdor.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Fucking Booger. The guy's name is Booger. Like what are we doing? Man, his name is Booger. Yeah, this is the biggest sports event, like weekly. in the United States and we got Booger out there commentating.",
    "timestamp" : "42:22-42:37"
  },
  {
    "timestamp" : "42:38-42:44",
    "text" : "The fuck I mean I mean to be fair my nickname was Booger but then I fucking graduated third grade and it wasn't anymore, you know?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "42:45-42:46",
    "text" : "Exactly. Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "42:47-42:51",
    "speaker" : "Andy",
    "text" : "They grown ass mate, like you know what? No, my n my name's my name's Ronald, but call me Burger."
  },
  {
    "text" : "Yeah, they gotta fix that. The fucking Mighty Night the Money Night Football is in shambles. That's what happens when you let ESPN do anything these days.",
    "speaker" : "Greg",
    "timestamp" : "42:51-42:59"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:59-43:11",
    "text" : "It seems that way, yeah. And what do we have in the uh the three hour announcement? The draft. The draft. No, the uh they're they're announcing the the schedule tonight, and it's a three-hour event."
  },
  {
    "timestamp" : "43:12-43:13",
    "speaker" : "Steve",
    "text" : "It's three hour back."
  },
  {
    "speaker" : "Andy",
    "text" : "Where are we going this year?",
    "timestamp" : "43:14-43:15"
  },
  {
    "text" : "But I'm not back warned. Where are we going this year? Vegas. Are they they're playing at Vegas?",
    "timestamp" : "43:15-43:20",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "43:21-43:21",
    "speaker" : "Andy",
    "text" : "Bucks are."
  },
  {
    "text" : "Oh, I like it, Andy. I didn't see that uncommon. Caught me off guard, but I'm into that.",
    "speaker" : "Greg",
    "timestamp" : "43:23-43:30"
  },
  {
    "text" : "I'm not sure I'm into that yet. I was actually just before this. I found out that I could download updated rosters on an old Madden. And so I did that, and I was beating the shit out of the Buccaneers with the Patriots. In Tampa. Fuck them. Those uh those guns for the pirate ship are gonna they're gonna they're gonna be silent today.",
    "speaker" : "Andy",
    "timestamp" : "43:30-43:49"
  },
  {
    "timestamp" : "43:50-43:52",
    "speaker" : "Greg",
    "text" : "You're a weird kid"
  },
  {
    "text" : "You have no idea. Seriously. I mean you do, but not really.",
    "speaker" : "Andy",
    "timestamp" : "43:52-43:55"
  },
  {
    "timestamp" : "43:56-44:12",
    "speaker" : "Greg",
    "text" : "It's like a thirty-five year old does how I green rosters from Twenty years ago and then acting out his like deep Oh, Andy."
  },
  {
    "text" : "It's like revenge it's like re It's like revenge video game porn is what it is. It's revenge video game porn.",
    "timestamp" : "44:12-44:20",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "You know what? I should do that. I should just fucking what I do. I I put it on rookie because why the fuck out of the way?",
    "timestamp" : "44:20-44:26",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Why would you argue pull it on them? Fuck it. Andy, you have a mortgage. You have children. What are you doing, dude? I have children. That's why I'm so excited. Well we I stand by it's still just ridiculous.",
    "timestamp" : "44:26-44:44"
  },
  {
    "timestamp" : "44:47-45:08",
    "speaker" : "Andy",
    "text" : "That's the worst part. Oh. No, that's the best. I don't want to play video games for a fucking challenge. I want to play video games so I can be a goddamn superhero. I got all the rest of my life. Uh I got to halftime before I had to make dinner and it w I was up twenty-eight nothing. You're actually kicking fields."
  },
  {
    "timestamp" : "45:08-45:09",
    "text" : "Last time I played Madden.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "No, it's tw I got my buddy twenty eight nothing. Brady's already thrown a pick and fumbled it. God damn right he has.",
    "timestamp" : "45:09-45:18"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "45:19-45:26",
    "text" : "What were you gonna say, Steve? Last time I played, Matt, I had the same thing. I played with Scott. We were both a Patriots, beat the shit out of the Jets on rookie mode."
  },
  {
    "speaker" : "Greg",
    "text" : "Exactly. Wait, wait, wait. Let me hear about this too. You play video games. with someone on the same team?",
    "timestamp" : "45:26-45:34"
  },
  {
    "timestamp" : "45:34-45:35",
    "speaker" : "Steve",
    "text" : "Yeah, oh yeah. Oh yeah."
  },
  {
    "text" : "Co-op is great. What is going on? I'm not a video game guy, but that's weird, no? No. That's co-op. It's weird. It's weird. Thank you, Connor.",
    "speaker" : "Greg",
    "timestamp" : "45:36-45:51"
  },
  {
    "speaker" : "Andy",
    "text" : "Like why wouldn't you just play against each other? We may have to put a poll.",
    "timestamp" : "45:51-45:55"
  },
  {
    "speaker" : "Steve",
    "text" : "Because then someone has to play as the Jets.",
    "timestamp" : "45:55-45:57"
  },
  {
    "timestamp" : "45:57-46:04",
    "speaker" : "Andy",
    "text" : "Right, exactly. Yeah. Fuck that. And if you both play as a Patriots, then the Patriots are gonna lose and you don't want that."
  },
  {
    "text" : "Yeah, I I just g I I just get I'm like I get like Beavis and Butthead like you fucking chucklehead like fucking playing the Patriots versus the Jets. With your t shirts over your head. Like it just it doesn't make any sense.",
    "timestamp" : "46:05-46:24",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "No, that's actually kind of very surprisingly accurate actually.",
    "speaker" : "Andy",
    "timestamp" : "46:24-46:29"
  },
  {
    "timestamp" : "46:30-46:35",
    "speaker" : "Greg",
    "text" : "Say go home to tell your wife, but babe, babe, I beat 'em seventy-three to nothing."
  },
  {
    "text" : "Oh no, she knows to leave the room when I'm doing this. You should have seen me. Like, oh no, the pants are coming off again. Time to go. Going out.",
    "timestamp" : "46:36-46:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:44-46:46",
    "speaker" : "Steve",
    "text" : "I mean it is revenge porn. Yeah."
  },
  {
    "timestamp" : "46:46-46:51",
    "text" : "This is what I'm saying. Andy, are you reading another New York Times article on Dan Diodor?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "46:53-47:00",
    "text" : "My parents are off, aren't they? Come on. Do you guys still go to like Jets blogs and just read about how terrible their team is?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "47:01-47:05",
    "speaker" : "Andy",
    "text" : "Oh I love going to the the AFC East uh subreddits on Reddit."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, I love doing that. Yeah. I mean the jets SP stuff.",
    "timestamp" : "47:05-47:10"
  },
  {
    "timestamp" : "47:10-47:17",
    "speaker" : "Andy",
    "text" : "I like doing it after major teams too. Like after the pages beat them, and they're just so salty and oh it's beautiful."
  },
  {
    "timestamp" : "47:17-47:25",
    "speaker" : "Steve",
    "text" : "This team has no direction. Everyone sucks. The whole front office is bullshit. Stam Darnold's pretty good though."
  },
  {
    "timestamp" : "47:26-47:29",
    "speaker" : "Andy",
    "text" : "To be fair, that's what the Patriot subreddit is like now."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. It is interesting to see it is interesting to see who the fans revolt on with like bad teams and like which players are allowed to be in their graces.",
    "timestamp" : "47:29-47:41"
  },
  {
    "timestamp" : "47:42-47:53",
    "text" : "And there's always one that they're like, well you know you know who doesn't suck? The backup running back. Yeah, exactly. Yeah. It just needs more playing time. Yeah. Especially for the Bills for some reason. They love their backup running back, wherever it is. Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "And then they trade their backup running back or cut their backup running back, Danny Woodhead, and he goes to the Patriots and like turns into a stud.",
    "speaker" : "Greg",
    "timestamp" : "47:54-48:02"
  },
  {
    "timestamp" : "48:03-48:05",
    "text" : "Yeah. That was beautiful. God damn.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:05-48:09",
    "speaker" : "Greg",
    "text" : "That's our segue back into this game. I love it. All right."
  },
  {
    "timestamp" : "48:10-49:01",
    "text" : "So oh just give up here's a segue. Speaking of studs, Willie McGuinness is finally healthy. This is uh this part of part of the um the Boston Globe article stuff that I was reading. And it fucking shows he was every we had three batted balls Um one of them was on fourth down, so uh blew a fourth down conversion. He also had um an offensive pass interference called. F like for him, like on him, because uh he dropped back in coverage and I think it was like Wayne Corvette or someone like that tried to light him up as the pass was in the air and got called for an offensive pass to Ferris, which is great. And then they were trying to block him on a screenplay and he got up so quickly that as Curtis Martin caught the ball, um, Willie McGuinness was already tackling him.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "He was Yeah, so it might be the worst screen I've ever seen.",
    "timestamp" : "49:01-49:04"
  },
  {
    "timestamp" : "49:05-49:43",
    "text" : "It was bad. But and he also had a sack in this game. I think he was the one that sacked uh Chad Pennington. I think Pennington was in by this point. I believe so. There was a few sacks. But he was I mean we talked about it a little bit last week too where he was just kind of like it was like watching Gronk play offense was watching William McGinnis play defense. He's just like wading through people. Like he's playing with with like uh kindergartners and just like walking through them, kind of pushing them out of the way just so he can get to the bulk area. He just he was unstoppable in it. He gets my game. Say again, Steve.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "49:44-49:44",
    "text" : "Uh Willy.",
    "speaker" : "Greg"
  },
  {
    "text" : "We got Willie or a high tower.",
    "speaker" : "Steve",
    "timestamp" : "49:45-49:46"
  },
  {
    "text" : "That's a tough one. Willie for me. Willie came to mind at first, but you think about that play in the Super Bowl.",
    "timestamp" : "49:47-49:53",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:54-49:59",
    "text" : "Yep. That's that big F stop against the Colts in the playoffs."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "49:59-50:00"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:01-50:10",
    "text" : "No, it wasn't the playoffs, but yeah. That's a good one. Fourth down stop. Against the Colt in Indianapolis? Yeah, that's a big one too. Yeah. Connor, who you got? McGuinness or Hightower?"
  },
  {
    "timestamp" : "50:11-51:09",
    "text" : "Oh. It's so tough. I was I was just about to didn't Willie ha I forget what Super Bowl it was. He had like a game Or maybe it was against Peyton in in a in a AFC championship game. Uh Hightower's just got a couple of those big, like, huge plays in the Super Bowls. The stuff on um Marshawn that led to the Malcolm Butler interception. Yep. And then the the the strip the strip the strip of Matt Riot The strip of Matt Ryan that got recovered that a part of that comeback against the Falcons. He's just got some huge plays, but I I I think Willie I think Willie was probably I think Willie's I isn't Willie's got a chance to go to the well, maybe not the regular Hall of Fame, but uh Fuck. God, that's it. He's already in the Patriots. I'm going Willie. I'm going Willie too. I'm going Willie.",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "Willie McGuinness has set the record for those players playoff sacks too. Really? Yeah, he's got sixteen sacks in the playoffs. He also has most sacks in the playoff game with four and a half. Four and a half sacks in a playoff game. I think it was against the uh the Jaguars. I think he set the records both.",
    "timestamp" : "51:09-51:30"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "51:30-51:37",
    "text" : "Dude, he's staying quite a nineteen ninety-four to two thousand eight, man. He had a great career."
  },
  {
    "speaker" : "Andy",
    "text" : "He did.",
    "timestamp" : "51:37-51:38"
  },
  {
    "text" : "I thought he was like done after that third Super Bowl.",
    "timestamp" : "51:40-51:43",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "51:43-51:44",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, but no, he he still has And he's just a cool son of a bitch too, you know? Yeah. Oh yeah. You know some some players have that like cool factor. Ty Yeah, Ty Law has it. He's got that swagger.",
    "timestamp" : "51:44-51:59"
  },
  {
    "timestamp" : "51:59-52:17",
    "speaker" : "Connor Ireland",
    "text" : "Yep. So Willie McGuinness had the uh Injured McGuinness makes crucial play. Yep. Uh two thousand and the two thousand and three AFC playoffs against Cayton. I mean I think the drink. He stopped he stopped Edj Edger and James on the uh one yard line. I remember that play."
  },
  {
    "timestamp" : "52:17-52:22",
    "speaker" : "Andy",
    "text" : "That was in the playoffs, was it? I thought that was just was it? I didn't think it was."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Oh, like a carry s oh significant AFC play yeah, AFC AFC playoff seatings.",
    "timestamp" : "52:23-52:29"
  },
  {
    "text" : "Yeah, it was for like first place in the AFC or something like that. But yeah, yeah. And it was it was in Indianapolis too.",
    "timestamp" : "52:29-52:35",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "52:36-52:36",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "That was freaking huge button. Maybe we'll get him on. We should start tweeting.",
    "timestamp" : "52:36-52:39"
  },
  {
    "text" : "So much recency by So much recency bias obviously with Hightower. I mean he's made some huge plays.",
    "timestamp" : "52:39-52:47",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "52:48-52:48"
  },
  {
    "text" : "I think Willie was just a better in his prime was more dominant.",
    "timestamp" : "52:48-52:52",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "52:53-53:11",
    "speaker" : "Steve",
    "text" : "My only issue with Hightower is like, I don't know, I feel like he's always sorta injured where he was there for a while. That's true. He is, yeah. He I mean Iron Man, you know, snap dude like And it's actually I'm looking at stats. It's from like this season on. He's just an absolute rock."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh my god.",
    "timestamp" : "53:11-53:12"
  },
  {
    "text" : "16, 14, 16, 16, 16, 14, 13, 14 games. Could close out his career.",
    "timestamp" : "53:12-53:18",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yeah. Hightower could never. He's had so many injuries, the chest He's only got one ear chest of all sixteen games.",
    "timestamp" : "53:19-53:29"
  },
  {
    "text" : "But he's got seven skills. So Willie's twelve in New England, so",
    "timestamp" : "53:31-53:40",
    "speaker" : "Steve"
  },
  {
    "text" : "You know, but yeah, I think at this point I think it's real close. I think you're right, but I think that's a good thing. It's just like the Gustavo Steven and Terry, right?",
    "timestamp" : "53:40-53:50",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "53:50-53:53",
    "speaker" : "Steve",
    "text" : "What do you want? Big plays or consistency?"
  },
  {
    "speaker" : "Andy",
    "text" : "I think it's more, no, like we talked about with um Dion Branch or David Patton. Yeah. Like patent like branch has the numbers, but patent has a more memorable place. And that we decided Oh, I fully agree with that, but I don't know.",
    "timestamp" : "53:53-54:08"
  },
  {
    "timestamp" : "54:08-54:18",
    "speaker" : "Steve",
    "text" : "I was on Dion. Yeah, I was also on the I'm probably on Willie right now as well, but I don't know. I live high. Thanks underrated and underappreciated. Same as Willie in this team here, you know?"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "54:18-54:23",
    "text" : "Yeah. I don't know if Willie was ever underappreciated, but I hear what you're saying."
  },
  {
    "timestamp" : "54:23-54:54",
    "text" : "I think it was well he had some injury knocks to him kind of around this time. Yeah, he didn't. I think 2000, 2001, he didn't play a lot. He he was going through a bunch of injuries. And so people are like, 'cause he was a high draft pick, wasn't he? He was like their first round draft pick that year. Yeah. He was draft the same year as Bledsoe and they were both first they were the top two because Bledsoe was first overall. I think they had another first round draft pick and they picked McGuinness as well. And of course the two of them were, you know, we know what they turned out to be.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:54-54:59",
    "text" : "Were were they both like what ninety-four or something? Yeah.",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "55:00-55:28",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, yeah. Yeah, he was. Oh, he was drafted fourth overall in the first round. Are you kidding me? The Patriots had that came. Alright, so no, they weren't drafted the same year as Blood Sub. He was drafted fourth overall in 94. When was Black? 93. You're right. Okay, yeah. So Blazers drafted 93 first overall. And then four, McGinnis was fourth overall. Because it'll show you how great the Patriots were back then."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "55:29-55:32",
    "text" : "Yeah, and the Bengals picked Dan Wilkinson."
  },
  {
    "timestamp" : "55:34-55:38",
    "speaker" : "Andy",
    "text" : "Well to be fair, the Redskins picked Heath Schuler one pick before Willie McGuinness."
  },
  {
    "text" : "Oops. I'm back.",
    "speaker" : "Greg",
    "timestamp" : "55:39-55:41"
  },
  {
    "text" : "Oh good.",
    "timestamp" : "55:42-55:43",
    "speaker" : "Andy"
  },
  {
    "text" : "No, you were gone. You liar.",
    "speaker" : "Greg",
    "timestamp" : "55:43-55:46"
  },
  {
    "text" : "We're too just talking about Will William McGuinness, baby.",
    "timestamp" : "55:47-55:50",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "55:50-55:51"
  },
  {
    "text" : "Oh yeah.",
    "timestamp" : "55:51-55:52",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "55:52-56:03",
    "text" : "Did you know that uh Tom Brady and the Bucks are playing Saints week one? Yes. In New Orleans, that would be fucking sick.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "It'd be sick if we weren't in a in a I mean, if New Orleans and Bourbon Street was like regular Bourbon Street. I would borderline maybe book a f flight down there right now. Yeah. For week one chat. Uh talk. But if it's like you know, only fifteen to twenty thousand fans out in the stadium and bourbon streets shut down. Uh I don't know.",
    "timestamp" : "56:05-56:33"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:33-56:36",
    "text" : "It might be fun if you were a Bucks fan."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "I'm I am kind of I'm an honorary Tom Brady fan. has n not only given to the Patriots, but transforming New England into a city of champions champions and instilling that championship do everything it takes to win attitude across all of the Boston sports teams, I will follow Tom Brady into the fucking sunset on the last two years of his career. Okay? I'm and I don't care what anyone fucking thinks about me We're gonna look back on this and be like, hey, you remember how crazy it was that Tom Brady finished out the last two years of his career in Tampa Bay and won two Super Bowls? That was crazy. Yeah, and set all those records. Yeah, that's how I plan on looking back on it.",
    "timestamp" : "56:40-57:40"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "57:40-58:00",
    "text" : "So Me too. Tom Tom Brady is bigger than sports. I didn't say I wasn't a Brady fan. I'm a Brady fan. He's not a Bucks guy. He's bigger than like regional alliances, you know, or regional fandoms. He's he's a deity, you know? I'm with Steve here though."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "I I agree.",
    "timestamp" : "58:00-58:01"
  },
  {
    "timestamp" : "58:02-58:13",
    "text" : "I'd be fine if if Brady threw for six thousand yards. I yeah, I'd be fine if Brady threw for six thousand yards and the Bucks went eight and eight. And he threw for like seventy touchdowns.",
    "speaker" : "Andy"
  },
  {
    "text" : "Jesus, dude, the Bucks are the Bucks are like the least problematic. It's like Are you you really you you you are against the seeing the Bucs do well with Tom Brady under center? Give me a fucking break.",
    "speaker" : "Connor Ireland",
    "timestamp" : "58:13-58:27"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, they win a they win a Super Bowl that's gonna you're gonna be disappointed. Why? Because the Pats didn't win?",
    "timestamp" : "58:27-58:33"
  },
  {
    "text" : "Yeah. Let him have one dude. Why? You weren't saying that in 07 when the Giants won?",
    "timestamp" : "58:33-58:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:39-58:44",
    "text" : "Yeah, now it's going against everything Connor just said about instilling a winning culture in New England.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Well hey, if it cut hey guess what? If it's Patriots box in the Super Bowl, I'm cheering for the fucking Patriots. You know damn well that isn't happening. Okay? Patriots schedule just came out. We have the hardest schedule in Bill Belichick's career as a patriot the Patriots head coach. No, no, it is the It is we have the toughest strength of schedule in the NFL this year for the first time since Bill Bellish has been.",
    "timestamp" : "58:48-59:16"
  },
  {
    "timestamp" : "59:26-59:37",
    "text" : "You're so disappointed. I guess I'll go fuck myself then. Oh Jesus. Don't we play the",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "59:38-59:41",
    "text" : "NFC West this year?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yes. Dude at Kansas City in October. That one's tempting. Maybe. Depends on how the Pats are doing, I think. Back-to-back games in LA. Also tempting. Yeah? That'd be that'd be sweet to to go to both those games and just spend a week in California.",
    "timestamp" : "59:42-01:00:04"
  },
  {
    "speaker" : "Andy",
    "text" : "It's not like we're using our uh our PTO on anything else right now, right? Oh dude. One of them's a Thursday. Oh, there you go. Short week. Perfect.",
    "timestamp" : "01:00:05-01:00:16"
  },
  {
    "text" : "Yeah, I'm still telling you, Patriots are gonna squeak into the playoffs Oh, you know what's gonna happen?",
    "speaker" : "Greg",
    "timestamp" : "01:00:16-01:00:23"
  },
  {
    "timestamp" : "01:00:23-01:00:34",
    "speaker" : "Andy",
    "text" : "Patriots are gonna squeak in as the seventh seed in the playoffs this year. Because they've expanded it and then they're gonna go on to win the Super Bowl. It's wishful thinking. Calling it now. They're gonna get hot at the right time."
  },
  {
    "speaker" : "Greg",
    "text" : "It all hinges on our boy Studem.",
    "timestamp" : "01:00:34-01:00:36"
  },
  {
    "timestamp" : "01:00:37-01:00:49",
    "text" : "Just like the 08 uh Patriots did when Brady went down. They got hot right at the end, but if there was a a seven seed, they would have got in and they would have rolled. Because I was the yeah that they beat the shit out of the Cardinals who went to the Super Bowl. Calling it now.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:00:50-01:01:00",
    "speaker" : "Greg",
    "text" : "I disagree. Okay. I w alt I would like to see them do well, but doesn't sound like it. I wouldn't mind a tank. Uh a a tanking season would be alright for me."
  },
  {
    "text" : "We're gonna do the strategic tank. I've been talking I've been talking about this. We're building an elite defense and we're gonna s average four points a game on offense.",
    "speaker" : "Connor Ireland",
    "timestamp" : "01:01:02-01:01:10"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:01:11-01:01:13",
    "text" : "Yep. And then get Trevor Lawrence."
  },
  {
    "timestamp" : "01:01:13-01:01:38",
    "speaker" : "Connor Ireland",
    "text" : "Yeah, I don't even know about that. I just think I I I mean I hope so. I think I mean I've kind of drank the Kool-Aid on Trevor Lawrence. I think he's gonna be really good. Um but you g I mean the writing's on the wall, right? We haven't added one premier offensive weapon uh y outside of the A B experience uh experiment last year. We haven't added one premier offensive weapon. in basically two years now."
  },
  {
    "timestamp" : "01:01:39-01:01:45",
    "text" : "They've drafted an offensive weapon in the first round of the last two drafts. Yeah, but you can't look at this roster.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Sony Sony Sony Michelle is not an offensive weapon. I'm talking about a premier offensive weapon. I'm not talking about drafting one.",
    "timestamp" : "01:01:48-01:01:57"
  },
  {
    "speaker" : "Greg",
    "text" : "Steve's gonna be upset with that. I know Steve has all crunched himself.",
    "timestamp" : "01:01:57-01:02:02"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Sony Michelle, fucking Lawrence Moroney dancing the hole three uh two dot oh No way, dude. He has no burst. Last year was, I mean, it was glaring how little burst he has.",
    "timestamp" : "01:02:05-01:02:19"
  },
  {
    "text" : "You know what I'm looking forward to? Eleven one o'clock or four o'clock games. Oh nice.",
    "timestamp" : "01:02:19-01:02:26",
    "speaker" : "Steve"
  },
  {
    "text" : "I am as well.",
    "speaker" : "Greg",
    "timestamp" : "01:02:27-01:02:28"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "I always like you really, so you guys aren't big. See, I'm I'm in so many fantasy leagues. I I always appreciated that that they were well not like a sh not like an absurd amount, but I always appreciated that they were the later games so I could watch Red Zone for all the one o'clock games.",
    "timestamp" : "01:02:29-01:02:45"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:02:45-01:02:45",
    "text" : "That's a good point."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "And then when they came So when they came in on, you know, like the four o'clock game, it's like, hey, I got to watch like all my players on red zone. Now I get to settle in for the Patriots.",
    "timestamp" : "01:02:46-01:02:55"
  },
  {
    "speaker" : "Steve",
    "text" : "Only three of those eleven are four o'clocks.",
    "timestamp" : "01:02:56-01:02:58"
  },
  {
    "speaker" : "Andy",
    "text" : "That's a lot of fun.",
    "timestamp" : "01:03:00-01:03:01"
  },
  {
    "timestamp" : "01:03:01-01:03:04",
    "speaker" : "Greg",
    "text" : "Yeah. And the other four o'clock are my favorite."
  },
  {
    "timestamp" : "01:03:04-01:03:05",
    "text" : "Oh yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:03:05-01:03:14",
    "speaker" : "Greg",
    "text" : "Me too. Because you you can watch the one o'clock and then you watch the pats. And then you just like fall asleep in front of the night game."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:03:14-01:03:15",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:03:15-01:03:21",
    "speaker" : "Steve",
    "text" : "Yep. Yep. Not worse than staying up on a fucking Thursday. Monday."
  },
  {
    "text" : "Oh god, yeah.",
    "timestamp" : "01:03:21-01:03:21",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:03:22-01:03:37",
    "text" : "Dude, a Sunday night game at Seattle. I like that one. I like that one. Oh god. I heard Seattle's a nice city to visit. It's alright. Why you say that, Andy?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:03:37-01:03:41",
    "text" : "Uh city's fine, but I I'd go outside the city if I were to go there. I guess.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Woohoo. Oh yeah.",
    "timestamp" : "01:03:42-01:03:43"
  },
  {
    "text" : "No, it's nice outside. They got a bunch of hiking and shit.",
    "speaker" : "Andy",
    "timestamp" : "01:03:43-01:03:46"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I mean that that's all falls within visiting a city, right? Let's stop talking about the goddamn Pacific.",
    "timestamp" : "01:03:47-01:03:52"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:04:01-01:04:05",
    "text" : "Should we give out game balls and the best and worst thing and that's let's do some best and worst here."
  },
  {
    "text" : "Alright. And then once we're not live, let's talk about this schedule some more. Okay.",
    "timestamp" : "01:04:06-01:04:12",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:04:13-01:04:16",
    "text" : "All right, Steve, give give me your best and worst here.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Um besides things we haven't talked about, and again, I'm really happy I watched this game all the way to the end, just like that Steelers game The last kick return from the Jets. The dude, the returner comes like, he does a pretty good return. He comes flying through. And he runs into Pepper Johnson, who just lays him out like instinctively and just puts him on his ass.",
    "timestamp" : "01:04:16-01:04:37"
  },
  {
    "text" : "Former Jets linebacker, no less, Pepper Johnson.",
    "timestamp" : "01:04:38-01:04:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:04:41-01:04:49",
    "text" : "Yeah. And like a 20 years younger than we know now, Pepper Johnson, too. He just sat him down. It was awesome. Yeah, that was a great thing."
  },
  {
    "timestamp" : "01:04:49-01:04:56",
    "speaker" : "Andy",
    "text" : "And then that that play uh also got hit that great kick return also got called back for holding. So it didn't even count."
  },
  {
    "speaker" : "Greg",
    "text" : "He did have a little like smirk on his face when he did it too. Oh god, yeah.",
    "timestamp" : "01:04:57-01:05:00"
  },
  {
    "text" : "He knew exactly strut down the sideline. Yeah. He's a man. The worst was the like replays in the first half. I don't I forget where I s it might have been even the first game where they had like a replay counter, like how long it was taking them to do it. Oh yeah, they did it at a timer. But on one I was like I was hitting the ten second fast forward. I clicked it six times. I I got to the point where I was like I need to fast forward this. And I clicked it six times and they still hadn't come out with the decision. And then I looked 'cause lit by half. The second half was fifteen minutes shorter.",
    "timestamp" : "01:05:00-01:05:36",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, because of that one. And that that was just like uh whether or not it was a first down too, is all it was. Yeah. And it was it was blatantly not a first down. He was he was short by like two years.",
    "timestamp" : "01:05:37-01:05:48",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh that's uh that's why I can't watch these games. Like rewatch the whole thing. Even like like two and a half hours. Yeah, and then like you're sitting through shit like that and it's like oh those compact games are awesome that they do now.",
    "timestamp" : "01:05:49-01:06:03",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:06:04-01:06:14",
    "speaker" : "Andy",
    "text" : "Oh yeah, you got like cut forty five minutes. Yeah, yeah. Yeah, it's just play after play after play. That's great. We'll get there in 2009, I think, currently. How far back they go."
  },
  {
    "timestamp" : "01:06:14-01:06:29",
    "speaker" : "Steve",
    "text" : "Oh, also, just a fun fact. I saw the first fantasy football ad. Ooh, interesting. Yeah. For AOL fantasy football. I've been like waiting for this to come up and I can't believe it is this early."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:30-01:06:37",
    "text" : "You know what? I I haven't spotted I I wasn't gonna play fantasy football this year, but if there's AOL fantasy football still going, we're all doing it."
  },
  {
    "speaker" : "Greg",
    "text" : "Why weren't you gonna do it, Andy?",
    "timestamp" : "01:06:39-01:06:40"
  },
  {
    "timestamp" : "01:06:40-01:06:45",
    "text" : "I I don't know. I'm still done with fantasy football. I feel like why?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:06:46-01:06:48",
    "text" : "Greg's clearly invested here.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:06:48-01:06:52",
    "text" : "Yeah, I'm just you've always been a big fantasy guy. I'm wondering what changed.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:53-01:07:12",
    "text" : "Uh a couple things. I've been playing it for probably let's call it 20 years and I've never won once. So I realize I'm not very good at it. This it this includes leagues where it was literally me and Mike Mello together and I never won. I appreciate the honesty."
  },
  {
    "timestamp" : "01:07:18-01:07:21",
    "text" : "This AOL League ad that I saw was 18 years ago.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:07:22-01:07:24",
    "text" : "Alright, so yeah. It was about that long ago."
  },
  {
    "speaker" : "Greg",
    "text" : "You were an early adopter of fantasy, I remember that. I was, yeah.",
    "timestamp" : "01:07:24-01:07:27"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:07:29-01:07:38",
    "text" : "Um And also, I just feel like it's made me watch football games differently. I'm not watching it for the joy. I'm watching it for my fantasy football team."
  },
  {
    "timestamp" : "01:07:38-01:07:39",
    "text" : "I get that.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:07:39-01:07:44",
    "text" : "My player doesn't score a touchdown, I get all pissy. Yeah. I'm just I'm all done with that.",
    "speaker" : "Andy"
  },
  {
    "text" : "So the worst is watching games with people that are like that.",
    "timestamp" : "01:07:44-01:07:48",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Yeah. Well like, oh, don't throw it to him, throw it to my guy.",
    "speaker" : "Andy",
    "timestamp" : "01:07:48-01:07:52"
  },
  {
    "text" : "And it's a fuck perfect. Yeah, especially if you're invested in the game, like it's a Pats game or something.",
    "speaker" : "Greg",
    "timestamp" : "01:07:52-01:07:57"
  },
  {
    "speaker" : "Andy",
    "text" : "Or even when it's a Pats game and you have like somebody on the other team and you're kind of like having that sort of Inner battle of oh cool the the Patriots are losing, but my guy just scored, so I I'm winning my fucking fantasy football league like it matters.",
    "timestamp" : "01:08:00-01:08:14"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. I'm gonna put someone on blast right now, and you can probably guess who it is. The the fantasy guy. It's Mark Fratterelli, obviously. I thought it was gonna be Connor.",
    "timestamp" : "01:08:14-01:08:25"
  },
  {
    "text" : "Yeah, so did I.",
    "speaker" : "Andy",
    "timestamp" : "01:08:26-01:08:27"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "I thought it was me too.",
    "timestamp" : "01:08:29-01:08:30"
  },
  {
    "timestamp" : "01:08:33-01:08:38",
    "text" : "Yeah, I can see Mark being like that. Oh yeah. Car are you a big fantasy guy?",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I love it. I love it. I tr I try not to um you know, I I don't let it sway me when I'm watching the paths. I'm not like I don't care who scores for the Patriots, even if I have certain Patriots on my team. But like I I really love the one o'clock red zone. Um That's why I I uh when the Pats are just like, you know, always one of the top teams are always in in prime time. I I really enjoy that. And I I yeah, I I love fantasy.",
    "timestamp" : "01:08:38-01:09:10",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "I think the only reason I actually did fantasy for so long was because I would run my own league and it just gave me an excuse to abuse all my friends.",
    "speaker" : "Andy",
    "timestamp" : "01:09:11-01:09:20"
  },
  {
    "timestamp" : "01:09:21-01:09:58",
    "speaker" : "Greg",
    "text" : "Yeah now you have this. It was like the worst. It was it was the worst leagues ever, but also like very entertaining. Yeah. Like the banter banter was great, but like the structure of the league, you would never use like ESBN. com. You'd be like have some like fucking website you develop yourself. Like kick returns. Kick returner thing. You'd be like, oh, we got three quarterbacks. It's like, dude, Andy. Keep it simple. No way. But the newsletters, the yeah, the commissioner newsletters are always funny. Yeah, they were. Yeah."
  },
  {
    "text" : "Those were a good time. Yeah, those literally the only reason I did it was to shit on all my friends on a weekly basis. And now we have this. And now we have this, so yeah, I can just do it to you in real time. It's been even better. There we go. So I don't need fancy football anymore.",
    "timestamp" : "01:09:58-01:10:11",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm in it for team names anyways.",
    "timestamp" : "01:10:11-01:10:13"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:14-01:10:22",
    "text" : "Yeah, that's true. All right, uh Greg, give us your best and worst."
  },
  {
    "speaker" : "Greg",
    "text" : "All right. Um so best I think is uh week two. Sunday night game at Seattle. And then worst uh week twelve at Houston. What a shitty city. No one wants to go there.",
    "timestamp" : "01:10:23-01:10:46"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:47-01:10:48",
    "text" : "Jesus Christ."
  },
  {
    "speaker" : "Greg",
    "text" : "Yes, yes, I am fully involved in the schedule now that's been released.",
    "timestamp" : "01:10:49-01:10:52"
  },
  {
    "timestamp" : "01:10:53-01:10:56",
    "speaker" : "Andy",
    "text" : "Yeah, it sounds like it. All right, Con, what about you?"
  },
  {
    "timestamp" : "01:10:56-01:10:56",
    "text" : "So the w",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Hello Bob.",
    "timestamp" : "01:10:57-01:10:58",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:02-01:11:51",
    "text" : "The rest of us are so again I was Um the best it w I was just gonna say the Patriots defense as a whole. I don't know if it was completely them or just like Bill Belichick's gameplay I the because I was just looking like no one stood out in terms of like holy shit this guy had ten tackles. You know, like uh everyone, you know, it was just like It was a scheme, it was a game plan, and our defense just suffocated the Jets. Um we we s we got up big early on offense. And I d I don't know, we just knew exactly what they were gonna do. They were playing from behind our defense.",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:51-01:11:54",
    "text" : "They never let up either. Uh yeah, they didn't."
  },
  {
    "text" : "Special team. Special teams was great too, obviously. Um and then the worst it's Tough to say. I think I mentioned it earlier, but I guess it goes hand in hand. How a team can go until deep into the third quarter without having a first down when they're projected to be the favorites. is just pathetic.",
    "speaker" : "Connor Ireland",
    "timestamp" : "01:11:54-01:12:20"
  },
  {
    "timestamp" : "01:12:21-01:12:23",
    "text" : "That's bad. It really is.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Also, also, I wanted to I don't know if you guys heard Tom Brady's interview. At the end of this game. Oh, can you let me know if you can hear me. Can you can you hear this?",
    "timestamp" : "01:12:23-01:12:38"
  },
  {
    "text" : "No, I think you have to you have to share the screen with um with audio. Like you have to share the computer.",
    "timestamp" : "01:12:38-01:12:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Okay, hold on.",
    "timestamp" : "01:12:43-01:12:44"
  },
  {
    "text" : "Share computer sound. Checkbox.",
    "timestamp" : "01:12:44-01:12:47",
    "speaker" : "Andy"
  },
  {
    "text" : "Okay.",
    "speaker" : "Connor Ireland",
    "timestamp" : "01:12:47-01:12:47"
  },
  {
    "text" : "Ooh. Ooh. Oh. Oh yeah.",
    "timestamp" : "01:12:48-01:12:51",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh yeah. Oh yeah. Oh yeah. Oh yeah.",
    "timestamp" : "01:12:51-01:12:53",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Greg",
    "text" : "What was that? That was awesome.",
    "timestamp" : "01:13:01-01:13:03"
  },
  {
    "speaker" : "Steve",
    "text" : "It was a feedback loop created by the speakers getting picked up by the microphone.",
    "timestamp" : "01:13:04-01:13:08"
  },
  {
    "timestamp" : "01:13:08-01:13:10",
    "text" : "That was awesome.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:13:10-01:13:24",
    "speaker" : "Connor Ireland",
    "text" : "It's like techno. Okay, we're we're not gonna do that because that was a nightmare. I was like I don't know what the hell that was, but catchy tune."
  },
  {
    "speaker" : "Greg",
    "text" : "Well just say repeat what he said, Connor, because I picked up on that too.",
    "timestamp" : "01:13:25-01:13:28"
  },
  {
    "timestamp" : "01:13:29-01:13:59",
    "speaker" : "Connor Ireland",
    "text" : "He he was just talking about how he's like you know a little bit of disrespect and they've got a chip on their shoulder now. And I fucking loved it. They they're just like they it it puts a chip on their shoulder. You could just see little glimpses into you know the fire that Tom Brady has. God, he's so goofy looking. I don't know who said it last week. He's You know, these early days Tom Brady's are he is goofy looking how uh you know, suave he is now and how much more chiseled his jaw is."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, the button, Brady. He's got the butt the hair flick. Remember that like the hair.",
    "timestamp" : "01:14:00-01:14:06"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:14:06-01:14:36",
    "text" : "The ramp. The ramp on the front of your head. Yeah. He has he has the ramp. Yeah. So he he uh I just kinda liked I just kinda liked what he said afterwards. He was he wasn't braggadocious. He was just kind of humble, but he was like, yep, we're uh we see everything you guys are saying and it pisses us off pisses us pisses us off and yeah we use it as motivation I don't know. I I love me some Tom. You know that."
  },
  {
    "text" : "It is, it is. And that's that's right, you guys? There's always a little chip on our shoulder. You know, I think every time we go out, you know, we uh re realize we have to prove it. But You know, you're all you're only as good as your last performance. You know, respect that does it by winning World Championships. We did we earn respect last year. And if we didn't then I guess people are just like I said, just too ignorant to you know just too soon to get it.",
    "speaker" : "Speaker 6",
    "timestamp" : "01:14:39-01:14:59"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Oh yeah. Dude, it's kind of it's pretty forceful where it's too ignorant or too stupid to realize it. I was like, okay.",
    "timestamp" : "01:15:00-01:15:08"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:15:08-01:15:08",
    "text" : "Yeah."
  },
  {
    "text" : "All right, Tommy.",
    "speaker" : "Greg",
    "timestamp" : "01:15:08-01:15:09"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yeah.",
    "timestamp" : "01:15:10-01:15:10"
  },
  {
    "text" : "But he looks like a twelve year old when he says it.",
    "speaker" : "Greg",
    "timestamp" : "01:15:11-01:15:14"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yeah, wearing he's got the tie on. Mm-hmm. Yep. I I enjoyed that.",
    "timestamp" : "01:15:16-01:15:23"
  },
  {
    "timestamp" : "01:15:24-01:15:36",
    "speaker" : "Greg",
    "text" : "It's early doors like that same same type of stuff he says now. He's like, yo, we're win w we're winning world championships. That's all I care about. As like a second year player, I dig that."
  },
  {
    "timestamp" : "01:15:36-01:15:38",
    "speaker" : "Steve",
    "text" : "He's just foreshadowing."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yep. That's all I got. It it was basic I mean Pretty straightforward. Pat's defense was the best. Uh Pat's defense, Tom Brady's interview, and then the Jets offense. My God. First one first down Late in the third quarter. That's uh appalling.",
    "timestamp" : "01:15:39-01:16:00"
  },
  {
    "text" : "Vinny Testaverdi, I told you. He sucks. He sucks, Vinny Testaverdi. Played for twenty years and sucked every single one of them. Old Greenhead. Remember that Steve? When we did the live Spanish to English translation. All right Andy, you're on mute, bud. Oh that explained. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:16:00-01:16:30"
  },
  {
    "timestamp" : "01:16:30-01:16:34",
    "text" : "Yeah, no I have I have been on mute this whole time talking to you guys. All right, great.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that was nice. I I do that all the time on conference calls. Yeah. Like, why don't these motherfuckers listen to me? Yeah.",
    "timestamp" : "01:16:34-01:16:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:16:43-01:17:16",
    "text" : "Assholes. Yeah. All right. Uh I'm my worst gonna play off of Connors um is the Jess offense. They had eighteen plays in the first half. Uh the Patriots had a drive to end the first half that went 19 plays. So that's not good. Um and uh we kind of touched on this before where Matt Turk the punter was their leading rusher. But it actually gets worse than that. He he led the team in rushing with 14 yards in one run. Their second leading rusher was backup quarterback Chad Pennington, who had one run for nine yards."
  },
  {
    "text" : "Hmm.",
    "speaker" : "Greg",
    "timestamp" : "01:17:16-01:17:17"
  },
  {
    "text" : "Um the looking for at all. No, the Jets running back as a committee had four, five, six rushes for nine yards.",
    "timestamp" : "01:17:18-01:17:28",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Hey Andy, it's not about stats. All right. You play to win the game.",
    "timestamp" : "01:17:28-01:17:34"
  },
  {
    "timestamp" : "01:17:35-01:17:37",
    "text" : "That's why they wore their white jerseys.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:17:37-01:17:43",
    "speaker" : "Greg",
    "text" : "That's this year. Oh, is that cool from that's this year? Herm Edwards, yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:17:43-01:17:59",
    "text" : "Nice. Because last year actually we I don't even think we touched on it, but um the the playoffs That quote from last year. That would that was the Colts last year because they manic couldn't stop throwing interceptions. I'll be surprised if we win another game. Yeah. So this is this is P."
  },
  {
    "timestamp" : "01:17:59-01:18:07",
    "text" : "Yeah, we'll probably touch on it Yeah, they go two and five to start this year, and that's when uh old Hermie Boy loses it.",
    "speaker" : "Greg"
  },
  {
    "text" : "I can see that. Um My best was that this was one of the biggest beatings that the Patriots have ever given to the Jets up to this point.",
    "timestamp" : "01:18:09-01:18:18",
    "speaker" : "Andy"
  },
  {
    "text" : "Ooh, you want second one. I got it. Yeah. The first biggest one, 1979.",
    "speaker" : "Greg",
    "timestamp" : "01:18:19-01:18:24"
  },
  {
    "text" : "It was. Yeah. Oh. What was the score? I was gonna say butt fucking man.",
    "timestamp" : "01:18:25-01:18:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Fucking rain man. What was the score? 56 nothing.",
    "timestamp" : "01:18:30-01:18:35"
  },
  {
    "text" : "Fifty-six to three.",
    "speaker" : "Andy",
    "timestamp" : "01:18:36-01:18:37"
  },
  {
    "text" : "Ah How did you know that? Did you read it too? Fucking Rain Man, Andy. Well we know that's not true.",
    "speaker" : "Greg",
    "timestamp" : "01:18:37-01:18:45"
  },
  {
    "text" : "But we also clipped out the same yeah, exactly.",
    "timestamp" : "01:18:45-01:18:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I clipped it out of the newspaper when I was twelve years old and I put it in a scrapbook and then I read it today in my scrapbook.",
    "timestamp" : "01:18:49-01:18:57"
  },
  {
    "text" : "So I clipped it out uh from my internet scrapbook today, at the ripe old age of 37 years old.",
    "timestamp" : "01:18:56-01:19:04",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:19:04-01:19:13",
    "text" : "Um, that's the difference. This is true. I was scrapbooking at twelve, you're doing it at thirty five. Say maturity.",
    "speaker" : "Greg"
  },
  {
    "text" : "About yeah, I just still haven't grown up yet. Um maybe when I'm four.",
    "speaker" : "Andy",
    "timestamp" : "01:19:14-01:19:18"
  },
  {
    "text" : "Like the butt fumble game for me though. I was watching it and I was like, man, I can't believe I forgot this game based on how much I hate the Jets and how much I enjoyed that butt fumble game. These are like my own smart for me.",
    "speaker" : "Steve",
    "timestamp" : "01:19:19-01:19:30"
  },
  {
    "timestamp" : "01:19:31-01:19:36",
    "speaker" : "Andy",
    "text" : "Yeah. And this is kind of it's uh it's bec it's Go ahead, Connor."
  },
  {
    "timestamp" : "01:19:37-01:20:09",
    "speaker" : "Connor Ireland",
    "text" : "I was just gonna contend that Yeah, I've never liked the Jets, but I think the r the real Jets hatred came during the uh Rex Ryan era. So I think the butt fumble game was much more enjoyable. Like Obviously they're New York, you're like, fuck New York, but really the the disdain for the Jets came during the uh Rex Ryan era, in my opinion. You think so? At least during the d at least during the early dynasty yeah, during the early years of the dynasty, yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "See, I thought it was this era was when it really got defined.",
    "timestamp" : "01:20:09-01:20:13"
  },
  {
    "text" : "Parcel and Martin.",
    "timestamp" : "01:20:13-01:20:14",
    "speaker" : "Speaker 6"
  },
  {
    "timestamp" : "01:20:14-01:20:22",
    "speaker" : "Greg",
    "text" : "Yeah, especially because of the Yankees stuff that was going on at the same time. He kind of like had the Jets and Yankees as like one entity. Yeah."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "I guess it came to a Crescendo. Is that the word?",
    "timestamp" : "01:20:23-01:20:27"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, yeah. Yeah. And apex?",
    "timestamp" : "01:20:27-01:20:29"
  },
  {
    "text" : "When yeah, when um Oh peaking. During the Rex the Rex era.",
    "timestamp" : "01:20:30-01:20:35",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, Man Gini got the Man Genie incident too.",
    "timestamp" : "01:20:36-01:20:40"
  },
  {
    "text" : "Spy game. Okay, two touche. Touche.",
    "speaker" : "Connor Ireland",
    "timestamp" : "01:20:40-01:20:44"
  },
  {
    "text" : "Yeah, I but I think there were like peaks as well. I think there were peaks all all across that. Yeah, because right now I don't know if there was a peak.",
    "speaker" : "Andy",
    "timestamp" : "01:20:46-01:20:52"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't get any like I don't get my rocks off when the Pats beat the Jets these days, you know?",
    "timestamp" : "01:20:52-01:20:57"
  },
  {
    "timestamp" : "01:20:57-01:21:01",
    "text" : "No, yeah and same with like the Herm Edwards era too. Like I I didn't really care.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:21:01-01:21:11",
    "speaker" : "Steve",
    "text" : "Oh, I feel the exact opposite. I I love watching the Patriots beat the fuck out of the Jets. Like the Rex Ryan and like Man G winning that game. That's my valley."
  },
  {
    "text" : "These are my beats. Steve Brown was touching himself too uh he was he was ball handling to the shots of Curtis Martin standing on the sidelines looking forlorn Yes.",
    "speaker" : "Andy",
    "timestamp" : "01:21:12-01:21:21"
  },
  {
    "timestamp" : "01:21:22-01:21:26",
    "text" : "Staring into the abyss. Yep, like this is my life now.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "We have the goddamn jets. Peaches just won the fucking Super Bowl. If I'd stayed there, I could be a Super Bowl champion right now.",
    "timestamp" : "01:21:26-01:21:31"
  },
  {
    "timestamp" : "01:21:31-01:21:33",
    "text" : "That's a good point, Steve. That's a good point.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:33-01:21:50",
    "text" : "Yes, it is. Um, the one thing I did want to uh throw out there for you boys is when the Patriots blow out the Jets. They lose either they don't make the playoffs or they lose in the playoffs in heartbreaking fashion."
  },
  {
    "text" : "Like 1979 and 76 and 78.",
    "timestamp" : "01:21:52-01:21:56",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "79 they didn't they didn't make the playoffs. 88 they didn't make the playoffs. 2002 this year what happens? They win this uh spoiler alert and then also don't forget um 2010 Patriots beat the Jets 45 to 3 if you remember that game. Yeah. When Rex Ryan almost cried and had that season end.",
    "timestamp" : "01:21:57-01:22:23"
  },
  {
    "text" : "Yeah, I know. As a game I was at Right. And the the the worst part worst part about that game is uh I sat in traffic and like took me like three hours, four hours to get back to Salem, New Hampshire, and I dropped Mark off at his house and then I backed into his garage door.",
    "speaker" : "Greg",
    "timestamp" : "01:22:24-01:22:42"
  },
  {
    "timestamp" : "01:22:43-01:22:47",
    "text" : "Oh that was that Oh my goodness.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:22:47-01:22:49",
    "speaker" : "Greg",
    "text" : "Yeah, it was a tough day."
  },
  {
    "speaker" : "Andy",
    "text" : "That's rough. Yeah. Oh boy. Well Yeah, I can't stop that.",
    "timestamp" : "01:22:49-01:22:57"
  },
  {
    "speaker" : "Greg",
    "text" : "Well you you wanna you want a stat here to to wrap us up?",
    "timestamp" : "01:22:58-01:23:02"
  },
  {
    "text" : "Give me a stat to wrap this up.",
    "timestamp" : "01:23:02-01:23:04",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:23:04-01:23:16",
    "speaker" : "Greg",
    "text" : "After this game, Tom Brady in his career is 16 and 3 as a starter. This is true. It is."
  },
  {
    "timestamp" : "01:23:16-01:23:23",
    "speaker" : "Connor Ireland",
    "text" : "Yeah, they won it was that was their eleventh straight w straight win, uh eighth straight regular season game."
  },
  {
    "text" : "Yeah. Yeah, they hadn't lost in a long time. They hadn't lost since November 18th of the year before.",
    "speaker" : "Andy",
    "timestamp" : "01:23:23-01:23:29"
  },
  {
    "text" : "An underdog wagon too. Like how do you look at that and be like, yeah, no, jets. By one. Right. Yeah.",
    "timestamp" : "01:23:29-01:23:35",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Bob Ryan admitted defeat in the Boston Globe. Yeah.",
    "timestamp" : "01:23:36-01:23:41"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "He likes the J-E-T-S.",
    "timestamp" : "01:23:41-01:23:43"
  },
  {
    "timestamp" : "01:23:44-01:23:45",
    "text" : "Jets, Jets, Jets.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:23:45-01:23:49",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. Told everyone who asked me and plenty who didn't."
  },
  {
    "speaker" : "Greg",
    "text" : "What was I thinking? What do you think about Brian Andy? Ah, he's all right. Yeah, he's no Jackie McMullen, you know.",
    "timestamp" : "01:23:49-01:23:56"
  },
  {
    "text" : "Yeah, not many people are Jack Mac but I will not stand for any Bob Ryan slander. Slander Shank All you want. Do not slander Bob. Do not slander Bob Ryan. He's a little old and decrep he's been a little old and decrepit. He's been a little old and decrepit for the last 30 years. Okay. He is a very, very old man. I he's one of the best writers I I've ever seen.",
    "timestamp" : "01:23:58-01:24:25",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "So I love Bob Ryan too. Me too. We've been on the same side a lot today, Connor.",
    "speaker" : "Greg",
    "timestamp" : "01:24:25-01:24:32"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:24:33-01:24:35",
    "text" : "I'm a little worried. Are you two okay?"
  },
  {
    "text" : "Yeah. I know, it's not typical.",
    "speaker" : "Greg",
    "timestamp" : "01:24:35-01:24:37"
  },
  {
    "timestamp" : "01:24:37-01:24:41",
    "speaker" : "Andy",
    "text" : "No. That's putting it lightly."
  },
  {
    "timestamp" : "01:24:41-01:24:50",
    "speaker" : "Greg",
    "text" : "Yeah, in fact I'm starting to question my own like Sanity. I don't know. Bra brain yeah brain function. You know, like I"
  },
  {
    "text" : "Are you having a stroke?",
    "timestamp" : "01:24:51-01:24:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:24:52-01:25:02",
    "text" : "Yeah, that's what I'm that's what I'm considering. Because I know that Connor like Connor acts like a stroke victim, so"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:25:04-01:25:14",
    "text" : "Some only at Hermit Island after I've been like drinking for seven straight days I can't sometimes put together a full sentence. Give me a fucking break."
  },
  {
    "timestamp" : "01:25:15-01:25:17",
    "speaker" : "Andy",
    "text" : "Are you at Hermit Island now?"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "No, I I I feel like I've done okay. I feel like I've done okay tonight.",
    "timestamp" : "01:25:19-01:25:23"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, I agree.",
    "timestamp" : "01:25:23-01:25:25"
  },
  {
    "timestamp" : "01:25:25-01:25:30",
    "speaker" : "Connor Ireland",
    "text" : "I've got the smartest brown of the bunch uh agreeing with my every word, so I think I'm doing okay."
  },
  {
    "text" : "I have not agreed with anything you've said.",
    "timestamp" : "01:25:31-01:25:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:25:33-01:25:33"
  },
  {
    "timestamp" : "01:25:33-01:25:35",
    "speaker" : "Andy",
    "text" : "Even Greg doesn't agree with that."
  },
  {
    "speaker" : "Greg",
    "text" : "My grave my grave is getting deeper.",
    "timestamp" : "01:25:38-01:25:41"
  },
  {
    "text" : "Greg, who is the smartest brown?",
    "speaker" : "Connor Ireland",
    "timestamp" : "01:25:43-01:25:46"
  },
  {
    "speaker" : "Greg",
    "text" : "Well who's the smartest bird? Prior to like the last two hours, I would have said me, but now I'm like uh trick question. That's true. Mick Brown.",
    "timestamp" : "01:25:46-01:25:59"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:25:59-01:26:06",
    "text" : "Trick questions Ellie for not being on this podcast. Yeah, Ellie. Although she also lives in Brooklyn with three small children, so Yeah."
  },
  {
    "timestamp" : "01:26:06-01:26:14",
    "speaker" : "Greg",
    "text" : "It's probably Liana, you know Yeah. If we're putting potential in there. It's probably Ziggy. Rest and P's."
  },
  {
    "text" : "All right. And on that note, as I can see this is un unraveling quickly. We will be back next week for a Bond burner.",
    "timestamp" : "01:26:16-01:26:27",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:26:28-01:26:29",
    "text" : "A band banner.",
    "speaker" : "Greg"
  },
  {
    "text" : "Pats and Chiefs. A game for the ages that I don't even remember. I'm looking forward to watching it. I think this should be a good one.",
    "timestamp" : "01:26:30-01:26:37",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:26:38-01:26:53",
    "text" : "So we will Who the hell r remembers early 2000 Chiefs? I'm I'm just excited to dig through the notes and and the game and Dick Vermeel. Oh, Dick. I know the coach, it's Trent's basically.",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "01:26:54-01:27:01",
    "text" : "Save it for a nice. Yeah. I'm just I'm just uh wetting the appetites of our listeners. Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:27:01-01:27:06",
    "text" : "I mean how am I gonna fall asleep tonight knowing I got fucking Dick for Meal and Trent Green coming up?"
  },
  {
    "timestamp" : "01:27:07-01:27:09",
    "speaker" : "Andy",
    "text" : "Well you're not gonna fall asleep on your stomach, are you"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:27:13-01:27:13"
  },
  {
    "text" : "Joke's on you. I cut a hole in my mattress.",
    "speaker" : "Greg",
    "timestamp" : "01:27:13-01:27:16"
  },
  {
    "speaker" : "Andy",
    "text" : "It's a very small one though. We didn't actually need to, we just did it. And on that note, we will see you next week on the Patriots Dynasty Podcast. See you later, guys. Have a good one, boys.",
    "timestamp" : "01:27:17-01:27:31"
  }
]