[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:18",
    "speaker" : "Mom"
  },
  {
    "speaker" : "Andy",
    "text" : "Welcome back, Patriots Dynasty Podcast. Myself Andrew Brown. And with me today is my brother who's doing his best um Bill Cower impression I'd say. Steven. I don't know if we're gonna post a video of this, but I could I can maybe post a screenshot of that face you were just making.",
    "timestamp" : "00:23-00:40"
  },
  {
    "text" : "That's no, no.",
    "speaker" : "Steve",
    "timestamp" : "00:41-00:42"
  },
  {
    "speaker" : "Andy",
    "text" : "It was all chin and all mustache. And it was very oh Jesus and all teeth now? Great. Shot in Heimer. That was a Schottenheimer? I don't know. No, who who do we say did that face the other one?",
    "timestamp" : "00:42-00:55"
  },
  {
    "speaker" : "Steve",
    "text" : "Sorry.",
    "timestamp" : "00:55-00:56"
  },
  {
    "timestamp" : "00:56-00:57",
    "speaker" : "Andy",
    "text" : "Uh Ray."
  },
  {
    "timestamp" : "00:57-01:06",
    "speaker" : "Steve",
    "text" : "The Chiefs. The Chiefs. Dude, we literally just talked about this last week."
  },
  {
    "timestamp" : "01:07-01:09",
    "speaker" : "Andy",
    "text" : "We did, yeah, and I've already forgotten because fuck it."
  },
  {
    "speaker" : "Steve",
    "text" : "Dick Vermeel. Yes, that's who it was. All gums. Squint City.",
    "timestamp" : "01:10-01:16"
  },
  {
    "text" : "Squint City, that's right. Go the Lord. So it's just the two of us right now. Greg is dealing with storm issues. Apparently North Carolina's never had a storm before, so they lost power.",
    "timestamp" : "01:16-01:29",
    "speaker" : "Andy"
  },
  {
    "text" : "No, it's hurricanes.",
    "timestamp" : "01:30-01:31",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "But yeah, and Connor is apparently golfing, so he'll be here at some point. And then I have a special guest joining us later anyway. So we'll see who actually shows up for this episode. But right now it's the two uh the two workhorses anyway. The ones who actually watch the game, me and Steve Brown. So uh Steve, when you're done playing with your hair, you can uh Let me know what you thought of this game.",
    "timestamp" : "01:33-01:55"
  },
  {
    "timestamp" : "01:55-02:06",
    "speaker" : "Steve",
    "text" : "Well, we should probably pick like you know who's the real workhorses of the Patriots. I'm gonna go for Mike Vrabel because he catches his first touchdown in this game. Ooh, nicely done."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:06-02:50",
    "text" : "Um Workhorses of the Patriots. He caught me off guard. I would say, hmm. In this game, I would actually say kind of anybody on the offensive line. Because this was the top ranked defense in the NFL this year, uh, in the Chargers coming to town. Yeah. They k they mentioned it a bunch of times. Uh and there was some stat where um when the Patriots in the first quarter got into the red zone uh and scored a touchdown, it was the fourth time the opponent has actually entered the red zone the entire season. And the first touchdown given up in the red zone by the Chargers in week four, which is pretty fucking impressive."
  },
  {
    "speaker" : "Steve",
    "text" : "I thought that was just because they'd played crappy people at that point.",
    "timestamp" : "02:50-02:53"
  },
  {
    "timestamp" : "02:54-02:55",
    "text" : "Uh I think that was probably part of the channel.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "02:57-02:59",
    "speaker" : "Steve",
    "text" : "They're 3 0, but they're untested."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:59-03:40",
    "text" : "Right, right, right, right. Yeah. Um And the Patriots had been world beaters, so this was a test for for these Chargers. Um but yeah, so I mean speaking of these chargers, we're gonna go back and we look at them. Um, because usually we have Greg here to to do the the the teams. But um this Chargers is actually kind of a loaded team if you look at it. And having said all that, they started 3-0, beat the Patriots this week. Spoiler alert. Uh And so they started the season four and oh. How do you think they finished, Steve Brown? You think they made the playoffs? I appreciate your optimism, but no."
  },
  {
    "text" : "Well like they had LT Sayao Rodney.",
    "speaker" : "Steve",
    "timestamp" : "03:40-03:44"
  },
  {
    "text" : "Drew Brees a quarterback. Young Drew Brees.",
    "timestamp" : "03:44-03:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "It was his second year, right?",
    "timestamp" : "03:47-03:49"
  },
  {
    "text" : "I think so. Yeah, this is first year actually starting, because Doug Floody started last year.",
    "speaker" : "Andy",
    "timestamp" : "03:49-03:53"
  },
  {
    "speaker" : "Steve",
    "text" : "Seasonly one year behind Brady.",
    "timestamp" : "03:54-03:56"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:56-04:58",
    "text" : "Yeah. Uh the Chargers would go eight and eight this season. Really? It was it was not a good season for the Tri it started off really well. They won these these first four games. And uh actually they were at the bye they were six and one. Then they had their bye. And then they lost they won two more games the rest of the season. They had a two-game losing streak. What? And then yeah. Yeah, they were six and one at the bye and then they came back week nine and just forgot how to win Both their wins actually came in the game. So let's see. Uh the first game after the bye they lost forty-four-thirteen to the Jets. The same Jets that the Patriots blew the fuck off out of the other week. Lost a close one to the Rams. Beat the Niners in overtime. Uh got blown out by the Dolphins 30 to 3. Beat the Broncos in overtime and then lost to the Raiders, Bills, Chiefs, and Seahawks to end the season."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "04:58-05:01",
    "text" : "Wait, wait, so they lost to the entire AFC East."
  },
  {
    "speaker" : "Andy",
    "text" : "Except the highred. What? Which even more baffling. They they announced a stat that uh the The Patriots had won the last ten straight games against the Chargers. Yeah. Up until this. And they had won and the Patriots have won twelve games in a row up until this. So It was one of those things. But yeah. It was uh I'm not sure what happened. I don't see any injuries anywhere or anything in terms of charges. Right? Yeah. Who's a really good Yeah, and and Schottenheimer's a really good um really good regular season coach. He struggles in the playoffs, which I think is pretty well documented. Um Breeze had um, let's see, 3,200 yards, 17 touchdowns, 16 interceptions, so not bad. But kind of mediocre.",
    "timestamp" : "05:02-05:56"
  },
  {
    "timestamp" : "05:56-05:58",
    "speaker" : "Steve",
    "text" : "It was okay for back then, yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:58-06:02",
    "text" : "Yeah, L T ran for sixteen hundred yards, which is pretty reasonable."
  },
  {
    "timestamp" : "06:02-06:10",
    "speaker" : "Steve",
    "text" : "Second year, yeah. So this is one of his like I mean he did good his rookie year, but I think this is his first year where he Establish himself as like an elite back."
  },
  {
    "text" : "Yeah, this was his breakout year, exactly.",
    "timestamp" : "06:10-06:12",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "He was super good in this game too. I fucking hate LT, but we'll cover that. We'll cover how much I hate LT.",
    "timestamp" : "06:13-06:18"
  },
  {
    "text" : "Oh, we'll definitely get to that real quick. But uh yeah, no, they were um kind of middle of the road in both offense and defense, surprisingly. I don't know. They gave up like a shit ton of points down down kind of the second half of the season. So I don't know what shifted 'cause they were really good in the first half, because in those first four games they gave up six, three, fifteen, and fourteen points, and that fourteen was CR, New England Patriots. But after that, it kind of the wheels fell off and they started giving up a little bit. Yeah, and I I think they came in hurt too. Like they were talking about how I think it was Rodney Harrison, uh like ha struggled in practice the week before, but still decided to play and and like did a good job, I thought.",
    "timestamp" : "06:18-07:09",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:09-07:12",
    "speaker" : "Steve",
    "text" : "But uh Yeah, no, they're both really good."
  },
  {
    "timestamp" : "07:12-07:43",
    "text" : "Yeah, but both both of them, Sao and Harrison made the Pro Bowl. Um No, sorry, uh Sayo did and Donnie Edwards the linebacker as well. Those two linebackers made the Pro Bowl. But Rodney did also LT made the Pro Bowl. So they had a a decent team going into And Tim Dwight. Right. The original well, maybe not the original white, gutty wide receiver. That might go to um what's the name of the Jets, Wayne Corbet. Wayne Corbet.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:43-07:46",
    "text" : "I did I I hate the Jets, but I do like Wayne Corbet.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:46-07:51",
    "text" : "I I have a begrudging respect for Wayne Corvette, I think. Just like I do ver a pit man."
  },
  {
    "timestamp" : "07:54-07:55",
    "text" : "Yeah, he was no good.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "07:55-08:13",
    "speaker" : "Andy",
    "text" : "And he would take so many shots going across the middle and he'd get like concussions all the time, but he'd still keep playing. He was like Yeah, he was one of those guys that you hate you you didn't really hate you begrudgingly accepted that he was good, but you weren't a huge fan of him unless he was on your team. Probably similar to like Sayao and uh and and Rodney Harrison."
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know how you can hate Rodney. Come on.",
    "timestamp" : "08:13-08:16"
  },
  {
    "text" : "Uh he would play kind of just I don't know.",
    "timestamp" : "08:16-08:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:20-08:24",
    "text" : "I saw him uh, you know, butt slaps to the Peaches players."
  },
  {
    "timestamp" : "08:24-08:26",
    "speaker" : "Andy",
    "text" : "Yeah, usually after trying to take their fucking heads off."
  },
  {
    "timestamp" : "08:30-08:31",
    "speaker" : "Steve",
    "text" : "Yeah, yeah."
  },
  {
    "timestamp" : "08:31-08:36",
    "text" : "And that's how I like to think I play uh recreational soccer. Just inside the lines.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:38-08:40",
    "text" : "You you play poorly, Andy. You just play poorly."
  },
  {
    "speaker" : "Andy",
    "text" : "No, I just I just hack people who try to go by me. And then slap them on the butts when when they're picking themselves off the ground.",
    "timestamp" : "08:41-08:47"
  },
  {
    "speaker" : "Steve",
    "text" : "For the San Diego Chargers quarterback room, I think this year, Breeze, Rivers, and Flutie.",
    "timestamp" : "08:50-08:57"
  },
  {
    "speaker" : "Andy",
    "text" : "Breeze was there, Flutie was there.",
    "timestamp" : "08:57-08:58"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm pretty su I'm pretty sure they mentioned it.",
    "timestamp" : "09:01-09:03"
  },
  {
    "text" : "Great question. Uh I don't see his name on here. If he did he never threw a pass. Let's check the roster real quick.",
    "timestamp" : "09:04-09:15",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "09:15-09:17",
    "speaker" : "Steve",
    "text" : "That's true. We do need our stack guy."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:17-09:28",
    "text" : "We do. Alright, so there we go. Uh position quarterback Drew Brees. Now these other guys have Doug Floody."
  },
  {
    "text" : "No, he's 2004. I was wrong. I'm an 80th.",
    "speaker" : "Steve",
    "timestamp" : "09:29-09:31"
  },
  {
    "text" : "Good effort though. You're only two years off.",
    "speaker" : "Andy",
    "timestamp" : "09:32-09:34"
  },
  {
    "timestamp" : "09:35-09:47",
    "text" : "I like the I totally don't remember the whole I mean I remember the outcome of the Saints having both Drew Brees and Philip Revers and be like, ooh, which one do I want? But I don't remember anything more than that.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "09:47-10:30",
    "text" : "No, I thought what happened was Drew Breeds got injured like severely And so the Saints drafted not the Saints, the Chargers drafted Phillip Rivers and basically just cut Drew Brees loose because he hadn't been great. And then I think it was the Dolphins had their pick of Drew Brees or Oh, who is that other quarterback? Dante Culpepper. Dante Culpepper, yes. Exact oh my goodness. Ryan Story, what a great time to join. That is perfect. Nice to see you in your rocket arm. I'm gonna say homeless beard, but um this is an audio podcast, so luckily for you.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "10:30-10:32",
    "speaker" : "Ryan Storie",
    "text" : "That's an insult to people with beards."
  },
  {
    "timestamp" : "10:32-10:57",
    "text" : "It's very we're not we're insulting you So this is the this is the perfect time to introduce our special guest. Uh I thought that with the us getting to the longest losing streak of the Patriots Dynasty era. The perfect person to bring on was my friend uh Ryan Story from my childhood friend, our family friend, the Ryan Story.",
    "speaker" : "Andy"
  },
  {
    "text" : "Noted loser, yes.",
    "timestamp" : "10:57-10:59",
    "speaker" : "Ryan Storie"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "11:00-11:17",
    "text" : "Well, the reason I wanted to bring you on, I think I told you this, but I haven't told the listeners yet, is that we have watched a handful of games together. And the pages have not won I think they've won one of them. And terrible bad fashion."
  },
  {
    "timestamp" : "11:18-11:22",
    "speaker" : "Ryan Storie",
    "text" : "I don't remember that what the outcome of that Texans game in like two thousand four was That was the one."
  },
  {
    "text" : "So so let's see we we've watched that one's probably the oldest one and that was the one where The um the commentators kept talking about how Adam Vinateri has never missed indoors and he missed like four field goals and it went to overtime and then he finally hit one. But he was like one for five or something ridiculous. Yeah. That was the first game we ever watched, and so that probably should have been a message. And then we watched uh a Cardinals game where the Cardinals came to July like early in the season. And the the Patriots were. Yeah, because the Cardinals had the ball and all they had to do was like run the clock out and they fumbled. The Pages recovered it, but then they missed the field goal and they were down by two and lost by two.",
    "speaker" : "Andy",
    "timestamp" : "11:22-12:08"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "That was Koskowski, right?",
    "timestamp" : "12:08-12:09"
  },
  {
    "text" : "I think it might have been early Goskowski maybe?",
    "speaker" : "Andy",
    "timestamp" : "12:10-12:12"
  },
  {
    "speaker" : "Ryan Storie",
    "timestamp" : "12:12-12:12",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Or late Vinatera, I don't remember.",
    "timestamp" : "12:12-12:14"
  },
  {
    "speaker" : "Ryan Storie",
    "timestamp" : "12:14-12:18",
    "text" : "Yeah, it wasn't even like 30 yards. It was short and he missed it."
  },
  {
    "timestamp" : "12:19-12:26",
    "speaker" : "Andy",
    "text" : "And yeah, and then we watched the Jets playoff game. I came to your house for that one. That was exciting."
  },
  {
    "text" : "Oh what the fuck, guys. Oh the the two thousand ten one?",
    "timestamp" : "12:27-12:31",
    "speaker" : "Ryan Storie"
  },
  {
    "speaker" : "Andy",
    "text" : "I think yeah, the one that they lost.",
    "timestamp" : "12:32-12:34"
  },
  {
    "timestamp" : "12:34-12:38",
    "speaker" : "Ryan Storie",
    "text" : "Yeah, that was a horrible game. I didn't know you were here for that one."
  },
  {
    "timestamp" : "12:38-12:39",
    "speaker" : "Andy",
    "text" : "Uh I left pretty much."
  },
  {
    "text" : "I don't remember a lot of that game. I knew people were here, I just didn't know who.",
    "timestamp" : "12:40-12:46",
    "speaker" : "Ryan Storie"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I was one of those. Probably shouldn't have been. And I think our uh coup de gras, if you will, was the last game we watched, we actually both attended.",
    "timestamp" : "12:47-12:57"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "Hold on, hold on, hold on. You missed the other Jets game that we watched at Feliche's.",
    "timestamp" : "12:58-13:02"
  },
  {
    "timestamp" : "13:02-13:03",
    "text" : "Which other Jets game?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "13:03-13:09",
    "text" : "Where Jerome Boger, whatever the hell his name is, decided to make up that pushing on the line rule.",
    "speaker" : "Ryan Storie"
  },
  {
    "timestamp" : "13:09-13:16",
    "text" : "Oh, that's right in overtime. And so the Jets missed the the winning field goal and they made up that bullshit call.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "And they hit it. No one in the world had heard of that call before that.",
    "timestamp" : "13:16-13:20"
  },
  {
    "text" : "That's true. Oh, and and nobody's heard it since.",
    "speaker" : "Andy",
    "timestamp" : "13:20-13:22"
  },
  {
    "text" : "Yeah, that was a special one.",
    "timestamp" : "13:23-13:24",
    "speaker" : "Ryan Storie"
  },
  {
    "timestamp" : "13:24-13:57",
    "speaker" : "Andy",
    "text" : "Yeah. And then so oh fuck Christ, there's even more games. Even better. But then our um our crowning achievement, if you will, of of loserdom. No, Ryan Story and I went to, we actually got tickets to and traveled to Gillette Stadium. And watched the Tennessee Titans beat the New England Patriots in Tom Brady's last game where his last throw was a pick six."
  },
  {
    "text" : "Yep, we saw history.",
    "timestamp" : "13:58-14:00",
    "speaker" : "Ryan Storie"
  },
  {
    "text" : "We may have made the stream.",
    "speaker" : "Andy",
    "timestamp" : "14:01-14:03"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "Yeah. I mean that was uh definitely one of the worst games. I mean we had fun, but definitely one of the worst games you could get. I haven't been to a game since 09 and that's the first one and then yeah. Not great, but what are you gonna do?",
    "timestamp" : "14:04-14:20"
  },
  {
    "timestamp" : "14:21-14:26",
    "speaker" : "Andy",
    "text" : "So yeah, and they don't lose when you watch the game or I watch the game, just when you watch them together."
  },
  {
    "speaker" : "Ryan Storie",
    "timestamp" : "14:26-14:33",
    "text" : "No, that's why we don't do it. Although we figured maybe it'd be different live and in the playoffs with everything on this line."
  },
  {
    "text" : "But it wasn't. Yeah, that was a hot mess. So I was actually hoping to have Brenda.",
    "speaker" : "Andy",
    "timestamp" : "14:33-14:43"
  },
  {
    "timestamp" : "14:49-14:51",
    "speaker" : "Ryan Storie",
    "text" : "Yeah. Yeah. That's a kick in the dick."
  },
  {
    "text" : "We've watched a lot of bad things happen to the pages together. So we literally just for probably since two thousand nine, we just stopped watching pages games together. And you're like the only Patriots fan within driving distance really that has invited me over and I've just said no",
    "speaker" : "Andy",
    "timestamp" : "14:52-15:10"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "I mean that's the thing. We don't even try anymore.",
    "timestamp" : "15:13-15:15"
  },
  {
    "timestamp" : "15:15-15:22",
    "speaker" : "Andy",
    "text" : "That's why we don't, yeah. And so we gave it one last college try and We ruined the patron."
  },
  {
    "text" : "So actually I want to ask you Do you want to watch the real question together?",
    "speaker" : "Ryan Storie",
    "timestamp" : "15:23-15:28"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:29-15:35",
    "text" : "Well, that's what I wanted to ask you. Is was that game the end of the Pages Dynasty?"
  },
  {
    "timestamp" : "15:35-15:41",
    "speaker" : "Ryan Storie",
    "text" : "Um Maybe. You could answer for a podcast or anything."
  },
  {
    "timestamp" : "15:41-15:42",
    "speaker" : "Andy",
    "text" : "Yeah, we're going a limp."
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "No, it's I don't know. I'm talk I'm talking myself in the stem. I think if stydum can play Okay, they'll be fine. And I think if they can build something, I don't think they're gonna be great this year, but I don't think they're so far away and they still get Belichick, which you know everyone says hot take, watch out. Um so I don't think Gol Jack's gonna look completely suck, so they must see something instead of them. Um so I don't I don't know if it's that. End? I guess it depends on how you define it. Is it the end of them winning championships? It could be.",
    "timestamp" : "15:43-16:19"
  },
  {
    "text" : "Right. And and so being good and competitive?",
    "timestamp" : "16:19-16:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "I don't think so. I think they'll still be decent. I mean they still get a good D",
    "timestamp" : "16:22-16:26"
  },
  {
    "speaker" : "Andy",
    "text" : "But but does the dynasty like as a as a as an idea end because Brady left? Because it's no longer Bill and Brady?",
    "timestamp" : "16:27-16:37"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "That's hard. I haven't really thought of that.",
    "timestamp" : "16:39-16:41"
  },
  {
    "speaker" : "Andy",
    "text" : "I know. Because at least the two are the ones that built it, and those two are the the mainstays all the way through these 20 years.",
    "timestamp" : "16:41-16:47"
  },
  {
    "timestamp" : "16:48-17:13",
    "text" : "I don't I I think it sticks with the team. I I mean you look at some of the other like you look at like the Celtics or other teams, players change. I mean, yeah, the core I guess was still there, but You know, you look at different teams, people come in and out. I mean, granted, it's not always Brady and Belichick. I mean, that's kind of a big deal, but I don't know. I think it's the laundry. So",
    "speaker" : "Ryan Storie"
  },
  {
    "speaker" : "Steve",
    "text" : "Right. You would make a terrible radio host if you're just like middle of the road.",
    "timestamp" : "17:13-17:19"
  },
  {
    "timestamp" : "17:20-17:23",
    "speaker" : "Andy",
    "text" : "Maybe. Maybe not. Go either way."
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "What are you gonna do?",
    "timestamp" : "17:25-17:26"
  },
  {
    "timestamp" : "17:26-18:25",
    "speaker" : "Andy",
    "text" : "So I I think about it. So I've been saying this since Brady left, but here's what I think is gonna happen. I think Brady and the Buccaneers are gonna be the next greatest show on turf. Just not on turf. They're gonna be on grass because they're in Tampa. And you can grow grass. Uh and they're gonna waltz into the playoffs, they're gonna make it all the way to the Super Bowl. Patriots are gonna scrape by on the strength of their defense, and Jared Stidham's just gonna keep him in enough games. And they're gonna get the seventh seed, because there is a seventh seed this year, right? And they're gonna scrape in as a walk-out team. They're gonna get hot right at the end, and they're gonna meet the the Buccaneers in the Super Bowl And then Beltrak's gonna come up with one of his patented uh put it in the Hall of Fame defensive schemes to stifle Brady like the uh Giants did back in Take your pick."
  },
  {
    "text" : "Years. So you're gonna be that guy? That guy that has the dream scenario?",
    "timestamp" : "18:25-18:29",
    "speaker" : "Ryan Storie"
  },
  {
    "text" : "That's how you get a range. That's how you be.",
    "timestamp" : "18:30-18:32",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:36-18:44",
    "text" : "All or nothing, baby. And if Greg was here and say, Patrick gonna suck. Yeah. And Steve's the middle."
  },
  {
    "speaker" : "Steve",
    "text" : "And then I'm over here saying, We're not even gonna play football this year.",
    "timestamp" : "18:44-18:47"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:51-18:52",
    "text" : "That was my original."
  },
  {
    "text" : "I don't think they'll suck. I mean I I think how how do you do you really see them beating Kansas City? I mean I I I don't see how you can get the KFC.",
    "timestamp" : "18:53-19:03",
    "speaker" : "Ryan Storie"
  },
  {
    "timestamp" : "19:04-19:09",
    "text" : "I think they can beat Kansas City because now all they have on defense are safeties.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "Yeah, that's true.",
    "timestamp" : "19:09-19:10"
  },
  {
    "text" : "And that's basically custom built to beat Kansas City and only Kansas City.",
    "timestamp" : "19:10-19:14",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "19:14-19:14",
    "text" : "Yeah.",
    "speaker" : "Ryan Storie"
  },
  {
    "timestamp" : "19:15-19:17",
    "text" : "And and maybe The Ravens? I don't know. We'll see.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "19:18-19:22",
    "text" : "I mean they did get jobbed last year. It's not like they haven't played good against KC.",
    "speaker" : "Ryan Storie"
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly, yeah. So So we'll see. But so uh not to put you on the spot, but did you actually manage to watch any of this game?",
    "timestamp" : "19:22-19:30"
  },
  {
    "text" : "I did. All right. Well the twenty minute version. But yeah.",
    "timestamp" : "19:30-19:34",
    "speaker" : "Ryan Storie"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "19:34-19:34"
  },
  {
    "text" : "Hell of a hell of a quarter and a half.",
    "speaker" : "Ryan Storie",
    "timestamp" : "19:35-19:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:38-20:36",
    "text" : "So that's the thing. So these Patriots and I don't think we well, we've kind of talked about it throughout, but They start off three and oh and they're beating the the piss out of teams. Like they blew the doors off the Steelers. That was like supposed to be a rematch of the AFC Championship game. Then they went to the Jets and embarrassed them. Yeah, Victor Green had a pick six, yeah, against his old team that he was disrespecting. And then yeah, then they had that Barnburn against the Chiefs where Not Jamal Lewis. Who am I thinking of? Priest Holmes. Literally last week, thank you. Priest Holmes ran for like 200 yards. And so you come in like, all right, well, you know, the it's the Patriots. They'll figure it out. Their strength is their defense. That was an anomaly. And then Lidanian Tomlinson comes in here and runs for more than 200 yards. It was quite a lot of yards. I think he it was probably the m it was the most he's ever run for up until then, at this point."
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "Yeah.",
    "timestamp" : "20:37-20:38"
  },
  {
    "timestamp" : "20:38-20:39",
    "speaker" : "Andy",
    "text" : "Which was like"
  },
  {
    "text" : "He only had yeah, this is a second season, fourth game, so Yeah, but he had two hundred and seventeen yards.",
    "timestamp" : "20:39-20:45",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "20:46-20:52",
    "speaker" : "Andy",
    "text" : "Which is a lot on twenty-seven carries. So it's not like he was running it forty times. Yeah."
  },
  {
    "timestamp" : "20:52-21:11",
    "text" : "Yeah, he was like, I said last week I kept getting Priest Holmes and LT confused, maybe because I watched these two games back to back back in the day. And they both absolutely burned us. That's probably it. I couldn't remember who I hated, but now I know I hate LT. Yeah. So these songs were banned.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I also hate LT for similar reasons but slightly different because I remember I I didn't watch any of these games I've realized. I may have watched the Steelers game. This was the only game this season I actually watched because we've talked about it before how I failed out of Penn State. And uh so at this point, yeah, Ryan, you know, you remember",
    "timestamp" : "21:12-21:35"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "But I was I wish I was on for that one.",
    "timestamp" : "21:36-21:40"
  },
  {
    "timestamp" : "21:41-21:44",
    "speaker" : "Andy",
    "text" : "Oh, it was it that was uh shit on Annie Brown week. You would have loved it."
  },
  {
    "text" : "That was a good week.",
    "timestamp" : "21:46-21:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:49-22:31",
    "text" : "Um but th at this point I had um traveled to England to spend time with family and I was living in a small town in England, working at a convenience store, opening it up at 4 a. m. But this was the only game so far that had been on TV in England because it was like primetime. It was a four o'clock game. Yeah. Over there, the game started like nine, ten o'clock at night. and went until midnight, one o'clock, and had to be at work at four. So I'm like, I'm gonna stand for this game. The Patriots are undefeated and they're blowing the shit out of out of teams. This is gonna be great. And it was one of those games where The Patriots lost, but they were always still in it, so I had to stay up till the very fucking end of it. And then they lost anyway."
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "And I mean they had the ball at the very end.",
    "timestamp" : "22:31-22:35"
  },
  {
    "text" : "Yeah. In in like a typical Brady situation.",
    "speaker" : "Andy",
    "timestamp" : "22:35-22:38"
  },
  {
    "text" : "It was entertaining. Frustrating in that they couldn't stop like the player I hate, but entertaining.",
    "timestamp" : "22:39-22:47",
    "speaker" : "Steve"
  },
  {
    "text" : "I mean it was entertaining now watching it at four o'clock in the afternoon. But not instead of sleep. I'm a big sleep guy, and this was not my favorite game. But I was uh I I think the the thing that stuck out to me most was How much they actually miss Troy Brown. Because the Patriots on third down sucked in this game.",
    "timestamp" : "22:47-23:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know.",
    "timestamp" : "23:11-23:11"
  },
  {
    "text" : "I thought that uh Deion Branch was an electric. I mean Dion Branch went off. Yeah, he had like a hundred and something yards, but I thought he stepped in and filled in that Troy Brown.",
    "timestamp" : "23:11-23:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "So like they were missing Dion Branch, but",
    "timestamp" : "23:21-23:23"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't think they were. But because Dion Branch was good on like first and second down. He's he had uh thirteen catches, 128 yards. But on those third downs where you absolutely have to have it, the Troy Brown was missing is what it was, I thought",
    "timestamp" : "23:23-23:39"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "I I actually watched it and was thinking kind of the opposite. I was like, holy shit, there's open receivers. But that's coming off of last year, so Kind of fresh in my mind.",
    "timestamp" : "23:39-23:49"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:50-23:54",
    "text" : "Yeah, that's true, because you haven't been watching the rest of these early Patriots games."
  },
  {
    "timestamp" : "23:54-24:12",
    "speaker" : "Ryan Storie",
    "text" : "So not watching them in sequence, all I have to compare it to is like you know, last year when no one could get any separation. And it's like, holy crap, that's what the offense used to look like when it worked. Right. Getting yards. All their trick plays were actually working. Antoine Smith was working."
  },
  {
    "text" : "Mark Edwards was was an actual like uh a fullback who was an integral part of the game.",
    "speaker" : "Andy",
    "timestamp" : "24:14-24:20"
  },
  {
    "timestamp" : "24:20-24:21",
    "speaker" : "Ryan Storie",
    "text" : "Yeah. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And they still lost and only put up fourteen points. But yeah, I mean this was the season where and I had kind of forgotten about this. Um like the 2001 season the Patriots had basically just been very run heavy, run first, second down, and try make Brady Convert the third down, whatever, hopefully third and short. But like Brady was really good on third downs, and that's what kept him in games. But this year they came out and let's say basically said, you know what? Fuck it, we're going five wide, and they actually talked about it the commentators talked about in this game, where they wanted to go five wide to tire out the Steelers defense. And so they did that basically the entire game and did like uh hurry up and all that sort of shit. And then it worked so well. Like they only had a few plays in the playbook, but then they kind of added a few more and they tried those against the Jets and it worked even better. So there's so they basically at this point just said, you know what, fuck, we're going five wide all the time. And this I thought was the one game we kind of almost saw it come back to bite him. Because it worked really well in the first half and they were moving up and down the field, but they couldn't quite finish drives, which I think we've seen in Patriots teams when they put the ball in Brady's hands, like 06, for instance, things like that. Or even like before they started winning these the second round of Super Bowls. They could always get into the red zone but they couldn't quite finish and they were never a great like red zone team because they didn't have that running back who could finish it off. But I don't know.",
    "timestamp" : "24:25-25:57"
  },
  {
    "timestamp" : "25:57-26:23",
    "speaker" : "Steve",
    "text" : "They definitely wasted a ton of opportunities in this. Yeah. We'll go like we'll start the game like They what score touchdown on a ball or play action from Brady and then the um Chargers immediately fumble the kickoff. Yeah. Which I timed this because there's that 30 second skip on the game. Oh yeah. Eight thirty second skips on the review"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:24-26:26",
    "text" : "I have your You do the math. That's four minutes."
  },
  {
    "speaker" : "Steve",
    "text" : "I did A36 of the review, my God. The only thing I hate more than this is LT. And then they overturn it and then they immediately like throw a swing pass to the fullback and he fumbles it. Yeah. So like we had a touchdown, a fumble, and then it's kind of like Piss that.",
    "timestamp" : "26:26-26:45"
  },
  {
    "text" : "The Pats go three and out from the San Diego thirty nine and end up having to punt the ball. Yeah.",
    "timestamp" : "26:45-26:50",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:50-26:52",
    "speaker" : "Ryan Storie",
    "text" : "They miss they missed a field goal too."
  },
  {
    "timestamp" : "26:52-27:12",
    "text" : "Yep, Vinateri miss it from the fucking that's so we do best and worse on this show, Ryan. I don't know if you actually listen, but at the end we do best and worst. I'm gonna do mine right now. My worst is that fucking garbage uh baseball diamond on the field. I know people love it because it's like, oh, it's different, but I fucking hate it. It looks stupid. Everybody gets like dirty and everything for no fucking reason.",
    "speaker" : "Andy"
  },
  {
    "text" : "That's actually my first note. Have the Chargers ever had a nice stadium? No, because I've gone from that to a soccer stadium, right? Yeah, and like they're aren't they sharing the Rams stadium? Like they've never had moving into this year. Until the Rams kick them out. Yeah. How they never had like a nice looking like Charger Stadium.",
    "timestamp" : "27:13-27:37",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Because they don't deserve it.",
    "timestamp" : "27:38-27:39"
  },
  {
    "speaker" : "Steve",
    "text" : "They're a shit stain on the other.",
    "timestamp" : "27:39-27:40"
  },
  {
    "speaker" : "Andy",
    "text" : "No wonder Rims. Yeah, uh oh rivers is going to a much better place than fucking Indianapolis.",
    "timestamp" : "27:40-27:49"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Hey, hey, they hang banners for anything there. They'll hang a banner for sign Phil Rivers.",
    "timestamp" : "27:49-27:55"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "Is anyone else sick of All the run that the Colts are getting already. Like people are talking them up like they're gonna be like this great team. Are they? Yeah I I've I've heard a lot of people saying they're gonna be really good this year. And like Rivers is gonna like make a huge difference.",
    "timestamp" : "27:56-28:12"
  },
  {
    "timestamp" : "28:12-28:24",
    "speaker" : "Andy",
    "text" : "Have they not seen Philip Rivers play? He's like Tom Brady, but with interceptions instead of touchdowns. And and and also kids instead of touchdowns."
  },
  {
    "text" : "Everyone forgets how bad he did last year already.",
    "timestamp" : "28:25-28:28",
    "speaker" : "Ryan Storie"
  },
  {
    "text" : "That's what I mean, yeah. Like he's not like he can still throw the ball, just not to who it needs to go to. I think two years ago was his like that was his Swan song when the Patriots beat the pants off of him in the playoffs. Like that was that was supposed to be their team of destiny, and then they got to the playoffs and and did Chargers playoffs things.",
    "timestamp" : "28:28-28:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Ryan Storie",
    "timestamp" : "28:49-28:51",
    "text" : "Yeah, I thought the Chargers are gonna win that game."
  },
  {
    "text" : "A lot of people did.",
    "speaker" : "Andy",
    "timestamp" : "28:52-28:53"
  },
  {
    "timestamp" : "28:53-28:57",
    "speaker" : "Ryan Storie",
    "text" : "I didn't. And I got exposed. Well of course you didn't."
  },
  {
    "timestamp" : "28:58-29:19",
    "text" : "I never do. That's how we roll. On the pages out of seem I mean the reason I'm doing this podcast is because I don't think the pages ever lose. So you're welcome. But yeah, watching them with me. Well that's yeah, exactly, which is why I don't watch it with you anymore. Although now we could probably start. We may just like have to rip off the band and watch off the first four weeks.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Ryan Storie",
    "timestamp" : "29:20-29:26",
    "text" : "Well I was gonna say if you really want to screw stittim, we can get together week one and just That's true, yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:26-29:28",
    "text" : "And and uh tank for Trevor, right?"
  },
  {
    "text" : "Yeah. Yeah.",
    "timestamp" : "29:29-29:30",
    "speaker" : "Ryan Storie"
  },
  {
    "timestamp" : "29:31-29:43",
    "speaker" : "Andy",
    "text" : "We could probably make that happen. So yeah, so if you're listening um and you you want us to to to submarine the Patriots season, let us know and we will uh Me and Ryan sorry I'll watch the game."
  },
  {
    "speaker" : "Steve",
    "text" : "Nobody wants that.",
    "timestamp" : "29:44-29:45"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:45-29:48",
    "text" : "Oh, there's people out there that want it. Have you not been on Twitter ever?"
  },
  {
    "text" : "Nobody who's listening to this fucking podcast does. Well, I mean that that's that's uh what Jessica's listening to this podcast. slogging through all of these episodes to get to week four, two thousand two, and like, oh yeah, got him.",
    "timestamp" : "29:49-30:03",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "30:03-30:19",
    "speaker" : "Andy",
    "text" : "Well that's because that's because they're suffering through the the pi the first four weeks of the Patriots Post Tom Brady because me and Ryan Story are watching the games together and they're losing in heartbreaking fashion. They're like, you know what? Let's go back to the good times and listen to when they actually didn't suck."
  },
  {
    "timestamp" : "30:20-30:23",
    "text" : "I bet they'll do it for some craft beers.",
    "speaker" : "Steve"
  },
  {
    "text" : "We'll do it for shitty beers, you kidding? Ryan's story is not a fancy man.",
    "timestamp" : "30:25-30:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "After that touchdown blown drive. That deep ball by Drew Brees was classic Drew Brees was excellent Yeah.",
    "timestamp" : "30:36-30:48"
  },
  {
    "speaker" : "Andy",
    "text" : "One of the best things I've got to do. I still think that Drew Brees went to the the um Doug Flutie school of throwing a football. where he has to put like a hundred and eleven percent into every single throw he makes or every movement he makes. Like I still remember like from last season Doug Flutie Doug Flutie, uh, you know when you kind of lift your foot when you're in shotgun to get the snap? He would like he wouldn't just lift his foot and put it down, he would like stomp. the his fucking foot and he like every single moon was completely overexaggerated and I'm pretty sure Drew Brees picked that up from him. And if not, I don't want to be corrected because it just feels right.",
    "timestamp" : "30:48-31:26"
  },
  {
    "speaker" : "Steve",
    "text" : "I wish we had a stats guy because I had uh it was fifty-three yards and that was his oh just looked it up. I'm the only stats guy. That was his career long at the time. And I was like, I wonder what his career long is now. Like, you know, hundreds and hundreds of touchdowns later.",
    "timestamp" : "31:27-31:44"
  },
  {
    "text" : "Wasn't that like his fourth game? Yeah.",
    "timestamp" : "31:45-31:48",
    "speaker" : "Ryan Storie"
  },
  {
    "text" : "Pretty much, yeah. So what is his career long?",
    "speaker" : "Andy",
    "timestamp" : "31:48-31:51"
  },
  {
    "speaker" : "Steve",
    "text" : "Ninety yards to Brandon Cooks. Oh shit. Remember that? Yeah. No. I remember this game. I remember this play at least. Yeah. Who is it against? It was kind of like that uh Brady to West Walker, the I think that was 98 or 99 yards.",
    "timestamp" : "31:52-32:09"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "32:09-32:10",
    "text" : "99, baby."
  },
  {
    "speaker" : "Steve",
    "text" : "It was the same idea. It was just like one-on-one on the outside and Cooks, obviously wicked wicked fast, just beat his dude off the line and Breeze just Same same kind of nice deep ball here.",
    "timestamp" : "32:10-32:20"
  },
  {
    "speaker" : "Andy",
    "text" : "About to hear it. Awesome. Oh well there you go. That sounds about right. Yeah, it does, doesn't it? Um but I I don't want any of us to take away from the fact that um this game was the first that we ever saw of the wonderful connection between Brady and his linebackers. It was Brady to Vrabel for the first time ever. I think we Mentioned it briefly earlier.",
    "timestamp" : "32:20-32:49"
  },
  {
    "text" : "Was that the first one?",
    "speaker" : "Ryan Storie",
    "timestamp" : "32:50-32:50"
  },
  {
    "text" : "This was the first one ever, yes.",
    "timestamp" : "32:51-32:52",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "32:53-32:56",
    "speaker" : "Ryan Storie",
    "text" : "Okay. He looked pretty excited, so I was wondering that actually."
  },
  {
    "text" : "Yeah. Well, I mean They're all excited to catch touchdowns at this point.",
    "timestamp" : "32:56-33:00",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh no, Brady looked excited. Like look how happy Tommy is.",
    "timestamp" : "33:00-33:04",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's true, yeah. The fact that it fucking worked. And the commentators, all they could talk about was uh how Vrabel must have been a really good blocker to be in there because of all the tight ends that the Patriots had at this point. And I was thinking to myself, are you seeing Cam Cleland play football?",
    "timestamp" : "33:04-33:22"
  },
  {
    "timestamp" : "33:23-33:39",
    "text" : "I had they also had a note on there. It was like there very briefly I had to pause it. This was uh he had 11 TDs. That was his 11th touchdown of the year, which is pretty solid for a game and a quarter or three games and a quarter, and he had nine different receivers",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:39-33:45",
    "text" : "Yeah, that's fucking crazy. This was the time when Brady's favorite receiver was the open receiver."
  },
  {
    "text" : "Who were the nine? They didn't say. I was wondering if we could come up with them because I mean we watched all the games.",
    "speaker" : "Steve",
    "timestamp" : "33:45-33:51"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, Ryan story, who's the nine? Why do you who's the nine people who caught touchdowns from Bray in the first four weeks? Pretty sure you could probably do this.",
    "timestamp" : "33:51-34:00"
  },
  {
    "timestamp" : "34:00-34:05",
    "speaker" : "Ryan Storie",
    "text" : "All right, so you got Probably branch. Yeah. Uh Forty."
  },
  {
    "timestamp" : "34:06-34:12",
    "speaker" : "Andy",
    "text" : "Yep. Forty had the first touchdown in uh In Gillette Stadium history, actually."
  },
  {
    "text" : "He got another one in this game too.",
    "speaker" : "Steve",
    "timestamp" : "34:13-34:14"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:14-34:23",
    "text" : "Yep. So Branch Fourier, Vrabel, of course, Troy Brown. Troy Brown's had a few. That's four. Pattons must have had one. That's five."
  },
  {
    "text" : "You'd think.",
    "speaker" : "Ryan Storie",
    "timestamp" : "34:24-34:24"
  },
  {
    "text" : "Oh, Daniel Graham had one. He had his first ever touchdown. We're all doing it. Join in Steve Brown if you got anything to add. Uh Antoine, do you have a touchdown at this point? No, I don't think so. Not a receiving. Uh Kevin Falk?",
    "speaker" : "Andy",
    "timestamp" : "34:25-34:44"
  },
  {
    "timestamp" : "34:45-34:48",
    "text" : "Yeah, because I thought it was his first one. That's right.",
    "speaker" : "Steve"
  },
  {
    "text" : "You thought it was his first ever, and he's been around. Yeah, he didn't even play like six six, yeah. Typical Steve Brown. So that's seven.",
    "speaker" : "Andy",
    "timestamp" : "34:48-34:56"
  },
  {
    "timestamp" : "34:56-34:57",
    "speaker" : "Steve",
    "text" : "I know one more."
  },
  {
    "text" : "Uh Camp Cleveland?",
    "speaker" : "Andy",
    "timestamp" : "34:58-35:00"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, you're Josh, you're not Cleveland.",
    "timestamp" : "35:00-35:02"
  },
  {
    "timestamp" : "35:02-35:10",
    "text" : "Was it really? Oh fuck. Alright, so that's eight. Uh ninth. Oh, was it um Donald Hayes?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:11-35:14",
    "speaker" : "Steve",
    "text" : "Oh yes, he had that hook route. Yep. That was it."
  },
  {
    "text" : "Yeah, early in the in the Steel games. That's nine. God damn. Remember Doll Hayes Ryan?",
    "timestamp" : "35:14-35:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Ryan Storie",
    "timestamp" : "35:21-35:23",
    "text" : "I was just gonna say that's a name I haven't heard in a long time."
  },
  {
    "text" : "Yeah, exactly.",
    "timestamp" : "35:23-35:24",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:25-35:27",
    "speaker" : "Ryan Storie",
    "text" : "So the patrons Cam Cleveland was one too, but Jesus."
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly, yeah. So we actually Realize that um the last game of two thousand one was against the Panthers when they blew him out. And In that game, Donald Hayes had two balls bounce off his hands that were intercepted and w both were actually returned for touchdowns, but one was called back for holding on the return.",
    "timestamp" : "35:28-35:48"
  },
  {
    "text" : "He's been decent this year so far though.",
    "speaker" : "Steve",
    "timestamp" : "35:49-35:51"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:51-36:07",
    "text" : "Yeah. And he's wearing eighty-one, so you look at him like, oh that's Rainy Moss. And then you realize no Rainy Moss. Yeah. He's the same build. He's he's Randy Moss who didn't run a four zero or something. Randy Moss I ran a five uh like a five-one."
  },
  {
    "text" : "So right after uh Mike Vrabel scores that touchdown? He comes back with two awesome plays of course it's three and out, right, when they get their ball back. Yeah, he does. They were like weirdly talking about that rookie center getting a start. Ball who happened to be from Londonderry, which they're doing. Jason Ball from Londonderry, New Hampshire, who played at UNH. Don't you worry about that. And then the show of Mike Raids absolutely just like him blocking air on his rush.",
    "timestamp" : "36:11-36:40",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "36:41-36:42",
    "text" : "Just kind of threw him out the way.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "As if you were on second down and then on third down he bats down the ball. It was pretty awesome. Like they give him a touchdown, he immediately comes out and makes like two Not like huge offensive play. It's still the second quarter, but still pretty awesome.",
    "timestamp" : "36:42-36:56"
  },
  {
    "timestamp" : "36:56-37:04",
    "speaker" : "Andy",
    "text" : "Yeah, I think if you're gonna give a game ball to anybody in this, it's probably Rable, because he's the only one that had any sort of like positivity."
  },
  {
    "text" : "Yeah, you crushed it.",
    "speaker" : "Steve",
    "timestamp" : "37:04-37:06"
  },
  {
    "text" : "I mean you could probably give it to Brady too.",
    "speaker" : "Andy",
    "timestamp" : "37:06-37:08"
  },
  {
    "timestamp" : "37:09-37:14",
    "text" : "But we'll get into our we'll get into our game balls.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "37:14-37:38",
    "speaker" : "Andy",
    "text" : "Alright, yeah. But I I think The one of the stats they showed was that Tom Brady over the past two games had thrown the ball over a hundred times. Yeah. Which was fucking bananas to me. Especially back then. Right, exactly. Back in 2002 when they We're converting slowly from a running team and now all of a sudden they're throwing it literally fifty times a game. It's fucking ridiculous"
  },
  {
    "speaker" : "Ryan Storie",
    "timestamp" : "37:38-37:44",
    "text" : "Well, like you said, I mean, they started the season like completely surprising everyone by throwing."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "37:44-37:44"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "And I mean, I I remember had like I forget how many 300 yard games, but he just started and was just piling up 300 yard games right off the bat.",
    "timestamp" : "37:45-37:53"
  },
  {
    "timestamp" : "37:53-37:54",
    "speaker" : "Andy",
    "text" : "Just over."
  },
  {
    "text" : "It's like Brady throwing for 300 yards? It's not",
    "timestamp" : "37:55-37:57",
    "speaker" : "Ryan Storie"
  },
  {
    "timestamp" : "37:58-38:01",
    "text" : "No, you shouldn't have to be a good thing. He threw a bunch of bad picks.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "He did actually.",
    "timestamp" : "38:02-38:03"
  },
  {
    "timestamp" : "38:03-38:14",
    "speaker" : "Steve",
    "text" : "He threw a couple that were just like another one you're just like, God damn it. Like He had one in the third quarter, he had one in the second quarter to like end drives that were like points basically."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep.",
    "timestamp" : "38:15-38:15"
  },
  {
    "timestamp" : "38:15-38:25",
    "speaker" : "Steve",
    "text" : "You're definitely not careful with the ball. Again, like you said, the the pets move the ball is It shouldn't have been as close as it was. We should have been whooping them up a little bit more than we were."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:26-38:39",
    "text" : "Yeah. Uh like I was surprised at how well the offense performed for a game where they only scored 14 points. It didn't feel right. I'm looking at the scores and I'm like, I remember them losing this game."
  },
  {
    "speaker" : "Steve",
    "text" : "I remember it's so I'm forgetting to say the score Andy.",
    "timestamp" : "38:39-38:42"
  },
  {
    "text" : "Score was it ended. New England Patriots 14, San Diego Chargers 21. And the last score came three plays into the second half. So if you do want to watch this game, that's one thing we've been doing that, well, that we've been trying to do and we haven't done very well, is give a watchability score on these games. So out of we're doing it out of six Lombardi's Ryan story because we're assholes like that.",
    "speaker" : "Andy",
    "timestamp" : "38:43-39:11"
  },
  {
    "text" : "That makes sense.",
    "timestamp" : "39:12-39:13",
    "speaker" : "Ryan Storie"
  },
  {
    "timestamp" : "39:13-40:02",
    "speaker" : "Andy",
    "text" : "Yeah. And so the last game was Patriots won 34-31 in overtime with Barnburner. We gave that, I think, a solid five Lombardi's because it was an exciting game and they won. This game, uh, but I think we also said that only watch the second half of that game because the first half was the Patriots had more penalty yards than they did actual yards. Yeah, they had like ten penalties for a hundred yards in that game. It was it was rough. But most of those came in the first half and then they unloaded in the second half. But this game I think is probably opposite in both ways. If you're gonna watch a game, only watch the first half, because that's when the pages do anything. And I would give it I'd probably give it a one and a half Lombardi's, maybe two. Or because it's Vrabel's first uh first touchdown."
  },
  {
    "timestamp" : "40:03-40:08",
    "speaker" : "Steve",
    "text" : "All right, I'll get to the game. It was like watchable to the end, you know. That's true."
  },
  {
    "speaker" : "Andy",
    "text" : "Well, yeah, but when's the last time the pages have actually gotten blown out? We talked about this. Like it doesn't happen very often anyway. If they lose, they lose close, right?",
    "timestamp" : "40:08-40:17"
  },
  {
    "text" : "Three stooges defense where everybody falls over each other trying to tackle LT and he runs for like fifty fucking yards for a touchdown. That's that three plays into Like I saw like six and two of them six missed tackles because people falling over in pairs.",
    "speaker" : "Steve",
    "timestamp" : "40:20-40:37"
  },
  {
    "speaker" : "Andy",
    "text" : "I'd I'd say that's a uh uh quite uh surprisingly accurate discussion.",
    "timestamp" : "40:38-40:42"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:46-40:54",
    "text" : "In the red zone. You know, they they're just like flirting outside field goal range a lot and just Ken Walters is hitting like fifteen yard punts"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "40:54-40:54",
    "speaker" : "Ryan Storie"
  },
  {
    "speaker" : "Steve",
    "text" : "And then the Chargers in the fourth quarter hit like a absolutely amazing punt.",
    "timestamp" : "40:55-40:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, Kevin Fogg's returning punts because Troy Brown is of course injured. And he lets one bounce at the five and it literally goes sideways and goes straight out of bounds. The pages have less than two minutes and no timeouts left.",
    "timestamp" : "40:59-41:11"
  },
  {
    "text" : "And they just can't make it happen. They still got down the field.",
    "speaker" : "Ryan Storie",
    "timestamp" : "41:12-41:15"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:15-41:20",
    "text" : "They did. They got into San Diego territory and got to like the 30-ish yard line, 40 yard line."
  },
  {
    "speaker" : "Steve",
    "text" : "It was watchable. So I'm gonna give it I'm gonna give it a three. Just because we didn't win doesn't mean it wasn't like an entertaining game.",
    "timestamp" : "41:22-41:28"
  },
  {
    "text" : "Agree to disagree. I'm a homer. I only want to watch the win.",
    "speaker" : "Andy",
    "timestamp" : "41:28-41:32"
  },
  {
    "timestamp" : "41:37-41:42",
    "speaker" : "Steve",
    "text" : "And Tim Dwight. In white, Drew Brees in a charges uniform, which looks weird, you know."
  },
  {
    "speaker" : "Andy",
    "text" : "Also the fact that he looked like he was sixteen years old was a little strange to me.",
    "timestamp" : "41:42-41:45"
  },
  {
    "timestamp" : "41:45-42:06",
    "text" : "Yeah, like his helmet comes off at one point. So you'd just see like super young Drew Brees running around. Like, oh, kid it was he able to drive to the game or just as long as you can skip the replays, because there's a bunch of those eight thirty second skip, a six thirty second skip, three thirty second skip. All in the first half.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "42:06-42:53",
    "text" : "Oh yeah. And well I remember because in 2001 when we were doing it, I think replay was new. So they were literally timing it and they had a little timer in the top corner of like how long this replay was taking. I love that. And it would take like maybe two minutes, tops, if it was borderline. And also what they were doing that they've scrapped this year was that they were doing um fan polls where you could text in like you're part of um American Idol. And you can vote either the play should stand or it should be overturned. And they would show the percentages like as the referees coming out from underneath the hood. Which should still fucking happen. The fact that that doesn't is a travesty. And I blame the NFL. I blame no specifically I blame Roger Goodell.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Mainly because I just write him a strongly worded letter.",
    "timestamp" : "42:53-42:56"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm gonna do that. I'm gonna follow my mother's footsteps. And I'm going to write Roger Goodell a very strongly worded worded letter. Hang on. The Hell's Angels are driving past my house. Did you hear them?",
    "timestamp" : "42:56-43:10"
  },
  {
    "timestamp" : "43:11-43:12",
    "text" : "A little bit. Not really.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "43:12-43:15",
    "speaker" : "Andy",
    "text" : "They're not Hells Angels, they're probably dentists on motorcycles, but that's cool."
  },
  {
    "speaker" : "Steve",
    "text" : "I um I I've I got a football or not football.",
    "timestamp" : "43:15-43:19"
  },
  {
    "text" : "Well hang on before we do that, I wanna I wanna I wanna know how many Lombardias Ryan gives this game.",
    "speaker" : "Andy",
    "timestamp" : "43:20-43:25"
  },
  {
    "timestamp" : "43:25-43:25",
    "text" : "Yeah, I'm good.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "43:26-43:30",
    "speaker" : "Andy",
    "text" : "Having three. Right in the middle of the fucking surprise."
  },
  {
    "timestamp" : "43:32-43:50",
    "speaker" : "Ryan Storie",
    "text" : "Well, it was an okay game. Just like Steve said, it was it was an okay game. The first half was really good. If you just watch the first half, it's a fun game. The second half is a fucking slog, but they have their chances. They just keep fucking up and pissing you off. And then they have the ball at the end with the chance to win. So that they don't."
  },
  {
    "text" : "That's the that was the heartbreaking thing is like Brady doesn't ever not convert those. At least up until this point. Like I mean when he would get the ball and he needed to score it. At this point in his career, he always got one. Like I don't think there was one before this that you hadn't converted",
    "speaker" : "Andy",
    "timestamp" : "43:50-44:08"
  },
  {
    "text" : "Like it's the Jets.",
    "speaker" : "Steve",
    "timestamp" : "44:08-44:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:10-44:16",
    "text" : "Alright, I'll give you that, the fact that he he played the first like four plays against the Jets and that didn't work. But he almost still did it though."
  },
  {
    "timestamp" : "44:17-44:18",
    "speaker" : "Steve",
    "text" : "Yeah, I guess."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:18-44:40",
    "text" : "He was he was throwing passing the end zone that were hitting people in the hands. But this just wasn't that it was so and the way the game ended was Brady threw it it was like thirty, forty seconds left. Brady threw it to Kevin Falk across the middle. And Kevin Falk tried to lateral it to Alignment? Alignment just said, nah, not my fucking problem. And just let the ball go right past him."
  },
  {
    "timestamp" : "44:42-44:44",
    "speaker" : "Ryan Storie",
    "text" : "It looked like the Super Bowl."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:44-45:01",
    "text" : "Yeah, for Kevin's Falk's trouble, he got lit the fuck up. Like absolutely blown up by the uh linebacker Donnie Edwards. Just absolutely just oh that looked so painful. And that was basically the last play of the game."
  },
  {
    "text" : "So let's let's talk about the commentating, Andy. You've been actually very quiet about it up to this point. Usually you're all riled up.",
    "speaker" : "Steve",
    "timestamp" : "45:03-45:09"
  },
  {
    "text" : "So this is true. And I thought I'd be more riled up because it was Phil Sims. And Phil Sims hates him some patriots. Am I right? I I don't know if I agree with that. Ryan, how do you w what do you think Phil Sims is Huh?",
    "timestamp" : "45:10-45:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Ryan Storie",
    "timestamp" : "45:24-45:25",
    "text" : "I don't think he hates him."
  },
  {
    "timestamp" : "45:26-45:40",
    "speaker" : "Andy",
    "text" : "You you're kind of right in the middle. So that's the thing. Like I think now he his new thing is that he likes to root against Patriots because they're the evil empire."
  },
  {
    "timestamp" : "45:40-45:43",
    "speaker" : "Ryan Storie",
    "text" : "Well, and his son hates them. And his son's a douche."
  },
  {
    "timestamp" : "45:44-45:51",
    "speaker" : "Andy",
    "text" : "Oh, that's right, yeah, because his son played well I don't know if played is the right word, but was in the NFL at the same time, right?"
  },
  {
    "timestamp" : "45:51-45:53",
    "text" : "Yeah, he he was For the Bucks.",
    "speaker" : "Ryan Storie"
  },
  {
    "timestamp" : "45:53-45:55",
    "speaker" : "Andy",
    "text" : "Chris Sims, right?"
  },
  {
    "timestamp" : "45:55-45:59",
    "speaker" : "Ryan Storie",
    "text" : "Yeah, and he he either tried catch all uh he was a coach for the Pats for like a year."
  },
  {
    "timestamp" : "46:00-46:01",
    "speaker" : "Andy",
    "text" : "Was he really?"
  },
  {
    "speaker" : "Ryan Storie",
    "timestamp" : "46:01-46:02",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "No shit Alright, well that'll explain the hate.",
    "timestamp" : "46:02-46:05"
  },
  {
    "speaker" : "Ryan Storie",
    "timestamp" : "46:05-46:12",
    "text" : "So he that's why he always has, you know, for years he's had the hot take of, you know, Brady's not as good as he is and blah blah blah shit."
  },
  {
    "speaker" : "Andy",
    "text" : "Right, right, right.",
    "timestamp" : "46:13-46:13"
  },
  {
    "text" : "So I think you can see Phil turning when his son decided he didn't like the pads. But early on, like this game, I thought Sims was Pro Brady.",
    "timestamp" : "46:14-46:24",
    "speaker" : "Ryan Storie"
  },
  {
    "text" : "And that's exactly what I was gonna say. Yeah, he does. He really loves him some early Tom Brady back in these days, which was Kind of strange to hear because again, like I said, I missed this whole season. So I we didn't have Phil Simms doing any Pages games the season before because the Pages weren't good enough for that. We had Dan fucking deer doing it. Did he? Oh, that's right. Yeah, he did the Raiders. And he loved Tom Brady in that game too.",
    "speaker" : "Andy",
    "timestamp" : "46:24-46:50"
  },
  {
    "text" : "Did you catch his foreshadowing at the uh beginning of the game?",
    "timestamp" : "46:50-46:55",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "46:56-46:59",
    "speaker" : "Andy",
    "text" : "That sounds familiar. I don't know if I wrote that. What was it?"
  },
  {
    "timestamp" : "47:00-47:10",
    "speaker" : "Steve",
    "text" : "It was like he's like, Brady makes it look too easy. It's too easy for Brady. Yeah, yeah. This league is hard. He hasn't suffered yet. You gotta suffer. Tom Brady hasn't done that yet."
  },
  {
    "timestamp" : "47:12-47:24",
    "speaker" : "Andy",
    "text" : "I did not catch that, but that's pretty good. I did catch the fact that he called Charlie Weiss an arrogant play caller, which was a apparently a compliment. I I don't Quite understand how."
  },
  {
    "timestamp" : "47:25-47:43",
    "speaker" : "Steve",
    "text" : "Yeah, I got a little upset when they said it was in the late second quarter like, oh, that's a really good block by Curtis Conway, and he's clearly holding Ty Law. Yeah. And then like the same play happens reverse. Like the Patriots receiver is doing a patent or branch. Oh, that's an easy call."
  },
  {
    "speaker" : "Andy",
    "text" : "It was exactly the same play. But at this point The first few games have been Dan Dierdorf and Dick Enberg. And I think I was just so happy not to hear them commentate this game. That I just gave both of them a free pass. Like, you know what? I didn't even write nothing down. Like, I'm fine with this. It's not not Dan Deerdorf, so I'm happy with it.",
    "timestamp" : "47:44-48:05"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "48:05-48:08",
    "text" : "They did they did confuse me a little bit though."
  },
  {
    "timestamp" : "48:08-48:31",
    "text" : "Um Okay, let's hear your yeah, you've got a football not football. Ryan, do you know you know what this is? Nope. So Mike started this back in the day, and uh he was confused about some some of the uh terminology. that the commentators would use and he wasn't sure if they were talking about football or or not football. So he would ask us these questions and we would answer them. So uh Steve sounds like Steve has found one of these.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:31-48:40",
    "speaker" : "Steve",
    "text" : "Hey, he said uh ball is on Brewski at the point of contact. Excuse me? Ball is on Brisky at the point of contact."
  },
  {
    "speaker" : "Andy",
    "text" : "Do you have any context for this? Was there somebody Rubbing up against Teddy Bruski at this point?",
    "timestamp" : "48:41-48:46"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean it's football. I just see a lot of rubbing was going on in that game. There is a lot of contact in this game. Um what the point of contact, you know, like like the Yeah, I mean the ball is the point of contact? Where is the is why is the ball Um Risky at the point of contact wouldn't it be the balls too?",
    "timestamp" : "48:47-49:10"
  },
  {
    "text" : "You would think it would be the balls, yeah, unless we're talking about um Uh Lance Armstrong. And there's like some sort of situation with that.",
    "timestamp" : "49:10-49:20",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "49:20-49:22",
    "speaker" : "Steve",
    "text" : "I didn't see any yellow jerseys out there though."
  },
  {
    "timestamp" : "49:22-49:26",
    "speaker" : "Andy",
    "text" : "That's true, but but maybe somebody had had a a similar situation, if you will."
  },
  {
    "text" : "Oh. For instance",
    "speaker" : "Steve",
    "timestamp" : "49:26-49:28"
  },
  {
    "text" : "I d I don't want to put uh bad words on our our friend Jason Ball from London or New Hampshire, but I mean why do they call him Right, exactly. Why why do they call him Jason Balls? Why don't they call him Jason Balls? Really? I mean just asking the questions here. A lot of people are saying, Jason Ball, why just one? And honestly, I looked him up and I couldn't find him online. Otherwise I w I was gonna try and have him on because that'd be fucking great.",
    "timestamp" : "49:29-49:54",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "But he doesn't exist on You probably got the fuck out of London area a long time ago.",
    "timestamp" : "49:56-50:01"
  },
  {
    "speaker" : "Andy",
    "text" : "Well he went and played San Diego. Which uh did you catch one of the commentators talk about how LT had said that um concentrating on football in San Diego was very difficult to do? No. And they're like, I bet it is. Like, all right you horny basses. Keep it in your pants. Yeah, he's not Travis Henry over here. Yeah, LT is or Cromartie. Yeah. Forgets how many kids he has. As you do.",
    "timestamp" : "50:01-50:33"
  },
  {
    "timestamp" : "50:34-50:37",
    "text" : "He he got the number right, he just couldn't remember the names or the birthdays or something.",
    "speaker" : "Ryan Storie"
  },
  {
    "timestamp" : "50:38-51:02",
    "speaker" : "Andy",
    "text" : "It was yeah, I I think it was the names. It was not great. Um but the one last thing I want to talk about, and I thought Connor was gonna be here to do this, but he's not. Um This was Uh in in the 2002 draft, the San Diego Chargers selected in the second round, 48th overall, a wide receiver from Florida named Roche Caldwell."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, really?",
    "timestamp" : "51:03-51:04"
  },
  {
    "text" : "They did. So this was Roshe Caldwell's rookie season. He didn't play at all. He did not. I think he probably did, but he didn't do anything of note.",
    "timestamp" : "51:05-51:15",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh yeah. I didn't see him.",
    "speaker" : "Steve",
    "timestamp" : "51:15-51:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:18-51:21",
    "text" : "No, I I don't remember. He might have saw him called."
  },
  {
    "text" : "He might have saw me, but I didn't see him then.",
    "speaker" : "Steve",
    "timestamp" : "51:21-51:23"
  },
  {
    "timestamp" : "51:24-51:41",
    "speaker" : "Andy",
    "text" : "He's probably seeing you right now. The eyes are are so big. The one thing he doesn't see is the pass coming his way when he's wide open on the two-yard line uh against the Colts in the playoffs, but that's uh another story. Um so I did trouble digging."
  },
  {
    "timestamp" : "51:47-52:00",
    "speaker" : "Steve",
    "text" : "I think we probably should. No, we save reshed it. You think we should save or shake? Wait till us. Oh yeah, wait till he comes to us. All right. There was another draft pick by the Chargers that had an even better name."
  },
  {
    "text" : "Oh, give it to me.",
    "timestamp" : "52:01-52:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "52:02-52:05",
    "text" : "Best name of any defensive back ever."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:05-52:06",
    "text" : "Really?"
  },
  {
    "timestamp" : "52:06-52:08",
    "speaker" : "Steve",
    "text" : "Quentin Jammer?"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "Oh Quentin Jammer.",
    "timestamp" : "52:08-52:10"
  },
  {
    "speaker" : "Andy",
    "text" : "That's right. Pick first uh well fifth overall. First round though. Quentin Jammer. Amazing.",
    "timestamp" : "52:10-52:15"
  },
  {
    "timestamp" : "52:16-52:17",
    "speaker" : "Ryan Storie",
    "text" : "It is an amazing name."
  },
  {
    "text" : "Because the I mean you don't have the I fought the Law and the Law One jokes, but I mean Quentin Jammer as a I feel like he would have to play Like bump and run man to man though, right? Like you always get a zone defensive.",
    "timestamp" : "52:20-52:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "He is not a zone guy, not in a million years.",
    "timestamp" : "52:33-52:35"
  },
  {
    "timestamp" : "52:36-52:43",
    "speaker" : "Andy",
    "text" : "He's gotta be like a Brandon Browner type. Who we could probably talk about too, because he's got some Some interesting post football stories."
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "Yeah.",
    "timestamp" : "52:44-52:45"
  },
  {
    "text" : "Is it Uh yes he is. Okay. I thought so. I think violence and drug charges.",
    "speaker" : "Andy",
    "timestamp" : "52:46-52:54"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "Well I know he did should have landed him in jail. I just didn't know if he was there yet.",
    "timestamp" : "52:54-52:59"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:59-53:02",
    "text" : "I believe so. I don't know if he's still in jail, but I know he went to jail for a little bit."
  },
  {
    "timestamp" : "53:02-53:05",
    "speaker" : "Ryan Storie",
    "text" : "I don't know if it's it's still a thing."
  },
  {
    "text" : "But we'll get to that. When when was he on the team? Was that like Twenty fourteenish.",
    "timestamp" : "53:05-53:10",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "53:11-53:12",
    "text" : "Brownie, yeah, fourteen.",
    "speaker" : "Ryan Storie"
  },
  {
    "text" : "So we'll get to that in twelve seasons. So go so we'll get there in like six years. It'd be fine.",
    "timestamp" : "53:13-53:20",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "53:21-53:24",
    "text" : "Yeah, maybe we should do the uh Rishi Cobble Rabbit Hole now.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "53:26-56:06",
    "text" : "This is what I mean. So Uh Roshay Calwell, if you if you Google him, you know, some of his the normal stuff comes up. Uh his picture, which always looks like a mugshot, but I think that's just how he looks with the eyes. Um There's also a story from ESPN entitled How Roche Caldwell Googled His Way from the Patriots to Prison. I won't I I won't read you the whole thing because that seems like uh a lot of work. And you can you can read it yourself, it's on ESPN. com. But basically the gist of it is what happened. He got arrested for running a sports book out of like a a mechanic shop across the street from like a middle school. Uh because there was so much traffic going in and out, it got the attention of the authorities and they got arrested for it. He was on probation and decided he had heard about um buying drugs online, so he googled it and tried to do it himself. He's like, there's no way this is a possibility, there's no way this is a real thing. So he googled it and tried to do it while on probation and immediately got caught because all his shit is tracked and ended up in jail for For attempting to buy I don't even know what it was. That was probably just weed. But uh attempting to try buy drugs on I think it was Silk Road. And how you really should have seen that coming. To his house. I mean for And the best part is that that's not it. Oh, all right. Yes, as that uh shamel guy would say. Was it shamel guy? No, the oxycling guy. But wait because there's more. Yes. Um so just recently, um th this story is on Yahoo Sports, so sports. yahoo. com uh from january twenty eighth twenty twenty so you do the math uh we're we're actually recording this in May May 21st 2020 so not that long ago And um it is Roshea Caldwell and Etrick Pruitt, I don't know who that is, pleading guilty in health fund fraud case. And I think we had talked about this before, Steve, if you remember. It may have been Greg that brought it up. But basically what happened is Uh a group of NFL players, Rasheed Caldwell probably being the lookout, it'd be my guess. But who else was on? Oh uh Joe Horn was part of this as well.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:07-56:10",
    "text" : "Yeah. This is where it came out, it came up in that Saints game."
  },
  {
    "timestamp" : "56:10-57:13",
    "speaker" : "Andy",
    "text" : "Oh yeah, other plays involved. So it's Joe Horn, Carell Buckhalter, Clinton Portis. Tamarick Vanover from this game. He was the kick returner. They kept calling him Tamarek, which I thought was weird. So I don't know if I'm saying it wrong or not. Those are the big names. They were basically defrauding the NFL by filing nearly four million dollars worth of false insurance claims in 18 months. From the Gene Upshot NFL Player Health Reimbursement Account Plan, according to prosecutors. So what they would do is they would submit claims to be paid for medical equipment. Um for like it for players, but it was equipment that they didn't actually buy or receive, they just do it to get the money. And uh the I think the reason they got caught was because the medical equipment was uh things such as hyperbaric chambers and cryotherapy machines. And also have been alleged to have uh fake prescriptions as well for support for those fraudulent claims."
  },
  {
    "text" : "So I'm not sure if you're not going to be able to Google how do I commit insurance fraud online.",
    "speaker" : "Ryan Storie",
    "timestamp" : "57:13-57:19"
  },
  {
    "text" : "Yeah. Either that or you heard it from Clinton Portis, you know, the uh the the stellar mind that he is.",
    "speaker" : "Andy",
    "timestamp" : "57:19-57:26"
  },
  {
    "speaker" : "Steve",
    "text" : "At least he's going from, you know, up to white collar crimes.",
    "timestamp" : "57:28-57:31"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true, yeah. He's not he's not running a gambling ring out of a out of a storefront across the street from a middle school. So that's a step up",
    "timestamp" : "57:31-57:40"
  },
  {
    "timestamp" : "57:40-57:42",
    "text" : "I honestly didn't find that one that bad.",
    "speaker" : "Ryan Storie"
  },
  {
    "timestamp" : "57:43-58:06",
    "speaker" : "Andy",
    "text" : "I think it was the fact that there was so much traffic going in and out across the street from that school was the reason he got caught. Yeah. If he had done it literally anywhere else, it would have been fine. But yeah, I think the uh the googling of how to buy drugs online is probably I don't know if you can say it's a low point. I'm not sure we're there yet."
  },
  {
    "timestamp" : "58:06-58:09",
    "speaker" : "Ryan Storie",
    "text" : "Yeah, he he's he's the kind of guy who keeps digging."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I mean he he's always looking forwards, that's for sure.",
    "timestamp" : "58:10-58:13"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "He's always looking for the next opportunity.",
    "timestamp" : "58:14-58:17"
  },
  {
    "speaker" : "Andy",
    "text" : "But if yeah, I if you if you're having a bad day Or, you know, you're you're you're feeling stressed from work, or you know, you've you've got some stuff going on at home, just just go to google. com and type in Roshea Caldwell, R-E-C-H-E Caldwell. And just click on the images button. And you will feel a lot better about yourself because these pictures are hysterical.",
    "timestamp" : "58:19-58:45"
  },
  {
    "text" : "Like a good cat video.",
    "speaker" : "Steve",
    "timestamp" : "58:45-58:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it's it's like the football version of a of a funny cat video. Just makes it feel all warm and fuzzy inside. Chris Berman's nickname for him.",
    "timestamp" : "58:48-58:57"
  },
  {
    "timestamp" : "58:58-59:13",
    "speaker" : "Steve",
    "text" : "He had a nickname for him? Yeah, which didn't include his eyes. Really? What was it? It was Ricochet Rico. Caldwell? I feel like Chris Berman really dropped the ball on that one."
  },
  {
    "timestamp" : "59:13-59:16",
    "speaker" : "Andy",
    "text" : "Yeah, I mean Berman's usually dead on with these things."
  },
  {
    "speaker" : "Steve",
    "text" : "Usually spot on, but maybe I don't know.",
    "timestamp" : "59:16-59:18"
  },
  {
    "text" : "Yeah, Andre Bad Moon Rising. I mean It's classic. I wonder if there's any Urban Thesaurus uh entries for for Roche Caldwell.",
    "speaker" : "Andy",
    "timestamp" : "59:18-59:30"
  },
  {
    "timestamp" : "59:30-59:42",
    "text" : "Let's not let's let's skip that and go to the uh best and worst something. All right. I'll get to the urban day uh urban disorders again",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah that oh wow, okay. Too late. Nothing good. Tom Brady's the first result. Not gr not quite so good. Alright, so Steve then you if you want to kick it off, let's let's hear your best and worst from this game. Um let's see",
    "timestamp" : "59:43-01:00:01"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:02-01:00:07",
    "text" : "You never really cover my worst in detail about how much I hate LT and how good of a game."
  },
  {
    "text" : "Yeah, you really didn't talk about that much. Give me give me a little bit of uh why why why do you hate LT?",
    "speaker" : "Andy",
    "timestamp" : "01:00:07-01:00:13"
  },
  {
    "text" : "I don't think it was because of this game. This is why I got him and Priest Holmes confused, but it's just all this crybaby stuff and when they were actually good and we beat him in the playoffs a button.",
    "timestamp" : "01:00:14-01:00:24",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, when he called uh And you call Belichick a cheater and it says all Sush from the top. Even though Sean Merriman was doing the lights out. Yeah. He's one of the dirtiest defensive players ever.",
    "timestamp" : "01:00:24-01:00:40"
  },
  {
    "timestamp" : "01:00:40-01:00:47",
    "text" : "Okay. Yeah. And he played for the Jets, if I'm not mistaken.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:00:47-01:00:49",
    "speaker" : "Andy",
    "text" : "Oh he did, didn't he? Yeah. Fuck that guy."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:49-01:00:50",
    "text" : "Another reason to hate LT."
  },
  {
    "timestamp" : "01:00:51-01:00:57",
    "text" : "Junior. Steve Brown's a man of simple pleasures and simple hatreds. I love it.",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh it was awesome to see, you know, Sayao and Rodney Harrison flying around there even if they were flying around on our guys. And watching Junior Seao like miss time a blitz and then like like step on the snap. Yeah. Yeah, he like clearly miss time back a lot. And so he's just like stuck in no man's land and then just like kind of dances around a little bit and like steps on the fucking football while the center's still holding it. Yep.",
    "timestamp" : "01:00:58-01:01:28",
    "speaker" : "Steve"
  },
  {
    "text" : "So that was pretty funny. That was fantastic.",
    "speaker" : "Andy",
    "timestamp" : "01:01:28-01:01:32"
  },
  {
    "text" : "And then I also liked the little game break where they showed Fred Jackson. I mean, yeah, LT tore us up, but Fred Jackson hung 237 yards on the Jets that week.",
    "timestamp" : "01:01:32-01:01:46",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I missed that one. That's fantastic.",
    "timestamp" : "01:01:48-01:01:49"
  },
  {
    "text" : "That was big on that.",
    "speaker" : "Steve",
    "timestamp" : "01:01:50-01:01:51"
  },
  {
    "text" : "Good. Fuck 'em. Fuck the Jets, right? Alright, Ryan, not to put you on the spot, but do you have any uh best and or worse for this game?",
    "speaker" : "Andy",
    "timestamp" : "01:01:51-01:01:59"
  },
  {
    "text" : "I mean, obviously Brabel's touchdown was kind of cool, especially now that I was the first one. So now I know why they celebrated like they did. And the worst, just that pathetic last drive was just unwatchable.",
    "timestamp" : "01:02:00-01:02:17",
    "speaker" : "Ryan Storie"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that that last play was a shitty way to end a football game.",
    "timestamp" : "01:02:17-01:02:21"
  },
  {
    "text" : "Yeah, and it was reminiscent of a lot of ending of games recently, so it was uh difficult to watch.",
    "timestamp" : "01:02:21-01:02:29",
    "speaker" : "Ryan Storie"
  },
  {
    "timestamp" : "01:02:29-01:03:48",
    "text" : "Ah, that's yeah, that that makes me sad because it's true. Uh all right, my my best was um Marty Schottenheimer describing the Patriots defensive motion pre-snap. Where he said it looks like spaghetti on a plate. Because basically he had literally no idea what the Patriots were doing and what they were bringing. And so they had um just simplified everything to just basically like all the blocking everything was completely simplified. They just like blocked the guy who's in front of you because they had no idea what was coming. And the first half you could tell because they had no idea what was going on. Um see my worst was I had something here. I mean, other than Troy Brown being out for this game because Troy Brown's my f um Actually no, my other best was uh Jason Ball, the starting center for the San Diego Chargers, who was from Londonderry, New Hampshire, if if you hadn't known that. And uh Played a U and H. Which both Ryan and I went to and Craig also. Jesus Christ.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Ryan Storie",
    "timestamp" : "01:03:52-01:03:52"
  },
  {
    "text" : "Yeah, this was before the Chip Kelly days when they actually did anything. This was like when they were bad UNH. And he still managed to make the NFL, so good for him.",
    "speaker" : "Andy",
    "timestamp" : "01:03:52-01:04:02"
  },
  {
    "timestamp" : "01:04:02-01:04:06",
    "speaker" : "Steve",
    "text" : "That was your best like they were talking about the guy way too much for how crappy he was."
  },
  {
    "timestamp" : "01:04:07-01:04:23",
    "speaker" : "Andy",
    "text" : "Right, but he was from New Hampshire. So fuck it. It's my best, bro. He's from London Dry, I've been there. I've I've been to London Dragon before. That's fucking cool. Yeah, I've been there and regretted it. Well yeah, that's why he doesn't live there anymore probably because it's what in New Hampshire."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, I regretted being there.",
    "timestamp" : "01:04:23-01:04:25"
  },
  {
    "text" : "Uh oh, speaking of best, uh another best is that Greg Brown has actually just joined us. As we're wrapping up the show, yes.",
    "timestamp" : "01:04:27-01:04:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:04:40-01:04:42",
    "speaker" : "Steve",
    "text" : "Great adjustment game balls."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, my worst is um the the music during the stoppage and play in San Diego in 2002. I don't remember all the songs, but I definitely recognize one of them as Avril Levine. And I think that's just the worst regardless of what time frame. Look it up, bro.",
    "timestamp" : "01:04:44-01:05:07"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "That seems right. Yeah. 2002 wasn't a great era of music.",
    "timestamp" : "01:05:07-01:05:12"
  },
  {
    "text" : "No. No. It was like the 80s. I stick to that. No good music came out of the 80s. Except maybe Metallica? Oh, yeah.",
    "timestamp" : "01:05:12-01:05:21",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, 2000.",
    "timestamp" : "01:05:21-01:05:23"
  },
  {
    "text" : "See, there you go. And they were playing it in stadiums uh across California, apparently. I haven't heard it in the East Coast games that we've we've played, but uh We've definitely had it for this one and I was disappointed in the in the San Diego crowd.",
    "speaker" : "Andy",
    "timestamp" : "01:05:29-01:05:46"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:05:46-01:05:47"
  },
  {
    "speaker" : "Andy",
    "text" : "For a line attack. This is what I mean. Like this is this is American football. Why are you playing Canadian chick girl music?",
    "timestamp" : "01:05:47-01:05:56"
  },
  {
    "timestamp" : "01:05:56-01:05:58",
    "text" : "Maybe at a hockey game.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:06:00-01:06:39",
    "speaker" : "Andy",
    "text" : "Uh maybe figure skating. All right, let's go to your game boss. All right. Well Greg Brown has now joined twice and has failed both times. Yeah, uh so it's not just you Ryan who sucks at technology. It's also our our brother Greg. Yeah, I I got it. How much help did you have? Uh the fact that your name comes up as Alicia is what gave me that that hint."
  },
  {
    "text" : "Surprise.",
    "speaker" : "Ryan Storie",
    "timestamp" : "01:06:40-01:06:41"
  },
  {
    "timestamp" : "01:06:45-01:06:46",
    "text" : "Give me some game balls",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh I'm going on Dion branch.",
    "timestamp" : "01:06:47-01:06:50"
  },
  {
    "timestamp" : "01:06:50-01:06:51",
    "text" : "Okay.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:06:51-01:06:58",
    "text" : "All right. Electric rookie start to actually pretty illustrious career, all things considered."
  },
  {
    "text" : "Yeah, this is definitely a breakout game for him. I agree. I'll take it.",
    "timestamp" : "01:06:58-01:07:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I mean everyone says Tom Brady can't develop a rookie receiver and maybe that was true later in his career, but And like from the jump, Dion was awesome. And then this game, especially, this is his fourth ever career game.",
    "timestamp" : "01:07:02-01:07:15"
  },
  {
    "text" : "Yep.",
    "speaker" : "Andy",
    "timestamp" : "01:07:16-01:07:16"
  },
  {
    "timestamp" : "01:07:16-01:07:23",
    "speaker" : "Steve",
    "text" : "Troy Brown is out, and it's like, all right. You know, I know this is a game four, but now you're Troy Brown."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:07:23-01:07:24",
    "text" : "Yeah."
  },
  {
    "text" : "And he was he was lighting it up, especially in the first half. I mean, it seemed to slow down a little bit in the second, but right. Well I think the whole offense did. Yeah. His kick return ability. No, he didn't show much in this game, but still.",
    "timestamp" : "01:07:24-01:07:36",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:07:37-01:07:41",
    "speaker" : "Andy",
    "text" : "He had a couple that were pretty good. He was getting back out to like the 30 yard line every time."
  },
  {
    "timestamp" : "01:07:41-01:07:46",
    "speaker" : "Steve",
    "text" : "This game and the beginning of the season that they'd found they'd definitely found something awesome in Dion branch."
  },
  {
    "timestamp" : "01:07:46-01:07:52",
    "speaker" : "Andy",
    "text" : "Yeah, no, they definitely did. I agree. Where was he drafted? Ryan story, where was he drafted?"
  },
  {
    "speaker" : "Ryan Storie",
    "timestamp" : "01:07:54-01:07:56",
    "text" : "What where was he drafted?"
  },
  {
    "speaker" : "Andy",
    "text" : "What round round? Yeah.",
    "timestamp" : "01:07:57-01:07:58"
  },
  {
    "timestamp" : "01:07:59-01:08:00",
    "text" : "I remember.",
    "speaker" : "Ryan Storie"
  },
  {
    "timestamp" : "01:08:01-01:08:03",
    "speaker" : "Andy",
    "text" : "I I don't think it was the first round, was it?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:03-01:08:07",
    "text" : "Second round sixty-five overall. Yeah."
  },
  {
    "timestamp" : "01:08:09-01:08:13",
    "speaker" : "Ryan Storie",
    "text" : "Don't have draft receivers on the first round unless it's Chad Jackson."
  },
  {
    "timestamp" : "01:08:13-01:08:16",
    "text" : "They prefer to be called Louisville.",
    "speaker" : "Steve"
  },
  {
    "text" : "I don't I don't know that they do, but okay. I don't know that you do.",
    "timestamp" : "01:08:17-01:08:25",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:08:26-01:08:27",
    "text" : "I'm not from Louisville.",
    "speaker" : "Steve"
  },
  {
    "text" : "But you also call it uh cabernet when you order wine. Yes. And peanut griggiotte.",
    "speaker" : "Andy",
    "timestamp" : "01:08:28-01:08:34"
  },
  {
    "speaker" : "Steve",
    "text" : "The French prefer that too, Andy God.",
    "timestamp" : "01:08:35-01:08:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Some fucking culture. Hard teased. French will love him.",
    "timestamp" : "01:08:38-01:08:42"
  },
  {
    "timestamp" : "01:08:44-01:08:46",
    "speaker" : "Ryan Storie",
    "text" : "If the letters are there, you might as well pronounce them."
  },
  {
    "text" : "Oh Jesus.",
    "timestamp" : "01:08:49-01:08:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Wait, pronounce that his first name.",
    "timestamp" : "01:08:50-01:08:53"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:08:54-01:08:55",
    "text" : "No, it's Anthony."
  },
  {
    "speaker" : "Steve",
    "text" : "You knew that?",
    "timestamp" : "01:08:56-01:08:57"
  },
  {
    "timestamp" : "01:08:57-01:09:14",
    "speaker" : "Andy",
    "text" : "No, I'm just looking at the same page you are. Anthony Dion Branch Jr. Sweet. From Albany, Georgia. How about that? All right, Ryan, give us your uh game ball. Who'd you give it to in this game?"
  },
  {
    "text" : "Well, I was gonna go with Dion Branch, but that's not fun. So uh I guess I don't know, Vrabel. Like Greg pointed out, he had some good defensive plays. You know, he batted the ball down. He seemed to be Well typical Brabel game really he's always disruptive. But then he's just winning the first touchdown catch out there for him. I mean You know, defensive guys, so I'm told by the deirdorfs of the world, etc. Defensive guys love that kind of shit, so big game for 'em.",
    "speaker" : "Ryan Storie",
    "timestamp" : "01:09:15-01:09:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh Jesus. Fuck you and your deirdorf collet. How dare you. Did you know he's in the Hall of Fame?",
    "timestamp" : "01:09:44-01:09:52"
  },
  {
    "text" : "I did. Fuck you for knowing that. For probably announcing, right?",
    "speaker" : "Ryan Storie",
    "timestamp" : "01:09:52-01:09:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes. Well yeah. I mean It could be for football. He's not good at either of 'em.",
    "timestamp" : "01:09:57-01:10:02"
  },
  {
    "speaker" : "Steve",
    "text" : "I was gonna say, I mean it's like coming on at this part of the his career. Like he didn't play that much last year.",
    "timestamp" : "01:10:02-01:10:12"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:13-01:10:16",
    "text" : "No, he didn't. This was yeah, this was like the beginning of like Ray Ball."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:10:17-01:10:20",
    "text" : "He looked like this is his best offensive game I'd seen up to this point from him."
  },
  {
    "text" : "Yeah. I think his peak is probably the the the Chargers Super Bowl, uh the uh Panthers Super Bowl is probably his peak.",
    "timestamp" : "01:10:21-01:10:28",
    "speaker" : "Andy"
  },
  {
    "text" : "That touchdown he had seemed like energize him 'cause he was a beast on defense like immediately after it too.",
    "timestamp" : "01:10:29-01:10:34",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah he was, yeah, for the rest of that that half. It's great.",
    "timestamp" : "01:10:34-01:10:37"
  },
  {
    "timestamp" : "01:10:37-01:10:40",
    "speaker" : "Steve",
    "text" : "How many T D catches does he have on his career?"
  },
  {
    "timestamp" : "01:10:40-01:11:20",
    "speaker" : "Andy",
    "text" : "Uh he has twelve. I'm gonna say dynasty dot com. Patriot Dynasty. info slash Tom Brady T T passes. He has uh he's actually high up on the list, surprisingly. He has 10 touchdown passes. He is 16th on the list of touchdown passes from Tom Brady. It's 12 on his career, so he must have caught some in KC. I think he did. I think he caught a couple in KC, yeah. But he has more touchdown catches than Philip Dorset or Brandon LaFell did. Oof. Or Brandon Cooks or Jabbar Gaffney."
  },
  {
    "text" : "More touchdowns and interceptions. Yeah, fucking right.",
    "timestamp" : "01:11:21-01:11:26",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "He has more than twice as many touchdowns as Aaron Dobson did, or Malcolm Mitchell, or Josh Gordon. That's amazing. I love it. How does that make you feel? All those players had four touchdowns. Oh God.",
    "timestamp" : "01:11:26-01:11:41"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "Can can we talk about how Dorset sucks horribly real quick?",
    "timestamp" : "01:11:42-01:11:45"
  },
  {
    "text" : "I feel like you need to get something off your chest, so let's let's do that real quick.",
    "timestamp" : "01:11:46-01:11:49",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:49-01:11:50",
    "speaker" : "Ryan Storie",
    "text" : "I hate that guy."
  },
  {
    "text" : "He's such a Wow, this is the first like bit of like heart take passion I've heard out of you, but so He was horrible. Yeah",
    "timestamp" : "01:11:50-01:11:57",
    "speaker" : "Steve"
  },
  {
    "text" : "He was horrible. He couldn't I thought he was okay. Got no separation. He was never in the right fucking spot. He couldn't be relied on and they fucking needed him He was useless.",
    "timestamp" : "01:11:57-01:12:05",
    "speaker" : "Ryan Storie"
  },
  {
    "text" : "Isn't he the only one to catch a touchdown in their Super Bowl against the Rams, the second one? That whole playoff series? What? I'm pretty sure. You got the only touchdowns all playoffs that year.",
    "timestamp" : "01:12:06-01:12:22",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:12:23-01:12:30",
    "speaker" : "Andy",
    "text" : "Yeah, that's true. You caught one against uh one against the Chiefs and one against the um Chargers."
  },
  {
    "text" : "I mean someone he cleaned up a lot near the goal line, but I thought he was like a good three receiver. He was never gonna never awesome, but it was like him or you know Sit Jacoby. Might as well get that guy. Like he's probably better than Caldwell. Well, okay.",
    "timestamp" : "01:12:31-01:12:51",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:12:54-01:12:55",
    "speaker" : "Andy",
    "text" : "Or Philip Dorset."
  },
  {
    "text" : "Yeah. Oh Jesus. You remember one play. He wasn't good, but he wasn't I don't know, Dorset pissed me off, man. No kids. Never when you needed them. You know, y it's like even when they have actual receivers, it's like obviously Edelman's gonna draw multiple guys. You know, back when they had Kronk he's gonna draw multiple guys. Even when Borsett had single coverage, he could never get open. He was supposed to be fast and all this shit sucked. I don't like him. And then he leaves and he's like, oh yeah, I need to get out of there, blah blah blah. Yeah, because you sucked here.",
    "speaker" : "Ryan Storie",
    "timestamp" : "01:12:56-01:13:40"
  },
  {
    "speaker" : "Steve",
    "text" : "Alright, so rather have him. Or the number three receiver on the 06 Patriots. Who is that? Gaffney?",
    "timestamp" : "01:13:41-01:13:49"
  },
  {
    "timestamp" : "01:13:49-01:13:50",
    "speaker" : "Ryan Storie",
    "text" : "Exactly."
  },
  {
    "text" : "Yeah. Oh, definitely want Gaffney. Gaffney was great. Doug Gabriel.",
    "speaker" : "Andy",
    "timestamp" : "01:13:50-01:13:56"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "Oh yeah, all right. The game room is not very good.",
    "timestamp" : "01:13:56-01:13:59"
  },
  {
    "timestamp" : "01:14:02-01:14:10",
    "speaker" : "Steve",
    "text" : "Yeah, Jabbar Gaffney, I think, was one A with Troy Brown at the end of his career. Doug Gabriel and Risha Caldwell."
  },
  {
    "text" : "So if we yeah, if we're talking about Uh reception yards in 2006, Roshea Caldwell first, Ben Watson second, Troy Brown third, Kevin Falk fourth, Doug Gabriel fifth",
    "speaker" : "Andy",
    "timestamp" : "01:14:10-01:14:21"
  },
  {
    "text" : "Yeah. Everyone's complaining about last year.",
    "timestamp" : "01:14:23-01:14:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "It could always be worse, buddy. That was the reason the Patriots went out and got white. No, Dorset's a better.",
    "timestamp" : "01:14:25-01:14:36"
  },
  {
    "timestamp" : "01:14:36-01:14:47",
    "speaker" : "Ryan Storie",
    "text" : "Dorset's definitely better than Doug Gabriel. Well no, I'm saying like but he would be in that same spot. I'd rather have like 2006 Watson and who else do you say? Fawk and"
  },
  {
    "timestamp" : "01:14:48-01:14:49",
    "text" : "Troy Brown.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "Troy Brown, oh yeah.",
    "timestamp" : "01:14:49-01:14:50"
  },
  {
    "text" : "End of his career, Troy Brown.",
    "speaker" : "Andy",
    "timestamp" : "01:14:51-01:14:52"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "Yeah. Yeah.",
    "timestamp" : "01:14:52-01:14:54"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:14:55-01:14:58",
    "text" : "Greg, nice to see ya. You want to give us your best and worst?"
  },
  {
    "speaker" : "Greg",
    "text" : "Hey guys. Am I late?",
    "timestamp" : "01:14:58-01:15:03"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, we're literally stopping now.",
    "timestamp" : "01:15:03-01:15:06"
  },
  {
    "speaker" : "Greg",
    "text" : "Perfect timing. What game what game are we talking about?",
    "timestamp" : "01:15:07-01:15:11"
  },
  {
    "text" : "2002 week four against at San Diego Chargers. Doesn't matter.",
    "timestamp" : "01:15:12-01:15:17",
    "speaker" : "Andy"
  },
  {
    "text" : "Did we win?",
    "timestamp" : "01:15:19-01:15:20",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:15:20-01:15:21",
    "text" : "No."
  },
  {
    "text" : "God damn it.",
    "timestamp" : "01:15:21-01:15:22",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:15:22-01:15:31",
    "text" : "I was in England at the time and I stayed up till two AM to watch it and had to be at work at four a. m. And they lost. And it sucked. What's your best and worst?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Sorry, I lost you there. What'd you say?",
    "timestamp" : "01:15:32-01:15:34"
  },
  {
    "speaker" : "Andy",
    "text" : "I said what's your best and worst?",
    "timestamp" : "01:15:34-01:15:36"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh well my best was Ryan Story's performance today. You know, he really brings the levity.",
    "timestamp" : "01:15:37-01:15:45"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, he firing out hot takes left and right. I couldn't keep up.",
    "timestamp" : "01:15:46-01:15:49"
  },
  {
    "text" : "A and my worst is that massive s nose he's got plastered on his face.",
    "timestamp" : "01:15:55-01:16:01",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "The closest thing w this podcast has to Ken Walters, so you be careful.",
    "timestamp" : "01:16:02-01:16:06"
  },
  {
    "timestamp" : "01:16:09-01:16:12",
    "speaker" : "Greg",
    "text" : "My best is uh Ryan story's sense of smell."
  },
  {
    "timestamp" : "01:16:16-01:16:23",
    "text" : "He doesn't even need GPS, he just follows his nose. That's what I tell him every time he asks for direction.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Ryan Storie",
    "text" : "Follow the smell of your musk.",
    "timestamp" : "01:16:24-01:16:26"
  },
  {
    "speaker" : "Andy",
    "text" : "To be fair, I do have a strong musk, so it does work. Uh all right. Well, thanks for joining, Greg, but this has been Uh fantastic episode of the Pages Pog Dynasty Podcast. Um do you know what's happening next week? Do we know where we're going next week?",
    "timestamp" : "01:16:27-01:16:46"
  },
  {
    "timestamp" : "01:16:47-01:16:58",
    "speaker" : "Steve",
    "text" : "No, I don't even know. Don't tell me who wins. Actually already know. You ruined all these games for me, Andy. But you're not telling me when when this when this losing streak ends, because I have no idea."
  },
  {
    "speaker" : "Andy",
    "text" : "In Miami, Florida. To face the Jets. Wait, what? I'm just kidding. I'm facing the Dolphins. You better not fucking lose the goddamn Jets. The three and one Miami Dolphins against the three and one New England Patriots. AFC East Battle, baby. So we'll see you next week on the Pagers Dynasty Podcast. Bye. Thank you for joining us. Including Greg.",
    "timestamp" : "01:17:00-01:17:28"
  }
]