[
  {
    "timestamp" : "00:00-00:18",
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother."
  },
  {
    "text" : "Ready, set, go. You're supposed to go. I know when I said go I didn't mean fucking fond of your microphone though Me? I don't know whoever's making the noise.",
    "timestamp" : "00:23-00:36",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "My microphone is fixed to my desk because I have a true podcast setup where I have four mic screens almost around me with their warm glow of Tom Brady Pictures.",
    "timestamp" : "00:38-00:47"
  },
  {
    "timestamp" : "00:47-01:14",
    "speaker" : "Andy",
    "text" : "All right. Welcome to the Pagers Dynasty Podcast. And for those of you who have been listening all the way through, welcome back. We are week five of the 2002 NFL season. The Patriots have traveled to Miami to visit the 3-1 Dolphins. Patriots also 3-1, but not for long for either of these teams. Let's talk about these fucking Miami fucking dolphins, shall we?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:14-01:26",
    "text" : "Well, wait, I want to acknowledge a mistake you made there. You said they're both three and one. But not for long. That's true. By by by the fact though that they're playing the game. Right. They're not giving me three anymore."
  },
  {
    "timestamp" : "01:27-01:36",
    "speaker" : "Andy",
    "text" : "That's what I was meaning. Oh. They're both gonna have a different record at the end of this game. At the end of this podcast. You will find out what those records are."
  },
  {
    "timestamp" : "01:36-01:36",
    "text" : "Okay.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:37-01:45",
    "text" : "Alright. Or we can ruin it now and let you know that. Um the New England Patriots would lose this game. They get doubled up by a score of 26 to 13.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:46-01:51",
    "speaker" : "Steve",
    "text" : "This is like the biggest longing losing streak of our dynasty, so clearly they lost."
  },
  {
    "speaker" : "Andy",
    "text" : "So far it is. We'd have ruined that, Steve.",
    "timestamp" : "01:51-01:54"
  },
  {
    "timestamp" : "01:55-02:01",
    "speaker" : "Steve",
    "text" : "What? Everyone knows this tier period is when the Patriots lost the most games in a row. It's true."
  },
  {
    "text" : "Have you learned how many games it is yet?",
    "timestamp" : "02:02-02:04",
    "speaker" : "Andy"
  },
  {
    "text" : "No, don't tell me how I want to be surprised when we win a game. I know that we're we're going to lose a bunch. But I don't know how many. I don't remember how long the streak lasted.",
    "timestamp" : "02:04-02:15",
    "speaker" : "Steve"
  },
  {
    "text" : "Do you have a do you have like a ballpark in your mind what you think it's gonna be?",
    "speaker" : "Andy",
    "timestamp" : "02:15-02:18"
  },
  {
    "speaker" : "Steve",
    "text" : "Question. I think I or we ended up nine and seven, right? I think so.",
    "timestamp" : "02:19-02:25"
  },
  {
    "timestamp" : "02:25-02:25",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "Not only we were eight and eight, right? We were nine and seven, I think.",
    "speaker" : "Steve",
    "timestamp" : "02:26-02:28"
  },
  {
    "speaker" : "Andy",
    "text" : "Nine and seven, yeah.",
    "timestamp" : "02:28-02:29"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh so I'm gonna say five games.",
    "timestamp" : "02:30-02:32"
  },
  {
    "text" : "Okay. Let's see how that turns out. All right.",
    "speaker" : "Andy",
    "timestamp" : "02:32-02:36"
  },
  {
    "timestamp" : "02:38-02:41",
    "text" : "And let's do our la Lombardi rating.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh right, yeah. Uh the the watchability of this.",
    "timestamp" : "02:41-02:46"
  },
  {
    "text" : "One to six Lombardies.",
    "speaker" : "Steve",
    "timestamp" : "02:46-02:48"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:48-02:50",
    "text" : "Greg, how many how many Lombardies would you give this game?"
  },
  {
    "timestamp" : "02:54-02:56",
    "text" : "They had the uh prime time highlights on YouTube.",
    "speaker" : "Greg"
  },
  {
    "text" : "So that's already one.",
    "timestamp" : "02:57-02:58",
    "speaker" : "Andy"
  },
  {
    "text" : "Yes. By default. And that's all I watch, so I don't know if I'm on the scale of like not on YouTube to prime time on YouTube, so I'll go I'll give it a three. Three Lombardies.",
    "timestamp" : "02:58-03:14",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "03:14-03:19",
    "text" : "Alright, fair enough. I watch this whole game and I give it negative one Lombardi"
  },
  {
    "text" : "Dude, you can't do that.",
    "timestamp" : "03:19-03:21",
    "speaker" : "Greg"
  },
  {
    "text" : "I don't think we can do negative.",
    "timestamp" : "03:21-03:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "03:24-03:26",
    "text" : "Zero Lombardies. This game was atrocious.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I would give it one Lombardy. Just because of the touchdown catches that happened for the Patriots in this game, they were pretty sick.",
    "timestamp" : "03:28-03:38"
  },
  {
    "text" : "Two good plays in the entire game.",
    "speaker" : "Steve",
    "timestamp" : "03:39-03:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:42-03:47",
    "text" : "Yeah, and there was a stat where the Pagers had two scoring drives, right?"
  },
  {
    "speaker" : "Steve",
    "text" : "And two drives of five or more plays in the whole game.",
    "timestamp" : "03:48-03:51"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:52-04:01",
    "text" : "And those are the two scoring drives. Alright, alright, pump the brakes. We haven't actually talked about these fucking Miami fucking dolphins yet."
  },
  {
    "timestamp" : "04:01-04:04",
    "speaker" : "Steve",
    "text" : "But if that's not a Zero Lombardi game, I don't know what is."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:05-04:12",
    "text" : "I can think of one off the top of my head. It wasn't entertaining though. I can think of a couple off the top of my head."
  },
  {
    "speaker" : "Greg",
    "text" : "What are they, Andy?",
    "timestamp" : "04:16-04:17"
  },
  {
    "timestamp" : "04:18-04:27",
    "text" : "Uh the O seven Super Bowl is zero Lombardi's. And then um the loss to the Jets in the playoffs. That's just close. I'm gonna get to negative.",
    "speaker" : "Andy"
  },
  {
    "text" : "I was yeah, I was at that game. It was brutal.",
    "speaker" : "Greg",
    "timestamp" : "04:27-04:29"
  },
  {
    "timestamp" : "04:29-04:34",
    "speaker" : "Steve",
    "text" : "But this 07 Super Bowl was at least like close and you know, you're on the edge of your seat the whole time."
  },
  {
    "timestamp" : "04:34-05:04",
    "speaker" : "Andy",
    "text" : "Yeah, but it's just the way it ended, bud. That that negates anything that happened beforehand for me. We'll get to that. They lost by 13 points. That's not exactly a blowout, but it's actually less than they lost to Miami last year. I didn't watch that. 30 to 10, right. That was a me and Mike game, and that was one where you said, I think that was also a zero Lombardi game. Yes. Never watch that again."
  },
  {
    "timestamp" : "05:04-05:06",
    "speaker" : "Steve",
    "text" : "And that would be And that was in Miami as well, right?"
  },
  {
    "text" : "Yeah. Um so let's actually touch on that real quick because I remembered the Patriots not playing well in Miami. I didn't realize how bad it actually was. Really? Like all I knew.",
    "timestamp" : "05:07-05:24",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "05:25-05:26",
    "speaker" : "Greg",
    "text" : "It was pretty well documented."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I mean yes and no. But I I feel like the the the edges have kind of been taken off of that in the in the dynasty era. Have they? To a certain extent. I mean it's still a hard place to play, but it's it wasn't the nightmare that I think you are underestimating it used to be. Because the Patriots it's since since Belichick took over, the Patriots are nine and eleven. Which, you know, feels like a travesty in of itself. Um it uh against the Dolphins in Miami, right?",
    "timestamp" : "05:27-06:00"
  },
  {
    "text" : "Yeah, which is terrible compared to their like average, you know, win percentage.",
    "timestamp" : "06:00-06:06",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Um I have You know what they were before Belchek took over though?",
    "timestamp" : "06:07-06:11"
  },
  {
    "timestamp" : "06:12-06:21",
    "speaker" : "Greg",
    "text" : "Yeah, but that they're consistent with how they were normally playing. Like it's an aberration. That's why it's so crazy that they're Yeah."
  },
  {
    "timestamp" : "06:22-06:28",
    "text" : "They were seven and twenty-seven. They were four and twenty-five, actually.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "06:28-06:38",
    "speaker" : "Greg",
    "text" : "Okay. So what's the disparity between their total win percentage over that time and then the disparity between in under Bow check."
  },
  {
    "text" : "So I just I just wanna wanna just pause this moment right now because I don't think what Greg realized, what he's done, is that he, the stat checker, has given himself a stat to check.",
    "speaker" : "Andy",
    "timestamp" : "06:38-06:49"
  },
  {
    "text" : "I've been listening to that podcast he sent me. Oh stats over storylines, baby. It's great, isn't it? Shout them out. I'm not buying these storylines anymore, Andy. Check the goddamn numbers, all right?",
    "timestamp" : "06:51-07:04",
    "speaker" : "Greg"
  },
  {
    "text" : "I'm telling you numbers. The Patriots Okay. Uh from uh I whatever the uh pro football reference start is the uh like the Super Bowl era right back in the seventies. Was it seventy or seventy-two?",
    "speaker" : "Andy",
    "timestamp" : "07:04-07:16"
  },
  {
    "text" : "Okay.",
    "timestamp" : "07:16-07:17",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "From when they started playing the Dolphins They were their their first win from 1970 came against the Dolphins in Miami. Anybody want to guess the year that it came?",
    "timestamp" : "07:18-07:30"
  },
  {
    "text" : "1970.",
    "timestamp" : "07:31-07:32",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "No.",
    "timestamp" : "07:33-07:33"
  },
  {
    "text" : "Uh 83.",
    "speaker" : "Steve",
    "timestamp" : "07:33-07:35"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:36-07:37",
    "text" : "No. Further."
  },
  {
    "text" : "Or after you were born.",
    "timestamp" : "07:38-07:40",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh it was just after. Wow. I was two. It was nineteen eighty-five. They started 0-16 at Miami before getting their first win.",
    "timestamp" : "07:40-07:50"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "07:50-07:50",
    "text" : "Oh."
  },
  {
    "timestamp" : "07:51-07:58",
    "speaker" : "Andy",
    "text" : "Yeah. They're at the longest win streak the Pages have had in my like playing in Miami. Three games."
  },
  {
    "speaker" : "Greg",
    "text" : "That's not very good.",
    "timestamp" : "08:00-08:01"
  },
  {
    "speaker" : "Andy",
    "text" : "Twenty ten to twenty twelve. Like this is it's a house of horrors. So I kind of almost wanna write to the stats and storylines guy, stats over storylines guys, and say Do does Miami as a as a home stadium is it more of a home field advantage than these other like so-called home field advantages like Denver and Kansas City. I would say in terms of like how how many more games they win at home than they do away, because Dolphins are terrible away.",
    "timestamp" : "08:02-08:34"
  },
  {
    "timestamp" : "08:36-08:39",
    "text" : "Yeah, but I think that's just a Patriots thing. Maybe.",
    "speaker" : "Greg"
  },
  {
    "text" : "And it's also a like September thing. Like this game is pretty early in the year, and they're talking about how hot it is and the dark jerseys and all that. That's always been that like the early season Patriots games. Remember that Patriots dolphins game we went to as a family? Yep. Early in the year. It was pretty hot as shit. It was so hot I'd take my shirt off.",
    "timestamp" : "08:39-09:00",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, that's why you did it. Yeah, the Patriots at home against the Dolphins, 16 and 4. Like that's a ridiculous disparity.",
    "speaker" : "Andy",
    "timestamp" : "09:01-09:11"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "09:12-09:13",
    "text" : "Sixteen and four."
  },
  {
    "timestamp" : "09:14-09:14",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "As opposed to nine and eleven fifty-six, Patriots fifty-three.",
    "timestamp" : "09:14-09:19",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so amazingly Miami only wins when they play at home and the Pages only win when they play at home. That's crazy.",
    "timestamp" : "09:22-09:28"
  },
  {
    "text" : "So what is it, Andy, for before Belichick at home?",
    "timestamp" : "09:28-09:33",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:35-09:43",
    "text" : "I I don't have those numbers right now. So it was there were f four and twenty-five. Yeah, four and twenty-five in Miami. Okay."
  },
  {
    "text" : "We'll put it in the show notes, but I'm running those numbers because I want to know. Yeah, so do I. Because my my feel my gut feeling is this is like somewhat of just like a weird anomaly. Like yeah, there's the heat element. But I think it's just one of those weird th like the the Hail the Fail Mary or the Hail Mary play, right? Where Grog could that's just like a weird thing. That's true. You know, it's got nothing to do with like",
    "timestamp" : "09:45-10:14",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "10:23-10:29",
    "speaker" : "Steve",
    "text" : "The game that we went to, the they had Four chances from like the ten yard line to punch in and they didn't. Remember? Yep."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. So the moral of the story, it's like a Bermuda triangle, you know? There's no explanation.",
    "timestamp" : "10:29-10:37"
  },
  {
    "speaker" : "Andy",
    "text" : "A Miami triangle, if you will.",
    "timestamp" : "10:38-10:39"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "10:39-10:53",
    "text" : "Yeah. Yeah. Where do you think it's I mean Over the at least the Pages Dynasty, it's been pretty clear it's been two stadiums where they struggle. It's on the road to Miami early in the year and it's at mile high. Yep. Which one's worse do you think?"
  },
  {
    "text" : "Um worse in in which way?",
    "speaker" : "Andy",
    "timestamp" : "10:55-11:00"
  },
  {
    "text" : "Which one kept Brady up later at night? Oh Mile high.",
    "timestamp" : "11:00-11:08",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "11:09-11:24",
    "text" : "That's a good question. Yeah, because I feel like the mile high games were more the stakes were higher and you didn't play them as often, yeah. Yeah, because three of those losses came in the in the playoffs. Two came in overtime. They were five and seven mile high."
  },
  {
    "timestamp" : "11:24-11:31",
    "text" : "I bet early in the year though, like like early in Brady's career, it's probably the Dolphins though.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "11:32-11:35",
    "text" : "Oh yeah, they had his number like nothing else. Sure."
  },
  {
    "speaker" : "Greg",
    "text" : "All right, you want to hear true home field advantage statistics?",
    "timestamp" : "11:37-11:42"
  },
  {
    "text" : "Okay.",
    "timestamp" : "11:43-11:43",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "11:44-11:52",
    "speaker" : "Greg",
    "text" : "For all thirty-two NFL teams. I do. The best, the Baltimore Ravens."
  },
  {
    "speaker" : "Andy",
    "text" : "Really? What?",
    "timestamp" : "11:53-11:55"
  },
  {
    "text" : "I think this goes back to Cleveland though, because they're looking at a population of like four hundred games, so that's gotta be before they move to Baltimore. I think so. The Bills are second. That makes sense. Gotta love it. Vikings, Niners. Uh Dolphins are like middle of the pack. Hmm. Where are the Broncos?",
    "speaker" : "Greg",
    "timestamp" : "11:55-12:17"
  },
  {
    "text" : "But like no one's like Seattle, maybe. Seahawks are universally regarded as the twelfth man and all that shit.",
    "timestamp" : "12:18-12:26",
    "speaker" : "Steve"
  },
  {
    "text" : "Right. They're like 10th. And what what are these numbers based on?",
    "speaker" : "Andy",
    "timestamp" : "12:26-12:30"
  },
  {
    "timestamp" : "12:31-12:50",
    "speaker" : "Greg",
    "text" : "Oh, I don't look at those things, Andy. I just see I see a table in the article and I just go right there. The words, fuck 'em. So I assume it's probably like We surveyed ten fans. It's it looks like it's using home and away scoring margins."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh okay, I mean I don't know. Where's the raised Gillette?",
    "timestamp" : "12:51-12:56"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "12:57-13:10",
    "text" : "It's not Stadium specific, Steve. I think that's where you're getting hung up. Like Seattle right now is because of their stadium, but if you're looking at 400 games, then you're talking about like the whole lifetime of the franchise."
  },
  {
    "text" : "And they were pretty terrible early on.",
    "speaker" : "Andy",
    "timestamp" : "13:10-13:12"
  },
  {
    "timestamp" : "13:12-13:13",
    "speaker" : "Greg",
    "text" : "I don't really see the page."
  },
  {
    "text" : "Maybe not one of the games is about what we're trying to tackle here, right? How many games is this podcast supposed to be if we went all the up to the end of",
    "timestamp" : "13:13-13:21",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that's a great question. Um it is three hundred and sixty-one games. Yeah. Right.",
    "timestamp" : "13:21-13:30"
  },
  {
    "speaker" : "Greg",
    "text" : "So we're I don't know. We're probably one of the older half of the stadiums now in the league. Would you say that? I would say.",
    "timestamp" : "13:30-13:37"
  },
  {
    "timestamp" : "13:37-14:09",
    "speaker" : "Andy",
    "text" : "Yeah, because it was built in what, 2001. Yeah. So 20 years ago. That's pretty old for a stadium. Yeah. Speaking of stadiums though, um I I still have a problem and it wasn't even here in this game, but I have a problem with the Teams that share stadiums with baseball teams. You don't like that? Is that for like poor people? Like are we are we sharing So you they couldn't afford their own stadium? Like this is the NFL we're talking about here."
  },
  {
    "timestamp" : "14:09-14:10",
    "speaker" : "Steve",
    "text" : "Poor people. Yes, Indian."
  },
  {
    "speaker" : "Andy",
    "text" : "Well it's yeah, the cities are paying for it. Th well that's true. Miami's got a shit ton of money though. I know. You know what I always like built the Marlins like their third stadium in ten years.",
    "timestamp" : "14:11-14:22"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "14:22-14:24",
    "text" : "Yeah, and no one goes to those games."
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly.",
    "timestamp" : "14:25-14:25"
  },
  {
    "speaker" : "Greg",
    "text" : "I used to always like watch those games and just You know how like when you watch that's that old screensaver and hope it hits the corner? Yeah. Yeah. I used to always hope that I'd see someone like running on football field at quarterback and then slide. and like have it time up so they were sliding into like a second base. I was like just once in my life I want to see that time up correctly.",
    "timestamp" : "14:25-14:49"
  },
  {
    "text" : "That would have been a great celebration though, like if you score a touchdown, cause the home plate had to be like towards a corner of the end zone, right? No. And it's like way off the field, I feel. I don't know.",
    "speaker" : "Andy",
    "timestamp" : "14:50-15:01"
  },
  {
    "timestamp" : "15:01-15:09",
    "speaker" : "Steve",
    "text" : "I mean it's got the football fields have to be in the outfield with like a portion of like the second base part of the dirt coming in like near the 50-yard line."
  },
  {
    "speaker" : "Andy",
    "text" : "It wasn't it was like 30 yard line, but still I think I don't know.",
    "timestamp" : "15:09-15:14"
  },
  {
    "timestamp" : "15:14-15:25",
    "speaker" : "Greg",
    "text" : "Um And how do they not just put sod on that? Like I'm sure there's a real reason, but they can turn a NBA stadium into an NHL stadium in like two hours"
  },
  {
    "text" : "Well meaning grass. Grass is alive for one. Yeah. And just put it just laying it down, it it's just gonna slide all over the place.",
    "timestamp" : "15:25-15:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh you won't talk about growing grass, do you? Yeah, our episode. Let's go. Here we go.",
    "timestamp" : "15:34-15:40"
  },
  {
    "timestamp" : "15:41-16:05",
    "speaker" : "Greg",
    "text" : "Well you see what the uh the new Raider Stadium is doing? No. No. They ha they have uh like uh that fake turf stuff. For the University of Nevada who are playing on it. And then on top of it is sitting like a huge slab of real grass that they can put on rollers and roll outside the stadium. Oh, like they have in Arizona. Yeah. Yeah."
  },
  {
    "timestamp" : "16:05-16:06",
    "speaker" : "Steve",
    "text" : "Cardinals do that, right?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. For no fucking reason though. Like dude. Why why not just not have a roof?",
    "timestamp" : "16:07-16:11"
  },
  {
    "speaker" : "Steve",
    "text" : "Problem solved. Well then you get everyone inside gets hot and sweaty during the game.",
    "timestamp" : "16:11-16:15"
  },
  {
    "text" : "It's Arizona. It's it's not sweaty. It's it's a dry heat. It's still cold. Everybody ever has said, oh, you're going to Arizona, huh?",
    "timestamp" : "16:16-16:25",
    "speaker" : "Andy"
  },
  {
    "text" : "Heard it's hot there.",
    "timestamp" : "16:26-16:27",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Dry heat.",
    "timestamp" : "16:28-16:29"
  },
  {
    "timestamp" : "16:29-16:45",
    "speaker" : "Greg",
    "text" : "Oh, it's a dry heat, though. You'll be alright. Like one fat in the shade, but it's a dry heat. Yeah, that's like that's work talk that I cannot stand. Yeah. I don't really know anything about your personality, but here's a fact I know about the heat in Arizona."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, did you see Ryan Fitzpatrick on the football field? He went to Harvard. Yeah.",
    "timestamp" : "16:45-16:50"
  },
  {
    "speaker" : "Andy",
    "text" : "Antonio Gates, I think he played basketball.",
    "timestamp" : "16:51-16:54"
  },
  {
    "speaker" : "Greg",
    "text" : "So apparently the there's something about that too about the um the heat in Nevada. They're talking they have like this like Glass like material, I guess, that lets in sunshine but keeps out heat somehow.",
    "timestamp" : "16:54-17:10"
  },
  {
    "text" : "Yeah, it's called glass.",
    "timestamp" : "17:11-17:12",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "17:16-17:26",
    "text" : "Andy, the heat transition. Yeah, don't talk to me about heat transition coefficients, all right? I studied chemical engineering in college.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "17:28-17:36",
    "text" : "How much do you use that on a daily basis? Absolutely not at all. I can barely spit those words out.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "17:36-17:44",
    "speaker" : "Greg",
    "text" : "Yeah. But it it's not glass. It's some like weird material. It's kinda cool though. Cool."
  },
  {
    "text" : "Cool Speaking of heat though, uh this game was played in 86 degree heat with it was something like 80 something percent humidity. So it felt like I think it was like the the feel-like temperature on the feel was like 95. Um and the commentators had this story about uh Belichick putting garbage bags over the AC vents in the locker room because apparently Miami would crank the AC in the opposing team's locker room so that it felt uh the quote was as cold as a meat locker in there. Which would kind of slow the guys, the opposing team in the second half because they didn't want to come back out into the the heat from the cold.",
    "speaker" : "Andy",
    "timestamp" : "17:45-18:33"
  },
  {
    "text" : "So you're gonna have like a that's a that's totally fair advantage and the Patriots should cut off the heat in the visiting room locker room at Gillette Stadium in December.",
    "timestamp" : "18:34-18:47",
    "speaker" : "Steve"
  },
  {
    "text" : "Can you imagine the pushback that would happen if they did that? That would be amazing.",
    "timestamp" : "18:48-18:52",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:52-19:00",
    "speaker" : "Greg",
    "text" : "Yeah, I also think that the home team should be able to control the PSI and footballs too. You know, where does it stop, Steve? Where does it stop?"
  },
  {
    "timestamp" : "19:02-19:03",
    "speaker" : "Andy",
    "text" : "Go fuck yourself."
  },
  {
    "timestamp" : "19:03-19:21",
    "speaker" : "Steve",
    "text" : "But I won't I mean what do you think is worse? Like Tomberry's record when it's super duper hot out and it's like record when it's super duper cold out too, right? Because it's always been like just as much as they've struggled in the heat in Miami. And people make a big deal of that. They make as equally a big deal as how awesome he is when it's like really fucking cold out."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh you can find those numbers on pagesdynasty. info. Really? Slash search slash Brady, yeah. You get temperature? Yeah.",
    "timestamp" : "19:21-19:30"
  },
  {
    "speaker" : "Steve",
    "text" : "You can filter game by temp.",
    "timestamp" : "19:31-19:32"
  },
  {
    "timestamp" : "19:33-20:03",
    "speaker" : "Andy",
    "text" : "Oh yeah. Oh so it's it's the game search it has it right now, but yes, it will be added to the uh the Brady search as well. So search slash games. Um there's a temperature cider. And you can percentage. You can also do it by surface type, the Vegas line, and the overunder if you want as well. For the month or whether it was a uh overtime game or a game played after a bye. I didn't just fucking throw this together. That's it. No, actually that's only maybe half of them."
  },
  {
    "speaker" : "Steve",
    "text" : "You should be You should like put if they beat the uh the Vegas over under or not. And like the spread. I would love to like look at games that they didn't be the spread because they would like crush a spread historically, right?",
    "timestamp" : "20:03-20:16"
  },
  {
    "timestamp" : "20:16-20:27",
    "text" : "Well in theory you could do that. You could put uh games that they weren't favored and then whether or not they won or lost. Because you can search for you can filter by game result. Well they're always favored.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I think they're decent against the spread, but not like crazy. Because they're always favorites.",
    "timestamp" : "20:28-20:34"
  },
  {
    "text" : "Yeah, they are favorites a lot of the time. Yeah.",
    "timestamp" : "20:34-20:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Let's see. If you're gonna be betting NFL, you have to go dogs. You tell woof.",
    "timestamp" : "20:38-20:47"
  },
  {
    "text" : "They are 38 and 31 as underdogs.",
    "timestamp" : "20:48-20:52",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "20:52-20:56",
    "speaker" : "Steve",
    "text" : "Uh Patriots are 60% against the spread."
  },
  {
    "timestamp" : "20:58-21:00",
    "speaker" : "Greg",
    "text" : "Over what time period"
  },
  {
    "speaker" : "Steve",
    "text" : "Tom Brady starts. This article's written in March 2019. That's pretty good. That's not bad.",
    "timestamp" : "21:00-21:06"
  },
  {
    "text" : "Theoretically. All right, speaking of the dolphins. I mean we've avoided this game for twenty minutes now because Yeah I",
    "speaker" : "Andy",
    "timestamp" : "21:09-21:21"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "21:24-21:57",
    "text" : "I will say there was one thing that stood out to me in this game. Alright. A Robert Edwards sighting. Yes. He was back. He was back. As I understood it, Robert Edwards suffered that knee injury, which they talked about on this, whereas he tore three ligaments and nearly severed an artery and almost had to have his leg amputated. playing uh flag football on the beach in the Pro Bowl after his rookie year. Yep. Where he had like twelve hundred yards rushing, had like 12 TDs and then he never played again."
  },
  {
    "speaker" : "Andy",
    "text" : "I have the uh I remember him I remember him coming back, not lasting long. I never remember I didn't remember him coming back. But yeah, he didn't last he didn't last long, but I think he played a couple years with the Dolphins here.",
    "timestamp" : "21:57-22:09"
  },
  {
    "timestamp" : "22:09-22:10",
    "speaker" : "Steve",
    "text" : "He looked okay in this game."
  },
  {
    "timestamp" : "22:11-22:23",
    "speaker" : "Andy",
    "text" : "Yeah, he was kinda their third down back, which I feel like is almost had the Patriots use him in ninety-nine too. Almost like the J. R. Redman sort of thing. He wasn't like a bruiser. But he ran for a thousand yards, so maybe he was. I don't remember."
  },
  {
    "text" : "Yeah, no, he was their number one back. He was their version of Twan and Corey Dillon and all that.",
    "timestamp" : "22:24-22:28",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "22:28-22:31",
    "text" : "Yeah. Well maybe not Corey Dill. Let's pump the brakes.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I just remember being so hyped because he was so good as a rookie and I was like we finally found like",
    "timestamp" : "22:31-22:36"
  },
  {
    "text" : "You know how I felt that about right after Curtis Martin too?",
    "speaker" : "Andy",
    "timestamp" : "22:37-22:40"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Andy Katzenmoir. I have uh I have a Robert Edwards jersey. You do? Uh huh.",
    "timestamp" : "22:40-22:48"
  },
  {
    "timestamp" : "22:48-22:50",
    "text" : "Oh my jersey.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, Gujani gave it to me.",
    "timestamp" : "22:50-22:52"
  },
  {
    "timestamp" : "22:53-22:54",
    "text" : "It's crazy.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "22:55-22:56",
    "text" : "Yeah, as you do."
  },
  {
    "speaker" : "Steve",
    "text" : "They had At the backside of the game, they were just like trying to fill time because it was such a blowout. Yeah. I don't know why I watched this whole game. I was stupid, but um They had a thing where about because they're going deep on Robert Edwards and like how he had no ill will but b uh against the Patriots. Robert Kraft had called him up personally and like talked to him about it and said, you know, this is not something like this is no hard feelings, but this is just like a business thing. And he totally understood it and like all that. I think RKK gets a lot of credit like nowadays, like all that, but it's cool. Like this has happened a couple of times. You look back and you see like it's not really it's something they've always been. It's been like a like a personality traitor of value, right? Only a lot of owners would be calling them up like that.",
    "timestamp" : "22:56-23:47"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true, yeah. And you I mean you don't really hear ex-patriots come out with negative stories about their time on the Patriots. Even people like, you know, Michael Bennett, who wasn't here for very long and wasn't particularly well utilized. And people thought, you know, he was gonna be a distraction, then he got traded and everything, and he had absolutely no bad bad words to say about it.",
    "timestamp" : "23:47-24:09"
  },
  {
    "text" : "There's some, but it's more about like how I was used or what I was asked to do or like that sort of thing.",
    "speaker" : "Steve",
    "timestamp" : "24:09-24:16"
  },
  {
    "timestamp" : "24:16-24:24",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, but there hasn't been any like Deion Lewis. Yeah, Deion Lewis is probably the closest you can get."
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, Gronk retired just to get away from the Patriots. Did he though? Or did he retire just to get away from football? I t I don't know. It seems awfully coincidental that soon as Brady left, he's suddenly unretired. Maybe.",
    "timestamp" : "24:24-24:37"
  },
  {
    "timestamp" : "24:38-25:00",
    "text" : "You said that wasn't a reason, but yeah, but also allowing uh weed this year too to not put it. That Reggie Wayne thing that came out. You think it's weed? I well yeah, all he's doing is pumping fucking CBD companies now, so that's not weed, Andy. I understand that, but it'll still pop you for a test though, won't it? Have you ever even smoked doobies? Yes, you made me do it.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:01-25:01",
    "speaker" : "Steve",
    "text" : "What?"
  },
  {
    "text" : "Yeah, oh, this is a great story, Tom. I have not heard the story. Oh no. Uh Father's Day, what was it like five, six years ago? Yeah. when we were all drinking out in Portland, Maine. And then like halfway through the drinking session, Kelly was like, oh yeah, I have these uh hash brownies. There were cookies. And yeah. And we're like, oh, we'll give some to my dad because he's like a deadhead. So it's like, yeah, we'll give some to him as a present. Not expecting him to like just eat it right then and there. We're like, here, happy Father's Day. He just like pops one in his mouth and I was like, oh God. I guess I guess we're all jumping on this train. Yep. And then Andy took one. And Andy claimed that he doesn't weed doesn't affect him. Which spoiler alert turned out not to be true. And then like Me, Andy, Dad, and Kelly, my wife, were all super stoned walking around Portland. And then my mom showed up, and at first we didn't tell her. Which I don't know why we didn't, probably 'cause we're like high and paranoid. Well, we were acting so strange that eventually she's like, What is going on with you guys? And I was like Kelly drugged us.",
    "speaker" : "Greg",
    "timestamp" : "25:02-26:24"
  },
  {
    "speaker" : "Mom",
    "timestamp" : "26:27-26:29",
    "text" : "And she was like, oh, thank God."
  },
  {
    "timestamp" : "26:31-26:35",
    "speaker" : "Andy",
    "text" : "It was unbelievable. Oh, you think that's the end of the story?"
  },
  {
    "timestamp" : "26:36-26:38",
    "text" : "Well, I don't know how much you want to divulge Andy.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh no, let's l I mean we're here now, right? May as well Okay.",
    "timestamp" : "26:38-26:41"
  },
  {
    "speaker" : "Greg",
    "text" : "All right.",
    "timestamp" : "26:42-26:42"
  },
  {
    "speaker" : "Andy",
    "text" : "Well let's just finish the story then. So we're all Yeah, so the way I remember this was I remember that part, but I remember that we didn't actually eat lunch because there was no food in the in the condo because you know dad was there and he doesn't fucking do that sort of thing. So the cookies were lunch. And so I I think I probably had more than one, which was a bad decision looking back on it now. Um it felt fine all the way through and then we were sitting at the the bar underneath the condo because it's it's the top floor of a a hotel and so the hotel bar there and we're I was eating uh a burger and I just like I felt all the the color drain from my face. I'm like, oh that's that's probably not good. So I have mom walk me back to the college.",
    "timestamp" : "26:42-27:29"
  },
  {
    "text" : "Wait, wait, wait, wait. Sorry to interrupt, but I remember this So distinctly, you like like nudged my arm and you looked at me, you go, I'm fading. I was like, someone's gotta get Andy out of here.",
    "timestamp" : "27:30-27:44",
    "speaker" : "Greg"
  },
  {
    "text" : "Yep. That feels all right. Because all I remember is that it was a burger with one of those um pretzel buns. I'm like, this is gonna be so good. And I was so like torn about whether or not I should leave it. But I realized I had to because I was fading fast. So the walk was like maybe a hundred yards, not even, maybe fifty yards. And so we get in the elevator and the next thing, just me and mom. We get in the elevator, just taking me back to the the condo. And the next thing I remember is waking up sitting down on the floor of the elevator with mom very worriedly looking at me, asking me if I'm okay. I'm like, yeah, I'm fine. Why? It's like because you passed out and hit your head on the the side of the elevator and sat down. Oh I feel okay. And then I went to the uh we got back to the condo without any more issues. And I immediately threw up and felt perfectly fine.",
    "speaker" : "Andy",
    "timestamp" : "27:44-28:40"
  },
  {
    "speaker" : "Greg",
    "text" : "His dad threw up too.",
    "timestamp" : "28:40-28:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:42-28:48",
    "text" : "Yeah. I think dad also had more than one cookie. Yeah. I think it was also lunch for him as well."
  },
  {
    "speaker" : "Greg",
    "text" : "And to put this in perspective, our mom is like Five five, like a hundred and twenty pounds. Yeah, she's ten. Yeah. And meanwhile, Andy's like six two and just and she doesn't know that he's Eating a weed cookie, right? So that she has no idea what's wrong with him. She was so scared. I blame Kelly.",
    "timestamp" : "28:48-29:09"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm like Kelly give me drugs",
    "timestamp" : "29:09-29:11"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. And then like so dad had a similar experience where he had to go up to the room early and he puked and went to bed early. Yeah. And Kelly was all sketched out because this was like early in our relationship. And she's like, oh my God, your parents are gonna hate me, this and that. And then we woke up the next day. And and dad was like, that was the best Father's Day ever. So dude, you mute Good lord.",
    "timestamp" : "29:11-29:39"
  },
  {
    "timestamp" : "29:40-29:42",
    "speaker" : "Steve",
    "text" : "That's how the idea for this podcast was born."
  },
  {
    "timestamp" : "29:45-30:26",
    "text" : "Um So speaking of devastating injuries, uh I found an article talking about uh Robert Edwards and what actually happened to his knee. And this is the quote. In a single moment, without warning, Edwards has dislocated his knee while diving to knock down a pass that afternoon. Dislocation, however, doesn't come close to explain the carnage that occurred. Edward's anterior cruciate, posterior cruciate, and medial collateral ligaments were all completely torn. The fourth ligament was nearly shredded. In addition, he suffered severe nerve damage and a severed artery that had to be repaired immediately. One doctor said it looked as though Edward's knee had been hit by a hand grenade.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "30:27-30:37",
    "speaker" : "Greg",
    "text" : "That's what I don't understand is like it's sand. You think like to get a crazy tear like that, it would have to be like a hard impact? Shouldn't sand be less of an impact?"
  },
  {
    "text" : "That's yeah, but it I mean it all the worst ones always seem to be non-contact injuries. Like remember Wes Welfare?",
    "timestamp" : "30:37-30:43",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "30:44-30:48",
    "speaker" : "Greg",
    "text" : "Yeah Maybe it's like an angle thing. Like if you come at a weird angle in the sand."
  },
  {
    "text" : "I think it's like if your foot gets stuck and the rest of your weight goes the other way. And I could see that maybe in sand. Yeah.",
    "timestamp" : "30:49-30:55",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "30:55-31:03",
    "text" : "Because um Edelman had the same thing, remember in the in the preseason against the the Lions. Yeah. He just caught the ball, his leg landed wrong, and just pop.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:03-31:07",
    "text" : "Everything goes. Oh, so disappointing. Oh, yeah",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "It gives me the heebie jeebies. As a as a as a person with knee problems. Yep. Same here. Well can I can I transition from the weed story to my weed stories? I wish you would. All right. Ricky Williams.",
    "timestamp" : "31:09-31:28"
  },
  {
    "text" : "This is the the player that we're deep diving into.",
    "speaker" : "Andy",
    "timestamp" : "31:31-31:33"
  },
  {
    "speaker" : "Greg",
    "text" : "That feels appropriate. The recently traded for, right? They traded for him? They did. From the New Orleans Saints. So this is his first season in Miami. So fourth game. So I think well there's one really interesting thing that I did a deep dive on, like his initial contract that he signed his rookie year. Um Okay. So maybe I'll I'll go over that first and then we can kind of talk about general things about him after. Yeah, yeah. So 1999, he was a fifth overall pick by the Saints. He just he just won the highsman at Texas. He's putting up like crazy numbers there, like record setting, you know, yardage, touchdowns, all that crap. So when he got drafted He's always been a bit out there dude anyways, but the whole like rap and uh sport scene was kind of merging, right? Right. So you had a lot of like Those guys hanging out with each other and like you know, they always say like every rapper wants to be an athlete and every athlete wants to be a rapper. So this is kind of like the crossing of those cultures. So there was a new um sports agency in town in New Orleans. called No Limit Sports and this is uh the brainchild of Master P the entrepreneur so he had a record label that he like was turning into a sports agency basically like uh The original idea of Jay-Z's like Rock Nation sports, right? Yeah. Okay. So up to this point it was kind of just like NBA stars. So uh Ron Mercer, Jason Terry. Remember Ricky Davis from the Celtics? Yeah. Yep. The guy that infamously shot at his own hoop to get one more rebound for a triple-double. He's a legend. He's very much kind of like uh Ricky Williams.",
    "timestamp" : "31:33-33:33"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:33-33:35",
    "text" : "Did he actually get it? Yes."
  },
  {
    "text" : "The triple D gave him the stat though.",
    "timestamp" : "33:35-33:39",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "33:39-33:43",
    "text" : "That's what I was wondering. Yeah. Cause if he did, then fucking worth it.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. It's just so like blatantly fuck it, you know? Yeah. So they're this is like a new agency, right? They don't really have much experience on the staff, but it's uh Yeah, they're trying to they're basically trying to like stop getting screwed over by these crusty old white guys that kind of control the sport, right? So it's like a good idea in theory, which I think Jay-Z is kind of like figuring out himself. So In his rookie contract, what they ended up doing was this is actually Ricky wanted it this way where there's he wanted like as much money as he could get up front and then basically everything beyond that was incentive based. So he signs a $8. 8 million signing bonus and then the league minimum salary pays out for five years. Uh and then the incentives are worth up to sixty-eight million dollars over the life of the contract.",
    "timestamp" : "33:43-34:48"
  },
  {
    "text" : "Damn.",
    "timestamp" : "34:49-34:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "34:49-35:38",
    "text" : "All right. However, here it comes. These incentives were just fucking ridiculous. Some are some say it's like the worst contract ever. I'll just give you some. Right. So there's like there was three types of bonuses he could get. So the first one was like rushing yards bonus. Yeah. Um And it would give 'em like one to three million dollars based on like tiered yardage. So per season. But it started at sixteen hundred yards. Oh and then the three million was for like if he sets the rushing record So basically it's like he has to set the rushing record every year of his contract to get that full 68, right? Yeah. So he only hits that once in his career. Yeah."
  },
  {
    "timestamp" : "35:39-35:40",
    "speaker" : "Andy",
    "text" : "This year, 2002."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "35:40-35:40"
  },
  {
    "text" : "1853 yards.",
    "timestamp" : "35:40-35:42",
    "speaker" : "Andy"
  },
  {
    "text" : "Yep. And then there was like the next bonus category was like all these like there was like 40 different uh Just weird things, you know, like, uh, you gotta be a this percentage of snaps, blah blah blah. But then some of them started getting ridiculous, like NFL MVP. Oh Super Bowl MVP. One of them was twelve plus receiving touchdowns, which which I guess no running back has ever done.",
    "timestamp" : "35:42-36:11",
    "speaker" : "Greg"
  },
  {
    "text" : "I I think the list of uh wide receivers that have done it in a season is probably not that long either.",
    "timestamp" : "36:13-36:18",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:19-36:23",
    "speaker" : "Steve",
    "text" : "Yeah, yeah, exactly. Yeah, that's a great wide receiver year this year."
  },
  {
    "timestamp" : "36:23-37:11",
    "speaker" : "Greg",
    "text" : "Yeah. So then the other one I think is the most interesting was over after the fourth season. If he had like 6,413 yards rushing, 7574 total, 4. 8 yards of carry, through into six, six points, they're all like these kind of like obscure numbers. And then people looked into it and basically it was the Terrell Davis bonus. So those were the exact numbers that Terrell Davis had put in, or he had put up for his first four seasons. So the bonus was basically if you hit three of these four, you get that full bonus. Ha Jesus."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:12-37:17",
    "text" : "But how long was he on that contract, right? Because he was on the Saints for that that long."
  },
  {
    "speaker" : "Greg",
    "text" : "I think he did three years at the Saints. I think it was a five-year contract, if I'm not mistaken.",
    "timestamp" : "37:18-37:23"
  },
  {
    "timestamp" : "37:23-37:31",
    "text" : "Yeah, he did three years with the Saints. One, two, three, four. Oh, we did seven years Miami and then one with Baltimore to finish it up.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "37:31-37:37",
    "text" : "But like the seven years of Miami were probably like one or two of those at least he was out smoking weed in Tibet.",
    "speaker" : "Steve"
  },
  {
    "text" : "So you want to hear. Seven were the seven he played, but he skipped 2004, Miss Season, retired, and 2006, Miss Season Violation of League Substance Abuse Policy. So yes, you're right. You were tired to go smoke weed. Missed a couple seats.",
    "speaker" : "Andy",
    "timestamp" : "37:39-37:55"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "37:56-38:22",
    "text" : "No, I all right. So let's get into this then. I I love Ricky Williams. I'm just gonna say it right now. All right. I think dude, he's been completely unfairly maligned in the press. He didn't quit foot he didn't quit football to smoke weed. He quit football because his body was deteriorating and he didn't want to play anymore. And then he smoked weed."
  },
  {
    "timestamp" : "38:23-38:31",
    "text" : "I would agree with you if he hadn't come back for one, two, three, four, five years of playing after he retired twice.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I thought it was more like a Dave Chappelle situation where he was like, this is all a bunch of like corporate ass bullshit, like I'm just gonna be out.",
    "timestamp" : "38:31-38:39"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "38:40-39:11",
    "text" : "Well, so I watched uh football life Ricky Williams. And it was basically like he was a workhorse In Miami. And then they had told him that they were gonna like revamp the offense, get a good quarterback, and they just didn't do that. And he's like, All right, I'm already beat up. And now I'm clearly gonna get a ton of carries and just get even more beat up. And he's always been a bit of a like a eccentric guy. And he's like, all right, I'm I'm not doing this. I'm leaving. I kind of respect that."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And even just watching this game, like he he wasn't A shifty guy. He wasn't a priest Holmes or Ladanian Thompson. He was a bruiser. Yeah. And he even in this game, he took some shots that I don't think I would have gotten up from. And he took a bunch of them. So I I completely understand and agree with that decision.",
    "timestamp" : "39:11-39:31"
  },
  {
    "text" : "I heard someone say that like I think it's a Doug Stanhope stand-up about it. And he's like, he's like, all he all he's really doing is what like normal people do. You always talk about if you win the lottery, what do you do? You quit your job, right? He's like you got an eight point eight million dollar signing bonus and he quit his job. You gotta kinda respect him for it. Yeah. No, I'm a hundred percent behind that.",
    "timestamp" : "39:32-39:56",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "39:56-39:59",
    "speaker" : "Steve",
    "text" : "I never I never disliked Ricky Lance. I always thought he is"
  },
  {
    "speaker" : "Greg",
    "text" : "And he's actually like pretty insightful guy too. So he's not like Yeah. He was uh He was uh honor roll student all the way through school. Like all these coaches, like Mike, uh Mike Dick, Sabin, Parcells, all those guys absolutely love him and like vouch for him and stuff like that. Cause he's like He's a thoughtful dude, right? He's kind of like an Arian Foster where he's he's not just a football player who comes and plays football. And I think in this time era like that was kind of frowned upon where now people are starting to come more around to it being like all right thoughtful players that's like kind of a good thing so I think he kind of got like dragged through the mud a little bit because everyone was like, oh what a dope. He gave up all his money and he's quitting and put and smoking weed. But I think he was actually like a really thoughtful dude if you listened to him and like tried to understand his perspective.",
    "timestamp" : "40:00-40:55"
  },
  {
    "timestamp" : "40:55-41:37",
    "speaker" : "Andy",
    "text" : "Yeah, no, I agree with that. I think um the one thing you missed was his draft day. Did you look at this at all? No, I don't think I it was banana. So uh and also his um you touched on it a bit, he did win the Heisman and his college stats. I'll just read them to you real quick. First year he ran for 990 yards, eight touchdowns. Second year, twelve hundred yards and twelve touchdowns. Third year, eighteen hundred yards, twenty-five touchdowns. Fourth year, which I'm assuming is the one he won this Heisman. Two thousand one hundred and twenty-four yards and twenty-seven touchdowns."
  },
  {
    "timestamp" : "41:38-41:38",
    "speaker" : "Steve",
    "text" : "My God."
  },
  {
    "speaker" : "Greg",
    "text" : "Ridiculous.",
    "timestamp" : "41:39-41:40"
  },
  {
    "text" : "So that first year carries of Priest Holmes, right? Maybe. And we touched on this in the KC episode. Because they're at they're at Texas at the same time.",
    "timestamp" : "41:40-41:51",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, that's right. They were, weren't they? Yeah. Oh yeah, so then maybe. God, that's a hell of a backfield. Yeah. Um college football for you. Yeah. So in in that last season, ninety-eight, he set the NCAA record for rushing yards and won the Heisman.",
    "timestamp" : "41:52-42:08",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Is that still standing? No, it got it got broken the year after by Ron Dane.",
    "timestamp" : "42:08-42:14"
  },
  {
    "text" : "Ron Dane of all people. That's a shame. Um so So he was like the highly touted running back coming out of the draft. Like um what's his name for the the Giants? This guy. Yeah, yeah, exactly. Um, so he was like the Saquon of the draft. And um Mike Dicker was the head coach of the Saints at the time.",
    "timestamp" : "42:15-42:41",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, I know, yeah. I did read about this, yeah.",
    "speaker" : "Greg",
    "timestamp" : "42:41-42:44"
  },
  {
    "text" : "And so they decided that they really wanted Ricky Williams. So they were going to trade up to get him. And so they traded with the Washington Redskins. And um the Washington Redskins traded the fifth overall pick that uh the Saints would use to pick Ricky Williams. The Saints traded, and give me a minute here, the 12th overall pick, which was later traded to Chicago, where they selected K McNan. The 71st overall pick in this draft. The 107th overall pick, which is uh those are third and fourth round picks. Their fifth round pick, which 144th overall. their sixth round pick, which is 179 overall, and their seventh round pick, which is 218th overall. So literally all but their second round pick, which I don't even know if they had. And their 2000, the year after, first round pick, which ended up being second overall, and their third round pick Which ended up being 64th overall.",
    "timestamp" : "42:45-43:49",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:50-43:52",
    "speaker" : "Greg",
    "text" : "Who was the first round pick in that draft?"
  },
  {
    "speaker" : "Andy",
    "text" : "LeVar Arrington.",
    "timestamp" : "43:52-43:54"
  },
  {
    "text" : "See.",
    "timestamp" : "43:54-43:54",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Solid.",
    "timestamp" : "43:55-43:56"
  },
  {
    "text" : "Nice. He's a bum.",
    "timestamp" : "43:56-43:58",
    "speaker" : "Greg"
  },
  {
    "text" : "I'll give you the names of the people that were drafted that weren't Ricky Williams. Cade McNown, Dwayne Bates, Nate Stimson. Karee Samuel, Desmond Clark, Billy Miller, LeVar Arrington, Lloyd Harrison. Who won that trade?",
    "timestamp" : "43:58-44:18",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "44:24-44:28",
    "speaker" : "Greg",
    "text" : "And then they fired Dick a year later. They're like, bro, what are you doing?"
  },
  {
    "speaker" : "Andy",
    "text" : "You're not winning games. So And uh you may think that that's the best part of this, but actually the best part was the ESPN magazine. Cover? Oh yeah. So here's the quote from Wikipedia. After the trade, Dickett and Williams appeared on the cover of the August 9th, 1999 issue of ESPN the magazine, dressed as a bride and groom. Dick agreed to the photo shoot as long as he wasn't wearing the wedding dress.",
    "timestamp" : "44:28-44:59"
  },
  {
    "timestamp" : "45:01-45:05",
    "speaker" : "Steve",
    "text" : "Well you can't have a mustache on your bride."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:05-45:07",
    "text" : "Dude the the picture is phenomenal."
  },
  {
    "timestamp" : "45:08-45:35",
    "text" : "Dude, he's the thickest bride ever. With Yeah, I saw him interviewed about that too. He was so funny. He was like, oh, I had no idea it'd be a big deal. He's like, I just thought it'd be funny. And then they and they cut They do a cut to like all these fans like screaming at him like put the dress back on. Welcome to the NFL, Ricky.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "45:37-45:44",
    "text" : "And I uh speaking of his his really thick arms, um tying it back to this football game that we were supposed to be talking about.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:44-45:46",
    "speaker" : "Steve",
    "text" : "Oh no, I don't want to go back to the football game."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:46-45:58",
    "text" : "No, but this this one's good, I promise. Uh the commentators on Ricky Williams fumble blamed on the fact that he has a hard time tucking the football in because his arms are too muscular."
  },
  {
    "timestamp" : "45:58-46:00",
    "speaker" : "Greg",
    "text" : "It makes sense. That's why Shaq can't shoot free throws."
  },
  {
    "text" : "Yeah, he just couldn't tuck it hands well enough.",
    "speaker" : "Andy",
    "timestamp" : "46:01-46:03"
  },
  {
    "text" : "Yeah. That's why I don't work out better ball security. Yeah, me too. And free throw free free throw percentage. What is your free throw percentage? Dude, I'm a sick free throw shooter. It's fucking zero. Nah, dude. I consistently shoot in the eighties. Uh-huh. In my backyard. Yeah.",
    "timestamp" : "46:04-46:25",
    "speaker" : "Greg"
  },
  {
    "text" : "On your nerve hoop.",
    "speaker" : "Andy",
    "timestamp" : "46:26-46:27"
  },
  {
    "text" : "I've probably only ever taken like fifteen to twenty in real life.",
    "timestamp" : "46:27-46:31",
    "speaker" : "Greg"
  },
  {
    "text" : "I looked up the uh college football rushing leaders in a single season.",
    "speaker" : "Steve",
    "timestamp" : "46:33-46:38"
  },
  {
    "text" : "Oh yeah.",
    "timestamp" : "46:38-46:39",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "46:39-46:42",
    "text" : "You were wrong, Greg. Ron Dane is 17th.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, Wikipedia was wrong.",
    "timestamp" : "46:43-46:45"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "46:45-46:49",
    "text" : "Ricky Williams is single season or career? Single season."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, we're talking about career. Well no, the the uh Ricky Williams he set the the single season.",
    "timestamp" : "46:49-46:54"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "46:54-46:55",
    "text" : "Oh 50."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, all right.",
    "timestamp" : "46:55-46:55"
  },
  {
    "timestamp" : "46:56-47:01",
    "text" : "2100 yards. I think he has the most career though at the time.",
    "speaker" : "Andy"
  },
  {
    "text" : "Any w any guesses at number one and two?",
    "speaker" : "Steve",
    "timestamp" : "47:02-47:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, where is Ricky Williams? Is he third? Fifteenth?",
    "timestamp" : "47:04-47:09"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "47:09-47:09",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "47:10-47:10",
    "text" : "Oh god.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Um Barry Sanders is probably up there.",
    "timestamp" : "47:11-47:13"
  },
  {
    "timestamp" : "47:13-47:16",
    "text" : "That's what I was thinking, but he would have been before.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:16-47:20",
    "text" : "Nope. Barry Sanders number one still. 2628.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "47:21-47:22",
    "speaker" : "Andy",
    "text" : "All right."
  },
  {
    "text" : "26, 28, and 90, 1988.",
    "speaker" : "Steve",
    "timestamp" : "47:22-47:25"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:25-47:34",
    "text" : "I was gonna say, well, Barry Sanders came after. How did he set the record? I don't know. Failing us right now."
  },
  {
    "timestamp" : "47:35-47:38",
    "speaker" : "Greg",
    "text" : "Yeah, it was it was probably total, Andy. Must have been, yeah. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Number two is like 60 yards behind him, and he's an active player.",
    "timestamp" : "47:38-47:43"
  },
  {
    "text" : "He's an active player.",
    "timestamp" : "47:44-47:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:45-47:46",
    "speaker" : "Steve",
    "text" : "Yeah, he just got Peter."
  },
  {
    "text" : "Oh, Kareem Hunt.",
    "speaker" : "Andy",
    "timestamp" : "47:46-47:47"
  },
  {
    "text" : "Nope. New deal.",
    "speaker" : "Steve",
    "timestamp" : "47:48-47:49"
  },
  {
    "timestamp" : "47:49-47:50",
    "speaker" : "Andy",
    "text" : "Peterson."
  },
  {
    "text" : "Nope It's not someone you think of.",
    "speaker" : "Steve",
    "timestamp" : "47:50-47:54"
  },
  {
    "timestamp" : "47:55-47:57",
    "speaker" : "Greg",
    "text" : "Is it uh is it a power five?"
  },
  {
    "text" : "Yeah. Uh I don't know what power five is, but it's a big school.",
    "timestamp" : "47:58-48:01",
    "speaker" : "Steve"
  },
  {
    "text" : "James White.",
    "timestamp" : "48:02-48:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Nope. He didn't he literally assigned a new deal with a new team this year.",
    "timestamp" : "48:04-48:09"
  },
  {
    "timestamp" : "48:09-48:10",
    "speaker" : "Greg",
    "text" : "What was the school? School."
  },
  {
    "timestamp" : "48:11-48:12",
    "text" : "Wisconsin.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, the dude that just got drafted.",
    "timestamp" : "48:13-48:15"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "48:16-48:16",
    "text" : "Nope."
  },
  {
    "speaker" : "Andy",
    "text" : "No, he just signed a new deal with a new team.",
    "timestamp" : "48:17-48:19"
  },
  {
    "timestamp" : "48:19-48:22",
    "speaker" : "Steve",
    "text" : "He held out recently as well."
  },
  {
    "text" : "Oh, um. Oh, god damn it. The guy used to play for the Vikings? Nope. Oh fuck.",
    "speaker" : "Andy",
    "timestamp" : "48:22-48:32"
  },
  {
    "speaker" : "Steve",
    "text" : "Um I don't know.",
    "timestamp" : "48:32-48:34"
  },
  {
    "speaker" : "Andy",
    "text" : "Who is it?",
    "timestamp" : "48:34-48:35"
  },
  {
    "timestamp" : "48:35-48:42",
    "speaker" : "Steve",
    "text" : "Melvin Gordon. No shit. 2587 in 2014. Wow."
  },
  {
    "text" : "Wait, wasn't he on the same team as James White? That was Constantine? No. That might be. I guess he was. Yeah. I might be making that up. I don't know. I'm not a college football guy. I'll pay attention when they're on the pages. Reggie Bush.",
    "timestamp" : "48:42-49:00",
    "speaker" : "Andy"
  },
  {
    "text" : "Flandale White. All right. Some of my favorites.",
    "speaker" : "Greg",
    "timestamp" : "49:00-49:06"
  },
  {
    "timestamp" : "49:08-49:16",
    "speaker" : "Andy",
    "text" : "Okay. Um do we want to do do we have any other thing worth talking about in this game?"
  },
  {
    "text" : "This game was awful. I only took like 10 notes. I didn't watch it. We know.",
    "timestamp" : "49:16-49:22",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "49:26-49:35",
    "speaker" : "Andy",
    "text" : "Alright. Well how about you give me your best and worst? Uh can you give me a best? Can you give me your best?"
  },
  {
    "timestamp" : "49:36-50:05",
    "text" : "Okay. That that touchdown throw, you know, right, kind of towards the end of the second half. No, it's right at the beginning of the No they're both a patent. Yeah, but actually I think it was right at the beginning of the second half where they yeah, because they put the bags on the thing. Yeah, yeah. And they came out and they threw that nice, you know, patent was kind of a little OPI to get open, but they were hand fighting.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "50:05-50:06",
    "text" : "I think that was even.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "50:07-50:07",
    "speaker" : "Steve",
    "text" : "Whatever."
  },
  {
    "speaker" : "Andy",
    "text" : "It was a great route though. He got open.",
    "timestamp" : "50:08-50:11"
  },
  {
    "timestamp" : "50:11-50:12",
    "speaker" : "Steve",
    "text" : "Yeah, he was wide open."
  },
  {
    "timestamp" : "50:13-50:19",
    "speaker" : "Andy",
    "text" : "Yep. Yeah, that was a great that was a great touchdown. I think the other one was good too, just uh him going up and fighting for the ball. That was a nice touchdown."
  },
  {
    "timestamp" : "50:20-50:28",
    "speaker" : "Steve",
    "text" : "It was like The Zach Thomas laid an absolute lumber on Kevin Falk, which was the football part of me appreciated that."
  },
  {
    "speaker" : "Andy",
    "text" : "That's fair. All right. So do you have a singular worst?",
    "timestamp" : "50:28-50:32"
  },
  {
    "timestamp" : "50:33-50:49",
    "text" : "There was a triple cover interception by Brady in the second in the first half of the second quarter where he just like was like 10 yards. Like a just awful, awful, awful throw. Like what what do you think?",
    "speaker" : "Steve"
  },
  {
    "text" : "I thought his other interception was worse. Yeah, fourth quarter we got picked off at the Miami ten yard line.",
    "speaker" : "Andy",
    "timestamp" : "50:49-50:55"
  },
  {
    "timestamp" : "50:55-50:57",
    "text" : "They're like, I don't know who that one's to.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "51:01-51:04",
    "speaker" : "Greg",
    "text" : "Brady can't he can't throw the deep ball, right, Steve?"
  },
  {
    "timestamp" : "51:05-51:13",
    "text" : "That wasn't even a deep ball. It was only like 20 yards in the air. It was bad. It should have been like either 30 or 10 and he threw it 20.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Steve, is it your whole like language and the way you talk about Brady now, it's very disappointing to me. It's a noticeable change. I think Uh no, he deserved it in this game.",
    "timestamp" : "51:14-51:29"
  },
  {
    "timestamp" : "51:29-51:37",
    "text" : "I guarantee it'll be a good one. Disgusting. I will call it when I see it, you know? I'm always very uh dishonest.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "51:37-51:38",
    "text" : "I still love Tom Brady.",
    "speaker" : "Andy"
  },
  {
    "text" : "I hope he comes back. I still love him as well.",
    "speaker" : "Steve",
    "timestamp" : "51:38-51:40"
  },
  {
    "text" : "I hope he doesn't get to play this season because the season doesn't get played and then he comes back to the Patriots. I agree.",
    "timestamp" : "51:40-51:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "51:48-52:31",
    "text" : "Greg, do you have any a best and worst? Uh well I didn't watch the game. We know. Is that a best or a worst? Just look at my notes. Look at through my notes here. Here's a here's a good quote that I read about Ricky Williams. Said some people some people say drugs ruined Ricky Williams' career, which is not true. Drug testing ruined his career. Uh let's see, worst. So that Tyrrell Davis bonus. Those four things he had to hit? Yeah. He he didn't hit a single one. No. Ever? Nope."
  },
  {
    "timestamp" : "52:32-52:32",
    "text" : "No.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:32-53:00",
    "text" : "Oh well. I mean over so any so that was like a four year span, right? Yeah. There's only five players since like the eighties. Four players that have ever hit it over any four span four year span in their career. Rell Davis, obviously. Barry Sanders, Emmett Smith, and Marshall Falk. It's basically like, yeah, you gotta be a Hall of Famer, you don't make any money."
  },
  {
    "timestamp" : "53:01-53:08",
    "text" : "Yeah. Basically. Well, I mean he thought he would be, I guess. Yeah. Ran for two thousand yards. Fuck it, right? How can it be?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "53:08-53:12",
    "text" : "Yeah. He was also drafted by the Phillies. He's a two-sport athlete."
  },
  {
    "speaker" : "Andy",
    "text" : "No shit.",
    "timestamp" : "53:12-53:13"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "53:14-53:15",
    "text" : "Like all those dudes are."
  },
  {
    "timestamp" : "53:16-53:40",
    "text" : "Yeah, apparently Dan Marino was. I saw something today about Dan Marino being um He went like 14 and oh as a pitcher. And apparently his coach came to the mound to ask him. Uh, you know, like he was in a jam or something, the coach came to the mound. He's like, so what are we gonna do? He's like, well, you're gonna shut up and I'm gonna finish this sort of thing. Yeah. It Dan Reno's kind of an asshole apparently.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "53:40-53:47",
    "text" : "It's like me. I'm like a field general in the midfield in soccer and I shoot like 87% from the line.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I don't think it's like you at all.",
    "timestamp" : "53:48-53:50",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. I appreciate that, but no. You're right. I'm more of a three-sport athlete. Dare I ask what that third sport is? God dude, I'm sick of beer pong. I'll fucking take I'll take anybody at this party.",
    "speaker" : "Greg",
    "timestamp" : "53:50-54:08"
  },
  {
    "text" : "We have like one and two together.",
    "speaker" : "Steve",
    "timestamp" : "54:08-54:10"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh literally like beer pong moment, Greg. I know you have one. My favorite beer pong moment? Yeah. Guarantee you have that's a good question. Have your favorite foosball moment.",
    "timestamp" : "54:12-54:25"
  },
  {
    "speaker" : "Steve",
    "text" : "Alright, let's hear it. Back when I had our old remember our old table we used to have?",
    "timestamp" : "54:26-54:30"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "54:30-54:31"
  },
  {
    "speaker" : "Steve",
    "text" : "And I brought it with me to college, which was an amazing, amazing idea, by the way. Oh, I bet. Remember I fit that in Chewy. I took all the poles out and fit that fucker in in the minivan, drove it down. Good lord. And I was playing a ton, a ton. I was playing all the time. I got wicked good at it. And then Greg came to visit me at college, like maybe two years after I had it there. And we were playing in my in that house, Greg, and I let him go up like eight to two, and I beat him ten eight.",
    "timestamp" : "54:31-55:04"
  },
  {
    "timestamp" : "55:06-55:07",
    "text" : "Uh let him go up.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, it was like you had a couple cheapy goals, I wasn't really trying, I wasn't like in any of my moves yet, and then I like pulled it all out and I was like, yeah.",
    "timestamp" : "55:07-55:17",
    "speaker" : "Steve"
  },
  {
    "text" : "This is the most brotherish story.",
    "speaker" : "Greg",
    "timestamp" : "55:17-55:19"
  },
  {
    "timestamp" : "55:19-55:19",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "text" : "The fact that you're so good for two years and you beat me by two goals.",
    "timestamp" : "55:19-55:24",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but I wanted you to like you know, you think you're top of the water.",
    "timestamp" : "55:25-55:28"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:28-55:30",
    "text" : "You crushed your soul though. You crushed your hope."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "55:30-55:30"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:31-55:34",
    "text" : "It's worth it. I probably beat him the next game. Nope."
  },
  {
    "speaker" : "Andy",
    "text" : "What's your what's your best uh your best beer punk story?",
    "timestamp" : "55:35-55:38"
  },
  {
    "timestamp" : "55:38-56:22",
    "speaker" : "Greg",
    "text" : "I was just trying to think. I can't there's nothing that really comes to mind. Well well, I remember one story of you remember Stefan, Steve? Yeah. Uh like he was like super blacked out playing Pierpong and I remember him like falling asleep with his sitting down with his face on the table and someone like nudged him and he just like wakes up and just like instinctively throws it. And it was like the last cover and he got it in. And then just like passed out again immediately. It was like a corny fucking like nineties movie, you know. But uh for foosball, I had the hammer when I take it with my forwards and I pass it between them, tack, tak, tak, and then I fuck spam."
  },
  {
    "timestamp" : "56:23-56:23",
    "text" : "Oh yet.",
    "speaker" : "Steve"
  },
  {
    "text" : "The hammer. Gotcha again. Uh-huh. When you're a hammer, everything looks like a nail, Andy. This is Bang, bang, bang.",
    "timestamp" : "56:25-56:33",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "56:33-56:35",
    "text" : "This is why I took so much pleasure in beating him.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "56:36-56:36",
    "text" : "Yeah, exactly."
  },
  {
    "text" : "He was saying that exact same thing. The hammers have been around for ten years. He was saying the same thing when we were playing.",
    "speaker" : "Steve",
    "timestamp" : "56:37-56:42"
  },
  {
    "timestamp" : "56:42-56:44",
    "text" : "And I guarantee if you played him now, he'd still say it. Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And then I did that move, you know, where you instead of passing it in between your guys, you can just put it on like the guy's left foot and you just like do that whirl loop-de-loop with that same dude and get behind it and slam it in the corner.",
    "timestamp" : "56:45-56:55"
  },
  {
    "text" : "See, this is why you need a name for your moves, Steve, because no one knows what you're talking about. A loop the loop.",
    "timestamp" : "56:54-57:01",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I got it. Yeah, just named it.",
    "timestamp" : "57:01-57:03"
  },
  {
    "text" : "All right, well then you gotta start consistently calling it the loop de loop. I was called the Greg Beater. Well that's not even clever.",
    "timestamp" : "57:04-57:11",
    "speaker" : "Greg"
  },
  {
    "text" : "It's pretty good. Andy likes it. Alright, so my my best and worst. We we really have avoided this game almost completely.",
    "speaker" : "Andy",
    "timestamp" : "57:12-57:24"
  },
  {
    "text" : "That's how it should be.",
    "timestamp" : "57:24-57:25",
    "speaker" : "Greg"
  },
  {
    "text" : "It was a good reason I'm thinking it was a zero. If you came here expecting us like I don't know, you're a Dolphins fan, you came here expecting us to like actually talk about this game, you you're severely disappointed and For that I say good.",
    "timestamp" : "57:25-57:39",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, we what we talked about Ricky Williams, so that's it.",
    "timestamp" : "57:39-57:42"
  },
  {
    "speaker" : "Andy",
    "text" : "Well any Dolphins fan listening to this for like some sort of karmic whatever bullshit. Like they they got what they deserved.",
    "timestamp" : "57:42-57:48"
  },
  {
    "timestamp" : "57:48-57:55",
    "text" : "Yeah. I know, we got that great story about Father's Day, so I will not incredibly entertaining episode.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "57:55-58:14",
    "speaker" : "Andy",
    "text" : "My my best in this game. Came in garbage time like Steven's talking about. Um, but he picked a different story, so I'm gonna pick this one. They went on probably a good two, three, maybe five minute Um conversation about Teddy Bruski and how he plays the alto saxophone."
  },
  {
    "speaker" : "Greg",
    "text" : "Really? Yes.",
    "timestamp" : "58:14-58:15"
  },
  {
    "timestamp" : "58:16-58:33",
    "speaker" : "Andy",
    "text" : "Yes. So apparently he played it in high school and was on the um the varsity marching band, but then had to choose because he's also in varsity football and he couldn't do both at the same time. He had to choose football or Saxophone. And so he chose football, obviously, but still plays a saxophone."
  },
  {
    "speaker" : "Greg",
    "text" : "Why couldn't he just like run out there at halftime? Wouldn't that be sick in his uni? No, so you did watch the show with it because that's exactly what they said.",
    "timestamp" : "58:33-58:40"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:40-58:42",
    "text" : "Did he did he play it wearing his cleats?"
  },
  {
    "text" : "Yeah. See, I could do it announced. El Ellie used our sister used to do band and they used to like band camp. And she used to come back and be like, oh, bandcamp was so tough today, they made us march for like three hours. And I'd be like Eat shit, Kelly, okay? I'm a real athlete. Just came from fugging soccer practice. Yeah. Yeah, what is that?",
    "speaker" : "Greg",
    "timestamp" : "58:43-59:09"
  },
  {
    "speaker" : "Steve",
    "text" : "Kelly Kelly.",
    "timestamp" : "59:09-59:10"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "59:11-59:14",
    "text" : "Uh I guess it's just yeah. Second nature now."
  },
  {
    "text" : "Yeah. So my worst in this game.",
    "speaker" : "Andy",
    "timestamp" : "59:22-59:24"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm sure it was tough though. They had to wear the the big old getups and carry around tubes.",
    "timestamp" : "59:25-59:29"
  },
  {
    "timestamp" : "59:30-59:37",
    "speaker" : "Steve",
    "text" : "That description dad put in the uh Christmas letter about their march in the Macy's Day parade was ridiculous."
  },
  {
    "timestamp" : "59:38-59:38",
    "speaker" : "Andy",
    "text" : "What was it?"
  },
  {
    "timestamp" : "59:39-59:45",
    "speaker" : "Steve",
    "text" : "He called like a freezing death march while like cracking Addicted New Yorkers sneered at him and shit."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:46-59:48",
    "text" : "He has a way with words that one."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "59:48-59:49",
    "text" : "Oh, that's awesome."
  },
  {
    "timestamp" : "59:50-01:00:20",
    "speaker" : "Andy",
    "text" : "Um I found this stat interesting. It's not a best or a worst, but um Tom Brady had a 66% completion percentage, which was the second highest behind Kurt Warner since 1970, which I'm guessing at this point has probably been broken. Because that doesn't seem very high. That's kind of pretty I'm pretty sure Drew Brees' like career Completion percentage is like 70-something percent."
  },
  {
    "timestamp" : "01:00:20-01:00:24",
    "speaker" : "Greg",
    "text" : "We don't talk about True Breeze on this podcast, okay?"
  },
  {
    "speaker" : "Andy",
    "text" : "He apologized. He's uh he's he's turning a corner, it's okay. Um and then the other stat that I found out. Not gonna touch that one. Nope. We're moving on. The other stat that I found interesting was um they showed a list of Miami Dolphins most a hundred yard rushing games in a season.",
    "timestamp" : "01:00:24-01:00:42"
  },
  {
    "timestamp" : "01:00:42-01:00:45",
    "speaker" : "Greg",
    "text" : "And remember this is make a quiz out of it. The trivia."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:45-01:01:19",
    "text" : "This is week five, right? So um you won't get number one because I never even heard of him. Um Delvin Williams back in 1978. Right. So Ricky Williams would tie for second. That guy had five in 1978. Ricky Williams tied for second with three other people. Can you name any of them? Are they within the last 20 years? Um one is this two of these are kind of this sort of time frame. One was late nineties, one was two thousand, and the other one was nineteen seventy-two."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:01:19-01:01:21",
    "text" : "Uh Larry Zonka is the 72."
  },
  {
    "text" : "Correct. Um late nineties and early two thousands.",
    "speaker" : "Greg",
    "timestamp" : "01:01:22-01:01:28"
  },
  {
    "timestamp" : "01:01:29-01:01:53",
    "text" : "Dolphins running backs. Think of last season. I didn't watch that uh I did watch the other game, but think of he looked exactly like Antoine Smith as well. And I brought it up every time that he was on the screen. They even share the last name. No. They even share the last name.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01:58-01:01:59",
    "speaker" : "Steve",
    "text" : "I remember Dolphins running backs."
  },
  {
    "text" : "Lamar Smith back in two thousand.",
    "speaker" : "Andy",
    "timestamp" : "01:02:00-01:02:02"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:02:03-01:02:07",
    "text" : "Really? He's that old? I thought he was more recent than that. I thought he'd be out."
  },
  {
    "text" : "I don't think you'll get this one either. Karim Abdul Jabbar in 1996.",
    "timestamp" : "01:02:08-01:02:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:02:14-01:02:15",
    "text" : "Holy shit."
  },
  {
    "timestamp" : "01:02:15-01:02:35",
    "speaker" : "Andy",
    "text" : "That's a name for his name. So all those all those four players, including Ricky Williams, uh had four hundred yard rushing games in a season. Uh by the way, this is 2002, week five. Basically. He just run for his fourth hundred yard game."
  },
  {
    "speaker" : "Steve",
    "text" : "So he did four and five games.",
    "timestamp" : "01:02:35-01:02:37"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. It's a great year. This is his best year as a like eighteen hundred yards this year. It was crazy.",
    "timestamp" : "01:02:37-01:02:44"
  },
  {
    "timestamp" : "01:02:44-01:02:46",
    "speaker" : "Steve",
    "text" : "Do the Dolphins make the playoffs this year?"
  },
  {
    "timestamp" : "01:02:46-01:02:48",
    "speaker" : "Greg",
    "text" : "They do not. Nope."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:02:49-01:02:51",
    "text" : "Who from the AC East made it?"
  },
  {
    "timestamp" : "01:02:52-01:03:00",
    "text" : "The New York Football Jets. Mm-hmm. It was three-way tie for first. And then the Bills were 8-8 too.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, no this was like yeah, it was a real tiebreaker.",
    "timestamp" : "01:03:00-01:03:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:03:03-01:03:07",
    "text" : "That's where tie refers. Yeah, that's why I hate Brett Far. I hate Brett Fire because of the season."
  },
  {
    "timestamp" : "01:03:07-01:03:13",
    "speaker" : "Andy",
    "text" : "So we'll yeah, we'll we'll get to this whole thing because there was like it it was like multiple tiebreakers at the end."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:03:14-01:03:22",
    "text" : "My hatred of Brett this is like the defining moment of the season is if Brett Farrell would have been in the playoffs."
  },
  {
    "text" : "It's not this season. It's the season they had with Castle that he did that.",
    "timestamp" : "01:03:22-01:03:28",
    "speaker" : "Greg"
  },
  {
    "text" : "Really? Right Andy? I feel like he didn't brett fire forever though.",
    "speaker" : "Steve",
    "timestamp" : "01:03:28-01:03:34"
  },
  {
    "timestamp" : "01:03:34-01:03:44",
    "speaker" : "Andy",
    "text" : "I think Brett uh I don't think it was Brett Fire, but I think um Chad Pennington had something to do with both of the times at the Patriots Mist playoffs."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, the Brett Favre thing is when he at the end of his career, when he was on the Jets.",
    "timestamp" : "01:03:44-01:03:49"
  },
  {
    "timestamp" : "01:03:49-01:03:49",
    "text" : "Yes.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. And we needed him to beat like the Colts or something. And he couldn't do it.",
    "speaker" : "Greg",
    "timestamp" : "01:03:49-01:03:53"
  },
  {
    "timestamp" : "01:03:54-01:04:01",
    "speaker" : "Andy",
    "text" : "I believe it was. I believe it was actually the Dolphins with um Chad Pennington or something like that. Okay."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:04:01-01:04:02",
    "text" : "Yeah, that would make sense."
  },
  {
    "text" : "That doesn't really sound like me rooting for the Jets, even if that means we get in the playoffs.",
    "timestamp" : "01:04:02-01:04:06",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:04:06-01:04:09",
    "text" : "That's what it ended up being, I think. Oh.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And that wasn't great. I guess even desperate times call for desperate measures.",
    "timestamp" : "01:04:09-01:04:14"
  },
  {
    "text" : "I watched that game at your house, Andy. I don't know if I remember that. And there's something to do with a QB sneak that Favre couldn't get and we're all like, dog fucking asshole. That's",
    "timestamp" : "01:04:14-01:04:23",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "feels familiar. Yeah. Let me guess Ryan Sawyer was there. That fucking prick.",
    "timestamp" : "01:04:23-01:04:28"
  },
  {
    "speaker" : "Steve",
    "text" : "He deserved why do you hate Brent Favre? I think I never really dis I never really liked him, but then I hated him after that. I like that was like way early and I've always hated him.",
    "timestamp" : "01:04:31-01:04:43"
  },
  {
    "timestamp" : "01:04:46-01:05:14",
    "text" : "Wranglers. Real comfortable James. He's just a bunslinger back there. He just like to have fun. Yeah. Just playing backyard football. He he's one of the best to ever do it. Okay. If he actually imagine if he had like Brady's work ethic. Oh God. He would have been like the best quarterback that's ever lived. You could say that about a bunch of guys.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:05:14-01:05:17",
    "speaker" : "Mom",
    "text" : "Yeah, you could put that in the back of the ball. You could say that about Ryan fucking mallet."
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know. He Ryan Mallet had all the the physical tools. Ryan Leaf had all the physical tools. No, no, no.",
    "timestamp" : "01:05:17-01:05:24"
  },
  {
    "text" : "Approach the game like Tom Brady, maybe they would have been No approach like how hard they worked. This is exactly Brett Favre. No, Brett Far Brett Favre had way more natural skill than Ryan Mallet. He just didn't give a shit. He's like for like Hall of Fame quarterbacks, he gave the least amount of shit. about just like, you know, off season workouts, that kind of thing. Maybe Big Ben. I'd throw Big Ben in there.",
    "timestamp" : "01:05:24-01:05:50",
    "speaker" : "Greg"
  },
  {
    "text" : "I was gonna say there's gotta be somebody else. Big Ben's a good candidate.",
    "timestamp" : "01:05:50-01:05:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:57-01:06:06",
    "text" : "Dude, Bret Far showed up like 30 pounds overweight to his rookie season. Was that where he got traded from the Falcons?",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I'm pretty sure that was like a big part of it. Probably. Yeah. So uh speaking of Big Ben, did you see that um he is now unblocking people on Twitter? Yeah. Yeah. Um so we've preemptively from the Patriots Dynasty podcast blocked Ben Rothesberger.",
    "speaker" : "Andy",
    "timestamp" : "01:06:06-01:06:25"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, you should at first like just send him a picture of his own face. See see how he likes that. Because what is he gonna do? Blocky for saying it's offensive? No. It's your face, dude. Maybe I'll I'll unblock him. Unblock him. Send him a picture of the ugliest picture of his face that you can find.",
    "timestamp" : "01:06:28-01:06:46"
  },
  {
    "text" : "And then we may have to crowdsource this because I think there's a lot of ugly pictures of his face out there. I know. Yeah. Okay, next time we're going to do that. Or if we can get one where he's he shaved half his face.",
    "timestamp" : "01:06:46-01:06:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yes. And left the other half of a beard. I think that looks good. I think you'll see a lot of people doing that in the coming years. Just like the uh the other time I tried to start a trend with inside out t-shirts, that never took off. What? Yeah Okay. I was trying to piggyback the hipster thing of like, oh I don't need like to show my brand. So I just turn all my t-shirts inside out. And I was like, just you wait, guys, this is gonna catch on. Never did.",
    "timestamp" : "01:06:56-01:07:29"
  },
  {
    "timestamp" : "01:07:29-01:07:34",
    "text" : "I'm still hoping you try to bring back the ball cut again. No. Nope.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:07:35-01:07:37",
    "text" : "Steve, you may have to spearhead that one."
  },
  {
    "speaker" : "Andy",
    "text" : "I think you're all sleeping on the uh the the guy who was actually named um class trendsetter in high school. You were? What? No, you weren't.",
    "timestamp" : "01:07:40-01:07:52"
  },
  {
    "speaker" : "Greg",
    "text" : "I have the uh yearbook to prove it. Did they just give everybody an award or no?",
    "timestamp" : "01:07:53-01:07:58"
  },
  {
    "text" : "They did not, but this was the time where I was wearing that red spiky backpack in the hat. Oh my god. I think it was more out of fear that I was gonna be the Columbine kid more than you.",
    "timestamp" : "01:07:59-01:08:08",
    "speaker" : "Andy"
  },
  {
    "text" : "I think people liked you, Andy.",
    "timestamp" : "01:08:09-01:08:11",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know. More than you love.",
    "timestamp" : "01:08:11-01:08:13"
  },
  {
    "speaker" : "Greg",
    "text" : "All right, let me rephrase that. I don't know why. Exactly. That's a possible guy. Well, that's because you hate yourself.",
    "timestamp" : "01:08:13-01:08:19"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I did. I no longer do.",
    "timestamp" : "01:08:19-01:08:22"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm a beautiful, beautiful man. Hey, I love Andy. I love you spikes and all. I love you more than I love Steve. That's for sure.",
    "timestamp" : "01:08:23-01:08:31"
  },
  {
    "timestamp" : "01:08:32-01:08:44",
    "speaker" : "Andy",
    "text" : "Have I ever told you that um My wife almost stopped dating me when she first saw the backpack. Why? She had to call her best friend and say, Is it judgmental if I don't date him because of this?"
  },
  {
    "speaker" : "Greg",
    "text" : "I hope she didn't see the hat then that matched it.",
    "timestamp" : "01:08:44-01:08:47"
  },
  {
    "timestamp" : "01:08:47-01:08:49",
    "speaker" : "Andy",
    "text" : "No, she hadn't seen that yet."
  },
  {
    "speaker" : "Steve",
    "text" : "Backpack was sweet. Didn't you buy it in England?",
    "timestamp" : "01:08:50-01:08:52"
  },
  {
    "text" : "I believe I did, yeah. It was uh for those that don't know, it was like a red Um almost like a latexy rubber that had it was a just a regular backpack.",
    "timestamp" : "01:08:53-01:09:03",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:09:03-01:09:10",
    "text" : "And it's like a it was like a thermoform like shaping. Yeah, and it just had like three inch red",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "rubber spikes coming off of it. Yeah.",
    "timestamp" : "01:09:11-01:09:13"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:09:13-01:09:18",
    "text" : "Right. Think like uh the Ninja Turtles, I don't know, one of those bad guys had like a spiky shell back."
  },
  {
    "speaker" : "Andy",
    "text" : "That kind of idea, yeah.",
    "timestamp" : "01:09:19-01:09:20"
  },
  {
    "text" : "Yeah, that's what it looked like. And then you had a ski hat that was like Almost identical.",
    "timestamp" : "01:09:21-01:09:26",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, it's like the what the snowboarders used to wear at the time. And it had a black hat with red spikes on it. Yeah. Did you wear that in the metal bed?",
    "timestamp" : "01:09:26-01:09:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:09:34-01:09:37",
    "text" : "Andy? Were you like wearing this the ski hat while you were sitting in class?"
  },
  {
    "timestamp" : "01:09:38-01:09:41",
    "speaker" : "Andy",
    "text" : "I don't think I was allowed to. I'd take it off. I went in the into the classroom."
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, Liquid Fetus, the greatest rock band that ever was. That that never was, yeah.",
    "timestamp" : "01:09:41-01:09:48"
  },
  {
    "speaker" : "Andy",
    "text" : "Talking about I'm pretty sure we may have we may have promised Mike that we wouldn't mention liquid fetus, but cats out of the bag now.",
    "timestamp" : "01:09:48-01:09:54"
  },
  {
    "timestamp" : "01:09:55-01:10:13",
    "speaker" : "Greg",
    "text" : "Yeah, talk about trend setting, you know. Naming your bands after blended up babies And care to mention what the uh debut album was titled."
  },
  {
    "timestamp" : "01:10:14-01:10:20",
    "speaker" : "Andy",
    "text" : "What was it titled? I don't even remember. Oh, it's called In the Womb. In the Womb."
  },
  {
    "text" : "Yeah. Well what did you have like the the future albums titled out?",
    "timestamp" : "01:10:20-01:10:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:26-01:10:29",
    "text" : "No, that was just one of the names of the songs that we weren't gonna go into."
  },
  {
    "text" : "Oh dude, date second album Breaching the Canal.",
    "timestamp" : "01:10:29-01:10:32",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "If there was a second album we probably would have come to you for naming.",
    "timestamp" : "01:10:35-01:10:38"
  },
  {
    "text" : "Third album is in the blender. Yeah.",
    "timestamp" : "01:10:40-01:10:43",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:10:43-01:10:53",
    "speaker" : "Andy",
    "text" : "Oh my gosh. Umbilical separation. Uh no, by the third album we're all acoustic anyway, so it wouldn't it wouldn't have worked."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:10:54-01:10:54"
  },
  {
    "timestamp" : "01:10:54-01:11:10",
    "speaker" : "Andy",
    "text" : "Yeah. Speaking of bad football, my worst in this game, bringing it all back, was uh the pages tried their beloved direct snap to Kevin Falk. And it didn't fucking work."
  },
  {
    "timestamp" : "01:11:10-01:11:19",
    "speaker" : "Greg",
    "text" : "It didn't work. Oh, that's a you know it's a bad game. Yeah. Yeah. When that that play the staple per me to triangle, dude. It's felling, yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Wasn't that right before he threw the worst pick maybe he's ever thrown to? I think it could have been, yeah.",
    "timestamp" : "01:11:20-01:11:25"
  },
  {
    "text" : "Uh I thought I wrote down. Is this Dave Wanstead? It is, yeah. Who actually did a decent job against Patriots? Patriots are only five and four against him. Against his coach.",
    "speaker" : "Andy",
    "timestamp" : "01:11:28-01:11:41"
  },
  {
    "text" : "Once a year in Miami.",
    "speaker" : "Steve",
    "timestamp" : "01:11:42-01:11:43"
  },
  {
    "timestamp" : "01:11:46-01:11:49",
    "text" : "I actually average as another.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:49-01:11:54",
    "text" : "Yeah. Yeah, he's a Cautable?"
  },
  {
    "text" : "I don't know. But I remember seeing him and thinking, oh, that was all right, because usually those guys are all jackasses, you know. Yeah, yeah, yeah.",
    "timestamp" : "01:11:56-01:12:02",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:12:02-01:12:06",
    "speaker" : "Steve",
    "text" : "That's true. Halftime show old coaches are the worst."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:12:07-01:12:10",
    "text" : "The worst, dude. How have they not figured that out?"
  },
  {
    "timestamp" : "01:12:10-01:12:17",
    "text" : "I don't know. Everyone hates them, you know? You don't even need anybody. Just show me like just binge me highlights from the rest of the game.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. I mean like think about what happened to like Monday Night Football where they rotate through people because they just get murdered online. Why are we not doing the same for halftime?",
    "timestamp" : "01:12:17-01:12:26",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:12:25-01:12:26",
    "speaker" : "Steve",
    "text" : "Yes."
  },
  {
    "text" : "Those guys are e even worse than Booger.",
    "timestamp" : "01:12:27-01:12:29",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:12:30-01:12:33",
    "text" : "Maybe they have like ironclad contracts or something. I don't get it.",
    "speaker" : "Steve"
  },
  {
    "text" : "Maybe. I don't know. They should put us up there.",
    "timestamp" : "01:12:33-01:12:37",
    "speaker" : "Greg"
  },
  {
    "text" : "They should put them on the Ricky Williams contract. Here's a big signing bonus. If you don't hit these incentives, fuck out.",
    "timestamp" : "01:12:37-01:12:42",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:12:42-01:12:44",
    "text" : "Yeah, now you're talking.",
    "speaker" : "Greg"
  },
  {
    "text" : "Gotta make the Brown brothers laugh.",
    "speaker" : "Steve",
    "timestamp" : "01:12:46-01:12:48"
  },
  {
    "timestamp" : "01:12:48-01:12:55",
    "text" : "Ooh, they should start with 17 people and then let the fans vote off one each time. Oh. Each week.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "That would be an absolute shit show.",
    "timestamp" : "01:12:55-01:12:57"
  },
  {
    "text" : "Wouldn't it be awesome? Like think of ideas like that. People would people would watch for that, right? So",
    "timestamp" : "01:12:57-01:13:04",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:13:04-01:13:51",
    "speaker" : "Andy",
    "text" : "I still think what they should do is what uh the Premier League did for a while in uh English soccer, where they would have a v a very small booth. And in it like 'cause i in England they had like a multitude of channels that was showing the same game. If it was like a a prime time game. And so you could switch each one, like one had like no commentary, and one had the regular commentary, and one would just like follow a certain player around the field for a certain amount of time and switch players. But one of them, every once in a while, was they would get a fan of each team and have them commentate the game together. And that was electric. Couple of dafkunts. Yeah. I imagine even just like do it with baseball."
  },
  {
    "speaker" : "Greg",
    "text" : "I know, but like I think failing uh part of the appeal is British people are just so funny. It's true, but I I guarantee you could you could find some funny Yeah, it's true. Yeah.",
    "timestamp" : "01:13:51-01:14:02"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:14:02-01:14:04",
    "text" : "US I volunteer us to do it."
  },
  {
    "speaker" : "Greg",
    "text" : "I think I have done that. Although uh you know how like uh Amazon Prime got some games last year? Oh yeah yeah they would they would have like six different announcers On the online stream, dude. I watched an entire Patriots game in Spanish. It was fucking awesome. Didn't know what they were saying, but I was loving it. Didn't matter. Yeah.",
    "timestamp" : "01:14:05-01:14:26"
  },
  {
    "speaker" : "Andy",
    "text" : "I've heard it in German too. Yeah. I've seen some streams in German and that's actually been really good.",
    "timestamp" : "01:14:26-01:14:31"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, because you could like pick out random words, so you kinda know what they're talking about.",
    "timestamp" : "01:14:31-01:14:35"
  },
  {
    "timestamp" : "01:14:36-01:14:37",
    "speaker" : "Andy",
    "text" : "Yeah, you can get the gist."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:14:37-01:14:37",
    "speaker" : "Greg"
  },
  {
    "text" : "They're very excitable.",
    "timestamp" : "01:14:38-01:14:39",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, yeah. And you can see when they're getting excited. You can like hear it in their voices. It's fucking great.",
    "timestamp" : "01:14:39-01:14:43",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:14:44-01:14:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:14:44-01:14:44",
    "text" : "It's awesome.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:14:45-01:14:50",
    "speaker" : "Andy",
    "text" : "I used to uh when I was playing like FIFA and stuff, I used to put the uh the commentary on Spanish."
  },
  {
    "timestamp" : "01:14:50-01:14:51",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "text" : "or a different language. Just see if I would learn a different language. Spoiler alert.",
    "speaker" : "Andy",
    "timestamp" : "01:14:51-01:14:57"
  },
  {
    "timestamp" : "01:14:57-01:15:21",
    "text" : "Did it work? No. Uh Buenos Tardes. Me shut. What were you talking about? I interrupted you there. I don't think I was talking about anything.",
    "speaker" : "Greg"
  },
  {
    "text" : "No.",
    "speaker" : "Steve",
    "timestamp" : "01:15:26-01:15:26"
  },
  {
    "text" : "I was just gonna say that uh the the Patriots games when they played once that team, the average score was 17 to 17, which seems pretty fucking even to me. Yeah. The fact they were five and four against them.",
    "speaker" : "Andy",
    "timestamp" : "01:15:27-01:15:39"
  },
  {
    "speaker" : "Greg",
    "text" : "So so if if you had to pick out one factor that's causing the Patriots to play so poorly in Miami, what do you think it is?",
    "timestamp" : "01:15:39-01:15:48"
  },
  {
    "speaker" : "Steve",
    "text" : "I see it's the early season. They always suck in the early season plus. It's the heat.",
    "timestamp" : "01:15:49-01:15:53"
  },
  {
    "timestamp" : "01:15:53-01:15:59",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, that's true because yeah, they always seem to like slowly ramp up the first four weeks. So if they play them in the first four weeks, that's not"
  },
  {
    "speaker" : "Steve",
    "text" : "I'd love to see that first like I guess like the Patriots record in Miami by month or by temperature, you know? So I bet. I think it's already like that home field dissipates. I mean, at least in the Brady era. Clearly.",
    "timestamp" : "01:16:02-01:16:14"
  },
  {
    "text" : "You know where you can find that, Steve Brown?",
    "timestamp" : "01:16:15-01:16:17",
    "speaker" : "Andy"
  },
  {
    "text" : "Um that stats over storylines podcast. I bet they have it.",
    "speaker" : "Steve",
    "timestamp" : "01:16:19-01:16:23"
  },
  {
    "timestamp" : "01:16:25-01:16:29",
    "speaker" : "Andy",
    "text" : "No, it's actually uh gofuckyourself stevebrown. com"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:16:29-01:16:29",
    "text" : "Ooh."
  },
  {
    "text" : "See if that exists right now.",
    "speaker" : "Steve",
    "timestamp" : "01:16:30-01:16:31"
  },
  {
    "speaker" : "Greg",
    "text" : "Hend over and tuckyoursack. com. Wasn't that your wedding website, Greg?",
    "timestamp" : "01:16:32-01:16:37"
  },
  {
    "text" : "The Patriots in Miami. Neither of those still makes it. September and October are five and four. So that blows your thing out of the water. So still not great.",
    "timestamp" : "01:16:44-01:16:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I want to hear mine.",
    "timestamp" : "01:16:57-01:16:57"
  },
  {
    "timestamp" : "01:16:58-01:17:02",
    "speaker" : "Andy",
    "text" : "When are they in December? Still a winning record. Uh hang on. Just December?"
  },
  {
    "timestamp" : "01:17:02-01:17:04",
    "speaker" : "Steve",
    "text" : "Or November, December."
  },
  {
    "text" : "In December they are there's seven games. Anybody want to guess their uh their records?",
    "timestamp" : "01:17:04-01:17:12",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:17:12-01:17:13",
    "speaker" : "Steve",
    "text" : "Seven and all."
  },
  {
    "speaker" : "Andy",
    "text" : "No. Five and four. One and six in December in Miami. No.",
    "timestamp" : "01:17:14-01:17:21"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:17:21-01:17:22",
    "text" : "The Pats are?"
  },
  {
    "text" : "The Patriots are. Since I'm not sure.",
    "timestamp" : "01:17:22-01:17:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I guess it's not the Heat then there, is it Steve?",
    "timestamp" : "01:17:24-01:17:26"
  },
  {
    "timestamp" : "01:17:29-01:17:30",
    "text" : "I mean I can see.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. I think I I usually don't buy into these things with professionals, but I think it's like a mental like confidence type thing. Yeah. Right? You there's certain like I think going into games thinking you can win is like big towards beating the Patriots, right? You saw it with the Ravens. They they would always come in and you'd be like, play them tough because you you got the feeling that they knew they could win those games. Whereas other teams would just be like Like the Bills. They just roll over and let the pats rub their tummy, you know? And I think once you get a couple strung together where now it's a thing the media's talking about and all the players hear that shit and they're like, you know what? We can win this game. We always we always win this game. I think the Doesn't matter what we've done the rest of the season, this is a game we always end up winning. Yeah, and you can second if you want in the media, but you un Deep down somewhere, I think it affects their play of like maybe they're not as aggressive, maybe the play calling is slightly different, but I think that plays a factor.",
    "speaker" : "Greg",
    "timestamp" : "01:17:32-01:18:35"
  },
  {
    "speaker" : "Steve",
    "text" : "That's a good point, Greg, because if you think about the three worst games we've watched up to this point, is the two games in Miami and it's the one game in Denver.",
    "timestamp" : "01:18:36-01:18:44"
  },
  {
    "timestamp" : "01:18:45-01:18:46",
    "text" : "Yeah. True.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:18:46-01:18:53",
    "speaker" : "Steve",
    "text" : "By far. Those three have been standout bad. The other ones have been at least closer. All that."
  },
  {
    "timestamp" : "01:18:53-01:19:02",
    "speaker" : "Greg",
    "text" : "Mm-hmm. I just cracked the code, Bermuda Triangle. It's not real, it's in your head."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh and on that note, should we look forward to next weekend? Or next weekend. Next weekend. Oh, I was gonna say. Okay, who we got? Sunday, October thirteenth, two thousand two. This is at home, eventually, after two weeks on the road versus the Green Bay Packers. Steve Brown's favorite quarterback coming to town. Really?",
    "timestamp" : "01:19:04-01:19:29"
  },
  {
    "text" : "This is correct. Let's be clear, he's not my least favorite quarterback.",
    "timestamp" : "01:19:29-01:19:33",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:19:33-01:19:51",
    "speaker" : "Greg",
    "text" : "This is in Green Bay? No, it's at home. Wow, I have no recollection of this game. I don't either. I might actually watch this one. Okay. No, you won't. Wranglers. Real comfortable jeans."
  },
  {
    "text" : "Tune in next week. Find out if Greg actually watched the game or not.",
    "speaker" : "Steve",
    "timestamp" : "01:19:53-01:19:56"
  },
  {
    "text" : "What else dude? I had other homework. What was I gonna do?",
    "timestamp" : "01:19:58-01:20:01",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:20:02-01:20:08",
    "speaker" : "Andy",
    "text" : "Uh something about the Dolphins win record at home, I think."
  },
  {
    "text" : "Oh yes. Yep. I'll report on that. Okay. I hope so. I can't wait. Alright, I can't either, Andy. I'm also very excited.",
    "speaker" : "Greg",
    "timestamp" : "01:20:08-01:20:19"
  },
  {
    "text" : "Yeah, no, I I look forward to that with beta breath. I I'm sure you will come through and you will actually do the research and the homework and watch this football game all in a week. I have faith in you.",
    "timestamp" : "01:20:19-01:20:33",
    "speaker" : "Andy"
  },
  {
    "text" : "Can't tell if you're fucking with me. That's the idea. I could I could hear you smiling when you said that. I could hear your smile.",
    "timestamp" : "01:20:34-01:20:46",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I I don't know what you're talking about.",
    "timestamp" : "01:20:46-01:20:48"
  },
  {
    "speaker" : "Greg",
    "text" : "It's more like a smile. Yeah. I know that I know that fucking sound when I hear it. All right.",
    "timestamp" : "01:20:49-01:20:56"
  },
  {
    "timestamp" : "01:20:57-01:21:01",
    "speaker" : "Steve",
    "text" : "I love you boys. Elaiter."
  }
]