[
  {
    "timestamp" : "00:00-00:18",
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother."
  },
  {
    "timestamp" : "00:24-00:34",
    "speaker" : "Andy",
    "text" : "Welcome back everybody to the Patriots Dynasty Podcast. I'd like to extend a especially warm welcome to my brother Stephen, who decided to join us this week."
  },
  {
    "speaker" : "Steve",
    "text" : "And 'cause he decided to fuck off to vacation somewhere. Where what do you think Greg does on vacation? A fat shitload of nothing. He hates doing nothing though. Does he? He's probably sitting there right now being like, you know shit, I should have gone on the podcast. I should have brought my mic on vacation with me.",
    "timestamp" : "00:34-00:55"
  },
  {
    "text" : "But he did bring it because he's still up north. And last week we recorded the episode, yeah, when when he and I were together. So he has it.",
    "speaker" : "Andy",
    "timestamp" : "00:55-01:04"
  },
  {
    "speaker" : "Steve",
    "text" : "That sounds about right for Greg, taking like five weeks off.",
    "timestamp" : "01:05-01:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, exactly. Including from the podcast. Yep. So um speaking of of taking time off, this week is no, not the bye week. That didn't really work. Oh. I was trying to figure out how to integrate that. I don't know. Speaking of being on vacation, I think um Dante Culpepper wish he was. How's that?",
    "timestamp" : "01:09-01:31"
  },
  {
    "text" : "Not your no, not your best.",
    "timestamp" : "01:33-01:35",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Apparently I'm still on vacation too. How about that? But yeah, so this is uh as I've alluded to badly a few times, the Vikings coming to town 2002 week 12. Week Tom Brady Um I feel like we never play the Vikings.",
    "timestamp" : "01:35-01:53"
  },
  {
    "speaker" : "Steve",
    "text" : "This is one of the teams that you just don't see.",
    "timestamp" : "01:53-01:56"
  },
  {
    "text" : "It's yeah, it's true. I I was thinking that when I was watching, like how many games could there possibly be against the Vikings? I can think of one. Which one? No, not in this. I think this was before the Tom Brady era the one I'm thinking of. Where the Vikings had the best run defense and the Patriots came out slinging it. I don't know. So I got nothing. Let's see. Um Minnesota Vikings.",
    "speaker" : "Andy",
    "timestamp" : "01:56-02:22"
  },
  {
    "timestamp" : "02:22-02:25",
    "text" : "Let's go to the PatriotsDynasty. info.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:25-02:51",
    "speaker" : "Andy",
    "text" : "Patriots slash slurch search slash games. Patriots have played the Vikings six times. What? Including two thousand, so the year before we started doing this. They played them. And then this year in 02, and then you know every four years, so that makes sense, oh six, oh ten oh ten, two thousand ten, twenty fourteen, twenty eighteen. Oh, I remember 2018."
  },
  {
    "text" : "Not this past season, the season before. Yeah, I don't remember this at all. I mean none of the games have been close.",
    "timestamp" : "02:51-02:55",
    "speaker" : "Steve"
  },
  {
    "text" : "You remember Kirk Cousins?",
    "speaker" : "Andy",
    "timestamp" : "02:56-02:57"
  },
  {
    "timestamp" : "02:57-03:00",
    "text" : "Nope. I mean I remember when he's on the Redskins.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, no, I remember I I don't remember the game because the Patriots unleash their um there's so many names for it, like the Amoeba defense. Where nobody lines up like with their hand down on the ground. And everyone's just kind of milling around so the and the offense can't figure out who's rushing. And they did that against Kirk Cousins and he had no answer for it. Because that was the year I think Adam Phielen was like leading the league in touchdown receptions and he had like one catch in that game or something ridiculous. You know, typical Patriots game.",
    "timestamp" : "03:00-03:29"
  },
  {
    "timestamp" : "03:30-03:36",
    "speaker" : "Steve",
    "text" : "Like I'm not debating that they played it. I just don't remember this at all. I don't remember any other Vikings game. I don't even remember this one."
  },
  {
    "timestamp" : "03:36-03:40",
    "text" : "No, I I I don't remember this one at all. And there's big names in this too.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "03:40-03:42",
    "text" : "What was what's your Lombardi score?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:43-03:57",
    "speaker" : "Andy",
    "text" : "Yeah, three maybe. Yeah, I'm on a three. Two and three quarters I don't even know if it's quite a three because the first half is great. First half is where the Patriots scored all their points and the second half is where the Vikings tried to do a comeback."
  },
  {
    "timestamp" : "03:57-04:00",
    "speaker" : "Steve",
    "text" : "I mean their first three drives. Where do they scored them all?"
  },
  {
    "text" : "But yeah, I mean if if you watch yeah, uh the like the second quarter mainly. That was exciting. But uh Yeah, uh let's uh talk about the score. They scored did end Patriots 24 Vikings 17. The Patriots win this one, improved to six and five. And the Vikings would drop to I think it was three and eight on the season? Yeah. Which for a team Let's talk about these Vikings. There were some big names on this team for them to be three and eight.",
    "timestamp" : "04:00-04:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I only got one big name, Randy Moss. Uh Michael Bennett. I don't remember this guy at all. I had no idea who this dude was. Really? I remember him because he was uh They said he was leading the league in rushing at this point. And I don't I was like who? The Seattle Seahawks guy? Oh right, yeah.",
    "timestamp" : "04:32-04:51"
  },
  {
    "timestamp" : "04:51-04:52",
    "speaker" : "Andy",
    "text" : "I didn't even put that together, Jesus."
  },
  {
    "timestamp" : "04:53-05:01",
    "speaker" : "Steve",
    "text" : "That was my first thought. I was like, is he like related to the Bennett brothers? It can't be. I don't know. No."
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know either. I'm gonna say no. Unless their parents were were that sick and twisted that they named two of their sons Michael. Oh and the other one not Michael. So yeah, I don't think it was. But I mean Dante Culpepper and Rainian Moss, that connection alone is in like every late 90s, early 2000s highlight reel video you ever see, right? Uh-huh. Like Randy Moss catching deep bombs from Dante Culpepper.",
    "timestamp" : "05:02-05:31"
  },
  {
    "timestamp" : "05:32-05:33",
    "text" : "Sure, sure.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "05:33-05:53",
    "text" : "Because I mean this Vikings team Was this the same one that basically in uh not 2001, one of these years? 2000, no, ninety-nine, ninety-eight. All right, well that's a little further away. They went fifteen and one. And then lost in the playoffs to I think Michael Vick Falcon. You're thinking of the Packers.",
    "speaker" : "Andy"
  },
  {
    "text" : "This is before Michael Vick. We just saw Mike Vick last week or last year. Make his debut.",
    "speaker" : "Steve",
    "timestamp" : "05:53-05:58"
  },
  {
    "text" : "Oh, that's true. Yeah. So who was oh it was the Dirty Bird Packers uh uh Falcons, that's who it was. Oh yeah, Tramal Williams. Yeah, but uh this team was I think was that is 1998 was yeah that was Randy Moss's rookie year and he had he just went off 1300 yards, 17 touchdowns. Fucking ridiculous.",
    "timestamp" : "05:59-06:19",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "06:20-06:29",
    "text" : "Randy Moss would need like the other side. When you catch the ball, you know, your your butthole would pucker up. Oh my god, yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "06:29-06:36",
    "text" : "He was one of those guys that it was like yeah, like watching Barry Sanders or or someone like that. Or Michael Vick.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, I would I had just watched the hockey and the basketball right before this game, so it's like when you're clinging to a one goal lead, you know, and they're passing it around your your offensive on in their offensive zone, you're just like holding on. That's what it was like when Randy Moss was catching the ball and running in the open field.",
    "timestamp" : "06:35-06:51"
  },
  {
    "text" : "Yeah, exactly. But uh as good as this team was on paper I mean the the Vikings had the Randy Moss went to the Pro Bowl, as did Michael Banner, the running back. Uh Culpepper threw for almost 4,000 yards, 18 touchdowns. 23 interceptions. Michael Bennett ran for almost 1300 yards and five touchdowns And Randy Moss had 1300 yards receiving and seven touchdowns, which like on paper, that sounds really good.",
    "speaker" : "Andy",
    "timestamp" : "06:51-07:25"
  },
  {
    "text" : "Those are some solid stats, yeah.",
    "speaker" : "Steve",
    "timestamp" : "07:26-07:28"
  },
  {
    "timestamp" : "07:28-07:41",
    "text" : "I think though the reason that they were had such good stats in a three and eight was because they couldn't stop turning the ball over. Feels like the modern day Jets, you know?",
    "speaker" : "Andy"
  },
  {
    "text" : "Or the you know, Brett Favre led Packers.",
    "speaker" : "Steve",
    "timestamp" : "07:41-07:45"
  },
  {
    "text" : "Yeah, exactly. He's making the Pro Bowl throwing more interceptions and touchdowns. Because he sucks. But um yes.",
    "speaker" : "Andy",
    "timestamp" : "07:46-07:52"
  },
  {
    "timestamp" : "07:53-08:00",
    "speaker" : "Steve",
    "text" : "Well they mentioned Brett Favre and the Packers a couple times in this game. I guess the Vikings had just beat Brett Favre."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, the week before.",
    "timestamp" : "08:00-08:01"
  },
  {
    "speaker" : "Steve",
    "text" : "Did you look up that game? I didn't. Did you? I just did look it up like how Brett Favre did. I think he threw like three interceptions in that game.",
    "timestamp" : "08:02-08:11"
  },
  {
    "speaker" : "Andy",
    "text" : "That's not great. In Minnesota. And from what they were talking about, it sounded like Uh the Packers couldn't stop Randy Moss, and the Vikings defensive line gave Brett Farb a ton of trouble. Which yeah, through three interceptions isn't telling me how many times he was sacked. Probably a lot. Oh no, only two for ten.",
    "timestamp" : "08:12-08:42"
  },
  {
    "timestamp" : "08:43-08:50",
    "speaker" : "Steve",
    "text" : "And then they were talking up the Tampa Bay game the next week, or it was like right after this game."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:50-09:09",
    "text" : "It was the Tampa Bay Brett and uh Yeah, because this game was on Fox, so obviously Fox was big into the The NFC. And it was the the whoever won that game would have the best record in the NFL. So it was Warren Sapp and the Buccaneers against Brett Favre and the Packers."
  },
  {
    "text" : "Any guesses on how many interceptions he threw in that game? Three. Four.",
    "timestamp" : "09:09-09:14",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "09:16-09:17",
    "text" : "Did they lose?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "09:17-09:18",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "21-7. I actually wrote down that this game feels like a prolonged ad for the Packers Bucks game. Yeah, they were never every break.",
    "timestamp" : "09:18-09:28"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "09:29-09:32",
    "text" : "Wild, wild west 30-second video."
  },
  {
    "timestamp" : "09:32-10:53",
    "text" : "Yeah, and then at the end they had another one that was like because the commentators weren't the A team either. It was Kenny Albert and Tim Green. And the only reason I recognize the name Tim Green is because that was a childhood friend of mine. Oh yes. Yeah, Timmy Green. But they weren't Good. But they also weren't worth my time to write down anything they said. Except for when they were going into because they you they did. They had like a couple like 30 seconds Promos, I guess, for the coming game and it sounded like 'cause at the end they were talking about who made them and they were giving them all this credit And I thought, ugh, I don't think I'd want that credited if I had made those. Um But the first one was like a Western one. The second was like a supposed to be like an old school monster movie And it was just like clips of both teams, but set to like old school horror movie um music. And I think the commentators were supposed to like talk over it, but they didn't. And so it was just unbelievably awkward. Because like and cause you could tell that like they were supposed to lead into it because Tim Green was like, the game coming up next reminds me of a monster movie. And then they like cut into the clip, and then he just sat there and didn't say anything.",
    "speaker" : "Andy"
  },
  {
    "text" : "Is that where they like circled and Lauren Sapp is like, oh he's scary right at the end.",
    "timestamp" : "10:54-10:58",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah. Doing his like he was yelling because he just got a sack of bread farms and yeah. Like, oh look at that, that's a monster face.",
    "timestamp" : "10:58-11:05"
  },
  {
    "text" : "I had some other things I wanted to talk about the commentators.",
    "speaker" : "Steve",
    "timestamp" : "11:05-11:09"
  },
  {
    "text" : "Alright, yeah, let's get into it. I like this. I'm rubbing off on you.",
    "timestamp" : "11:09-11:12",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "11:13-11:22",
    "text" : "Well, I don't know if this is them. I think this is more of the media as a whole. But it's like I wrote down there's a lot of talk about Glovegate going on."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "11:22-11:23",
    "text" : "Oh my god."
  },
  {
    "text" : "Because there I guess at this time people were dissecting Tom Brady's performance with and without gloves.",
    "speaker" : "Steve",
    "timestamp" : "11:23-11:28"
  },
  {
    "text" : "Yeah, so I was actually gonna look that up in the globe and then I thought, you know what? I've been driving more this week than I have normally, and So I've had I tried to get back into sports talk radio and I couldn't do it. So I'm like I can't I can't do that to myself for my mental health. So I didn't go back and do but you're absolutely right. They talked a ton. about Brady's gloves. Because last week against the Raiders they were talking about it, about how he was wearing them on his throwing hand and He started the game without wearing and then he put it on in the second half and he played better and he had it on this game and he started off really good and",
    "timestamp" : "11:28-12:08",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I just like that I don't even think that was ever a thing though, you know? I've never thought about Tom Brady's performance with and without gloves. I've certainly talked about it in weather, you know?",
    "timestamp" : "12:09-12:19"
  },
  {
    "text" : "Yeah. And you know who else?",
    "speaker" : "Andy",
    "timestamp" : "12:19-12:20"
  },
  {
    "timestamp" : "12:20-12:22",
    "speaker" : "Steve",
    "text" : "How do that that shit just has died out."
  },
  {
    "speaker" : "Andy",
    "text" : "You know who else hasn't talked about it? Everybody. Like it because they were like, oh, but Tom Brady says it it doesn't matter. But maybe it does, because he just threw a touchdown. Like no It doesn't matter. I'm gonna tell you right now. Knowing what's coming, it it it doesn't matter",
    "timestamp" : "12:22-12:43"
  },
  {
    "speaker" : "Steve",
    "text" : "They also insinuated that Richard Seymour faked an injury to get a timeout when he didn't play another snap in the game, which was fucked up.",
    "timestamp" : "12:44-12:53"
  },
  {
    "timestamp" : "12:53-12:55",
    "speaker" : "Andy",
    "text" : "Oh, that's right. He didn't, he didn't come back."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, because the Vikings are all about no huddle in the second half and he got hurt. And then they're like, oh, you know, sometimes when you see that. is faking it.",
    "timestamp" : "12:55-13:03"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And it was also the other guy who was down was um Lori Malloy who like legit left the game in the And the first half w like due to injury and he got lit up on that play too. 'Cause uh he had an Antoine Harris sighting, which was awesome",
    "timestamp" : "13:04-13:19"
  },
  {
    "speaker" : "Steve",
    "text" : "Shout out to Twan. Yep.",
    "timestamp" : "13:20-13:22"
  },
  {
    "text" : "Antoine Harris.",
    "speaker" : "Andy",
    "timestamp" : "13:22-13:22"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "13:23-13:30",
    "text" : "Proud of Raleigh North Carolina. They actually had it on there from Raleigh. Oh did they? Yeah. So they had his little bio up when we got subbed in."
  },
  {
    "text" : "But speaking of Richard Seymour, I wanted to bring this up. Because we I don't think we touched on it last week, but he one of the few highlights from the week before was that he he blocked a field goal. And they did it again this week. And this is like no gimmicks, nothing. Cassius Marshall, whatever the fuck his name was, jumping over the the center to get the block. That was Jamie Collins, but yeah. Oh Jamie Collins did it too. I I think Cash the Meyer. He may have someone like that. Yeah, until they outlawed that. Um but yeah no this was just like him getting stuck in there getting his massive frame straight up and putting a paw in the and I'm pretty sure there's more than these two. I can remember a few. So I'm wondering, has there ever been someone better at blocking field goals?",
    "timestamp" : "13:31-14:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:23-14:42",
    "speaker" : "Steve",
    "text" : "There's gotta be Is all-time field goal block leader? There's it's gotta be a stat. Oh, Hakeem Alojowan with 3,830 blocks. I'm gonna say that doesn't quite work. To be fair, Gary Anderson did like barely kicked it above the line, no."
  },
  {
    "text" : "Yeah, oh yeah, this is this was fucking Gary Anderson. Probably towards the end of his career, I have to think. Right?",
    "speaker" : "Andy",
    "timestamp" : "14:43-14:52"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I mean I don't know. He looked like he was playing in the nineteen fifties with that single bar face mask way low.",
    "timestamp" : "14:53-14:58"
  },
  {
    "text" : "Yes, you can see like half his forehead. Yeah, oh yeah, just yeah, just the one. At that point's like, dude, just just take it off. Like you don't need a face mask. It's not gonna do anything. It's probably gonna be more harm than good. Yeah, he would only play till two thousand four. You want to guess when he started kicking field goals?",
    "speaker" : "Andy",
    "timestamp" : "14:59-15:16"
  },
  {
    "speaker" : "Steve",
    "text" : "Seventy-four.",
    "timestamp" : "15:17-15:18"
  },
  {
    "text" : "Jesus, no. It's not a hundred. Uh the year before I was born, nineteen eighty-two. Jeez. So we played 13 years since we kick her.",
    "timestamp" : "15:18-15:28",
    "speaker" : "Andy"
  },
  {
    "text" : "And also I just looked it up. Ted Hendricks. Uh 10 punt blocks and 14 kick blocks. Holy shit. Yes. In nineteen seventy-four he had seven combined blocks. That's insane.",
    "timestamp" : "15:28-15:44",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Good lord. For where when did he play? Do you does it tell you what years? Was this back in like the fifties?",
    "timestamp" : "15:45-15:52"
  },
  {
    "text" : "I mean it's 74, so probably, you know.",
    "speaker" : "Steve",
    "timestamp" : "15:52-15:55"
  },
  {
    "timestamp" : "15:56-16:16",
    "speaker" : "Andy",
    "text" : "Right, you're not going to be able to do that. Oh, by the way, um Gary Anderson played for twenty-three years, not thirteen. It was thirteen with with the Steelers before he moved on. Alright, well I guess it's not. Not Richard Seymour. Well, I guess blocking kicks was easier for the yeah."
  },
  {
    "text" : "Julius Peppers. Really? That's 12 field goals on a PAT.",
    "speaker" : "Steve",
    "timestamp" : "16:16-16:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Damn, I didn't know. I mean that makes sense.",
    "timestamp" : "16:20-16:21"
  },
  {
    "timestamp" : "16:21-16:23",
    "speaker" : "Steve",
    "text" : "Truly Peppers is massive."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:23-17:13",
    "text" : "Still, I wouldn't have expected other teams to like put those caliber guys on Special teams like you do with like Bow Speaking of turnovers though, how about this Minnesota Vikings team? Fumble City So they came into like this is this is just like a great team to watch, I think. Um they came into the game having the top ranked rushing offense, which for the two thousand two pages defense Should be a bad thing. Yeah. I mean they've had other teams run for two hundred yards with not the top. Uh they had the third uh ranked offense overall. But they also had the 31st ranked defense. Not good. They were also the most penalized team in the league, averaging nine penalties a game. Uh I don't think they quite got that high in this game, did they?"
  },
  {
    "text" : "They were on a good pace, but they they cropped it.",
    "speaker" : "Steve",
    "timestamp" : "17:13-17:16"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:17-17:58",
    "text" : "Uh they had eight penalties for 74 yards. So about right. Almost average. Um they also were the worst team in the NFL in turnover differential. Coming into the game, it was minus 16. In twelve in eleven games. That's pretty bad. Maybe ten games, depending on yeah, because they were they were three and seven. So yeah, in ten games, they had a minus sixteen. So they were almost minus two every game. In this one they were worse than that. They had four fumbles of which they lost three."
  },
  {
    "text" : "And a block field goal.",
    "timestamp" : "17:58-17:59",
    "speaker" : "Steve"
  },
  {
    "text" : "And a block field goal. Which so I mean they had three not",
    "timestamp" : "18:00-18:04",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:06-18:10",
    "speaker" : "Steve",
    "text" : "Three three fumbles and the not two fumbles in the field goal block before like mid-second quarter."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, by the end of the first half. Um So basically the way the game went is the Vikings would drive straight down the field and then fuck something up. So the f the they got the ball to start first to drive straight down the field. uh get inside the New England 10-yard line and then Dante Culpeper pulls what I would generously say is a Drew Bledsoe. And they're trying to do a screen and it gets blown up. So he just backpedals straight backwards for 14 yards and then throws it out of bounds, but because he's still in the tackle box, it's intentional grounding. Oh yeah. Because he doesn't throw it towards anybody. So that backed him out of uh it turned into like a long field goal. Yeah, it's either ten yards or Really? Yeah, or where it was from, whichever is further back. Which is crazy. Um but then so that that field would go blocked because it's now like a f like 46 or 48 yard or something like that instead of what would have been a chip shot. So the Pacers get the ball back, drive straight down, Brady throws a touch on the four, eh. And then Minnesota punts it. New England gets the ball back And drive all the way again, another four A touchdown from Brady. And then Culpepper gets the ball, misses Randy Moss deep like really badly. Oh yeah. Misses him by like ten yards. Which I think is hard to do with Rainy Moss. Just by the fact that he's really good.",
    "timestamp" : "18:10-19:45"
  },
  {
    "timestamp" : "19:45-19:46",
    "speaker" : "Steve",
    "text" : "That's what you're supposed to do with Rainy Moss."
  },
  {
    "timestamp" : "19:47-20:01",
    "text" : "Yeah, just throw with the biggest. Exactly. Um And so it's third and long because Minnesota actually started the drive off false starting twice. Yeah. Um and In a row.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "20:01-20:02",
    "speaker" : "Steve",
    "text" : "In a row."
  },
  {
    "text" : "Yeah. Which they would do again later in the game. Towards the end of the draft. And then uh Culpepper tries to To almost I don't think it was supposed to be a QB draw, but he was he was doing a lot of running in this game. So he dropped back in the middle of the field to open up, so he tried to take off, but he dropped the ball where he got it knocked out of his hand. Pages recover. Uh turnaround, Brady throws his third touchdown. We're we're basically like 10 minutes into the we're like five minutes into the the second quarter at this point. Patricia throws another touchdown to Troy Brown this time. So now it's 21-0",
    "timestamp" : "20:02-20:36",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And uh Mike Tice is over there booking love boats, he's like getting me out of here.",
    "timestamp" : "20:37-20:42"
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly. Was he part of that I don't know. I think he wasn't he the coach of the team? When was the love boat?",
    "timestamp" : "20:43-20:49"
  },
  {
    "timestamp" : "20:49-20:56",
    "speaker" : "Steve",
    "text" : "I don't remember. I don't e honestly, I don't even know what the love boat is. I just know that if I can say and they get all pissed off."
  },
  {
    "text" : "Steven. That was Fred Smoot. Oh two thousand five. I don't think uh I don't think your boy Oh no he was.",
    "timestamp" : "20:56-21:05",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:06-21:09",
    "speaker" : "Steve",
    "text" : "I I'd always associated Mike Tyson Mahead with Love Boat."
  },
  {
    "timestamp" : "21:10-21:24",
    "speaker" : "Andy",
    "text" : "Yeah. Um and this actually, according to Wikipedia, um which led to the firing of head coach Mike Tice, who was replaced by Brad Sheldress. Who would lead the team to the 2009 NFC Championship game?"
  },
  {
    "text" : "I don't get it though. What did they do?",
    "speaker" : "Steve",
    "timestamp" : "21:24-21:25"
  },
  {
    "speaker" : "Andy",
    "text" : "They just went on a boat and got like in October in 2005. What happened is so this is October, right? So middle of the season. Right, September, October 2005. An alleged sex party occurred on Lake Minnetonka with seventeen key members of the Minnesota Vikings football team. They couldn't do it on Lake Titicaca. Including, and I will list these, Dante Culpepper. All-time name player Fred Smoot. Moelle De Moore, probably also on that list. Pat Williams, Bryant McKinney, Nate Burleson, Ralph Brown, Jermaine Wiggins.",
    "timestamp" : "21:25-21:59"
  },
  {
    "speaker" : "Steve",
    "text" : "No shit, our boy.",
    "timestamp" : "22:00-22:01"
  },
  {
    "timestamp" : "22:01-22:14",
    "text" : "What? Oh, we're gonna have to we're gonna have to come back to that, I think, at some point. Um Troy Williamson, Travis Taylor, Kevin Williams, Lance Johnson, Mo Williams, and Willie Offord. We see Mo Williams in this game.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:14-22:19",
    "speaker" : "Steve",
    "text" : "This is also Brian McKinney's like first start. It's definitely his rookie year."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because I I had some notes on him too. We'll get to him. And Mo Williams, I think, was the leading rusher this year too. At least with touchdown. Yeah, he uh he was the uh the touchdown back. He was the guy that you hated if you were in Famous. Which probably wasn't even a thing yet. So here's what happened. Two houseboats were rented and some, but not all, of the players performed sexual acts in front of crew members. Prostitutes from Atlanta and Florida were flown in for the party in order to perform the sex acts. There were at least ninety people on the two boats. Ninety people on two boats. And Smoot later estimated that there were a hundred women present. An anonymous former player of the Minnesota Vikings claimed that this is not the first time such an incident has happened. The scandal has sometimes been referred to as a love boat scandal after the television programme or as the smoot boat scandal in the news. Allegedly, photographs were taken at the party showing people engaging in sexual intercourse. Four of the players were charged with misdemeanors related to the events. Later commentators pointed to the scandal as a key event in the history of the team, which led to the firing of head coach Mike Tice. Whoops.",
    "timestamp" : "22:19-23:23"
  },
  {
    "text" : "In a June 2013, Reddit Asking Anything first thread. Fred Smoot did one about the Love Belt. And he's talking about Brian McKinney. Placing a naked woman on the bar performed conolingas on her in front of the career guests. He he referred to this act as running through the orca patch.",
    "timestamp" : "23:24-23:44",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "23:44-24:11",
    "speaker" : "Andy",
    "text" : "The okra patch. Oh my goodness. Smoot was the alleged ringleader of the entire operation. He is said to have been the one who hired the boats for the cruise. Smoot, however, has not denied that he was on the boat that night. Smoot allegedly held a double-headed dildo and inserted it into the vaginas of two women who were laying on the floor in the lounge area. After one woman left, he continued to quote unquote manipulate the dildo."
  },
  {
    "speaker" : "Steve",
    "text" : "Inside the other woman in front of the crew I need to read that Fred Snoot AMA.",
    "timestamp" : "24:11-24:18"
  },
  {
    "timestamp" : "24:19-24:21",
    "speaker" : "Andy",
    "text" : "Yeah, I think we can find it."
  },
  {
    "timestamp" : "24:21-24:23",
    "text" : "Oh yeah, it's right there. Quick Google.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "24:23-24:23",
    "text" : "Yeah, it is.",
    "speaker" : "Andy"
  },
  {
    "text" : "Alright, we'll have to link this in the Was the Love Boat worth it? That's the first one. Man, everybody asked me something about that damn boat. No shit, buddy.",
    "timestamp" : "24:23-24:35",
    "speaker" : "Steve"
  },
  {
    "text" : "I don't know if I'd say it was worth it, but I wouldn't change anything in my past. Oh man, this this guy is uh but Jermaine Wiggins, Wiggy was in there.",
    "timestamp" : "24:39-24:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "24:50-24:53",
    "text" : "I did not I didn't I didn't even know he played for the Vikings."
  },
  {
    "timestamp" : "24:54-25:00",
    "text" : "Yeah. I think uh I think he left the the Patriots this this current season. Like after after two thousand four.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:00-25:02",
    "text" : "Yeah. Should have stuck around when it comes off more reins.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Instead he ended up on the uh love boat, the smoot boat.",
    "timestamp" : "25:03-25:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:07-25:16",
    "speaker" : "Steve",
    "text" : "The smoot boat. Smoot, smoot, all aboard. Go on to the the orca patch later."
  },
  {
    "text" : "The okra patch, not the orca. Whatever. Whole different meaning.",
    "speaker" : "Andy",
    "timestamp" : "25:17-25:22"
  },
  {
    "text" : "Some sort of like squid or something, right?",
    "timestamp" : "25:23-25:25",
    "speaker" : "Steve"
  },
  {
    "text" : "Okra? No, okra's like a vegetable.",
    "timestamp" : "25:25-25:28",
    "speaker" : "Andy"
  },
  {
    "text" : "Well not to Google that. Uh I don't get it. Does look like a pussy at all.",
    "timestamp" : "25:30-25:35",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, how are you running through an okra patch? I don't I don't follow. Maybe we should ask your man Wiggins.",
    "speaker" : "Andy",
    "timestamp" : "25:37-25:44"
  },
  {
    "text" : "Yeah, at least probably smart enough not to come on.",
    "timestamp" : "25:47-25:50",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "25:51-26:34",
    "speaker" : "Andy",
    "text" : "So speaking of uh Michael Bennett, if we go back to the game, it's his turn to fuck up. We're still in the second quarter. And at this point, Minnesota realizes they have to abandon their game plan. So they're in the no-huddle, which apparently is one of the reasons they were able to beat Green Bay the week before. Run on the no huddle and it actually worked pretty well in this game. They started running it four drives into the second quarter because they're already down three touchdowns. Drive straight down the field into like the New England red zone yet again. This time uh Michael Bennett's the one that fumbles. New England recovers And these were all like really nonchalant fumbles too."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah.",
    "timestamp" : "26:34-26:34"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:35-27:41",
    "text" : "Like I I didn't catch them in real time until the Patriots players were like piling on the ground, pointing in their direction. Yeah. So then um Patriots don't do anything. Vikings get the ball back. And this time it is Randy Moss's turn to get into the action where he fumbles. New England recovers. And that was almost the end of the the half. Three three turnovers in that one one quarter. Patriots couldn't capitalize again, even though they were pretty good field position. They go three and out and they're in like that area of the field where Belichick just likes to go for it anyway, regardless of what it is because it's too far for a field goal not worth punting. Uh but Brady gets sacked on fourth down, so that didn't work the way they expected. And then right at the end, and this is like with like two minutes left. So Minnesota gets the ball back, I think under two minutes, and they drive straight down the field again. This time they actually score a touchdown pass. Culpepper. So we go into halftime at 21-7. So if you're gonna watch the game, you could just stop it there."
  },
  {
    "speaker" : "Steve",
    "text" : "Probably yeah.",
    "timestamp" : "27:41-27:42"
  },
  {
    "speaker" : "Andy",
    "text" : "That's like second half was two. Yeah. Yeah, Culpepper throws another touchdown and then the team's straight field goal.",
    "timestamp" : "27:42-27:52"
  },
  {
    "speaker" : "Steve",
    "text" : "Sorry, I was really busy reading the Fred Smoot AMA. Nothing really juicy in there. I didn't even see the scandalous comment.",
    "timestamp" : "27:52-28:00"
  },
  {
    "timestamp" : "28:00-28:05",
    "speaker" : "Andy",
    "text" : "No, it was right at the top. It was in that first comment though."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:05-28:13",
    "text" : "Right on that same like when the Patriots kinda got sacked on to end that drive or at the very end of the s first half."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "28:13-28:13",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Do you see Chris Hovan talking shit to Brady? Yeah. Down twenty-one nothing.",
    "timestamp" : "28:13-28:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Bro. And apparently he had gotten fined the week before for Talking about breath five after a sec. Like bro, read the room. I uh you're you're fucking three and seven. You're committing the most penalties in in the NFL. You're losing the turnover battle. Uh they had they came in the game with 30 turnovers. And so I wrote, now they have 31 turnovers worse than the NFL. And they had to cross that out and had put 32 turnovers and they had to cross that out and put 33. So they had 33 turnovers. I vaguely remember him.",
    "timestamp" : "28:21-28:55"
  },
  {
    "text" : "I don't really. Wait two thousand to two thousand nine.",
    "speaker" : "Steve",
    "timestamp" : "28:55-28:58"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:59-29:00",
    "text" : "He looked very familiar, yeah."
  },
  {
    "timestamp" : "29:01-29:07",
    "speaker" : "Steve",
    "text" : "He maybe I'm just confusing him with Bill Romanowski. He's like a poor man's Roman house."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah, yeah, yeah. Yeah, because he was quality. But this guy although he did they did say he played at uh Local college BC, yeah, with Damian Woody. He not quite played on the end and Woody was a center, but apparently they used to go at it in practice back in college. Um",
    "timestamp" : "29:08-29:25"
  },
  {
    "text" : "There was one comment too about um the commentators made and I don't know if you picked up on With them being wrong again, Andy. God. Oh yeah. Well, they're wrong about those fucking things. They were talking about Troy Brown. What? They were wrong about Cloy Brown? Yeah, of course. Fuck. They're like, oh what a great dude he is. He's like, oh looks like he's preparing for life after football. He wants to be a broadcaster, which They were not wrong about. They said he's he's never gonna coach. He says the he considered coaching, but there's too many long hours. Which whoops. Whoops.",
    "speaker" : "Steve",
    "timestamp" : "29:26-30:06"
  },
  {
    "speaker" : "Andy",
    "text" : "Looks like he changed his mind on that one, huh? Mm-hmm.",
    "timestamp" : "30:07-30:09"
  },
  {
    "timestamp" : "30:11-30:13",
    "speaker" : "Steve",
    "text" : "Can't stay away, baby."
  },
  {
    "timestamp" : "30:13-30:15",
    "speaker" : "Andy",
    "text" : "Happens to the best of us."
  },
  {
    "speaker" : "Steve",
    "text" : "So do you have uh any There was a um Adrian Clem sighting.",
    "timestamp" : "30:14-30:19"
  },
  {
    "text" : "Oh yeah, because the right time Clem with two M's. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "30:19-30:23"
  },
  {
    "timestamp" : "30:24-30:32",
    "text" : "He he turned out to be pretty good, right? I don't think so. I thought he did. I thought he started on Super Bowls and stuff.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "No. I don't I don't think he was kind of like middle of the round.",
    "timestamp" : "30:32-30:36"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "30:36-30:38",
    "text" : "Better than Kenyatta Jones?"
  },
  {
    "text" : "Clemson five years with the Patriots appearing in twenty six games with ten starts.",
    "speaker" : "Andy",
    "timestamp" : "30:39-30:42"
  },
  {
    "text" : "Maybe I disliked him 'cause he has a great last name.",
    "timestamp" : "30:42-30:46",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. There's a bakery in uh is that Wyndham, New Hampshire. It's named after him. Yeah, we'll say it is. Fuck it. Maybe it is. Or maybe he's named after the bakery. Who knows?",
    "timestamp" : "30:46-30:58"
  },
  {
    "timestamp" : "30:59-31:10",
    "text" : "He was born in Englewood, California, so probably not. You know you don't know that. That's true. I don't know. I don't think people wouldn't would name their bakery after a black guy.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "31:13-31:17",
    "speaker" : "Andy",
    "text" : "You're not wrong. It's it's very conservative. Yes."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:20-31:38",
    "text" : "But yeah, that's I don't know. That's about it. I did have a note here. It took me forever, like way longer than you'd think, to realize the Vikings helmets were horns. I realize this now. Okay, so you're not saying you realize it today? No, but within the last couple years."
  },
  {
    "timestamp" : "31:38-31:39",
    "text" : "Wait really?",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "31:40-31:40",
    "speaker" : "Steve"
  },
  {
    "text" : "What did you think they were?",
    "speaker" : "Andy",
    "timestamp" : "31:40-31:42"
  },
  {
    "text" : "I had no idea that they're just like Nike swooshes.",
    "timestamp" : "31:42-31:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh Steve.",
    "timestamp" : "31:46-31:47"
  },
  {
    "text" : "I didn't quite get it. I was I just thought they were kind of dumb helmets, but now that I realize their horns, I think they're a lot cooler.",
    "speaker" : "Steve",
    "timestamp" : "31:47-31:53"
  },
  {
    "text" : "Oh man, so I I might be about to blow your mind. But you know the swirls on the Rams helmet?",
    "speaker" : "Andy",
    "timestamp" : "31:55-32:01"
  },
  {
    "text" : "Those are horns. I got that. Maybe not when we were watching the Super Bowls, but By the time the second Ram Super Bowl came around, I'd figured that out.",
    "timestamp" : "32:02-32:11",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh that's good. So you're you're uh I guess you're learning? I don't know if learning's the right thing.",
    "timestamp" : "32:11-32:19"
  },
  {
    "text" : "Realizing.",
    "timestamp" : "32:19-32:20",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "32:21-32:27",
    "text" : "Yeah. Do you uh what are the odds that Greg knows this? Hmm.",
    "speaker" : "Andy"
  },
  {
    "text" : "He wouldn't know it, but he would shit on me pretending that I he already knew it and calling me a fucking idiot for not knowing it. And in his back of his mind he'd be like, damn, those are horns? That makes so much sense.",
    "speaker" : "Steve",
    "timestamp" : "32:27-32:40"
  },
  {
    "text" : "Speaking of stupid headwear, I think when we get Greg back on we need to find out an update on his um his hat that he bought.",
    "speaker" : "Andy",
    "timestamp" : "32:42-32:51"
  },
  {
    "timestamp" : "32:51-33:11",
    "speaker" : "Steve",
    "text" : "Yes. Yeah, the chicken wing hat. I'm trying to get my friends to place a bet on the chicken wing hat. What kind of loser has to loser has to buy a pair of Zubaz or the chicken wing hat. They're debating the merits of Singletary versus Zach Moss in for fantasy this year, so"
  },
  {
    "timestamp" : "33:12-33:14",
    "speaker" : "Andy",
    "text" : "One on that one side."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I know, right? Well there'll be a couple games and then So then what happens to fantasy?",
    "timestamp" : "33:15-33:20"
  },
  {
    "text" : "Do you whoever has got the most points wins?",
    "timestamp" : "33:20-33:23",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:23-33:30",
    "speaker" : "Steve",
    "text" : "Probably. I haven't really thought about it at all. No, me neither. Which is crazy 'cause it starts in like three weeks."
  },
  {
    "speaker" : "Andy",
    "text" : "Supposed to, yeah. At least when when we're recording this on the twentieth of August. But we'll see how that goes.",
    "timestamp" : "33:30-33:39"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm in full on playoff Bruins and Celtics mode right now. All right. Which is a weird time to be late August.",
    "timestamp" : "33:39-33:47"
  },
  {
    "text" : "It sure is. It's just a weird time for all of it. I know. This is a it's a very strange. I don't want to.",
    "timestamp" : "33:48-33:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "You know what'll make this year better though? What's that? If Troy Brown finds out who we are.",
    "timestamp" : "33:53-33:59"
  },
  {
    "text" : "I thought you were gonna say if Greg shows up next week with his fucking hat on.",
    "speaker" : "Andy",
    "timestamp" : "34:00-34:03"
  },
  {
    "text" : "That'll only be a marginal thing. I want to really move the needle here.",
    "speaker" : "Steve",
    "timestamp" : "34:04-34:08"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm with you.",
    "timestamp" : "34:09-34:09"
  },
  {
    "timestamp" : "34:09-34:14",
    "text" : "I am with you. Have we like pressured Tanya to reach out to him on our behalf yet? I mean come on, we need to get some.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "34:14-34:18",
    "speaker" : "Andy",
    "text" : "Not yet, but I think we probably should. We'll have to uh lay the groundwork for that."
  },
  {
    "text" : "We need we need to get some we need to call in some favors, we need to do whatever we can.",
    "speaker" : "Steve",
    "timestamp" : "34:18-34:22"
  },
  {
    "timestamp" : "34:22-34:27",
    "text" : "Yeah. Cause I mean life isn't complete without Troy Brown in it in it.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I know we've talked a lot about doing a Browns on Browns on Browns. Mm-hmm. We should just do a browns on browns on brown and spend the whole thing talking about Troy Brown. That's how we get noticed.",
    "timestamp" : "34:28-34:39"
  },
  {
    "timestamp" : "34:39-34:44",
    "text" : "You know, we would actually probably get more content out of that. I mean what if we talked about the Cleveland Browns?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "34:45-34:51",
    "text" : "Well, Greg's thing was the Browns on Browns on Browns on Browns while taking a shit."
  },
  {
    "text" : "Doing on the toilet, right?",
    "timestamp" : "34:51-34:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Yeah, talking about Jim Brown, and I guess that's probably the only other Brown that's ever played for the No, I looked it up.",
    "timestamp" : "34:52-34:58"
  },
  {
    "text" : "There was like seven or eight of 'em. Really? Jim Brown's the only real famous one, yeah. Yeah, I don't think we'd have a lot to talk about with them compared to talking about.",
    "speaker" : "Andy",
    "timestamp" : "34:58-35:06"
  },
  {
    "timestamp" : "35:07-35:17",
    "text" : "That's just not advancing my cause here. We'll tell t we'll tell Tanya, we'll do a special episode with Troy, the Browns on Brown.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "35:17-35:26",
    "speaker" : "Andy",
    "text" : "Yep. Brown's on a brown. Yeah. Do you think you want to talk about himself though?"
  },
  {
    "speaker" : "Steve",
    "text" : "But I do. So well maybe wait whoa whoa whoa whoa. I'm on to something here. What if we do browns on browns on browns on browns? And get Troy Brown on to talk about Jim Brown. I bet he'd great he'd love to talk about this.",
    "timestamp" : "35:27-35:39"
  },
  {
    "speaker" : "Andy",
    "text" : "Get Troy Brown on to talk about us talking about Jim Brown while we're all taking a shit. I don't know how many browns on browns that is.",
    "timestamp" : "35:40-35:46"
  },
  {
    "text" : "It's brown on browns on browns. Browns.",
    "timestamp" : "35:47-35:49",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "35:50-35:51",
    "speaker" : "Andy",
    "text" : "On browns. Browns. On browns."
  },
  {
    "timestamp" : "35:51-35:53",
    "speaker" : "Steve",
    "text" : "On brown. Yeah."
  },
  {
    "text" : "And then if we all wear brown, it could be in brown at the end.",
    "speaker" : "Andy",
    "timestamp" : "35:55-35:58"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "35:58-35:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Brown on browns on browns on browns on brown in brown.",
    "timestamp" : "35:59-36:02"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't think I own any brown though.",
    "timestamp" : "36:02-36:04"
  },
  {
    "timestamp" : "36:04-36:28",
    "text" : "Yeah, I khakis maybe? I don't know if I just want to. Boom. Khaki. Uh trust you to take it. So uh now that we don't have Greg here, I thought it would be a good opportunity to actually talk about some more football instead of Well, I guess we've already covered the poop topic, which is usually where he goes.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:29-36:29",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "And I don't have any drug stories, so I was reading. This week because I didn't have access to a television. Um wait, you didn't have access to a TV? Uh at the beginning of the week, yeah. Why not? I was up in Northern. What is that like a third world country? Second world country, yeah. Like they have toilets but they don't flush, you know what I mean? It's like England. It's a second world country. According to our father.",
    "timestamp" : "36:30-36:55"
  },
  {
    "text" : "That's your words too.",
    "timestamp" : "36:56-36:58",
    "speaker" : "Steve"
  },
  {
    "text" : "Yes, that's true.",
    "speaker" : "Andy",
    "timestamp" : "36:58-36:59"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "36:59-37:01",
    "text" : "Laundry in the kitchen, what are they doing?"
  },
  {
    "text" : "Fridge is the size of a Kegerator.",
    "speaker" : "Andy",
    "timestamp" : "37:02-37:04"
  },
  {
    "timestamp" : "37:07-37:09",
    "speaker" : "Steve",
    "text" : "It doesn't even go to my nipples. How am I gonna fit my thirty rack in there?"
  },
  {
    "timestamp" : "37:10-37:16",
    "speaker" : "Andy",
    "text" : "That's what I'm saying. They don't even have thirty racks. Or pickup trucks. What are they doing? What a fucking country."
  },
  {
    "text" : "So we can just throw all of Europe in there.",
    "timestamp" : "37:16-37:18",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:18-37:51",
    "text" : "Probably. They drink their beer warm and Their coffee's garbage. Yeah, so let's say I was in England this week, right? Okay. So they didn't have they didn't have real television. Right. So I was reading um I bought a book. War Room by Michael Hawley, who is probably my favorite Boston sports guy, because he's like the only one that succeeded in the industry without being a hot take artist, which I am very impressed. He's a thoughtful dude, doesn't rely on the hot takes and all that stuff."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:51-37:55",
    "text" : "I like Mike Reese, but he's not really like a an opinion guy."
  },
  {
    "timestamp" : "37:55-38:43",
    "speaker" : "Andy",
    "text" : "Right, exactly. And Michael Hawley is, but he's like measured opinion. So it's actually he's like the voice of reason in all these talk shows. I like him for that. Um but he wrote this book, it's about the legacy of Bill Belichick and the Art of Building the Perfect Team, written in 2011, I believe it was. So you could probably rewrite this a whole second time with basically the same stuff. But it's cool because it's like behind the scenes about how Bill Belichick like builds a team and runs a team. So I actually just got to the part about, and by just got to you on like 10 40 pages in. Um talking about the pages. One their 2001 Super Bowl, and now they're going to 2002. And I found some interesting tidbits that I don't think I would have found if we hadn't been doing this. So I thought I'd this would be a good time to share them. All right."
  },
  {
    "speaker" : "Steve",
    "text" : "But the first thing was Before you before you go on to this, can can I just say I can't believe you're outing yourself like this.",
    "timestamp" : "38:43-38:49"
  },
  {
    "speaker" : "Andy",
    "text" : "What, as a reader? Yeah, fucking a loser. Everyone knows readings are fucking losers, Andy.",
    "timestamp" : "38:49-38:56"
  },
  {
    "timestamp" : "38:57-39:06",
    "speaker" : "Steve",
    "text" : "God You know what? Oh mom would be very proud of you. Oh, Andy reads all the time, Steve. You can read. Yeah, but I'm not a fucking loser, Mom."
  },
  {
    "text" : "If you don't know by this point, after the website and the podcast and just listening to me talk for a season and a half that I'm a fucking nerd, that's on you, not me.",
    "timestamp" : "39:07-39:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, I know.",
    "timestamp" : "39:17-39:18"
  },
  {
    "timestamp" : "39:19-39:30",
    "speaker" : "Andy",
    "text" : "I'm not talking about you. Fucking mom knows too, Andy. Oh yeah, she's already known though. That's why I'm the golden child."
  },
  {
    "speaker" : "Steve",
    "text" : "Alright, lay it on. I mean, what did this stupid book say?",
    "timestamp" : "39:32-39:34"
  },
  {
    "text" : "So hey, don't you call Michael Holly stupid. We like him. Who's the we?",
    "speaker" : "Andy",
    "timestamp" : "39:35-39:40"
  },
  {
    "speaker" : "Steve",
    "text" : "You're speaking for all of us now, huh?",
    "timestamp" : "39:41-39:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:43-40:27",
    "text" : "No, it's the royal we. I'm speaking for myself in the real term. Um so the basically he was talking about like this is just to have a super bowl and It was kind of a happy accident they won. And so he was asked how many players on the Super Bowl champs would have to be replaced before you could call them perennial championship threats. He didn't hesitate. About twenty. Belichick coming off of the biggest upset well, one of the biggest upsets in Super Bowl history. turns around they're like all right so for this to continue how many people do you think you need to replace and like immediately it's like twenty give or take So you can kind of see that in this 2002 season, I think, right?"
  },
  {
    "timestamp" : "40:27-40:31",
    "speaker" : "Steve",
    "text" : "Like you've It's not a lot of big changes, I don't think."
  },
  {
    "text" : "On on defense more than offense, I think. Alright, like the front the defensive line has gone through a bunch of guys because they can't stop the run. The they brought in Victor Green who hasn't played as they don't lose like",
    "timestamp" : "40:31-40:48",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "40:48-40:59",
    "text" : "Like their their two corners and two safety are the same. Their receivers are the same except the addition of Dion. They definitely turned the tight end position over.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "40:59-41:00",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "41:00-41:02",
    "text" : "The line's pretty sort of.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "41:02-41:18",
    "text" : "Offensive line is not great still, I think. Like they struggled last week. And I thought they did a bit better this week, but both tackle linebackers are pretty similar year to year. Yeah, but the tackles are getting played.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "41:18-41:33",
    "text" : "Oh, I'm not saying they perform I'm just saying personnel 01 to 2002. It's it's a very similar group. I mean we watched the Raiders turn over ten people on defense, which is fucking starters, yeah, which is ridiculous. Their entire defense is new except for Woodson."
  },
  {
    "timestamp" : "41:34-42:18",
    "speaker" : "Andy",
    "text" : "Right. So but basically the this goes on to talk about how uh the reason they did as well as they did 2001 is because all the Like the guys that they took chances on hit. So Bobby Hamilton hit. Roman Pfeiffer hit, right? Like all these guys who are um who were supposed to be just like kind of like role guys just kind of played out of their minds. Um like Rables, same same sort of thing. They did their job is what you're saying. You could say that, but they it was more than just doing their job. Like they actually like killed it. They did their job well? Yeah. So see, yeah, so we're gonna start defensive ends, but the problem is like those guys No, I'm about to Don't read me the book, Andy."
  },
  {
    "text" : "I don't God, I'm not gonna get secondhand loser from you. Listen, asshole, you're already a second hand loser. I can do that on my own.",
    "speaker" : "Steve",
    "timestamp" : "42:18-42:27"
  },
  {
    "text" : "I don't need help to be a loser. Thank you very much. But basically the the gist of it is, so I'll fucking read, is that guys like Anthony Pleasant and Bobby Hamilton that they brought in as kind of like one year stop gaps and killed it in 2001. Right at this point we're kind of over the hill. And then the guys that they brought in this year that they tried to r use as the guys like that, like Victor Green, they realized not so great. And they're talking there's a story about um They brought him to tackled Steve Martin, who was supposed to be, I think. Yeah, exactly. Yeah, that that's a big thing. Isn't he an actor? Among other things. Apparently he's also a defensive tackle. But he was supposed to be like that run-stopping, like space-eating Vince Wilfork type of guy in the middle. Yep. And apparently he was So bad that they st like his technique was so bad that Belichick would put people like Bobby Hamilton in who was 40 pounds lighter than him to show him the correct way to do things, the guy still couldn't figure it out. And so he got cut halfway through the season, which I think is probably why at the beginning of the season you saw those two hundred yard games, because that guy couldn't get a shit to go. And so it just kind of showed the like how on the edge the Patriots were in these first few seasons. And the fact that they won in 2001 was basically almost a fluke. Even though Belichick was building that system, which eventually would turn into like 03 and 04, which we'll see in then the next 20 fucking years.",
    "speaker" : "Andy",
    "timestamp" : "42:29-44:03"
  },
  {
    "speaker" : "Steve",
    "text" : "Right, right, right.",
    "timestamp" : "44:03-44:04"
  },
  {
    "speaker" : "Andy",
    "text" : "But at that time, winning in 01 was just like blind luck almost.",
    "timestamp" : "44:05-44:11"
  },
  {
    "timestamp" : "44:11-44:18",
    "text" : "Well I think that can happen, right? The Giants. Joe Flacco. I mean there's all sorts of fluke shit like that. That's true.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:21-45:08",
    "speaker" : "Andy",
    "text" : "Yeah, I th I think so. But I think The difference between them and this team is that the Patriots they get lucky here and there, you know, that you have um Like I know one against the Bills where was it Patton that got knocked out, but he was touching the ball and he was touching the sideline, so it was really out of bounds. I think you got lucky like that or Maybe even the Edelman catch in the Super Bowl against the Falcons. That's it's like Yeah, you know, it's a good play, but it's still kind of lucky, just the way that it bounced everything. It didn't hit the ground. And um but the pages are able to put themselves in that position so many more times just based on the foundation that they have."
  },
  {
    "timestamp" : "45:07-45:10",
    "speaker" : "Steve",
    "text" : "Right, right, right. They get you there and then luck gets you over the hump."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. And I think for a lot of teams, like that's what you almost have to bank on. But the basics continue to get to that point at all the time. R So eventually there's like the luck will happen to them.",
    "timestamp" : "45:11-45:21"
  },
  {
    "speaker" : "Steve",
    "text" : "And when it does averages will win out, yeah.",
    "timestamp" : "45:21-45:23"
  },
  {
    "timestamp" : "45:23-45:27",
    "text" : "Yeah, exactly. Same as the way that they draft, I think, too.",
    "speaker" : "Andy"
  },
  {
    "text" : "Do you can we bring this back to like something you know cooler? Alright, how about this? I have this note. But you oh fine, you can do your cool thing from the book, Andy.",
    "speaker" : "Steve",
    "timestamp" : "45:27-45:36"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:36-45:39",
    "text" : "No, this isn't from the book. Fuck it. I'll give you a cool stat."
  },
  {
    "text" : "It's probably from the book.",
    "timestamp" : "45:40-45:42",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "45:42-46:01",
    "speaker" : "Andy",
    "text" : "No, it's from this game. But I read it off the screen, so you can fucking eat a dick. Kevin Falk Is the only player in the league this season, I assume, with rushing, receiving, and kick return touchdown. I guess that's cool. Pretty fucking cool."
  },
  {
    "timestamp" : "46:01-46:13",
    "speaker" : "Steve",
    "text" : "Do you think Tom Brady's good at Madden? Um like how good is he at Madden? That's a g see. I was initially just obviously that. He can read the defense like no other."
  },
  {
    "text" : "See, I well I was officially gonna dismiss that and say that he just doesn't play it at all.",
    "speaker" : "Andy",
    "timestamp" : "46:13-46:17"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "46:16-46:37",
    "text" : "But he probably doesn't have time for video games, yes. But he probably doesn't read either, because he he actually does not read. Unless it's a scouting report. He'll read a scouting report, but that's it. I don't know. I think um If Tom Brady played Peyton Manning and Madden, who would win? Has this ever been done?"
  },
  {
    "timestamp" : "46:40-46:57",
    "text" : "Here's why I say I think it's Tom Brady. Because Tom Brady was on the cover of map back in two or three years ago. Something like that. And because he was on the cover, I bet he learned how to play it. And because it's Tom Brady, He's not gonna play something he's not good at.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "So he will get good at Madden. He's on 18 and 12. Cool. He was long-haired Tom Brady in 12. Really? I don't remember him. And he was on uh PlayStation Original NFL Game Day 2003, baby.",
    "timestamp" : "46:57-47:11"
  },
  {
    "text" : "I remember that one, yeah. I didn't know he was on Madden twelve. Yeah. I don't know that it was.",
    "timestamp" : "47:11-47:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I thought eighteen. Um I asked because I've been playing 2012, coincidentally, a college football game with my friends. And I am really fucking really fucking bad at it. See, I got I can't read a defense to say my goddamn. I just throw to whoever that's supposed to go to and I throw interceptions all the time. I don't read a defense. I just go. It's gonna that guy, it's gonna that guy. And uh half the time it works maybe stare him down and stare him down. Yep. I don't want to read shit. And my one coworker, the guy's gonna be on next week, he's like, he played quarterback in high school. He's like, oh you gotta read this. I'm like, no, no. This guy's getting the ball. It says right in the place.",
    "timestamp" : "47:21-48:04"
  },
  {
    "text" : "I thought Yeah, that's why he's highlighted. That's why he's highlighted. Which, going back to what we talked about before, is why I play my games on easy. 'Cause on rookie that that's a completion ninety percent of the time.",
    "timestamp" : "48:04-48:16",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:16-48:17",
    "text" : "That's true.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:17-48:22",
    "text" : "I ain't getting picked off. So Tom Brady's gonna complete eighty percent of his passes."
  },
  {
    "text" : "I forget what it was, but one coworker we played Madden and he's like, You want to play against each other? I was like, No, I don't want to play against each other And so he played as the Patriots against the Jets on easy mode and just destroyed them.",
    "timestamp" : "48:22-48:36",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:36-48:53",
    "text" : "It just feels so good. And I know that he got ragged on by I think it was Greg and Connor at the time. But like I don't play video games for the challenge. I play video games to cosplay as a fucking superhero. Like I'm doing shit that I can't do in real life."
  },
  {
    "text" : "I brought the whole box of beers to the my room with me for this podcast because I know I couldn't walk away and get another one. That's some real forward thinking for you know I didn't want to leave you by yourself, Andy, although you probably could have just read out of your book to our audience.",
    "timestamp" : "48:54-49:08",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "49:09-49:30",
    "speaker" : "Andy",
    "text" : "You know what? I'm gonna I don't know what I'm gonna do. I'm gonna try to find a way to have people vote on this. But nobody fucking does. So fuck it. You know what? I'm in the right here. Sure. I am I am Bringing new information to our audience. You're sitting there fucking talking about boxes of beers and how you suck at Madden."
  },
  {
    "timestamp" : "49:30-49:57",
    "speaker" : "Steve",
    "text" : "And the best name in the whole game, maybe even in Madden in 2002. No. He played in this game. He was their fullback. It was their fullback? I don't know. Who was it? Yeah, Jim Klein saucer. Spelling for all of you up there. K-L-E-I-N-S-A-S-S-E-R."
  },
  {
    "speaker" : "Andy",
    "text" : "Hell yeah.",
    "timestamp" : "49:58-49:59"
  },
  {
    "speaker" : "Steve",
    "text" : "He looks like a Klein saucer.",
    "timestamp" : "50:01-50:02"
  },
  {
    "speaker" : "Andy",
    "text" : "She's actually just a really fancy T set.",
    "timestamp" : "50:04-50:06"
  },
  {
    "speaker" : "Steve",
    "text" : "Just the first Google image result that comes up is the best. What is it? Ta walk me through it with your words. Uh he's wearing a Vikings jersey with a nice patch. Okay. And it looks like he's taking a shit while looking off to the right somehow. He's not looking right at the cane, he's looking off to the right He's taking a shit.",
    "timestamp" : "50:07-50:28"
  },
  {
    "speaker" : "Andy",
    "text" : "So it's almost like a candid photo.",
    "timestamp" : "50:28-50:30"
  },
  {
    "timestamp" : "50:30-50:39",
    "speaker" : "Steve",
    "text" : "Yeah, you can see like his his teeth, his top row of teeth, his gums, he's like biting his lip, and he's his blood face is all his face is all scrunched up."
  },
  {
    "timestamp" : "50:40-51:00",
    "speaker" : "Andy",
    "text" : "Like he's pooping. So not not a pleasurable sort of thing then. Yeah, a full-on uniform poop. Nice. That's great. Oh, I have I think I think we we have uh criminally under talked about and that's a a phrase that people say."
  },
  {
    "text" : "Yes. In books. They write it.",
    "timestamp" : "51:00-51:04",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "51:05-51:23",
    "speaker" : "Andy",
    "text" : "We have criminally undertalked about your boy, my boy, Dandy Randy Moss. And I don't know if you caught this at the beginning of the game. But it was almost like I cause they had like the the pregame a little bit, the Fox pre game. And then Which is awful"
  },
  {
    "text" : "And it's the same fucks that they're still then. And it's awful.",
    "speaker" : "Steve",
    "timestamp" : "51:23-51:26"
  },
  {
    "speaker" : "Andy",
    "text" : "And it's just them talking over each other about and they have the robot.",
    "timestamp" : "51:27-51:30"
  },
  {
    "text" : "How they've had no innovation there.",
    "timestamp" : "51:31-51:34",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean it's the NFL. Fox throw their money at them anyway. It's Fox. They had like, you know, the like after they cut to that and before they go to the actual games, they have like",
    "timestamp" : "51:35-51:46"
  },
  {
    "speaker" : "Steve",
    "text" : "Before we get off this, there was one innovation that they got rid of, which I really liked. Which when they'd score, like the they would make that like sound and then the score would change and like change in the colors of your team, you know?",
    "timestamp" : "51:49-52:03"
  },
  {
    "text" : "I don't remember that. Did it happen in this game?",
    "speaker" : "Andy",
    "timestamp" : "52:03-52:08"
  },
  {
    "timestamp" : "52:09-52:20",
    "text" : "Yeah. And uh well I really remember it from the Super Bowl when and in the Rams Super Bowl when Adam Venteri kicks that field goal. And it makes that like uh sound.",
    "speaker" : "Steve"
  },
  {
    "text" : "Like machine noise kind of sound? Yeah, it's like Oh yeah. I don't know what you're talking about. It's subtle.",
    "speaker" : "Andy",
    "timestamp" : "52:20-52:28"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. But yeah. But I always associated that sound with us winning and that's the only thing they took away and they left fucking All those fucks in the pregame show just talking over each other.",
    "timestamp" : "52:29-52:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:43-53:18",
    "text" : "It left the robot. And the robot. Which Mama Brown hates. What and so what we did like with a passion. Uh so what we did is when they were trying to They had a contest to name that robot. Oh really? Yeah. So I submitted a lot of submissions to name it Christine. It didn't work. Come on, they're not gonna name a robot Christine. That's a pretty good name for a robot If you're in like a horror movie."
  },
  {
    "timestamp" : "53:19-53:20",
    "speaker" : "Steve",
    "text" : "It's Fox bro."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:20-53:34",
    "text" : "But yeah, so back to my point. Oh yeah. They were just ending the the pregame show and they were doing like the mic'd up around the league, you know they do with the getting the the hype up huddle. And they had our boy Randy Moss."
  },
  {
    "text" : "Ooh, they got some monsters coming out here, dawg. They got some big Super Bowl champion monsters coming out here, decorated in that blue and green.",
    "timestamp" : "53:35-53:44",
    "speaker" : "Randy Moss"
  },
  {
    "text" : "They got some Super Bowl monsters coming out decorating that blue and gray.",
    "timestamp" : "53:45-53:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "53:50-53:54",
    "text" : "And for those who can't see it, he's doing the classic wears his gloves in his face mask."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "53:55-53:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "53:55-53:57",
    "text" : "Like they're like fangs."
  },
  {
    "text" : "Yeah, like he's just gonna like Like velcroed onto the bottom of the face masking because his face is like a little bit too high up, so you can't really see him. Randy Moss is my one of my favorite characters in the NFL. I think he's very good. Oh, for sure. I remember there was some, and and I'll look it up when we get to that point of Like when he joins the team and we we talk about him in depth. But there's some article about him, how he lived in like uh an over fifties commun like gated community. Just because he wasn't like a pirate or anything. He he liked the uh he got along with all the the neighbors and liked the the like quietness of it all and everything. Like that's pretty fucking cool. Yeah. Just like a misunderstood dude.",
    "timestamp" : "53:57-54:44",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I know he grew up brand to West Virginia.",
    "timestamp" : "54:45-54:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. In the middle of nowhere.",
    "timestamp" : "54:48-54:50"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean all of West Virginia is the middle of nowhere, buddy.",
    "timestamp" : "54:50-54:53"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true. Did you know West Virginia was the only state that was created during the Civil War?",
    "timestamp" : "54:54-54:59"
  },
  {
    "speaker" : "Steve",
    "text" : "Cool. Did you read that in a book? No.",
    "timestamp" : "54:59-55:02"
  },
  {
    "timestamp" : "55:03-55:21",
    "speaker" : "Andy",
    "text" : "Maybe I did. I did read a book about the Civil War. I may have made that up though, actually. It sounds good. Yeah? Yeah. I thought it was something where like Most of Virginia wanted to be part of the south, and then like except for the western part of the state. They're like, nah, if that's the same thing."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "55:21-55:22",
    "text" : "Doesn't make any sense now."
  },
  {
    "timestamp" : "55:23-55:24",
    "speaker" : "Andy",
    "text" : "Why not?"
  },
  {
    "timestamp" : "55:26-55:27",
    "text" : "I suppose that's true.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Well isn't Virginia where most of the racists are too though?",
    "timestamp" : "55:27-55:30"
  },
  {
    "text" : "Nah. Too many people up here in DC. Yeah well they're all racist as well.",
    "speaker" : "Steve",
    "timestamp" : "55:30-55:37"
  },
  {
    "speaker" : "Andy",
    "text" : "You're all racist. Anything south of Connecticut's racist, boy.",
    "timestamp" : "55:37-55:41"
  },
  {
    "timestamp" : "55:41-55:42",
    "text" : "Oh right.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "55:44-55:45",
    "text" : "You're a southerner to me, Steve.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh-huh. Yeah, because you know, people in New Hampshire aren't racist at all. That's why that's why that's why Wyndham's bakery name their named themselves after a black guy.",
    "timestamp" : "55:45-55:58"
  },
  {
    "speaker" : "Andy",
    "text" : "They don't call us the South of the North for nothing. Uh speaking of Virginia though, um our boy Randy Moss after the game. The like the first thing they shot to, like after Brady took the knee to end it and everybody came on the field, was Randy Moss talking to our one and only love of the podcast, Troy Brown. Yes, I did see that too. I'm going to to put it out now. I'm going to be the first one to put it on record. I think Troy Brown is responsible for getting Randy Moss and the Patriots.",
    "timestamp" : "55:58-56:31"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:31-56:35",
    "text" : "I'll believe it. I'll co-sign that. And they never played together though."
  },
  {
    "speaker" : "Andy",
    "text" : "Right. Doesn't matter.",
    "timestamp" : "56:35-56:36"
  },
  {
    "text" : "They're pretty close though.",
    "timestamp" : "56:37-56:38",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, they were overlapping. When did Troy Brown retire?",
    "timestamp" : "56:39-56:43"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm gonna say like five or six.",
    "timestamp" : "56:43-56:45"
  },
  {
    "text" : "Yeah, I'm gonna say in that general sanity. Troy Brown.",
    "speaker" : "Andy",
    "timestamp" : "56:45-56:49"
  },
  {
    "text" : "That's two thousand six, probably two thousand five.",
    "timestamp" : "56:49-56:51",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:51-56:58",
    "text" : "Two thousand seven. He didn't play one game in two thousand seven but had no stats."
  },
  {
    "speaker" : "Steve",
    "text" : "So he was on the team with Randy Moss.",
    "timestamp" : "56:58-57:00"
  },
  {
    "timestamp" : "57:01-57:02",
    "text" : "Yeah, so yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "This is landing more credence to your This is what I'm saying.",
    "speaker" : "Steve",
    "timestamp" : "57:03-57:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Play one game you had Six punt returns.",
    "timestamp" : "57:08-57:12"
  },
  {
    "text" : "And and where did they both go to college? Marshall. Yeah. And they're both Marshall dies.",
    "timestamp" : "57:14-57:21",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "57:22-57:26",
    "speaker" : "Andy",
    "text" : "See? It's all coming together, Steve. We're putting this together on the fly."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, I love it.",
    "timestamp" : "57:26-57:27"
  },
  {
    "speaker" : "Andy",
    "text" : "All right, all right. Fucking hey. Oh he's he's from South Carolina though, Troy Brown.",
    "timestamp" : "57:27-57:34"
  },
  {
    "text" : "Which is It's not too far.",
    "timestamp" : "57:34-57:36",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:36-57:44",
    "text" : "It's in the general vicinity of West Virginia. Oh m so maybe if we get Troy Brown on, he'll get his his best friend Randy Mosscom with him."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, that'll that'll put us on the goddamn map. I don't really care about that though.",
    "timestamp" : "57:44-57:49"
  },
  {
    "speaker" : "Andy",
    "text" : "No, I just want to show a brown on. But I'd love to talk to Randy Moss. I bet he's a fascinating dude to check.",
    "timestamp" : "57:49-57:54"
  },
  {
    "text" : "Yeah, for sure.",
    "speaker" : "Steve",
    "timestamp" : "57:54-57:55"
  },
  {
    "text" : "Because apparently like he knows his shit too. Like he was teaching the Patriots shit about how offense worked.",
    "timestamp" : "57:56-58:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yep. Belchek said that many times.",
    "timestamp" : "58:02-58:05"
  },
  {
    "text" : "Yeah. Just not in this game.",
    "timestamp" : "58:05-58:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:20-58:24",
    "text" : "Yeah, they were all about stopping Randy. They were not gonna let Randy beat him.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, they had safety every time. Yeah. They doubled him. Yeah. So what do you think his uh his stat line was?",
    "timestamp" : "58:25-58:34"
  },
  {
    "text" : "Uh you've had maybe like five catches.",
    "speaker" : "Steve",
    "timestamp" : "58:35-58:38"
  },
  {
    "timestamp" : "58:40-58:41",
    "text" : "Yardage?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:41-58:48",
    "text" : "Uh not more than one twenty-yard one, a couple tens, probably fifteen yards of catch.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "58:49-58:51",
    "speaker" : "Andy",
    "text" : "No, how many yards do you have total?"
  },
  {
    "timestamp" : "58:51-58:56",
    "text" : "That's fifteen times five, Andy. I don't know. I didn't come here to do math, buddy.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "58:56-59:07",
    "text" : "I don't know either. 75. He actually had eight catches for ninety-two yards. That's more than I thought, yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "59:07-59:09",
    "text" : "He didn't like impact the game like that though.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "No. He was the lead yeah, the longest of nineteen.",
    "timestamp" : "59:09-59:11"
  },
  {
    "timestamp" : "59:12-59:15",
    "speaker" : "Steve",
    "text" : "Did you see the last play of the game where he just didn't Do it."
  },
  {
    "text" : "I was gonna say, yeah. Like he just the commenters like, well he knew it wasn't coming to him. I'm like, eh, still.",
    "speaker" : "Andy",
    "timestamp" : "59:16-59:21"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "59:21-59:43",
    "text" : "To be fair, what the fuck were the Vikings thinking? They're on like their 40. Yeah. And it was fourth and ten, and they threw it to Jim Kleinsauster. Yeah. With like twenty seconds left. They were just trying to get another first down and like clearly Randy heard that call in the huddle and then just walked like they snapped the ball and he just walked off the line of scrimmage."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "59:43-59:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Three yards off. Why the fuck are you not just throwing me a goddamn jump ball?",
    "timestamp" : "59:44-59:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Also, all the other plays before that were deep bombs to not rainy moss. And even the commentator was like, if you're gonna throw that to double coverage, you may as well throw it to Moss anyway.",
    "timestamp" : "59:49-59:59"
  },
  {
    "timestamp" : "01:00:00-01:00:03",
    "speaker" : "Steve",
    "text" : "He was shitting all over Mike Tice for those calls. Yeah."
  },
  {
    "timestamp" : "01:00:03-01:00:27",
    "speaker" : "Andy",
    "text" : "Yeah, this is not a football game. But I mean, you can't really uh complain too loudly about Mike Tice when he his team is Uh after this, 16, 17, 18, minus 19 in the turnover differential. Still the most penalized team in the league, averaging nine penalties a game. Like he obviously doesn't have a handle on shit at all, right?"
  },
  {
    "timestamp" : "01:00:27-01:00:31",
    "speaker" : "Steve",
    "text" : "Well he lasted enough to get the love and the love boat is what did him in."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:31-01:00:32",
    "text" : "Right."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:33-01:00:34",
    "text" : "How did he even get there?"
  },
  {
    "timestamp" : "01:00:37-01:01:08",
    "speaker" : "Andy",
    "text" : "I mean, did he have decent records? Nope. He oh that's right. He uh He finished his career, his five year career, uh, one game under five hundred. 32 and 33. He went six and ten in two thousand two. So this year he would go six and ten. And then nine and seven, eight and eight, nine and seven. So like 100% mediocre."
  },
  {
    "timestamp" : "01:01:08-01:01:18",
    "speaker" : "Steve",
    "text" : "He's like Jeff Fisher, but not as good. Not that Jeff Fisher was good. Jeff Fisher was really good at being mediocre for a really fucking long time."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep, this isn't that. But they show some stat in this game where Mike Tice was the coach with the longest like tenure in the NFL as a player. Like he had played for 14 years or something like that before because and I thought, well, I guess that doesn't translate. Uh do you have any other interesting tidbits? I had a couple. Um the left guard for the Vikings, or maybe it was a left tackle, I don't know. Uh McKinney. He I think it was his rookie year. It was. And there was all over him. They said he was six foot eight, three hundred and something pounds. The big fucking man. And they were saying he had to start out of a two-point stance on every play instead of a three-point stance because he's too slow getting out of a three-point stance because he's 6'8, 300 something pounds.",
    "timestamp" : "01:01:19-01:02:09"
  },
  {
    "timestamp" : "01:02:10-01:02:28",
    "speaker" : "Steve",
    "text" : "Well like Gronk's like 6'9 270. I like honestly like these days it's not that big. I know we his nickname was Mount McKinney, right? I think it was, yeah. Which isn't like, I don't know, he didn't seem By today's standards that fucking big, but I guess he was back then."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:02:28-01:02:31",
    "text" : "And Rock was dude was second."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:02:31-01:02:36",
    "text" : "He was there for a long time, if I remember. He was like legit as fuck for a long time."
  },
  {
    "text" : "I thought he was yeah, a bit of a stalwart. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:02:36-01:02:38"
  },
  {
    "timestamp" : "01:02:38-01:02:40",
    "text" : "Yeah, he definitely was.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:02:40-01:02:54",
    "speaker" : "Andy",
    "text" : "But Bryant McKinney, left tackle. Was there from 2002 to 2013? Yeah. Which is Minnesota. We started pretty much sixteen games every year except for 2008 we started twelve."
  },
  {
    "text" : "Pro Bowl in 09, one a Seaver Bowl?",
    "speaker" : "Steve",
    "timestamp" : "01:02:55-01:02:57"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:02:57-01:03:04",
    "text" : "Yeah, with Minnesota. Wait, won a Super Bowl? Yes. No, we do. Oh, he must have won it with Baltimore?"
  },
  {
    "text" : "Yep.",
    "timestamp" : "01:03:04-01:03:05",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:05-01:03:06",
    "text" : "Eleven or twelve, whatever that was."
  },
  {
    "timestamp" : "01:03:07-01:03:09",
    "speaker" : "Steve",
    "text" : "The Ravens, Baltimore. And the Niners."
  },
  {
    "speaker" : "Andy",
    "text" : "That was the one that was rooting for the lights to go out. And they did, so I turned the game off. You laugh like I'm kidding. I can't stand the hardball, says coaches. Like screaming until their face turns red with all the fucking veins.",
    "timestamp" : "01:03:13-01:03:25"
  },
  {
    "speaker" : "Steve",
    "text" : "You tell him, Andy, you should write him a strongly worded letter.",
    "timestamp" : "01:03:25-01:03:28"
  },
  {
    "timestamp" : "01:03:28-01:03:29",
    "speaker" : "Andy",
    "text" : "You know I might."
  },
  {
    "timestamp" : "01:03:29-01:03:30",
    "speaker" : "Steve",
    "text" : "And you know why I can do that?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:31-01:03:33",
    "text" : "I can fucking read because I read books."
  },
  {
    "timestamp" : "01:03:33-01:03:35",
    "text" : "Yeah, but they're not gonna read it because they're not fucking losers.",
    "speaker" : "Steve"
  },
  {
    "text" : "Too shy. Well done. God damn it. Where's Greg to shit on when you need him? Give me a give me a a f a fun fact about Greg. Something embarrassing.",
    "timestamp" : "01:03:37-01:03:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:03:51-01:03:53",
    "text" : "Fun fact about Greg."
  },
  {
    "timestamp" : "01:03:53-01:03:54",
    "speaker" : "Andy",
    "text" : "Yeah, something we can show to him."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:03:55-01:03:57",
    "text" : "It sounds like you have one that you want to say."
  },
  {
    "text" : "I don't. I'm trying to think of one off the top of my head.",
    "timestamp" : "01:03:57-01:03:59",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh jeez.",
    "speaker" : "Steve",
    "timestamp" : "01:03:59-01:04:00"
  },
  {
    "timestamp" : "01:04:00-01:04:09",
    "speaker" : "Andy",
    "text" : "Oh, I I got one. Uh back when he was little. Probably about the time we were watching these games. Maybe a bit before. Uh he used to cry when the Patriots would lose."
  },
  {
    "speaker" : "Steve",
    "text" : "I have one that he's not going to be happy that we share, so we should definitely share it.",
    "timestamp" : "01:04:10-01:04:14"
  },
  {
    "timestamp" : "01:04:14-01:04:16",
    "text" : "All right, let's go.",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh he was wrestling Danny. Danny's our neighbor. He's in between me and Greg's age.",
    "speaker" : "Steve",
    "timestamp" : "01:04:16-01:04:20"
  },
  {
    "timestamp" : "01:04:20-01:04:22",
    "speaker" : "Andy",
    "text" : "So Yeah, yeah. He's like a an extra brother."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:04:22-01:04:46",
    "text" : "Right. And uh Danny had him in like a like a half guard or f I don't know what the fucking MMA term is, but like, you know. Yeah, like on their back with their arms pinned. Yeah. So the Greg couldn't get up and Danny's like kind of straddling them. And Greg leans up and kisses Danny right on the lips to get out of the hold. Eyewitness the whole thing."
  },
  {
    "text" : "Uh this coming from the man who invented the term the best part about wrestling is only one person has to want to wrestle. Right.",
    "timestamp" : "01:04:47-01:04:53",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:04:56-01:05:03",
    "text" : "And then I guess he kisses you too. Which is honestly dovetails right into wrestling, so totally okay.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh boy. I love it Alright, so I'm done here. We probably should, yeah. Just a shit on ground. And probably you too, because he knows all your secrets.",
    "timestamp" : "01:05:05-01:05:15"
  },
  {
    "text" : "Well, next week is that the Lions Week?",
    "timestamp" : "01:05:15-01:05:19",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Um well we haven't done our best and worst, but I can tell you that yes it is. Nice. I believe Thursday, I think this is uh uh Thanksgiving Day game. It is. How about that?",
    "timestamp" : "01:05:20-01:05:32"
  },
  {
    "speaker" : "Steve",
    "text" : "Thursday twenty eighth. We have a very s we have a special guest coming for that one.",
    "timestamp" : "01:05:32-01:05:36"
  },
  {
    "timestamp" : "01:05:36-01:05:37",
    "text" : "We do.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:37-01:05:38",
    "speaker" : "Steve",
    "text" : "That's good to know."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh-huh.",
    "timestamp" : "01:05:38-01:05:39"
  },
  {
    "text" : "And uh I talked to him this week. We're gonna we're gonna make Turkey and stuffing sandwiches. Okay. For dinner. And we're gonna we're gonna go all that round for Thanksgiving dinner.",
    "timestamp" : "01:05:39-01:05:50",
    "speaker" : "Steve"
  },
  {
    "text" : "Didn't uh the candy corn people just come out with Thanksgiving flavored candy corn? What? That's sounds Did I stutter? Sounds disgusting. Candy corn. Statek. Brock's turkey dinner candy corn. New to store shelves. A full course meal presented in a unique mix of candy corn flavors.",
    "timestamp" : "01:05:50-01:06:15",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:06:15-01:06:17",
    "text" : "Oh, each one's different?",
    "speaker" : "Steve"
  },
  {
    "text" : "Brock's turkey dinner includes all the traditional Thanksgiving favorites from roasted turkey. Green beans and stuffing to ginger glazed carrots, cranberry sauce, and sweet potato pie. Flavor of the case, but it's like each is each corn",
    "speaker" : "Andy",
    "timestamp" : "01:06:17-01:06:30"
  },
  {
    "speaker" : "Steve",
    "text" : "a different flavor and you just like scoop them all up and eat them to get like a mix? Or is each corn all the flavors mixed?",
    "timestamp" : "01:06:31-01:06:38"
  },
  {
    "text" : "I'm gonna say each individual corn is a flavor.",
    "timestamp" : "01:06:39-01:06:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "From the link. So you could get like a handful of just all green beans and disgusting.",
    "timestamp" : "01:06:43-01:06:46"
  },
  {
    "timestamp" : "01:06:47-01:06:53",
    "text" : "I think it's gonna be disgusting either way. It's available at your local Walgreens though, so maybe we'll have to do that.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:06:53-01:07:03",
    "text" : "I'm gonna actually make like a I would like I could really go for like a turkey and stuffing sandwich. Yeah, that's the best."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but that won't be nearly as funny as us suffering through a bag of Brock's turkey dinner candy corn, would it?",
    "timestamp" : "01:07:03-01:07:10"
  },
  {
    "speaker" : "Steve",
    "text" : "Look, he's gonna have to suffer through watching the lions lose.",
    "timestamp" : "01:07:11-01:07:14"
  },
  {
    "text" : "Yeah, but he's used to that. He's not used to turkey dinner candy corn, is he? Well it's not like piling on the poor guy. We're piling on just by having him on the first place. He's gonna suffer through us. Uh speaking of suffering, uh give me your best and worst.",
    "timestamp" : "01:07:14-01:07:32",
    "speaker" : "Andy"
  },
  {
    "text" : "Um I feel like we've talked about I think the best was Charlie Weiss's play calling. Especially in the first half. Yeah, he was calling it a great game. The even announcers they they likened the defense to like a boxer on his heels, not knowing where it's coming from. Like the Second Fourier T D was like not only was he open, but Daniel Graham was right behind us open. Like everybody was open because they bit so hard.",
    "timestamp" : "01:07:34-01:07:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, this was it was literally just Nothing but quick passes, which was to slow down the defensive line, basically.",
    "timestamp" : "01:07:59-01:08:06"
  },
  {
    "speaker" : "Steve",
    "text" : "It's just like I don't know, they their cadence and the they just kept everybody off balance. It was a really good play call on. And then the worst was how the Vikings used Randy Moss like I don't think he got one outside of that terrible throw by Culpepper, they didn't take a single deep shot with Randy. Right, which well, I don't care if he is double covered.",
    "timestamp" : "01:08:07-01:08:24"
  },
  {
    "speaker" : "Andy",
    "text" : "Just throw it up there.",
    "timestamp" : "01:08:24-01:08:25"
  },
  {
    "speaker" : "Steve",
    "text" : "Brady's done it a bunch of times. It's third down. You throw it up there if it's an interception, it's a pick, you know? Might as well be a punt.",
    "timestamp" : "01:08:26-01:08:33"
  },
  {
    "timestamp" : "01:08:33-01:09:49",
    "speaker" : "Andy",
    "text" : "Yeah. No, I agree with that. Alright, my best was uh Tom Brady on I think it was in the second quarter after Bennett fumbled. The pages got the ball like inside their own ten yard line. And it's third and seven. And the pages kind of like need to get out of their own end. Because at this point the uh flag is kind of starting to drive. So what Brady does is he Runs the hard count, which draws the defensive line off sides. So then he knows he's got a free play. So he takes a deep shot, which then draws a pass interference, and they get the ball at like the 40-yard line. They're out of danger. Oh yeah. And this is like year two, Tom Brady. Like that's some fucking that's some veteran shit right there. That was awesome. Um we talked about Richard Seymour blocking field goals. That was great. Roman Pfeiffer, I think We haven't talked enough about him this year. He's he's still been one of the bright spots on the defensive like up front there, that front seven. And he actually forced two of the fumbles in this first half. You force the I think it was the Bennett fumble and the Moss fumble, both caused by him. Nice."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, he's playing solid.",
    "timestamp" : "01:09:49-01:09:50"
  },
  {
    "timestamp" : "01:09:50-01:10:21",
    "speaker" : "Andy",
    "text" : "Yeah, although I feel like he has been too. Yeah. But he's the guy that like never misses a tackle. Right. Always where he needs to be, always around the ball, doing things like that. Um and then there was also I kinda wish Greg was on here that we can show on him for this, but uh Belatrack calling a timeout right at the end of the first quarter. So the Vikings have to punt into the wind. So typical Bill Blackjack? Yeah. Even the the announcers actually picked up on it, which I thought."
  },
  {
    "speaker" : "Steve",
    "text" : "26 yard punt, I think. I have a note in here. 26 yard punt, Daddy Big Leg.",
    "timestamp" : "01:10:21-01:10:26"
  },
  {
    "text" : "Yeah, it was a garbage punt in the wind. Uh so that worked out and I think the pages end up scoring a touchdown on that ensuing drive too, which is great. Um my worst Outside of Gary Anderson's face mask was probably I don't really want to say Dante Culpepper. Oh, I have a worse for you.",
    "timestamp" : "01:10:26-01:10:48",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:10:49-01:10:50",
    "text" : "He was just not good.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "You have a worse for Oh no, you know what my worst is real quick? Is uh fucking Fox can afford the yellow first downline. Fucking scrubs.",
    "timestamp" : "01:10:50-01:10:59"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:10:59-01:11:01",
    "text" : "I haven't really seen it yet."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. No, it's it's I think it's still at the point where TV games. Yeah, I think it's at the point where it's ESPN still owns the rights to it.",
    "timestamp" : "01:11:01-01:11:09"
  },
  {
    "text" : "But um Tom Brady got stoned on the fourth down sneak. He did. He had a couple that weren't ended up leading to another to the touchdown.",
    "timestamp" : "01:11:09-01:11:19",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:11:19-01:11:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:11:21-01:11:23",
    "text" : "Yeah, right at the end of the half, right? Yeah."
  },
  {
    "timestamp" : "01:11:23-01:11:24",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "You never see that. I can't remember the last time We sneaked and not made it.",
    "timestamp" : "01:11:24-01:11:30"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that was rates like ninety something percent and like I think that was the first time it didn't work. Yeah. Actually, because they were talking about how before with like less than three yards to go, he he picked it up a hundred percent of the time. So that may have been the first time he fell it. Yeah, that's a great one. So yeah, I think that does it for this game. I don't have any other interesting things. I'm gonna read more of my books so that I can have something to annoy you about later.",
    "timestamp" : "01:11:30-01:11:57"
  },
  {
    "timestamp" : "01:11:57-01:12:04",
    "speaker" : "Steve",
    "text" : "All right. That's fine. I don't care what you do with your time. You're already a little Firmly entrenched in Lucerville, you might as well build the house."
  },
  {
    "timestamp" : "01:12:05-01:12:23",
    "speaker" : "Andy",
    "text" : "Yeah, I'm gonna I'm gonna bring you down with me though. So I guess is the point in the show where we should Ask for feedback, yeah. You keep talking about it. Nobody seems to be leaving any feedback. So I feel like we need to kind of sweeten the pot. Do you have any ideas?"
  },
  {
    "text" : "Oh, they can come on the show.",
    "timestamp" : "01:12:23-01:12:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:12:25-01:12:27",
    "text" : "If they leave feedback?"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:12:27-01:12:27",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Or fuck it anybody. Yeah.",
    "timestamp" : "01:12:28-01:12:31"
  },
  {
    "text" : "Or we'll say whatever they want on on the air. Fuck it. We'll do it live. We'll read it live.",
    "timestamp" : "01:12:31-01:12:37",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:12:39-01:13:04",
    "speaker" : "Andy",
    "text" : "All right, yeah, I think how about this? We will say anything, any uh feedback that we get, any review that we get. Well we have that. com. Shut up. Ratethispodcast. com slash patspod. And that'll take you to whatever Uh whatever thing that you use tells in the podcast in a way to that you can leave a a review easily"
  },
  {
    "speaker" : "Steve",
    "text" : "You're not like encouraging reviews by saying nobody's reviewing us, Andy, and now no one's gonna want to review us because they don't want to be first.",
    "timestamp" : "01:13:04-01:13:10"
  },
  {
    "timestamp" : "01:13:11-01:13:22",
    "speaker" : "Andy",
    "text" : "They're not first. We have we have I think three or four reviews already. Yeah, and we're gonna have him on Exactly. Sometime soon. Yeah."
  },
  {
    "timestamp" : "01:13:23-01:13:28",
    "speaker" : "Steve",
    "text" : "That could be you. You could message us and then we're so desperate for guests we bring you on."
  },
  {
    "speaker" : "Andy",
    "text" : "So here how about this? How about we do this? Any feedback we get, we're gonna read on the podcast, yeah? Sure. So if you if you want to hear unless slandering voice, unless it's slandering me, and then it's not especially if it's slandering you. No If it's slandering you, I'm gonna have Greg read it. And if it's slandering me, I'll have you read it.",
    "timestamp" : "01:13:28-01:13:45"
  },
  {
    "text" : "I think it's sh maybe it's more like the mean tweets where you have to read your own slanderous reviews.",
    "speaker" : "Steve",
    "timestamp" : "01:13:47-01:13:52"
  },
  {
    "text" : "Oh that's even better. I love it. All right, so if yeah, if you have anything good or preferably bad to say, we will read it on air. And How about at the end of or if we if we find them we like especially if you got some like cool insight or something like that we will have you on the podcast if you want to come on How's that sound? Oh, I'm amazing. I'm glad you're excited for it. Awesome. Thanks. Woo.",
    "speaker" : "Andy",
    "timestamp" : "01:13:52-01:14:17"
  },
  {
    "timestamp" : "01:14:19-01:14:26",
    "text" : "You know what, Andy? I don't give a fuck what people say, what they think. Except you, mom. I th I care what you think.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:14:27-01:14:41",
    "text" : "Well mom is one of our uh reviews. She she she didn't know she was leaving a review. So we're stuffing balance something. So I made a review. Oh yes. Posted it on Twitter."
  },
  {
    "text" : "Did it include burbling along? It did, yes.",
    "timestamp" : "01:14:41-01:14:44",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:14:44-01:14:45",
    "speaker" : "Andy",
    "text" : "Us burbling along."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:14:45-01:14:49",
    "text" : "That's burble for mom, real quick. Burble bur burble burble burble burble burble."
  },
  {
    "timestamp" : "01:14:50-01:14:58",
    "text" : "She does she does enjoy the podcast though. She loves it. Maybe at some point we'll we've been seeing it for a while, but maybe we'll have her on the podcast.",
    "speaker" : "Andy"
  },
  {
    "text" : "Maybe that's our niche, dude. Six-year-old ladies who love quilting.",
    "timestamp" : "01:14:59-01:15:03",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:15:03-01:15:04",
    "speaker" : "Andy",
    "text" : "And Patriots."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:15:05-01:15:05",
    "speaker" : "Steve"
  },
  {
    "text" : "And Greg being an asshole. Yeah. I don't know if she loves that. She does say that she's learned a lot about Gregory. Yeah. Yeah. Probably to his detriment, I would imagine. I can't wait for Christmas. Aqua dinner table.",
    "speaker" : "Andy",
    "timestamp" : "01:15:05-01:15:21"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh I'm gonna make it awkward. Yeah, wine fixes all those problems. Don't worry, Andy.",
    "timestamp" : "01:15:22-01:15:27"
  },
  {
    "speaker" : "Andy",
    "text" : "It's Christmas. Yeah, maybe we'll have to have some uh Drew Bledsoe wine for Christmas.",
    "timestamp" : "01:15:28-01:15:32"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:15:32-01:15:35",
    "text" : "There you go. Mom loves blood cell."
  },
  {
    "speaker" : "Andy",
    "text" : "Mom loves wine. Boom. Done. I know what she's getting for Christmas. Don't tell her. Mom, don't listen to this part. Fuck. We just won't release until after Christmas. No, I don't think that's possible. But alright. You got anything else, Steve? I'm Gucci. Or can we take this episode out back and and put a bullet through its head? Yeah, let's do that. All right. So, join us next week. Apparently we have a special guest that I just found out about as the patrons will travel to Ford Field in Detroit, Michigan. for a special Turkey Day episode. And uh if you want to follow along yourself, you're more than welcome to buy some Brocs Turkey dinner candy corn. And eat along with us. Yeah. We'll see you next week. See you later.",
    "timestamp" : "01:15:36-01:16:31"
  }
]