[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom"
  },
  {
    "timestamp" : "00:22-00:23",
    "speaker" : "Andy",
    "text" : "Alright."
  },
  {
    "text" : "I'll be a fucking signclap guy. Action.",
    "timestamp" : "00:25-00:30",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "00:32-00:42",
    "speaker" : "Andy",
    "text" : "Welcome back to the Beijers Dynasty Podcast. Still struggling through the 2002 season. We're at week 13. Flourishing."
  },
  {
    "speaker" : "Steve",
    "text" : "Flourishing. That's right, Greg. I agree.",
    "timestamp" : "00:42-00:44"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:44-00:49",
    "text" : "This, I don't know. This is the most losses that we're ever going to have to deal with in a season."
  },
  {
    "timestamp" : "00:49-00:50",
    "text" : "Oh, I meant our performance.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, I'm talking about watching these football games. Oh.",
    "timestamp" : "00:50-00:53",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "00:53-00:58",
    "speaker" : "Greg",
    "text" : "Well Greg doesn't watch it doesn't have to I meant showing up on time to these podcast recordings."
  },
  {
    "timestamp" : "01:00-01:02",
    "speaker" : "Andy",
    "text" : "You weren't here last week."
  },
  {
    "text" : "I know, and I've been here a lot of other weeks and I only missed one, so that's pretty good. Yeah, that is flourishing for Greg for sure.",
    "timestamp" : "01:02-01:09",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Um speaking of not showing up, uh this week is the Detroit Lions on Thanksgiving Day.",
    "timestamp" : "01:10-01:16"
  },
  {
    "speaker" : "Greg",
    "text" : "Happy Thanksgiving, guys. Happy Thanksgiving.",
    "timestamp" : "01:16-01:19"
  },
  {
    "timestamp" : "01:20-01:37",
    "speaker" : "Andy",
    "text" : "So I will start off with the bad news. I've already shared this with with my brothers. Um I did go to my local Walgreens that Steve and I talked about last week. They did not have the turkey dinner candy corn. They had all the other flavors, but I mean the autumn mix it it just didn't feel right."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:37-01:39",
    "text" : "So they have autumn mix out already?"
  },
  {
    "text" : "Autumn mix is out, pumpkins by themselves is out and regular candy corn. Nice.",
    "timestamp" : "01:39-01:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:44-01:48",
    "speaker" : "Steve",
    "text" : "Well you are wearing a hoodie in uh August, so I mean it's autumn."
  },
  {
    "timestamp" : "01:48-01:53",
    "speaker" : "Andy",
    "text" : "I am. It it is currently uh fifty-nine degrees."
  },
  {
    "speaker" : "Greg",
    "text" : "And Andy's going with the uh man that shows up to game after going to work with hoodie. underneath jersey look.",
    "timestamp" : "01:53-02:03"
  },
  {
    "speaker" : "Andy",
    "text" : "I got my work boots on too.",
    "timestamp" : "02:03-02:05"
  },
  {
    "text" : "Next thing he's gonna do is gonna show up with like a Collared shirt and a tie with a jersey over it. Oh, those dweebs at Celtics games.",
    "speaker" : "Greg",
    "timestamp" : "02:06-02:15"
  },
  {
    "text" : "What's a bigger heart of move though? That or just no undershirt basketball jersey?",
    "timestamp" : "02:16-02:20",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:21-02:23",
    "text" : "Oh yeah. That's a good question.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Depends on how hairy your chest is.",
    "timestamp" : "02:23-02:25"
  },
  {
    "speaker" : "Greg",
    "text" : "We should do an online poll, what's worse. Like button-down shirt under basketball jersey or absolutely nothing under basketball jersey.",
    "timestamp" : "02:25-02:33"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm a big nothing guy.",
    "timestamp" : "02:34-02:35"
  },
  {
    "text" : "Yeah, we know. You gotta go short sleeve.",
    "timestamp" : "02:35-02:38",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Under basketball jersey?",
    "timestamp" : "02:38-02:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "02:41-03:11",
    "text" : "Yeah. Preferably if you can get a zip-up hoodie and just wrap it over so you can still see the jersey underneath. That's the that's the move, but it's not always cold enough. That's true. Cool. Thought a lot about it. I'm a big Jersey guy. You were also wearing Jersey. Yeah. The throwbacks for this Thanksgiving game. I have my Kevin Falk throwback bright red jersey on. But how John Hannah one too, right? Mm-hmm. And a tie law one."
  },
  {
    "speaker" : "Andy",
    "text" : "But I'm the asshole for wearing a sweater. Never mind. I like your jersey. I think it looks good. Yeah, I'm wearing the uh the baby blue Troy Brown jersey with the the um the red What are they the uh like the sh the fake shadow? Yeah, the fake red shadow that they have on it. Pretty slick. So that finally.",
    "timestamp" : "03:12-03:33"
  },
  {
    "text" : "Rank the fave your favorite jerseys out of the three. Which three. I mean the only three they've ever had, Steve.",
    "speaker" : "Greg",
    "timestamp" : "03:34-03:42"
  },
  {
    "timestamp" : "03:42-03:45",
    "speaker" : "Andy",
    "text" : "Well there's four now. I like the color rush."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "03:45-03:48",
    "text" : "Oh colour rush I didn't consider color rush."
  },
  {
    "timestamp" : "03:48-03:52",
    "text" : "The those ones, the ones you wear in the throwbacks are the best. Even my mom hates them.",
    "speaker" : "Steve"
  },
  {
    "text" : "The the white helmets pop.",
    "speaker" : "Greg",
    "timestamp" : "03:53-03:55"
  },
  {
    "speaker" : "Steve",
    "text" : "They ran out of this game in the second.",
    "timestamp" : "03:56-03:58"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:05-04:34",
    "text" : "I'm glad we're getting a Detroit Lions fan on today at some point. Because I feel like it's a whole separate world of sportsdom. And I I I'm fascinated by what it's like to be a a Lions fan. Because even down to the throwback uniforms, you look at them and the Patriots have this like really cool one that's like super retro and everybody loves. You look at the Detroit Lions and they wear plain blue jerseys and plain silver helmets. Fucking cool."
  },
  {
    "timestamp" : "04:35-04:38",
    "speaker" : "Greg",
    "text" : "Yeah, they weren't they weren't exciting in the least bit."
  },
  {
    "timestamp" : "04:38-04:44",
    "text" : "No, and that was the best part about their whole game back in 2002.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "04:47-04:50",
    "speaker" : "Steve",
    "text" : "You said the most exciting part of the Lions was their throwback jerseys."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and they were playing.",
    "timestamp" : "04:50-04:52"
  },
  {
    "speaker" : "Steve",
    "text" : "Well Trevor just walked in, so",
    "timestamp" : "04:52-04:53"
  },
  {
    "speaker" : "Trevor",
    "text" : "Yeah. Flat football. Like they found them, they got them like on the way. They're like, oh fuck, we forgot.",
    "timestamp" : "04:57-05:04"
  },
  {
    "timestamp" : "05:04-05:11",
    "text" : "Oh, it's throwback week? Oh fuck. We gotta get we gotta run to dicks on the way to the game. Hang on.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "05:12-05:14",
    "speaker" : "Trevor",
    "text" : "Shit. Dude's a jersey too."
  },
  {
    "speaker" : "Andy",
    "text" : "No, you got a Joey Harrington jersey?",
    "timestamp" : "05:14-05:16"
  },
  {
    "text" : "It was my first ever football jersey. Really? Which is the arrow year of Ford Field. Yeah, it was first year.",
    "timestamp" : "05:16-05:24",
    "speaker" : "Trevor"
  },
  {
    "text" : "That's amazing. I know, right? Still fits ya. Full circle. Full circle. Well gypsies back then were so big. So joining us is Trevor. He's my buddy coworker.",
    "timestamp" : "05:24-05:43",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "05:45-05:45",
    "speaker" : "Andy",
    "text" : "Introduction."
  },
  {
    "speaker" : "Steve",
    "text" : "Huge Lions fan. And somehow agreed to come on. I think I bribed him with Turkey and stuffing Thanksgiving sandwiches.",
    "timestamp" : "05:45-05:55"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "05:55-06:18",
    "text" : "I like that, Steve. That's not bad. I mean I've got to make it a little bit more than a little bit. Yeah, we should do that more often on this podcast. No, set the mood with you know to put ourselves in the right mind space of what we're discussing. I'm not above people. Yeah. Like watching the game and Falling asleep in the third quarter because you've eaten too much turkey."
  },
  {
    "text" : "Wouldn't that be great? Yeah. It was quiet. It was quiet.",
    "speaker" : "Andy",
    "timestamp" : "06:18-06:26"
  },
  {
    "text" : "Ford Field, the first year. Can we get into this? I want to talk because I did a lot of research on the on the silver dome.",
    "speaker" : "Greg",
    "timestamp" : "06:27-06:34"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah. Give it to me while Steve's getting set up over there.",
    "timestamp" : "06:34-06:37"
  },
  {
    "text" : "Yeah, so this is um the first season of the new Ford Field that is downtown Detroit. Right. So Pontiac Silverdome is the is the one before. And it's got like a pretty interesting history that goes with it. So uh built in nineteen seventy-five It was uh like the biggest stadium in the NFL up until like the year 2000. 80,000 plus seater.",
    "speaker" : "Greg",
    "timestamp" : "06:37-07:06"
  },
  {
    "timestamp" : "07:07-07:08",
    "speaker" : "Andy",
    "text" : "Yeah, it's a lot of seats."
  },
  {
    "speaker" : "Trevor",
    "text" : "Yeah, yeah, massive in the middle of nowhere. Yeah. Essentially just they have this the big biggest parking lot you've ever seen. And in the middle of it is this just this even m bigger stadium.",
    "timestamp" : "07:08-07:21"
  },
  {
    "timestamp" : "07:21-07:26",
    "speaker" : "Andy",
    "text" : "So bigger than like uh the Redskins parking lot? Because I feel like that's a lot of things."
  },
  {
    "timestamp" : "07:32-07:33",
    "speaker" : "Trevor",
    "text" : "Think of like the same thing."
  },
  {
    "text" : "All right. And it's it's got a fiberglass roof. It's got this weird like it was a weird design that they did to it where it's it's it's an indoor stadium, but it's not truly an indoor stadium. So it's like It's got like a Teflon roof with like fiberglass things going through it. So it's actually held up by the air pressure from inside the stadium. So you can deflate the roof.",
    "timestamp" : "07:33-07:59",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "07:59-07:59",
    "speaker" : "Trevor",
    "text" : "Yep."
  },
  {
    "speaker" : "Greg",
    "text" : "Which you may have seen pictures. So so what happens is they once once Detroit once the Lions move to Fordfield. Yeah. Um Basically, it's like unused for like eight years and it's like just sitting there in the middle of fucking nowhere, wherever, right? And then uh so they go to try and sell it. They sell it at auction in 2009 for five hundred and fifty thousand dollars.",
    "timestamp" : "08:00-08:31"
  },
  {
    "timestamp" : "08:33-08:34",
    "text" : "Isn't that nuts? How much did it cost?",
    "speaker" : "Trevor"
  },
  {
    "timestamp" : "08:36-08:42",
    "speaker" : "Greg",
    "text" : "It's one percent of what it costs to build it in the first place. Like 20 years earlier."
  },
  {
    "timestamp" : "08:42-08:47",
    "speaker" : "Trevor",
    "text" : "It's like the worst ROI ever in like any sports franchise."
  },
  {
    "text" : "I saw something that did like uh like an inflation assessment of what the actual like percentage cost was and it was like 0. 001% of what they paid for it if you account for inflation. Just ridiculous. So bad. Yeah. So they pump a bunch of the new owners like pump like six million dollars back into it, get it back up and running. They actually hold some events there. And then in twenty thirteen, there's like a big snowstorm. And the ice collects on that roof and basically collapses it because it overcomes the air pressure. I remember seeing the pictures of that. And then they were just like, fuck it.",
    "timestamp" : "08:48-09:24",
    "speaker" : "Greg"
  },
  {
    "text" : "And it was just yeah. It was like one of the coolest like Google Earth things to look at uh after it had collapsed. And there was like a t there's probably still you can find a ton of cool photos of Just like wildlife. Like it was like a jungle just growing on the inside of the silver dome.",
    "timestamp" : "09:26-09:42",
    "speaker" : "Trevor"
  },
  {
    "timestamp" : "09:43-10:01",
    "speaker" : "Greg",
    "text" : "Because there's a bunch of like sitting water in there and like Yeah The the material the roof was like like shedding too. So it was like half the seats were like strewn with this like Teflon fucking shit. You should Google like Silverdome abandoned. It's it's some amazing pictures."
  },
  {
    "timestamp" : "10:01-10:08",
    "speaker" : "Trevor",
    "text" : "Yeah. Yeah it is uh how long were they in that stadium when you looked it up?"
  },
  {
    "text" : "'Cause they had it for Yeah, 75 to 2001.",
    "speaker" : "Greg",
    "timestamp" : "10:08-10:13"
  },
  {
    "text" : "Wow.",
    "timestamp" : "10:13-10:13",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Greg",
    "text" : "And they said they had like did the the Pope went there. They had like 95,000 people there for a mass. Like Madonna, Rolling Stones. They held a World Cup soccer game, the first ever World Cup game indoors. was that uh the silver dome.",
    "timestamp" : "10:14-10:28"
  },
  {
    "text" : "Wow.",
    "timestamp" : "10:28-10:28",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Greg",
    "text" : "Back in ninety four when the US had it. Yeah. So pretty cool, pretty cool history to the stadium. I mean the stadium looked pretty sweet too. I saw like old footage of when it was in its prime.",
    "timestamp" : "10:29-10:42"
  },
  {
    "timestamp" : "10:42-10:58",
    "speaker" : "Trevor",
    "text" : "Yeah. Yeah, it was it was cool. I mean it was just his massive playhouse for sports, right? Yeah. And even like back then, right? Seventy five. I think a lot of the bigger stadiums, well none were that big. So just the size alone was kind of like a like a wow factor."
  },
  {
    "speaker" : "Greg",
    "text" : "Yep.",
    "timestamp" : "10:58-10:59"
  },
  {
    "text" : "Then once once the Silverdome was no more Moving to Ford Field, they did like the exact opposite. Like it was like one of when they built it in 2002, I think it was like if it wasn't the smallest stadium in the NFL, it was top two or three and it's still like a top five small stadium. Uh 'cause towards the end the games kept getting blacked out.",
    "speaker" : "Trevor",
    "timestamp" : "10:59-11:23"
  },
  {
    "speaker" : "Andy",
    "text" : "Right.",
    "timestamp" : "11:23-11:23"
  },
  {
    "speaker" : "Trevor",
    "timestamp" : "11:24-11:38",
    "text" : "And they just they just couldn't fill it. Like it was such a massive stadium and they sucked for so long. They couldn't fill it. So games would be blacked out. That was like a major, major issue for like three or four seasons leading up to when they when they moved."
  },
  {
    "timestamp" : "11:38-11:41",
    "text" : "Yeah, yeah. Same with uh the Patriots back in the day. Pre-belly.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Trevor",
    "text" : "The game was blacked out. You had to listen on the radio.",
    "timestamp" : "11:42-11:44"
  },
  {
    "timestamp" : "11:45-11:54",
    "text" : "Yep, that's true. I remember doing that. Those 80s Patriots. Too many. Most of them.",
    "speaker" : "Andy"
  },
  {
    "text" : "So do you like Ford Field, Trevor?",
    "timestamp" : "11:56-11:59",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I uh it's a cool I mean like I said it was it was a cool stadium because it was the total opposite of Uh the Silverdome. So they when they built it, they tried to like center it on like a fan experience. And they thought they could do that with like a smaller space. And the location alone was kind of enough to get people excited because it's there's one street called Bush Street or Brush Street, one of the two. And it separates where the Tigers play, so Comerica Park, and then where Ford Field is. Yeah, so it's it's like if they were ever to get rid of Ford Field I think they would do what like the Vikings did where they would demolish their stadium and then build it back up. Where they didn't demolish it, it like, you know, collapsed. But they would there's no better spot to put that stadium. Like if you were You had to recreate it, right? I think they would just do it in that same spot. Yeah.",
    "timestamp" : "11:59-12:58",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Cause a lot of a lot of places are moving to that now. I mean like Philly, I know they have like all four of their major sports all within one complex.",
    "timestamp" : "12:58-13:07"
  },
  {
    "text" : "Baltimore is similar, kind of. Yeah.",
    "timestamp" : "13:07-13:10",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "13:13-13:15",
    "speaker" : "Greg",
    "text" : "Yeah. Down in Texas, right? I think that that's similar."
  },
  {
    "text" : "The Cowboys game is like",
    "speaker" : "Steve",
    "timestamp" : "13:16-13:17"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "13:18-13:22",
    "text" : "Yeah, from uh from the Rangers stadium. We can see it across the parking lot."
  },
  {
    "timestamp" : "13:22-13:27",
    "text" : "And in LA they just have every single uh sports team on the west coast play in the same stadium.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "And that's the soccer stadium.",
    "timestamp" : "13:27-13:29"
  },
  {
    "speaker" : "Trevor",
    "timestamp" : "13:39-14:10",
    "text" : "I think it was cool. I think they've done like little improvements, but eventually they sort of hit a wall because there's again it's like limited space with such a small stadium. But They've added like little corks here and there and like improved the the like the box seats and they've uh obviously with like the Fords owning it there's like Like the some of the executive seats are like this these like crazy nice like leather, like whatever top of the line Ford car is. They'll like actually have like the car seats in in the in the boxes."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh that's a good idea.",
    "timestamp" : "14:10-14:11"
  },
  {
    "text" : "Um",
    "timestamp" : "14:11-14:11",
    "speaker" : "Trevor"
  },
  {
    "timestamp" : "14:11-14:12",
    "speaker" : "Andy",
    "text" : "Like a chunky state."
  },
  {
    "speaker" : "Trevor",
    "text" : "Like brick looking. uh uh like m big like corridors or like hallways to give it kind of like a rustic like industrial like Henry Ford factory kind of look. Um so visually it's it's it's a pretty pretty cool looking stadium. Um But yeah.",
    "timestamp" : "14:18-14:37"
  },
  {
    "timestamp" : "14:40-14:44",
    "speaker" : "Greg",
    "text" : "Yeah, I almost went there. Are you uh are you a uh Michigan fan too?"
  },
  {
    "timestamp" : "14:45-14:47",
    "speaker" : "Trevor",
    "text" : "I'm I'm a Michigan State fan."
  },
  {
    "speaker" : "Greg",
    "text" : "Okay. All right. Cause I was last Thanksgiving. I I was I went to Chicago with my wife for work. And we were like, should we go to the Thanksgiving Day game? at uh Ford Field or Michigan Ohio State was also playing that weekend. Yeah. So we ended up going to Michigan, Ohio State. Which was I mean that stadium. Jesus fucking Christ. I mean that's a seats.",
    "timestamp" : "14:47-15:14"
  },
  {
    "text" : "It's it's just like a hundred thousand people. It is a a true bull.",
    "timestamp" : "15:22-15:27",
    "speaker" : "Trevor"
  },
  {
    "text" : "Yeah, Penn Sei was similar to where I think it was like a hundred and three thousand Seed Stadium. So it became the third biggest um third biggest city in the state on Saturdays during",
    "timestamp" : "15:27-15:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Trevor",
    "text" : "Yeah, yeah, with all the people that that come in for sure.",
    "timestamp" : "15:43-15:45"
  },
  {
    "text" : "Yeah. That was crazy.",
    "timestamp" : "15:45-15:46",
    "speaker" : "Andy"
  },
  {
    "text" : "Dude, I love I love stadiums. I love them. What's your favorite? And I don't care who knows it. My favorite stadium. Ooh, that's a good question, Andy. Let me think. Um dude, Cowboys Stadium. That one was pretty fucking sweet. All right. I mean I'm a small stadium guy. I think like a good small stadium with a lot of atmosphere. So I picked the biggest one I've been to.",
    "speaker" : "Greg",
    "timestamp" : "15:47-16:10"
  },
  {
    "text" : "Gaudy Stadium guy.",
    "timestamp" : "16:12-16:13",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "16:14-16:33",
    "speaker" : "Greg",
    "text" : "But that one was just like, I don't know, that was beautifully done with like the sun shining in through it. It's Yeah, yeah. That's a sight to see. You have to check that one out. Uh Ralph Wilson sucks. I really like Redskin Stadium. Yeah. You know what stadium blows is the Jets one."
  },
  {
    "speaker" : "Steve",
    "text" : "Mm-hmm. We talked about this already. Yeah, yeah. Just sucks. Nothing. Just in the middle of nowhere in despair. Yeah. Garbage. And the Jets play there, which doesn't really make Trevor cry about how much it sucks to be a Lions fan. Let's go. Come on.",
    "timestamp" : "16:33-16:54"
  },
  {
    "text" : "Ooh, okay. Alright, so yeah, let's let's get into this game, because two thousand two is It feels like peak. I I know they've been worse, but it just felt like peak Detroit Lions.",
    "timestamp" : "16:54-17:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "No, dude. This is probably a year of hope and optimism.",
    "timestamp" : "17:05-17:08"
  },
  {
    "text" : "Yeah, but I think what it means is is like I like prior to that, I think we had drafted uh a couple wide receivers. Shocking. And then, or it might have been right after that. We drafted right after. Like Charlie Rogers. Yep. Uh or Char Charles Rogers, right?",
    "timestamp" : "17:08-17:27",
    "speaker" : "Trevor"
  },
  {
    "text" : "And then there was I wrote this down. Yeah, so this is two thousand and two, so This was Harrington. Yeah, so then the next year they started that. They went Charles Rogers at two, Roy Williams at seven the year after, the year after Mike Williams at ten. And then two years after that, they finally hit with Calvin Johnson. So a top ten wide receiver in four start from the outside in.",
    "timestamp" : "17:27-17:54",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "17:54-17:56",
    "speaker" : "Trevor",
    "text" : "You work outside in. This is how you win."
  },
  {
    "speaker" : "Greg",
    "text" : "And then he retires early, just like Barry Sanders.",
    "timestamp" : "17:57-17:59"
  },
  {
    "timestamp" : "18:00-18:10",
    "speaker" : "Trevor",
    "text" : "It was, I think And Calvin Johnson like doesn't even he hates the line. He's like very, very open about it. He's not a not a Lions guy."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:11-18:12",
    "text" : "Isn't Barry Sanders similar?"
  },
  {
    "timestamp" : "18:13-18:38",
    "text" : "No, he's he's a big like I I love Detroit, love the Fords, love like the organization. Uh he's he's he's like big, big time Lions Detroit. Okay. Um yeah. But no, you're you're right. Like this was and watching a game, like you just you can feel it. And there's there's times When like Harrington's moving the ball down the field and you're like, wow, it's kind of rookie. Making a good throw.",
    "speaker" : "Trevor"
  },
  {
    "timestamp" : "18:38-18:39",
    "text" : "Yeah, he hit a couple.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "18:39-19:25",
    "speaker" : "Trevor",
    "text" : "We're like moving the ball a little bit. And then like something dumb happens. And like that, like the the build to like just drop is like that's what it means to be Alliance man. And that in like 2002, obviously like social media wasn't a thing. So you didn't have the ins and outs of like what actually happened in the organization, which I think helped the organization from looking less like it was just a total fucking disaster, right? Like now you can only be so bad at your job before like the rest of the world knows you're bad at the j your job, right? But then they had like a five year leash to be shitty at your job. But then people were like, okay, the process really isn't maybe we shouldn't have drafted all those wide receivers."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:25-19:26",
    "text" : "This didn't work, right?"
  },
  {
    "timestamp" : "19:27-19:33",
    "speaker" : "Trevor",
    "text" : "This was uh I think the prior year in 2001 there were they won two games."
  },
  {
    "text" : "Yeah, so this was this was an improvement where they won't give them.",
    "speaker" : "Andy",
    "timestamp" : "19:33-19:35"
  },
  {
    "text" : "Right, they won three and thirteen and improved from the year before. I actually have some like numbers on that, like that era. So so nineteen so Barry standards and that like uh Herman Moore, Scott Mitchell, that era ends around like nineteen ninety-nine ish yeah. So the the end of the end of Barry Sanders. Yeah, so 1996 is when they really started like they they had a win this was their first like losing season after the Barry Sanders stuff. So ninety-six through two thousand and ten. So they had fifteen straight seasons with single-digit wins. Uh 2000 through 2001 through 2009, they had a total of 33 wins in nine seasons. So there's less than four wins a year.",
    "timestamp" : "19:36-20:24",
    "speaker" : "Greg"
  },
  {
    "text" : "I wanna I want to put that in perspective. Uh in two years uh I don't know which uh in in two years the Patriots won thirty-four games. Yeah. Yeah So 30 yeah and then 2008 of course they go three oh four they they they won thirty-four games because they won twenty-one in a row and if you count playoff games they won thirty-four games in two seasons",
    "speaker" : "Andy",
    "timestamp" : "20:25-20:50"
  },
  {
    "text" : "And even if you like extend it to their franchise history, it's like kinda hilarious too. Like they have seventeen playoff appearances in franchise history. dating back to nineteen thirty-five. So this is before the merger and all that. And the Patriots have had seventeen since Tom Brady got drafted.",
    "timestamp" : "20:50-21:08",
    "speaker" : "Greg"
  },
  {
    "text" : "So people often say like, man I would really hate to be a Browns fan. Like it's tough. But if you look at the numbers, the Browns fan is actually a luxury Civil Lions fan. They have They have far more in this if you give the same time period of like nineteen ninety-five to to now, they've made the playoffs more and they have at least one playoff win.",
    "speaker" : "Trevor",
    "timestamp" : "21:09-21:34"
  },
  {
    "text" : "Yeah, you know who was coaching the Browns at that time? Uh right?",
    "timestamp" : "21:35-21:40",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:40-21:40",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Bill Beltrack.",
    "timestamp" : "21:41-21:41"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:42-21:45",
    "text" : "That's a hot take. And he beat the Pedro to be a Browns fan."
  },
  {
    "speaker" : "Andy",
    "text" : "Right, which is like we're gonna be able to do that. There's only one class of people that can say that though, right? Yeah.",
    "timestamp" : "21:45-21:50"
  },
  {
    "speaker" : "Trevor",
    "timestamp" : "21:50-21:56",
    "text" : "One of one. People in Detroit aren't even that far from each other too. It's like what, three hours? No. And like so"
  },
  {
    "speaker" : "Andy",
    "text" : "It's the ha it's the the hallway of sadness there.",
    "timestamp" : "21:57-21:59"
  },
  {
    "timestamp" : "22:00-22:02",
    "text" : "Yeah, it it really it really is.",
    "speaker" : "Trevor"
  },
  {
    "text" : "It's like a different kind of rust belt.",
    "speaker" : "Andy",
    "timestamp" : "22:04-22:06"
  },
  {
    "speaker" : "Trevor",
    "text" : "There's this there's a sense of like when the Browns do come into town or when um uh when the Lions play uh in Cleveland. There's like a sense of like, you know, like we really want to beat each other. But like at the end of the day, we all kind of look around and we're like, fuck, man, this shit sucks for everybody.",
    "timestamp" : "22:06-22:30"
  },
  {
    "text" : "I got a question.",
    "timestamp" : "22:30-22:31",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "22:32-22:35",
    "text" : "You understand my pain and I understand your pain.",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Greg",
    "text" : "Do you ever sneaky hope you lose those games? Just to be like, at least we're like the best at something, at like being the worst.",
    "timestamp" : "22:36-22:44"
  },
  {
    "timestamp" : "22:45-23:17",
    "text" : "Uh no. No, like they have that lunch. Well, it's the honest question. Yeah. I wanna win. You people they don't understand how bad. Like I I just I don't want to make the wild card. I want to actually just win the division for once. Like one year I wanna be like or in the playoffs. And when I don't have to go to Dallas or like San Francis or not San Francisco or Dallas or somebody like that. Like I don't have to watch just just the hopes crumble in a in a wild card, which was a good season. Nine wins.",
    "speaker" : "Trevor"
  },
  {
    "timestamp" : "23:19-23:53",
    "text" : "Which this this 2002 season is the the Patriots least amount of wins. for this whole era that we're doing a podcast for. You want to guess how many wins the Patriots had? Nine wins. Oh No, this is as bad as it gets. Shitty season, dude. Literally as bad as it gets. They had a four-game losing streak that we suffered through before you came on. And it's the longest losing streak of the past Yeah, we almost stopped watching. Yeah. We we struggled through it just because we knew you were coming on it.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "23:54-23:56",
    "speaker" : "Steve",
    "text" : "Have you ever had like maybe I should stop watching?"
  },
  {
    "text" : "Yeah, there's definitely been those times when you you kind of you look at yourself every Sunday and then like Sunday afternoon because we always get the the noon games because you know they're so bad. Like four o'clock rolls around and you're just like, what the fuck am I doing here? Like it's November 1st. And I we got two wins. And last year we had one win.",
    "speaker" : "Trevor",
    "timestamp" : "23:56-24:19"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "24:19-24:38",
    "text" : "Like what the fuck am I doing? See that's that's what I always wonder is like when the Patriots have always been good and like I'll watch any football But like when the Red Sox suck, I like I won't I just it's not worth my time to invest in the Red Sox when they're sucking."
  },
  {
    "timestamp" : "24:38-24:38",
    "speaker" : "Mom",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "But football's kind of different. So I've always wondered like if the Patriots are really bad, would I just start like Stop watching games every now and then. I don't know.",
    "timestamp" : "24:38-24:46"
  },
  {
    "text" : "Yeah, so that's that's definitely like uh like football in general is just so like if you're a big sports guy, that's one thing, but to be like you know, football fan, I think it's it's another, right? And it's once a week. It's not like you're watching you said the Red Sox or the Tigers and they're even if they're bad. You know, like all right, well, I'll put the alerts on my phone and check out the scores, but I don't have to sit down and watch it right. It's not as much of a commitment. The Lions, it's like an it's like our any football team. It's an event, right? It's once a week. Sit down, watch it, drink some beers. But yeah, it just I it's it sucks like losing sucks. I don't think anybody is like no nobody gets excited about it. But the the real the real shitty thing is, and you only you only realize this after I think the age of like Maybe like 26, 27, right? Like I'm I'm 28 right now. And I I the something I have no control over, like how the lions play on on Sunday. significantly affects my mood on like Monday, like kind of going into Tuesday And then like by Wednesday, like I read the practice report and like I'm I'm back. I'm all in I get sucked back in. But like as a grown man, like I It's like the team significantly affects my mood for like twenty-four, maybe thirty-six hours.",
    "timestamp" : "24:47-26:11",
    "speaker" : "Trevor"
  },
  {
    "timestamp" : "26:12-26:13",
    "speaker" : "Greg",
    "text" : "It's true."
  },
  {
    "text" : "Nothing you can do about it.",
    "speaker" : "Steve",
    "timestamp" : "26:13-26:14"
  },
  {
    "text" : "I'm kind of scared of that.",
    "speaker" : "Greg",
    "timestamp" : "26:14-26:16"
  },
  {
    "timestamp" : "26:17-26:19",
    "speaker" : "Andy",
    "text" : "Yeah, I I've been the same way."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "26:20-26:20"
  },
  {
    "timestamp" : "26:20-26:21",
    "speaker" : "Andy",
    "text" : "And the pages haven't."
  },
  {
    "text" : "But they've they've always been good, so it's like it's manageable because 90% of the time you're in a good mood on Monday.",
    "timestamp" : "26:22-26:27",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Actually it's it's more like 80%, but still. Well it's excuse.",
    "timestamp" : "26:27-26:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Well actually still And the the the thing is like it's funny, right?",
    "timestamp" : "26:34-26:39"
  },
  {
    "timestamp" : "26:39-27:29",
    "speaker" : "Trevor",
    "text" : "Because if you were to go back in time in 2002 and be like, man, like we kinda We really suck, but like sports are cyclical. That's like kind of what you always tell yourself that like it's gonna come back around. And it's like it's two, you know, it's almost 20 years later and we're we're still in that same Like maybe not that bottom three. Like we were last year, but Stafford got hurt, whatever. But it's like they haven't gotten better. Like we've had the revolving door of coaches and and like management has changed. So like it hasn't gotten better. And like that alone is I think it's really hard to stink and like steer a ship in the wrong direction for for so long without one guy being like It's not that hard. I think I can do this the right way. And that just hasn't happened, right?"
  },
  {
    "timestamp" : "27:29-27:33",
    "text" : "Like that Yeah, you haven't even like fallen into it by accident or anything.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Trevor",
    "text" : "No It's it's wild. I had uh I had a tweet like two years ago, and I think I retweet it every year and I it sums up if the tweet is my lions fanhood summed up. In August, I say our year. Like I training camp, you hear all the positive stories, you read into the beat writers, you're thinking like This is our year. We're due.",
    "timestamp" : "27:33-27:59"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:59-28:00",
    "text" : "I feel it."
  },
  {
    "speaker" : "Trevor",
    "text" : "October rolls. Yeah, I feel it too. October rolls around. And Well, you know, some things we've kind of fallen off a little bit, but it's October, so we still got a chance because of Stafford. As long as he's healthy, we got a chance. Thanksgiving. And then I usually tweet out that that meme from the water boy of that guy that says like, we suck again. And that always happens every year. And it's Thanksgiving because we always lose that game and it's like the the wheels fall off. January happens and recently I hate the Patriots. Because you guys are always there.",
    "timestamp" : "28:00-28:39"
  },
  {
    "timestamp" : "28:40-28:46",
    "speaker" : "Greg",
    "text" : "That's fair. Wasn't it Mitch Trubisky this year that uh smoked you guys on Thanksgiving?"
  },
  {
    "text" : "Yeah. Like it was like people were talking about him losing his job. Um like man, this guy, like he's really not the future. And he walked in on Thanksgiving Day through like for 250 and like three touchdowns.",
    "speaker" : "Trevor",
    "timestamp" : "28:46-28:59"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah, yeah, yeah. Oops. I'm gonna look that up because I think it was even worse than that.",
    "timestamp" : "29:00-29:06"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Wait, well I thought it was their backup, wasn't it?",
    "timestamp" : "29:07-29:10"
  },
  {
    "timestamp" : "29:10-29:25",
    "speaker" : "Greg",
    "text" : "It was Detroit's backup. Oh that's right, that's right. Yeah So uh twenty-nine of thirty, this is Mitch Trubisky on Thanksgiving last year. Mitch Trubisky. Yeah. Twenty-nine of thirty-eight for three hundred thirty-eight yards and three touchdowns."
  },
  {
    "text" : "That's such a slot. That guy did anything he wanted to do with the football that day.",
    "timestamp" : "29:26-29:29",
    "speaker" : "Trevor"
  },
  {
    "text" : "How do you feel about Matt Patricia?",
    "speaker" : "Steve",
    "timestamp" : "29:33-29:34"
  },
  {
    "timestamp" : "29:36-30:23",
    "speaker" : "Trevor",
    "text" : "I was a big I was on his side for the first year a hundred percent. Last year It's it's hard to win without your franchise quarterback and not being a set team to win the Super Bowl. Like if you're set up to win the Super Bowl I think you have enough pieces to where you can get by with a game manager, but when your team really stinks, you can't, right? The quarterback position, it's all it's been the story of Stafford's career. If you remove him from the situation. We're fighting Owen 16 every single year. I think he makes that big of a difference. Sure. So this year is the year for me that's gonna tilt Am I a Patricia guy or not? Right now I still give him the benefit of the doubt."
  },
  {
    "text" : "He's in the August phase, guys. This year is gonna be different. Matt's tap or nine-year veteran. This is gonna be the Uh he can do it.",
    "timestamp" : "30:23-30:34",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "30:34-30:55",
    "speaker" : "Trevor",
    "text" : "Yeah, I know. And like you get excited again 'cause the draft rolls around and you get excited because you're always in like the top five or even top ten. So you're getting like a something new and shiny So you're like this is this guy's our we needed one more piece and he is it. This this guy's gonna be the difference maker. And then we're not."
  },
  {
    "timestamp" : "30:56-31:00",
    "text" : "Speaking of Joey Harrington. They're they're not that bad this year.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "31:01-31:03",
    "text" : "No, no. They could do us in August mode.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:04-31:27",
    "speaker" : "Trevor",
    "text" : "Yeah. On paper they're not they're they aren't. It's just it's There's like you always have this like looming like something something's gonna happen And it's not good like you never get a break It's always like S Stafford might roll his ankle, run it out of the tunnel, or like something like that, right? Yeah. Like"
  },
  {
    "speaker" : "Greg",
    "text" : "This is the year. Nope. Trevor Burrus, this is the year, man. You should get yourself all worked up and lathered up about the 2020 Detroit Lions. You know what it was? It was the fans. They were hurting the team. Let me just get rid of them. Yeah.",
    "timestamp" : "31:29-31:42"
  },
  {
    "timestamp" : "31:46-32:04",
    "speaker" : "Trevor",
    "text" : "This would be like I don't know what like uh you know like what the future's gonna be like with COVID and stuff like that, but Uh all part of me will be very upset if like COVID's still very much like around and the Lions do win the Super Bowl. And when that happens, we can't have a parade. There's no celebration."
  },
  {
    "timestamp" : "32:04-32:05",
    "speaker" : "Greg",
    "text" : "Oh my god."
  },
  {
    "timestamp" : "32:05-32:10",
    "speaker" : "Trevor",
    "text" : "There's no group. You kind of just look at each other and you're like, Hey, we did it."
  },
  {
    "speaker" : "Greg",
    "text" : "This is what everybody feels like. You guys should vote for the Patriots this year, just because for us it'll be like, well, we you know Celebrated those other years.",
    "timestamp" : "32:12-32:19"
  },
  {
    "timestamp" : "32:20-32:28",
    "text" : "Not gonna lie, there's already been talk about w what are they gonna do with the duck boats this year if one of the Boston teams wins another championship. Dude.",
    "speaker" : "Andy"
  },
  {
    "text" : "I love that. I love that confidence.",
    "speaker" : "Trevor",
    "timestamp" : "32:28-32:30"
  },
  {
    "timestamp" : "32:31-32:31",
    "text" : "Why not?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "32:32-32:42",
    "speaker" : "Trevor",
    "text" : "I agree. When then why not? Statistically, yeah, there's a good chance one of the four will win it. Yeah. Plus with the you know the Brones are in the second they're they're in the second round, right? Celtics too."
  },
  {
    "timestamp" : "32:42-32:48",
    "text" : "Yep, Celtics. Yep. Alright, let's get to this game.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. So I just want one more thing about this this uh this Lions team. This We've been doing this for almost two full seasons and I do uh a write-up of like I do a deep dive on all the the players and everything. This is the first time we've seen an opponent. where they didn't have a pro bowler on the team. Really?",
    "timestamp" : "32:48-33:12"
  },
  {
    "timestamp" : "33:12-33:13",
    "text" : "That's tough.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "33:13-33:14",
    "text" : "Nobody on this team made the pro bowler.",
    "speaker" : "Andy"
  },
  {
    "text" : "That's interesting.",
    "speaker" : "Greg",
    "timestamp" : "33:14-33:15"
  },
  {
    "text" : "I feel like everybody gets like a pity vote, no?",
    "timestamp" : "33:16-33:18",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "33:19-33:23",
    "text" : "I'm trying to think of the closest the closest guys."
  },
  {
    "timestamp" : "33:24-33:37",
    "text" : "Um some there was a there's a I can't think of his name. He's escaping me. You guys probably know if you have the I don't have the roster pulled up and I should, but There's a a dude on the D line that that's pretty talented. Just in terms of like overall Porsche.",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Andy",
    "text" : "Robert Porsche.",
    "timestamp" : "33:38-33:38"
  },
  {
    "timestamp" : "33:39-33:44",
    "speaker" : "Trevor",
    "text" : "Yeah. He's he's up there in like just Who's who is one of the better players on our team?"
  },
  {
    "text" : "Him and Chris Blackborne, I think, on that defense. I have his jersey for some reason.",
    "timestamp" : "33:44-33:48",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Trevor",
    "text" : "Hanson really Hanson, um I'm surprised.",
    "timestamp" : "33:48-33:53"
  },
  {
    "timestamp" : "33:53-34:04",
    "speaker" : "Greg",
    "text" : "Don't go kicker. Don't do it. He won it. Like he was one of the best in the league. Don't do it. Kickers one step away from the punter, dude. Don't do it."
  },
  {
    "text" : "Well that's what I'm saying. If you're three and thirteen, you think your punter would have the numbers to get in the Pro Bowl. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "34:05-34:10"
  },
  {
    "timestamp" : "34:10-34:11",
    "text" : "Oh god.",
    "speaker" : "Greg"
  },
  {
    "text" : "Sean Rogers, he was Yeah, Sean Rogers actually that's the dude I was thinking of. But maybe maybe he I don't know what year he was in in Two thousand two. So maybe he made it later on in the year or maybe in his career. Um Yeah. Skill position though, they were they were pretty bare. Yeah.",
    "timestamp" : "34:11-34:32",
    "speaker" : "Trevor"
  },
  {
    "text" : "Yes. They just signed Schrodinger Schrdinger and Hakeem as a Hakeem. Yeah. Yeah, it's signings. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "34:32-34:42"
  },
  {
    "speaker" : "Andy",
    "text" : "I'd say here. Uh yeah, and James Stewart, I thought, was probably the only bright spot on this offense. He ran for over a thousand yards and four whole touchdowns. So good for him. Uh Joey Harrington would be the starter for I think most of the year, even though they were talking about they had drafted some guy last year. The first round some quarterback? Yeah. McSumthner or there.",
    "timestamp" : "34:42-35:14"
  },
  {
    "speaker" : "Steve",
    "text" : "Mike McCann",
    "timestamp" : "35:14-35:15"
  },
  {
    "timestamp" : "35:17-35:22",
    "speaker" : "Greg",
    "text" : "He was the backup. Yeah, I thought he was related to I thought he was related to that uh the guy from the Bears."
  },
  {
    "speaker" : "Andy",
    "text" : "Jim McMahon, yeah.",
    "timestamp" : "35:23-35:24"
  },
  {
    "text" : "That's what I thought, but no. Jim McMahon. Because he looks just like him too. Yeah. Joey Harrington.",
    "speaker" : "Greg",
    "timestamp" : "35:24-35:30"
  },
  {
    "speaker" : "Andy",
    "text" : "Through for not quite twenty three hundred yards. Twelve touchdowns, sixteen interceptions And just a bit off that Pro Bowl. Yeah.",
    "timestamp" : "35:30-35:41"
  },
  {
    "text" : "And the crazy part is the crazy part is their defense was worse than their offense. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "35:41-35:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "35:49-35:50"
  },
  {
    "text" : "If you look at their league stand where they stood in the league for so for yards, they were twenty-eighth in offense and thirty-first in defense. So so not where they they were just bad across the board. Yeah.",
    "timestamp" : "35:50-36:06",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but the kicker, dude.",
    "timestamp" : "36:06-36:07"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yes. But Hansen. But Hansen.",
    "timestamp" : "36:08-36:10"
  },
  {
    "speaker" : "Trevor",
    "text" : "He was uh he's in one of the all-time like point scores for Detroit. He said that he broke that. He said it this game. Was it this game? Yep. He broke that. That was like that was like front page news. I remember that. That was big stuff back then. Well yeah, they probably weren't talking about this game. No. No. One bright spot.",
    "timestamp" : "36:11-36:29"
  },
  {
    "timestamp" : "36:30-36:32",
    "speaker" : "Steve",
    "text" : "Page two, Joey Harrington throws four interceptions."
  },
  {
    "speaker" : "Trevor",
    "text" : "The the the thing about Harrington, and this like followed him throughout his career too, is I actually do think he he was talented enough to to be successful in the NFL back then, because I think he was a little bit ahead of his time in terms of uh being like mobile but also like having like a a pr a pretty s strong arm, right? Like that's what made him like a top pick. The problem was just, I think, mismanaging. I think he had literally no leash. Like it was just, all right, Joey, go out there and just Kind of do your thing, right? And you can see it in this game.",
    "timestamp" : "36:33-37:06"
  },
  {
    "text" : "And he has no help around him either.",
    "timestamp" : "37:07-37:08",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Trevor",
    "text" : "Right. So he just got caught trying to do way too much.",
    "timestamp" : "37:08-37:12"
  },
  {
    "timestamp" : "37:12-37:13",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "speaker" : "Trevor",
    "timestamp" : "37:13-37:41",
    "text" : "And I think of when you're in the NFL, like psychologically Like that takes a toll on you event like year after year after year. And then the fans just they blame you for problems that aren't really yours. You're just trying to go out and win, right? And uh So it's a little bit of he got caught in a bad situation, I think. And I I think you see it in this game. Like he does make some really good throws. He just makes some really bad decisions that a rookie's gonna make."
  },
  {
    "text" : "Right. Um yeah, cause he threw a like what he should have like a busted screen pass where you always see Tom Brady just fucking throw it into the dirt right in front of his feet. He threw an interception on one of those, just trying to force it. Yeah, to a defensive line. And he throws in the dirt and the fans boom. Yeah. We're talking like twelve starts maximum for your look.",
    "timestamp" : "37:42-38:04",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "No, no, didn't they? They gave him like a standing O when he did it. But it was like a sarcastic one.",
    "timestamp" : "38:05-38:10"
  },
  {
    "text" : "So it's it's brutal, right? Just just try being that dude. And he was always very vocal about it. I wanna I'm I'm gonna be the guy who who brings the team back. Like I'm gonna be that franchise star, that stud. Right. This is gonna be my legacy. And it like People took that and they like made fun of him for it. It's like you just feel bad. Like which Jesus.",
    "timestamp" : "38:12-38:34",
    "speaker" : "Trevor"
  },
  {
    "text" : "It kind of almost has a similar feel to like Drew Bledsoe back in the day. day. Like he was supposed to be that face of the franchise. And I think he was a bit more successful, maybe because he had more weapons or whatever.",
    "speaker" : "Andy",
    "timestamp" : "38:35-38:46"
  },
  {
    "speaker" : "Steve",
    "text" : "He had better coaching or better stuff around him.",
    "timestamp" : "38:47-38:50"
  },
  {
    "speaker" : "Andy",
    "text" : "But yeah, exactly. But he was always kind of criticized for trying to do too much. Like he's getting sacked and he's throwing the ball over his shoulder backwards blind, sort of thing. And it feels like Harrington is in a similar situation, but dealt with it kind of the same way.",
    "timestamp" : "38:50-39:07"
  },
  {
    "timestamp" : "39:07-39:35",
    "text" : "Yeah. Through his own definition. I thought David Carr is a similar situation where I if I think if situations were different they'd be a good quarterback, but the it's just like uh with everything else working against you, you have no chance in the NFL. I think it doesn't I I honestly think uh there's a ton of quarterbacks that get stuck in shitty situations. Oh god, yeah. And that's their defining career because you only get so much time to prove yourself in the NFL.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but like Brian Hoyer is the flip side. Oh yeah, that's true. I was gonna say look at literally any Jets quarterback.",
    "timestamp" : "39:36-39:44"
  },
  {
    "timestamp" : "39:45-39:58",
    "text" : "The Browns. Like how many people are on that jersey that they have? You mean to tell me all those quarterbacks are terrible? Or is it the fucking organization that sucks? You know? Yeah. I mean I'm gonna say Cory Detmer was terrible, but yes.",
    "speaker" : "Greg"
  },
  {
    "text" : "That's why I always definitely sucked. You always hear fans talk about like, well, like our quarterback sucks. It's fine. Just get him out of here and like we'll rotate a new one in. And I'm always like, whoa, whoa, whoa. Trust me, that that quarterback carousel, it's not a fun ride to be on there, brother. Like you don't like You just wanna like he's not the only reason you stink. Yeah. You're just blaming you know, you're kinda pointing the gun at him. But like, oh, I don't know, maybe if you spent some money on your offensive line instead of paying a receiver eighty million dollars over the next six tiers, might be a little better.",
    "timestamp" : "39:58-40:31",
    "speaker" : "Trevor"
  },
  {
    "text" : "Ryan Tannehill.",
    "speaker" : "Greg",
    "timestamp" : "40:32-40:34"
  },
  {
    "text" : "So uh speaking of Joey Harrington though, there was a few things That I found interesting, at least in this game. The first was uh I don't know if this was Who was it yeah? Who was it that you're gonna be?",
    "timestamp" : "40:40-40:54",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "40:55-41:05",
    "speaker" : "Greg",
    "text" : "Yeah, it organizes his clothes. What a fucking user. Nice bullet points, Andy. You're calling someone a nerd in your notes that you wrote up Who better?"
  },
  {
    "text" : "You guys see this? He's calling someone a nerd. He's calling Jilly Harry. Show notes.",
    "speaker" : "Andy",
    "timestamp" : "41:07-41:11"
  },
  {
    "text" : "Yes. Who better? Show notes organized by person with like links to the timestamped YouTube in it. Are you done? You want to hear why the fucking word knock him his head. You're shitting on Marty Morningwig's looks, Andy?",
    "timestamp" : "41:11-41:29",
    "speaker" : "Steve"
  },
  {
    "text" : "Come on, dude, he lost his job at the end of this year. Yeah. Have a heart. Here's why. The biggest key for us on offense today is to convert third downs. If you look at the statistics, the team's chances of scoring goes up sixty-two percent If you convert one third down during a drive, we need to be efficient and make plays on third down today.",
    "timestamp" : "41:29-41:48",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Greg",
    "text" : "What a nerd. You're right, dude. He is a fucking nerd.",
    "timestamp" : "41:49-41:54"
  },
  {
    "timestamp" : "41:54-42:20",
    "speaker" : "Andy",
    "text" : "Every every t every time uh an offense converts a a third down, their chance of score a touchdown goes up sixty-three point two percent. Uh the standard deviation from first down to sec second down. And also they mentioned that uh And that Joey Harrington of all people ran a more he said he ran a more complicated offense in college than he does now, which Oh yeah, I noticed that too. Don't know if that says a lot about the Lions offense. Ready to go to school Oregon?"
  },
  {
    "text" : "Oregon, yeah.",
    "timestamp" : "42:21-42:21",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:21-42:23",
    "text" : "I don't know if that's a lot about Joey Harrington."
  },
  {
    "text" : "And that was like before Oregon was like",
    "timestamp" : "42:24-42:26",
    "speaker" : "Trevor"
  },
  {
    "timestamp" : "42:27-42:27",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Trevor",
    "text" : "Big popular university, right? They're still just kinda like Pac twelve, sort of irrelevant, sort of good, but Like no flash. Yeah.",
    "timestamp" : "42:28-42:36"
  },
  {
    "timestamp" : "42:36-42:53",
    "speaker" : "Greg",
    "text" : "Did you the the guy that the charges draft, did you hear that? And the they were asking him about it? Like he's the guy from the quarterback from Oregon, Herbert. Yeah. And they were like, who who do you like compare your game to? He's like, uh Joey Harrington. And they were like, um Oops. Are you sure?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:54-42:56",
    "text" : "Uh Marion, Mary."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "42:57-43:14",
    "text" : "Weird. Weird, weird, weird move. Are you sure? But he's like bo they're both born and bred like Oregon guys. Yeah. Like they they're from that region. So I think he's still like uh like pretty well respected in like the Oregon community, you know. I think so I think so too."
  },
  {
    "speaker" : "Trevor",
    "timestamp" : "43:15-43:39",
    "text" : "And again, like I I think when a lot of people look back on it They they blamed Joey less and less and less and started again realizing that it was he was sort of set up to fail. Yeah. And then especially if you've already got super high hopes for them, you're from that area. Anyone, you know, Oregon coaching staff, like big fan of Oregon, whatever, they obviously give them the benefit of the doubt."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Well I think that's a perfect segue into Marty Morningwig. Um because you're right, I know you guys read my note, but that haircut does make it look like he has a comb over in the back of his head. I don't know how he did that.",
    "timestamp" : "43:42-43:55"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:56-44:01",
    "text" : "But I didn't notice that, Andy. No."
  },
  {
    "text" : "Who was it?",
    "timestamp" : "44:01-44:02",
    "speaker" : "Greg"
  },
  {
    "text" : "Um Steve Mariucci.",
    "timestamp" : "44:03-44:05",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, the moose. That's right. That's right.",
    "timestamp" : "44:05-44:08"
  },
  {
    "text" : "And people people really thought he was the savior. Like they that was when the hot the hopes were. Through the roof on this.",
    "timestamp" : "44:08-44:17",
    "speaker" : "Trevor"
  },
  {
    "timestamp" : "44:19-44:21",
    "speaker" : "Steve",
    "text" : "Post Niners Moochie?"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "44:21-44:21",
    "speaker" : "Trevor"
  },
  {
    "text" : "Do you know why? The Panthers with George Seaford, too. Same sort of thing. Oh yeah. Lot a lot of failed 49ers coaches, similar to the Patriots coaching staff lately.",
    "speaker" : "Andy",
    "timestamp" : "44:25-44:36"
  },
  {
    "speaker" : "Greg",
    "text" : "D I he looked like um uh what's the guy the the st uh Many. Doesn't he look like Man Genie? Yeah he definitely looks like Man Gini.",
    "timestamp" : "44:37-44:48"
  },
  {
    "text" : "Manjini with bad hair, which is tough to do.",
    "speaker" : "Andy",
    "timestamp" : "44:48-44:51"
  },
  {
    "text" : "But not as fat.",
    "timestamp" : "44:51-44:52",
    "speaker" : "Steve"
  },
  {
    "text" : "True, yeah. Um, so I think that may this this to me is probably why He got fired.",
    "speaker" : "Andy",
    "timestamp" : "44:53-45:02"
  },
  {
    "speaker" : "Steve",
    "text" : "Coach a lot of pressure on your quarterback. 11 hurries. How do you get Joey calmed down and turned around here in the second half?",
    "timestamp" : "45:03-45:08"
  },
  {
    "speaker" : "Speaker 6",
    "text" : "Well, really, we rushed a few of them. Uh they're a pressure defense. You know, we threw a bunch of interceptions. Without the interceptions, geez, it's a close football game. So I'll calm him down here at halftime. He took took us down there for a two-minute drive for three points. All right coach, thank you. Good luck.",
    "timestamp" : "45:08-45:25"
  },
  {
    "timestamp" : "45:26-45:28",
    "speaker" : "Trevor",
    "text" : "That guy belongs to coaching kindergartners."
  },
  {
    "speaker" : "Greg",
    "text" : "There would be milkers, I tell you guys.",
    "timestamp" : "45:35-45:36"
  },
  {
    "speaker" : "Trevor",
    "text" : "Can you imagine walking in on Thanksgiving for millions of people? That dude walks in. At halftime is supposed to fire you up. That guy looks like the dude that's supposed to fix something because your helmet broke. Or like, oh shit, the plumbing's backed up. We gotta call Carl again. And he comes in and he's like, oh gosh darn dude guys, let me go help you.",
    "timestamp" : "45:39-45:55"
  },
  {
    "text" : "That's nightmares. That's nightmare fuel.",
    "speaker" : "Greg",
    "timestamp" : "46:00-46:02"
  },
  {
    "text" : "But like i if there was a movie made about him, it would be played by Chevy Chase putting on a really, really bad accent. Yeah.",
    "timestamp" : "46:03-46:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "46:11-46:11"
  },
  {
    "timestamp" : "46:11-46:13",
    "text" : "It's that character.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he's like a he's like a stereotypical like Midwestern like happy go lucky.",
    "timestamp" : "46:13-46:21"
  },
  {
    "text" : "Not a care in the world.",
    "speaker" : "Trevor",
    "timestamp" : "46:21-46:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:23-46:26",
    "text" : "I think you guys are shucking corn wrong. Let me show you how to do it."
  },
  {
    "text" : "He goes he that dude goes home and his like his wife doesn't watch she's not a football fan. So she goes home and she's like, how was work? And he was like, was it tough day? Yeah, we lost again. Uh but we're getting better.",
    "timestamp" : "46:26-46:38",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Mom",
    "timestamp" : "46:39-46:40",
    "text" : "And she doesn't know what that means."
  },
  {
    "timestamp" : "46:41-46:56",
    "speaker" : "Greg",
    "text" : "And then she controls the remote because he's a pussy in a puck. He just watches Housewives of fucking Ohio. Yeah. Housewives of fuck. I don't know. Nobody respects that dude."
  },
  {
    "speaker" : "Trevor",
    "timestamp" : "46:57-47:14",
    "text" : "Housewives of Michigan. Like he'd have his clipboard out and people would walk by and they'd they'd they'd fuck they'd just smash it. This is the old like they'd put his finger on the chest and kind of flick your nose. They do that to him all the time. They don't let him have a whistle. They'd hide it."
  },
  {
    "text" : "It's just a dog whistle, no one can hear it.",
    "timestamp" : "47:16-47:19",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "47:25-47:31",
    "speaker" : "Andy",
    "text" : "Which I think all the uh Poor Marty. All the penalties kind of make sense now, right? After hearing that."
  },
  {
    "speaker" : "Steve",
    "text" : "Yes. Which led to a huge return from Branch. Branch, right?",
    "timestamp" : "47:40-47:43"
  },
  {
    "text" : "Yes, from Dion Branch, yep.",
    "timestamp" : "47:43-47:45",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh that was after their first right at the end of the first quarter. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "47:45-47:49"
  },
  {
    "text" : "Yeah. After their first field goal.",
    "timestamp" : "47:49-47:51",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:51-47:51",
    "speaker" : "Steve",
    "text" : "Yep."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:51-47:56",
    "text" : "They settled for a lot of field goals in this game, all four of them. Very consistent."
  },
  {
    "text" : "Did you see him break down to make the tackle on Dion Branch? Yeah, they had that highlight in the highlight.",
    "speaker" : "Steve",
    "timestamp" : "48:00-48:06"
  },
  {
    "speaker" : "Andy",
    "text" : "That's generous.",
    "timestamp" : "48:06-48:08"
  },
  {
    "text" : "But it looked like me out there trying to make a tackle. I think I figured it out.",
    "timestamp" : "48:09-48:19",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Trevor",
    "text" : "I I was an intern with the Lions before I actually started working at Billy Casper Golf. Really? They did a bunch of like kids camps. That was like it was like the they call it their football education department. Which is pretty cool. Basically you go around and the lines set up uh camps for like little kids like around the state. Um and it's super cool. I think a lot of teams in the NFL. You know, they they have that that program or aspect of their their business set up, right? And uh so a lot of times they they'd invite either current players um like rookies that are just getting started or they'll do like alumni players. So they had like Herman Moore come out one one one week for camp which was cool. He's he's a super cool guy, super great with the kids. Uh and then there was Jason Hanson who also came out to one of the bigger camps at Ford Fields. And uh super cool guy. He was like the epitome of like a kicker. Like he just was kind of like super goofy, joking around. Uh he kept saying like everything was tight. Like he did the old guy thing where he's like he would move the drill and he'd be like tight And but then you see him on the sideline like working on his golf swing, like with Oswald. Um and I was like kind of nervous to talk to him, but I was at a station with him. And uh he was a he was a he was a cool guy. He uh he would kinda fuck with the kids a little bit, but yeah. Do you mean Barry Sanders? No, I've I've gone to like him like speaking, you know, like uh he things that he's like spoken at. Um and the guys within like my boss at the time and other dudes that I've worked with, they've they had a chance to meet him a bunch of times and they said he's kind of as advertised, super cool dude, down to earth.",
    "timestamp" : "48:20-50:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Super humble.",
    "timestamp" : "50:08-50:09"
  },
  {
    "speaker" : "Trevor",
    "timestamp" : "50:09-50:11",
    "text" : "Yeah. Very, very humble."
  },
  {
    "text" : "So I just want to say that um the Detroit Lions putting on football education anything is like this podcast putting on Anything educational. It was just the wrong people to do it.",
    "speaker" : "Andy",
    "timestamp" : "50:11-50:23"
  },
  {
    "text" : "You know what's even funnier is they they were like They're like one of the first. They like kind of are like pioneering this business structure of God for like other NFL teams that are now reaching out to the Lions to say like how do we set up Something similar for our team. They like they kind of pioneered it.",
    "timestamp" : "50:23-50:43",
    "speaker" : "Trevor"
  },
  {
    "timestamp" : "50:43-50:49",
    "text" : "What's the quote? Those that can do and those that can't teach, right? There it is.",
    "speaker" : "Andy"
  },
  {
    "text" : "Marty Morningwig's in charge.",
    "timestamp" : "50:52-50:54",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "51:02-51:07",
    "speaker" : "Greg",
    "text" : "You're 92%. Better chance of winning. All the kids are fucking breaking down."
  },
  {
    "text" : "No, they're not. Shut up, Joey. Grown men on my Joey.",
    "timestamp" : "51:09-51:13",
    "speaker" : "Andy"
  },
  {
    "text" : "I can't believe they allowed that at the beginning. Just him to rattle off some facts. Maybe you spent a little more time in the in the playbook rather than crunching numbers. I would throw four interceptions there, Joe.",
    "timestamp" : "51:13-51:25",
    "speaker" : "Trevor"
  },
  {
    "timestamp" : "51:25-51:33",
    "text" : "I feel like I've never seen anybody throw I actually wrote this down I've never seen anybody throw so many almost interceptions.",
    "speaker" : "Andy"
  },
  {
    "text" : "There's a bunch of tips in that game too. Yeah.",
    "timestamp" : "51:34-51:36",
    "speaker" : "Trevor"
  },
  {
    "text" : "They yeah, like every single incompletion was tipped at least twice.",
    "timestamp" : "51:36-51:39",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Went the other way though. We had that one sick tip to uh I think it was Dion as well.",
    "timestamp" : "51:40-51:47"
  },
  {
    "text" : "That's true, yeah. Uh it was Patton. He like this.",
    "timestamp" : "51:47-51:50",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:50-51:51",
    "text" : "Yeah, yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Trevor",
    "text" : "That was like on a turn. It was like on like a big third down. Like two. Yeah.",
    "timestamp" : "51:53-51:57"
  },
  {
    "text" : "But that's that kind of dichotomy between the Patriots and the and the Lions, like right there. Exactly. How many how many balls got tipped in this entire game and When a Patriots ball gets tipped, it gets caught by a Patriot. Like a big game. When a lion's ball gets tipped, it's an incompletion or at best an interception.",
    "speaker" : "Andy",
    "timestamp" : "51:57-52:15"
  },
  {
    "timestamp" : "52:16-52:20",
    "speaker" : "Trevor",
    "text" : "Yeah. It's uh It's that's the that's that's the epitome."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh boy.",
    "timestamp" : "52:23-52:24"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:24-52:34",
    "text" : "So I was on Morningweg's uh Wikipedia. Yeah. Seems like he got into a little bit of trouble back in college."
  },
  {
    "speaker" : "Trevor",
    "timestamp" : "52:34-52:36",
    "text" : "A little bit of a bad boy? Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:36-52:38",
    "text" : "I was gonna bring this up if you didn't"
  },
  {
    "text" : "Oh. Montana suspends two starters. Did you l did you bring up the article, Andy?",
    "speaker" : "Greg",
    "timestamp" : "52:38-52:44"
  },
  {
    "speaker" : "Andy",
    "text" : "No, I just saw that he got uh He was academically suspended or something like that for a year in California. That's what it looks like.",
    "timestamp" : "52:44-52:50"
  },
  {
    "speaker" : "Greg",
    "text" : "Whoa. He was. He was a four-year starter at Montana, the big Grizz. Well, three.",
    "timestamp" : "52:53-53:00"
  },
  {
    "speaker" : "Steve",
    "text" : "Did he like not say thank you one time or something?",
    "timestamp" : "53:01-53:03"
  },
  {
    "speaker" : "Trevor",
    "text" : "No. He probably like it was like finger painting something and he hung it up. And it just it was it was like a big dick. So they just were like, this this can't count.",
    "timestamp" : "53:03-53:13"
  },
  {
    "speaker" : "Andy",
    "text" : "But it was by accident.",
    "timestamp" : "53:14-53:15"
  },
  {
    "text" : "Yeah, yeah, yeah. He was like, I swear, I swear, it was a rocket ship.",
    "timestamp" : "53:16-53:19",
    "speaker" : "Trevor"
  },
  {
    "text" : "I'm dressed that bad. Those are flames, not pew bears.",
    "timestamp" : "53:20-53:25",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "53:26-53:36",
    "speaker" : "Greg",
    "text" : "He's probably finger banging the coach's wife is what he said. And the Detroit lines are like you. I'm on the other side. I think fucking waterwegs hiding something. Slow playing us"
  },
  {
    "text" : "The Detroit Lions like no, you know what? You you're in charge. So usually we are we actually haven't done this yet. Usually we give a uh watchability score for those games. Um Trevor, did you watch the whole game?",
    "speaker" : "Andy",
    "timestamp" : "53:37-54:01"
  },
  {
    "speaker" : "Trevor",
    "timestamp" : "54:01-54:05",
    "text" : "I did the shortened version of it, so that like 20 minutes."
  },
  {
    "timestamp" : "54:06-54:06",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "Yeah. Okay.",
    "timestamp" : "54:06-54:07",
    "speaker" : "Trevor"
  },
  {
    "text" : "I'm so glad you asked. How many do you give it? So one to six Lombardi.",
    "speaker" : "Andy",
    "timestamp" : "54:13-54:21"
  },
  {
    "timestamp" : "54:22-54:31",
    "text" : "You can do halves with AFC championships. So like I'm gonna give it maybe four, three Lombardies in an AFC championship, four Lombardies right around there. Really?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "54:32-54:41",
    "text" : "I would go from I would I would go t like two two Lombardies and and like an NFC championship.",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "54:42-54:44",
    "text" : "No, you don't I don't get you into that. You have to win them to do that."
  },
  {
    "timestamp" : "54:46-54:51",
    "speaker" : "Trevor",
    "text" : "So just so just well we don't have any Lombardi's either, so do I get I go zero?"
  },
  {
    "timestamp" : "54:52-54:57",
    "speaker" : "Steve",
    "text" : "You got two wins, two and a half, two wins and a tie. All right."
  },
  {
    "timestamp" : "54:57-55:00",
    "speaker" : "Andy",
    "text" : "Uh two all in sixteen seasons."
  },
  {
    "text" : "Yeah. I've seen it in a picture.",
    "speaker" : "Steve",
    "timestamp" : "55:00-55:02"
  },
  {
    "timestamp" : "55:05-55:11",
    "speaker" : "Andy",
    "text" : "I would I I disagree with Steven. I would give this like A two out of six."
  },
  {
    "timestamp" : "55:12-55:17",
    "text" : "It's Thanksgiving. Yeah, Thanksgiving game has to have a fucking extra Lombardi on it.",
    "speaker" : "Greg"
  },
  {
    "text" : "This this gate I I gave it an extra Lombardi This game was probably the one exciting stars. This is the the least exciting Patriots win I've seen since we started doing this.",
    "timestamp" : "55:17-55:27",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "55:27-55:31",
    "speaker" : "Trevor",
    "text" : "That's I agree. That's the thing. It's just it wasn't super exciting."
  },
  {
    "speaker" : "Andy",
    "text" : "I'm probably Brady wasn't good. The defense was still giving up a shit ton of rushing yards to a a Lions team who came in here, what, like three and seven or something?",
    "timestamp" : "55:31-55:41"
  },
  {
    "speaker" : "Trevor",
    "text" : "Right.",
    "timestamp" : "55:41-55:42"
  },
  {
    "text" : "It didn't look like they wanted to be there.",
    "timestamp" : "55:43-55:45",
    "speaker" : "Andy"
  },
  {
    "text" : "It just your uh who gets your Turduccan award, the John Madden.",
    "timestamp" : "55:47-55:52",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "55:53-56:00",
    "text" : "Uh actually I don't know who's the biggest guy on the field. No Vince Wolf here, right?"
  },
  {
    "timestamp" : "56:00-56:02",
    "text" : "Oh wow, what's his name? Bobby Hamilton.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "No, I'm gonna give it to Jeff Gooch.",
    "timestamp" : "56:03-56:04"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "56:06-56:09",
    "text" : "Jeff Gooch. Dude, you know Gooch?"
  },
  {
    "timestamp" : "56:11-56:14",
    "speaker" : "Andy",
    "text" : "Wait, which team was he on? The Lions."
  },
  {
    "speaker" : "Greg",
    "text" : "But his name is Jeff Gooch. So he's the linebacker. Dude Lyndon Lyndon Gooch he's one of my favorite soccer players right now. What about Taylor Gooch, the golfer? Taler? Taler? What about Gucci man? Mm-mm. The rapper.",
    "timestamp" : "56:14-56:31"
  },
  {
    "speaker" : "Trevor",
    "text" : "Yeah.",
    "timestamp" : "56:36-56:36"
  },
  {
    "text" : "Oh yeah.",
    "timestamp" : "56:36-56:37",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:37-56:37",
    "text" : "Okay.",
    "speaker" : "Trevor"
  },
  {
    "text" : "Yeah, Jeff Gucci, you had uh four tackles. Uh two solos. And that was all he did this game. But his name is Jeff Gooch. And so is Tower Gooch the guy looks like. He's getting Richard Ducken.",
    "timestamp" : "56:38-56:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "McElroy.",
    "timestamp" : "56:52-56:53"
  },
  {
    "timestamp" : "56:53-56:56",
    "speaker" : "Trevor",
    "text" : "McElroy, yeah. Well he looks like Roy Rory McElroy and Blake Griffin. Right."
  },
  {
    "timestamp" : "56:58-57:13",
    "text" : "Lyndon Gooch is actually a pretty legit American soccer player who plays on England or in England on Sunderland right now. And he was like lighting it up for him last year. They have Lyndon Gooch and they have Max Power. Remember the Simpson? Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Trevor",
    "text" : "So I'm I'm looking at the the roster and guys that I think lasted the gauntlet for the Lions, like Schlesinger, I'm not including him because he was like an older dude at the time. But he's like a fan favorite. But rookies that year, so Joey Harrington obviously was one. Dominic Rayola was the center. Oh yeah. And he ended up being a starter for a pretty long time. Spent his whole career in Detroit. Um Jeff same with Jeff Backis. He was there for a pretty long time too. Which Is like frustrating to read and think about because you're like, so you had we had two anchors on the offensive line, which is A decent amount for a shitty team. Yeah, you should be able to build around. And one right in one draft, you had two, you got two anchors, not in the first round. So they were later, they were really good picks. And we just didn't just couldn't convert with a good offensive line. Not winning with a decent offensive line. in the NFL is just like it's like having a huge cock and just not just being a virgin because you're just not into sex. You're just like, eh You know what? Not for me. I've seen a couple pornos and it just doesn't seem like I'm into it.",
    "timestamp" : "57:18-58:35"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh smoking like a true lions fan. I think Mike Traduck can probably go to Mike McMahon, the backup quarterback, because he was actually in on multiple plays in the game.",
    "timestamp" : "58:37-58:52"
  },
  {
    "timestamp" : "58:52-58:53",
    "speaker" : "Greg",
    "text" : "He caught a pass, didn't he?"
  },
  {
    "speaker" : "Andy",
    "text" : "He caught a pass out of the backfield. Yeah. So Yeah, the the the Lions actually decide to run a two-QB play. They did it twice, and the other time he ran like a wildcat. Like QB draw. And uh your boy Joey Harrington actually went and tried to throw a chop block on Otis Smith. I think we did not appreciate it.",
    "timestamp" : "58:54-59:17"
  },
  {
    "speaker" : "Steve",
    "text" : "OG Joey Harrington, the OG Sam Darnold, too. Same with like a bunch of mistakes trying to do too much on the terrible, terribly run franchise.",
    "timestamp" : "59:17-59:27"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:29-59:50",
    "text" : "Who was the quarterback that lined up wide? I think it's for the Dolphins maybe. And just like Oh no. He was the Jets. Uh who who lined up wide on on a uh on another one of these kind of plays and the defensive back like jumped him and he like flinched really bad. It may be Sanchez."
  },
  {
    "timestamp" : "59:52-59:54",
    "text" : "I think it was Yeah, that was Sanchez for the Jets.",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah",
    "timestamp" : "59:54-59:55"
  },
  {
    "timestamp" : "59:57-01:00:06",
    "speaker" : "Greg",
    "text" : "So I feel like just stood there with the most like disinterested look on his face. Remember that? Where he just like stood there and was like just like a fucking like"
  },
  {
    "text" : "Just didn't even move, yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:00:06-01:00:07"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:00:08-01:00:10",
    "text" : "Classic cutler. I fucking love cutler."
  },
  {
    "timestamp" : "01:00:11-01:00:24",
    "speaker" : "Trevor",
    "text" : "I'm a cutler guy too. Bears are my least favorite favorite team in the in our division. Um but I I love smoking Jay Cutler is that dude. He is so funny."
  },
  {
    "timestamp" : "01:00:24-01:00:28",
    "speaker" : "Greg",
    "text" : "I meant about having a big dick and not using it, Jay Cutler."
  },
  {
    "speaker" : "Trevor",
    "text" : "And like it was almost by design. And he liked he enjoyed it. Like that dude loved nothing more than just chilling on the bench. Yeah. Just collecting a fat contract.",
    "timestamp" : "01:00:29-01:00:40"
  },
  {
    "speaker" : "Greg",
    "text" : "Just not never gonna change him. He'll never change him. No.",
    "timestamp" : "01:00:40-01:00:44"
  },
  {
    "speaker" : "Trevor",
    "timestamp" : "01:00:44-01:00:45",
    "text" : "I love that dude."
  },
  {
    "timestamp" : "01:00:46-01:00:49",
    "text" : "If the Bears are your least favorite team in the division, who's your least favorite team ever?",
    "speaker" : "Steve"
  },
  {
    "text" : "The Patriots. Least favorite team ever.",
    "speaker" : "Trevor",
    "timestamp" : "01:00:50-01:00:52"
  },
  {
    "timestamp" : "01:00:53-01:00:54",
    "speaker" : "Andy",
    "text" : "The Detroit Lions. Yeah, the Lions."
  },
  {
    "text" : "If I had to actually rank it, yeah, like they they fall into the category. It's weird, where they're definitely the top like my top three least favorite, but also like number one favorite It's like uh I love to hate him, but like I can't I can't run away.",
    "timestamp" : "01:00:55-01:01:09",
    "speaker" : "Trevor"
  },
  {
    "timestamp" : "01:01:10-01:01:11",
    "speaker" : "Andy",
    "text" : "It's an abusive relationship, isn't it?"
  },
  {
    "timestamp" : "01:01:12-01:01:18",
    "text" : "What about the the Packers? Because they dominated the the Lions for years, right, with the the Favre into Rogers",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Trevor",
    "text" : "Yeah, um but the so the the thing about and this goes back to a lot of fans too is I can appreciate Packer fans because it's it's kind of all that area has. So they're they're they're all in and they're as fans I really don't think they're that bad and I think it's because of the area. Like they just they're like it's hard to be like kind of swaggy about like up like the Packers. Right? There's never really anything flashy about it. So it's it's nothing that you can really get too too upset about. The bears are kind of the opposite where even when Like they have the history, so they're super in your face about that. Um and also like they just chic I mean they're they're huge cocks about it just everything in their city. It's like it's It's great and it's incredible and like it's not because it's like negative 10 for like four months out of the years. And like they love to tell you how great they are. And then like they're like the the the nicer version of of like the Detroit, right? If you take away their history, they're like massive underachievers.",
    "timestamp" : "01:01:18-01:02:28"
  },
  {
    "timestamp" : "01:02:29-01:02:30",
    "speaker" : "Steve",
    "text" : "That's true."
  },
  {
    "text" : "But they won't tell you that. What about Viking? I can agree with that. Uh Viking is I'm a little screwed s uh I'm a little skewed because my uh My mom's family and my mother, they're like huge, huge Vikings fans. So I'm a little skewed in terms of so whenever I meet a Vikings fan, obviously I always, you know, hey, like I'm a Lions fan. But uh That's always like, you know, no one rips on the Lions fan in the NFC. Um but it also leads into the conversation of like, well, like my family's from Minnesota, like my mom's a huge Vikings fan, so I've never had an issue with with them or the or the team really. It's hard to have an issue with any team when you're just you know you're so bad, right?",
    "timestamp" : "01:02:30-01:03:15",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:03:17-01:03:19",
    "text" : "have been a Vikings fan?"
  },
  {
    "text" : "I could have. And there was there's a there was a point where I thought about jumping ship. Yeah. Yeah.",
    "timestamp" : "01:03:19-01:03:26",
    "speaker" : "Trevor"
  },
  {
    "text" : "Well it was like when they were really rolling.",
    "timestamp" : "01:03:28-01:03:30",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Trevor",
    "text" : "I was a I I really did like Culpepper. Like when I had Madden, I liked playing with with Culpepper and Boss. And uh I can't remember the Yeah, we talked about the running back's name back.",
    "timestamp" : "01:03:30-01:03:43"
  },
  {
    "text" : "Robert Robert Smith.",
    "speaker" : "Greg",
    "timestamp" : "01:03:43-01:03:45"
  },
  {
    "text" : "Yeah. Yeah. They were like they were just like a fun team to play with, and like my mom and I would watch them on Sundays and stuff. Um and I really thought about it. I was like, man, like this seems like a better life. This seems happier. And I don't know if it was like They also sort of like underachieve and my mom's like she gets really intense in the games and I don't I just didn't know if I wanted to be a part of that. Like I got my own thing and my own misery and I feel like if I just jump ship to yours, which doesn't seem that great, I'm just what am I doing here?",
    "speaker" : "Trevor",
    "timestamp" : "01:03:45-01:04:19"
  },
  {
    "timestamp" : "01:04:20-01:04:28",
    "speaker" : "Andy",
    "text" : "It seems like a different kind of misery because they they're tantalized with almost success. Um what feels like a bit more of a regular basis."
  },
  {
    "timestamp" : "01:04:29-01:04:30",
    "speaker" : "Trevor",
    "text" : "Yeah, I would agree."
  },
  {
    "text" : "They haven't won a Super Bowl, right?",
    "timestamp" : "01:04:34-01:04:36",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Trevor",
    "text" : "Uh no, I don't think so. They're one of the they're one of the three, but they've been to they've been to a couple. Uh but no, I don't I don't think they've ever won one. Yeah. I think we're the only you might you might have to look this up. We're there might be one other team other than the Lions that's never been to a Super Bowl.",
    "timestamp" : "01:04:37-01:04:56"
  },
  {
    "timestamp" : "01:04:56-01:04:57",
    "speaker" : "Andy",
    "text" : "The Browns."
  },
  {
    "speaker" : "Trevor",
    "text" : "Probably somewhere like Nil. Yeah, you're right. I think it is the Texans.",
    "timestamp" : "01:04:57-01:05:00"
  },
  {
    "text" : "Uh the Jaguars.",
    "timestamp" : "01:05:02-01:05:04",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:05-01:05:13",
    "speaker" : "Greg",
    "text" : "No, they never the Browns, Jags, Lions, Texans. Okay. Browns, Jags."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, Browns like they were good though when the NFL started, you know.",
    "timestamp" : "01:05:13-01:05:17"
  },
  {
    "text" : "Yeah, the list of teams that's never won is pretty long. Bengals, Bills, Browns, Cardinals, Chargers, Falcons, Jags, Lions, Panthers, Texans, Titans, Vikings.",
    "timestamp" : "01:05:18-01:05:26",
    "speaker" : "Greg"
  },
  {
    "text" : "The Vikings uh were the first team to make it to four Super Bowls. They're also the first team to lose four Super Bowls.",
    "speaker" : "Andy",
    "timestamp" : "01:05:28-01:05:34"
  },
  {
    "timestamp" : "01:05:37-01:05:59",
    "speaker" : "Greg",
    "text" : "The Bills would like a word. Yeah. Second. Bills did it more efficiently. Well how do they even rate the games they watch? So today we're rating this from zero stars to one star."
  },
  {
    "timestamp" : "01:06:03-01:06:15",
    "speaker" : "Andy",
    "text" : "How wide left? All right. So do you want to do some best and worst? Sure. Alright. Greg, you want to go first? No."
  },
  {
    "timestamp" : "01:06:18-01:06:21",
    "text" : "I'm gonna fucking slow play my hand here, see what you guys come up with.",
    "speaker" : "Greg"
  },
  {
    "text" : "I'm gonna ask you that every week though. Steve, you wanna go first?",
    "speaker" : "Andy",
    "timestamp" : "01:06:22-01:06:25"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:06:26-01:06:55",
    "text" : "Uh sure. Sure. I don't really have any worsts. That's why I thought this game was good. Okay. I have a couple bests though. Did you see Andy? You're the only one who's gonna know this because you're the only one who watched it, but When they're coming in out of commercial, does he see that guy dressed as a pilgrim? He was just fuck and he's like pointing and you can see like three inches of his Stomach sticking out. I was like America baby."
  },
  {
    "text" : "Yeah, it no that that definitely made uh Greg Gumble and Phil Sims speechless. Like they they they they couldn't run with that at all. There's also there was also another fan that had um a full-size turkey costume. I don't even know where you get that. Like an adult-size turkey costume.",
    "timestamp" : "01:06:55-01:07:14",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07:16-01:07:16",
    "speaker" : "Steve",
    "text" : "Detroit."
  },
  {
    "timestamp" : "01:07:16-01:07:18",
    "speaker" : "Andy",
    "text" : "It looked homemade. You might be right."
  },
  {
    "text" : "Did you see a lady in the lion print like jacket with the lion, like a a real lion on her head, not a real lion, but like a stuffed lion on her head that had a bow on its head?",
    "speaker" : "Steve",
    "timestamp" : "01:07:19-01:07:28"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:07:28-01:07:32",
    "text" : "Which one? I feel like there was multiple of those."
  },
  {
    "timestamp" : "01:07:32-01:07:41",
    "text" : "The lion on her head had home on its head and she was wearing like lion print. It was ridiculous. Yeah, there was a lot of some gems in the stands for sure.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "No for sure.",
    "timestamp" : "01:07:41-01:07:42"
  },
  {
    "text" : "But my uh my best best is obviously I I tried to edit the Wikipedia for this, I couldn't figure out how to do it. They probably like block me out, but under Troy Brown's accomplishments section, it doesn't list the 2002 All-Iron Award winner. And you know, I would like to correct that if if we can.",
    "timestamp" : "01:07:42-01:08:01",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So Yeah, so I guess Greg Gumble and Phil Sims were giving away a trophy. And I got excited until they showed the trophy. And it was a block o a block of wood with an old school iron on top of it.",
    "timestamp" : "01:08:01-01:08:14"
  },
  {
    "text" : "Yeah, like the monopoly piece iron. Yeah, yeah.",
    "timestamp" : "01:08:15-01:08:17",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:08:17-01:08:25",
    "text" : "Fuck yeah, dude. No, this is garbage. Everybody needs a trophy, right? What are you a fucking millennial?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:08:26-01:08:28",
    "text" : "Jesus. This is a fuck- this was awesome"
  },
  {
    "text" : "Your trophy's not fancy enough, but that's what you're complaining about.",
    "timestamp" : "01:08:29-01:08:32",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:08:38-01:08:41",
    "text" : "This is the end. Somebody take this. Well here's my problem. This is going to garage."
  },
  {
    "text" : "CVS is giving out a goddamn monopoly piece, and Fox is over here giving out six legged turkeys. That's what I'm saying.",
    "timestamp" : "01:08:41-01:08:47",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:08:48-01:09:02",
    "speaker" : "Greg",
    "text" : "That's what it was. Well, are those tur duckins though? Yeah. I didn't think that's six legs, Greg. Nah. Steve over here who's fucking cooking a chicken trying to call it a turkey. You're fraud."
  },
  {
    "timestamp" : "01:09:02-01:09:07",
    "speaker" : "Steve",
    "text" : "You're just jealous. You didn't get one of those fucking net Turkey and stopping sandwiches for our Thanksgiving."
  },
  {
    "speaker" : "Greg",
    "text" : "Go get one right now for fucking $5. 98 at Target.",
    "timestamp" : "01:09:08-01:09:12"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but was it Maywood?",
    "timestamp" : "01:09:13-01:09:14"
  },
  {
    "speaker" : "Greg",
    "text" : "Rotissory chickens, they sell them shits everywhere.",
    "timestamp" : "01:09:14-01:09:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Target Alright, so that's your best is is the award that he won.",
    "timestamp" : "01:09:24-01:09:30"
  },
  {
    "speaker" : "Trevor",
    "text" : "Yeah. How how would that not be my best? That would be that is cool.",
    "timestamp" : "01:09:30-01:09:33"
  },
  {
    "timestamp" : "01:09:34-01:09:39",
    "speaker" : "Andy",
    "text" : "That was gonna be my worst. That was your worst? Controversy. That was one of them, no."
  },
  {
    "timestamp" : "01:09:39-01:09:42",
    "speaker" : "Steve",
    "text" : "Trey Brown had a great game. Ten catches. Everyone else had like nine."
  },
  {
    "text" : "I'm ready for mine, Andy. He did.",
    "timestamp" : "01:09:42-01:09:44",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:09:45-01:09:47",
    "speaker" : "Andy",
    "text" : "The rest of the team had eight. All right, let's hear it, Greg."
  },
  {
    "text" : "Well my best is just the the holiday of Thanksgiving. Can we all agree it's the best one?",
    "speaker" : "Greg",
    "timestamp" : "01:09:48-01:09:54"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. You don't have to worry about gifts or anything.",
    "timestamp" : "01:09:54-01:09:56"
  },
  {
    "text" : "All you gotta worry about is overeating. Yeah. And there's football on all day and you just fucking eat a fat meal, take it.",
    "timestamp" : "01:09:56-01:10:03",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Wait, wait, wait, wait, wait, wait, wait, wait. How do the Lions fans feel about it though? Because they play on Thanksgiving every year.",
    "timestamp" : "01:10:03-01:10:10"
  },
  {
    "speaker" : "Trevor",
    "text" : "So I uh I think the general feeling is that we we love it because we're we're on every year. That's true. Because it's like it's It's cool to just have games on in general, right? Like if you're a if you're a sports fan, you like football all day, this is great. But knowing that at least Good or bad, again, right? Because you're like by Wednesday, you're you've bought back in. So by Sunday, you're really in. And you or by Thursday, you're like, yeah, I'm I'm good on Thanksgiving. So You're you're all in and it's your team and it's a holiday, there's food, like like all that good stuff is just amplified by the fact that the game's not blacked out, I imagine. Yeah. Yeah, but then doesn't like Mitch Trubisky ruin it for you? There I mean yeah, but it's always like No the Lions ruin it for you. If you're in a room full of Lions fans and you and you lose like Misery loves company And it's like a good like the lines have been bringing families together in hatred.",
    "timestamp" : "01:10:11-01:11:08"
  },
  {
    "text" : "It doesn't matter how how bad uh the meal was. So d interestingly enough, uh they they played on Thanksgiv the Pats and Lions played on in 2000 as well. Did you know that Brady's Brady's first ever throw in the NFL was on Thanksgiving two thousand for three. Yeah. And then again in twenty ten they played Both wearing throwback throwbacks. Yeah. Because I got this game confused. I was like, this is gonna be a blow-up because I had remembered the 2010 one.",
    "speaker" : "Greg",
    "timestamp" : "01:11:11-01:11:43"
  },
  {
    "timestamp" : "01:11:43-01:11:46",
    "text" : "That was like 30 something. Uh yeah.",
    "speaker" : "Trevor"
  },
  {
    "text" : "Yeah, yeah. And then 2012 was the bot fumble. That those are the four times the Pats have played Thanksgiving.",
    "speaker" : "Greg",
    "timestamp" : "01:11:46-01:11:53"
  },
  {
    "speaker" : "Andy",
    "text" : "2010 wasn't that Wasn't that the year the Patriots clinched the division on Thanksgiving?",
    "timestamp" : "01:11:53-01:12:03"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:12:03-01:12:06",
    "text" : "It can't be. There was one Thanksgiving game."
  },
  {
    "timestamp" : "01:12:06-01:12:14",
    "speaker" : "Andy",
    "text" : "It might have been like a Probably 200 2007. I mean it might have been it, but I remember they clinched it on Thanksgiving. They clinched the division. Wow."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:12:14-01:12:16",
    "text" : "Yeah, maybe it was 2010. I think they're pretty good that year."
  },
  {
    "text" : "Yeah, that's what I'm thinking. That may have been their fourteen and two year.",
    "timestamp" : "01:12:17-01:12:20",
    "speaker" : "Andy"
  },
  {
    "text" : "I just remember one Thanksgiving game where I feel like it was a later game because I only remember the first bit of it. When dad got that electric wine cooler and we tried to like drink the bag wine to make it fit in there. Yeah. And then someone got in a fight and I was I was all amped up and mom was super mad at me. That's that's about that's how I remember I'm pretty sure that was Thanksgiving. Might have been Christmas, probably not Christmas. I don't know, it's some sort of big dinner.",
    "timestamp" : "01:12:20-01:12:44",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:12:44-01:12:46",
    "text" : "No, I'm pretty sure that was Thanksgiving, yeah. I remember that."
  },
  {
    "text" : "That was that was last year, Steve.",
    "timestamp" : "01:12:46-01:12:48",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:12:50-01:12:53",
    "text" : "And the year before. Yeah, and it was uh in every year before."
  },
  {
    "text" : "We gotta stop getting dad electric wine coolers.",
    "timestamp" : "01:12:54-01:12:56",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "We can stop getting you bags of wine.",
    "timestamp" : "01:12:57-01:12:59"
  },
  {
    "speaker" : "Steve",
    "text" : "It was his. It's all dad's fault.",
    "timestamp" : "01:12:59-01:13:02"
  },
  {
    "speaker" : "Greg",
    "text" : "All right, so my worst, I I'm looking through this article of Marty Morningweg getting suspended at college. This is nineteen eighty-three. I'm looking at some of the advertisements. An RCA like block TV, 25 inch or 600 bucks. 600 bucks, dude, for a TV. That's like a fucking 25 inch. 25 inches, dude. Um I was a look I was expecting to see prices be like super low, but everything's wicked expensive. Do you not know how technology works? Yeah, what a nerd. That's exactly how it works. Dude, eight hundred thirty-nine dollars for a twenty-five incher. That's not even true, Andy. Fucking iPhones are still going up.",
    "timestamp" : "01:13:04-01:13:51"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but they're good.",
    "timestamp" : "01:13:51-01:13:51"
  },
  {
    "speaker" : "Greg",
    "text" : "Cost more every year. Faster. Okay, Andy, explain to me how technology works, okay, Mr.",
    "timestamp" : "01:13:52-01:13:57"
  },
  {
    "timestamp" : "01:13:57-01:14:27",
    "speaker" : "Andy",
    "text" : "Fucking Hot Pants Bro, I've I've seen you try to work technology. You're beyond help. Alright, go fuck yourself. What's your best and worst? All right. Um My best was Um the referee in this game who had a black eye and twelve stitches. From getting lit up the the week before in pregame and he had to miss the game because he was getting 12 stitches on a black eye."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:14:27-01:14:37",
    "text" : "I thought that was a ridiculous way to get hurt or get 12 stitches. Well he got hit? In pre-game. Uh before the game."
  },
  {
    "timestamp" : "01:14:37-01:14:38",
    "speaker" : "Andy",
    "text" : "But he was a few years ago."
  },
  {
    "timestamp" : "01:14:38-01:14:44",
    "text" : "It was like the worst referee injury. I don't I can't remember any like Yeah. Yeah. Referees really getting jacked up.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And since we actually haven't talked about this game, I'm gonna throw out some other bests, which were um Teddy Bruski in his pick six. And I think that's right. I wanna I want to put out the point that Teddy Bruski probably has the best hand out of any NFL player who wore neck roll. Hmm. Cause he makes some quality catches across the middle there.",
    "timestamp" : "01:14:44-01:15:11"
  },
  {
    "text" : "That was the second pick six of the year. What was Zach Thomas? Oh, Zach Thomas. Did you ever wear a necro? Yeah, oh yeah. Oh yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:15:12-01:15:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh actually yeah, I know you did, but",
    "timestamp" : "01:15:20-01:15:22"
  },
  {
    "timestamp" : "01:15:22-01:15:25",
    "text" : "Let's see how many career interceptions he's got. Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:15:25-01:15:30",
    "text" : "How many pick six does he have? Because this was the the very stereotypical Bruce Key.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "How many Bruce do you have?",
    "timestamp" : "01:15:30-01:15:32"
  },
  {
    "speaker" : "Steve",
    "text" : "What about some fullbacks? Ruscu had like four in three years somehow. We look we talked about this. Yeah. Do you want to guess?",
    "timestamp" : "01:15:32-01:15:39"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:15:40-01:15:40",
    "text" : "Yeah, back to the right."
  },
  {
    "speaker" : "Steve",
    "text" : "I'm gonna say like eight. Yeah. Pick six.",
    "timestamp" : "01:15:45-01:15:48"
  },
  {
    "text" : "Andy? No, just interceptions.",
    "timestamp" : "01:15:48-01:15:50",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh interceptions. I don't remember. Yeah, probably like eight or ten.",
    "timestamp" : "01:15:50-01:15:53"
  },
  {
    "speaker" : "Greg",
    "text" : "Seventeen. Dang.",
    "timestamp" : "01:15:53-01:15:55"
  },
  {
    "text" : "How many interceptions does Teddy have? Because we just talked pick sixes the other day. That's true, yeah. Yeah, how many of those went for touchdowns?",
    "speaker" : "Steve",
    "timestamp" : "01:15:56-01:16:01"
  },
  {
    "text" : "None because he's on the fucking I never know how to spell Bruce.",
    "timestamp" : "01:16:01-01:16:04",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:16:06-01:16:08",
    "text" : "B R E W S K I."
  },
  {
    "speaker" : "Greg",
    "text" : "Come on, dude. I st I still can't look at what is it? B-R-U- No B-R-E-S-I-F- Fuck me dude. Fuck me Oh, but technology. That's spelling a dickhead. Twelve. Best best hands of the neck roll. Fucking Zach Thomas. Oh, are you happy now, Greg?",
    "timestamp" : "01:16:08-01:16:32"
  },
  {
    "timestamp" : "01:16:32-01:16:34",
    "text" : "You should have gone Teddy Brewski.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, how dare you? The man had a hole in his heart and he still came back and played football. And you're gonna shit on him for this? Cool.",
    "speaker" : "Andy",
    "timestamp" : "01:16:34-01:16:40"
  },
  {
    "speaker" : "Greg",
    "text" : "Well anyways, back to people getting hurt in pre-game. I was watching uh Quentin Nelson, the guy for the Colts.",
    "timestamp" : "01:16:40-01:16:49"
  },
  {
    "text" : "Yeah. Oh yeah.",
    "timestamp" : "01:16:49-01:16:50",
    "speaker" : "Trevor"
  },
  {
    "timestamp" : "01:16:50-01:17:07",
    "speaker" : "Greg",
    "text" : "His like top 100 thing. There was like in pregame, there's the punter like just practicing and it like hit he hit a couple near him And then so Nelson like grabs the ball and punts it like sixty rows deep and then goes in up into the punter's face is like you fucking do that again, I'll kill you."
  },
  {
    "speaker" : "Trevor",
    "text" : "Nelson is is He's a psychopath, man.",
    "timestamp" : "01:17:08-01:17:12"
  },
  {
    "speaker" : "Greg",
    "text" : "I love that guy. Yeah. Oh I wanted to get that story in and you'd already moved on, so I just wanted to. Fair enough. Sorry to interrupt.",
    "timestamp" : "01:17:13-01:17:23"
  },
  {
    "text" : "Um my worst is probably the page is getting a pump locked. That was ugly. Yeah. Uh and that was the first punt block of the Lions season.",
    "timestamp" : "01:17:23-01:17:36",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:17:37-01:17:40",
    "text" : "And also the Lions wasted it anyways though."
  },
  {
    "speaker" : "Andy",
    "text" : "They did. They wasted a lot of things in the middle. I don't even think they got a field goal on that one. Uh don't believe they did, no. No, because Harrington threw a pick to uh Willie McGuinness a couple plays later. And then um the other uh this is in uh solidarity with Mama Brown. But Troy Brown out there when number eighty in the throwbacks look like Irving Fryer. That crossed my mind too. And the whole Patriots offense looked like uh an Irving Fryer led Patriots offense. where he was literally the only thing going for them. Because he had 10 catches for it was like 100 something yards. 111, I think. Yeah, and the rest of the team had eight eight catches combined. So it was literally one being a tip ball to patent. Right. That was uh intended for Troy Brown. Of course. So That was probably my worst, I would say. That or James Stewart getting knocked out by his own teammate.",
    "timestamp" : "01:17:40-01:18:45"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah. Geez, you're just piling the worst song, huh? Poor driver, come on.",
    "timestamp" : "01:18:45-01:18:49"
  },
  {
    "text" : "I got plenty of them. Dude, one and a half fucking Lombardi, Steve. Andy's. That's true. Tough man to police.",
    "speaker" : "Greg",
    "timestamp" : "01:18:50-01:18:57"
  },
  {
    "text" : "This was not a great game. The throwbacks, dude. Thanksgiving.",
    "timestamp" : "01:18:58-01:19:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I was very looking forward to this game.",
    "timestamp" : "01:19:04-01:19:05"
  },
  {
    "text" : "No, dude, I am on the opposite train of I think most people Do you like the Detroit throwbacks and I think I think they look stupid. I've never been a fan.",
    "timestamp" : "01:19:06-01:19:14",
    "speaker" : "Trevor"
  },
  {
    "timestamp" : "01:19:15-01:19:16",
    "text" : "Yeah, they're pretty bad.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, they weren't to 'em",
    "timestamp" : "01:19:16-01:19:17"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Trevor",
    "timestamp" : "01:19:17-01:19:18"
  },
  {
    "timestamp" : "01:19:19-01:19:21",
    "text" : "They're not as bad as Green Bay, yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:19:21-01:19:49",
    "text" : "I I agree. There are some worse, but it it's right. So I guess like yeah, they they've they haven't changed the color scheme and that they've kind of just gradually upgraded, but I just if there's something bad, like you just you don't have to bring it back to history. Like just kind of leave it there. Like where's something else? Like it's it's okay because like I get it if you look like shit probably gonna play like shit Nobody gets pumped up putting on like that fucking blue t-shirt",
    "speaker" : "Trevor"
  },
  {
    "timestamp" : "01:19:50-01:19:52",
    "speaker" : "Steve",
    "text" : "Dressing like that pilgrim in the stands. I don't care."
  },
  {
    "timestamp" : "01:19:53-01:19:55",
    "text" : "There you go. Dress like turkeys. Fuck it.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:19:56-01:19:59",
    "text" : "There's not even a lion on their throwbacks.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:19:59-01:20:19",
    "text" : "No, yeah. No. And back well back when they had so they if you look at like the evolution of the lion like logo, it used to be there was a version of it the that's like super super cool, but I think the early, early version It's it's like really complicated. Like it wouldn't look good on a jersey. It's kinda it kinda has to be blown up to look good.",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Steve",
    "text" : "Hmm. Well, anything's better than those fucking practice or flag football jerseys.",
    "timestamp" : "01:20:20-01:20:25"
  },
  {
    "timestamp" : "01:20:26-01:20:30",
    "speaker" : "Trevor",
    "text" : "Yeah, those are just like hey Reebok, no budget, send us what you got."
  },
  {
    "text" : "Are the numbers extra?",
    "speaker" : "Andy",
    "timestamp" : "01:20:34-01:20:35"
  },
  {
    "speaker" : "Trevor",
    "timestamp" : "01:20:35-01:20:35",
    "text" : "Yeah."
  },
  {
    "text" : "No? They ironed the numbers on before the game. Who do you think ironed the numbers on?",
    "timestamp" : "01:20:35-01:20:48",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Trevor",
    "text" : "Yeah.",
    "timestamp" : "01:20:48-01:20:49"
  },
  {
    "speaker" : "Greg",
    "text" : "Matt Millen.",
    "timestamp" : "01:20:49-01:20:50"
  },
  {
    "timestamp" : "01:20:52-01:20:56",
    "speaker" : "Trevor",
    "text" : "Don't worry guys, we'll be ready by kick off. It's just sitting there in my fireplace."
  },
  {
    "timestamp" : "01:20:57-01:21:04",
    "speaker" : "Greg",
    "text" : "Dude, the best jerseys ever are the creams of gold box jerseys. They're up there. They need to wear those again."
  },
  {
    "timestamp" : "01:21:05-01:21:07",
    "speaker" : "Trevor",
    "text" : "They're old that logo is sick too."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:21:07-01:21:07",
    "text" : "Yeah."
  },
  {
    "speaker" : "Trevor",
    "timestamp" : "01:21:08-01:21:10",
    "text" : "The cavalier looking kind of pirate."
  },
  {
    "timestamp" : "01:21:12-01:21:13",
    "speaker" : "Greg",
    "text" : "Does he have a knife?"
  },
  {
    "timestamp" : "01:21:13-01:21:14",
    "speaker" : "Trevor",
    "text" : "Yeah. Yeah, yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that's cool. Yeah, they're fucking sweet.",
    "timestamp" : "01:21:14-01:21:17"
  },
  {
    "timestamp" : "01:21:18-01:21:20",
    "speaker" : "Andy",
    "text" : "All right, Trevor, you got you got best and worse for this game?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:21:21-01:21:22",
    "text" : "We do worse and worse, that's fine."
  },
  {
    "speaker" : "Trevor",
    "timestamp" : "01:21:23-01:21:44",
    "text" : "Uh well the the best was the punt block because I think those are like few and far between. Uh and that was almost returned for a touchdown, so that was cool. The worst was actually the Bruce Key INT for a touchdown because as I was watching the Like the highlights, whatever, the short version of the game, but you could the Lions had just gone down and scored."
  },
  {
    "text" : "I think it was it was literally the it was our first possession.",
    "speaker" : "Steve",
    "timestamp" : "01:21:45-01:21:49"
  },
  {
    "timestamp" : "01:21:49-01:21:55",
    "text" : "No, it was yeah, it was. It was like it was the second play from Scrimmage for For the Lions, yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:21:56-01:22:18",
    "speaker" : "Trevor",
    "text" : "It was a it it was a different intersection. Might have been a different interception. Maybe it was that one. I don't know. I just think it anytime honestly, anytime you throw pick six, it's just such a momentum killer. Like it sucks Um it's just it's such a shitty, like that's how you start. Like if if that was a second play of the game, that's how you start it off. Yep. Man, that sucks."
  },
  {
    "text" : "Yeah, all right, that's fair.",
    "speaker" : "Andy",
    "timestamp" : "01:22:19-01:22:20"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:22:21-01:22:25",
    "text" : "Honestly, best of the game, probably Jason Hansen, four for four."
  },
  {
    "text" : "Four for four, baby. Hall of Fame. Probably working on his golf game on the sideline. I don't need to worry about kicking. I'm good.",
    "timestamp" : "01:22:25-01:22:33",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:22:38-01:22:45",
    "text" : "Well alright. This is this has been this has been fascinating for me to find somebody on the other end of the spectrum."
  },
  {
    "timestamp" : "01:22:46-01:22:47",
    "speaker" : "Trevor",
    "text" : "Tough life."
  },
  {
    "speaker" : "Mom",
    "text" : "Someone's gotta live it.",
    "timestamp" : "01:22:47-01:22:48"
  },
  {
    "speaker" : "Andy",
    "text" : "I guess yeah I don't think you have to.",
    "timestamp" : "01:22:48-01:22:50"
  },
  {
    "timestamp" : "01:22:50-01:23:18",
    "speaker" : "Trevor",
    "text" : "It does it's I guess maybe it is I really don't, but I don't know. You'd be surprised that like guys that just they have jumped ship like early early and then like you know talking like maybe like 10 to 12 years old or whatever they're like this is enough is enough. They shift teams They go go to college and then they move to a different city and like it's okay. No one knows you're a Lions fan. Like you could for they don't for all they know, you grew up as Saints family."
  },
  {
    "timestamp" : "01:23:18-01:23:19",
    "speaker" : "Greg",
    "text" : "It doesn't matter, right?"
  },
  {
    "speaker" : "Trevor",
    "timestamp" : "01:23:20-01:23:28",
    "text" : "Like those guys are good and I just never thought that that was a possibility. I was like, I'm I am I am in. And at this point now I really can't change. Like"
  },
  {
    "timestamp" : "01:23:29-01:23:30",
    "text" : "No, now I'm invested, yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, yeah.",
    "timestamp" : "01:23:31-01:23:31",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:23:34-01:23:45",
    "text" : "Uh last year me and our other coworker We bet on the Lions over and wins just so we could feel it a little bit, you know? Mm-hmm. We put like twenty bucks down a lions to win six games."
  },
  {
    "timestamp" : "01:23:45-01:23:57",
    "speaker" : "Trevor",
    "text" : "Yeah. And Stafford when Stafford went down, I told him. I was like, gosh It's over. We are not this is we are fighting for yards at this point, let alone wins."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:23:58-01:24:07",
    "text" : "We were wrong. Started out so good though. We were like three and five. Like, dude, we're definitely hitting me over. Mm-hmm. Yeah."
  },
  {
    "text" : "Yeah, they did. That's that's rough. Well, all right. Uh what do we have to look forward to next week, boys? We playing. I don't know. We are home against the um the Detroit Lions of the AFC East. Buffalo? Hey, you got it in one. Oh. Speaking of which Is this the hat?",
    "timestamp" : "01:24:07-01:24:36",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, it arrived. I can't even put my headphones off this fucking thing. Give me the side profile view. It doesn't even look like a chicken wing of a big thing. No, it's just like a Discord Rex.",
    "speaker" : "Greg",
    "timestamp" : "01:24:41-01:24:54"
  },
  {
    "timestamp" : "01:24:56-01:25:05",
    "speaker" : "Steve",
    "text" : "Yeah. No, it looks like a rocket ship, Greg. It's a rocket ship, not a cock. Marty's rocket. Yeah, finger painting of a fucking rocket ship."
  },
  {
    "speaker" : "Andy",
    "text" : "So I think all the listeners at home are are all gonna have the same question. Uh what does it smell like? Does it smell like chicken wings?",
    "timestamp" : "01:25:08-01:25:18"
  },
  {
    "timestamp" : "01:25:18-01:25:51",
    "text" : "Dude, uh well, I'll tell you what, first of all, it's very poorly made. Like it's one of those things where I could just like rip this off and it would start you know like Nerf football. Yeah. Yeah. So and that's essentially what it smells like too if you compare it to like a a a foam football you found in your basement. It's starting to like deteriorate here. It's brand new. I mean I I guess you get what you pay for when you buy a fucking chicken wing hat from a restaurant and get it shipped halfway across the country. Fifty bucks well sped, Steve.",
    "speaker" : "Greg"
  },
  {
    "text" : "So Uh yeah, I I mean that gets us in the mood for for the Buffalo Bills coming to town.",
    "speaker" : "Andy",
    "timestamp" : "01:25:57-01:26:04"
  },
  {
    "timestamp" : "01:26:04-01:26:11",
    "speaker" : "Greg",
    "text" : "That's right. Week four Nobody circles the wagons. Like the Buffalo Bills."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:26:12-01:26:13",
    "text" : "I love that."
  },
  {
    "text" : "Is is that is that a preview of you're gonna have some more um Dude. Chris Burmanism for us.",
    "timestamp" : "01:26:14-01:26:19",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:26:19-01:26:28",
    "text" : "Well maybe next week I might just do uh just be a Bills fan for the week. How about that? Add a little spice to the podcast.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I I don't well one, I don't know if you can drink enough.",
    "timestamp" : "01:26:28-01:26:31"
  },
  {
    "text" : "Dude, I'm just gonna get a fucking 36 pack of Labat Blue.",
    "timestamp" : "01:26:33-01:26:37",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "That's what I was gonna say, yeah, of Labot Blue because I I don't know if they sell it in North Carolina. I like Labat Blue. That's pretty good. Labat Blue's a great beer. Yeah, it's just tough to find anywhere south of New York. I like uh Icy lights too.",
    "timestamp" : "01:26:37-01:26:52"
  },
  {
    "speaker" : "Trevor",
    "text" : "Icy light. Yeah. Iron the iron iron city light? Yeah. Yeah. They're not bad. It's not bad.",
    "timestamp" : "01:26:52-01:26:59"
  },
  {
    "timestamp" : "01:27:00-01:27:01",
    "text" : "It's not good.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:27:02-01:27:07",
    "speaker" : "Trevor",
    "text" : "It's not good, but it's it's like it's good. No, it's good ta tailgate and beer."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, it's great tailgate beer.",
    "timestamp" : "01:27:07-01:27:09"
  },
  {
    "text" : "Yeah. Oh, that's uh I don't know, we're kinda into this, but Let's do it. Being a Lions fan, the tailgates are a fantastic. Because everybody knows it's typically like statistically it's downhill from there. So the tailgates are are pretty pretty electric.",
    "timestamp" : "01:27:09-01:27:24",
    "speaker" : "Trevor"
  },
  {
    "text" : "I'm assuming the Browns are the same way.",
    "timestamp" : "01:27:25-01:27:27",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:27:27-01:27:33",
    "text" : "I think you've got to think the worse your team is, I think maybe the better the tailgate. There's gotta be a correlation.",
    "speaker" : "Trevor"
  },
  {
    "text" : "Because Matrix tailgates aren't that crazy. They're not that awesome.",
    "speaker" : "Steve",
    "timestamp" : "01:27:33-01:27:36"
  },
  {
    "speaker" : "Andy",
    "text" : "No That's true, yeah. It's uh there's too much entitlement happening. Yeah. The game is it's also probably like a blue-collar city thing.",
    "timestamp" : "01:27:37-01:27:46"
  },
  {
    "text" : "Like if you think of like what an LA tailgate looks like, I bet it's horrendous. Detroit, Cleveland, Pittsburgh, Buffalo, all those things. But that's the thing.",
    "timestamp" : "01:27:46-01:27:55",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I I think I think those Detroit Buffalo tickets are probably cheaper to get. So Yeah, definitely. Yeah, uh a wider range of of people going to them. Right. It's kind of like an opening.",
    "timestamp" : "01:27:55-01:28:08"
  },
  {
    "timestamp" : "01:28:09-01:28:09",
    "text" : "Right.",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:28:09-01:28:09",
    "text" : "Yeah."
  },
  {
    "speaker" : "Trevor",
    "text" : "Yeah.",
    "timestamp" : "01:28:10-01:28:10"
  },
  {
    "speaker" : "Andy",
    "text" : "To get more of the the true people coming to the games instead of of the the luxury class which as we know not great fans. That's you, Andy. Final fucking nerds either. I wish. Fuck nerds. Fucking Joey Harrington. Woohoo. Your third down percentage it's standard deviation.",
    "timestamp" : "01:28:11-01:28:31"
  },
  {
    "text" : "Three and a half mean averages from correlations.",
    "timestamp" : "01:28:32-01:28:35",
    "speaker" : "Greg"
  },
  {
    "text" : "If you graph it out on your on your T I eighty six, you'll see.",
    "timestamp" : "01:28:35-01:28:39",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Trevor",
    "text" : "Yeah. So somebody in the locker room, I don't know who, but one of the veterans just had to eventually be like, hey, what's the percentage of you shutting the fuck up?",
    "timestamp" : "01:28:39-01:28:48"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. No way someone didn't say that.",
    "timestamp" : "01:28:52-01:28:54"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh how long do you last on uh on on on the lines? Because we could probably put a percentage of that.",
    "timestamp" : "01:28:55-01:29:01"
  },
  {
    "speaker" : "Trevor",
    "text" : "How long was Harrington there? F six six seven years I think. Really?",
    "timestamp" : "01:29:02-01:29:08"
  },
  {
    "timestamp" : "01:29:08-01:29:09",
    "speaker" : "Andy",
    "text" : "Oh man. That's a lot of things."
  },
  {
    "speaker" : "Trevor",
    "text" : "Then he w 'cause he went to the Dolphins.",
    "timestamp" : "01:29:14-01:29:16"
  },
  {
    "timestamp" : "01:29:17-01:29:17",
    "speaker" : "Steve",
    "text" : "I don't remember that."
  },
  {
    "speaker" : "Trevor",
    "text" : "So maybe it was only four. Maybe we didn't re-sign him.",
    "timestamp" : "01:29:17-01:29:20"
  },
  {
    "text" : "It was four years. Yeah. The Dolphins and then Atlanta, and then he retired.",
    "timestamp" : "01:29:21-01:29:25",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:29:25-01:29:36",
    "text" : "Yeah. He actually played Detroit. on Thanksgiving as a dolphin for you said was he at the Miami for like what like two two years probably? Just one year. One year.",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Greg",
    "text" : "He started 11 games though, which is surprising.",
    "timestamp" : "01:29:36-01:29:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:29:39-01:29:43",
    "text" : "Started ten games for Atlanta too, which I don't remember at all. Don't remember that, yeah."
  },
  {
    "speaker" : "Trevor",
    "text" : "That must have been the uh year it before they drafted Ryan. Had to be, right?",
    "timestamp" : "01:29:44-01:29:50"
  },
  {
    "text" : "Yeah. Post Vic.",
    "timestamp" : "01:29:50-01:29:52",
    "speaker" : "Greg"
  },
  {
    "text" : "Yep.",
    "timestamp" : "01:29:52-01:29:53",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:29:53-01:29:53",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:29:53-01:29:54",
    "speaker" : "Trevor",
    "text" : "That translates."
  },
  {
    "speaker" : "Greg",
    "text" : "Some would say those were the dog days of Atlantis. There it is. By the way, I just listened to the episode the other day. I specifically told you to cut the rape joke, Andy. Yeah. Well well clearly you did it because I heard it last night.",
    "timestamp" : "01:29:54-01:30:16"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I heard it too. Yes.",
    "timestamp" : "01:30:17-01:30:21"
  },
  {
    "timestamp" : "01:30:26-01:30:26",
    "speaker" : "Greg",
    "text" : "No."
  },
  {
    "timestamp" : "01:30:26-01:30:28",
    "speaker" : "Andy",
    "text" : "Maybe not the original version."
  },
  {
    "text" : "Whoops. No, it's it was still in there.",
    "timestamp" : "01:30:29-01:30:31",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:30:32-01:30:33",
    "text" : "Well that's good."
  },
  {
    "text" : "God I hope no one from my work ever listens to this fucking fired. So fucked.",
    "timestamp" : "01:30:37-01:30:44",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Greg's running for office in the couple of years.",
    "timestamp" : "01:30:46-01:30:49"
  },
  {
    "text" : "Yeah, don't. Oh boy. At least we're having fun, right guys? That's right. That's what life's about.",
    "timestamp" : "01:30:50-01:30:59",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:30:59-01:31:00",
    "speaker" : "Steve",
    "text" : "Everybody except Trevor."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:31:01-01:31:01"
  },
  {
    "timestamp" : "01:31:02-01:31:26",
    "speaker" : "Trevor",
    "text" : "No, I'll tell you what though, I told I told Steve, I was like, so what what can I expect? And he was like, well, you know, we're gonna kinda watch the game or you know, watch the game prior, drink some beers, and just talk about what it means to be a Lions fan. This is kinda like free therapy. This was good for me. I think I needed this August to just kind of level my head. Uh and now I'm ready to go. You're ready to go in on uh Stafford. I'm all in."
  },
  {
    "timestamp" : "01:31:27-01:31:29",
    "speaker" : "Greg",
    "text" : "I think this is the year. I think I think so."
  },
  {
    "speaker" : "Trevor",
    "text" : "Who's that guy they drafted the running back?",
    "timestamp" : "01:31:30-01:31:32"
  },
  {
    "text" : "Uh Swift. Swift.",
    "speaker" : "Steve",
    "timestamp" : "01:31:32-01:31:34"
  },
  {
    "text" : "Oh dude, that guy is like the guy from my work, that's like his his like nephew. The kid Georgia? Yeah. Yeah. That's not good. Yeah. Yeah, what are his feelings? Why is that not good, Andy?",
    "speaker" : "Greg",
    "timestamp" : "01:31:34-01:31:52"
  },
  {
    "timestamp" : "01:31:52-01:31:55",
    "text" : "He's sad that the guy went to uh Detroit, I think, is probably his feelings.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Trevor",
    "timestamp" : "01:31:55-01:32:19",
    "text" : "So I always that I always wondered that, like when I was a kid. More not not like more so now, because now it's like well you you get a job, you're getting paid millions and millions of dollars to play sport, right? But when I was a kid, like I was always like man like People probably really hate coming here. Like they're probably sitting over there like not Detroit, not Detroit, not Detroit. You know, fingers crossed just praying. It was like the gauntlet."
  },
  {
    "text" : "Especially the guys that went to like Miami or you know LA. Like they have to be like, yeah.",
    "timestamp" : "01:32:23-01:32:29",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:32:30-01:33:16",
    "speaker" : "Trevor",
    "text" : "Well at least so I think with Miami, if you play bad, you have built-in excuses. Maybe they went out partying. It's a cool city. There's lots to do. Warm weather. You have no excuses, especially in 2002, with like Detroit. If anything, you would think like because there was nothing to do, the city was not great back in 2002. Now, much, much better. Oh two, and it was peak just It was just run down. Like there just there wasn't like a thr like thriving businesses and stuff like that. And then it only got worse in O you know, riding up until oh eight. Um might as well study the playbook. So yeah, you would think if football nerd Joey Harrington would have been studying the playbook instead I don't know, he was kicking rocks in the street. I don't know what he was doing, man."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:33:17-01:33:21",
    "text" : "Maybe he was just studying the wrong place. He was studying the interception plays."
  },
  {
    "timestamp" : "01:33:23-01:33:32",
    "text" : "Well, it doesn't help when your coach draws the playbook in crayons and kinda The Sun's lost in translation.",
    "speaker" : "Trevor"
  },
  {
    "text" : "Yeah. Oh god. Marty. Poor Marty. I feel bad for him.",
    "timestamp" : "01:33:33-01:33:40",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:33:42-01:33:48",
    "speaker" : "Andy",
    "text" : "I bet he made it pretty tiny. I don't feel that man I mean what else is he doing?"
  },
  {
    "text" : "He's he's still in the NFL Is he really? Yeah, he's an offensive consultant for the Eagles.",
    "timestamp" : "01:33:51-01:33:57",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:33:58-01:34:01",
    "text" : "Oh, that's right, yeah, because la was it last year, year before he was on the uh",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:34:02-01:34:03",
    "text" : "The Ravens."
  },
  {
    "speaker" : "Andy",
    "text" : "The Ravens, yeah.",
    "timestamp" : "01:34:03-01:34:04"
  },
  {
    "speaker" : "Greg",
    "text" : "Mm-hmm.",
    "timestamp" : "01:34:04-01:34:05"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:34:05-01:34:05"
  },
  {
    "timestamp" : "01:34:06-01:34:07",
    "speaker" : "Greg",
    "text" : "Two years ago."
  },
  {
    "speaker" : "Andy",
    "text" : "Still sticking around something.",
    "timestamp" : "01:34:08-01:34:09"
  },
  {
    "timestamp" : "01:34:09-01:34:17",
    "text" : "Did that's what happens, you know? You get your foot in the door. Hugh Jackson goes over in 16 and he's still fucking kicking around. That's true.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:34:18-01:34:24",
    "speaker" : "Andy",
    "text" : "Yeah, we're talking 2002 failure and he's still around. Like that's that's some impressive staying power."
  },
  {
    "text" : "That is freaking that guy, you know what? I'm I'm kind of with you, Craig. Like we may be downplaying this guy. Like we're not giving him enough credit. I don't like now Matt Millen.",
    "speaker" : "Trevor",
    "timestamp" : "01:34:24-01:34:38"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:34:39-01:34:42",
    "text" : "There's someone that he's he's out of the NFL, right?"
  },
  {
    "timestamp" : "01:34:43-01:35:17",
    "speaker" : "Trevor",
    "text" : "He is he is out of the NFL. He actually had a health scare a little bit ago, but Detroit there's I think two people in Detroit uh history that I think people will always, always, always have a bad taste in their mouth. One was a governor who was really like crooked. He ended up going to And it was Kwame Kilpatrick and that I think made national news just like stole a shitload of money, stuff like that. Um and then the other one is Matt Millen. And there was a parade for when he was he was fired. There was a legit, there was a parade."
  },
  {
    "timestamp" : "01:35:19-01:35:20",
    "text" : "Gotta celebrate some.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Trevor",
    "text" : "Like there was too like people made tombstones. It was like, yeah. I mean people were through the roof. When that guy was fired. It w I mean it was ridiculous there was like people would have uh",
    "timestamp" : "01:35:21-01:35:35"
  },
  {
    "speaker" : "Andy",
    "text" : "fire millen signs and people would chant it and wouldn't they write it on the paper bags that they would wear over their heads?",
    "timestamp" : "01:35:36-01:35:42"
  },
  {
    "speaker" : "Trevor",
    "text" : "Yeah. And it got so bad that if if you were caught having it going into the stadium, they would take it away from you Like it was just that that was part of the culture. That was it was just toxic. Like the whole thing. Right?",
    "timestamp" : "01:35:42-01:35:55"
  },
  {
    "text" : "Oh my god, dude. This is a fucking Wikipedia section, the Fire Millen movement. It's saying that out. In Los Angeles, an NBA game between Detroit and the Clippers, there was a chant started. In Los Angeles, fire Matt Millen. Well I feel like you became like fun.",
    "timestamp" : "01:35:55-01:36:22",
    "speaker" : "Greg"
  },
  {
    "text" : "Like it like it became a thing. But also like it was like ha ha but like no but seriously like this guy's gotta go if we draft another wide receiver I'm gonna lose my shit I mean you kind of hear it.",
    "speaker" : "Trevor",
    "timestamp" : "01:36:23-01:36:35"
  },
  {
    "speaker" : "Andy",
    "text" : "Like you hear Fire Day and Snight or like sell the team chance from Like in Washington.",
    "timestamp" : "01:36:39-01:36:43"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:36:45-01:36:52",
    "text" : "It says that even uh Rasheed Wallace started chanting it during a timeout in one of the games. I love Sheed."
  },
  {
    "speaker" : "Andy",
    "text" : "That's amazing.",
    "timestamp" : "01:36:53-01:36:54"
  },
  {
    "speaker" : "Trevor",
    "text" : "Yeah, dude that w that was uh those the the O four oh five pistons and they were good they were pretty good through up until like 2010 ish. Uh and the Tigers were also good right around like oh seven, oh eight, up and through like two thousand fourteen-ish.",
    "timestamp" : "01:36:54-01:37:13"
  },
  {
    "speaker" : "Andy",
    "text" : "Right.",
    "timestamp" : "01:37:14-01:37:14"
  },
  {
    "timestamp" : "01:37:14-01:38:06",
    "speaker" : "Trevor",
    "text" : "Um that that is sort of what got you through. Like the lions just atrociousness. And then the wings, obviously, in the early 2000s were were really good as well. So there was a lot of like balance. Now it's kind of in a period where everybody stinks and I'm a little far removed because I don't I don't live in Michigan anymore, obviously. But I just with no Big Ten football, right? So you don't have Michigan to bounce back on or or Michigan State. They probably would they were they'd be bad in football this year too. So that just kind of adds to the suckiness for half the state, right? But It's just a depressing time to be a Detroit Detroit sports fan right now. Every team is just in the bottom. That's tough. It's really tough. There's just nothing to look forward to."
  },
  {
    "timestamp" : "01:38:10-01:38:12",
    "text" : "Uh unlike Boston.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:38:13-01:38:14",
    "speaker" : "Trevor",
    "text" : "Yeah. Exactly."
  },
  {
    "text" : "We're the we're experienced that at work. As soon as my team's out of the playoffs, everyone's like, oh shit, what do you think about that? And I go, it's uh it's what do you mean hockey's over, it's basketball season. What do you mean basketball's over? It's football season. What do you mean football's over? It's hockey season. What do you mean baseball's over? It Bas Maffeasin You know, I immediately just pivot.",
    "timestamp" : "01:38:14-01:38:32",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:38:33-01:38:37",
    "speaker" : "Andy",
    "text" : "You just move to the next one because Yeah, that like month and a half between Brady and Cam Newton."
  },
  {
    "text" : "That was that was tough times. It was, yeah. I almost didn't make it through to our next fucking NFL MVP quarterback. I I I almost stopped.",
    "timestamp" : "01:38:37-01:38:47",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:38:47-01:38:50",
    "text" : "I almost gave up on football.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:38:49-01:39:17",
    "text" : "Yeah I'm in three and a half weeks. I'm in a group chat with thr well Steve is in one is one of them is uh our buddy Scott Kravitz and Grant Johnson and they're all pretty big Boston fans and every it's like Usually every three months I have to like send this massive message just reminding them of how how good Their life actually is in perspective of the sports world. Yeah, yeah.",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Andy",
    "text" : "Boston sports fans have to be some of the most spoiled sports fans in because in in probably all of sports maybe in the world.",
    "timestamp" : "01:39:18-01:39:26"
  },
  {
    "text" : "I mean possibly yeah you guys literally took the the city of champions and the it's it's when when Pittsburg my girlfriend's from Pittsburgh, so um When you ha when that when Pittsburgh claims, you know, we are the city of champions for this reason, this reason, this reason.",
    "speaker" : "Trevor",
    "timestamp" : "01:39:26-01:39:45"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah",
    "timestamp" : "01:39:45-01:39:46"
  },
  {
    "speaker" : "Trevor",
    "timestamp" : "01:39:46-01:39:50",
    "text" : "And then Boston comes and literally it's almost like a checkbox."
  },
  {
    "text" : "That is double.",
    "timestamp" : "01:39:50-01:39:51",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:39:51-01:40:14",
    "text" : "It's like, oh, you have all the Super Bowls, we got that. Hockey, we have a Stanley Cup. You wanna talk about World Series? Yep, we just now won two of those as well. Um when you literally just take that and mute a city from a title, I can't think of anything more disrespectful. I mean that's that's impressive, right?",
    "speaker" : "Trevor"
  },
  {
    "speaker" : "Andy",
    "text" : "Like I agree with you that my favorite stat was that we had beat St. Louis in the championship of every major sport in America.",
    "timestamp" : "01:40:14-01:40:24"
  },
  {
    "text" : "Up until they beat us in the uh Stanley ruins last year. Damn. Yeah. That would have been sweet. Right?",
    "timestamp" : "01:40:25-01:40:33",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:40:34-01:40:36",
    "text" : "Have we beaten the blues before? We have"
  },
  {
    "timestamp" : "01:40:37-01:40:39",
    "speaker" : "Greg",
    "text" : "Well, basketball team."
  },
  {
    "speaker" : "Trevor",
    "text" : "Well, e every sport that they they had.",
    "timestamp" : "01:40:41-01:40:43"
  },
  {
    "text" : "Okay. Yeah, like every every major sports team that they had.",
    "timestamp" : "01:40:44-01:40:47",
    "speaker" : "Andy"
  },
  {
    "text" : "Right. Well that's my that's my thing to Pittsburgh fans. I'm like, yeah, we're just as good at everything. And then also we have 17 NBA championship banners and you guys totally have a fucking team.",
    "timestamp" : "01:40:47-01:40:57",
    "speaker" : "Steve"
  },
  {
    "text" : "Right.",
    "timestamp" : "01:40:57-01:40:57",
    "speaker" : "Trevor"
  },
  {
    "timestamp" : "01:40:57-01:41:01",
    "speaker" : "Steve",
    "text" : "I could be a city of champions, you know, a goddamn basketball team."
  },
  {
    "timestamp" : "01:41:00-01:41:09",
    "speaker" : "Trevor",
    "text" : "And it's crazy because I've I've talked about that and it like Pittsburgh seems like they the the concept of basketball is totally oblivious. Yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:41:10-01:41:12",
    "text" : "They just they they're like, we Oh, it's not a real sport."
  },
  {
    "speaker" : "Trevor",
    "text" : "No, like it's seriously, like I think if you talk to like real like diehard Pittsburgh fans, like they'll tell you like basketball is so distant. Like even like I don't think a lot of kids they might grow up playing basketball, but I think the winner sport that they focus on is wrestling. And I think that takes away from any major basketball enthusiasm. And I think that's pretty unique to like uh I think it's that's how they closely relate to like Ohio, because I think in Ohio it's it's similar. But I think a lot of like other East Coast big cities, you know, basketball is that dominant kind of winter sport.",
    "timestamp" : "01:41:12-01:41:48"
  },
  {
    "timestamp" : "01:41:51-01:42:00",
    "text" : "Also in the in the winters they they spend a lot of time having sex with their siblings, so can't discount that time spent, you know.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:42:00-01:42:00",
    "text" : "What?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:42:05-01:42:06",
    "text" : "It sounds to me.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:42:08-01:42:10",
    "text" : "You are wearing a hoodie right now, Andy."
  },
  {
    "timestamp" : "01:42:10-01:42:16",
    "text" : "It's fucking ninety-one degrees in Virginia. Nope, it's 50 something in New Hampshire, bro.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:42:16-01:42:35",
    "text" : "All right, let's finish this thing up. I want to say that I am on this Thanksgiving day, I am thankful for you too, my brothers. I love you both. It was great meeting you, Trevor. I hope we all have another great year under our Lord and Savior Jesus Christ."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I was waiting for the bullshit the other day.",
    "timestamp" : "01:42:35-01:42:37"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:42:37-01:42:42",
    "text" : "Amen. What? Thanks. I always take Thanksgiving seriously, Stevie Dick."
  },
  {
    "timestamp" : "01:42:42-01:42:46",
    "text" : "Yeah. Thanksgiving in August, baby. Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:42:46-01:42:46",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "I'm thankful your chicken wing hat finally showed up and you didn't get built out of fifty bucks.",
    "timestamp" : "01:42:47-01:42:52",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, me too.",
    "speaker" : "Andy",
    "timestamp" : "01:42:52-01:42:53"
  },
  {
    "text" : "Spending it at some random bar in Buffalo.",
    "speaker" : "Steve",
    "timestamp" : "01:42:53-01:42:55"
  },
  {
    "speaker" : "Andy",
    "text" : "I can't wait to smell it myself.",
    "timestamp" : "01:42:55-01:42:56"
  },
  {
    "speaker" : "Steve",
    "text" : "It does look like a wrinkly ball sack, dude. An orange wrinkly ball sack.",
    "timestamp" : "01:42:57-01:43:00"
  },
  {
    "text" : "Steve, what do your balls look like if that reminds you of ball sacks, bud?",
    "speaker" : "Andy",
    "timestamp" : "01:43:05-01:43:09"
  },
  {
    "speaker" : "Steve",
    "text" : "Big, wrinkly? What do you mean?",
    "timestamp" : "01:43:10-01:43:12"
  },
  {
    "timestamp" : "01:43:13-01:43:17",
    "text" : "What do yours look like? Well, for one, they're both about the same size.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:43:17-01:43:18",
    "speaker" : "Steve"
  },
  {
    "text" : "Grand Canyon. Grand Canyon.",
    "speaker" : "Andy",
    "timestamp" : "01:43:18-01:43:21"
  },
  {
    "timestamp" : "01:43:21-01:43:27",
    "speaker" : "Steve",
    "text" : "A lot of folds. Craig, stop stop stroking."
  },
  {
    "text" : "Did you see this thing? Yeah.",
    "timestamp" : "01:43:32-01:43:33",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Trevor",
    "text" : "Yeah, I wish we I wish you guys had like an ad for some prostate, dude. That'd be a great plug-in right now.",
    "timestamp" : "01:43:38-01:43:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:43:42-01:43:51",
    "text" : "Maybe you guys tell me. What do you mean? Oh yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh that's a good that's a good question. I don't think I even know what it is if I'm being honest. It took me like twenty minutes to find it the first time.",
    "timestamp" : "01:43:52-01:44:01"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:44:01-01:44:02",
    "text" : "Wings are us."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. But if you're looking, weren't we saying we were gonna give it away to like the best Buffalo fan? Yeah, whoever leaves the best. review as a Buffalo fan, even if you're not a Buffalo fan, you can mock them with your mock review. I will send you the monkey. Chicken wing hat. So any and worth $50 on the internet. I'll send it for fucking goddamn free because I gotta get it out of my house. This fucking thing sucks.",
    "timestamp" : "01:44:02-01:44:33"
  },
  {
    "timestamp" : "01:44:34-01:44:37",
    "speaker" : "Andy",
    "text" : "All right, so the best Buffalo related review that we get."
  },
  {
    "timestamp" : "01:44:37-01:44:40",
    "text" : "Yep. Gets a free chicken wing hat.",
    "speaker" : "Greg"
  },
  {
    "text" : "Chicken wing hat. All right. All right. So Trevor, work on your uh your review.",
    "timestamp" : "01:44:40-01:44:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:44:45-01:44:50",
    "text" : "Well just just write it as a line span and then change all lines in Detroit to Buffalo.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mom",
    "timestamp" : "01:44:51-01:44:53",
    "text" : "You do that control F and it's like find and replace."
  },
  {
    "text" : "And you can uh you can do that at rate what is it?",
    "speaker" : "Andy",
    "timestamp" : "01:44:55-01:44:57"
  },
  {
    "timestamp" : "01:44:58-01:45:01",
    "text" : "Rate this podcast. com slash Patspod.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Steve, you're remembered.",
    "timestamp" : "01:45:01-01:45:02"
  },
  {
    "text" : "Look at you. You say it every time.",
    "timestamp" : "01:45:02-01:45:04",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and even I forget it. Yeah, rate this podcast.",
    "timestamp" : "01:45:04-01:45:06"
  },
  {
    "text" : "com. info for all of your latest Patriots Dynasty. info stats. You fucking nerd",
    "timestamp" : "01:45:07-01:45:13",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, so if you're Joey Harrington, you're listening to this and you want some statistics how James.",
    "speaker" : "Andy",
    "timestamp" : "01:45:16-01:45:21"
  },
  {
    "text" : "I'll tell you, if if we get Joey Harrington to listen to this podcast, I want him to rate me because I know a lot of rating of him. But I would like Joey Harrington to give me a rating. I okay on a s on a just a scale of one to five. Actually Lombardi. No, we'll do Lombardi trophies, but no NFC Championships because he didn't, as the rules say, he did not win one. So just Lombardi's.",
    "timestamp" : "01:45:21-01:45:43",
    "speaker" : "Trevor"
  },
  {
    "text" : "Alright, so yeah, so the best uh Trevor review gets his Joey Harrington jersey. Which will probably be handmade because that's how the lines work. It'll be a blue shirt. Yeah. A nice hanes.",
    "timestamp" : "01:45:43-01:46:04",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It'll be beautiful. It'll be the throwback. Yeah, we're we're signing ourselves up for things we can't do. Like you don't know how to iron Andy. I know that.",
    "timestamp" : "01:46:05-01:46:14"
  },
  {
    "speaker" : "Andy",
    "text" : "I know how to iron if it involves a prank. Don't tempt me. Alright, gentlemen. This has been a pleasure. Thank you, Trevor, for joining us.",
    "timestamp" : "01:46:15-01:46:25"
  },
  {
    "timestamp" : "01:46:25-01:46:26",
    "text" : "Thank you guys.",
    "speaker" : "Trevor"
  },
  {
    "timestamp" : "01:46:26-01:46:30",
    "speaker" : "Andy",
    "text" : "And uh we will see you all next week on the Pages Times Podcast."
  },
  {
    "speaker" : "Trevor",
    "text" : "Happy Thanksgiving. Stay away",
    "timestamp" : "01:46:30-01:46:32"
  }
]