[
  {
    "timestamp" : "00:00-00:18",
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother."
  },
  {
    "speaker" : "Andy",
    "text" : "Welcome. Welcome back to the Patriots Dynasty football. You know what? I can't do this with a video on. I can't watch it. We're gonna start this over. Welcome back to the Patriots Dynasty Podcast. 2002, still trucking along in the good times of 2002.",
    "timestamp" : "00:22-00:41"
  },
  {
    "timestamp" : "00:42-00:46",
    "speaker" : "Steve",
    "text" : "Andy, why do you think it's welcome back? This could be the first episode they listen to."
  },
  {
    "speaker" : "Andy",
    "text" : "We've been over this in earlier episodes. If you're if you're just starting to hear I don't know what to tell ya.",
    "timestamp" : "00:46-00:51"
  },
  {
    "timestamp" : "00:51-00:57",
    "speaker" : "Steve",
    "text" : "I mean if I was starting it one episode, it would be week three versus the Chiefs in two thousand two. Duh."
  },
  {
    "speaker" : "Andy",
    "text" : "I mean to be fair, this is a pretty good one off game. So if you're here just for the one off game and and you remember this, then Congrats to you. I would recommend going in 2001.",
    "timestamp" : "00:57-01:07"
  },
  {
    "text" : "What about our Spanish listeners?",
    "speaker" : "Greg",
    "timestamp" : "01:08-01:10"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh I remember Steve has um when he went to Mexico, he came back with some with some Spanish stuff that he learned.",
    "timestamp" : "01:12-01:19"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, well Everything I know about Spanish I learned from dad anyways. We already covered that.",
    "timestamp" : "01:19-01:24"
  },
  {
    "timestamp" : "01:24-01:26",
    "speaker" : "Greg",
    "text" : "We should do an episode in Spanish."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:28-01:43",
    "text" : "No. We shouldn't Fucking German. Well I took German, so I'll do it in German and you guys can do it in Spanish. Muy bien."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:43-01:46",
    "text" : "El partido was muy bueno."
  },
  {
    "speaker" : "Andy",
    "text" : "Donceres, por favor.",
    "timestamp" : "01:48-01:50"
  },
  {
    "speaker" : "Steve",
    "text" : "This game actually was pretty good.",
    "timestamp" : "01:51-01:53"
  },
  {
    "speaker" : "Andy",
    "text" : "This game was amazing. The second half of this game was amazing. It was.",
    "timestamp" : "01:53-01:57"
  },
  {
    "timestamp" : "01:58-02:03",
    "text" : "It was uh A lot like I don't remember this game, but it's definitely worth a watch.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:03-02:32",
    "text" : "Yeah, so here's something I wanted I wanted to do. I I figured we should start the game with like a watchability score. Because some of these games we're going through all of them and some of these Not so great. Um there's been some some losses to the Dolphins in Miami back in the oh one season that we definitely that would probably be at the zero on the I don't know what what scale would we do? Should we do one out of six Lombardies? Or is that is that too much of a dick measuring contest?"
  },
  {
    "text" : "Well, we haven't I mean we're gonna win more than six Lombardi, so that's just a artificial, because it could be ten in three years, you know.",
    "speaker" : "Steve",
    "timestamp" : "02:33-02:40"
  },
  {
    "speaker" : "Andy",
    "text" : "It could, but for now. And we we could always increase it. But I think for now in terms of watchability, should we do one one through six?",
    "timestamp" : "02:41-02:49"
  },
  {
    "text" : "I mean we should scale it on like coaches, you know, like what coach what coaches teams are the most fun to watch. Like Mike Mart. Mike Mart is great to watch, you know? Andy Reed, usually pretty good to watch.",
    "speaker" : "Greg",
    "timestamp" : "02:49-03:06"
  },
  {
    "speaker" : "Andy",
    "text" : "Good call. Uh Jim Harbaugh are entertaining, the very least. Yeah.",
    "timestamp" : "03:06-03:11"
  },
  {
    "text" : "Yeah. But not all of them. I like the one through six. Mike Mullarkey.",
    "speaker" : "Greg",
    "timestamp" : "03:12-03:16"
  },
  {
    "text" : "Well, they're entertaining if you're uh enjoy Pat's blowouts. Yeah. I would I would say I would put Dick for Meal games in that because As well as he could coach offense, he's that bad at coaching a defense. Big dick. So I think The the Chiefs in this this season would go eight and eight, but they would lead the the league in scoring and would be like thirtieth in Yeah, you're gonna steal my scouting report already? Oh, all right, yeah, let's do that. We haven't actually decided on a watchability score. Let's go one through six Lombardi Zandy. That's fine. It's six. It definitely is a six.",
    "speaker" : "Andy",
    "timestamp" : "03:18-03:57"
  },
  {
    "text" : "Well, actually no, let's call it a five.",
    "speaker" : "Greg",
    "timestamp" : "03:57-03:59"
  },
  {
    "timestamp" : "04:00-04:03",
    "speaker" : "Andy",
    "text" : "Okay, yeah. A five and only watch the second half, I would say."
  },
  {
    "text" : "Well, five Lombardi's and a AFC championship. So 5. 5.",
    "timestamp" : "04:04-04:08",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:08-04:10",
    "text" : "Okay. I like it."
  },
  {
    "timestamp" : "04:10-04:10",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "text" : "Is an AFC championship trophy is that even a half though?",
    "speaker" : "Andy",
    "timestamp" : "04:11-04:14"
  },
  {
    "text" : "I mean Belichick doesn't think so. And then uh AFC East is a 0. 25.",
    "timestamp" : "04:14-04:18",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Okay. All right. I like that. Fair enough.",
    "timestamp" : "04:19-04:21"
  },
  {
    "timestamp" : "04:21-04:30",
    "speaker" : "Greg",
    "text" : "So we'll give this a 5. 5 because I think there's still like maybe two marginal steps up, you know, if it wasn't week three."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:30-04:39",
    "text" : "I would I would even go a hard five. I think there was some sloppiness in this game. It was it was entertaining, but you're right. Billion penalties. Yeah."
  },
  {
    "timestamp" : "04:40-04:47",
    "text" : "Well I didn't actually watch it, so I'm gonna let you guys get the score. Let's start the score out there.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I am shocked and appalled. Yeah, all right, so the score of this one, um, for those who can actually count that high was In overtime, no less, 41-38 New England Patriots, your New England Patriots over the Chiefs. Um, which is pretty impressive considering the game was uh 10-9 Chiefs at the at the half. So this second half was, yeah, an absolute bond burner. But Greg, tell us a bit about the Chiefs. Sure. What did your scouting report say?",
    "timestamp" : "04:48-05:23"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "05:24-06:02",
    "text" : "Well, like you said, Andy, this team was as about as lopsided from offense to defense as it comes. They were f on offense this year, they were first in points and fourth in yards. And on defense they were twenty-eight Then points allowed in thirty second dead last in yards. Yeah. According to Wiki It's the second largest offense to defense imbalance in what's that 20 from 1992 to 2010. Holy shit. So almost fifteen years."
  },
  {
    "timestamp" : "06:02-06:03",
    "text" : "Yeah, well that's obvious questions.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "06:04-06:11",
    "speaker" : "Greg",
    "text" : "Uh nine nineteen ninety-two Seattle Seahawks, I guess. Wow. That's a bit a bit before my time, but yeah."
  },
  {
    "text" : "Yeah, yeah.",
    "speaker" : "Andy",
    "timestamp" : "06:11-06:12"
  },
  {
    "text" : "So if you look at the so Dick Vermil's head coach, if you look at the rosters, it makes sense too. So the offense, Trent Green quarterback, Priest Holmes. Dante Hall, Tony Gonzalez.",
    "timestamp" : "06:12-06:25",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "So their offensive line stacked as well.",
    "timestamp" : "06:25-06:28"
  },
  {
    "text" : "Yeah, Willie Rofe and Will Shields.",
    "timestamp" : "06:28-06:30",
    "speaker" : "Andy"
  },
  {
    "text" : "And uh Brian Waters or Winters.",
    "timestamp" : "06:30-06:33",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh yeah. Willie Rofe is an all-time name. Yeah.",
    "timestamp" : "06:33-06:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:36-06:38",
    "text" : "Especially for a line, but yeah."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "06:38-06:38",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Would did Berman have a nickname for him? I feel like he would have.",
    "timestamp" : "06:39-06:42"
  },
  {
    "timestamp" : "06:42-06:55",
    "speaker" : "Greg",
    "text" : "Probably. Well probably like Willie Pot Rolfe. Willy Wood. I like it Steve. But if you look at their defense, like the there's literally not a single name I recognize."
  },
  {
    "timestamp" : "06:55-07:08",
    "text" : "Yeah, I think defense is is uh is is putting it generously. Dude, these guys are fucking nobodies. Uh my favorite was uh all-time name Mike Moslovsky.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:10-07:13",
    "speaker" : "Greg",
    "text" : "Do you recognize him? He had 125 tackles that year."
  },
  {
    "text" : "I just confused him with uh with Mike Wazowski from uh Monsters Inc.",
    "timestamp" : "07:14-07:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I have Ray Crockett? Why do I know Ray Crockett's name?",
    "timestamp" : "07:21-07:25"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh you're thinking of Betty Crockett.",
    "timestamp" : "07:26-07:27"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "07:27-07:34",
    "text" : "No. Isn't he like a chest player or something? I feel like he played in a different team and I knew his name."
  },
  {
    "speaker" : "Greg",
    "text" : "He was there some. I played for Denver for a long time.",
    "timestamp" : "07:35-07:37"
  },
  {
    "text" : "I mean I reckon I saw I reckon.",
    "timestamp" : "07:37-07:38",
    "speaker" : "Steve"
  },
  {
    "text" : "I don't even recognize him.",
    "timestamp" : "07:41-07:42",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "07:42-07:44",
    "speaker" : "Steve",
    "text" : "Yeah, I didn't know anybody in their defense besides him."
  },
  {
    "text" : "No, you're thinking Faj is Andy. Patton? It's just Moss with a Ren V thrown in there.",
    "speaker" : "Greg",
    "timestamp" : "07:44-07:51"
  },
  {
    "text" : "Like what the fu Monty Beisil, didn't he play for the Pats? Badly for a few years?",
    "timestamp" : "07:51-07:58",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "07:58-08:01",
    "text" : "I feel like yeah, he was a name as well. Oh, for one."
  },
  {
    "text" : "2005, yep.",
    "timestamp" : "08:04-08:06",
    "speaker" : "Andy"
  },
  {
    "text" : "He had Morton Anderson. Kicker again.",
    "speaker" : "Steve",
    "timestamp" : "08:06-08:10"
  },
  {
    "text" : "Oh, with that hard O uh face mask. Oh yeah straight out of like the nineteen the the from the one from the nineteen seventies. I don't think that's hard when it first came in the league. Oh yeah. And he's like, I'm keeping this face.",
    "timestamp" : "08:10-08:23",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "08:23-08:48",
    "speaker" : "Greg",
    "text" : "It's the opposite of Ardo. Nah. All right, want me to continue my uh my sky I think that's all I had. Uh oh wait. Pats finally are favored in a game here. They're eight and a half point favorites going in. Over under 43 and a half. So hang on a second. I gotta go inside. I hope you bet the over. My internet's fucked."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh I th that maybe we can turn video back on?",
    "timestamp" : "08:49-08:51"
  },
  {
    "speaker" : "Greg",
    "text" : "I thought only Greg had computer problems, wasn't that? Remember that Steve?",
    "timestamp" : "08:51-08:57"
  },
  {
    "timestamp" : "08:57-09:00",
    "speaker" : "Andy",
    "text" : "These are internet problems, not computer problems."
  },
  {
    "timestamp" : "09:01-09:02",
    "speaker" : "Greg",
    "text" : "Is it not?"
  },
  {
    "speaker" : "Steve",
    "text" : "Does that mean we can turn our video back on? Did I send you that Snapchat from last night with my ear painted?",
    "timestamp" : "09:03-09:11"
  },
  {
    "text" : "No. Uh maybe. I haven't checked my Snapchat very frequently.",
    "speaker" : "Greg",
    "timestamp" : "09:11-09:14"
  },
  {
    "timestamp" : "09:14-09:18",
    "text" : "Oh you should. I've been sending you a bunch of ridiculous Snapchats.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "09:19-09:32",
    "text" : "Oh, here we go. Oh, that's that's gross. I got it. That's pretty gross. Did you uh did you see my Snapchat story right now?"
  },
  {
    "timestamp" : "09:32-09:32",
    "text" : "No.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "09:33-09:37",
    "text" : "Check that shit out. I'll give you the caption. It's called Pound Town USA."
  },
  {
    "speaker" : "Steve",
    "text" : "Should I watch this?",
    "timestamp" : "09:39-09:41"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "09:41-09:46",
    "text" : "Yeah. Those bugs be fucking."
  },
  {
    "timestamp" : "09:46-09:49",
    "text" : "You're going out and making more bugs.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "09:49-09:55",
    "text" : "It's bug porn. It's like that movie uh bug's life or that movie ants if they were fucking each other.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. The fuck. All right. And I can't I don't know how you have the mustache over your lip, Greg. That's insane. That would drive me nuts.",
    "timestamp" : "09:55-10:05",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, it's wicked gross, but the fact that Kelly's feeling hates it, so I leave it.",
    "speaker" : "Greg",
    "timestamp" : "10:06-10:11"
  },
  {
    "text" : "Yeah, I would just it would drive me nuts. Like I play with my beard hair and my my hair's getting so long I twirl it like constantly.",
    "speaker" : "Steve",
    "timestamp" : "10:12-10:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh god, yeah.",
    "timestamp" : "10:19-10:20"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, you can yeah, that's enough of that.",
    "timestamp" : "10:20-10:22"
  },
  {
    "text" : "That's so fucking gross. All right. Looking good, Gregory.",
    "speaker" : "Andy",
    "timestamp" : "10:23-10:31"
  },
  {
    "speaker" : "Greg",
    "text" : "Hey, but as look about as dumb as your fucking profile pick, bro",
    "timestamp" : "10:31-10:36"
  },
  {
    "timestamp" : "10:36-10:37",
    "text" : "Cool, bro.",
    "speaker" : "Andy"
  },
  {
    "text" : "Looks like someone outlined your head in a marker.",
    "timestamp" : "10:37-10:40",
    "speaker" : "Greg"
  },
  {
    "text" : "Cool, bro.",
    "speaker" : "Andy",
    "timestamp" : "10:41-10:42"
  },
  {
    "timestamp" : "10:47-10:49",
    "speaker" : "Greg",
    "text" : "All right. Let's talk football."
  },
  {
    "text" : "Let's talk some football.",
    "timestamp" : "10:49-10:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Alright.",
    "timestamp" : "10:51-10:52"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "10:53-10:55",
    "text" : "Steve, you want to tell me about this game?"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, I don't know how much Dick Bronil saw cause look like he was squinting the whole time with like his teeth, you know, like that.",
    "timestamp" : "10:56-11:02"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "11:03-11:05",
    "text" : "Oh yeah, yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Stuck in his teeth. Yeah. I just it took me a while to get over that.",
    "timestamp" : "11:05-11:09"
  },
  {
    "timestamp" : "11:11-11:16",
    "speaker" : "Greg",
    "text" : "But it does. Can you describe that for our listeners the best way you can? Because I just saw it on video and it makes sense."
  },
  {
    "timestamp" : "11:16-11:27",
    "text" : "Yeah, like when you squint, right? You generally like You kind of like pull your cheeks up a little bit and it's like a half smile, but he would just like let the lips go over like all the way over his teeth, show his gums and everything the whole time. Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "Or his teeth are sticking out. I mean, if you think picture Dick Vermil. And just like him squinting with his teeth sticking out. And you'll know exactly what we're talking about.",
    "timestamp" : "11:27-11:37",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "11:37-11:44",
    "text" : "I feel like it's like a horse who's got peanut butter in his mouth. He's like he's pulling his lips all the way back. Yeah, it's like that.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "11:44-11:49",
    "text" : "But I like he's that's the defining picture in my head of him though before all this. I feel like that's this natural face."
  },
  {
    "text" : "Yeah, with the squint. You've never seen him in like a rain game. He's always It's like super sunny.",
    "speaker" : "Andy",
    "timestamp" : "11:50-11:54"
  },
  {
    "timestamp" : "11:54-11:59",
    "text" : "Maybe it's just so bad this like sucking a lemon is watching his defense play.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "He's not that bad. God, he's such a white person though. So what? If you just go Google Dig for Meal, it's like this guy. This guy is the whitest human alive. He's like, Well, my wife dresses me, you know She's got a good sense of style.",
    "timestamp" : "11:59-12:19"
  },
  {
    "text" : "I have a lot of collar pullovers, but I hang them up in the on hangers because I don't want them to get wrinkled.",
    "timestamp" : "12:20-12:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I like the vest because my core stays warm, but my arms, you know, they're still nice and cool. I like to be able to move around a lot.",
    "timestamp" : "12:26-12:34"
  },
  {
    "text" : "Alright, that's enough.",
    "timestamp" : "12:35-12:36",
    "speaker" : "Steve"
  },
  {
    "text" : "You don't like our Dick Vermeel impressions? No. Oh well, actually I ha I have some audio of Dick Vermil. Because he I was apparently super pissed about the injury situation.",
    "speaker" : "Andy",
    "timestamp" : "12:37-12:48"
  },
  {
    "text" : "You talking about that halftime, like as he's walking off?",
    "timestamp" : "12:50-12:53",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, so as he's walking off our favorite Bonnie Bernstein. Uh Bonnie. Yeah yeah. She uh she went to go interview him real quick. And so she said So you're just like asking about it because there was a bunch of injuries to their defensive backs.",
    "timestamp" : "12:53-13:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Speaker 5",
    "text" : "Play that recklessly. Let's go to Bonnie Bernstein.",
    "timestamp" : "13:09-13:11"
  },
  {
    "speaker" : "Speaker 6",
    "text" : "I don't know what the cap problem safe to say this might be a sticky situation.",
    "timestamp" : "13:12-13:15"
  },
  {
    "timestamp" : "13:16-13:17",
    "text" : "We have a problem, serious problem.",
    "speaker" : "Speaker 7"
  },
  {
    "timestamp" : "13:17-13:18",
    "speaker" : "Speaker 6",
    "text" : "And how do you deal with it?"
  },
  {
    "speaker" : "Speaker 7",
    "text" : "Well we try to get the forty six man rule changed so the players we have and you on our roster can shoot up and play. That's the number one way we deal with it, but we don't. So we'll try to get a safety ready to play and help us out there. But it's a problem right now. Hopefully that Prockett can come back and play. Alright coach thanks.",
    "timestamp" : "13:18-13:34"
  },
  {
    "timestamp" : "13:37-13:38",
    "speaker" : "Greg",
    "text" : "What was he so mad about?"
  },
  {
    "speaker" : "Andy",
    "text" : "I think he they had some injuries late in the week in terms of defensive backs. And then Crockett went out. He got hurt. I think he came back eventually. His calf got stepped on or something. But uh so they were like they didn't have enough quarterbacks to to suit up. Probably why you saw an explosion of points in the second half.",
    "timestamp" : "13:42-14:02"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "14:03-14:06",
    "text" : "That makes sense. Is is Bonnie still around these days?"
  },
  {
    "text" : "Is she stat check?",
    "speaker" : "Andy",
    "timestamp" : "14:07-14:08"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm a big fan of Bonnie.",
    "timestamp" : "14:09-14:11"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:11-14:13",
    "text" : "Yeah, she was great. Let's see if she's still great."
  },
  {
    "text" : "And also, why wa we",
    "speaker" : "Greg",
    "timestamp" : "14:13-14:15"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "14:20-14:22",
    "text" : "Maybe she likes half beards, Greg."
  },
  {
    "text" : "Oh, here we go. She has been named one of the mo uh one of the most accomplished female sportscasters in history. What does that mean? One of that could be like one of like five hundred, you know?",
    "timestamp" : "14:22-14:34",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "She's on the list though. I mean n none of us can say that.",
    "timestamp" : "14:35-14:38"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't know. I mean, I guess this game isn't so much.",
    "timestamp" : "14:38-14:42"
  },
  {
    "text" : "This game was brutal in the first half, like Andy said. I had five Patrice penalties in the first five minutes. Seven in the first ten minutes, and then Brady threw a pick right after that.",
    "speaker" : "Steve",
    "timestamp" : "14:44-14:57"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:58-15:16",
    "text" : "Yeah. So the Patriots had More penalty yards and offensive yards at one point. Yeah. I think yeah, okay, yeah. At halftime the Patriots had nine penalties for 80 yards. And the Chiefs as a team had less than 80 total yards gained."
  },
  {
    "speaker" : "Steve",
    "text" : "But one of them was a pretty good back shoulder throw from Trent Green. For that touchdown.",
    "timestamp" : "15:16-15:21"
  },
  {
    "text" : "That's his only good throw, yeah.",
    "speaker" : "Andy",
    "timestamp" : "15:22-15:23"
  },
  {
    "timestamp" : "15:23-15:24",
    "speaker" : "Greg",
    "text" : "The legend."
  },
  {
    "speaker" : "Steve",
    "text" : "But yeah, if you are gonna watch this, skip it the whole first half. Actually, no, no, no. Watch that Kevin Falk wheel route touchdown. Oh, that was pretty that was an absolutely perfect ball from Brady. Hit him like that.",
    "timestamp" : "15:26-15:38"
  },
  {
    "timestamp" : "15:39-15:46",
    "text" : "Well you can do is you can go to the uh Patriots Dynasty website. Patriots Dynasty. info slash game slash 69.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:47-15:48",
    "text" : "Ooh.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Why don't you watch the the Falk highlight in the highlights section and then go back and watch the full game. The full second half.",
    "timestamp" : "15:49-15:58"
  },
  {
    "speaker" : "Greg",
    "text" : "Why is it game sixty-nine?",
    "timestamp" : "15:58-16:00"
  },
  {
    "timestamp" : "16:00-16:10",
    "text" : "Uh it's just a randomly generated number. It's the 69th the 69th piece of content created on the website. That's the it just happened to be this game, so it worked out well for us.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "16:10-16:14",
    "speaker" : "Greg",
    "text" : "Of course. Of course. Yes. Perfect. Why didn't why didn't I guess that?"
  },
  {
    "speaker" : "Andy",
    "text" : "Because you're not a nerd, Gregory.",
    "timestamp" : "16:15-16:16"
  },
  {
    "text" : "Well you see it's a series of ones and zeros.",
    "speaker" : "Greg",
    "timestamp" : "16:17-16:20"
  },
  {
    "timestamp" : "16:22-16:25",
    "text" : "It's a fucking number. Doesn't mean anything. It's just there.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "16:25-16:26",
    "speaker" : "Greg",
    "text" : "Shut up."
  },
  {
    "timestamp" : "16:26-16:27",
    "speaker" : "Andy",
    "text" : "Shut up, nerd."
  },
  {
    "text" : "I don't want to hear it. You fucking nerd. Fucking Luddite. Luddite, is that what you call it?",
    "speaker" : "Greg",
    "timestamp" : "16:28-16:34"
  },
  {
    "text" : "Yeah, I called you a fucking Luddite.",
    "speaker" : "Andy",
    "timestamp" : "16:35-16:36"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "16:37-16:54",
    "text" : "Let me Google that. Uh a person a Luddite, uh it says derogatory. A person opposed to new technology or ways of working. You wanna hear it in a sentence?"
  },
  {
    "timestamp" : "16:54-17:00",
    "speaker" : "Andy",
    "text" : "Please. I think I just used in a sentence, but yes, please. Greg, you're a fucking Luddite."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "17:00-17:18",
    "text" : "Uh a small-minded Luddite resisting progress. Oh, there's a historical definition. Okay. A member of any of the bands of English workers who destroyed machinery, especially in cotton and woolen mills, that they believed was threatening their jobs, 1811 through 1816."
  },
  {
    "timestamp" : "17:20-17:23",
    "speaker" : "Andy",
    "text" : "Yeah, the Luddites. The Luddites of England."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "17:23-17:49",
    "text" : "They've they heat cotton machines. And you know what I hate more than cotton machines? Woolen machines. Cotton and woolen. Yeah. That's too much technology for me. I'm up. Yeah. If that makes me a Luddite, then god damn it I'm a Luddite. Yeah, I'm taking this one off the rails here, boys."
  },
  {
    "text" : "Let's get back on track. Second half.",
    "speaker" : "Steve",
    "timestamp" : "17:52-17:53"
  },
  {
    "text" : "Speaking of let it's how about these commentators?",
    "timestamp" : "17:55-17:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "17:58-18:00",
    "text" : "I thought they were good-ish."
  },
  {
    "timestamp" : "18:02-18:38",
    "speaker" : "Andy",
    "text" : "Theodorf wasn't as bad as I remembered. With some exceptions. There's Diodorf and Dick Emberg. I mean there's atrocious. Now that I figured out how to do uh audio, like import audio into this, I've got a couple clips. I've got one for Dick Emberg. Ooh, um that's cool. And I just want to set the scene that it was a a quick like bubble screen to Dion Branch that went for a couple yards. But um this is how it sounded f on the television broadcast"
  },
  {
    "timestamp" : "18:38-18:41",
    "speaker" : "Greg",
    "text" : "Look at this technology. Andy Ana what I for a first time."
  },
  {
    "timestamp" : "18:41-18:52",
    "speaker" : "Speaker 5",
    "text" : "That's a great replayer. Little flanker screen. No, it's to Antoine Smith who was made it make it Kevin Falk was flanked out there or is it Dion Deon branch?"
  },
  {
    "timestamp" : "18:53-19:06",
    "text" : "Hey, hitting in the crowd of big the And uh just for the record, if you were watching that, uh It was clearly showing Dion Branch the entire time. Number one. Completely abblazon.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "19:06-19:10",
    "speaker" : "Greg",
    "text" : "To his defense, all all All those guys have a three in their number."
  },
  {
    "timestamp" : "19:11-19:15",
    "speaker" : "Andy",
    "text" : "Technically, yeah. Yeah. One one's about a foot taller than the other."
  },
  {
    "timestamp" : "19:15-19:19",
    "speaker" : "Greg",
    "text" : "Yeah. And Antoine Smith never lines up at wide receiver, but"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:20-19:39",
    "text" : "They do they do all have threes in them. I will say though, they had a sweet golf reference, so I was all about that. All right, what was it? Let's hear it. It was uh it was on a punt in the second quarter. I don't forget he even punted it, but he yeah, I hit it at the one and had a little backspin on it."
  },
  {
    "speaker" : "Andy",
    "text" : "Walter.",
    "timestamp" : "19:41-19:41"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:42-19:46",
    "text" : "Yep I forget his reference was, but I had my own. I was like, he should call it a Kv1."
  },
  {
    "speaker" : "Andy",
    "text" : "Something about a sandwich and his his sandwich doesn't do that.",
    "timestamp" : "19:46-19:49"
  },
  {
    "text" : "Yeah. Maybe the punter was using a KV one. No? Sure.",
    "timestamp" : "19:49-19:54",
    "speaker" : "Steve"
  },
  {
    "text" : "What's that?",
    "speaker" : "Greg",
    "timestamp" : "19:54-19:55"
  },
  {
    "text" : "Nope. Pro V1? Never mind. The K-ball.",
    "timestamp" : "19:55-19:58",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "19:58-20:01",
    "speaker" : "Greg",
    "text" : "I have a Pro V1. What's the Kv1?"
  },
  {
    "timestamp" : "20:01-20:04",
    "speaker" : "Steve",
    "text" : "You know, the that joke's too high class for you guys to say."
  },
  {
    "timestamp" : "20:04-20:24",
    "speaker" : "Greg",
    "text" : "What's a sand wedge? You wanna hear something funny, Steve? Is I have I've had a sleeve of Pro V ones for about two years that I am unwilling to use because I know that I'm just gonna put them in the woods. So it just sits there in my bag. Yeah, and I just slice away on my range balls."
  },
  {
    "timestamp" : "20:25-20:43",
    "speaker" : "Andy",
    "text" : "Oh yeah, I think I've golfed with you boys once, maybe twice. And uh I I've actually left the golf course with more balls than I came with because I just use whatever I can find. I hit a ball in a certain direction, then I just go and find whatever ball is out there in the woods. And then I use that one."
  },
  {
    "speaker" : "Steve",
    "text" : "The last time me and Greg played together, Greg just took some range balls onto the course with him. And then we got matched up with a member. And that guy was like. You're using the range balls. And Greg's like, yeah, whatever. So that guy spent the next two holes and was like walking through the woods tossing out balls for Greg to use.",
    "timestamp" : "20:44-21:05"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:05-21:22",
    "text" : "He didn't hit a single shot. He wouldn't even He would get in his cart and he would drive it around to where my first shot landed and just like drop two real balls next to mine and just keep driving. He was the best. He's like the tooth fairy for like real golf balls."
  },
  {
    "timestamp" : "21:25-21:32",
    "speaker" : "Steve",
    "text" : "Well, once we got past that snoozer first quarter, second quarter. Second half was awesome."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:32-21:33",
    "text" : "Things really picked up."
  },
  {
    "text" : "They did, yeah. Even the third quarter wasn't like crazy, but it it was kind of starting to get there. Dude, the third quarter had my favorite moment the whole game. Right, which one was that?",
    "timestamp" : "21:33-21:46",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:47-22:24",
    "speaker" : "Steve",
    "text" : "Well the Chiefs scored that touchdown, right? So they're up. Yeah. And then this was like the Troy Brown drive. Where Brady just like they started playing zone and Brady just goes, Troy, Troy, he goes four in a row to Troy Brown. And then five in a row. Yeah, well then the fifth one was a touchdown where like Brady was getting blown up. He knew he was gonna take a hit and He just like throws it to the corner of the end zone because he just knows that Troy's gonna see the same shit he sees and go to the spot. Like he threw it to a spot, not even to Troy. And Troy made a sick ass sliding, diving, catch."
  },
  {
    "timestamp" : "22:24-22:28",
    "speaker" : "Greg",
    "text" : "Yeah, this I wish you could arguably say this is Troy Brown's like best game."
  },
  {
    "timestamp" : "22:29-22:33",
    "speaker" : "Steve",
    "text" : "I would think that's right up there with the uh Steelers AFC Championship one. Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "22:33-22:37",
    "text" : "This one yeah, this one from a productive standpoint was was better, like an offensive."
  },
  {
    "speaker" : "Steve",
    "text" : "And he got hurt too with like in the third or early fourth quarter.",
    "timestamp" : "22:38-22:41"
  },
  {
    "timestamp" : "22:42-22:53",
    "text" : "Yeah, and and didn't come back. That's Diodorf thought he did come back. Yeah, in overtime. Look, oh, and Troy Brown's back from his injury.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:53-22:57",
    "speaker" : "Steve",
    "text" : "And it was I was like, yeah. And then I was like, no, let's not try it"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "22:58-23:27",
    "text" : "This is what I mean. Yeah, that was pretty bad. I I at one point I was getting all worked up and I was getting kind of like nervous that Deodorf and Emberg weren't as bad as I thought they were. Uh uh no, I I remember this correctly. They were that bad. But yeah, Troy Brown ended the day with uh team record 16 catches for 176 yards. Which today is still tenth all time on the Patriots. In terms of in terms of yards. It's still first in terms of catches"
  },
  {
    "timestamp" : "23:27-23:30",
    "speaker" : "Greg",
    "text" : "Talking about a PPR game, huh? Jesus."
  },
  {
    "timestamp" : "23:30-23:35",
    "text" : "Okay, so that 16 catches still stands. It's like better than Welker or anybody?",
    "speaker" : "Steve"
  },
  {
    "text" : "He's tied for first. With in catches, yes.",
    "timestamp" : "23:35-23:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "23:40-23:53",
    "text" : "Welker? Yeah. What game was that? Give us a clue. Is it a big game? Uh against Buffalo. In Buffalo. Yeah. Did I get it?",
    "speaker" : "Greg"
  },
  {
    "text" : "Final score?",
    "speaker" : "Andy",
    "timestamp" : "23:53-23:55"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh they they won that. No, they lost that game. That's the one where Fred Jackson had that like run that put Buffalo and Field Guard.",
    "timestamp" : "23:55-24:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Like they went up twenty-one nothing and then they lost ended up losing to thirty-four thirty-one. 'Cause I think uh that was um what's his name from the from Harvard. From Harvard.",
    "timestamp" : "24:04-24:14"
  },
  {
    "timestamp" : "24:15-24:17",
    "speaker" : "Greg",
    "text" : "Ryan Fitzpatrick. Thank you."
  },
  {
    "text" : "It was a Ryan Fitzpatrick game where he started the game throwing three interceptions and then turned around and still like threw four touchdowns.",
    "timestamp" : "24:17-24:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I love Fitzpatrick. He's the best.",
    "timestamp" : "24:24-24:26"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:27-24:36",
    "text" : "But was Walker in that game, which I'm excited to get to now that I know this. 16 catches, 217 yards, and two touchdowns."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "24:36-24:37"
  },
  {
    "timestamp" : "24:37-24:41",
    "speaker" : "Steve",
    "text" : "Who you got Brown, Welker, Edelman. Like rank 'em."
  },
  {
    "text" : "Because they all made the same z I like kinda have a sour taste in my mouth about about Welker.",
    "speaker" : "Greg",
    "timestamp" : "24:44-24:50"
  },
  {
    "speaker" : "Andy",
    "text" : "A lot of people do because of his drop in the Super Bowl and the fact they never actually won one.",
    "timestamp" : "24:51-24:55"
  },
  {
    "text" : "Yeah. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "24:55-24:56"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean Troy Brown's gotta be number one. Yeah, what are we ranking this off of? How much we like the guys? Because Troy Brown uh Troy Brown's definitely number one if that's the case.",
    "timestamp" : "24:57-25:05"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. In their prime, who you got? Who would you like pick? Troy Brown.",
    "timestamp" : "25:05-25:11"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:11-25:14",
    "text" : "In their in their prime, probably welcome to be honest."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "25:14-25:19",
    "text" : "His numbers are are Yeah, but he benefited from Randy Moss too."
  },
  {
    "text" : "True, but he was also like doing shit on his own as well.",
    "timestamp" : "25:19-25:22",
    "speaker" : "Andy"
  },
  {
    "text" : "Like I said offense was like running gun. That's when they were running that r hurry up. And they were getting they were getting off like seventy-five to ninety-five plays a game, you know.",
    "timestamp" : "25:22-25:33",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "So it's not like it was just with",
    "timestamp" : "25:37-25:38"
  },
  {
    "timestamp" : "25:39-25:46",
    "speaker" : "Steve",
    "text" : "with him. Um here's a knock on Welker though. No special teams like Troy and Julian definitely had impacts as punt returners."
  },
  {
    "timestamp" : "25:46-25:57",
    "speaker" : "Andy",
    "text" : "Welker used to return punts, but then I think because he was so valuable to the offense they had Edelman start doing it instead. And I remember when they made the switch and I thought Eldrim wasn't as good."
  },
  {
    "text" : "Also a a knock on Welker is his face kind of looks like dumb. Yeah, he's kind of got dumb face.",
    "timestamp" : "25:58-26:04",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "That's true.",
    "timestamp" : "26:05-26:05"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Like Julian. Even Troy Brown, like he's kind of a normal looking guy. Yeah. Welker.",
    "timestamp" : "26:06-26:14"
  },
  {
    "text" : "Pretty gorgeous.",
    "timestamp" : "26:14-26:15",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:15-26:20",
    "speaker" : "Greg",
    "text" : "He's got like dumb face. He's got like man manning forehead, you know, where he gets like the mark from the helmet."
  },
  {
    "text" : "Yeah, yeah, yeah. His helmet's not too tight. Mm-hmm. Mm-hmm. Yep. That's fair. That's fair.",
    "timestamp" : "26:21-26:26",
    "speaker" : "Andy"
  },
  {
    "text" : "I would go Troy Edelman Walker. I think Edelman doesn't get enough cred.",
    "timestamp" : "26:26-26:30",
    "speaker" : "Steve"
  },
  {
    "text" : "What about you think Troy Brown would have a like huge numbers if he played more seasons with Brady?",
    "timestamp" : "26:31-26:36",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "26:36-26:47",
    "speaker" : "Andy",
    "text" : "I mean he he did in those first few years, yeah, so probably. Yeah. And I think just in general, I think you would have bigger numbers in the more pass heavy offenses of today anyway."
  },
  {
    "text" : "Yeah, but even like as opposed to a blood so where I feel like Brady relies on that slot receiver that can just find spaces, like work through his zone and get open. Like, I feel like that's Troy Brown to a T, right? Like Way more so than Bloodsaw.",
    "timestamp" : "26:48-27:04",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "27:05-27:27",
    "speaker" : "Andy",
    "text" : "But it was a it was a different game. Like I I feel like Troy Brown's game was a lot different than Welker and Ellen. in terms of like welcome idleman are more that quick shifty kind of guy who can change direction real quick and that was never really Troy Brown's game in terms of like route running, you know? Yeah. I just felt like Troy Brown knew where to sit in terms of a zone."
  },
  {
    "text" : "He's pretty shifty though. Maybe not.",
    "speaker" : "Greg",
    "timestamp" : "27:27-27:29"
  },
  {
    "speaker" : "Andy",
    "text" : "He's definitely shifty. And he also like I feel like Troy Brown got a lot of his yards on those like quick bubble screens too. Because he was a kind of like punt returner guy.",
    "timestamp" : "27:29-27:40"
  },
  {
    "timestamp" : "27:40-27:42",
    "speaker" : "Steve",
    "text" : "Who got the most touchdowns?"
  },
  {
    "text" : "Most touchdowns?",
    "speaker" : "Greg",
    "timestamp" : "27:43-27:44"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, because that was always, I mean, Edelman and Welker never scored touchdowns, really. It's true.",
    "timestamp" : "27:44-27:50"
  },
  {
    "timestamp" : "27:50-27:52",
    "speaker" : "Andy",
    "text" : "He just had the catches, but never had that many touchdowns."
  },
  {
    "text" : "Yeah, but Troy seems to be, I mean, re-watching all these games and seeing him game in, game out, he's a little bit more of like a downfield threat. than just that slot. So he's seemed to score a little bit more.",
    "speaker" : "Steve",
    "timestamp" : "27:52-28:02"
  },
  {
    "text" : "Interesting.",
    "timestamp" : "28:03-28:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Like even that touchdown I just referenced.",
    "timestamp" : "28:04-28:05"
  },
  {
    "timestamp" : "28:05-28:25",
    "speaker" : "Greg",
    "text" : "I don't know if that's a wait. What is this ranking it on? Touchdowns. All right, so the first one is there are eight, nine, and ten. Really? Really? This can't be right. You want to guess the order?"
  },
  {
    "timestamp" : "28:26-28:31",
    "text" : "Are we talking like eighth place, ninth place, tenth place, or are they have eight, nine, and ten touchdowns?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "No, eight, eighth, eighth place, ninth place, tenth place.",
    "timestamp" : "28:31-28:34"
  },
  {
    "text" : "I think Troy probably has the longevity, right? He's been there in Wes.",
    "speaker" : "Steve",
    "timestamp" : "28:36-28:40"
  },
  {
    "speaker" : "Greg",
    "text" : "Wrong.",
    "timestamp" : "28:41-28:42"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:44-28:45",
    "text" : "Welcome."
  },
  {
    "speaker" : "Greg",
    "text" : "Welker has got 37, Edelman 36, Troy Brown 31. Dude, Randy Moss. Three years he's got 50 touchdowns.",
    "timestamp" : "28:46-28:57"
  },
  {
    "speaker" : "Steve",
    "text" : "That's ridiculous.",
    "timestamp" : "28:57-28:58"
  },
  {
    "speaker" : "Greg",
    "text" : "51. Insane.",
    "timestamp" : "28:58-29:00"
  },
  {
    "text" : "So if we're counting all touchdowns, not just receptions. And playoffs, yep.",
    "timestamp" : "29:01-29:08",
    "speaker" : "Andy"
  },
  {
    "text" : "Dude, Stanley Morgan, 67.",
    "timestamp" : "29:08-29:11",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:12-29:18",
    "text" : "I've just gone back uh from 2000 from the the Brady Belichick era."
  },
  {
    "text" : "Dude. Greg, how many like punt return touchdowns do they all have? Yeah.",
    "timestamp" : "29:18-29:22",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "29:23-29:29",
    "text" : "I'm talking I'm talking total touchdowns. Where is it even on this list? He has to be a good thing.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Because you think like if you had factoring in special teams.",
    "timestamp" : "29:29-29:33"
  },
  {
    "speaker" : "Andy",
    "text" : "So all touchdowns, just like that they had something to do with, be it run, pass, catch Punt return, kick return. What what what which order was your list, Greg?",
    "timestamp" : "29:34-29:46"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh Welker Edelman Brown.",
    "timestamp" : "29:47-29:50"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. Uh in terms of all touchdowns, how would you put them?",
    "timestamp" : "29:50-29:55"
  },
  {
    "text" : "Brown, Edelman Welker.",
    "timestamp" : "29:56-29:58",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Greg? Really? Edelman has forty seven touchdowns. He's thirty seven. He threw a couple, he's got some punt return ones as well.",
    "timestamp" : "29:59-30:15"
  },
  {
    "timestamp" : "30:15-30:17",
    "speaker" : "Greg",
    "text" : "Yeah. Oh, throw and counts? Yeah."
  },
  {
    "timestamp" : "30:18-30:30",
    "text" : "All all touchdowns. Oh, all right. Welker has 41, Troy Brown has 28. Dude, this says Gino Capoletti has 42. He's a kicker.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Was he a kicker slash quarterback? Quarterback? This is T D receptions. The list I'm looking at.",
    "timestamp" : "30:30-30:39"
  },
  {
    "speaker" : "Andy",
    "text" : "Wow. I mean that's that's pretty impressive.",
    "timestamp" : "30:39-30:43"
  },
  {
    "timestamp" : "30:44-31:04",
    "speaker" : "Greg",
    "text" : "Gino Capoletti. This can't be right. Receiving in Russian Damn, yeah. Yeah. Apparently you paid you got f you caught as many as fifty passes in a season. God damn. I didn't I didn't know that at all."
  },
  {
    "speaker" : "Andy",
    "text" : "No, I thought it was just a kicker.",
    "timestamp" : "31:04-31:06"
  },
  {
    "timestamp" : "31:07-31:10",
    "speaker" : "Greg",
    "text" : "You he's in the Hall of Fame for kicking, right?"
  },
  {
    "text" : "I thought so. Static.",
    "timestamp" : "31:10-31:13",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, you tell us.",
    "speaker" : "Greg",
    "timestamp" : "31:13-31:15"
  },
  {
    "timestamp" : "31:15-31:18",
    "speaker" : "Andy",
    "text" : "I don't know what this you're looking at, but do you have to"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean I guess you do have to have a position, right?",
    "timestamp" : "31:19-31:22"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:23-31:32",
    "text" : "Yeah, oh you have to have a position. Dude, what what a beast. Right? I just love him from his uh It's commentation on the radio."
  },
  {
    "text" : "Ooh, speaking of great commentation, what did you think of when uh one asks the other, please no more tickling? They were talking about their tickle fight, Andy? I thought of you.",
    "timestamp" : "31:32-31:42",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "It didn't tickle the line because there's no tickling in football.",
    "timestamp" : "31:43-31:46"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:46-31:49",
    "text" : "Yeah. But then they talked about tickling for like five minutes. Yeah."
  },
  {
    "timestamp" : "31:50-31:52",
    "speaker" : "Andy",
    "text" : "Oh yeah. That was a lot of tickling talk."
  },
  {
    "text" : "TikTok. That's how TikTok got started. It was actually just videos of people tickling each other.",
    "timestamp" : "31:54-31:59",
    "speaker" : "Greg"
  },
  {
    "text" : "And then talking about it.",
    "speaker" : "Andy",
    "timestamp" : "32:00-32:01"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:01-32:04",
    "text" : "Yeah, and then disc discussing afterwards."
  },
  {
    "speaker" : "Steve",
    "text" : "Also on the broadcast, they're like, what is the most heated rival? Dolphins Jets, Bill's Dolphins, Browns Steelers, Chiefs Raiders, Broncos, Raiders, Broncos Chiefs. What was the answer? I don't it was like a AOL. com poll, yeah.",
    "timestamp" : "32:04-32:21"
  },
  {
    "text" : "I think the answer is none of the above. I mean, they're all terrible now.",
    "timestamp" : "32:22-32:27",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, maybe.",
    "timestamp" : "32:28-32:28"
  },
  {
    "speaker" : "Andy",
    "text" : "Back in the day probably yeah. I don't know.",
    "timestamp" : "32:29-32:31"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "32:31-32:45",
    "text" : "Well even like if you look at this through today's lens Dolphins Jets? No. Bills Dolphins? No. Browns Steelers? No. Chiefs Raiders? Not really. Broncos Raiders? No. Broncos Chiefs, it's gotta be one of the cheese ones."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it's gotta be it, I guess.",
    "timestamp" : "32:46-32:47"
  },
  {
    "speaker" : "Greg",
    "text" : "Yo, Geno Capillet's positions.",
    "timestamp" : "32:47-32:50"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "32:50-32:51"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh F L S E.",
    "timestamp" : "32:51-32:53"
  },
  {
    "speaker" : "Andy",
    "text" : "Flanker. Split end.",
    "timestamp" : "32:54-32:56"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:56-32:57",
    "text" : "Split end."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "32:57-32:57"
  },
  {
    "timestamp" : "32:57-32:59",
    "speaker" : "Greg",
    "text" : "Defensive back, wide receiver, kicker."
  },
  {
    "speaker" : "Andy",
    "text" : "God damn.",
    "timestamp" : "33:00-33:01"
  },
  {
    "timestamp" : "33:01-33:04",
    "speaker" : "Greg",
    "text" : "Dude, I need I need footage of Gino."
  },
  {
    "speaker" : "Andy",
    "text" : "I think we may have to do an episode on Gino Capoletti. And his nickname was Duke.",
    "timestamp" : "33:05-33:10"
  },
  {
    "text" : "Ooh, love that. Duke. Hell yeah. That is such a sixties nickname. All right. AOS. Duke Capaletti. Duke Capoletti, you know It's my sixties character. Yeah, was it? Yeah.",
    "speaker" : "Greg",
    "timestamp" : "33:10-33:26"
  },
  {
    "text" : "Uh what position you play, Duke? Ah, you know, flanker. Split end.",
    "speaker" : "Andy",
    "timestamp" : "33:28-33:34"
  },
  {
    "timestamp" : "33:34-33:40",
    "text" : "Split end. Do you think he uh he played with Bucko Kilroy? Ooh, Bucko.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Bucko.",
    "timestamp" : "33:41-33:41"
  },
  {
    "timestamp" : "33:42-33:43",
    "text" : "I bet they didn't get along.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:43-33:45",
    "speaker" : "Greg",
    "text" : "They were smoking cigarettes on the sidelines."
  },
  {
    "text" : "Bucko was dirty.",
    "speaker" : "Andy",
    "timestamp" : "33:46-33:47"
  },
  {
    "text" : "Yeah, they're just hammered. Stand up dude. That's what I'm saying. I bet he's got some skeletons in his closet.",
    "timestamp" : "33:47-33:56",
    "speaker" : "Greg"
  },
  {
    "text" : "Just to say, I bet he played the game the right way. You just you can just feel from the way he I'm gonna stat check that. I'm gonna stat check that I don't think you are.",
    "timestamp" : "33:57-34:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm gonna put Gino Capaletti controversy into the Google. com machine.",
    "timestamp" : "34:05-34:09"
  },
  {
    "speaker" : "Steve",
    "text" : "But okay. Let's not I don't even want to go down that hole, even if it exists. Let's talk about this game.",
    "timestamp" : "34:09-34:15"
  },
  {
    "timestamp" : "34:16-34:32",
    "speaker" : "Andy",
    "text" : "Speaking of holes, uh I I because it's Speaking of Holes. Uh I yeah, I'm a little uh I'm a little disappointed that Mike didn't get to be here for the Dan Diadorf Dickenberg era because even I could get the football, not football on this."
  },
  {
    "speaker" : "Greg",
    "text" : "And so I've got uh just a couple.",
    "timestamp" : "34:32-34:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Um but there's one where they were talking about uh Tabucky Jones from his safety spot was pounding the whole way. And I'm not sure that's grammatically correct. But what what is he doing?",
    "timestamp" : "34:36-34:48"
  },
  {
    "timestamp" : "34:48-34:57",
    "speaker" : "Greg",
    "text" : "He's It just said he's pounding the whole way. Yeah, that's how you scrape through the hall. Pounding the hole away?"
  },
  {
    "speaker" : "Andy",
    "text" : "No, pounding the whole way. That's how you squirt through the hole, Andy. Because I think he got the the sack and so he's pounding the end away. To the the the quarterback?",
    "timestamp" : "34:57-35:08"
  },
  {
    "text" : "So pounding the entire way.",
    "timestamp" : "35:08-35:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:12-35:17",
    "text" : "In a sense. Pounding."
  },
  {
    "speaker" : "Andy",
    "text" : "He pounded the whole way to squirt through the hole. I mean he did. He squirt through the hole and got the sack, I think.",
    "timestamp" : "35:18-35:22"
  },
  {
    "text" : "And they forced uh interception actually.",
    "timestamp" : "35:23-35:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:26-35:33",
    "text" : "Uh and then I don't know who it was, but somebody was smacked by three chiefs. Which I I didn't think you could show on TV."
  },
  {
    "speaker" : "Greg",
    "text" : "Smacked by three chiefs?",
    "timestamp" : "35:34-35:36"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "35:36-35:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "35:37-35:44",
    "text" : "Like just smacked by three chiefs. Why is that? Why is that an innuendo?"
  },
  {
    "text" : "I'll stick it back too. If I have to explain it to you. I mean they didn't say spanked. They said smacked. Well what what were you when you were getting spanked as a child, what was that called?",
    "timestamp" : "35:46-35:57",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:58-36:15",
    "speaker" : "Greg",
    "text" : "Yeah, but that's like uh I think that's like a our family thing. I don't know if it is. Smacked? Smacked to me means you get s like slapped in the face. Oh, you want me to Google smack? That check smack."
  },
  {
    "timestamp" : "36:15-36:21",
    "speaker" : "Steve",
    "text" : "See if it has anything to do with butt spankings. You can smack your kid around, right?"
  },
  {
    "timestamp" : "36:21-36:23",
    "speaker" : "Andy",
    "text" : "Yeah, you can smack anybody around, really."
  },
  {
    "timestamp" : "36:24-36:40",
    "speaker" : "Greg",
    "text" : "The the use it in a sentence they they say she gave Mark a smack across the face. Oh, you want to hear another one? Jessica smacked his face quite hard. I ran smack into the back of a park truck. Okay. None of this has to do with spanking, Zandy."
  },
  {
    "timestamp" : "36:41-36:43",
    "text" : "I think you're looking it up on the wrong website, Gregory.",
    "speaker" : "Andy"
  },
  {
    "text" : "It's Google. com, man. If I have that's my case. What do you want to ask Jeeves about smack slash spanking?",
    "speaker" : "Greg",
    "timestamp" : "36:43-36:51"
  },
  {
    "timestamp" : "36:52-36:52",
    "text" : "Urban dictionary.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "36:53-36:58",
    "text" : "It's the real Oh, there you go. No, what was it what was the other one? Urban uh thesaurus.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh here we go. Wiki diff There's a the wiki diff like what's the difference? And I have spank versus smack. As as verbs, the different difference between spank and smack is that spank is to beat, smack, or slap a person's buttocks. With a bare hand or other object as punished as punishment gesture or a form of sexual interaction.",
    "timestamp" : "36:59-37:35"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:37-37:42",
    "text" : "So I'm gonna say that's football then. I think we've cleared this up. I think so too."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:42-37:43",
    "text" : "That's football."
  },
  {
    "timestamp" : "37:43-37:49",
    "text" : "If those three Chiefs had spanked him, then Oh boy.",
    "speaker" : "Steve"
  },
  {
    "text" : "Alright, so then this is similar, but I don't know if this will create the same controversy because it said gift. Well they both took wax. That one's not innuendo either. Uh Google Wax, would you?",
    "timestamp" : "37:50-38:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "38:08-38:15",
    "speaker" : "Steve",
    "text" : "Whack? Okay. We're just Googling random verbs. I'm with Greg on this one. That is not induendo either, Andy."
  },
  {
    "text" : "It didn't tickle the line because there's no tickling in football. Yes, tackling.",
    "timestamp" : "38:16-38:20",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "38:21-38:30",
    "speaker" : "Greg",
    "text" : "Tickle. Yeah. You're you're only tickling well, I guess you could tickle a child. True. Let's not go down that path though."
  },
  {
    "speaker" : "Andy",
    "text" : "But what about what what's tickling the line mean?",
    "timestamp" : "38:30-38:33"
  },
  {
    "speaker" : "Greg",
    "text" : "You know, a tickler. Just a coochie goochie.",
    "timestamp" : "38:33-38:36"
  },
  {
    "text" : "All right, back to the game.",
    "timestamp" : "38:36-38:38",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "All right, doctor.",
    "timestamp" : "38:38-38:38"
  },
  {
    "timestamp" : "38:39-38:43",
    "text" : "Pads start opening it up, right? They uh Daniel Graham's first touchdown.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:44-38:45",
    "text" : "One handed snag."
  },
  {
    "speaker" : "Steve",
    "text" : "Did actually and this was good commentating on their part. He saw he said oh you only use one hand on that catch. And then on the replay you can see that he's literally left hand snags it and secures it without even using his other hand.",
    "timestamp" : "38:45-38:56"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true.",
    "timestamp" : "38:56-38:57"
  },
  {
    "text" : "And he looked pretty fast, like he outran a cornerback to the end zone. Yep.",
    "timestamp" : "38:57-39:01",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, he looked like what I think uh that he was supposed to be the Bang Coach replacement. Yeah. You had that he was big fast dude with hands.",
    "timestamp" : "39:02-39:12",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "We force a fumble, Victor Green. Rips it out of uh Priest Holmes, I think.",
    "timestamp" : "39:12-39:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Pre-Solms had a big run too. It was like 17, 18 yards. And then Pat turned there.",
    "timestamp" : "39:17-39:22"
  },
  {
    "speaker" : "Steve",
    "text" : "Bad. Brady kind of threw it behind him, but Patton one-handed it as well and used that pivot turn and just gone for the touchdown.",
    "timestamp" : "39:23-39:31"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that was a great catch.",
    "timestamp" : "39:31-39:32"
  },
  {
    "timestamp" : "39:32-39:48",
    "speaker" : "Steve",
    "text" : "At that point, Brady, excluding like his slow start, was 27 for 36, four TDs and three twelve. In 2002, which is like insane, right? Yeah. I was like, how the fuck do we miss a playoffs? We're looking like an absolute wagon."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Um except except on offense anyway. Yeah.",
    "timestamp" : "39:49-39:53"
  },
  {
    "timestamp" : "39:53-40:19",
    "speaker" : "Greg",
    "text" : "Hey Connor kind of made a point earlier this year about like like Brady announcing like he's here. And like these three games, mm-hmm, pr this is like last year was like, okay, Brady's like a game manager Right. Like he's he makes big plays and big moments, but he's not putting up crazy stats. Like these three games, he is slinging all over the place. We have four hundred plus yards in this game."
  },
  {
    "speaker" : "Andy",
    "text" : "Four touchdowns, like four ten. Yeah.",
    "timestamp" : "40:19-40:21"
  },
  {
    "text" : "Yeah. So th this is where like to me Brady like Anybody can be a Joe Flacco won a Super Bowl, right? Eli Eli Manning's done it twice where he goes on a hot streak and rides it.",
    "timestamp" : "40:26-40:38",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "40:38-40:40",
    "text" : "But who is Baltimore?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Joe Flacco.",
    "timestamp" : "40:41-40:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:42-40:49",
    "text" : "No, the the yellow one. I was like, what do you mean when you said uh shots fired"
  },
  {
    "speaker" : "Steve",
    "text" : "Kyle Bowler or Trent Doeffler. Yeah, Trent Doffler. He won it with um Rich Gannon's got one, right?",
    "timestamp" : "40:50-40:56"
  },
  {
    "text" : "Rich Gannon's good though. Rex Grossman went to a Super Bowl with the Bears.",
    "timestamp" : "40:57-41:01",
    "speaker" : "Greg"
  },
  {
    "text" : "Exactly, yeah. But yeah, this is this is Brady coming out showing that it wasn't just And that's the difference.",
    "timestamp" : "41:01-41:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "41:09-41:13",
    "text" : "Brady Brady wins the Super Bowl and then he puts in more work in the offseason."
  },
  {
    "timestamp" : "41:13-41:20",
    "speaker" : "Andy",
    "text" : "Oh speaking of which I have a I have a clip for that. Look at me. I've learned a new trick, can you tell?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I like it. Yeah.",
    "timestamp" : "41:20-41:22"
  },
  {
    "speaker" : "Andy",
    "text" : "So this is uh because I'm a blood eight. I know. The Luddite MA hates. This is our girl Bonnie talking about um Brady working on us because remember last week we we didn't know about Brady's play action. A ooga.",
    "timestamp" : "41:22-41:37"
  },
  {
    "timestamp" : "41:38-42:03",
    "speaker" : "Speaker 6",
    "text" : "All right, well Dick, play action has become so much a part of the Patriots offense. And Tom Brady's really worked on the fakes in the offseason. He watched a lot of film of the great ones. Brett Farr, Peyton Manning. He mentioned Elvis Gurback and he said the key is really consistency. If you watch quarterbacks, A lot of times they'll rush to their handoff point and then slow down and do just the opposite when they fake. So defenses will definitely pick up on that. So you always have to keep what you're doing exactly the same."
  },
  {
    "timestamp" : "42:04-42:13",
    "speaker" : "Steve",
    "text" : "Elvis Gerbach does not fit. Yeah, did she say Gerbach in there? Yeah, yeah. She's just like, oh, here's some too. Very highly rated Hall of Fate writers."
  },
  {
    "text" : "I thought I misheard that. Like Gerbach. That name forever.",
    "timestamp" : "42:14-42:20",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:20-42:24",
    "text" : "And maybe he's really good at play action. I don't know. It's a great name."
  },
  {
    "text" : "Here's I think the real thing that makes it pretty great, like I don't know. I have I don't remember this season at all and um but I know the end result of them missing the playoffs so he's gotta fall off, but then in 2002 or 2003 he comes back even more with a vengeance. Like to to have that peak of a Super Bowl start this year the way this has. I don't remember this year being so awesome where three games or three and oh, they're absolutely lighting people up. Their offense looks unstoppable. Their defense looks just as good as last year. And then to have it all fall apart and then to come back the next year and rattle off two more Super Bowl wins. That's what really I think makes Brady great.",
    "timestamp" : "42:24-43:03",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "43:03-43:04"
  },
  {
    "text" : "And I well, I think that even this year. I think Brady yeah, Brady led this the the NFL in touchdown pass. He did indeed. With twenty-eight. So it's not like he was led but I mean f back then I think that was like a reasonable amount of touchdowns to to lead the league with.",
    "timestamp" : "43:04-43:23",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:24-43:36",
    "speaker" : "Greg",
    "text" : "Yeah. And I mean, Steve is saying the defense is as good as last year, but I think you're starting to see cracks here. Like look at Priest Holmes had an absolutely monster game."
  },
  {
    "speaker" : "Andy",
    "text" : "So I mean, yeah. So let's talk about Priest Home because I I remember him being good, but I don't remember why. But apparently he led the league in Washington the year before.",
    "timestamp" : "43:36-43:46"
  },
  {
    "timestamp" : "43:46-43:46",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "43:47-44:10",
    "speaker" : "Andy",
    "text" : "And uh and he was like the they were talking about it, the commentator talking about it. It was the first guy in like 20 years to lead the league in rushing when he was a free agent the year before. So the Chiefs actually had signed him uh prior to the 2001 season. Uh and actually the Patriots were looking at him as well, but they they went with Antoine Smith because he was cheaper, I think."
  },
  {
    "speaker" : "Greg",
    "text" : "Um but the Chiefs he couldn't have been cheaper. Doesn't sound right, does it? Priest Holmes is a nobody before he got to he he's undrafted out of Texas.",
    "timestamp" : "44:11-44:21"
  },
  {
    "text" : "Didn't he he played for the the Ravens though, right?",
    "speaker" : "Andy",
    "timestamp" : "44:21-44:24"
  },
  {
    "text" : "Yeah, for for two years, but he didn't he didn't put up really any numbers.",
    "speaker" : "Greg",
    "timestamp" : "44:24-44:27"
  },
  {
    "timestamp" : "44:28-44:39",
    "text" : "I think he was still pretty highly touted though because Who else was there? It was uh wasn't Jamal Anderson at the time who was just like lighting the league on fire and priest Holmes was backing him up or something. I mean maybe.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "44:39-44:44",
    "text" : "I mean he's got a decent uh average per carry, but I mean"
  },
  {
    "text" : "Yeah, I think he was one of those like uh backup running backs that everybody fell in love with, you know. And so there was a bit of a bidding market for him.",
    "timestamp" : "44:44-44:50",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "44:50-44:57",
    "speaker" : "Greg",
    "text" : "Who's the equivalent right now? It's probably a million of an 'cause everybody has like three running backs."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:58-45:26",
    "text" : "Yeah. Well they don't. Um Who was the run there was the running back for the uh the Ravens backup that everybody loved. I don't remember who it was though. Yeah, there's there's always a lot of people. Yeah, and this was right in the midst of that. I think he how many yards did he run for this season? It was like sixteen hundred or something ridiculous."
  },
  {
    "timestamp" : "45:27-45:34",
    "text" : "Yeah, sixteen fifteen with uh another like s almost seven hundred receiving yards.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, he basically was the offense of this team. And the Purdue just knew that going in. They knew what they're getting themselves into and they still couldn't fucking stop it because Yeah.",
    "timestamp" : "45:34-45:42",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:46-45:54",
    "speaker" : "Greg",
    "text" : "With twenty-seven touchdowns, which has has been has been broken like four times since then, but still. By LT, right? Yeah."
  },
  {
    "text" : "Yeah. I always confused LT and Pre-Solms. But I really don't know why. Maybe because they both like didn't LT break that not too long after?",
    "timestamp" : "45:55-46:05",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, it was like the next year. And then someone broke it the year after, I think.",
    "timestamp" : "46:06-46:09"
  },
  {
    "timestamp" : "46:09-46:10",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "46:10-46:14",
    "speaker" : "Greg",
    "text" : "But I hate a lot. I used to always get him and Jamal Lewis mixed up."
  },
  {
    "timestamp" : "46:14-46:18",
    "speaker" : "Andy",
    "text" : "I always get him and didn't the Chiefs have another"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "46:19-46:26",
    "text" : "Larry Johnson. Larry was Larry John. From Penn State, yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:26-46:33",
    "text" : "Yeah, yeah. And they were the kind of similar running running back styles and they were the workhorse of the team and everything ran through them."
  },
  {
    "timestamp" : "46:33-46:34",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "46:34-46:37",
    "speaker" : "Andy",
    "text" : "Kind of like that era of of Chiefs football, I felt like."
  },
  {
    "speaker" : "Greg",
    "text" : "He did. Yeah. I think it's because he was backing up Ricky Williams, right? Is that what you're saying, Steve?",
    "timestamp" : "46:39-46:45"
  },
  {
    "timestamp" : "46:45-46:57",
    "speaker" : "Steve",
    "text" : "Yeah, they were they were playing at Texas together, but it was like their times weren't that crossed. And there's like a one year gap in Priest Holmes like stats at Texas. I have no idea what happened there, but"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:00-47:22",
    "text" : "Well his name's his name's priest, so it's definitely not like you know, touching kids or anything, you know what I'm saying? He didn't go to Penn State, so we're good. There was not I don't know. Maybe you got hurt."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "47:23-47:24",
    "text" : "What a what a backfield."
  },
  {
    "text" : "Hmm.",
    "speaker" : "Greg",
    "timestamp" : "47:25-47:25"
  },
  {
    "timestamp" : "47:25-47:26",
    "text" : "Right.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "47:26-47:27",
    "speaker" : "Greg",
    "text" : "Jesus."
  },
  {
    "text" : "And like when you think about it, like Ricky Williams, like there's that trade where the Saints traded like their entire draft.",
    "speaker" : "Steve",
    "timestamp" : "47:27-47:34"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:34-47:35",
    "text" : "Oh, right."
  },
  {
    "text" : "For the pick to get him. And then like the priest Holmes goes undrafted. And career-wise, you gotta say Priest Holmes has a better career than Ricky Williams.",
    "timestamp" : "47:35-47:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:46-47:48",
    "text" : "Yeah, is that true?"
  },
  {
    "timestamp" : "47:50-47:54",
    "speaker" : "Steve",
    "text" : "Well he set a touchdown record like Ricky Williams never even sniffed it. Yeah. I mean he was a little bit of a lot of people."
  },
  {
    "speaker" : "Andy",
    "text" : "Ricky Reid was a stud for a few years, yeah.",
    "timestamp" : "47:55-47:57"
  },
  {
    "speaker" : "Steve",
    "text" : "He was, I don't know about a stud. He was good and then he was like just crazy. And he went and like traveled the world and smoked I I loved him too, but",
    "timestamp" : "47:57-48:05"
  },
  {
    "timestamp" : "48:06-48:31",
    "speaker" : "Greg",
    "text" : "Like have you ever heard about uh him uh negotiating his own contract? No. Or I this was this actually goes this goes hand in hand with my deep dive, but When he got drafted, there was like the whole like uh hip hop and sports were becoming like intermingled To a high degree, so all the rappers were wearing the jerseys backwards, remember that?"
  },
  {
    "timestamp" : "48:31-48:32",
    "speaker" : "Andy",
    "text" : "Oh yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "48:32-49:07",
    "text" : "And apparently, like when he got drafted, he like signed on with uh Uh I don't know, one of the Southern rappers like had like set up their own agency, sports agency, and they were getting some pretty big names. And like the contract that they drafted for them was like Like 98% incentive laden. And like the incentives were like he'd have to set like NFL records for like four straight seasons to get to that benchmark. And he's like, oh I'm betting on myself. And I like lost millions and millions of dollars in the process."
  },
  {
    "timestamp" : "49:08-49:11",
    "text" : "Ridiculous. Yeah. Oh, poor Ricky Williams.",
    "speaker" : "Andy"
  },
  {
    "text" : "So you want to hear my uh deep dive here? Yeah. So whenever I hear the name Dante Hall, I think of the uh Lil Wayne song from The Drought Three. Uh I'm gonna I'm gonna read you the lyric right now.",
    "timestamp" : "49:12-49:28",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:28-49:30",
    "text" : "Remember he does Can you rap us the lyric, please?"
  },
  {
    "timestamp" : "49:31-49:35",
    "speaker" : "Greg",
    "text" : "Uh I'm just gonna speak it."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:35-49:38",
    "text" : "No. Come on."
  },
  {
    "text" : "I'm just gonna I'm just gonna speak it. Remember they called him the X factor and he used to do the X thing? Yeah, yeah, yeah. So this is the line from Little Wayne. I got a great idea. We should have sex. Bitch, I'm like Dante Hall. I just throw up the X It's poetry.",
    "timestamp" : "49:38-49:59",
    "speaker" : "Greg"
  },
  {
    "text" : "Took me a second to realize that was the like like the triple line.",
    "speaker" : "Andy",
    "timestamp" : "50:01-50:04"
  },
  {
    "timestamp" : "50:05-50:06",
    "speaker" : "Steve",
    "text" : "Like the sucket X? Like X?"
  },
  {
    "speaker" : "Greg",
    "text" : "Ecstasy. Yes.",
    "timestamp" : "50:09-50:10"
  },
  {
    "timestamp" : "50:10-50:13",
    "text" : "Who used to do the uh sucket X? In wrestling.",
    "speaker" : "Steve"
  },
  {
    "text" : "I know what you're talking about. They they banned that from the kickball field in my elementary school because everybody went with they crossed the plate and kickball and do the X and everybody. Yeah. You want to hear a couple other uh lines from this song?",
    "speaker" : "Greg",
    "timestamp" : "50:13-50:33"
  },
  {
    "timestamp" : "50:33-50:35",
    "speaker" : "Andy",
    "text" : "Uh yeah, I mean you got me hooked."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "50:35-51:20",
    "text" : "Don't drink cristal no more, just pour it on white bitches' heads. Which actually has more context than you think. Apparently, uh the like the CEO of Cristal In an interview with The Economist, uh, they were asking him about how rap culture had kind of adopted Kristal as like a sign of affluence. And he basically said, Hey, you can't pick who drinks your beverages, you know. And they all took it as racist. So like Jay-Z started um like boycotting it. So this is Lil Wayne acknowledging that Yo fuck you. I just pour it on white bitches' heads now. It's just kind of awesome. Which I never knew when I listened to the song. I just thought it was kind of funny, but it's pretty badass too."
  },
  {
    "text" : "I thought you're pretty good. Yeah.",
    "timestamp" : "51:20-51:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:22-51:39",
    "text" : "Um Is another line. If you don't like it, ninja, fuck you with an AIDS dick. It's like come on. I like Mr. Wayne. Is there a backstory to that one?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh I like the self-censoring too, by the way. Yeah.",
    "timestamp" : "51:39-51:42"
  },
  {
    "text" : "I caught that. Yes. Uh which also reminded me of my favorite rap quote ever from uh Dr. Dre Forgot About Dre. If y'all don't like me, blow me. Which is which is just the best. And I say it to Kelly all the time. If y'all don't like me, blow me. So then from there I started thinking for Christmas, a gift and a curse. So I started looking into like, hey, when is like did Like how much did Tom Brady enter like the hip-hop culture, right? So if they're rapping about Dante Hall and like Tom Brady is like uh perennial MVP. Like he's gotta be in there at some point, right? And apparently the first time Lil Wayne mentions mentions him is in two thousand and eleven. Bro, wow a long time. Yeah, the song Gucci Gucci. My life is like a movie. I got a leading lady. My rooftop dropped back like Tom Brady. Which is a pretty sweet line. You said that's 2011? 2011. Yeah.",
    "timestamp" : "51:42-52:50",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "That seems way late.",
    "timestamp" : "52:50-52:51"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, it's the first time Little Wayne mentions him.",
    "timestamp" : "52:51-52:53"
  },
  {
    "timestamp" : "52:53-52:54",
    "text" : "Oh okay, okay.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "52:55-53:15",
    "speaker" : "Greg",
    "text" : "Yeah. That seems late though. I know, I thought so too. Um my favorite was uh a Rick Ross song. It's actually Wale who says it. Um and this quote is Out of this third rock, ninja air it out. I'm on my Tom Brady. Y'all ninjas is Eric Crouch."
  },
  {
    "speaker" : "Andy",
    "text" : "Eric Crouch.",
    "timestamp" : "53:16-53:18"
  },
  {
    "text" : "Eric Crouch dude. That's brilliant. Yeah, oh yeah.",
    "timestamp" : "53:19-53:22",
    "speaker" : "Greg"
  },
  {
    "text" : "Is Eric Crouch the the whitest quarterback to ever be mentioned in a rap song?",
    "timestamp" : "53:22-53:26",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "53:27-53:32",
    "text" : "He's gotta be. He's gotta be gotta be up there. Yeah, yeah. I don't know. Is there Brandon Wheaton one?",
    "speaker" : "Steve"
  },
  {
    "text" : "I mean I feel like weedon would actually be a good a good word to fit into a rap song.",
    "speaker" : "Andy",
    "timestamp" : "53:33-53:38"
  },
  {
    "speaker" : "Steve",
    "text" : "Definitely.",
    "timestamp" : "53:38-53:39"
  },
  {
    "timestamp" : "53:39-53:50",
    "speaker" : "Greg",
    "text" : "There's a little Kim one too, but it's just so bad. We can't say that and then not deliver, Greg Car. Alright, this is from 2019 Little Kim song Too Bad."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:50-53:51",
    "text" : "Oh dear."
  },
  {
    "timestamp" : "53:51-54:04",
    "speaker" : "Greg",
    "text" : "Um I'm gonna shake it on him, shake it all around like a hula hoop, and now he wanna take me to Hawaii and you know I'm gonna go go and get it. Tom Brady, I'm gonna throw it, throw it back."
  },
  {
    "timestamp" : "54:06-54:06",
    "text" : "What?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Poetry from little Kim. I believe she's talking about her hips. During coitus.",
    "timestamp" : "54:07-54:17"
  },
  {
    "text" : "Okay.",
    "speaker" : "Andy",
    "timestamp" : "54:18-54:19"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. Throwing it back. Yeah. But does Tom Brady even throw it back? He throws it forward. Yeah. What does Hawaii have to do with anything? The Pro Bowl idiot.",
    "timestamp" : "54:22-54:35"
  },
  {
    "timestamp" : "54:36-54:40",
    "text" : "It's not in Hawaii anymore, but in Orlando.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:41-54:57",
    "text" : "You want to take me to Orlando? Pro Bowl fest festivities. But he made the Super Bowl, so he canceled on me. Idiot. Alright, that's all he had.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I thought that steep dive was gonna be about Dante Hall, but it took a real strange turn. Yeah, yeah. He was sick, but like He wasn't like a great receiver. He had his first catch behind beyond the line of scrimmage in like the fourth quarter at the very end when Chiefs are making it a game. Yep. And that Tony Gonzalez snag was also legit. Yeah, but it was on Tylaw. He was not open and he just pulled it out along the throwing.",
    "timestamp" : "54:58-55:30"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah. With a bad wrist or something? Like you had a Yeah. They kept talking and talking about it.",
    "timestamp" : "55:31-55:35"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:35-55:38",
    "text" : "Yeah, too much too much whacking, right Andy?"
  },
  {
    "speaker" : "Andy",
    "text" : "That's right, yeah. Smacking. Uh reminded me a lot of Devin Hester.",
    "timestamp" : "55:38-55:48"
  },
  {
    "text" : "I think he's shiftier than Devin Hester.",
    "timestamp" : "55:49-55:50",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Well I just in terms of like Devin Hester was an incredible kick returner. Yeah, yeah. The role is so hard to make him wide receiver and he just Couldn't. Just couldn't. Yeah. And it felt like Dante Hall was that similar guy. They did a couple of end arounds or reverses with him just to get up the ball in his hands. And one of them he was electric, but.",
    "timestamp" : "55:51-56:12"
  },
  {
    "speaker" : "Greg",
    "text" : "He is he had like a couple punt returns or kick returns that were pretty damn good in this game.",
    "timestamp" : "56:12-56:18"
  },
  {
    "text" : "But having said that, in the in this game specifically, I thought Dion Branch almost matched him. Kick return for kick return because there was a lot of them in this game.",
    "speaker" : "Andy",
    "timestamp" : "56:19-56:26"
  },
  {
    "text" : "Dude, Dan Branch is a sick kick returner.",
    "timestamp" : "56:26-56:28",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:29-56:30",
    "text" : "I didn't even remember him returning kicks."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, me neither.",
    "timestamp" : "56:30-56:31"
  },
  {
    "timestamp" : "56:31-56:36",
    "text" : "But he's averaging like 30 yards a kick return in this game. They were fantastic.",
    "speaker" : "Andy"
  },
  {
    "text" : "His first two were thirty-four and fifty-three yards.",
    "speaker" : "Steve",
    "timestamp" : "56:36-56:39"
  },
  {
    "speaker" : "Andy",
    "text" : "This is what I'm saying. Yeah. He was great. I just don't remember and this is like his rookie season. And they keep talking about how polite he is. This is I think two games in a row they've talked about it where he's he starts he starts every uh sentence with yes sir or yes ma'am.",
    "timestamp" : "56:39-56:55"
  },
  {
    "text" : "Yeah that's a that's a white commentator thing to say.",
    "timestamp" : "56:55-56:58",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "57:00-57:03",
    "speaker" : "Andy",
    "text" : "Like oh Bobby Bay. I bet you haven't been called Mammon Ages."
  },
  {
    "speaker" : "Greg",
    "text" : "He wears a belt and he doesn't even sack his pants. Exactly, yeah. He's so polite. Yeah.",
    "timestamp" : "57:05-57:12"
  },
  {
    "speaker" : "Steve",
    "text" : "On the uh congreg.",
    "timestamp" : "57:14-57:16"
  },
  {
    "text" : "I was gonna say, can you I think Dante Hall might be the shiftiest player that I can think of, just off the top of my head. I mean Reggie Bush Uh well when he was at USC was like impossible to put a hand on.",
    "timestamp" : "57:16-57:30",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:30-57:33",
    "text" : "But beyond that one name."
  },
  {
    "speaker" : "Greg",
    "text" : "All right, let me hear.",
    "timestamp" : "57:33-57:34"
  },
  {
    "speaker" : "Andy",
    "text" : "Barry Sanders.",
    "timestamp" : "57:34-57:35"
  },
  {
    "text" : "Oh okay. Yeah. Yeah. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "57:36-57:38"
  },
  {
    "text" : "That's the bad thing. I can think that would be but yeah, no, he's he's in that. In the Yeah.",
    "timestamp" : "57:38-57:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean he's not obviously not as good as a football player and like not as productive as some of those other guys, but just from a pure like get the ball in his hands and that one you watch the highlight video of him Andy?",
    "timestamp" : "57:46-57:57"
  },
  {
    "text" : "The the one entitled uh human joystick, absolutely. Yeah, where he where he runs like back like sixteen yards and then like or he he like gets a uh a punt he catches the punt on like the four yard line And goes backwards a couple yards to the end zone and then still manages to return it for a touchdown somehow. Yeah. Why are you even catching that? He's like, Yeah, fuck it.",
    "timestamp" : "57:57-58:16",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:16-58:19",
    "text" : "Yeah. He was pretty good.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Human highlight reel.",
    "timestamp" : "58:19-58:20"
  },
  {
    "text" : "It's like that uh you see that running back that the Pats picked up? Undrafted guy?",
    "speaker" : "Greg",
    "timestamp" : "58:20-58:26"
  },
  {
    "timestamp" : "58:26-58:27",
    "text" : "Uh the super short dude?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:28-58:28",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "58:28-58:29",
    "speaker" : "Andy",
    "text" : "Oh yeah, yeah."
  },
  {
    "timestamp" : "58:29-58:33",
    "text" : "His highlight packages, he looks like he's gonna be something fun to watch.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "58:33-58:40",
    "text" : "Oh really? I feel like you I I I thought that about Dion Lewis when he first came here too. Yeah, and he was. He was electric.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:41-58:42",
    "text" : "Lewis was sick.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Deion Lewis at the right angle like nobody. I loved it.",
    "timestamp" : "58:42-58:45"
  },
  {
    "timestamp" : "58:45-58:47",
    "speaker" : "Steve",
    "text" : "I loved Dion Lewis."
  },
  {
    "text" : "Loved him. We'll get to that.",
    "speaker" : "Andy",
    "timestamp" : "58:47-58:48"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "58:48-59:05",
    "text" : "So I I didn't obviously I when I watch these games I have no idea what's gonna happen because I don't remember the season. And the Chiefs get to the one inch line, right? There's like the receiver runs a curl, whatever, and stops one inch short, like an idiot"
  },
  {
    "text" : "And uh and Laura Meloy like blows him out, yeah. Make sure he does not get it.",
    "timestamp" : "59:05-59:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I have an idea. Tell me they throw a slant and throw a pick. Like you have Priest Holmes in the backfield, like he's like carried you. Trent Green like barely just I think he just broke like a hundred yards on that fucking throw. to tony and of like please tell me they try to throw it with green. But they don't. They just run it in like smart people do.",
    "timestamp" : "59:09-59:30"
  },
  {
    "timestamp" : "59:30-59:32",
    "text" : "Yeah, this is not a Pete Carroll moment.",
    "speaker" : "Andy"
  },
  {
    "text" : "This is uh OT.",
    "speaker" : "Steve",
    "timestamp" : "59:32-59:35"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:36-01:00:11",
    "text" : "Yeah, the game literally went down to third inches, three seconds left. One play left and down by seven. And the Chiefs ran Priest Holmes literally right at the middle, dove over the pile and almost didn't make it, but managed to get there because I think there was uh both Bruski and Pfeiffer were out for this game. So they were starting um not necessarily starting, but I think their heavy package what had uh Larry Izzo in there. Yeah, I saw him in there way more. That's where they were for uh their linebacking core."
  },
  {
    "text" : "And they got gash for like a buck eighty by Priest Holmes in this game. Yeah. Yeah, they gave 200 yards. Doing whatever he wanted on the ground.",
    "timestamp" : "01:00:11-01:00:19",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:00:19-01:00:22",
    "speaker" : "Andy",
    "text" : "Yeah, it felt like he was averaging a first down every carry."
  },
  {
    "timestamp" : "01:00:22-01:00:28",
    "speaker" : "Steve",
    "text" : "Yeah. I don't think I saw a single negative play from even when they thought they had him, he would still get a couple yards."
  },
  {
    "text" : "Yeah, or at least get away. He's crazy lucid.",
    "speaker" : "Andy",
    "timestamp" : "01:00:29-01:00:31"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:00:31-01:00:44",
    "text" : "Yeah, he was. He was better than I remember. I I thought he was kind of like a power back guy, but he had He had some shiftiness to him too. He did, yeah. And he does that little like his end zone celebration as he's going in that brought back memories."
  },
  {
    "timestamp" : "01:00:44-01:00:48",
    "text" : "Yeah, for sure. Kind of remind me of the uh the Thai Law a little bit.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. So it's like a variation of that. I love a good little bit of showmanship. Yep.",
    "timestamp" : "01:00:48-01:00:53"
  },
  {
    "text" : "But of course Dick Enberg on that last touchdown says uh priest home scores and we're going to extra time. And then uh Dan Dierdoff of all people had to remind him that no, they still had to kick the extra point",
    "timestamp" : "01:00:53-01:01:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Back then it was pretty automatic, you know, whatever.",
    "timestamp" : "01:01:04-01:01:06"
  },
  {
    "text" : "Yeah, it's true.",
    "timestamp" : "01:01:07-01:01:08",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:01:08-01:01:12",
    "text" : "Especially with Morton Anderson and his his 1970s.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:01:13-01:01:16",
    "text" : "I want you to commentate a game, Andy."
  },
  {
    "text" : "I would love that.",
    "timestamp" : "01:01:17-01:01:17",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:01:18-01:01:26",
    "text" : "And then referee another game. And then I'm gonna sit through and watch the whole film. I've done reference before."
  },
  {
    "text" : "I've referees football in college.",
    "timestamp" : "01:01:27-01:01:29",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01:29-01:01:31",
    "speaker" : "Greg",
    "text" : "Fucking hard, dude."
  },
  {
    "timestamp" : "01:01:32-01:01:35",
    "speaker" : "Andy",
    "text" : "Oh yeah, I have no problems with referees, except these ones."
  },
  {
    "speaker" : "Greg",
    "text" : "Except all of them.",
    "timestamp" : "01:01:38-01:01:39"
  },
  {
    "speaker" : "Andy",
    "text" : "So you know how you always say that the Patriots always get all the calls and everything? Uh-huh. You can point them to this game because There were 13 penalties called in this game and 12 were on the Patriots. Well maybe they committed more files. But the Patriots did they bitch about it? Did they get off their game? No, they just went and won the game anyway.",
    "timestamp" : "01:01:41-01:02:04"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, I mean, think about that locker room bell check at halftime. They had nine in the first half. And then I had 12 the whole game, you know, so I only had three more. He must have been so fucking mad about penalties. Because this wouldn't have been a game if they weren't shooting themselves in the foot in the first half.",
    "timestamp" : "01:02:04-01:02:20"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't know. I think uh I mean I didn't watch the game, so I didn't see the penalties, but were they where they like they're driving? To me, there's well there's two kinds of penalties, right? There's like aggression type penalties, and then there's like like offsides or like mental bonehead stuff. Holding I'm fine with pass interferences, I'm fine with. That's just playing aggressive.",
    "timestamp" : "01:02:20-01:02:41"
  },
  {
    "speaker" : "Steve",
    "text" : "You know here's a perfect example, Greg. The end of the first half. The they pin them deep, the Chiefs deep, and they force a three and out and they punt it and it's like a crappy punt or whatever and they get the ball at like the forty-five on the offense on the and the Chiefs. And then immediately fall start. Yeah. And how it's 50. And like they only have like one time no timeouts or whatever and like less than a minute in time to try and get a fuel goal through. So like those five yards are so key in that situation. Like, all right, offense get out there and boom, fall start. That's your ninth penalty of the half. And it was yeah, that was a lot of those.",
    "timestamp" : "01:02:41-01:03:21"
  },
  {
    "timestamp" : "01:03:21-01:04:03",
    "speaker" : "Andy",
    "text" : "It was not great. Now came inopportune moments too, like things to to keep drives alive, or you had like a really great punt uh to Dante Hall and you like you pinned them and then you had I think it was a legal man downfield on Izzo. And so they got to repunt and kick it back to Dante Hall. And he ended up with like an extra 20 yards of field position. Yeah. Just stupid shit like that. And some of them were tick-y tack, but I think most of the calls were correct. It was I think in this game they had two that were called Where the gunners were or the like the punt team was blocking the gunners out of bounds. Like they pushed them out of bounds but kept blocking them out of bounds. And they caught two different guys got called for that twice. Ty Law was one of them, I think."
  },
  {
    "timestamp" : "01:04:03-01:04:05",
    "speaker" : "Greg",
    "text" : "No, that's a terrible call."
  },
  {
    "text" : "No, it's a it's a legit college. It's a team play. That's what I'm saying. You just never really see called, but there's two in this game. It's like what are you guys doing?",
    "timestamp" : "01:04:06-01:04:16",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:04:17-01:04:22",
    "speaker" : "Greg",
    "text" : "F assholes. Terr terrible referees in this one. All right."
  },
  {
    "text" : "Let's get to the remote. I'm blaming that on your Tai Law.",
    "speaker" : "Steve",
    "timestamp" : "01:04:22-01:04:25"
  },
  {
    "speaker" : "Greg",
    "text" : "Thoughts? I strongly disagree.",
    "timestamp" : "01:04:26-01:04:29"
  },
  {
    "text" : "The re the commentators disagreed about the original overtime rules where no one gets a possession. Because that's won the toss, they take it down. There's a sick move by David Batten. Like they thought he was going out of bounds and he cut it back inside and got another like fifteen yards.",
    "timestamp" : "01:04:30-01:04:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I think it was one of those plays where it's supposed to be a run play, but Brady saw that Pat was uncovered, so he just like pulled the ball and chucked it to him quick. And Pat Patton took him for like 20 yards.",
    "timestamp" : "01:04:47-01:04:56"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that was a great play.",
    "timestamp" : "01:04:56-01:04:57"
  },
  {
    "text" : "Yeah. It was fantastic.",
    "speaker" : "Andy",
    "timestamp" : "01:04:57-01:04:59"
  },
  {
    "timestamp" : "01:05:00-01:05:04",
    "text" : "And he gave him the old, hey, how are you too to that D B Yeah, he did.",
    "speaker" : "Greg"
  },
  {
    "text" : "Looked like he was gonna step out of bounds and cut it back in front of his face.",
    "speaker" : "Andy",
    "timestamp" : "01:05:04-01:05:07"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh-huh. And he was like, Hey, you dropped your drop, you jock strap, buddy. Yeah",
    "timestamp" : "01:05:07-01:05:13"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:13-01:05:31",
    "text" : "I'm sure he said that. Uh D Dan Deerdorf did have some thoughts about um about overtime. And we actually talked about this uh in the article last week, yeah. But this is this is what he had to say in this game too. Six."
  },
  {
    "timestamp" : "01:05:31-01:05:55",
    "speaker" : "Speaker 8",
    "text" : "Well this is a situation where maybe some people think well maybe we go ahead and try to kick the field goal on third down. I I think you try to keep going. I uh even Adam Adam Venateri it's not a certainty. I know that he hasn't missed his year the guy is money in the bank but a touchdown is better a touchdown leaves no doubt"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:05:58-01:06:00",
    "text" : "I actually get get his point."
  },
  {
    "text" : "So they're like on like the 25.",
    "timestamp" : "01:06:01-01:06:04",
    "speaker" : "Steve"
  },
  {
    "text" : "He's talking about like avoiding a missed field goal or like a botched snap, right? Because that's why someone would say go for kick it on third.",
    "timestamp" : "01:06:04-01:06:11",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:11-01:06:20",
    "text" : "But it's third and seven. Like I I understand that aspect of it. It's third and seven from the Chiefs' 20-yard line with Adam Venateri."
  },
  {
    "text" : "Oh yeah. I mean I don't agree with this statement, but I see what he's trying to say. Like when I first heard it, I thought he was just like didn't understand that a field goal wins it.",
    "timestamp" : "01:06:20-01:06:29",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:29-01:06:45",
    "text" : "He might not. I'm still not sure because as as they as he's talking, they're showing a the stat on the screen that says uh like they're showing Adam Minitarian says has 12 game-winning field goals, six of them in overtime. Like this this is more automatic than scoring a touchdown."
  },
  {
    "text" : "Yeah, but a touchdown leaves no doubt. On like a field goal to win doubt? Have you considered that, Andy? The doubt factor.",
    "timestamp" : "01:06:45-01:06:57",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I had failed to think of the doubt. Well that's why he's in the hall of fame. Fuck you.",
    "timestamp" : "01:07:00-01:07:09"
  },
  {
    "speaker" : "Steve",
    "text" : "Adam's field goal is a no-doubter.",
    "timestamp" : "01:07:12-01:07:15"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, it was it would have been good in uh arena football.",
    "timestamp" : "01:07:15-01:07:19"
  },
  {
    "speaker" : "Greg",
    "text" : "He split that right down Broadway.",
    "timestamp" : "01:07:19-01:07:22"
  },
  {
    "timestamp" : "01:07:22-01:07:25",
    "text" : "Yeah. And that was all she wrote.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07:25-01:07:37",
    "speaker" : "Greg",
    "text" : "Another big win. And like you gotta think that spirit is soaring high right now in New England. Win a s win a Super Bowl, you come back next year and your quarterback is even better and you're just shit stomping teams. Like"
  },
  {
    "speaker" : "Andy",
    "text" : "And you're th you're undefeated on the season three and up.",
    "timestamp" : "01:07:39-01:07:41"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Against like some pretty good teams too. Yep.",
    "timestamp" : "01:07:41-01:07:44"
  },
  {
    "text" : "Right, right. So I think it's a good start uh time to do some best and worst. Greg.",
    "timestamp" : "01:07:45-01:07:53",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07:54-01:07:59",
    "speaker" : "Greg",
    "text" : "Oh can you start with Steven? Steven. What do you got?"
  },
  {
    "timestamp" : "01:07:59-01:08:05",
    "speaker" : "Speaker 6",
    "text" : "Greg's gonna pay for his. Starts watching the highlights now."
  },
  {
    "text" : "The worst is like more commentating. I'll pile on Andy. The only good part was their was their golf thing where the announcements always get super stoked when punters outkick their coverage. Like they they like with a casey punter like the fuck out of the ball, but like he did like kind of a low line driver or not a you know, he's he put it out there.",
    "speaker" : "Steve",
    "timestamp" : "01:08:09-01:08:31"
  },
  {
    "text" : "He outkicked his coverage by like 20 yards.",
    "timestamp" : "01:08:32-01:08:34",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. And so Troy got like a sick return out of it and just like just by running straight up the middle. Oh hits a huge booby button. Awesome! What a great legging. That's what he's trying to do. Oops. And then my best is definitely that Troy Brown drive. I mean I think I snapchatted it to like a billion people. They had like a sweet highlight montage after it too of all of his catches and like Oh my god yeah. Nothing was easy. I think it's where like Everybody learns you can't play zone against Brady too, because like Troy was just too good against that zone. Brady is just going to him over and over and over and Troy's just making the gutty, gritty plays and like just being awesome and then that touchdown to cap it was just wow. Yeah.",
    "timestamp" : "01:08:34-01:09:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Brady wasn't even looking he wasn't even pretending to like look anywhere else. He's just staring Troy Brown down until he got open and just threw it at him. He wasn't even open you. You're just throwing it anyway. You're still catching it. All right, great.",
    "timestamp" : "01:09:21-01:09:32"
  },
  {
    "timestamp" : "01:09:32-01:09:40",
    "text" : "I got I got mine now. Okay, good. Uh my best. Uh shout out Daniel Graham. First career touchdown reception. Yes.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:09:40-01:09:41",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "I don't think we've talked about that. Um sure. My worst was uh the commentators, you know, like even with that play where they got the name wrong on who caught that pass. Like come on.",
    "timestamp" : "01:09:42-01:09:56"
  },
  {
    "text" : "You get H which time? Are we talking about the one where they're talking about how Troy Brown is back from his injury when he he was? Oh well yeah. I mean you can wide receiver for we talk about when they talked about tickling for five fucking minutes.",
    "timestamp" : "01:09:56-01:10:14",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. You guys know. You got you get it. You get it.",
    "speaker" : "Greg",
    "timestamp" : "01:10:15-01:10:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:19-01:10:33",
    "text" : "Or when they they call the script kick the onset's kick. Oh that dude that one. Or when or when Dick Emberg says uh The he he says a six yard gain. Oh he gains maybe a yard. Actually, wait, nope, make that six yards."
  },
  {
    "text" : "Oh, dude, he was five yards off.",
    "speaker" : "Greg",
    "timestamp" : "01:10:33-01:10:35"
  },
  {
    "timestamp" : "01:10:36-01:10:36",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:10:38-01:10:39",
    "speaker" : "Greg",
    "text" : "What an idiot."
  },
  {
    "text" : "Brittany goes to the case.",
    "timestamp" : "01:10:41-01:10:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:10:44-01:10:47",
    "text" : "That's a hard negative for not watching the game there, Greg."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:10:47-01:10:53",
    "text" : "It's true. I did it. That's the thing. When I w just watch the highlights, I don't get any of the commentator stuff."
  },
  {
    "timestamp" : "01:10:53-01:10:56",
    "speaker" : "Andy",
    "text" : "My negative is Greg not watching the fucking football game."
  },
  {
    "speaker" : "Greg",
    "text" : "Well, my positive is you because you're such a good brother, Andy, and I love you so very much.",
    "timestamp" : "01:10:56-01:11:01"
  },
  {
    "speaker" : "Andy",
    "text" : "So you know what I'm gonna do, Greg? I'm I'm gonna mix this up on you. Ready? You ready for this? What are you gonna do? What are you gonna do? My best is the following Dick Enberg line.",
    "timestamp" : "01:11:03-01:11:11"
  },
  {
    "timestamp" : "01:11:11-01:11:13",
    "speaker" : "Greg",
    "text" : "Ooh. Oh"
  },
  {
    "text" : "Third and third and goal at the end of the game here. And the Patriots know that the Chiefs are gonna run it. And so you can see they're sending in their uh Beefcakes. And Dick Ember goes, They've just sent in a whole truckload of beef.",
    "timestamp" : "01:11:14-01:11:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "See, that's what I'm talking about.",
    "timestamp" : "01:11:33-01:11:34"
  },
  {
    "timestamp" : "01:11:34-01:11:36",
    "speaker" : "Andy",
    "text" : "Yeah, that that's a redeeming one right there."
  },
  {
    "speaker" : "Greg",
    "text" : "So I'll give them that. A truckload of beef.",
    "timestamp" : "01:11:36-01:11:39"
  },
  {
    "text" : "Truckload of beef. Yeah. My uh let's see what else do I have.",
    "speaker" : "Andy",
    "timestamp" : "01:11:39-01:11:46"
  },
  {
    "speaker" : "Greg",
    "text" : "I like visualizing that, you know, just a bunch of like fat dudes wedged wedged into like a Ford F one fifty.",
    "timestamp" : "01:11:46-01:11:52"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:52-01:12:01",
    "text" : "No refrigerated tractor trailer. Yeah. Back of a U-Haul. Kind of running out like they're like a a set of pigs. Yeah."
  },
  {
    "timestamp" : "01:12:01-01:12:03",
    "speaker" : "Greg",
    "text" : "They're all grunting. Yeah."
  },
  {
    "text" : "And then my worst is Uh one of the the referees getting in the way in this game because they were taking as many shots as Troy Brown and uh Tom Brady were. In fact, Radigays, one of the refs um Managed to run into the f the Chiefs fullback as he was running onto the field to go to the huddle. And it literally looked like it knocked him out cold. Yeah. And he had this massive like like black eye sort of like you know in boxing where like the bottom like just under their eye swells up and it all like and they cut it to make it the swelling go down. It was that. And that's what they did. They had to give them like eye drops and shit. And just stop the game for like ten minutes.",
    "timestamp" : "01:12:06-01:12:48",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:12:48-01:12:49",
    "text" : "Just keep going?",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh yeah, stayed in the game.",
    "timestamp" : "01:12:50-01:12:51",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:12:51-01:12:52",
    "text" : "He stayed in?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:12:52-01:13:00",
    "text" : "Yeah. Good for him. Yeah. But there's a few plays where like the referees just They were just in the middle of playing just got clobbered.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:13:00-01:13:04",
    "text" : "Just got ragdolled. Yeah. So Molly Molly Wapped."
  },
  {
    "timestamp" : "01:13:05-01:13:06",
    "speaker" : "Andy",
    "text" : "Ooh, like that."
  },
  {
    "text" : "Oh let's oh dear oh dear I mean this is an ideal let's give a game ball out while Craig",
    "speaker" : "Greg",
    "timestamp" : "01:13:07-01:13:19"
  },
  {
    "text" : "Urban thesaurus is Molly whopping.",
    "speaker" : "Steve",
    "timestamp" : "01:13:19-01:13:22"
  },
  {
    "speaker" : "Greg",
    "text" : "Mine. I'm not gonna steal your Steve. Mine goes to Tom Brady, 400 passing yards. Four touchdowns. He's really save it. Save it.",
    "timestamp" : "01:13:22-01:13:36"
  },
  {
    "speaker" : "Steve",
    "text" : "Greg, save it, wait.",
    "timestamp" : "01:13:36-01:13:38"
  },
  {
    "timestamp" : "01:13:39-01:13:43",
    "text" : "Nope. Okay, go ahead.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:13:49-01:13:53",
    "speaker" : "Steve",
    "text" : "Patriots record in catches. in only three quarters."
  },
  {
    "timestamp" : "01:13:54-01:14:29",
    "speaker" : "Andy",
    "text" : "Mine is Dick Enberg for watching a different game than we were. You know what? No, I take it back. Mine is uh the Patriots offensive coordinator. Who is Charlie Weiss at this point? Uh, because he has decided one that he wanted to play this game like I play Madden, which was literally just throw it every fucking play. Brady had like what 50-something attempts. Like 52 attempts, something stupid like that. And they just came out doing that. You know what? Fuck it. We're just not gonna run the ball. And then no huddle too."
  },
  {
    "speaker" : "Steve",
    "text" : "That's their first drive. No huddle five wide. Just like, all right, let's go.",
    "timestamp" : "01:14:29-01:14:32"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:14:32-01:14:32"
  },
  {
    "speaker" : "Steve",
    "text" : "Back in 2002, that was crazy.",
    "timestamp" : "01:14:33-01:14:35"
  },
  {
    "text" : "Yeah. And then just the the amount of trickery they had in this. They on their first touchdown, they tried uh to go for two on the extra point by having the holder yeah Ken Walter try to do uh a dive off of left tackle and he didn't make it. They did another one where they pitched it to Falk who threw it back to Brady who fumbled it and had to throw it away. And then they had another one where they pitched to Falk and F Falk threw deep to Troy Brown. who missed it and our old friend Dick Enberg missed the fact that Brady had pitched it to Falk. Yes. And commentated it that it was uh Brady going deep and he was deriding Brady for missing fall for missing Troy Brown so badly. Until two I think it was like the next play. They somebody must have like told him in his ear that it wasn't actually that and he corrected himself eventually. Yeah, that was really bad. So the offensive play calling I thought was It was uh it felt it felt very um Poor execution, but it felt like Chip Kelly-esque, you know? Yeah just pouring out all the stops and just having a good time with it.",
    "speaker" : "Andy",
    "timestamp" : "01:14:35-01:15:40"
  },
  {
    "speaker" : "Greg",
    "text" : "The U and H is finest. That's right.",
    "timestamp" : "01:15:40-01:15:42"
  },
  {
    "timestamp" : "01:15:42-01:15:46",
    "speaker" : "Steve",
    "text" : "All right, Greg, let us lay us on the uh Mollywapin."
  },
  {
    "timestamp" : "01:15:46-01:16:16",
    "speaker" : "Greg",
    "text" : "Well, so I I put in ragdald into Urban Tesaurus, and and it sounds like I'm getting two separate like paths here. I'm getting w what what looks like a uh semen rag uh synonyms and I'm also getting a lot of like when women are on their period synonym. So I'll just read I'll read a couple and let you guys make the call. Uh Cotton pony, uh cockrag, uh butcher's apron"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh some of these are a simon for ragdoll.",
    "timestamp" : "01:16:16-01:16:19"
  },
  {
    "text" : "I'm still I'm still stuck on cotton pony. I don't know which side that goes on. West Virginia tiki torch. That could be a lot of things. That could be anything.",
    "speaker" : "Andy",
    "timestamp" : "01:16:19-01:16:34"
  },
  {
    "timestamp" : "01:16:34-01:16:36",
    "text" : "Rusty work boot.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh my.",
    "timestamp" : "01:16:37-01:16:37"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:16:40-01:17:00",
    "text" : "Uh rag in a bag. Uh sea semen farm. I think you can get what that one is. That one I got, yeah. Dude, there's like Literally like seven hundred uh options here. Holy shit. Oh Lord. This this is awesome. Sorry, mom."
  },
  {
    "text" : "Sphincters is making it into this episode.",
    "speaker" : "Andy",
    "timestamp" : "01:17:03-01:17:04"
  },
  {
    "text" : "Ooh, sphincter slap? That's a good one for you, Andy.",
    "timestamp" : "01:17:05-01:17:08",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "In this case, I'm gonna say probably. Uh all right, well on that note, um if we have any listeners left. What are we looking at next week, boy?",
    "timestamp" : "01:17:11-01:17:24"
  },
  {
    "timestamp" : "01:17:24-01:17:25",
    "text" : "I have no idea.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:17:26-01:17:44",
    "speaker" : "Andy",
    "text" : "New England Page traveling to Qualcomm Stadium. To play the San Diego Supercharges. San Diego Supercharges. That's the one. So we'll see you next week if we haven't been canceled by then."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:17:47-01:17:48",
    "text" : "Yeah we'd be canceled. What?"
  },
  {
    "timestamp" : "01:17:48-01:17:55",
    "text" : "Greg. Who's gonna cancel us? You are the reason we'd be canceled. Can I who's canceling us? All of you.",
    "speaker" : "Andy"
  },
  {
    "text" : "I when I when I came in cancel us.",
    "timestamp" : "01:17:55-01:18:00",
    "speaker" : "Steve"
  },
  {
    "text" : "When I came into this recording, I was like, I'm intentionally gonna make this go off the rails. I I set out to do that.",
    "speaker" : "Greg",
    "timestamp" : "01:18:01-01:18:08"
  },
  {
    "text" : "It doesn't feel intentional. Oh. Just feels just naturally who you are.",
    "timestamp" : "01:18:08-01:18:13",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "You did an okay job at it, but like, I don't know.",
    "timestamp" : "01:18:14-01:18:16"
  },
  {
    "text" : "We didn't weird places, no?",
    "speaker" : "Greg",
    "timestamp" : "01:18:16-01:18:19"
  },
  {
    "text" : "Sure.",
    "speaker" : "Steve",
    "timestamp" : "01:18:19-01:18:19"
  },
  {
    "text" : "Yeah, we did. We just kinda dipped our toes in. We kinda tickled the line. Yeah. Yeah. We did. I mean, we were on WikiDiff. Between talking about smack and smack.",
    "timestamp" : "01:18:20-01:18:33",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:18:33-01:18:33"
  },
  {
    "text" : "Yeah. And uh I think you're wrong there, Andy. And I think we proved that unequivocally.",
    "timestamp" : "01:18:34-01:18:40",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:18:41-01:18:50",
    "text" : "I disagree. I think you unproved it with your your list. I don't even remember what it was called. The something smack.",
    "speaker" : "Andy"
  },
  {
    "text" : "Um this we can save this for a later episode, but I have uh, you know, like the um when you have sex and then you leave and like th there's like there's a term for that, you know",
    "speaker" : "Greg",
    "timestamp" : "01:18:50-01:19:06"
  },
  {
    "text" : "Like the wham bam, thank you, ma'am.",
    "speaker" : "Steve",
    "timestamp" : "01:19:06-01:19:08"
  },
  {
    "timestamp" : "01:19:08-01:19:16",
    "speaker" : "Greg",
    "text" : "Yes, exactly. So the uh synonyms of that, I've got like 15 that are so fucking funny. Oh."
  },
  {
    "timestamp" : "01:19:17-01:19:25",
    "speaker" : "Steve",
    "text" : "I had a note that I should have brought up on what's Tom Brady's completion streak. I don't know. He had like eleven in or twelve in a row in this game."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it was somewhere in that range.",
    "timestamp" : "01:19:26-01:19:28"
  },
  {
    "text" : "I'm not gonna stat jack that.",
    "timestamp" : "01:19:28-01:19:30",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:19:31-01:19:33",
    "speaker" : "Steve",
    "text" : "Well stat jag it because I'm gonna ask it later."
  },
  {
    "speaker" : "Greg",
    "text" : "Okay. I'll stack it, check it before the next episode.",
    "timestamp" : "01:19:33-01:19:37"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh-huh. Uh all right, and on that note, we will see you next week in San Diego.",
    "timestamp" : "01:19:37-01:19:45"
  },
  {
    "text" : "Bye guys. Oh, we're still recording? Oh. I thought we were done like ten five minutes.",
    "timestamp" : "01:19:46-01:19:52",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Speaker 5",
    "text" : "Well you didn't let me finish before. Oh well. You just edit it. You'll just you'll figure it out in post. Oh fucking hell. Well excuse me.",
    "timestamp" : "01:19:53-01:20:03"
  }
]