[
  {
    "speaker" : "Mom",
    "timestamp" : "00:00-00:18",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother."
  },
  {
    "speaker" : "Andy",
    "text" : "Welcome back everybody. Patriots Dynasty Podcast. Getting close to the end of the 2002 season. We're on week 15 as we travel to I don't know where in Tennessee is it? Nashville?",
    "timestamp" : "00:23-00:35"
  },
  {
    "speaker" : "Scott",
    "text" : "It is yeah. It's gotta be Nashville.",
    "timestamp" : "00:36-00:39"
  },
  {
    "text" : "You boys have you boys have been, I have not. The Nashville, Tennessee to face the eight and five Tennessee Titans. The Patriots also 8-5, so this is a game that means a lot in the playoffs. And we will come across that soon enough, at least for the Patriots. But before we get stuck in, Steve Brown, would you like to introduce your guest?",
    "speaker" : "Andy",
    "timestamp" : "00:39-01:04"
  },
  {
    "timestamp" : "01:05-01:13",
    "speaker" : "Steve",
    "text" : "Yeah, we have Scott joining us. Not because he's a Titans fan though, just because. You heard how awesome Trevor had here, so here he is."
  },
  {
    "speaker" : "Scott",
    "timestamp" : "01:13-01:25",
    "text" : "I I heard Trevor on. I got really jealous. Felt like I needed to one up him. Uh we'll see how it goes. But I I was also kind of a Titans fan just because they had like a cool logo."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:25-01:25"
  },
  {
    "timestamp" : "01:25-01:26",
    "speaker" : "Scott",
    "text" : "And cool color."
  },
  {
    "text" : "So was Steve actually. I found an easy logo to draw because like I'm a child and it was like a T, but it was also like a sword. It was super cool to draw and then had like flames and shut off it.",
    "timestamp" : "01:27-01:41",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:41-01:45",
    "speaker" : "Andy",
    "text" : "That's flames, I don't know. I just thought it was a T with like some stars around it or some shit."
  },
  {
    "timestamp" : "01:45-01:48",
    "speaker" : "Steve",
    "text" : "No, and then a circle had like the red and blue flames coming off it."
  },
  {
    "speaker" : "Andy",
    "text" : "I was really good at drawing the Falcons logo. Cause it was like a straight line at the top and then a curve at the bottom. It was super easy.",
    "timestamp" : "01:48-01:56"
  },
  {
    "timestamp" : "01:56-02:01",
    "speaker" : "Steve",
    "text" : "Yeah, that's really fucked up with an impossible to draw logo. Impossible."
  },
  {
    "text" : "The new one's not that bad. It's it's easy to do. I've had a lot of practice. I bet Greg can draw it.",
    "timestamp" : "02:01-02:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean it's tough to make it look like it's supposed to look.",
    "timestamp" : "02:10-02:13"
  },
  {
    "timestamp" : "02:14-02:25",
    "speaker" : "Steve",
    "text" : "Yeah, I cheaper in the mountain, but like it still comes out real weird looking. Because I'm a terrible drawer, that's why I like the Titans one. It's just a T It's super straight lines and shit. It's easy."
  },
  {
    "speaker" : "Greg",
    "text" : "It was a super downgrade from the Oilers though. Those old Oilers jerseys and helmets are so sweet.",
    "timestamp" : "02:26-02:31"
  },
  {
    "speaker" : "Andy",
    "text" : "The color Yeah, I feel like those helmets were up there with the old Patriots helmets. Like it just screams old school.",
    "timestamp" : "02:31-02:40"
  },
  {
    "timestamp" : "02:40-02:41",
    "text" : "Yeah, I agree.",
    "speaker" : "Steve"
  },
  {
    "text" : "I was just a fan of the baby blue on the Titans, you know. It's nice. It's like the Chargers baby blue. Yeah.",
    "speaker" : "Scott",
    "timestamp" : "02:41-02:47"
  },
  {
    "text" : "I think it's better than what the Chargers are wearing now. Have you seen them this year with those like neon yellow pants? It's like if Steve had designed a uniform.",
    "timestamp" : "02:48-02:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "02:57-03:02",
    "text" : "Titans is kind of a shitty name. You know, like it does does it even have any relevance to Tennessee?"
  },
  {
    "text" : "Probably not. Maybe they're the titans of industry. It's super generic though.",
    "timestamp" : "03:03-03:08",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:08-03:14",
    "speaker" : "Andy",
    "text" : "Well, didn't uh Chris Barman, he wanted to be the uh Tennessee Tuxedos. Which would have been fucking cool."
  },
  {
    "speaker" : "Speaker 6",
    "text" : "Yeah, uniforms. Yeah. Sick jerseys.",
    "timestamp" : "03:14-03:18"
  },
  {
    "text" : "Just like, yeah, just like black everywhere except for like the the front like chest piece would be white. Little bow tie at the top. Bow ties.",
    "speaker" : "Andy",
    "timestamp" : "03:18-03:26"
  },
  {
    "text" : "God, that honor would be that would be so sneak. I feel like it would look kind of soft though, you know, just like guys out there in fake tuxedo looks like a gentleman. Everyone here is basically tuxedo. Is a gentleman like are you scared of a gentleman though? I feel like you look at someone in a tuxedo, you feel like you can fuck them up. No way, you bring that",
    "timestamp" : "03:28-03:46",
    "speaker" : "Scott"
  },
  {
    "timestamp" : "03:47-03:48",
    "speaker" : "Greg",
    "text" : "Yeah, say that to James Bond."
  },
  {
    "timestamp" : "03:48-04:07",
    "text" : "Yeah, you're right. You're right. I'm sorry, I take it back. But this was not the Tennessee Tuxedos, this is the Tennessee Titans, unfortunately. Um and unfortunately they kicked the shit out of the Patriots in this game. We lost. Did we start with the score? Yeah, they lost. Damn. Thanks for coming, Greg. They lost 24-7.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "04:08-04:14",
    "text" : "There were no highlights for this game. Awful game. That's why that's how bad it was. There were no highlights.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "04:15-04:29",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, there were actually I literally couldn't find any highlights except for one guy who was I think some like Titans historian or something like that. You had like a minute 52 clip of the pick six and that was it that Tom Brady threw."
  },
  {
    "speaker" : "Scott",
    "timestamp" : "04:29-04:30",
    "text" : "Hard."
  },
  {
    "text" : "This is a hard, awful party.",
    "speaker" : "Steve",
    "timestamp" : "04:30-04:32"
  },
  {
    "text" : "I really, really regret coming on this episode.",
    "speaker" : "Scott",
    "timestamp" : "04:32-04:35"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, this is not a great episode. Did you actually watch the game?",
    "timestamp" : "04:35-04:38"
  },
  {
    "text" : "I actually watched the game. I was like, I'm gonna be all in on this. And then I watch I look at the score. And I'm like, fuck, I already made a mistake. And then I watch the first half and I'm like, this is just the fucking worst. This game sucks.",
    "timestamp" : "04:38-04:51",
    "speaker" : "Scott"
  },
  {
    "timestamp" : "04:51-04:54",
    "text" : "You watch first half, you're like, how can it get worse? And then it does. Yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "And then you watch the second half. So yeah, so let's do the watchability score out of six Lombardies. Steve, I think I heard you say you gave it a one.",
    "timestamp" : "04:54-05:01"
  },
  {
    "timestamp" : "05:02-05:04",
    "speaker" : "Steve",
    "text" : "Yeah. Twenty-four to seven."
  },
  {
    "timestamp" : "05:04-05:07",
    "speaker" : "Andy",
    "text" : "Twenty-four to seven to seven. And it wasn't that close."
  },
  {
    "text" : "It wasn't.",
    "speaker" : "Steve",
    "timestamp" : "05:07-05:08"
  },
  {
    "speaker" : "Andy",
    "text" : "The Titans were running clock basically halfway through the third quarter. Yeah.",
    "timestamp" : "05:09-05:13"
  },
  {
    "timestamp" : "05:13-05:14",
    "speaker" : "Steve",
    "text" : "Pretty much the game."
  },
  {
    "speaker" : "Andy",
    "text" : "After Brady threw the pick six, yeah. It was a microcosm of the entire season where the Patriots couldn't stop the run, couldn't actually run the ball, and then just like gave up on it completely. I think uh Greg, do you have the stats there? Let's see. Uh sure, what do you need? Rushing yards for and against.",
    "timestamp" : "05:15-05:36"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, George had a hundred yards tonight The ground with another fifty from McNair. Oh, another eighty f eighty-five from Robert Holcomb. Right.",
    "timestamp" : "05:36-05:46"
  },
  {
    "timestamp" : "05:47-05:54",
    "text" : "So yeah. So Tennessee got uh two hundred and thirty-eight rushing yards. The Pages had fifty-six. Yeah but ten of those were from Timber.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "05:55-06:07",
    "text" : "Because Eddie George had thirty one rushes for a hundred yards. Thirty one rushes. It was a hundred yards by like uh Legarrett Blunt, but without Legarrat Blunt breaking a big run at all, just three yards fall over.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it was not good.",
    "timestamp" : "06:07-06:08"
  },
  {
    "speaker" : "Scott",
    "timestamp" : "06:09-06:16",
    "text" : "The average was three yards, and I felt like every single run he had was also three yards. It was brutal."
  },
  {
    "speaker" : "Andy",
    "text" : "Except for that one, you had one that was fifteen. And then everything else was literally three yards of carry.",
    "timestamp" : "06:16-06:21"
  },
  {
    "text" : "Yeah, this is two thousand and two, huh? Yeah. 120 passing yards for the Patriots and 127 for the Titans. Yikes. In the whole game.",
    "timestamp" : "06:23-06:34",
    "speaker" : "Greg"
  },
  {
    "text" : "That's what I'm saying. I knew that. I looked that up in like half time. Well Yeah.",
    "timestamp" : "06:34-06:39",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, I did the same thing, Steve. Like how bad is it really? And it was it was that bad. So yeah, I give it I mean this is probably I'd say the worst loss we've seen so far. I mean there's been some dolphins ones that were brutal, but this is score-wise, like the Pages don't lose this big Really ever.",
    "timestamp" : "06:40-06:59",
    "speaker" : "Andy"
  },
  {
    "text" : "I felt like it was much worse than the score as well, just because like I said, they seemed like they were just running out the clock the entire game. They just ran the ball over and over again and we couldn't stop them.",
    "timestamp" : "07:00-07:11",
    "speaker" : "Scott"
  },
  {
    "timestamp" : "07:11-07:23",
    "speaker" : "Andy",
    "text" : "Mm-hmm. And even if they tried to pass it. Uh McNair would drop back to pass and then the field would open up in the middle and he'd just like he wasn't even running, he was more like limping for ten yards a pop."
  },
  {
    "timestamp" : "07:25-07:32",
    "text" : "Yeah, he was Although, I mean the first maybe watch the first ten minutes of it, because there's some awesome names in there.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh yeah. Do we want to get into those?",
    "timestamp" : "07:32-07:34",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:34-07:39",
    "speaker" : "Steve",
    "text" : "Titans come back again later, but there's so many good players that you're like, oh shit, I remember him. I remember him, I remember him."
  },
  {
    "timestamp" : "07:39-08:07",
    "text" : "Yeah, I think we'll see the Titans next year. But let's uh let's get in this Titans team. They would finish the season 11 and 5, first in the AFC South, the vaunted AFC South. They would beat the Steelers in overtime in a shootout, 34-31 in the divisional. And lose to get their doors blown off by the Raiders, who would, we know, go to the Super Bowl uh 24 41. Not great. Um this was Jeff Fisher though.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "08:08-08:10",
    "speaker" : "Greg",
    "text" : "Which it was. This is gotta be a good thing."
  },
  {
    "text" : "Because this was literally his only Time he did it in the seven games that he played. Yeah, he was six and one. But no the patrons were six and one against Jeff Fisher team.",
    "timestamp" : "08:14-08:26",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:27-08:32",
    "text" : "Whoa, it was six and one. I was like I thought it'd be more around five hundred. Nope."
  },
  {
    "speaker" : "Andy",
    "text" : "Not against against the Patriots. Everybody overall.",
    "timestamp" : "08:32-08:36"
  },
  {
    "timestamp" : "08:36-08:40",
    "text" : "But they were they were rolling coming into this game, right? They started one and four.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, so they kind of mirrored the Patriots season where They won their first game and then lost four in a row. So the Patriots won their first two games and lost four in a row. And then they won, I think it was coming into it was like six of the last seven or something like that to get to eight and five. And the pages, you know, kind of did the same sort of thing. So they were kind of mirror images, but I think I don't know why, but it seemed like the Titans were more legit eight and five than the Patriots were. Because even in like these wins that we've seen this year, they haven't been particularly like dominant in any s fashion. Um they've just they've been winning, but they've been kind of like boring wins like we talked last week.",
    "timestamp" : "08:40-09:22",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, yeah, that game in Chicago was really boring, Andy. Was it a deserved win, would you say?",
    "speaker" : "Greg",
    "timestamp" : "09:22-09:28"
  },
  {
    "timestamp" : "09:29-09:31",
    "speaker" : "Steve",
    "text" : "Over time, that guy's a chief snoozer."
  },
  {
    "text" : "Yeah, a real snooze fast.",
    "speaker" : "Greg",
    "timestamp" : "09:31-09:32"
  },
  {
    "timestamp" : "09:32-09:36",
    "speaker" : "Andy",
    "text" : "Maybe we've got to be around. I'm talking about since those."
  },
  {
    "speaker" : "Greg",
    "text" : "Now you're talking about the podcast that we're recording based on the season. That's what's boring.",
    "timestamp" : "09:36-09:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:42-09:43",
    "text" : "I disagree."
  },
  {
    "timestamp" : "09:45-09:53",
    "text" : "Well this is a legit team though. I mean they're what two years, three years removed from their Super Bowl, right? Correct. 1999.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "09:53-09:54",
    "text" : "Yeah."
  },
  {
    "text" : "So they went thir they went 13 and 3 for 1999 and 2000. And a lot of those guys are still on this team. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "09:54-10:03"
  },
  {
    "text" : "But they're they're kind of starting to break down now. Like we're talking about McNair, he they were talking about Noah because this was uh Al Michaels and John Madden, first of all. Amazing. But they were talking about how McNair didn't practice during the week.",
    "speaker" : "Andy",
    "timestamp" : "10:03-10:18"
  },
  {
    "timestamp" : "10:18-10:23",
    "speaker" : "Scott",
    "text" : "Yeah, for like the last six weeks or something, he just gave up on practicing."
  },
  {
    "timestamp" : "10:23-10:26",
    "speaker" : "Andy",
    "text" : "Yeah, he just shows up on game day and fucking slings it."
  },
  {
    "text" : "I don't know if that's the classic Stephen near though. He did that forever.",
    "timestamp" : "10:26-10:29",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because they they they showed some like infographic of like all the injuries he'd had over the years. It's like, oh, he has a bad toe and he's got a bad knee and he's got a bad shoulder and he's got a bad ribs and he's got a bad other shoulder and like just on and on like every single year he We're just like dragging his ass. Through the season.",
    "timestamp" : "10:30-10:51"
  },
  {
    "text" : "But doesn't go to win an MVP after this in like two years? Remember when Patriots beat the co-MVPs, Manning and Believe it's next year",
    "timestamp" : "10:51-11:00",
    "speaker" : "Steve"
  },
  {
    "text" : "Wow, want me to want to get into Steve McNair? I got a lot of notes on him. I got a lot of notes. I watched his uh A Football Life, Steve McNair. He's the man. Nice. He is the man. So Let's start at the beginning here. He's born he's a he's a country boy through and through. He's from Mount Olive, Mississippi. So he's super talented. He um He gets he was drafted by the Mariners out of high school. He got he got offered a full boat uh full boat to play at Florida, but they wanted him play like defensive back. So he said no and he went to Alcorn State, which is uh in Mississippi. It's in HBCU, and it's also Division I double A.",
    "timestamp" : "11:00-11:45",
    "speaker" : "Greg"
  },
  {
    "text" : "So basically U and H of Mississippi.",
    "speaker" : "Andy",
    "timestamp" : "11:46-11:49"
  },
  {
    "speaker" : "Greg",
    "text" : "Dude. I can't remember whose stats we were talking about last week. But his senior year stats at Alcorn State, he had uh combined yardage on the ground and through the air. He had six thousand two hundred and eighty-one yards and fifty-six touchdowns in eleven games. Eleven games. He was averaging five hundred and seventy yards of offense a game and five touchdowns.",
    "timestamp" : "11:49-12:22"
  },
  {
    "speaker" : "Scott",
    "timestamp" : "12:24-12:27",
    "text" : "Holy crap for eleven days. Holy crap."
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, you should you should look up his college highlights there in C.",
    "timestamp" : "12:27-12:31"
  },
  {
    "timestamp" : "12:31-12:34",
    "speaker" : "Andy",
    "text" : "Does he have college highlights? Mm-hmm. Oh fuck yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "12:34-12:39",
    "text" : "Dude, he was a thick boy too. They were they kept mentioning it in the in the football life."
  },
  {
    "speaker" : "Andy",
    "text" : "They mentioned the game all the time too, yeah.",
    "timestamp" : "12:39-12:41"
  },
  {
    "text" : "Dude, he actually came third in Heisman uh voting. At Alcorn State. Yep. That's insane. It's tied for the it's tied for the highest ever like finish for a one double-A player. Holy shit.",
    "timestamp" : "12:43-12:58",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Scott",
    "text" : "Did he run a bunch in college too? Or did he kind of pick that up in the NFL?",
    "timestamp" : "12:59-13:04"
  },
  {
    "speaker" : "Greg",
    "text" : "I think he did run a bunch in college. I want to st I mean. Yeah, I think it was like five thousand through the air and a thousand on the ground. Jesus. In eleven games. That's insane.",
    "timestamp" : "13:04-13:16"
  },
  {
    "text" : "I have a hard time doing that in Madden on easy.",
    "timestamp" : "13:16-13:19",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "13:20-14:39",
    "speaker" : "Greg",
    "text" : "He was a thick boy though, you know? So he uh there's a great story from when he was like at college and they were they were talking about how he how he hated lifting weights and his uh the strength coach was like Uh I said that if he could go over there and like uh bench press two sixty ten times, he wouldn't have to work out for like the year. And he said he just went over, knocked it out, and then went took a nap in the weight room. What a badass. Yeah, that's my kind of guy. It's incredible. Jesus. So then he so he he you know has that really successful senior year and he's pretty highly touted coming out of there. He so the 1995 draft, he's picked third overall. By the Houston Oilers. He's the the highest drafted African American quarterback at the time, which I thought was pretty interesting. Wait, when did he get drafted? Wow. So he's like This is I I looked it up and the the names you'd recognize before them like Cunningham and War Moon. Those are the guys that kind of like set the standard, I think. Yeah, but he was the first ever MVP, like Steve was saying. He was the first ever black MVP. Um, second ever black quarterback to start in a Super Bowl. Can you name the first?"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh Doug Williams?",
    "timestamp" : "14:40-14:42"
  },
  {
    "speaker" : "Greg",
    "text" : "Nice Andy. Nailed that. 1988.",
    "timestamp" : "14:42-14:47"
  },
  {
    "timestamp" : "14:47-14:48",
    "text" : "Yeah, residents.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:49-15:03",
    "speaker" : "Greg",
    "text" : "Yeah. Can't remember his name. So I mean he it took him a little while to get like the to win the starting job. By the time they went to Tennessee, that's when he started really picking it up. So I think that was 99, I believe."
  },
  {
    "timestamp" : "15:03-15:03",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "And that was the year they went to the Super Bowl. They had the Music City Miracle. Oh. They had the Pro Bowl. So that they went 13-3 that year. So 2000 to 2005 is really like heyday. So we're kind of in the midst of it here.",
    "timestamp" : "15:04-15:17",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:17-15:18",
    "text" : "Yeah, no kidding."
  },
  {
    "speaker" : "Greg",
    "text" : "Yep. He won the MVP in two thousand and three with Manning. Um there was there was more people talking about him napping. He loved taking naps, apparently. I think it was Jeff Fisher that said like he used to nap before every practice and every game. And that if he didn't get his nap in, he'd play really poorly. Which is just ridiculous. He's like all grumpy and shit 'cause he didn't get it. Didn't do snoozing.",
    "timestamp" : "15:18-15:49"
  },
  {
    "speaker" : "Steve",
    "text" : "Are there like temperatic beds in the locker room just for him? Dude, I don't know. He's probably napping on the floor. Yeah, yeah.",
    "timestamp" : "15:49-15:58"
  },
  {
    "text" : "He's just a country boy, you know, he just like take a snooze wherever.",
    "speaker" : "Greg",
    "timestamp" : "15:58-16:02"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "16:04-16:07",
    "text" : "Need you go play for bar after and take a little nap?"
  },
  {
    "timestamp" : "16:09-16:17",
    "speaker" : "Greg",
    "text" : "Yeah, so he ends up he uh it sounded like kind of a sour ending in uh Tennessee. They drafted Vince Young, that was his replacement."
  },
  {
    "text" : "Oh right.",
    "timestamp" : "16:17-16:17",
    "speaker" : "Andy"
  },
  {
    "text" : "So they traded him to the Ravens. Yeah, he actually went 13 and 3 with the Ravens in 06.",
    "timestamp" : "16:19-16:25",
    "speaker" : "Greg"
  },
  {
    "text" : "That's right.",
    "speaker" : "Andy",
    "timestamp" : "16:26-16:27"
  },
  {
    "timestamp" : "16:27-16:40",
    "speaker" : "Greg",
    "text" : "And then after that he kind of tailed off and then he retired like two years later. And then if you remember, he actually was murdered a little while ago. Did you know that? No."
  },
  {
    "text" : "I thought I thought it was a suicide.",
    "speaker" : "Andy",
    "timestamp" : "16:40-16:41"
  },
  {
    "speaker" : "Greg",
    "text" : "I thought it was something else. Yeah. It was a murder suicide. So It was one of his mistresses, right? This like it's this twenty-year-old Iranian. Bartender at Dave and Busters.",
    "timestamp" : "16:41-16:58"
  },
  {
    "timestamp" : "16:59-17:03",
    "text" : "No, you're making that up. Yeah. I swear to God, dude. This is off Wikipedia.",
    "speaker" : "Scott"
  },
  {
    "speaker" : "Greg",
    "text" : "Hang on, I'm gonna have to fact check this. Fact check it, dude. Sahel Kazimi. So she's his mistress and I guess what they think happened was she saw his other mistress leaving their his like he had like a separate apartment where he like Took women back to, I guess, that his wife didn't know about.",
    "timestamp" : "17:04-17:27"
  },
  {
    "timestamp" : "17:27-17:27",
    "speaker" : "Speaker 6",
    "text" : "Okay."
  },
  {
    "speaker" : "Greg",
    "text" : "So he went there one night and basically she shot him three times and then shot herself in the head at the apartment.",
    "timestamp" : "17:28-17:39"
  },
  {
    "timestamp" : "17:40-17:43",
    "speaker" : "Scott",
    "text" : "Shit. That's super sad. Yeah. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "I mean it's fuck I mean it's one of those things where there's there's a lot of like conspiracy shir shit uh floating around about it. But it seemed pretty cut and dry. I mean she was going through like uh issues with money and then she saw the other chick She was, I think, a bit, I mean, she was Iranian. So careful. How many Iranian listeners do we have, Indy? Do you think",
    "timestamp" : "17:43-18:11"
  },
  {
    "timestamp" : "18:11-18:14",
    "speaker" : "Scott",
    "text" : "No offense to Iran at all. It's fine. We love you guys."
  },
  {
    "text" : "Hopefully none right now.",
    "timestamp" : "18:15-18:16",
    "speaker" : "Andy"
  },
  {
    "text" : "So yeah, uh a tragic ending, but uh a pretty sick career. And like there's all sorts of cool stuff he did with like um They said he had like a football camp in the South where he had like eleven thousand kids come through the camp and not a sing it was completely free for every single person. And like Cam Newton went there. Vince Young went there, so like some pretty big names went through his football camp. Yeah. That's good.",
    "timestamp" : "18:18-18:42",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Scott",
    "text" : "Yeah. Another one of the reasons I actually liked the Titans was because they had Steve McNair and he was like he was like the original like Deshaun Watson. V",
    "timestamp" : "18:43-18:52"
  },
  {
    "timestamp" : "18:53-19:39",
    "text" : "No, I think I had a good comp. It's Ben Rothesberger. Whoa, you have to back that up, big dog. He's more athletic than Ben though. Definitely more athletic than the biggest. And like skipping a ton of practices and playing. You know, Ben's a tough son of a bitch. That's true. Yeah. And he's like, he can run pretty well and he's tough to bring down. He's tough to bring down for sure. In this game, he had that touchdown run where he broke that guy and then just Yeah. Blitz Tyla, the girls threw everywhere. I went to go meet him at the goal line and he just ran over him and he got like ping-pong with another safety coming across. It was a fucking gritty run. He had that fourth goal. QB sneak. Yep. He was a Pure grit.",
    "speaker" : "Steve"
  },
  {
    "text" : "I love how he's just like a country strong boy too. I need to meet somebody like that, you know?",
    "timestamp" : "19:40-19:45",
    "speaker" : "Greg"
  },
  {
    "text" : "Don't you live in North Carolina?",
    "timestamp" : "19:45-19:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. But that's not really country, you know?",
    "timestamp" : "19:48-19:51"
  },
  {
    "timestamp" : "19:51-19:53",
    "text" : "I mean they can't be too far from there. Not in Berlin.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm talking like Louisiana, Mississippi. Yeah. He opened like a a crawfish restaurant too in Nashville. Like, you know, just super southern shit. That's what that's what I need.",
    "timestamp" : "19:55-20:06"
  },
  {
    "text" : "Was this stadium the same one that we went to, Greg? I didn't know if they built a new one since that.",
    "timestamp" : "20:07-20:13",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "20:13-20:23",
    "speaker" : "Greg",
    "text" : "Yeah, it's the same stadium. It's a different name. It was Adelphi, Adelphi Coliseum. So they built it when they moved Oh right. In nineteen ninety-nine, I believe."
  },
  {
    "speaker" : "Andy",
    "text" : "I think it's brass any better now though. Yeah. Because there was a shit ton of talk in this game about how God-awful the grass was. But basically they only replaced the turf between the numbers. So there's a strip of like actual grass and the rest of it was They literally call it painted dirt because they were spray painting the sidelines because you couldn't actually see where it was. And there's a bunch of guys like stepping out of bounds. Uh like trying to catch a pass because they didn't know they were out of bounds because you couldn't actually see where the line was. And Belchuk, I guess before the game had like yeah, he made them like repaint it to make it more obvious, and it still didn't work.",
    "timestamp" : "20:24-20:59"
  },
  {
    "text" : "Yeah, they showed a clip of him before the game, like pointing at the sideline, like, hey, we need to paint this spot right here. This is gonna be an issue.",
    "timestamp" : "20:59-21:07",
    "speaker" : "Scott"
  },
  {
    "text" : "And it was. Yeah. Multiple times for both teams.",
    "speaker" : "Andy",
    "timestamp" : "21:07-21:09"
  },
  {
    "speaker" : "Steve",
    "text" : "Madden was pissed about it.",
    "timestamp" : "21:12-21:13"
  },
  {
    "timestamp" : "21:14-21:20",
    "speaker" : "Andy",
    "text" : "He was, yeah. Madden was like, this is a these these teams are like billion dollar industries and they can't afford grass The fuck is this?"
  },
  {
    "timestamp" : "21:20-21:24",
    "speaker" : "Steve",
    "text" : "Like, what are they doing? Are they working on golf courses? This is unacceptable."
  },
  {
    "timestamp" : "21:25-21:42",
    "speaker" : "Andy",
    "text" : "It was awesome. Yeah, I enjoy I really I've forgotten how much I enjoyed Madden. Dude, Madden. He gets a lot of shit. But uh like looking back at on what he's talking about now compared to the guys we have today, I think I'd take Madden over any of them."
  },
  {
    "text" : "He uh did you catch that at the end of the first half when the Patriots had just like a little bit of timeout left and like one or two timeouts? Matt's like they should go for it. They need to throw this ball. They need to get down the field.",
    "speaker" : "Steve",
    "timestamp" : "21:42-21:54"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:55-21:56",
    "text" : "He's like, I've learned my lesson."
  },
  {
    "text" : "Yeah, yeah.",
    "timestamp" : "21:56-21:57",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:57-22:03",
    "text" : "I thought that was hilarious. Yeah, it was great. Taking shots at himself. No, he was great. I I really enjoyed him."
  },
  {
    "text" : "It's sad for me that when I hear Madden, I just think of like Frank Caliendo's impression of Madden every time. It's like a sad thing with me. I don't even remember the actual Madden.",
    "speaker" : "Scott",
    "timestamp" : "22:03-22:15"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "22:16-22:19",
    "text" : "A great impression though. He's an all-timer. He is all-timer."
  },
  {
    "timestamp" : "22:21-22:23",
    "speaker" : "Steve",
    "text" : "Rewatching these games give me a whole new appreciation for his commentary."
  },
  {
    "text" : "Yeah. It was always him doing Cowboys games. Those like the only memories I had of John Madden.",
    "timestamp" : "22:24-22:31",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:31-22:36",
    "text" : "And him uh saying in the Super Bowl, don't go for it. That was like the defining memory for me for Madden.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. But everybody forgets that he changed this tune halfway through. It's like actually you know what? Fuck it, let's do this.",
    "timestamp" : "22:36-22:42"
  },
  {
    "timestamp" : "22:42-22:51",
    "text" : "I mean he's just, you know, saying that, call it as he sees it, which is pretty sweet, which I like. That's how he saw it at that time. And I think we set on that Super Bowl episode, you can kind of see where he's coming from.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "22:52-22:53",
    "text" : "Oh, absolutely, yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Can we talk about his eyebrows for a second? They're incredible. They're a different color from his hair. It's insane. How does that even make sense? Super bushy too. Incredible. Like as a guy with bushy eyebrows, I appreciate his eyebrows.",
    "timestamp" : "22:53-23:09",
    "speaker" : "Scott"
  },
  {
    "text" : "You you tweeze him?",
    "timestamp" : "23:10-23:11",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Scott",
    "text" : "I should instead just let him go wild. He doesn't chat that Greg. He just lets someone fucking go crazy.",
    "timestamp" : "23:12-23:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:19-23:31",
    "text" : "You know you have bushy eyebrows when if you go to like Get your haircut and they they take the trimmers and the the uh the comb. And they they you know how they do it like by your ear? They do that on your eyebrows too. Like oh fuck."
  },
  {
    "text" : "Yeah, I had to tell the lady, hey, hey, what are you doing? Leave the eyebrows. She just started buzzing them off.",
    "timestamp" : "23:31-23:37",
    "speaker" : "Scott"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:37-23:39",
    "text" : "They they know better than I do. They can do whatever fuck they want."
  },
  {
    "text" : "Yeah, they they are a different color.",
    "timestamp" : "23:39-23:42",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, they're like a dark brown and he has gray hair. It's bizarre.",
    "timestamp" : "23:42-23:47",
    "speaker" : "Scott"
  },
  {
    "text" : "He's a he's a rough looking dude.",
    "speaker" : "Greg",
    "timestamp" : "23:48-23:50"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:51-23:58",
    "text" : "Oh yeah, he's uh well what's the crow? He's been he's been ridden hard and put away wet. I believe the telling us."
  },
  {
    "timestamp" : "23:59-24:02",
    "text" : "That's why I didn't like flying though. What? What was that?",
    "speaker" : "Steve"
  },
  {
    "text" : "I think it's a motorcycle thing, but uh yeah.",
    "timestamp" : "24:03-24:06",
    "speaker" : "Andy"
  },
  {
    "text" : "Is that specific to him or is that just a phrase you know? That's just a phrase I know.",
    "timestamp" : "24:08-24:13",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "24:13-24:23",
    "text" : "I've heard that phrase already. I think it's like saddles or something like that where they fucking sheep and get them all weathered. Ridden hard and put away wet. That definitely sounds like a sex joke."
  },
  {
    "timestamp" : "24:23-24:26",
    "speaker" : "Andy",
    "text" : "It hasn't been taken care of. Okay."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "24:26-24:32",
    "text" : "It was ridden hard in this game. Uh the Patriots offense by the Titans defense."
  },
  {
    "timestamp" : "24:38-24:44",
    "speaker" : "Andy",
    "text" : "I tell you, that defense the defense had to be. Garbage."
  },
  {
    "text" : "That Titans defense had a ton of studs too.",
    "timestamp" : "24:45-24:48",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, they did. Yeah, there's some big names on that defense.",
    "timestamp" : "24:48-24:50"
  },
  {
    "timestamp" : "24:51-24:53",
    "speaker" : "Steve",
    "text" : "Rookie Albert Hainsworth. Javon Kirk."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Should we talk about Albert Hainsworth?",
    "timestamp" : "24:54-24:56"
  },
  {
    "text" : "Yeah, and it's a little bit more than a little bit. Roughing the passer. Do you see that super dirty roughing the passer?",
    "speaker" : "Steve",
    "timestamp" : "24:56-25:03"
  },
  {
    "timestamp" : "25:03-25:05",
    "speaker" : "Andy",
    "text" : "Yeah, it wasn't that dirty, but it was definitely roughing."
  },
  {
    "timestamp" : "25:07-25:14",
    "speaker" : "Steve",
    "text" : "We've been watching these games for the last couple of years and it's astounding how few, you know, roughing the passers there are."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "25:14-25:15"
  },
  {
    "timestamp" : "25:15-25:17",
    "speaker" : "Steve",
    "text" : "That nowadays it definitely is."
  },
  {
    "timestamp" : "25:17-25:33",
    "speaker" : "Andy",
    "text" : "Yeah. Oh yeah. That that would have been in today's NFL, but back then I I think it was I was surprised to see it called. Oh yeah. But I mean with what we know about Albert Hainsworth now, I I'd say it's deserved, even though it wasn't at the time."
  },
  {
    "speaker" : "Steve",
    "text" : "Maybe they just encouraged him to be who he is today by calling a foul on him on a soft one early. Yeah what do we know about him now?",
    "timestamp" : "25:33-25:41"
  },
  {
    "timestamp" : "25:43-25:56",
    "text" : "Um well we know that he's six five, three hundred and seventeen pounds and can run a four eight two forty. That's pretty quick. Which is fucking banana considering Tom Brady ran a five two eight.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:56-25:59",
    "speaker" : "Greg",
    "text" : "Whoa, so he ran a 4-8."
  },
  {
    "timestamp" : "25:59-26:23",
    "text" : "4-8? At 317 apparently. So absolute fucking monster of a man. But uh in uh according to Wikipedia, an ins in an incident foreshadowing future incidents with Hainsworth occurred at a Titans training camp in 2003. Where Hainsworth kicked his former teammate, Centered Justin Hartwig, in the chest, then had to be restrained by other teammates.",
    "speaker" : "Andy"
  },
  {
    "text" : "So kicked him in the chest, huh?",
    "timestamp" : "26:24-26:26",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Scott",
    "text" : "Was that like a standing kick to the chest? Was he sitting down? Like because if it's a standing kick to the chest, that's impressive.",
    "timestamp" : "26:27-26:34"
  },
  {
    "timestamp" : "26:35-26:41",
    "speaker" : "Andy",
    "text" : "Yeah, I don't I don't know if I mean he can run fast, but I don't think Haynesworth is getting his foot up to somebody's chest."
  },
  {
    "text" : "Yeah, I don't know what's his knees or something.",
    "speaker" : "Steve",
    "timestamp" : "26:41-26:45"
  },
  {
    "text" : "I don't know. But uh Three years later in 2006 is the famous one where uh in the third quarter of a game against the Cowboys, running back Julius Jones scored a rushing play, and the center Andre Garode, I guess. Fell to the ground and his helmet was removed by Hainsworth. Hainsworth attempted to stomp on Garod's head but missed, so he tried it again. Second stomp opened a severe wound on Garod's head, forehead, narrow missing his right eye.",
    "speaker" : "Andy",
    "timestamp" : "26:45-27:13"
  },
  {
    "text" : "Um it's a clean play.",
    "timestamp" : "27:14-27:16",
    "speaker" : "Scott"
  },
  {
    "timestamp" : "27:16-27:32",
    "speaker" : "Andy",
    "text" : "That's better. Referee Jerome Boger assessed Hainsworth a 15-yard unsportsman-like conduct penalty, to which Hainsworth protested by taking off his helmet and throwing it into the turf. Hainsworth was then assessed an additional 15 yard penalty and was ejected from the game. Jesus."
  },
  {
    "timestamp" : "27:33-27:35",
    "speaker" : "Steve",
    "text" : "It's on the extra point, so who cares?"
  },
  {
    "timestamp" : "27:35-27:39",
    "speaker" : "Greg",
    "text" : "Yeah. And then he kicked the locker room attendant in the chest."
  },
  {
    "timestamp" : "27:43-27:49",
    "speaker" : "Steve",
    "text" : "He's a good guy though, I swear. What's worse? Jason Garrett or that? I mean that's gotta be worse. I don't know. Jason Garrett."
  },
  {
    "timestamp" : "27:49-27:50",
    "speaker" : "Scott",
    "text" : "Jason Garrett."
  },
  {
    "text" : "From the Browns.",
    "speaker" : "Steve",
    "timestamp" : "27:52-27:53"
  },
  {
    "speaker" : "Scott",
    "text" : "Miles Garrett? Oh Miles. Yeah.",
    "timestamp" : "27:53-27:55"
  },
  {
    "text" : "With the helmet smash.",
    "timestamp" : "27:55-27:57",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Probably this.",
    "timestamp" : "27:59-28:00"
  },
  {
    "text" : "I might uh I don't know. If he connects with the helmet though, that's gonna",
    "timestamp" : "28:00-28:03",
    "speaker" : "Steve"
  },
  {
    "text" : "He did. He bonked him on the top of the head. He bonked him. He did.",
    "speaker" : "Andy",
    "timestamp" : "28:04-28:09"
  },
  {
    "speaker" : "Scott",
    "text" : "It's an incredible word.",
    "timestamp" : "28:10-28:11"
  },
  {
    "speaker" : "Andy",
    "text" : "And the fact that you can call it a bonk. I think it goes to show that uh Hainsworth literally trying to curb stomp some dude in the middle of a football play. It's probably worse to me. Well I mean he fucking almost took the guy's eye out.",
    "timestamp" : "28:12-28:28"
  },
  {
    "timestamp" : "28:30-28:52",
    "speaker" : "Steve",
    "text" : "Do you want to be hit in the head by Mills Mil Garrett with a football helmet or stomped, curb stomped by Albert Hainsworth? Would you rather Which death is better? Uh I'll probably take the stompin. I might take the helmet to the head. I think it'll be a little bit more. I no, I feel like he really gets you in the head or the eyebrow can knock you out."
  },
  {
    "text" : "I don't think so.",
    "speaker" : "Andy",
    "timestamp" : "28:53-28:54"
  },
  {
    "timestamp" : "28:55-29:06",
    "speaker" : "Greg",
    "text" : "Uh in 2010, Sylvia Mina, a stripper from New York, claimed in a ten million dollar lawsuit that Hainsworth impregnated her and left her with no financial assistance."
  },
  {
    "speaker" : "Scott",
    "timestamp" : "29:07-29:09",
    "text" : "As I said, he's a good guy. We're not giving him enough reaction."
  },
  {
    "speaker" : "Steve",
    "text" : "Are we adding that to the poll, Greg? Or like",
    "timestamp" : "29:10-29:13"
  },
  {
    "speaker" : "Greg",
    "text" : "He beat somebody up in a traffic altercation. I guess he partially paralyzed somebody while driving in speeds excess of a hundred miles an hour in his Ferrari. That was in 20 2008.",
    "timestamp" : "29:15-29:31"
  },
  {
    "text" : "Holy shit. Do we know what this guy's doing now? Still playing, man.",
    "timestamp" : "29:32-29:35",
    "speaker" : "Scott"
  },
  {
    "timestamp" : "29:37-29:40",
    "speaker" : "Andy",
    "text" : "Well, in 2015, he pled guilty for reckless voting."
  },
  {
    "speaker" : "Greg",
    "text" : "In 2019, you revealed his kidneys are failing is seeking a donor for transplant.",
    "timestamp" : "29:41-29:47"
  },
  {
    "text" : "Oh you made it sad.",
    "timestamp" : "29:47-29:49",
    "speaker" : "Scott"
  },
  {
    "timestamp" : "29:49-29:53",
    "speaker" : "Greg",
    "text" : "Looks like the uh chickens have come home to roost."
  },
  {
    "text" : "If you will.",
    "speaker" : "Scott",
    "timestamp" : "29:55-29:56"
  },
  {
    "text" : "In response to Hainesworth's failure to pass a Redskins conditioning test in twenty ten. The edition uh the August edition of uh Satire News Organization The Onion ran the headline with an accompany accompanying photo, report Albert Hainsworth just a mound of ice cream and hot dogs.",
    "timestamp" : "30:03-30:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "He was a fat bitch.",
    "timestamp" : "30:20-30:21"
  },
  {
    "speaker" : "Andy",
    "text" : "He was. Wasn't he the one that had the play where he just like fell down and then just like gave up on the play and just lay there? Yeah, that was awesome.",
    "timestamp" : "30:21-30:30"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "30:31-30:37",
    "text" : "That was amazing. That was legitimately hilarious. That was a when Oh yeah. He was on the Redskins, right?"
  },
  {
    "text" : "Yeah, I think it was a Redskins. Of course it was a Redskins. Who else would it be?",
    "speaker" : "Andy",
    "timestamp" : "30:37-30:40"
  },
  {
    "timestamp" : "30:40-30:44",
    "text" : "How many like good years did he have though? That's the question.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "He was pretty good. He got quite a while, I feel like.",
    "timestamp" : "30:44-30:47"
  },
  {
    "text" : "Yeah, he got one wicked huge contract, right?",
    "timestamp" : "30:48-30:50",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Him and we're like the same kind of player right around the same time.",
    "speaker" : "Steve",
    "timestamp" : "30:51-30:54"
  },
  {
    "text" : "Oh seven and oh eight. He was first T Mall Pro",
    "speaker" : "Greg",
    "timestamp" : "30:55-30:58"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because I think the O seven, that was his last no how long did he play with the uh the Redskins, with the uh Titans? Oh two to O eight. So it's those last two years and that's what got him paid. And then as soon as he got paid he's like nah fuck it.",
    "timestamp" : "31:00-31:13"
  },
  {
    "speaker" : "Greg",
    "text" : "Was he on the biggest? Yeah, two thousand eleven. Yeah. He didn't even make it out did he make it out of uh training camp?",
    "timestamp" : "31:13-31:20"
  },
  {
    "timestamp" : "31:20-31:22",
    "speaker" : "Steve",
    "text" : "No, I don't think he made it out of camp."
  },
  {
    "text" : "He lasted less than four months with the Patriots. And on November 8th, 2011, Haynesworth was placed on waivers. So yeah, technically.",
    "timestamp" : "31:22-31:29",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:29-31:30",
    "text" : "Oh yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "His placement on waivers came days after he got into a confrontation with assistant Pepper Johnson on the sidelines. Ooh. That's a bad decision.",
    "speaker" : "Andy",
    "timestamp" : "31:30-31:37"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:37-31:39",
    "text" : "Yeah, come on. What are you doing?"
  },
  {
    "text" : "Bad decision.",
    "speaker" : "Andy",
    "timestamp" : "31:39-31:40"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "31:42-31:42"
  },
  {
    "text" : "Alright, so so they've they've got guys on both end of the spectrum. We've got uh Steve McNair, we've got Albert Haynesworth.",
    "timestamp" : "31:42-31:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "31:48-31:59",
    "text" : "And we got Eddie George. Eddie George, yep. Eddie George, I'm gonna say something right now. Uh-oh. And uh we're in the circle of trust here. He is an incredibly good-looking man"
  },
  {
    "text" : "He is very good looking.",
    "timestamp" : "32:00-32:01",
    "speaker" : "Scott"
  },
  {
    "timestamp" : "32:02-32:04",
    "text" : "I think he looks a bit like an alien.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:04-32:12",
    "text" : "Andy, I think your insecurities are really coming to the surface right now because if you don't think and the picture I'm staring at of you right now."
  },
  {
    "timestamp" : "32:13-32:22",
    "text" : "Oh, I'm sorry. Wasn't I the one that brought up uh the hotness of the Patriots quarterbacks last week? That's true. I mean some Patriots look better.",
    "speaker" : "Andy"
  },
  {
    "text" : "Maybe you're just racist.",
    "speaker" : "Greg",
    "timestamp" : "32:22-32:24"
  },
  {
    "speaker" : "Andy",
    "text" : "No, it's just the head shape, man. Some of these pictures. Alright, no, I'm gonna show you the picture I'm looking at. Oh, yeah. So let me let me put it up so y'all can see this.",
    "timestamp" : "32:24-32:40"
  },
  {
    "speaker" : "Scott",
    "text" : "I feel like it's like a hot bald head though. Yeah, good ball. Yeah",
    "timestamp" : "32:41-32:45"
  },
  {
    "speaker" : "Andy",
    "text" : "But like th this is the picture I'm looking at.",
    "timestamp" : "32:45-32:47"
  },
  {
    "timestamp" : "32:47-32:52",
    "speaker" : "Greg",
    "text" : "I still think he looks good there. He's very symmetrical. He's a strong alien."
  },
  {
    "speaker" : "Scott",
    "text" : "Very strong gylla.",
    "timestamp" : "32:53-32:54"
  },
  {
    "speaker" : "Andy",
    "text" : "But then if if you Google him, like some of these are much better. Like this. Like yeah.",
    "timestamp" : "32:54-32:58"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm gonna eat Kelly's and what is what's Kelly gotta say?",
    "timestamp" : "32:58-33:03"
  },
  {
    "timestamp" : "33:03-33:09",
    "text" : "He look yeah, he looks a lot better. Not in a uniform, I think. I might be the uniform with the shoulders.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Scott",
    "timestamp" : "33:09-33:14",
    "text" : "He's just a good looking dude. Yeah, I don't know where you're going with this Andy. He looks like he could be like on a talk show"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:15-33:19",
    "text" : "Is he? I remember dad discussing me."
  },
  {
    "speaker" : "Greg",
    "text" : "What's a fact check?",
    "timestamp" : "33:20-33:21"
  },
  {
    "timestamp" : "33:22-33:25",
    "speaker" : "Andy",
    "text" : "Uh does he have a uh talk show of his own?"
  },
  {
    "text" : "Eddie George? Yeah.",
    "timestamp" : "33:25-33:27",
    "speaker" : "Greg"
  },
  {
    "text" : "Because he looks like he should",
    "timestamp" : "33:27-33:29",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:29-33:58",
    "text" : "He does. He does look like a talk show host. Doesn't appear so. Damn it. Oh wait. Oh god, it's sweet. He does. You want to know what it's called? Fucking called it, obviously. It's called Radio, by George. What is your opinion on if this is a good looking man or not? We're getting we're getting some uh female opinion here.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:00-34:01",
    "text" : "Ty Kelly."
  },
  {
    "text" : "Ty Kelly. Hey.",
    "speaker" : "Steve",
    "timestamp" : "34:01-34:03"
  },
  {
    "speaker" : "Scott",
    "timestamp" : "34:04-34:11",
    "text" : "All right, Kelly. This guy. How many Lombardies does he get? Out of six."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:14-34:30",
    "text" : "Yes and no? See, that's all I'm saying. Some of them are like some of the pictures are not great. Look at his smile. Smile's good. But if he's not smiling, he's got that like stare on. Oh yeah."
  },
  {
    "text" : "Well, I think it's all in somebody's personal opinion. I'm not a big bald headed kind of fan.",
    "timestamp" : "34:34-34:39",
    "speaker" : "Speaker 6"
  },
  {
    "timestamp" : "34:40-34:41",
    "speaker" : "Greg",
    "text" : "That's right."
  },
  {
    "speaker" : "Andy",
    "text" : "Careful Greg. Better hope that hair holds up.",
    "timestamp" : "34:43-34:46"
  },
  {
    "text" : "I mean Greg's gonna shave his head on purpose.",
    "speaker" : "Greg",
    "timestamp" : "34:46-34:51"
  },
  {
    "speaker" : "Speaker 6",
    "text" : "I mean I give him a nine.",
    "timestamp" : "34:51-34:52"
  },
  {
    "text" : "That's pretty fucking good.",
    "timestamp" : "34:53-34:54",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Speaker 6",
    "text" : "You should sound like a nice guy. I feel like it's a yes or no sort of thing and sick pa not anymore. Takes care of himself.",
    "timestamp" : "34:57-35:03"
  },
  {
    "timestamp" : "35:03-35:07",
    "text" : "You shouldn't fuck. You",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:09-35:11",
    "text" : "He's got a talk show."
  },
  {
    "speaker" : "Greg",
    "text" : "All right, thank you, Kelly.",
    "timestamp" : "35:11-35:12"
  },
  {
    "speaker" : "Andy",
    "text" : "I think we need to see Greg's uh search history. Eddie George naked, Eddie George porn, Eddie George penis.",
    "timestamp" : "35:12-35:23"
  },
  {
    "text" : "Probably gonna pull up a shitload of results, honestly. Yeah.",
    "timestamp" : "35:25-35:27",
    "speaker" : "Steve"
  },
  {
    "text" : "It has to be better than uh Brett Faves.",
    "timestamp" : "35:28-35:31",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Scott",
    "text" : "How many how many Lombardies would you give to Eddie George's penis? Like how many lengthwise, you know, how many Lombardies?",
    "timestamp" : "35:31-35:39"
  },
  {
    "speaker" : "Greg",
    "text" : "Kelly be gone.",
    "timestamp" : "35:44-35:48"
  },
  {
    "speaker" : "Andy",
    "text" : "Speaking of sexual innuendos though Al Michaels, I I feel like back in the day the the primetime commentators were always trying to walk that line. I think it was because uh who was the guy that they had in the booth who was supposed to be like a comedian and he didn't work out well. He was like the third guy and he was always supposed to be like towing a lot.",
    "timestamp" : "35:53-36:13"
  },
  {
    "speaker" : "Steve",
    "text" : "Dennis like O'Lear somewhere. Oh yeah.",
    "timestamp" : "36:13-36:15"
  },
  {
    "timestamp" : "36:15-36:17",
    "speaker" : "Andy",
    "text" : "Dennis something or other, yeah. Dennis"
  },
  {
    "speaker" : "Scott",
    "text" : "Fuck me.",
    "timestamp" : "36:18-36:19"
  },
  {
    "timestamp" : "36:19-36:20",
    "speaker" : "Andy",
    "text" : "So bad."
  },
  {
    "speaker" : "Scott",
    "text" : "Dennis O'Leary sounds like it could be a person.",
    "timestamp" : "36:20-36:22"
  },
  {
    "text" : "Dennis Miller. Dennis Miller, yes. So I feel like this was like the time when the guys were trying to be edgy. And Al Michaels like introducing the game comes in and says uh as the fifteen fifteenth week of the NFL season climaxes. And then he starts like introducing the game. Like how why would you how the the week climaxes?",
    "timestamp" : "36:23-36:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:47-36:49",
    "text" : "Especially the the week fifteen.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, is that even Monday night?",
    "timestamp" : "36:50-36:51"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "36:52-36:53",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Does a weekday climax?",
    "timestamp" : "36:54-36:56"
  },
  {
    "text" : "I don't know if I'll put Sunday night scaries as my climax either, you know?",
    "timestamp" : "36:57-37:00",
    "speaker" : "Steve"
  },
  {
    "text" : "It crescendo's. That's probably the low crescendo's a go, but climax. Like I feel like he's trying to shoehorn that in. That's a bad fit as me doing football, not football. That's Al Michaels trying to do football, not football. But he's not a good thing. He said a few questionable things though.",
    "timestamp" : "37:00-37:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Scott",
    "timestamp" : "37:19-37:32",
    "text" : "At one point, like they go to the PTI crew. And he comes back and says, I feel your angst, like a 6. 9 earthquake. Like, is that a 69 reference? What is he trying to say there?"
  },
  {
    "timestamp" : "37:32-37:34",
    "speaker" : "Andy",
    "text" : "I missed that, yeah."
  },
  {
    "speaker" : "Scott",
    "text" : "I feel like he's just trying to be edgy and he's just really bad at it.",
    "timestamp" : "37:35-37:38"
  },
  {
    "speaker" : "Andy",
    "text" : "He's just not good at it. He's like me.",
    "timestamp" : "37:39-37:40"
  },
  {
    "timestamp" : "37:41-37:44",
    "speaker" : "Steve",
    "text" : "Also, I did not know PTI was that old. 2002?"
  },
  {
    "timestamp" : "37:45-37:52",
    "speaker" : "Andy",
    "text" : "Yeah, and that was the halftime show apparently, which fuck that. I'm glad that didn't make it into the uh the recording that we watched."
  },
  {
    "text" : "Another Al Michaels thing after they showed PTI, he said, those guys are a very unusual combination. as in a black guy and a Jewish guy. Like also questionable thing to say. That's pretty questionable.",
    "timestamp" : "37:52-38:05",
    "speaker" : "Scott"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:09-38:24",
    "text" : "Yeah, they were definitely trying to make this like because it turned into a blowout in the second half, and they were trying the best to make it like still watchable and like an event. Uh so they had Hank Williams Jr. in the booth too. I think it was in probably the fourth quarter."
  },
  {
    "text" : "Oh, he sucked.",
    "timestamp" : "38:25-38:25",
    "speaker" : "Scott"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and they're like, oh well, you know, because you're you're part of you're the guy that does the uh are you ready for some football? So are you? Like bro, it's the fourth quarter. He's been ready for some football. From Nashville. But he was garbage.",
    "timestamp" : "38:26-38:39"
  },
  {
    "text" : "He was so bad.",
    "timestamp" : "38:39-38:40",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "38:41-38:58",
    "speaker" : "Andy",
    "text" : "He had literally nothing important to say. Yeah, so he brought Madden the cowboy hat, which Madden tried to put it on, but then he didn't have his headphone, so he couldn't actually commentate. And then he gave Al Michaels red suspenders. And you can tell Michael's is like not having like I thought it was a seatbelt. What the fuck?"
  },
  {
    "speaker" : "Steve",
    "text" : "I have a confession to make I've watched all games so far except this one. At that point when he gave pulled out the cowboy hat, I skipped forward like 10 minutes.",
    "timestamp" : "38:59-39:08"
  },
  {
    "timestamp" : "39:08-39:12",
    "speaker" : "Greg",
    "text" : "I was like, You've watched every minute of every game, Steve?"
  },
  {
    "timestamp" : "39:12-39:16",
    "speaker" : "Steve",
    "text" : "The podcast I've been on, yeah. I didn't watch comment I didn't wasn't on early."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it's pretty good. It's not bad. Yeah, I I did the same. Once we got to the fourth quarter, I just had it on the background. I was like doing other stuff.",
    "timestamp" : "39:16-39:23"
  },
  {
    "text" : "So I'm literally on the worst game that you guys have seen so far.",
    "speaker" : "Scott",
    "timestamp" : "39:24-39:27"
  },
  {
    "text" : "It's up there. We've had some uh games in Miami when Brady first started that were See I missed those games.",
    "speaker" : "Andy",
    "timestamp" : "39:28-39:34"
  },
  {
    "timestamp" : "39:34-39:36",
    "text" : "I didn't watch that Miami game",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:36-39:46",
    "text" : "So this one's I think the first Miami game was probably right now the only game I give a zero to. Zero Lombardi's in terms of watchability score."
  },
  {
    "text" : "What did you give this one?",
    "timestamp" : "39:47-39:48",
    "speaker" : "Scott"
  },
  {
    "timestamp" : "39:49-39:50",
    "speaker" : "Andy",
    "text" : "I'll give this one a half."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "39:51-39:54",
    "text" : "I'll give it a one. But you just talked about how good the commentators were, Andy."
  },
  {
    "timestamp" : "39:54-39:59",
    "text" : "There's a bunch of great names in it, which maybe it's not a redeeming factor, Greg.",
    "speaker" : "Andy"
  },
  {
    "text" : "When you talk about great names, are you saying like f",
    "timestamp" : "39:59-40:01",
    "speaker" : "Scott"
  },
  {
    "timestamp" : "40:01-40:12",
    "speaker" : "Steve",
    "text" : "Funny names or like players that like you hadn't thought of like Steve McNair dude you know he was like drunk is on it, yep. Yep, Samari Roll."
  },
  {
    "text" : "Yeah",
    "timestamp" : "40:13-40:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:14-40:18",
    "text" : "Keith Bullock, he was fucking sick in this game. Frank Wycheck. Yep."
  },
  {
    "speaker" : "Andy",
    "text" : "Who is the other uh corner? Dyson? Dyson, yes.",
    "timestamp" : "40:19-40:22"
  },
  {
    "text" : "There's there's a cornerback Dyson and the receiver Dyson. Remember Kevin Dyson? He was like their best friend. Dyson brothers. Right, right, right. Is Kevin Dyson in this game? He didn't do anything. Yeah he was in it. Uh one of them was injured. There's another one they had that was super good. Derrick Mason.",
    "timestamp" : "40:23-40:38",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "40:38-40:40",
    "speaker" : "Scott",
    "text" : "Derek Mason was awesome in this game."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "40:40-40:40"
  },
  {
    "speaker" : "Scott",
    "timestamp" : "40:40-40:41",
    "text" : "He was like their best player."
  },
  {
    "text" : "Mason was injured and Mason was in. But yeah, they had two fucking sick receivers.",
    "timestamp" : "40:41-40:45",
    "speaker" : "Steve"
  },
  {
    "text" : "I honestly thought Holcomb might have been their best player in this game, which is weird because I don't even know who that is. Neither do I.",
    "timestamp" : "40:45-40:50",
    "speaker" : "Scott"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he was like some they just picked him up, I think. Was it from the Rams or something? Yeah.",
    "timestamp" : "40:50-40:55"
  },
  {
    "text" : "He was incredible. We couldn't stop him. Every time he got the ball, he ran for like twenty yards. Yeah.",
    "timestamp" : "40:58-41:04",
    "speaker" : "Scott"
  },
  {
    "timestamp" : "41:04-41:07",
    "text" : "He had eight point nine average. And Greg said like eighty-one.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "41:08-41:11",
    "text" : "And Eddie George had like a three point oh average.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "41:12-41:15",
    "speaker" : "Greg",
    "text" : "Yeah. So it's a pretty good team."
  },
  {
    "timestamp" : "41:15-41:16",
    "speaker" : "Steve",
    "text" : "Yeah. Talent one."
  },
  {
    "text" : "Shame shame they had Jeff Fisher, huh?",
    "timestamp" : "41:17-41:18",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "41:19-41:22",
    "speaker" : "Steve",
    "text" : "Yes. Allies, they were stacked."
  },
  {
    "timestamp" : "41:22-41:35",
    "text" : "So I was shocked. They showed Jeff Fisher's record at one point. I didn't write it down, but it was above 500 by like 20 games. I thought he was 500 like his whole career, but apparently actually was decent at one point.",
    "speaker" : "Scott"
  },
  {
    "text" : "Like all the leeway in the world. Yeah. I wrote this down.",
    "timestamp" : "41:42-41:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I looked into this. And I wrote it down because it was funny. So I look back to when he started. So he you're right. He he is since like ninety-nine. He'd been good. Yeah, that couple thirteen, three years. Yeah. So but he took over his first full season was in ninety-five. They went seven and nine. Ninety-six they went eight and eight. Ninety-seven they went eight and eight. Ninety-eight they went eight and eight. And I was like clicking through on Pro football reference and I was like, is this loading correctly? It was. It was just the same fucking record every year.",
    "timestamp" : "41:49-42:23"
  },
  {
    "text" : "Holy shit, you're right. Yeah. Yeah. And then he had a few good years in a row. Because he finished He he was at uh well Tennessee or slash Houston for 17 years and was uh 142 and 120 overall. But then he went to the Rams and was never over five hundred in any of the seasons with them.",
    "timestamp" : "42:24-42:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Scott",
    "text" : "Was he seven and nine every year?",
    "timestamp" : "42:48-42:50"
  },
  {
    "timestamp" : "42:51-42:57",
    "speaker" : "Andy",
    "text" : "Let's see. With the Rams he was seven, eight and one, seven and nine, six and ten, seven and nine, and then four and nine before he got fired."
  },
  {
    "timestamp" : "42:58-43:05",
    "text" : "It's like hitting the minimum to not get fired is what he did forever. Yeah. It's incredible.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:05-43:20",
    "text" : "Yeah, because if you win like Go ahead, see if did he have a record he was trying to set with like a number of losses or something like that? Oh he was like one away from it and he retired he got fired right before he would have broken the record for most losses as a head coach or something like that."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:20-43:21",
    "text" : "Yeah, it was something like that, wasn't it?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:22-43:28",
    "text" : "Just embodied his meat his I if I was him, I'd be like, let me get another coaching gig. I just want to go I just need a little one more game."
  },
  {
    "timestamp" : "43:29-43:34",
    "speaker" : "Andy",
    "text" : "Just again. Yeah, like uh like just just sign up to be like the Redskins interim by at the end of the season."
  },
  {
    "speaker" : "Steve",
    "text" : "Right? When someone gets fired, which happens all the time every year, just bring me in to the last game of season.",
    "timestamp" : "43:34-43:39"
  },
  {
    "timestamp" : "43:39-43:40",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:41-43:48",
    "text" : "Wasn't it he uh like he got fired right after he played the Pats, right? When he was about to set that record.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "43:49-44:15",
    "speaker" : "Andy",
    "text" : "Was it? I remember we dominated him because that was the game that uh Blunt had that fourth and one carry that he ran for a touchdown. It was like the beginning of Jared Goff's career too or something like that Something like that. Let's see. Patriots against Jeff Fisher. When was the last game we played against him? Patriots Dynasty. info slash search slash games. 2016 was their last game against him. Pages beat him twenty six to ten."
  },
  {
    "text" : "I think he does have the most losses ever. Really?",
    "timestamp" : "44:15-44:19",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, that was the Blount fourth and one.",
    "timestamp" : "44:20-44:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "44:23-44:28",
    "speaker" : "Steve",
    "text" : "I feel like that's like a a really achievement though. It's like Brexit on the most interceptions. Yeah."
  },
  {
    "timestamp" : "44:28-44:29",
    "speaker" : "Andy",
    "text" : "You have to be able to do it."
  },
  {
    "text" : "You gotta be around to get there. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "44:29-44:30"
  },
  {
    "timestamp" : "44:31-44:32",
    "speaker" : "Steve",
    "text" : "Good enough to still be there, yeah."
  },
  {
    "timestamp" : "44:33-44:41",
    "speaker" : "Greg",
    "text" : "That's true. Tom Coughlin's on there, number five. That's on Chashuula, Tom Landry."
  },
  {
    "timestamp" : "44:43-44:47",
    "text" : "Tom Coughlin could have a couple years left in him. He could he could catch Jeff Fisher.",
    "speaker" : "Scott"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:47-44:58",
    "text" : "How long did Don Shula coach for if he has both the most wins and the most losses in NFL history. It's a good question. Belichick's chasing him and he's still like 40 wins away."
  },
  {
    "timestamp" : "44:58-45:15",
    "text" : "Yeah, it's like this is from a pro football coach's records coaching total. Here we go. This is what we need. Don Shula. Don Shula, 490 and 328. Jeez. Wow. Oh, wait, wait, wait. No, 328 and 156. How many seasons is that? 33 years.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "33 years as a head coach.",
    "timestamp" : "45:17-45:19"
  },
  {
    "text" : "Oh, dude. You're right, Steve. He is exactly tied for the most losses ever with Dan Reeves. Dan Reeves. 165 losses.",
    "timestamp" : "45:19-45:31",
    "speaker" : "Greg"
  },
  {
    "text" : "What's Jeff Fisher's overall record? Reeves must have more wins, right?",
    "speaker" : "Steve",
    "timestamp" : "45:32-45:35"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "45:35-45:41",
    "text" : "Yeah, Reeves is 190 in 165. Fisher's 173 in 165."
  },
  {
    "speaker" : "Scott",
    "text" : "That is so perfect. Wow. I mean that's fascinating. I could see Jeff Fisher coming back.",
    "timestamp" : "45:41-45:50"
  },
  {
    "speaker" : "Steve",
    "text" : "That's what I'm saying. Just give me one more box. Bring him back. Bring him back for week 17. No one cares, you know? And the other teams sit in their starters anyways.",
    "timestamp" : "45:51-45:58"
  },
  {
    "text" : "I could see a dumb organization just bringing him in like as a fresh start. Like, oh yeah, we need a fresh start. Let's bring in Jeff Fisher. You know he'll be able to get us to 500.",
    "timestamp" : "45:58-46:07",
    "speaker" : "Scott"
  },
  {
    "speaker" : "Steve",
    "text" : "He probably could. I think anyone is seven and nine. The Jets are like, ooh, seven and nine looks pretty good right now.",
    "timestamp" : "46:09-46:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:19-46:29",
    "text" : "Oh man. My favorite thing so far has been to go to the Jets subreddit this season. They are melting down. They're not even melting down already. They're just numb to it, I think."
  },
  {
    "timestamp" : "46:29-46:30",
    "speaker" : "Steve",
    "text" : "That's the thing."
  },
  {
    "timestamp" : "46:32-46:33",
    "text" : "Their head coach.",
    "speaker" : "Andy"
  },
  {
    "text" : "I like reading about that shit more than I like reading about the Patriots or any other Boston sports is Jets tiers is like my number one.",
    "speaker" : "Steve",
    "timestamp" : "46:34-46:40"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:41-46:43",
    "text" : "Yeah, I figured I figured you'd be the same."
  },
  {
    "text" : "Oh, I love it.",
    "timestamp" : "46:43-46:44",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "46:44-46:45",
    "speaker" : "Andy",
    "text" : "Fucking hate him."
  },
  {
    "timestamp" : "46:45-46:46",
    "speaker" : "Steve",
    "text" : "Every little bit of it."
  },
  {
    "text" : "All right, should we do some best and worst for this then?",
    "speaker" : "Andy",
    "timestamp" : "46:47-46:50"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "46:50-46:52",
    "text" : "Yeah, let's uh let's get there."
  },
  {
    "timestamp" : "46:52-46:54",
    "text" : "All right, Steve, you guys go first there.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "No, I'm gonna pass on going first. You go first.",
    "timestamp" : "46:55-46:57"
  },
  {
    "text" : "All right, Greg, you wanna go first?",
    "timestamp" : "46:58-46:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "No, I'm gonna pass as well. You want me to go first?",
    "timestamp" : "47:00-47:03"
  },
  {
    "text" : "Yes, I'll yeah, you go first. Alright, I try to take some notes. Let's see. Alright, best Belichick's jacket that he was wearing was incredible. It was like a starter jacket, bright red. Yeah. I just I want that thing.",
    "timestamp" : "47:04-47:18",
    "speaker" : "Scott"
  },
  {
    "timestamp" : "47:18-47:21",
    "text" : "It was the one with the elastic on the wristband, right? And like the neck.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:21-47:29",
    "text" : "Yeah and the elastic on the uh I have one like that, but it's blue and it actually has uh a number eleven and blood cell on the back of it."
  },
  {
    "text" : "What? You have one?",
    "timestamp" : "47:29-47:30",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:31-47:31",
    "text" : "Fucking legit, yeah."
  },
  {
    "text" : "Greg, I still have your original starter jacket.",
    "timestamp" : "47:32-47:34",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "47:35-47:39",
    "speaker" : "Greg",
    "text" : "The Patriots one? Yeah, I'm surprised it still fits you."
  },
  {
    "timestamp" : "47:39-47:44",
    "speaker" : "Scott",
    "text" : "I just felt like the red Pat starter jacket, like you'd never see that. I've never seen that."
  },
  {
    "speaker" : "Andy",
    "text" : "The old school like Pat s like scroll text logo on it. Yeah, curly pea.",
    "timestamp" : "47:44-47:51"
  },
  {
    "speaker" : "Scott",
    "text" : "I want to find that in Belichick's closet. You can find it on eBay.",
    "timestamp" : "47:51-47:54"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, we should have to look.",
    "timestamp" : "47:55-47:56"
  },
  {
    "speaker" : "Scott",
    "text" : "I'll go on eBay.",
    "timestamp" : "47:57-47:58"
  },
  {
    "speaker" : "Andy",
    "text" : "Patriots red starter jacket.",
    "timestamp" : "47:59-48:01"
  },
  {
    "timestamp" : "48:02-48:10",
    "speaker" : "Steve",
    "text" : "It's like a poofy windbreaker though. It's not like the zip-down moment with the hood. It's like no neck. Yeah, elastics at the wrist and at the waist."
  },
  {
    "timestamp" : "48:11-48:13",
    "speaker" : "Andy",
    "text" : "Oh my god, yeah. And is that kind of like shiny material too?"
  },
  {
    "text" : "Yeah, yeah.",
    "timestamp" : "48:13-48:14",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "48:14-48:15",
    "speaker" : "Andy",
    "text" : "That thing was gone awful."
  },
  {
    "text" : "Absolute fire. You have a worse Scott?",
    "speaker" : "Steve",
    "timestamp" : "48:15-48:18"
  },
  {
    "speaker" : "Scott",
    "text" : "Well, can I give another best? I tried to focus on the positives because the game was so bad. I didn't want to just like say. Alright, so I this was my first like old Pats game I had watched in a while. So my best was actually Tom Brady's like butt chin. No one ever talked like it just vanished one day, but like He used to have a nice butt chin. I don't know what happened to it.",
    "timestamp" : "48:18-48:40"
  },
  {
    "text" : "We were legit talking about that last week, weren't we? Like water yeah, it just it's just gone. Like he must have had some work done. And I think I think what we decided was that if you were married to Giselle, you would also have work done. Isn't that where we landed?",
    "timestamp" : "48:41-48:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh yeah, whatever she's gonna, whatever we gotta do. We're good.",
    "timestamp" : "48:55-48:58"
  },
  {
    "speaker" : "Scott",
    "text" : "Maybe it's like All the water he drinks just like went straight to his chin. Simple.",
    "timestamp" : "48:58-49:05"
  },
  {
    "text" : "Yeah, it's definitely gonna you're right.",
    "speaker" : "Andy",
    "timestamp" : "49:07-49:09"
  },
  {
    "timestamp" : "49:09-49:24",
    "text" : "I know, like that blew my mind, because all the old pictures of him, they show him with that little dimple butt chin, and all of a sudden it's just not there anymore. So then is that a best or a world age? I I said best. I like the little butt chin. I kind of miss it.",
    "speaker" : "Scott"
  },
  {
    "text" : "Oh. It was your worst that it disappeared.",
    "speaker" : "Andy",
    "timestamp" : "49:25-49:27"
  },
  {
    "speaker" : "Scott",
    "text" : "Sh yeah, sure. Um my worst was gonna be the field because it was so bad, but we already talked about the Oh it was awful though It was really, really bad.",
    "timestamp" : "49:27-49:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:40-49:55",
    "text" : "It was it was literally and I mean this literally painted dirt. Like they they were out there with spray paint guns like painting the the field green and the sidelines white Is that what that was?"
  },
  {
    "timestamp" : "49:55-49:59",
    "speaker" : "Scott",
    "text" : "Yeah. How dare you give a jets reference on this podcast?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:59-50:04",
    "text" : "Yeah, right, you son of a bitch. And you're wearing green? Who the fuck are you, Steve?"
  },
  {
    "text" : "It's a Celtics.",
    "timestamp" : "50:04-50:05",
    "speaker" : "Steve"
  },
  {
    "text" : "Doesn't matter. Still green.",
    "timestamp" : "50:06-50:08",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "50:08-50:30",
    "text" : "The only way to get rid of a butt chin is with an implant. All right, there it is. Step step check. So we got work done. Dude, he probably got a chin implant. If that's implanted, what else is implanted? Yeah. He's fucking deflating balls, implanting shins, dude. We can't trust anything this man says."
  },
  {
    "text" : "He's still beautiful.",
    "timestamp" : "50:36-50:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "50:38-50:39",
    "text" : "Alright, I have two bests as well now."
  },
  {
    "text" : "Whoa, two bests.",
    "timestamp" : "50:40-50:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "One was the ref cam in 2000. Damn it that was my best. I didn't know that was a thing in 2002. We yeah, we've talked about it earlier. It's not a thing now. I see it in college football. I never really see it in the pros.",
    "timestamp" : "50:42-50:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it's such a great view.",
    "timestamp" : "50:56-50:58"
  },
  {
    "speaker" : "Scott",
    "text" : "It was sick when it he got hit in the head with the ball. Were you gonna talk about the ball?",
    "timestamp" : "50:58-51:02"
  },
  {
    "speaker" : "Andy",
    "text" : "That's what I was gonna say. Yeah. That was giving you my best was the web the uh the ref cam. Tom Brady drilled a uh referee in the face, like the whoever the guy stands in the middle. Like drilled him square in the face, and he's the one that was wearing the camera. And the video of it is amazing. I'll put it on on the the website and I'll put it on the website.",
    "timestamp" : "51:02-51:19"
  },
  {
    "text" : "I'm not gonna lie, I missed that when I skipped through.",
    "speaker" : "Steve",
    "timestamp" : "51:19-51:20"
  },
  {
    "speaker" : "Speaker 6",
    "text" : "Oh yeah, you missed it.",
    "timestamp" : "51:21-51:22"
  },
  {
    "speaker" : "Steve",
    "text" : "It was awesome.",
    "timestamp" : "51:22-51:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:23-51:26",
    "text" : "Oh he got let me see if I can pull it up real quick for you boys."
  },
  {
    "speaker" : "Scott",
    "text" : "The ref like tried to act cool afterwards too because he got had just been drilled in the face, but you could tell he was pretty shook. He was pretty shook.",
    "timestamp" : "51:27-51:34"
  },
  {
    "timestamp" : "51:34-51:37",
    "speaker" : "Steve",
    "text" : "I would be shook too. Tom Brady just"
  },
  {
    "speaker" : "Andy",
    "text" : "And it it was a it was a cannon too. Like it wasn't just like a quick throw. Yeah. He was trying to gun it into the tight end coming across the middle.",
    "timestamp" : "51:37-51:45"
  },
  {
    "timestamp" : "51:46-51:53",
    "speaker" : "Greg",
    "text" : "I can't wait for the uh the quarterback cam that we'll get eventually, like the VR. Oh yeah. So we get it."
  },
  {
    "speaker" : "Scott",
    "text" : "Why isn't that a thing now?",
    "timestamp" : "51:53-51:54"
  },
  {
    "text" : "Yeah. I want to watch Jameis Winston like stare down a receiver and throw a pick. From his So here you go, here's the cam.",
    "speaker" : "Greg",
    "timestamp" : "51:54-52:02"
  },
  {
    "text" : "Oh right McKisser. That's awesome. Right? What a great and here's the actual What an idiot.",
    "speaker" : "Andy",
    "timestamp" : "52:02-52:12"
  },
  {
    "timestamp" : "52:12-52:16",
    "text" : "What an idiot. I mean he didn't go down to his he's on his feet still.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but like an absolute cannon shot.",
    "timestamp" : "52:16-52:19"
  },
  {
    "timestamp" : "52:19-52:20",
    "text" : "Yeah. Right square.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "52:21-52:37",
    "speaker" : "Andy",
    "text" : "Right like square. Amazing. Also, like if you're a referee fucking duck, what are you doing, dude? Get out of the what are you watching? What are you watching? Almost an interception too. God damn it. Amazing though."
  },
  {
    "text" : "I guess that could be a worst Andy, you know? Rough getting in the way of Tom Brady.",
    "speaker" : "Steve",
    "timestamp" : "52:37-52:40"
  },
  {
    "text" : "He would have been like No, it's worth it for the content. Still the best.",
    "timestamp" : "52:40-52:44",
    "speaker" : "Andy"
  },
  {
    "text" : "40. We were already done at that point. It was just like Brady probably did that on purpose. He's like, check out the sick view I can get.",
    "timestamp" : "52:45-52:53",
    "speaker" : "Scott"
  },
  {
    "speaker" : "Steve",
    "text" : "My other best is uh I was so bored this game they had a uh promo for the Nets Celtics Christmas Day game, so I looked it up.",
    "timestamp" : "52:54-53:03"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, they did.",
    "timestamp" : "53:03-53:04"
  },
  {
    "timestamp" : "53:05-53:13",
    "speaker" : "Steve",
    "text" : "Scalabrini played for the Nets then. He scored two points in the game and they blew us out like crazy. They smoked us? Yo, crazy. Damn it."
  },
  {
    "speaker" : "Andy",
    "text" : "Paul Pierce is not a good weekend for uh three shots.",
    "timestamp" : "53:13-53:17"
  },
  {
    "speaker" : "Steve",
    "text" : "He was like twelve for forty. Yeah. Eighty-one, one seventeen.",
    "timestamp" : "53:17-53:21"
  },
  {
    "timestamp" : "53:24-53:38",
    "speaker" : "Greg",
    "text" : "I'm getting fucking I'm getting fucking ads for fucking cleft chin bullshit. Clutter. I'm getting that for some reason like preparation H. Oh, never mind. That's different."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh good.",
    "timestamp" : "53:45-53:46"
  },
  {
    "text" : "For real though, why preparation H? I didn't that was a joke, but I am getting Preparation H ads. It's like they know me better than I know myself. Just Google the Eddie George bunch.",
    "timestamp" : "53:47-53:58",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Scott",
    "timestamp" : "53:58-53:59",
    "text" : "Maybe he has something."
  },
  {
    "speaker" : "Andy",
    "text" : "Maybe it's the Haynesworth.",
    "timestamp" : "54:03-54:04"
  },
  {
    "text" : "Even busters? Right. But you got best and worse.",
    "timestamp" : "54:08-54:13",
    "speaker" : "Scott"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "54:13-54:28",
    "text" : "Alright, best and worse. Yeah, go ahead, G. Yeah, I'll go. I got my My worst, I've I've been holding this take for a little bit because I didn't want to admit to it, but I think Antoine Smith kind of sucks."
  },
  {
    "speaker" : "Andy",
    "text" : "He's not as good as I remember.",
    "timestamp" : "54:29-54:30"
  },
  {
    "text" : "Yes. I remember thinking he was like a a power back. Maybe I'm think like thinking Corey Dillon. That era? No. I don't know. But Anton Smith just not doomed for him. He had six carries for 31 yards with one rush of 23.",
    "timestamp" : "54:31-54:46",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:46-54:47",
    "text" : "Yeah."
  },
  {
    "text" : "So he had five carries for what, eight yards? Woof, dude. Woof.",
    "timestamp" : "54:47-54:53",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "54:53-54:55",
    "speaker" : "Andy",
    "text" : "Yeah, he the run game of this game."
  },
  {
    "timestamp" : "54:55-55:05",
    "speaker" : "Steve",
    "text" : "He was good like when we first started watching he we've seen his decline. We've seen the back half of it. Yeah, I think we first got on this podcast, we were talking about how they signed him from the Bills. Yeah."
  },
  {
    "timestamp" : "55:07-55:21",
    "speaker" : "Andy",
    "text" : "Well remember they they had their choice between him and Priest Holmes, but Priest Holmes was more expensive, so they went with the cheaper option. And it was Antoine Smith. No one got them what they needed in 2001. It was good enough to win the Super Bowl, right?"
  },
  {
    "timestamp" : "55:21-55:29",
    "speaker" : "Steve",
    "text" : "Would you rather have Antoine Smith and Corey Dillon or Priest Holmes? Because they kind of went and got Corey Dillon when Priest Holmes still pretty good, I would think."
  },
  {
    "timestamp" : "55:30-55:33",
    "text" : "Corey Dylan was sick. I might choose those two.",
    "speaker" : "Scott"
  },
  {
    "text" : "I mean, yeah, I wonder what the overlap would be between Priest Holmes his career and when he was good versus Corey Dillon. I don't know.",
    "speaker" : "Andy",
    "timestamp" : "55:34-55:42"
  },
  {
    "timestamp" : "55:43-55:47",
    "text" : "Probably pretty close, right? Cory Corey won a Super Bowl, that's for sure.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "55:47-55:51",
    "text" : "Yeah. Yeah, that's gotta be coming pretty soon, I think. Oh three, oh four, maybe.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Touched on records right around then too, if I remember. Him and LT those two years back to back.",
    "timestamp" : "55:52-55:57"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:57-55:58",
    "text" : "Right, right."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "55:58-55:59",
    "text" : "Yeah."
  },
  {
    "timestamp" : "56:01-56:04",
    "text" : "Antoine Smith doesn't get any better from here. No. No.",
    "speaker" : "Greg"
  },
  {
    "text" : "How long does he play for?",
    "timestamp" : "56:05-56:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:06-56:18",
    "speaker" : "Greg",
    "text" : "Three more years. He's one more year in New England. with then Cory Dylan comes in in 04, right? Yeah. Okay. I didn't I didn't know Antoine Smith went to Tennessee and then New Orleans."
  },
  {
    "text" : "I vaguely remember him in New Orleans. I don't remember Tennessee.",
    "timestamp" : "56:19-56:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:23-56:33",
    "speaker" : "Greg",
    "text" : "Ran for like seven hundred yards in New Orleans. Damn. Buffalo was first. Yeah. How long was he there? He was there for four years. The four three."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and then kind of like he was really good and then kind of tailed off because he wasn't getting as much usage in the new coaching system, if I recall. Looks like that's true. Yeah.",
    "timestamp" : "56:33-56:45"
  },
  {
    "timestamp" : "56:45-57:13",
    "text" : "Uh my best from this game, Rohan Davy getting some action. He did. The fucking Jim Jamaican cannon from the bayou. Uh an absolute garbage country boy, dude A Jamaican that played at LSU? God. I bet that guy's got some sick stories. Yeah, he was a thick boy. Do you want to do uh guess his weight?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "57:14-57:14",
    "text" : "Sure."
  },
  {
    "timestamp" : "57:15-57:17",
    "text" : "Two forty-five. Okay.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "57:18-57:19",
    "text" : "Two fifty eight."
  },
  {
    "speaker" : "Greg",
    "text" : "Whoa, Steve.",
    "timestamp" : "57:19-57:20"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "57:21-57:23",
    "text" : "I got I got two sixty-four"
  },
  {
    "timestamp" : "57:24-57:26",
    "text" : "6'2, 245.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "57:26-57:27",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Wow. He was thick with two C's, boy.",
    "timestamp" : "57:27-57:31",
    "speaker" : "Greg"
  },
  {
    "text" : "I think they said McNair was two for yeah it was because they said Brady was two twenty-five and McNair was two thirty. But they were built different.",
    "speaker" : "Andy",
    "timestamp" : "57:31-57:39"
  },
  {
    "text" : "Yeah. I feel like McNair is shaving a few pounds off of that. There's no way. Yeah.",
    "speaker" : "Scott",
    "timestamp" : "57:40-57:48"
  },
  {
    "speaker" : "Andy",
    "text" : "I think he's a bit more than that.",
    "timestamp" : "57:48-57:50"
  },
  {
    "speaker" : "Scott",
    "text" : "Brady's adding some on. I don't know.",
    "timestamp" : "57:51-57:53"
  },
  {
    "text" : "What was uh Jared Lorenzen? Let's oh yeah, the hefty lefty. We'll put that as the benchmark. Yeah. The round mount of touchdown. Yeah. He had to have been three. No way.",
    "speaker" : "Greg",
    "timestamp" : "57:53-58:04"
  },
  {
    "speaker" : "Steve",
    "text" : "I would love to compare Cam Newton Hair and Ben Rothesburger size.",
    "timestamp" : "58:04-58:09"
  },
  {
    "timestamp" : "58:10-58:14",
    "text" : "He was He was 6'4, 315 pounds.",
    "speaker" : "Greg"
  },
  {
    "text" : "315. Hang on, what do we say Albert Hainsworth was?",
    "timestamp" : "58:14-58:19",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, right around there.",
    "speaker" : "Steve",
    "timestamp" : "58:19-58:21"
  },
  {
    "timestamp" : "58:21-58:27",
    "speaker" : "Greg",
    "text" : "325, I think. The very thrill boy. The hefty lefty."
  },
  {
    "text" : "Who ran a faster 40? Albert Hainsworth or the Pulse Power? He ate me.",
    "timestamp" : "58:28-58:36",
    "speaker" : "Scott"
  },
  {
    "speaker" : "Andy",
    "text" : "Albert Hainsworth with three thirty-five.",
    "timestamp" : "58:36-58:38"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "58:40-58:45",
    "text" : "Thirty-five. Bet Hainsworth ran it faster for sure. Yeah, it's not even close."
  },
  {
    "speaker" : "Greg",
    "text" : "What a story Jared Lorenzen is, huh? He actually played in the NFL as a 300-pound quarterback. That is just Incredible. Inspirational. Yeah.",
    "timestamp" : "58:45-58:56"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "58:57-58:58",
    "text" : "Never give up on your dreams."
  },
  {
    "speaker" : "Andy",
    "text" : "He died though recently, didn't he? I think it was like an unexpected thing too.",
    "timestamp" : "58:58-59:02"
  },
  {
    "timestamp" : "59:02-59:06",
    "speaker" : "Greg",
    "text" : "He might have. I know he really s he like really struggled with weight after he played."
  },
  {
    "timestamp" : "59:06-59:08",
    "text" : "Yeah, no, I think he did though.",
    "speaker" : "Andy"
  },
  {
    "text" : "He could he when he came out of the womb he was thirteen pounds three ounces.",
    "timestamp" : "59:08-59:14",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "59:14-59:16",
    "text" : "Jesus Christ.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "59:18-59:23",
    "text" : "It's a fucking wide load, dude. Talk about being built different."
  },
  {
    "text" : "Oh man. Mom just gives birth to linebackers.",
    "speaker" : "Andy",
    "timestamp" : "59:27-59:30"
  },
  {
    "timestamp" : "59:31-59:33",
    "text" : "All right, Andy, what's your best and worse?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "All right. Uh my worst was uh Brady throwing a pick six. Because we haven't talked about it.",
    "timestamp" : "59:33-59:42"
  },
  {
    "text" : "That was the game. That was the game change on that play. It was over.",
    "timestamp" : "59:42-59:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That was it.",
    "timestamp" : "59:45-59:45"
  },
  {
    "text" : "That touchdown to open the second half. Yep. Force a punt. Boom. Pick six.",
    "timestamp" : "59:46-59:51",
    "speaker" : "Steve"
  },
  {
    "text" : "And then literally the first play. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "59:52-59:53"
  },
  {
    "text" : "Flashbacks to the other game where we threw it to Logan Ryan to end Brady's career.",
    "timestamp" : "59:55-01:00:00",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, yeah, it felt similar.",
    "timestamp" : "01:00:01-01:00:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Rich Cody. Shout out white defensive backs. I'm gonna shout out every white defensive back I come across. Because I don't think there's been one in like 10 years, right?",
    "timestamp" : "01:00:03-01:00:12"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh Jason Seahorn.",
    "timestamp" : "01:00:13-01:00:15"
  },
  {
    "timestamp" : "01:00:15-01:00:19",
    "text" : "Yeah, he hasn't played in 10 years. That's probably true. Adam Archelletta.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:00:20-01:00:21",
    "speaker" : "Scott",
    "text" : "Yeah, fuck."
  },
  {
    "speaker" : "Greg",
    "text" : "John Lynch is somewhat recent, right? I think it's cornerbacks, I think is what it is now, isn't it? Because Harrison Smith is probably white.",
    "timestamp" : "01:00:22-01:00:30"
  },
  {
    "timestamp" : "01:00:30-01:00:31",
    "speaker" : "Steve",
    "text" : "Oh, he definitely is."
  },
  {
    "speaker" : "Greg",
    "text" : "No, although I was looking up the black quarterbacks thing. Patrick Mahomes is black.",
    "timestamp" : "01:00:31-01:00:35"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:36-01:00:37",
    "text" : "Yeah. Yeah, of course."
  },
  {
    "text" : "What would you think it was?",
    "speaker" : "Greg",
    "timestamp" : "01:00:37-01:00:39"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:00:39-01:00:40"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:00:40-01:00:44",
    "text" : "I don't know. He looks like more."
  },
  {
    "text" : "I guess. I don't know He sounds white. Is that what I'm saying? Where do you even draw that line?",
    "speaker" : "Andy",
    "timestamp" : "01:00:45-01:00:49"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:00:50-01:00:53",
    "text" : "Yeah, we've we're off from Pangea, right? So we're off Yeah."
  },
  {
    "text" : "I was I was reading the Cradle of Civilization.",
    "timestamp" : "01:00:53-01:00:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "We're off.",
    "timestamp" : "01:00:56-01:00:56"
  },
  {
    "speaker" : "Andy",
    "text" : "I was reading another book by uh Bill Bryson, something about the body. And apparently uh the color of your skin is literally like the top paper thin layer of your your epidermis. That's the only thing that's different between you and Patrick Mahomes, Craig.",
    "timestamp" : "01:00:56-01:01:13"
  },
  {
    "text" : "Yeah. Yeah, did I have a stronger arm?",
    "speaker" : "Greg",
    "timestamp" : "01:01:13-01:01:16"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:01:16-01:01:23",
    "text" : "Well, you do have a uh butt chin implant as well. Yeah, and a better looking wife. Oh shit"
  },
  {
    "speaker" : "Andy",
    "text" : "Shots fired.",
    "timestamp" : "01:01:24-01:01:25"
  },
  {
    "text" : "They're not married yet though. I know. What an idiot. Twenty-five years old. He's about to make half a billion dollars. Yeah, it's ridiculous. I would immediately divorce my wife if I became a shit.",
    "speaker" : "Greg",
    "timestamp" : "01:01:25-01:01:41"
  },
  {
    "timestamp" : "01:02:00-01:02:28",
    "speaker" : "Andy",
    "text" : "Oh fuck. There it is. Um speaking of worse, I have another worse and it's our stat check department. Um, this probably includes me. But we talked about how in the snowball game Tom Brady's rushing touchdown was the longest of his career. Yeah, it wasn't. Oh. It was his touchdown in this game. Ten yards. Everybody remembers, yeah, for a whole ten yards. Where he did a QB sneak for ten yards."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, it wasn't even like a it was a design QB sneak.",
    "timestamp" : "01:02:28-01:02:31"
  },
  {
    "timestamp" : "01:02:31-01:02:34",
    "text" : "Yeah, he just goosed the center and r and ran off his ass.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:34-01:02:35",
    "text" : "Goosed him.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Goosed him.",
    "timestamp" : "01:02:35-01:02:36"
  },
  {
    "speaker" : "Steve",
    "text" : "That's got the longest sneak of all time.",
    "timestamp" : "01:02:36-01:02:38"
  },
  {
    "timestamp" : "01:02:38-01:02:43",
    "text" : "His ten yard ten-yard touchdown is the longest of his career. So good for him.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:43-01:02:48",
    "speaker" : "Steve",
    "text" : "That's gotta be as long as QB Sneak anywhere on the field though. He could have kept going for 20 yards."
  },
  {
    "speaker" : "Andy",
    "text" : "So I'm sure it's as long as QB Sneak, yeah, but he's had longer run. I think his longest is like 20-something yards.",
    "timestamp" : "01:02:48-01:02:54"
  },
  {
    "text" : "I thought he looked a little faster now than he does or sorry then than he does now. He looks pretty slow now when he runs.",
    "speaker" : "Scott",
    "timestamp" : "01:02:58-01:03:05"
  },
  {
    "timestamp" : "01:03:05-01:03:15",
    "text" : "To be fair, he's what forty old now, so twenty years, yeah. I'm a little slower now too than I was in high school.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:03:15-01:03:19",
    "speaker" : "Steve",
    "text" : "We're trying to get Scott to do a 40 yard dash and see if he's faster than Tom Brady or not. He's convinced."
  },
  {
    "timestamp" : "01:03:19-01:03:20",
    "speaker" : "Andy",
    "text" : "I feel like we should all do that."
  },
  {
    "text" : "I'll do that. I'm definitely faster than that number. You said it earlier, it's like 5-2 or something like that?",
    "speaker" : "Steve",
    "timestamp" : "01:03:20-01:03:26"
  },
  {
    "text" : "It was like 5-2-8, yeah. Something like that.",
    "speaker" : "Andy",
    "timestamp" : "01:03:27-01:03:29"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:03:29-01:03:31",
    "text" : "I think I've got that."
  },
  {
    "timestamp" : "01:03:31-01:03:32",
    "speaker" : "Scott",
    "text" : "It's all about the start."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:33-01:03:34",
    "text" : "Yeah, there's no way I have that."
  },
  {
    "timestamp" : "01:03:36-01:03:38",
    "speaker" : "Scott",
    "text" : "That was the word on the street. Yeah. But yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:03:39-01:04:10",
    "text" : "All right. I had one more note. I I I have uh I have an apology to make specifically to Steve. I listened to the some of the episodes from the middle of the summer and I was I was being a dick to you. And I want you to know that I listened to it and I was being an asshole and I apologize, Steve. I wasn't mad at you. I was mad at myself. Okay. I was struggling through quarantine and I'm sorry. That being said, there it is."
  },
  {
    "text" : "I was waiting for the other shoe to drop.",
    "speaker" : "Andy",
    "timestamp" : "01:04:10-01:04:12"
  },
  {
    "text" : "We I asked for a timestamp in the week eight game against the Broncos. At 45 minutes into that episode, you made the claim that Ryan Tannehill and Josh Allen were terrible quarterbacks. And I said we're going to give weekly updates once the NFL started. So Why don't we check our notes here, Steve? Okay. Week one, NFL. Ryan Tanhill, twenty nine of four 43 for 249 yards, two touchdowns, and no picks, 97. 9 rating, including a game-winning drive in the fourth quarter. Josh Allen 16 points. Josh Allen, 33 of 46 for 312 yards, two touchdowns, no picks, and a 104. 6. rating in a win for the Buffalo Bills. Who did they against the Jets. The case is not closed, I will admit that, but I will update every week. It seems like you're losing the argument after week one though.",
    "timestamp" : "01:04:12-01:05:11",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:05:11-01:05:15",
    "text" : "I feel I'm I'm pretty confident. Less so in Josh Allen, more so in Ryan Tana."
  },
  {
    "timestamp" : "01:05:15-01:05:22",
    "speaker" : "Scott",
    "text" : "I'm on Team Greg for sure. Both those guys are solid. Do you have them on your fantasy team? I don't. I just like them."
  },
  {
    "timestamp" : "01:05:23-01:05:28",
    "speaker" : "Greg",
    "text" : "Josh Allen, I think, is the truth. He threw for 300 yards. I think he could be good."
  },
  {
    "timestamp" : "01:05:28-01:05:34",
    "speaker" : "Steve",
    "text" : "He's a roller coaster. He can be really good or really bad. I think Tannehill sucks. I think we all know Tan Hill sucks. We watched him in the Dolphins for years."
  },
  {
    "timestamp" : "01:05:34-01:05:37",
    "text" : "I think Steve might be able to throw for three hundred yards against the Jets though.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:40-01:05:58",
    "speaker" : "Greg",
    "text" : "But like we were saying, not shitty. Yeah. In that episode we were saying that it's very circumstantial of how good a quarterback is. Like you're on a bag organization. Yeah. You're gonna look so and we've only seen Tannehill on the Dolphins. So it's like it could be a product of being on a shitty team, you know?"
  },
  {
    "timestamp" : "01:05:58-01:06:05",
    "speaker" : "Scott",
    "text" : "That's true. Sam Darnold exhibit once Nick Foles is only good in the playoffs somehow. So I don't get that at all."
  },
  {
    "timestamp" : "01:06:11-01:06:12",
    "speaker" : "Andy",
    "text" : "Who did Tanahill?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:06:12-01:06:13",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's true.",
    "timestamp" : "01:06:13-01:06:14"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:06:14-01:06:29",
    "text" : "I got a I got a I got a question, uh a theoretical question. Whose career would you rather have? Nick Foles or Ryan Fitzpatrick? Nick Foles. Yeah, Foles for sure. Foles? Definitely."
  },
  {
    "speaker" : "Andy",
    "text" : "I mean, just just compare nicknames. I think that kind of answers your question, no?",
    "timestamp" : "01:06:30-01:06:35"
  },
  {
    "text" : "It's magic. But it it's also if it's tragic.",
    "timestamp" : "01:06:36-01:06:42",
    "speaker" : "Greg"
  },
  {
    "text" : "Maybe a better comparison would be like Doug Foodie or if it's magic. I feel they're pretty similar.",
    "speaker" : "Steve",
    "timestamp" : "01:06:43-01:06:47"
  },
  {
    "text" : "I think I think uh he made Fitzpatrick made more money.",
    "timestamp" : "01:06:48-01:06:54",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:06:54-01:07:01",
    "speaker" : "Andy",
    "text" : "If it's Fitzpatrick and Doug Clude Fitzpatrick, because I like to reach things on the top shelf. Wait, what?"
  },
  {
    "timestamp" : "01:07:02-01:07:08",
    "speaker" : "Steve",
    "text" : "I mean I'd have Doug Hoodie because he did that drop kick. He seemed to play like a little bit more than just quarterback on shit teams forever."
  },
  {
    "timestamp" : "01:07:08-01:07:11",
    "speaker" : "Andy",
    "text" : "He did. He also played for the Patriots, so that's a Mm-hmm. A plus."
  },
  {
    "timestamp" : "01:07:12-01:07:19",
    "speaker" : "Scott",
    "text" : "Also, I don't know if you know this, but both of them super good for the Bills. Fitzpatrick went to Harvard, so that's pretty sick."
  },
  {
    "speaker" : "Andy",
    "text" : "He did? Why doesn't anybody ever say that?",
    "timestamp" : "01:07:21-01:07:24"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:07:24-01:07:25",
    "text" : "People forget that."
  },
  {
    "timestamp" : "01:07:25-01:07:29",
    "text" : "Who would guess that? Oh fuck.",
    "speaker" : "Andy"
  },
  {
    "text" : "I actually wrote a blog about this.",
    "timestamp" : "01:07:31-01:07:33",
    "speaker" : "Greg"
  },
  {
    "text" : "You did?",
    "timestamp" : "01:07:33-01:07:34",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07:34-01:07:34",
    "text" : "Uh-huh.",
    "speaker" : "Greg"
  },
  {
    "text" : "Which one?",
    "speaker" : "Andy",
    "timestamp" : "01:07:35-01:07:35"
  },
  {
    "timestamp" : "01:07:36-01:07:39",
    "text" : "You don't read my blogs that I put on our website, Andy?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I do, but you haven't written one in so long I've forgotten them.",
    "timestamp" : "01:07:39-01:07:42"
  },
  {
    "text" : "Sir, I'm not sure what you're doing. Let's see here. I broke it down by a few different categories. Off the field reputation. I gave it to Falls for the big dick nick. Fair. Legacy, I gave it to Nick Foles because he won a Super Bowl. Yep. Money. Fitzpatrick may has made more. He made 58 million compared to 30 for Nick Falls.",
    "timestamp" : "01:07:42-01:08:09",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:08:09-01:08:16",
    "speaker" : "Andy",
    "text" : "Nick Foles is younger though, isn't he? So he's still got a few years on him. Yeah. Yeah. So does this Patrick though? That might change."
  },
  {
    "speaker" : "Greg",
    "text" : "Future prospects, I think if you're talking about who could have who could uh make the next step bug into the booth, it's definitely future Patrick, right?",
    "timestamp" : "01:08:17-01:08:27"
  },
  {
    "speaker" : "Scott",
    "timestamp" : "01:08:27-01:08:29",
    "text" : "Definitely on the way more charisma."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he's a Harvard guy. He is probably pretty smart. He got a 49 on the fucking on the wonder lick, yeah. On the wander lick. What a dickhead. Uh and then finally I based them on sex appeal. And I mean it's pretty clear that Fitzpatrick wins that one. That's true.",
    "timestamp" : "01:08:29-01:08:44"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah.",
    "timestamp" : "01:08:45-01:08:45"
  },
  {
    "speaker" : "Greg",
    "text" : "Just the beard alone.",
    "timestamp" : "01:08:45-01:08:46"
  },
  {
    "timestamp" : "01:08:47-01:08:49",
    "speaker" : "Steve",
    "text" : "Is this a new blog post or is this one you've had up?"
  },
  {
    "text" : "No, I wrote it back when he was when he was on Tampa Bay. Remember he showed up at that press conference with the sunglasses and the chest hair coming out? That's when I wrote it because I was like, oh man, this guy is fucking killing it right now.",
    "timestamp" : "01:08:49-01:09:00",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah that that was that was Peak Fitzpatrick wasn't it? Because didn't he come in for Winston and throw like four touchdowns or something? Yeah. Yeah. Yeah. And just torch somebody.",
    "timestamp" : "01:09:01-01:09:09",
    "speaker" : "Andy"
  },
  {
    "text" : "I'll bet that the Patriots sign him for like one year as a backup. Like Brian Hoyer moves on, stick Fitzpatrick back there.",
    "timestamp" : "01:09:09-01:09:17",
    "speaker" : "Steve"
  },
  {
    "text" : "I don't know if they could afford him.",
    "timestamp" : "01:09:18-01:09:19",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:09:21-01:09:35",
    "text" : "I found an Eagles fan that has a tattoo of it says, it's an Eagle. perched on a Lombardy with a Brady jersey in its hand and it says big dick nick over it.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:09:37-01:09:38",
    "speaker" : "Andy",
    "text" : "As you do."
  },
  {
    "timestamp" : "01:09:39-01:09:50",
    "speaker" : "Greg",
    "text" : "Imagine get so Philadelphia to get it. Completely forgetting about the first one. Yeah. So just And just have another man's penis tattooed on you, essentially, is what he thinks."
  },
  {
    "text" : "But just think what would happen. Just think of the tattoos that would come out of a Buffalo Bills Super Bowl victory.",
    "speaker" : "Andy",
    "timestamp" : "01:09:52-01:09:58"
  },
  {
    "timestamp" : "01:09:59-01:09:59",
    "text" : "Oh yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "They'd be like full back tattoos.",
    "speaker" : "Andy",
    "timestamp" : "01:10:00-01:10:02"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:10:02-01:10:02"
  },
  {
    "speaker" : "Andy",
    "text" : "In that same vein.",
    "timestamp" : "01:10:02-01:10:04"
  },
  {
    "speaker" : "Steve",
    "text" : "Which is great. I didn't realize I guess on me, but the Music City Miracle was the year before it was like 99, right?",
    "timestamp" : "01:10:04-01:10:13"
  },
  {
    "timestamp" : "01:10:13-01:10:15",
    "speaker" : "Greg",
    "text" : "Yep. Yeah"
  },
  {
    "speaker" : "Steve",
    "text" : "So that's the last time Buffalo's kind of in the playoffs and relevant.",
    "timestamp" : "01:10:16-01:10:21"
  },
  {
    "text" : "They were in the game.",
    "timestamp" : "01:10:22-01:10:23",
    "speaker" : "Andy"
  },
  {
    "text" : "And haven't they not won a home playoff game since then, right? Didn't they win the week before and then that happened?",
    "speaker" : "Steve",
    "timestamp" : "01:10:23-01:10:28"
  },
  {
    "timestamp" : "01:10:28-01:10:29",
    "speaker" : "Andy",
    "text" : "Something like that."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:10:29-01:10:29",
    "text" : "Might be right."
  },
  {
    "text" : "I don't think it was the wild card round. I thought it was like the division or something like that.",
    "speaker" : "Steve",
    "timestamp" : "01:10:30-01:10:34"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. And he lit it up so they started him in the playoffs.",
    "timestamp" : "01:10:34-01:10:45"
  },
  {
    "text" : "And then they put flew back in and he brought him back and then the miracle and then the miracle happened.",
    "timestamp" : "01:10:46-01:10:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Poor Doug. Buffalo hasn't won a home playoff game since Whatever before that was.",
    "timestamp" : "01:10:51-01:10:56"
  },
  {
    "timestamp" : "01:10:57-01:10:58",
    "speaker" : "Andy",
    "text" : "Since Jim Kelly."
  },
  {
    "timestamp" : "01:10:58-01:11:00",
    "speaker" : "Steve",
    "text" : "Yeah. That's tough."
  },
  {
    "text" : "Not good.",
    "timestamp" : "01:11:00-01:11:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:01-01:11:03",
    "speaker" : "Steve",
    "text" : "Still Robbie Bills and Lions."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that was eye-opening listening to a Lions fan talk about. And then watching week one.",
    "timestamp" : "01:11:04-01:11:10"
  },
  {
    "speaker" : "Scott",
    "timestamp" : "01:11:10-01:11:15",
    "text" : "Yeah. And then watching week one where they just got absolutely wrecked at the end."
  },
  {
    "text" : "He was mad on the pla on the group chat.",
    "timestamp" : "01:11:15-01:11:18",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm surprised. I feel like he'd be numb to that by now, but I guess so pissed.",
    "timestamp" : "01:11:18-01:11:23"
  },
  {
    "timestamp" : "01:11:23-01:11:30",
    "text" : "He was yelling at all us you're complaining about the Celtics losing or something stupid like that.",
    "speaker" : "Steve"
  },
  {
    "text" : "That was pretty bad though.",
    "speaker" : "Greg",
    "timestamp" : "01:11:33-01:11:34"
  },
  {
    "speaker" : "Scott",
    "text" : "Classic Lions. What's the next terrible way that they're gonna lose? Like w what's worse? Like how can they lose worse? What's happening now?",
    "timestamp" : "01:11:36-01:11:46"
  },
  {
    "timestamp" : "01:11:47-01:11:50",
    "text" : "They'll find away, don't put limits on their creativity, Scott. They'll be f they'll find a way.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:11:50-01:12:03",
    "speaker" : "Scott",
    "text" : "That's fair. Like they'll fumble it on like a kneel. To run the clock out. W Stafford will throw it over his head by accident. They'll return it for a touchdown. Sorry, Trevor."
  },
  {
    "timestamp" : "01:12:04-01:12:30",
    "text" : "I did see I think some blog post or something back in the day. Some guy, a Browns fan ranked all of the Browns losses by how heartbreaking they were. Starting with the the like the most heartbreaking all the way through. And it was like hundreds of them. And they were just like, you know, a couple lines for each game. And Just the way that the Cleveland Browns can lose football games will blow your absolute mind. I really will. It's incredible.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:12:31-01:12:33",
    "text" : "You should look that up and attach to the show notes."
  },
  {
    "text" : "Okay, yeah. Every Brown's lost since 1999 ranked.",
    "speaker" : "Andy",
    "timestamp" : "01:12:33-01:12:36"
  },
  {
    "speaker" : "Scott",
    "text" : "How many are there?",
    "timestamp" : "01:12:37-01:12:39"
  },
  {
    "timestamp" : "01:12:42-01:13:13",
    "speaker" : "Andy",
    "text" : "It's gotta be a lot and eighty-six Sorry, one eighty six, uh one eighty six through one thirty-eight. Eh, these aren't that bad. Yeah. Let's just let's pick one at random. Number sixty seven at Baltimore 2004 week nine 27-13. In a game that included a seven-yard punt by the Browns, a tip drill interception by Ed Reed in his own end zone was returned to 106 yards for the game ceiling touchdown."
  },
  {
    "timestamp" : "01:13:15-01:13:17",
    "speaker" : "Scott",
    "text" : "And that was what, number sixty-seven?"
  },
  {
    "text" : "What's number one?",
    "speaker" : "Andy",
    "timestamp" : "01:13:18-01:13:18"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:13:20-01:13:27",
    "text" : "No, no. I thought three of these and really. Maybe wait let's wait for the Cleveland game, read through them and then do that."
  },
  {
    "text" : "Okay, all right. We'll save some of that.",
    "speaker" : "Andy",
    "timestamp" : "01:13:27-01:13:28"
  },
  {
    "text" : "We'll have some on that for that game too.",
    "speaker" : "Steve",
    "timestamp" : "01:13:28-01:13:30"
  },
  {
    "timestamp" : "01:13:30-01:13:33",
    "text" : "Hey we could do a browns on browns just on this post.",
    "speaker" : "Andy"
  },
  {
    "text" : "Browns on browns on browns.",
    "speaker" : "Greg",
    "timestamp" : "01:13:33-01:13:34"
  },
  {
    "timestamp" : "01:13:34-01:13:40",
    "speaker" : "Andy",
    "text" : "Yeah, this is This is bad. It's two thousand and one was the the number one game."
  },
  {
    "text" : "Two thousand and one",
    "speaker" : "Greg",
    "timestamp" : "01:13:41-01:13:43"
  },
  {
    "speaker" : "Andy",
    "text" : "These are bad Oh the the loss against uh New England where they were up uh twenty six fourteen and New England came back.",
    "timestamp" : "01:13:44-01:13:51"
  },
  {
    "timestamp" : "01:13:51-01:13:53",
    "text" : "With the onside skick.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:13:53-01:13:54",
    "speaker" : "Andy",
    "text" : "Yeah, that's number six."
  },
  {
    "text" : "Mark Ferrari was at that game and left early and had to listen to it in the parking lot.",
    "timestamp" : "01:13:54-01:14:00",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:14:01-01:14:02",
    "text" : "Never leave a game early."
  },
  {
    "text" : "Yeah",
    "timestamp" : "01:14:03-01:14:03",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:14:04-01:14:13",
    "speaker" : "Andy",
    "text" : "Patriots score a touchdown with sixty one seconds left, recover the onside kick, and then score another touchdown 30 seconds later to win 27-26."
  },
  {
    "speaker" : "Steve",
    "text" : "All right, let's save it for the Browns. All right.",
    "timestamp" : "01:14:19-01:14:22"
  },
  {
    "text" : "I don't think I have anything else on the Titans.",
    "speaker" : "Andy",
    "timestamp" : "01:14:23-01:14:26"
  },
  {
    "speaker" : "Scott",
    "timestamp" : "01:14:27-01:14:33",
    "text" : "You can call them the tits, which is really cool. I like that. The titans of industry."
  },
  {
    "text" : "All right boys. What do we have next week? Next week we are at home against the Jets in a game that has playoff implications. Yeah.",
    "timestamp" : "01:14:35-01:14:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:14:48-01:14:51",
    "text" : "Anybody can skip it to the chess game.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "A little bit. Yeah, we may yeah. I don't think we're gonna want to talk about the chess game, but Yeah.",
    "timestamp" : "01:14:51-01:14:56"
  },
  {
    "timestamp" : "01:14:57-01:15:22",
    "speaker" : "Steve",
    "text" : "You know what Greg. Remember remember when we were at the Titans game, Greg? And we were just getting the doors blown off. This is like two years ago. We went to naturally peel that money. And then they just got the shit kicked out of us. I was wearing your starter jacket and I want to leave. And you're like, you gotta sit and take your lumps. Yeah. So I think the Jets episode next week. That's true. That's true."
  },
  {
    "text" : "I think you should get blind drunk for it though.",
    "speaker" : "Andy",
    "timestamp" : "01:15:22-01:15:25"
  },
  {
    "text" : "Who are we playing? The Jets?",
    "speaker" : "Greg",
    "timestamp" : "01:15:25-01:15:26"
  },
  {
    "timestamp" : "01:15:27-01:15:33",
    "text" : "The Jets at home with playoff implications. I don't think I'm spit playing anything when I tell you it doesn't go great.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:15:34-01:15:44",
    "speaker" : "Greg",
    "text" : "Alright. I'll be there. I'm gonna I'm not gonna talk about the game though. That's my promise. Like I'll show up, but I'm gonna make I'm gonna make a mockery of the pot."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:15:45-01:15:50",
    "text" : "How it's any different from any other let me guess you're not gonna watch the game either."
  },
  {
    "speaker" : "Greg",
    "text" : "What do you want me to research, Andy? I'm gonna I'll find something that's completely unrelated.",
    "timestamp" : "01:15:53-01:15:57"
  },
  {
    "speaker" : "Scott",
    "text" : "You gave us a great story about Steve McNair. I heard about Dave and Buster's waitresses. I've heard about everything.",
    "timestamp" : "01:15:59-01:16:05"
  },
  {
    "timestamp" : "01:16:05-01:16:10",
    "speaker" : "Greg",
    "text" : "That's my niche here is uh I'm the I'm the research guy, not the watch guy."
  },
  {
    "text" : "I like that.",
    "timestamp" : "01:16:10-01:16:10",
    "speaker" : "Scott"
  },
  {
    "timestamp" : "01:16:12-01:16:14",
    "text" : "You're the derailer.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, that as well. Uh-huh. Tell us who's your least favorite, why it's Steve, and by how much. You can uh go you can rate this podcast at ratethispodcast. com slash patzpod.",
    "timestamp" : "01:16:14-01:16:32"
  },
  {
    "timestamp" : "01:16:35-01:16:46",
    "speaker" : "Scott",
    "text" : "Are you talking to me? Because I'll give Steve by far the worst. He's the worst by a shit ton. That's fine. I'll just get Trevor to give me a really nice one. He's the worst by like eight Dave Busters waitresses."
  },
  {
    "speaker" : "Greg",
    "text" : "Iranian David. Sorry, I forgot that part.",
    "timestamp" : "01:16:48-01:16:51"
  },
  {
    "timestamp" : "01:16:51-01:17:04",
    "speaker" : "Andy",
    "text" : "Yeah, so if you want to go to ratethispodcast. com slash patspod, you can rate the podcast. You can tell us how much you hate Steve. Or tell us how how uh how great Greg's insights into these games have been."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:17:05-01:17:07",
    "text" : "Yeah. Oh the field was bad"
  },
  {
    "speaker" : "Greg",
    "text" : "If they don't give me highlights, there's there's nothing I can do. It's out of my control.",
    "timestamp" : "01:17:10-01:17:14"
  },
  {
    "text" : "It isn't, but okay. Glad you picked that.",
    "speaker" : "Andy",
    "timestamp" : "01:17:16-01:17:20"
  },
  {
    "text" : "How about this? I'll give uh I'll give a little recap on the playoffs next week.",
    "timestamp" : "01:17:20-01:17:25",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:17:26-01:17:27",
    "speaker" : "Steve",
    "text" : "Yeah, that's a good idea."
  },
  {
    "timestamp" : "01:17:27-01:17:36",
    "speaker" : "Greg",
    "text" : "Because we're not for the last week of the season? We're not gonna okay. I'll give the AFC side next week and then the NFC side the week after."
  },
  {
    "speaker" : "Andy",
    "text" : "Why the other way around? Give us the NFC next week. Because the A because the Patriots are part of the AFC. Picture at the end. Yeah, yeah. We're gonna play the what if get into that. Play what if. Okay. Yeah, exactly. All right, gentlemen. Pleasure as always. Enjoy your evenings. And we'll see you next week on the Patriots Dynasty Podcast. See you later.",
    "timestamp" : "01:17:39-01:18:03"
  },
  {
    "text" : "Later.",
    "speaker" : "Greg",
    "timestamp" : "01:18:04-01:18:04"
  }
]