[
  {
    "timestamp" : "00:00-00:18",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother.",
    "speaker" : "Mom"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:22-00:31",
    "text" : "Welcome back to the Pinterest Dynasty Podcast. I'm your host, Andrew Brown. With me today we have the Brown brothers. How are you doing boys?"
  },
  {
    "text" : "There's that docile tone I was looking for. Nice.",
    "speaker" : "Steve",
    "timestamp" : "00:31-00:34"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know if Docils are what you're looking for, because that means. Like calm and house trained basically.",
    "timestamp" : "00:34-00:40"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, you're the most domesticated of the Browns.",
    "timestamp" : "00:41-00:43"
  },
  {
    "timestamp" : "00:43-00:49",
    "speaker" : "Steve",
    "text" : "Yeah, domesticated. That's a good word for it. And yeah, you're the left side of Greg's face right now."
  },
  {
    "text" : "And Greg is the right side of his face? Yeah. That feels about right.",
    "speaker" : "Andy",
    "timestamp" : "00:50-00:55"
  },
  {
    "text" : "The duality of human nature.",
    "timestamp" : "00:56-00:58",
    "speaker" : "Greg"
  },
  {
    "text" : "Yes, so for those who can't see Greg, um you're welcome that this is an audio uh medium because he has only shaped half his face and the other half has grown wild. And it looks fucking hideous. And how his wife hasn't left him, I'm not quite sure. Maybe it's because she's physically not able to, would be my guess.",
    "timestamp" : "00:58-01:18",
    "speaker" : "Andy"
  },
  {
    "text" : "Hairy like animal.",
    "timestamp" : "01:19-01:20",
    "speaker" : "Greg"
  },
  {
    "text" : "How long have you grown the beard, Greg?",
    "timestamp" : "01:21-01:23",
    "speaker" : "Steve"
  },
  {
    "text" : "April fifth and it is now June June eighteenth So a little over two months.",
    "speaker" : "Greg",
    "timestamp" : "01:24-01:34"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:34-01:35",
    "text" : "Yeah, it looks that way."
  },
  {
    "text" : "Yeah, it's pretty good. And the hair too.",
    "timestamp" : "01:36-01:38",
    "speaker" : "Greg"
  },
  {
    "text" : "You did post a picture in the family WhatsApp today, and I really appreciated the um The serial killer eyes that you put into it. Have you been practicing that? Or is that just yeah, is that just how you take pictures?",
    "speaker" : "Andy",
    "timestamp" : "01:38-01:52"
  },
  {
    "timestamp" : "01:52-01:53",
    "speaker" : "Greg",
    "text" : "You're talking to me."
  },
  {
    "speaker" : "Andy",
    "text" : "No, I'm talking other serial killer who shaved half his face.",
    "timestamp" : "01:54-01:56"
  },
  {
    "text" : "Uh oh went out. Oh boy. Give me a second here. All right, continue. Where were we? Speaking of serial killers.",
    "timestamp" : "01:58-02:11",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "02:12-02:18",
    "speaker" : "Andy",
    "text" : "This is where you going with this. Patriots are uh hosting the Green Bay Packers."
  },
  {
    "timestamp" : "02:18-02:21",
    "speaker" : "Steve",
    "text" : "What we haven't even drafted Aaron Hernandez yet."
  },
  {
    "timestamp" : "02:22-02:37",
    "speaker" : "Andy",
    "text" : "Hosted uh led by the noted serial killer Brett Favre. Wait, what? Brett Favre killed a dude Oh I'm sure he's killed multiple dudes. Isn't that why you have to be a serial killer? Because serial means more than one. Isn't that right?"
  },
  {
    "text" : "Uh Uh maybe it's a good question.",
    "timestamp" : "02:39-02:42",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:42-02:47",
    "speaker" : "Andy",
    "text" : "We gotta have hot takes. We gotta keep up with um sports talk radio. So the hot takes."
  },
  {
    "timestamp" : "02:47-02:50",
    "speaker" : "Steve",
    "text" : "So your hot take is Brett Five has killed multiple people."
  },
  {
    "text" : "Yes. Okay. Yeah. Yeah, okay.",
    "timestamp" : "02:50-02:57",
    "speaker" : "Andy"
  },
  {
    "text" : "I mean if you were gonna pick anybody on this Green Bay Packer team, who would it be? You could have saved us from the Ravens game, Andy. Come on.",
    "speaker" : "Steve",
    "timestamp" : "02:57-03:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:04-03:14",
    "text" : "Have you seen did you see the picture Yes? Do you see the picture of what? His penis? Uh not firsthand, no. I've heard it described."
  },
  {
    "text" : "I I looked it up as as research for this episode.",
    "speaker" : "Greg",
    "timestamp" : "03:15-03:18"
  },
  {
    "text" : "You are dedicated to this podcast. What um can can you describe it to me, please?",
    "timestamp" : "03:20-03:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Um I mean it's small. Well uh it's not small, small, but it's not big. He's circumcised. Okay. I think he was trying to chub it up because the picture he has it like in his hand. He's like giving it the old, you know, squeeze job.",
    "timestamp" : "03:25-03:45"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:45-03:47",
    "text" : "The old five fingers, yeah. Okay. Yeah."
  },
  {
    "timestamp" : "03:49-03:55",
    "speaker" : "Greg",
    "text" : "And I listened to the voicemails that he left on that fine young lady's voice uh message machine."
  },
  {
    "text" : "Oh yeah. Was it the same lady that Joe Thysman hit on?",
    "speaker" : "Steve",
    "timestamp" : "03:55-03:58"
  },
  {
    "text" : "No. No, that was um Susie Colbert. Yeah, this is Jen Sturger or something like that. Yeah, that's sideline reporter for the Jets. It was pretty sad actually.",
    "timestamp" : "03:59-04:10",
    "speaker" : "Greg"
  },
  {
    "text" : "Well yeah, let's get right into it.",
    "timestamp" : "04:10-04:12",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "04:12-04:26",
    "speaker" : "Andy",
    "text" : "Yeah. So yeah, Greg, you're the uh the deep dive guy. Was your deep dive on Brett Favre this week? Is that what you're telling us? Yeah, I didn't know his his uh his pictures just out of having a good time."
  },
  {
    "timestamp" : "04:27-04:36",
    "speaker" : "Greg",
    "text" : "Well, I mean that's part of the process, right? I leave no stone unturned. Greg had already seen it. I leave no cock unlooked at."
  },
  {
    "speaker" : "Andy",
    "text" : "I believe that's a Brown family motto, isn't it?",
    "timestamp" : "04:38-04:40"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "04:42-04:51",
    "text" : "I think this is this is the only time the Patriots play Far or uh Brady plays Favre on the Packers, right? You would think, but no. Huh."
  },
  {
    "timestamp" : "04:52-04:57",
    "speaker" : "Andy",
    "text" : "On the Packers. Because I was going through the 2006 season today and they play them again there. Oh, okay."
  },
  {
    "text" : "Well, first of all, I would like to make an apology to Steve. Oh, Jesus. Okay. You can believe that.",
    "timestamp" : "04:58-05:05",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:05-05:07",
    "text" : "No, I can't until I hear it."
  },
  {
    "timestamp" : "05:08-05:39",
    "text" : "Well, last episode Steve said that this was the season he started hating. Brett Favre because Brett Favre losing in week 17 was the reason the Patriots didn't make the playoffs. Yeah. Yeah. And I said, no, no, no, no. That's the year he played for the Jets. Right. It turns out it's both years. Really? Yeah. Both the times that the Patriots missed the playoffs in this dynasty were because of Brett Favre's losses in week 17.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Really? Mm-hmm. I knew I hated him for a reason. Oh my god, you're not wrong. Because this is a very formulative year for me where like I love and hate people. Spoiler alert, we had David Gibbons first touchdown pass or catch in this game.",
    "timestamp" : "05:39-05:57"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh yeah, that was hard catch in the NFL ever.",
    "timestamp" : "05:57-06:01"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:02-06:13",
    "text" : "Yep. Touchdown. That was not true. They said that, the commentator said that, but he actually caught a pass before that. Oh, Steve Brown fact checking the fact checkers."
  },
  {
    "text" : "Look at news podcast growing up in front of our.",
    "timestamp" : "06:13-06:16",
    "speaker" : "Andy"
  },
  {
    "text" : "Well, I'm a huge David Givens guy. As you remember, I used to have his jersey. Yeah, he's a sick. Yeah, I loved David Givens. Wow. And again, this season and the ones that followed, and this is a formula year for me. Yeah. Hate Brett Favre, love David Gibbons.",
    "speaker" : "Steve",
    "timestamp" : "06:16-06:36"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:37-07:17",
    "text" : "See, for me, this was like the lost season. I just don't remember any of it. And I was actually talking to um Ryan's story who we had on the other week. And he was saying the same thing. This was he said he missed more games this season than he did than he has for like the rest of the dynasty era combined. Because I invited him on for this one, just uh stat check, just pulling back the kimono. Um, and he said he couldn't go, he couldn't join us, and he remembers The only thing he remembers about this game is that he didn't watch it because he had to go apple picking and that made him angry. So just me reminding him of the"
  },
  {
    "speaker" : "Greg",
    "text" : "What a cuck. That's a cuck move story if you're listening.",
    "timestamp" : "07:20-07:23"
  },
  {
    "text" : "I don't think he is. He doesn't know how to use technology.",
    "speaker" : "Andy",
    "timestamp" : "07:24-07:28"
  },
  {
    "timestamp" : "07:28-07:33",
    "speaker" : "Greg",
    "text" : "Apple picking. That's like classic I'm growing up move. Right."
  },
  {
    "text" : "Well that's a fall Saturday activity.",
    "timestamp" : "07:33-07:35",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:36-07:37",
    "text" : "This is what I'm saying."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "07:37-07:44",
    "text" : "Yeah, but if you're like growing up and like getting in a relationship rather than like blacking out on weekends, you know?"
  },
  {
    "timestamp" : "07:44-08:09",
    "text" : "It may have been that, yeah. So uh when we have them on next. I'm hoping this uh losing streak continues so we can have him on during another patrons loss, because that feels about right. And we'll ask him what his favorite apple orchard is. Yes, exactly. And and who who are David Gibbons or um Granny Smith? Or who? Granny Smith. Granny Smith.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm a red delicious guy. What are you guys?",
    "timestamp" : "08:11-08:14"
  },
  {
    "speaker" : "Andy",
    "text" : "Um a good question.",
    "timestamp" : "08:14-08:16"
  },
  {
    "timestamp" : "08:16-08:18",
    "speaker" : "Steve",
    "text" : "The red delicious is terrible. It's too mealy."
  },
  {
    "speaker" : "Greg",
    "text" : "It's not a great apple. Too mealy. You're just getting ones that aren't the perfect ripeness.",
    "timestamp" : "08:19-08:24"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:25-08:29",
    "text" : "Red delicious are just not good. Soft."
  },
  {
    "speaker" : "Greg",
    "text" : "I like them soft.",
    "timestamp" : "08:29-08:30"
  },
  {
    "text" : "I like uh Macintosh. Uh I like Granny Smith, you know. I don't need a lot of action.",
    "timestamp" : "08:30-08:36",
    "speaker" : "Steve"
  },
  {
    "text" : "But on my honey crisp level. Honey crisps are good. Honey crisps are the tips. Anything anything else is kind of a wrong answer unless you have some like one of those fancy like hybrid ones.",
    "timestamp" : "08:36-08:46",
    "speaker" : "Andy"
  },
  {
    "text" : "I'm gonna be truthful. Red Delicious is the only one that I knew. So that's why I said that. I'm sure it's not my favorite.",
    "speaker" : "Greg",
    "timestamp" : "08:46-08:53"
  },
  {
    "speaker" : "Andy",
    "text" : "Um yeah, no, I've done a bunch of apple picking in my life. But do you know I think um apples actually have more DNA than humans do or something like that? Yeah. Something crazy. I'll give you some DNA, Andy. Open wide here you will. Speaking of Brett Favre, Greg, did you want to talk more about it?",
    "timestamp" : "08:56-09:17"
  },
  {
    "timestamp" : "09:17-09:26",
    "speaker" : "Steve",
    "text" : "Yeah, speaking of opening wide, or just I guess not that wide. Go on, Greg, about his penis. Well and well first hang on."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:26-09:31",
    "text" : "I I want you to tell me about why he lost us the playoffs this year."
  },
  {
    "timestamp" : "09:32-10:04",
    "speaker" : "Greg",
    "text" : "Okay, yeah. So Th we were we were tied well, actually we yeah. We were tied with a record, but the Jets had the tiebreaker going into week seventeen. The Packers are 12 and 3 at the time going into that game. And we're like, oh, it's a pretty good chance. All the Patriots got to take care of business and the one o'clock and then the four o'clock. As long as the Packers beat the Jets, which they should, their favorites. Right. And they just got their doors blown off. It was like 4117 or something like that. Oh."
  },
  {
    "timestamp" : "10:04-10:09",
    "speaker" : "Steve",
    "text" : "Was there anything at stake for the Packers? Like were there any seating at stake for them?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:09-10:20",
    "text" : "Uh I don't think so. I mean they finished first in their division, so it might have been like Yeah, I did a I because I did a quick read of like their Wikipedia and it it"
  },
  {
    "timestamp" : "10:20-10:45",
    "text" : "touched on this but not from a pages standpoint and basically um brett farr was uh favorite to win his fourth mvp award this year But because the Packers lost so badly to the Jets in the season finale, uh, they think that may have swayed voters and Favre lost the MVP award by two votes. To Raiders quarterback Rich Gannon and former Patriots draft pick Rich Gannon.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Interesting. Yeah. But the the 2008 one was worse. So that was the one where he was on the Jets. Yeah, that was definitely the Matt Castle year. And then he went he went they were playing uh the Dolphins in week 17. Sure were Chad Pennington, baby. Chad Pennington who had been cut from the Jets to make room for better off.",
    "timestamp" : "10:45-11:09"
  },
  {
    "timestamp" : "11:10-11:11",
    "speaker" : "Andy",
    "text" : "Yes."
  },
  {
    "timestamp" : "11:11-11:37",
    "speaker" : "Greg",
    "text" : "And then uh it was like 24-17. There's like four minutes left and the the Jets are driving. And Favre obviously throws an interception. Shocking. Jets lose. Patriots are out of the playoffs. Dolphins go through. That I remember. That's the w that's the one I remember too. That's when I was like, come on, Brett, just do it once. And he just It was just such typical Brett Favre that I was so mad at him. I just I feel that I'm not sure."
  },
  {
    "timestamp" : "11:37-11:41",
    "speaker" : "Andy",
    "text" : "I remember being mad having to root for Brett Favre and then him failing me anyway."
  },
  {
    "text" : "Well that's I've just been blacking that out because that's such a like a I hate Rhett Favre, I hate the Jets, but I love the Patriots. And if like the guy I hate and the team I hate win and we get in the playoffs, but like I just must have been short circuited in my brain and just totally forgot that shit.",
    "timestamp" : "11:44-12:00",
    "speaker" : "Steve"
  },
  {
    "text" : "Well your blackout drunk is basically the same thing.",
    "speaker" : "Andy",
    "timestamp" : "12:01-12:04"
  },
  {
    "text" : "Ooh, speaking of blacking out drunk, uh this game was twenty-eight to three in the third quarter.",
    "timestamp" : "12:04-12:10",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "12:12-12:17",
    "text" : "Does that bring back non-memories for you? Uh not the Patriots again.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "This Packers game that we're we watched this week.",
    "timestamp" : "12:18-12:20"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "12:21-12:21",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Um should probably say the score right. What was the final score? 28-10, I think.",
    "timestamp" : "12:22-12:26"
  },
  {
    "timestamp" : "12:27-12:28",
    "speaker" : "Andy",
    "text" : "28-10, yes."
  },
  {
    "timestamp" : "12:28-12:29",
    "text" : "Yeah. Shellacking.",
    "speaker" : "Steve"
  },
  {
    "text" : "The third loss on the trot. Is that right? Yeah.",
    "speaker" : "Greg",
    "timestamp" : "12:29-12:32"
  },
  {
    "speaker" : "Andy",
    "text" : "It's the longest sitting shoot we've had.",
    "timestamp" : "12:33-12:35"
  },
  {
    "text" : "This is in New England, right? Yeah. In their new stadium.",
    "timestamp" : "12:36-12:40",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "12:41-12:51",
    "speaker" : "Andy",
    "text" : "In their all blues, which I thought were sharp. Fantastic. I don't know why they don't wear those more often. Yeah. The the blue the dark blue top and the dark blue pants together."
  },
  {
    "timestamp" : "12:51-13:00",
    "speaker" : "Greg",
    "text" : "Well they're they're going to that this year permanently, right? That's true, yeah, because that was our color rush, wasn't it? Yeah. Do we want to talk about some notable players from this Packers squad?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:00-13:23",
    "text" : "Yeah, yeah. Well, the one last thing I want to talk about, Brett Favre is um there was some karma for him fucking over the Patriots. Um Basically, the Packers made 12 and 4, but still uh went to the wild card against Brett Barr's former team, the Atlanta Falcons, the Landbo Field, and um the Packers lost."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "13:23-13:27",
    "text" : "Well if they're playing the wild card, there probably was something at stake in that game."
  },
  {
    "timestamp" : "13:28-13:35",
    "text" : "Yeah, there must have been then. Either that or the the the whoever was in first place in the division was two games ahead of them.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "No doubt it. They show the lions in like game breaks. And the Vikings.",
    "timestamp" : "13:36-13:40"
  },
  {
    "timestamp" : "13:41-13:47",
    "text" : "Uh was weren't the Vikings like 15-1 this year, wasn't this that year? With Randy Moss and Dante Culpepper? Was that 2002?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "13:47-13:57",
    "speaker" : "Greg",
    "text" : "This isn't the Michael Vick game, is it? Yeah, where Vick went into Lambeau and beat him in Lambeau. I believe it was. It is."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "13:57-13:58"
  },
  {
    "timestamp" : "13:58-14:13",
    "speaker" : "Greg",
    "text" : "The Packers had never lost a home playoff game at Lambeau until my Came to town. I remember thinking watching that game and being like, yo, Mike Vick is the future. He kinda was to a certain degree."
  },
  {
    "speaker" : "Andy",
    "text" : "Until shit happened, yeah.",
    "timestamp" : "14:13-14:15"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. But all right. Well, do you want to finish up on Brett Favre before we move to this the rest of this game?",
    "timestamp" : "14:15-14:22"
  },
  {
    "timestamp" : "14:22-14:24",
    "text" : "Yeah, if you got more on Brett Farr, let's just get on.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:25-14:46",
    "speaker" : "Greg",
    "text" : "Oh, I got I got a lot. Well, give it to me. Uh like statistically Brett Favre is just so interesting. Like his stats over his career. That's true. Because this dude played 17 straight seasons where he started every game. Which is just in its own right like an incredible stat, right? It's true."
  },
  {
    "speaker" : "Steve",
    "text" : "Right. Yeah.",
    "timestamp" : "14:46-14:47"
  },
  {
    "text" : "He played he has the longest streak ever of uh consecutive starts or something like eighteen and a half seasons. Right. Um and just because he played so much in the way he played He has like he has all sorts of records on both ends of the spectrum, right? He's got his career with the most touchdowns, but also the most interceptions ever. by a f like a huge margin to why yeah this is this people talk about records that will never be broken this will never be broken You think so? Okay. His all-time interceptions, he has 336. The guy in second, George Blanda, has 277. Wow.",
    "timestamp" : "14:47-15:36",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "15:36-15:40",
    "speaker" : "Andy",
    "text" : "Um, I have a question for you. How many does Jameis Winston have?"
  },
  {
    "timestamp" : "15:40-15:58",
    "text" : "Yeah. That's a ten years. You have to be good enough to throw that many interceptions, right? Yeah. So that's a good idea. But then you have to be bad enough to throw that many interceptions. So it's like a catch-22. That's why it'll never be broken.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "So I agree. But Jameis Winston just went 30 and 30. Which I feel like is is what you have to do to be able to Yeah, but yeah, did that for ten years.",
    "timestamp" : "16:00-16:12"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "16:13-16:27",
    "text" : "Yes. And now he's a backup. Yeah, that's Greg's point. He's not even starting anymore. Everyone's like, you threw 30 interceptions, ride the goddamn pine. Mm-hmm. So like, hey, uh, I know you're just a gunslinger. You know, you're just out there making plays. I get it."
  },
  {
    "timestamp" : "16:27-16:32",
    "speaker" : "Andy",
    "text" : "He just got LASIK, so I mean maybe he'll throw less than thirty this year, you know?"
  },
  {
    "timestamp" : "16:32-16:35",
    "text" : "For real, but how many does James have in how many seasons?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:35-16:38",
    "text" : "He has eighty-eight over two uh over"
  },
  {
    "speaker" : "Steve",
    "text" : "It's like four or five. He's never gonna make it. Never. Not that pace. Yeah, exactly. Greg's right. That's an incredible record. Even I mean, they are passing more now. But I feel like the interception rate is a very important thing.",
    "timestamp" : "16:39-16:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly. Yeah.",
    "timestamp" : "16:56-16:57"
  },
  {
    "text" : "You want to hear some other notable names on this list? Yes. Peyton Manning is ninth with 251. Eli Manning, 12th with 244, and all the way down at number 41 is Tom Brady.",
    "speaker" : "Greg",
    "timestamp" : "16:58-17:15"
  },
  {
    "timestamp" : "17:15-17:24",
    "speaker" : "Steve",
    "text" : "Wow. Jesus Christ. And he threw up. Ton of interceptions this game and this season. He's been turning the ball over like crazy."
  },
  {
    "speaker" : "Andy",
    "text" : "It's true, but um And I only know this because I was looking it up today, but how many what's the most interceptions in a season you think Tom Brady's ever thrown?",
    "timestamp" : "17:25-17:34"
  },
  {
    "timestamp" : "17:34-17:35",
    "text" : "Probably this one.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "17:35-17:38",
    "speaker" : "Andy",
    "text" : "Thirteen? Fifteen?"
  },
  {
    "text" : "Jesus.",
    "speaker" : "Steve",
    "timestamp" : "17:38-17:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:41-17:53",
    "text" : "You guys are uh big Brady fans apparently. What is it? It's it's more than that. 20? The most interception he has ever thrown in a season is 16."
  },
  {
    "timestamp" : "17:53-18:43",
    "speaker" : "Greg",
    "text" : "16. I said. Oh, well, that's a perfect stat, actually. Because I have this written down. This is funny. Um in those 17 seasons with 16 starts in each season, 11 of those he averaged more than an interception a game. So 16 plus. Yes. He had 29 interceptions in 2005. Wow. In 1993, he made the Pro Bowl with 19 touchdowns and 24 picks. Why did you make the Pro Bowl? What the hell? What? He has the most ever pick sixes with 31 and he also has the most career fumbles. with 166. He's just a turnover machine."
  },
  {
    "timestamp" : "18:43-18:47",
    "text" : "So his combined turnovers are like over 500? Yep.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "He has almost exactly as many touchdowns as he did turnovers, I think. He had like 508 touchdowns and like 502 turnovers.",
    "timestamp" : "18:47-18:55"
  },
  {
    "speaker" : "Steve",
    "text" : "Good lord. That's insanity. Yeah.",
    "timestamp" : "18:56-18:58"
  },
  {
    "speaker" : "Greg",
    "text" : "So another interesting thing I looked into was like how he was faring coming into this game. So I looked at his playoffs from the previous year. Oh yeah. He threw seven interceptions in two games.",
    "timestamp" : "18:59-19:14"
  },
  {
    "text" : "Oh, good lord.",
    "timestamp" : "19:15-19:17",
    "speaker" : "Andy"
  },
  {
    "text" : "And a divisional against the Rams, he threw six picks. Whoa!",
    "speaker" : "Greg",
    "timestamp" : "19:17-19:21"
  },
  {
    "speaker" : "Andy",
    "text" : "The Rams D wasn't that good either. Oh, that's right. That was the season before. I think we actually touched on that briefly.",
    "timestamp" : "19:22-19:28"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:28-19:29",
    "text" : "Oh I'm telling you."
  },
  {
    "speaker" : "Andy",
    "text" : "Defense was was so highly rated coming into the Super Bowl last year.",
    "timestamp" : "19:31-19:34"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, he didn't throw a single pick or fumble it against us in this game. He threw three touchdowns on like 170 yards throwing.",
    "timestamp" : "19:35-19:41"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, both him and Brady had like almost exactly the same amount of passing yards, but Brady had three picks and no touchdowns and",
    "timestamp" : "19:41-19:49"
  },
  {
    "timestamp" : "19:49-20:01",
    "speaker" : "Greg",
    "text" : "Farve has well that's the thing, Fav used to win, you know? Like I I wanna say you only had like one losing season. At least up to a certain point in Green Bay. That's a statue."
  },
  {
    "timestamp" : "20:02-20:06",
    "text" : "He did not have no he had one losing season. He was four and twelve in two thousand five.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "20:07-20:11",
    "speaker" : "Greg",
    "text" : "Yeah, so I mean he was a successful like winning quarterback. So I mean I guess."
  },
  {
    "text" : "The only other losing season was with Minnesota in twenty ten, and he was five and eight.",
    "timestamp" : "20:11-20:15",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "20:16-20:23",
    "speaker" : "Greg",
    "text" : "And that was his last season, right? I think so, yeah. His first season in Minnesota was incredible."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "20:23-20:24",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "20:25-20:28",
    "text" : "And he was also like a tough son of a bitch too.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "20:29-20:34",
    "text" : "I'll give him that. I hate him, but you gotta respect that starting streak, and he was a tough son of a bitch.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that game when he was on the Jets that he lost to the Dolphins. He was playing that game with a torn biceps in his throwing arm. Whoa. What? Yes.",
    "timestamp" : "20:34-20:45"
  },
  {
    "text" : "How is that a thing? I don't know. I don't know. I mean, to be fair, I actually, and I'll I'll see if I can remember to link this in the um in the show notes, but when they came back from commercial one of these, there was um a video of some like trainer or something giving Brett Favre something out of like a little little those little punch pads. No, that was definitely some sort of painkiller.",
    "speaker" : "Andy",
    "timestamp" : "20:46-21:15"
  },
  {
    "speaker" : "Greg",
    "text" : "Was this before he went to rehab for that? Pretty sure it went to. Went to rehab? Yeah, he got addicted to painkillers and went to re Yeah.",
    "timestamp" : "21:16-21:25"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:25-21:41",
    "text" : "So and but they literally like they they were just showing him on the sidelines like he just scored a touchdown or something. So they were coming back from commercial and still like the VW commercial like thing over it, you know, when they come back and they're just showing like shots of the stadium and stuff and they're showing some trainer or something giving him some sort of bank"
  },
  {
    "text" : "Fuck yeah. So he goes to rehab addicted to painkillers and comes out addicted to real comfortable genes.",
    "timestamp" : "21:42-21:50",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "21:50-21:51",
    "text" : "Range.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Addicted. It never takes the pain away. I've been saying that all week. Oh gosh. Because you can change it, you know, you can do whatever you want.",
    "timestamp" : "21:53-22:02"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "22:02-22:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "22:03-22:07",
    "text" : "Like Steve Brown. Real slapable face."
  },
  {
    "timestamp" : "22:10-22:13",
    "speaker" : "Steve",
    "text" : "I feel like you're just substituting my name for your wife."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I feel like I feel like Kelly's heard this before.",
    "timestamp" : "22:14-22:17"
  },
  {
    "text" : "Well hers is slappable butt cheeks. But yeah, it does follow a similar vein.",
    "timestamp" : "22:17-22:22",
    "speaker" : "Greg"
  },
  {
    "text" : "It does, doesn't it? Oh good lord. But Brett's like I I love Brett Favre. He annoyed me. He's just a he's just a regular dude. I'm with no with Steve. There's something about him that just and I think I don't know exactly what it is, but I when I was watching this game, I had this similar feeling to watching whenever the Patriots would play Eli Manning. I just felt like he wasn't beating you because he's Brett fucking Farman. Like he's not I don't know. There was something about him he's just like he it doesn't look like he's actually very good, but he's just getting lucky And the Patriots are beating themselves and like it it just didn't feel I don't know.",
    "timestamp" : "22:23-23:05",
    "speaker" : "Andy"
  },
  {
    "text" : "It it it didn't feel as a person as a person, not a player.",
    "timestamp" : "23:05-23:08",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "23:08-23:16",
    "speaker" : "Andy",
    "text" : "Well, I mean you've always had a uh a soft spot for people to send dick pics, so I can understand why you enjoy him. He does."
  },
  {
    "timestamp" : "23:16-23:28",
    "speaker" : "Greg",
    "text" : "I'm just saying hanging out with Brett Favre would probably be awesome. Like as a teammate, I bet he's the best. He's just fucking around all the time. He doesn't take himself too seriously. He just has a cannon for an arm."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "23:28-23:46",
    "text" : "He's just out there having fun, you know, backyard football. He is. That's why that's a big part of why I hate Brett Favre. Is how much of his medium sized dick, all the commentators suck. He never does any wrong, you know? That's true actually."
  },
  {
    "speaker" : "Greg",
    "text" : "I remember like Thinking I dislike them and I'm pretty sure it's because of the whole like retirement, will he retire, will he not? Oh yeah. And that was because like ESPN caught covered it ad nauseum. Yeah.",
    "timestamp" : "23:47-23:59"
  },
  {
    "timestamp" : "23:59-24:46",
    "text" : "I th yeah, I think I think Steven, you I think you're touching on on kind of what I'm feeling is I feel like he Just kind of like didn't play football almost correctly. I don't think that's the right word, but it's the closest one I can think of right now. He's backp every every completion he made, he was backpedaling away from somebody and just like hocking it up to triple coverage and it just fucking works for some reason. And that's how I always felt that that Eli Manning was. It's just like first down he would uh almost throw an interception, second down he would sail at six yards over his attempted receiver, and the third down he would just hook up a Hail Mary and it would connect for some reason. And then they keep doing it again and rinse and repeat, and that's all it was.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "24:46-25:18",
    "text" : "I no, I feel Eli is in a whole different class for me. It was not only because Eli sucks, right? I mean, even touchdowns to interceptions, he's at 50-50. At least Brett Farr if you have to add in the fumbles to get to one-to-one. I don't know. Brett Favre and like Peyton Manning are on a similar level to me. Like, you know, you kind of hate them. You know they're good. No, I've come around. Big Manning's like legitimately good. Brett Favre's like ah shucks good.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "25:19-25:24",
    "text" : "So maybe Brett Favre is the middle brother that the Mannings never had. Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "25:24-25:27",
    "text" : "Imagine if a Redfire was Cooper Manning."
  },
  {
    "timestamp" : "25:27-25:35",
    "text" : "Cooper. That's the that's what I was thinking of. Isn't he the younger brother? Uh maybe actually. I don't care. It's the we're talking about the Mannings here.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "25:35-25:44",
    "text" : "Just wait till uh fucking Peyton's son gets here. Oh god. Apparently he's like the number one quarterback in like middle school."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, didn't you name him Archie as well or something?",
    "timestamp" : "25:45-25:48"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "25:48-25:48",
    "text" : "Maybe."
  },
  {
    "timestamp" : "25:50-25:59",
    "text" : "All right. That's enough about Brett Favre. This is not a Brett Favre podcast. This is a Pages podcast. So let's let's talk about some other Packers.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:59-26:01",
    "text" : "Speaking of Patriots.",
    "speaker" : "Mom"
  },
  {
    "text" : "Um The Pro Bowlers on this team, Brett Favre, of course, because he threw as many touchdowns as he did in receptions this year. Stat check? Is that right? 2002? Why is that not working?",
    "timestamp" : "26:01-26:14",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, come on stats, guy. Let's go. This is stats over storylines.",
    "speaker" : "Steve",
    "timestamp" : "26:15-26:18"
  },
  {
    "text" : "27 touchdowns, 16 interceptions. One of the few years you threw more. Uh touchdowns and interception. So he made the Pro Bowl. He made the Pro Bowl 01, 02,03. So this was kind of his peak. He also had a peak in 95, 96, 97. Yeah. Yeah. And his third peak was 07-0809, which he also made the play the uh Pro Bowl. With three different teams.",
    "speaker" : "Andy",
    "timestamp" : "26:19-26:39"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I mean he's he's had two different peaks. Like I mean like Brady's had two careers, you could say. Bret Farr, same idea.",
    "timestamp" : "26:39-26:45"
  },
  {
    "speaker" : "Andy",
    "text" : "In technically he's had three because he had 95, 96, 97. He made the Pro Bowl and was all pro. And then 01-02-03 made the Pro Bowl. And then 07-08-09, he made the Pro Bowl for the Packers, the Jets, and the Vikings. It's pretty impressive.",
    "timestamp" : "26:45-27:00"
  },
  {
    "text" : "It's also like a weird parallel between Brett Favre and Aaron Rodgers and Tom Brady and Jimmy G. Where they diverge, where Pat's just traded away the young quarterback and the pack made the switch. That's true. Because Brett Farve he like he was not uh he didn't leave and was washed up. He Played well.",
    "speaker" : "Steve",
    "timestamp" : "27:00-27:21"
  },
  {
    "speaker" : "Andy",
    "text" : "It's true. He kept going.",
    "timestamp" : "27:21-27:22"
  },
  {
    "timestamp" : "27:22-27:38",
    "text" : "So maybe we'll see if that happens with uh Brady and uh Stidum. Well at this point it's done, right? They kicked away Jimmy G and Jimmy G did pretty well. But I wonder what would happen if Aaron Rodgers had been traded away for a second round pick. Well it might have.",
    "speaker" : "Steve"
  },
  {
    "text" : "Which is like the same situation as Rogers and Favre. Yeah, that's different. Imagine being like a Lions fan though. Oh.",
    "timestamp" : "27:42-27:51",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh, whenever we get, I have a real hardcore, really good friend Lions fan. And I I texted him because in this game we were watching they had game breaks. And um they must have they picked Joey Harrington in the first round this year, I think. And they brought him in the week before and he had won. And then like game break right in the first quarter, like Joey Harrington throws a touchdown, lines are up to 7-0. And then another game break, like a couple of 14-0. Yeah. And then right at the very end, I don't know if you saw this, this is this is a second to last note. Besides, when they're calling out the tech crew, you know it's a blowout. Yep. They cut to it as twenty-four twenty-four and then sort of running the ball in with no time left. The lion finish the block. Oh. I'm keeping the lions right up there with the Browns with like, oh man.",
    "speaker" : "Steve",
    "timestamp" : "27:52-28:44"
  },
  {
    "timestamp" : "28:44-29:03",
    "speaker" : "Greg",
    "text" : "And Favre dominated the Lions. I'm pretty sure like the Lions never won in those 17 seasons at Lambeau. I think it's something like that. And then they just go right to Brett Favre or uh Aaron Rodgers. And then the f remember the Hail Mary. It's just Oh god, yeah."
  },
  {
    "text" : "That's what the bills are gonna be this year. Yeah. So other Pro Bowlers on this this uh Packers team. Um running back Amon Green, what I've forgotten about, but do is a good runner. Also wide receiver Donald Driver, tight end Bubba Franks, great name, Bubba Franks. I feel like he should have his own uh hot dog company, but alas that is not the case. Guard Marco Rivera and Free Safety Darren Sharper. Oh, the hottest hitting safety in the league, dude. Exactly. Uh uh in in more ways than one we found out. Oh. Yeah. Careful. Um so I'd roll the offensive and defensive stars, but you just heard them. They're all the guys that that made the uh Pro Bowl except for defensive and Anybody want to tackle this name? Yep. Kabir Gabaha Biyamila.",
    "timestamp" : "29:04-29:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Muhammad Kabir Ola Rawaja Gabah Biyamala. Nicely done. I love Gabaha Bimala. I had his jersey.",
    "timestamp" : "29:57-30:09"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:09-30:16",
    "text" : "What did just f just because of his name, yeah. From that place in uh Lawrence that we would go and get the jerseys. Oh yeah. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "He's a legend. Yeah, he was a monster too. You guys want to guess what country he's from?",
    "timestamp" : "30:16-30:22"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:22-30:23",
    "text" : "No."
  },
  {
    "speaker" : "Greg",
    "text" : "Steve.",
    "timestamp" : "30:23-30:24"
  },
  {
    "timestamp" : "30:25-30:29",
    "speaker" : "Andy",
    "text" : "Uh not not in this climate, I don't. Yeah. Ivory Coast."
  },
  {
    "timestamp" : "30:30-30:38",
    "text" : "The United States, you dickhead. He was born in LA. Yeah, it's a nice setup.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, got you good. Two parents of I don't know.",
    "timestamp" : "30:39-30:44",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "30:45-30:54",
    "text" : "Um the other player of note on this team, I don't know if you noticed, was uh backup quarterback Doug Peterson.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "30:54-30:56",
    "text" : "Yes, I had written that down."
  },
  {
    "text" : "Yes, that that Doug Peterson who was um a very mediocre quarterback in the NFL and was the backup to Brett Farrev this year. Did not see the field even once.",
    "speaker" : "Andy",
    "timestamp" : "30:56-31:08"
  },
  {
    "timestamp" : "31:08-31:11",
    "text" : "What do you think of him as a coach, Andy?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I think he's pretty good. Anybody who's anybody who's not scared of Bill Belichick, I think you have to give props. And I think the way he coached that Super Bowl, he showed he wasn't.",
    "timestamp" : "31:12-31:21"
  },
  {
    "text" : "I think maybe the first time you've like complimented a coach other than Bill Belichick. Give me another coach who I should have complimented. Andy Reid.",
    "timestamp" : "31:22-31:30",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I love Andy Reed. I don't think we've ever talked about him though. Mike Tomlin. I don't like Mike Tomlin. I think he's overrated.",
    "timestamp" : "31:31-31:39"
  },
  {
    "text" : "I like Tomlin. I don't think he's as good as on Tomlin. I think we we talked about this with Steve, but his ability to keep the lid on Antonio Brown for like three or four years.",
    "timestamp" : "31:40-31:56",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, no, that's fair.",
    "speaker" : "Andy",
    "timestamp" : "31:56-31:57"
  },
  {
    "text" : "What a master class in coaching because as soon as he's gone, it's just like boom, you know. It wasn't overnight.",
    "timestamp" : "31:58-32:05",
    "speaker" : "Steve"
  },
  {
    "text" : "Even Big Ben, he's like kind of a dickhead too.",
    "timestamp" : "32:05-32:08",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, there's a lot of big. I mean, I bet Juju Smith's Suster is the same way. He seems crazy as well. No, he's lovely. Yeah. That my calm one wants you to believe. Indeed.",
    "timestamp" : "32:08-32:21"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh ye Alright, so do we want to actually talk about this game? Yeah, I guess.",
    "timestamp" : "32:22-32:27"
  },
  {
    "timestamp" : "32:27-32:34",
    "text" : "Actually, yeah, well this is usually where we give the Well you skipped over one important player. Terry Glenn.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "32:34-32:35",
    "speaker" : "Steve",
    "text" : "Oh right."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh. All right. Yeah, I was gonna bring him up later, but that's fine. Let's uh we can talk about Terry Glenn.",
    "timestamp" : "32:35-32:41"
  },
  {
    "timestamp" : "32:42-32:45",
    "speaker" : "Steve",
    "text" : "Announcers did all goddamn game. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "And the uh they weren't the only one to notice him. The crowd would boo him.",
    "timestamp" : "32:45-32:49"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "32:51-33:00",
    "text" : "voraciously every time his name was announced over the Yes but did you notice the booze for Glenn weren't as voracious as the cheers for Troy Brown?"
  },
  {
    "text" : "Oh god yeah. Yeah, because this is Troy Brown's first game back from injury since probably the losing sea streak started.",
    "speaker" : "Andy",
    "timestamp" : "33:01-33:08"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "33:08-33:08"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:09-33:12",
    "text" : "Right? Because the last time we saw him, he was still winning."
  },
  {
    "text" : "Yeah, he got hurt in that uh remember he had those like the first three quarters where he had like 15 catches and was absolutely crushing everybody and yeah. Yeah. Yeah, yeah. Super frustrating for him to get hurt in that game. And uh and he was back and everyone was loving him.",
    "speaker" : "Steve",
    "timestamp" : "33:13-33:26"
  },
  {
    "timestamp" : "33:26-33:36",
    "text" : "Yes. And uh but he wasn't like fully back, I don't think, because he wasn't returning punts. Kevin Paul. Yeah, I noticed that too. Who did okay, but he wasn't he wasn't a Troy Brown.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:37-33:41",
    "text" : "No. Troy Brown might be the best punt return we've ever had.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "33:43-33:56",
    "speaker" : "Andy",
    "text" : "I mean Elman was up there for a while. I think it was put in there. In terms of um punt returning, Dave Mega was good in terms of being a a decent human being. I'd probably give that to uh Troy Brown."
  },
  {
    "text" : "Crow Brown's an absolute stern example of humanity.",
    "speaker" : "Steve",
    "timestamp" : "33:57-34:01"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:01-34:20",
    "text" : "Yeah. And also um Dave Megat's hit that bar real fucking low. Don't mention heroes, right, Craig? Yeah. Pretty sure there's a blog about that somewhere. Oh dude, it's it's horrific. Shit he did. Yeah, he was uh not a great dude."
  },
  {
    "timestamp" : "34:20-34:28",
    "speaker" : "Greg",
    "text" : "Who's who's wor actually who's who's a better person? This here's a setup for failure. Oh Darren Sharper or Dave Megat. Oh boy."
  },
  {
    "speaker" : "Andy",
    "text" : "Um Well, is Darren Sharper in jail? Yes. Then I'd say Dave Meggett 'cause he isn't? I don't know. Wait, Dave Meggett's not in jail. I didn't think so.",
    "timestamp" : "34:29-34:41"
  },
  {
    "text" : "He has to be. You tell me. Statick. Alright, I'm gonna stat check that. If he's out of jail, I'm starting to fucking change. org.",
    "timestamp" : "34:41-34:49",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "34:50-35:38",
    "speaker" : "Andy",
    "text" : "Alright, well he does that, Steve. You wanna talk about the escape a little bit? I guess. This was I think the game was uh it's one of those games that happens every once in a while these days, but Yeah. It's been happening the last three games here where the page is a very uncharacteristically Sloppy. Turning the ball over and getting a lot of penalties. So in this game, I lost the turnover. Yeah, exactly. So uh and it just kills drives and it's probably what you know Browns fans are used to. Like, yeah, obviously we we know how this goes, but that's a great computer. We're used to the turn of the battle. Zero to four in this game. And they had twelve penalties for 126 yards."
  },
  {
    "text" : "And one of those turnovers was like a screen that just Kevin Falk dropped and everyone stood around and watched the LBC and pick out.",
    "speaker" : "Steve",
    "timestamp" : "35:38-35:45"
  },
  {
    "text" : "That's exactly where I was headed. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "35:45-35:50"
  },
  {
    "timestamp" : "35:50-36:02",
    "speaker" : "Steve",
    "text" : "A questionable play and all the pacers stopped except for like Richard Seymour on like their field goal, getting a hands-the-face penalty, giving them a first down, and the Chase scored a touchdown. Which then they wanted to score a touchdown, yeah."
  },
  {
    "text" : "Yeah. They gave a ton of rushing yards too, right?",
    "speaker" : "Greg",
    "timestamp" : "36:02-36:05"
  },
  {
    "timestamp" : "36:05-36:09",
    "speaker" : "Steve",
    "text" : "But that was like again, I thought they like they played pretty well early."
  },
  {
    "text" : "Yeah, it was 36 for 158, but um one.",
    "timestamp" : "36:09-36:12",
    "speaker" : "Andy"
  },
  {
    "text" : "Like the first quarter was zero zero. Yeah. They got their first score three nothing. Then that I think it was that dumb you know, it would have been three three, but then it was seven three and then there was that I think the screen pass and it was fourteen three and then just kind of snowballed from there and they couldn't like write the ship. But I think like That's like a epitome of the Patriots before 2001, right?",
    "timestamp" : "36:12-36:37",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I think yeah.",
    "timestamp" : "36:37-36:38"
  },
  {
    "timestamp" : "36:38-36:52",
    "speaker" : "Steve",
    "text" : "It was just I bet everyone watching that game then are like, oh, here we go. You know, this is just Yeah, last game lost the last couple games or on a losing streak here and because the UH commentators were were touching on it and they"
  },
  {
    "timestamp" : "36:52-36:53",
    "text" : "They showed a stell.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Let me see if I took a uh like Brady was forcing picks, you know, does a lot of bad decisions on his part. He just like look like I have a note. If he played like this last year, You know, they wouldn't have gone a Super Bowl, he probably wouldn't have started a second year, they would have gone back to Drew Bledsoe. Like Right. He these last couple of games he's made a bunch of just boneheaded decisions. Like, what are you doing, dude?",
    "timestamp" : "36:53-37:14"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:14-37:16",
    "text" : "Yeah. And and actually speaking of that"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh make your uh time warp noise.",
    "timestamp" : "37:17-37:21"
  },
  {
    "timestamp" : "37:22-37:23",
    "speaker" : "Andy",
    "text" : "Well you want an update?"
  },
  {
    "text" : "Dave Megat is in jail. Oh he is okay until the year 2040.",
    "speaker" : "Greg",
    "timestamp" : "37:23-37:28"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh good. And what about um What's his face? Sharper?",
    "timestamp" : "37:29-37:33"
  },
  {
    "speaker" : "Mom",
    "text" : "Yeah.",
    "timestamp" : "37:33-37:34"
  },
  {
    "timestamp" : "37:34-38:15",
    "speaker" : "Greg",
    "text" : "They said he got I think it was like 2012 or 13, something like that. He only got twenty years. Even though he like There's up to like 16 women that have said he's sexually assaulted him. Good lord. In four states. He was like he's like a legitimate psychopath. Yeah. Yeah, I think that's a good thing. Because all the stories are the exactly the same and he like drugs them and then rapes them. It's fucking horrific. Cool. I like from bringing that down. So who do you who do you think is a better person? Um Brett Favre."
  },
  {
    "text" : "Because all he did was show his dick to people.",
    "timestamp" : "38:17-38:19",
    "speaker" : "Andy"
  },
  {
    "text" : "Now Brev Favre doesn't seem like such an asshole, does he?",
    "speaker" : "Greg",
    "timestamp" : "38:19-38:22"
  },
  {
    "timestamp" : "38:24-38:30",
    "speaker" : "Steve",
    "text" : "I do feel like that was swept under the rug a little bit, like ah, you know, just a gunslinger shooting his shot."
  },
  {
    "text" : "If it's an unsolicited dick pic, like Pales in comparison to sixteen rapes in four states.",
    "timestamp" : "38:31-38:39",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "38:39-38:40",
    "speaker" : "Andy",
    "text" : "It does."
  },
  {
    "timestamp" : "38:43-38:48",
    "text" : "But let's not let's not encourage unsolicited dick pics to our fans.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "38:48-38:49",
    "text" : "No, no.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "38:49-38:51",
    "speaker" : "Greg",
    "text" : "Solicited dick pics, yes. Yes."
  },
  {
    "speaker" : "Andy",
    "text" : "So if you want to send Greg any, you just give out your phone number at the end of this?",
    "timestamp" : "38:52-38:57"
  },
  {
    "timestamp" : "38:57-39:00",
    "speaker" : "Greg",
    "text" : "Well Greg has a blanket solicit."
  },
  {
    "timestamp" : "39:00-39:03",
    "speaker" : "Andy",
    "text" : "Yeah, he's just he's open. If you want to text Greg any pictures."
  },
  {
    "timestamp" : "39:03-39:08",
    "speaker" : "Greg",
    "text" : "Well, do you want to hear my theory on this? On sending dick pics? No, I want to hear your cell phone."
  },
  {
    "speaker" : "Steve",
    "text" : "Of course I do.",
    "timestamp" : "39:08-39:09"
  },
  {
    "timestamp" : "39:10-39:36",
    "text" : "So the key is, right, you have to do something like slightly humorous so that if it ever sees the light of day That you can be like, all right, that's that's just funny too, right? So like what I would do is like take a picture facing down and be like, yo, check out my new shoes, but then just my penises in the corner, you know? Plausible deniability.",
    "speaker" : "Greg"
  },
  {
    "text" : "Or like a reflection of like your TV, but it's not on. Yes, exactly. Something like I'll just try to sell my TV. Yeah. Which I think is actually half metaphor. Um But where where were we going with this? Uh we were talking about Uh Tom Brady and how badly he's played. Yes. And um the commentators were actually talking about this.",
    "speaker" : "Andy",
    "timestamp" : "39:37-40:01"
  },
  {
    "timestamp" : "40:01-40:39",
    "text" : "He's he he he he had it as good as it could be right from the beginning. Do you think that he is the kind of guy though that you can put everything on his back the way they've done during the course of this season, ask him to throw the ball 40-50 times and do it No, I mean John Elway really was not John Elway until Drell Davis came along. Um even Brad Farr, you know, until he ended up with Amon Green on this team, it was difficult for him to get it going a little bit. I just don't believe in that one-sided approach that we've seen so far from the Patriots. I know they've had trouble running the ball, but I don't think that's the right approach for this thing.",
    "speaker" : "Speaker 5"
  },
  {
    "timestamp" : "40:41-40:47",
    "speaker" : "Steve",
    "text" : "First of all, that bading b-da-ding with the scores in the bottom. That's nostalgia."
  },
  {
    "timestamp" : "40:47-41:03",
    "text" : "That made me brought back memories, didn't it? Yeah, it's you know the beginning of my romance with uh Chris Collinsworth. Why do you do not like Chris Collinsworth? Do you like Chris Collinsworth? Not a big fan of Chris Collinsworth. Oh my god. I like Chris. I don't know anybody who is though. Heat everybody.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, me and Greg, this two people right there, your brothers.",
    "timestamp" : "41:03-41:06"
  },
  {
    "timestamp" : "41:06-41:11",
    "text" : "Yeah, I can't stand either of you. I can't believe we should be doing this. I like I think Collinsworth's great.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "41:11-41:24",
    "text" : "You fucking I think he's I think he's good, not great, but he but I like him, he'll call people out. Yeah. Like Gruden, Mr. Super Duper Positive. Aikman can barely get to a sentence.",
    "speaker" : "Steve"
  },
  {
    "text" : "Well Aikman's just so boring too. He doesn't he doesn't ever have like A thought of his own, you know? At least collins where it's like I mean that and that's a valid point he's brought up there too, right?",
    "speaker" : "Greg",
    "timestamp" : "41:25-41:35"
  },
  {
    "text" : "Yeah, especially for two thousand and two Bit of a cold take at this point now, isn't it? But yeah.",
    "timestamp" : "41:35-41:39",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "41:40-41:55",
    "text" : "Yeah, but it at the point of time, and it's a fair point. The Patriots have been on a big losing streak. They they open the season with three games where they're throwing the ball everywhere and spending people out and everyone's like, whoa, what is this? And then they go to like 13, 10 and 10 points, you know?"
  },
  {
    "text" : "Yeah. And you win the previous season on playing like a defensive game with a good rushing attack. And now they've like kind of switched it this year where they're trying to throw the ball all around the place and they're not doing as well. That's a completely valid point for him to make. I mean he's wrong.",
    "speaker" : "Greg",
    "timestamp" : "41:55-42:09"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "42:12-42:19",
    "text" : "We've had these conversations before where it was weird though hearing Aikman and Collinsworth together in the same booth."
  },
  {
    "timestamp" : "42:19-42:22",
    "text" : "And Dick Stockton. Those three of them in the booth.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Which if you caught at the very end, if you watch all the way through this whole game to the last couple of seconds. Which I did.",
    "timestamp" : "42:22-42:30"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "42:30-42:32",
    "text" : "Spoiler alert, Steve. I did not."
  },
  {
    "speaker" : "Steve",
    "text" : "The only reason Dick Stockton is in there is because Joe Buck is doing the uh NLCS playoff games.",
    "timestamp" : "42:34-42:41"
  },
  {
    "text" : "He was supposed to be a part of this?",
    "timestamp" : "42:42-42:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "42:44-42:48",
    "speaker" : "Steve",
    "text" : "Yeah, always you it was still Buck and Aikman. It would have been Buck, Aikman, and Collinsworth."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, fucking kill me. I'm glad it wasn't.",
    "timestamp" : "42:48-42:50"
  },
  {
    "timestamp" : "42:51-42:53",
    "speaker" : "Steve",
    "text" : "Yeah, I think Nick Stockman was pretty good, actually, I thought"
  },
  {
    "timestamp" : "42:53-42:55",
    "speaker" : "Andy",
    "text" : "Yeah, Dick Stockton was the saving grace of this."
  },
  {
    "speaker" : "Steve",
    "text" : "Way better than fucking Joe Buck.",
    "timestamp" : "42:56-42:59"
  },
  {
    "text" : "Greg, what's your thought about Joe Buck? You love him too?",
    "timestamp" : "42:59-43:01",
    "speaker" : "Andy"
  },
  {
    "text" : "No, I don't love him. He's he's a little bit better. Like the I've heard like interviews with him not in the booth and he said he's like self-aware, which makes me hear him less. But he is he it sounds like I don't like the commentators that try and like be intentionally dry. Like summer all. Summer all is to me the worst.",
    "timestamp" : "43:03-43:22",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "We talked about this in the Super Bowl episode where it's like that was like I guess a thing back then to be like non-emotional.",
    "timestamp" : "43:22-43:28"
  },
  {
    "text" : "Right.",
    "timestamp" : "43:29-43:29",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "43:29-43:29"
  },
  {
    "text" : "I don't I don't like that. Like give me some juice.",
    "timestamp" : "43:30-43:31",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "43:31-43:32",
    "speaker" : "Steve",
    "text" : "I hate that too."
  },
  {
    "speaker" : "Greg",
    "text" : "Give me some juice.",
    "timestamp" : "43:32-43:33"
  },
  {
    "text" : "And Tony Romo has gone in the exact opposite direction where he's almost too much involved.",
    "timestamp" : "43:35-43:40",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Mom",
    "text" : "Like, ooh, I don't know.",
    "timestamp" : "43:40-43:42"
  },
  {
    "text" : "I like it. I love it.",
    "timestamp" : "43:42-43:44",
    "speaker" : "Steve"
  },
  {
    "text" : "But like, because they're all thinking this feeling the same way. So Greg, if that if that pissed you off, uh, I bet you don't want to hear my uh Thoughts on the referees in this game.",
    "timestamp" : "43:44-43:54",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:54-44:00",
    "speaker" : "Greg",
    "text" : "Well, let's hear it. Uh there Well you want me to you want me to just do it for you?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, go ahead. Oh, the referees were just absolutely reprehensible.",
    "timestamp" : "44:00-44:05"
  },
  {
    "timestamp" : "44:06-44:08",
    "speaker" : "Steve",
    "text" : "No, it's too big of a word for any."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:12-44:36",
    "text" : "All right, go ahead, Andy. Tell me what your thoughts are. The referees, I think, learned a new trick in this game, and that was uh pass interference. They they must have read that recently in referee monthly or something and what it was because they were calling it almost on every deep ball and I don't even think they would have been called in today's NFL, but they were calling pass inference on fucking anything."
  },
  {
    "timestamp" : "44:36-44:48",
    "text" : "They were it wasn't it was a lot of yeah on the Packers like for the Packers at least I thought that as well was a little one-sided and and very tikky-tacky. Even Collinsworth was calling it out too though.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:48-45:02",
    "text" : "That's why I like Collinsworth. He's like, on both sides. But yeah, I think the the Packers ended up probably with more pass interference calls. overall, but like all the ones they call, like none of them were actually legitimately pass interference.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:03-45:12",
    "speaker" : "Steve",
    "text" : "There were there was one awful review too. It was like a third down where like he went out, Donald Driver caught the ball. And kind of fumbled it out of bounds."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:12-45:18",
    "text" : "Yeah, and didn't have complete control over the called it incomplete on the field and then they overturned it for some reason, which was"
  },
  {
    "timestamp" : "45:20-45:29",
    "speaker" : "Steve",
    "text" : "Yeah, but again, I watched she's live or I watched she's on Plex and I there's that 30 second skip button. It was 10. It was three minutes of just"
  },
  {
    "text" : "Just guess watching the same play over and over again in slow mo. Oh, well that see that I call's worth getting it wrong.",
    "speaker" : "Andy",
    "timestamp" : "45:30-45:36"
  },
  {
    "text" : "I can agree with like process related things, right? If you're like, oh the review process blows, that needs to be fixed. But to just be like, oh, these refs suck, like They're humans, you know? I didn't talk about new thing in life you or I could not do a better job.",
    "timestamp" : "45:37-45:55",
    "speaker" : "Greg"
  },
  {
    "text" : "Well I could. I've done it.",
    "speaker" : "Andy",
    "timestamp" : "45:55-45:57"
  },
  {
    "text" : "And you keep part of this game. He put his game was when Tylaw got hurt and Ben Kelly came in. Yes. Yeah, who remembers Ben Kelly?",
    "timestamp" : "45:57-46:07",
    "speaker" : "Steve"
  },
  {
    "text" : "I do from last season because I had a note in two games because he was returning kicks. And the note was, who the fuck is Ben Kelly? This is my first time hearing Ben Kelly in my life.",
    "speaker" : "Andy",
    "timestamp" : "46:07-46:18"
  },
  {
    "text" : "What an anonymous name, too, for an anonymous cornerback. Right? So he came back. I'm like, oh, there's Ben Kelly. But he has that that first like he comes in and Bret Fart picks on him and he has a pretty good pass. He has his head around, he's got the guy on his back and he's like fighting for the ball PI on him.",
    "timestamp" : "46:19-46:35",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "46:35-46:37",
    "text" : "That was the worst one.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And then they just go after like and then Brett Farbe just goes after Ben Kelly immediately, over and over again, all the way down to like the five-yard line. Yeah, as you should.",
    "timestamp" : "46:37-46:45"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:46-47:01",
    "text" : "Yeah. But the the injury was um the the announcer was like oh uh we think he's going through the concussion protocol because they're doing the finger in front of his face and stuff and he doesn't look Likes are all there. The official word is the wind is knocked out of 'em."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah. That's old song.",
    "timestamp" : "47:02-47:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:04-47:09",
    "text" : "Oh, just like Drew Bloodso. Yeah. And it's had the wind knocked out of him too."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, in a collapsed lung.",
    "timestamp" : "47:09-47:11"
  },
  {
    "timestamp" : "47:11-47:28",
    "text" : "Yeah. Yeah, literally the wind knocked out of him. Jesus. You were thinking that. Or just hockey, it's an upper body injury. Yeah. But yeah, I don't there weren't really any Patriots that had good games. Tight law?",
    "speaker" : "Andy"
  },
  {
    "text" : "Talad did play pretty well.",
    "speaker" : "Steve",
    "timestamp" : "47:29-47:30"
  },
  {
    "speaker" : "Andy",
    "text" : "He played okay until he got hurt. And then like that's that's bad.",
    "timestamp" : "47:31-47:34"
  },
  {
    "text" : "He had a big third down stop in that first quarter too, you know.",
    "timestamp" : "47:34-47:37",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "47:37-47:55",
    "text" : "He did, yeah. Uh Terry Gill did not have a good game. I thought watching Brett Favre throw to Terry Glenn is the reason I hate Brett Favre. Uh and also Terry Glenn, because Terry Glenn would give up on a route and Brett Favre would throw it anyway, even though it's triple covered. What the fuck are both of you doing?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "He did. He had eight targets with three catches for 19 yards. Yeah.",
    "timestamp" : "47:56-48:00"
  },
  {
    "text" : "He had an awful drop too.",
    "speaker" : "Andy",
    "timestamp" : "48:00-48:01"
  },
  {
    "speaker" : "Steve",
    "text" : "He was like would have been way open if he actually tried hard and then he hit him in the hands. He just dropped it anyways.",
    "timestamp" : "48:02-48:07"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Not great. Uh but Uh Brett Favre, his second touch in the game was his 300th all time.",
    "timestamp" : "48:07-48:14"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "48:14-48:24",
    "text" : "They said there's only four 300 yard 300 touchdown quarterbacks at that point. There were. How many are there now?"
  },
  {
    "speaker" : "Andy",
    "text" : "Probably like seventy would be my guess.",
    "timestamp" : "48:25-48:27"
  },
  {
    "timestamp" : "48:27-48:34",
    "speaker" : "Steve",
    "text" : "Uh I'm gonna say stat check. Forty two. Yeah. You got a guess before you Google it, Greg?"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh I'm saying 42. I'm going to say like 10.",
    "timestamp" : "48:35-48:38"
  },
  {
    "timestamp" : "48:39-48:49",
    "speaker" : "Steve",
    "text" : "300. We're three in 2002. I'm saying 18. I'm saying 10. Greg, Andy, you just said 70."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, well that was fuck that was a joke.",
    "timestamp" : "48:49-48:51"
  },
  {
    "text" : "Oh, well, I was going off your guess. Why would there be 70?",
    "speaker" : "Steve",
    "timestamp" : "48:52-48:55"
  },
  {
    "text" : "Alright, fine. Price is the right rules.",
    "speaker" : "Mom",
    "timestamp" : "48:55-48:57"
  },
  {
    "timestamp" : "48:57-49:05",
    "text" : "Let's go. Oh my god. Um see. Yeah, come on Greg. What you got?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Do you want me to give you the stat? Are you still guessing?",
    "timestamp" : "49:05-49:07"
  },
  {
    "timestamp" : "49:08-49:11",
    "text" : "No, we're good. I I guess 10 Steven guess 42.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "49:12-49:19",
    "speaker" : "Greg",
    "text" : "I guess what, eighteen? Yeah. There are twelve quarterbacks that have three plus touchdowns. All right."
  },
  {
    "text" : "Can we name them? No. Brett Favre, Frank Arkington. Yeah. Peyton Manning, Tom Brady. Don Dan Marino. Oh, Dan Marino?",
    "speaker" : "Andy",
    "timestamp" : "49:19-49:28"
  },
  {
    "text" : "He was in that montage during the game and there wasn't there.",
    "timestamp" : "49:28-49:31",
    "speaker" : "Steve"
  },
  {
    "text" : "420. Sweet dude.",
    "timestamp" : "49:32-49:34",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Sweet.",
    "timestamp" : "49:35-49:35"
  },
  {
    "speaker" : "Steve",
    "text" : "Nice.",
    "timestamp" : "49:35-49:36"
  },
  {
    "timestamp" : "49:36-49:39",
    "speaker" : "Andy",
    "text" : "Um who else has been really good for a long time?"
  },
  {
    "speaker" : "Steve",
    "text" : "Well there was there was four of them given to us in the game.",
    "timestamp" : "49:40-49:42"
  },
  {
    "speaker" : "Andy",
    "text" : "I didn't pay attention. I just paid attention to Fran Tarkinton.",
    "timestamp" : "49:43-49:45"
  },
  {
    "timestamp" : "49:45-49:54",
    "speaker" : "Steve",
    "text" : "It was Frank Darkenson, Dan Moreno, Brett Favre, and we were talking about him earlier, I think. Doug Peterson."
  },
  {
    "speaker" : "Andy",
    "text" : "Maybe we think he has 40.",
    "timestamp" : "49:55-49:57"
  },
  {
    "text" : "John Loway. Yes. Oh. Yeah. Um okay. So you got so the rest of them are all within the line, they're either active",
    "timestamp" : "49:59-50:09",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:11-50:12",
    "text" : "Is he on there?"
  },
  {
    "speaker" : "Steve",
    "text" : "No. Wow. I thought that too because I did that montage and I was like, I can't believe Montana's not on there. Especially playing with Jerry Rice. Drew Brees will be on there.",
    "timestamp" : "50:13-50:22"
  },
  {
    "text" : "True Brees is number one.",
    "timestamp" : "50:22-50:24",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:25-50:26",
    "text" : "Oh, right, of course, yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "For Ryan? One through five. We got Breeze, Brady, Manning, Fav, Merino. You're missing six, seven, eight, nine. And eleven.",
    "timestamp" : "50:26-50:36"
  },
  {
    "text" : "And the rest of those are active?",
    "timestamp" : "50:36-50:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "50:38-50:43",
    "text" : "Correct. Matt Ryan. Matt Ryan is eleven. Nice."
  },
  {
    "text" : "Um they gotta be playing for a little bit.",
    "timestamp" : "50:44-50:46",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "50:47-51:02",
    "speaker" : "Greg",
    "text" : "Two of them were drafted and traded together on draft day. Rothesberger. Rothbard is one of them, but that's not what I was thinking of. Eli Eli. And Phil. And Phil. Phil Rivers. Eli has 300 touchdowns. 366."
  },
  {
    "timestamp" : "51:04-51:08",
    "speaker" : "Steve",
    "text" : "As many interceptions as touchdowns. Probably."
  },
  {
    "timestamp" : "51:09-51:23",
    "speaker" : "Andy",
    "text" : "Uh see who else are we missing? We talked about him earlier. Jameis Winston. Um we talked about him earlier. We've talked about a lot of people. Brett Favre."
  },
  {
    "timestamp" : "51:24-51:32",
    "speaker" : "Greg",
    "text" : "You might have mentioned him, but um Chad Pennington. Time's up. Aaron Rodgers."
  },
  {
    "timestamp" : "51:32-51:33",
    "text" : "Oh fuck, of course.",
    "speaker" : "Andy"
  },
  {
    "text" : "God damn, yeah, we definitely Carson Palmer is two ninety-four. Wow. Vinny Testaverdi, two seventy-five. Love that. Warren Moon. Bloodsoe 251.",
    "speaker" : "Greg",
    "timestamp" : "51:34-51:46"
  },
  {
    "timestamp" : "51:47-51:48",
    "text" : "I was just gonna ask where Bloodsow was.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:49-51:49",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "So he's he's right there. He's knocking on the doorstep.",
    "timestamp" : "51:49-51:52"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "51:52-51:54",
    "text" : "Boomer. 247."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:55-51:55",
    "text" : "All right."
  },
  {
    "timestamp" : "51:55-52:07",
    "text" : "So Jameis is 116 with 121 touchdowns For now. For now. Would you guys be mad or what would you what would your opinion be if the Pats signed Cam Newton?",
    "speaker" : "Greg"
  },
  {
    "text" : "We talked about this with Bobby a little bit on that Panthers episode. Yeah. That changed my opinion significantly. Really? In what way? Yeah. Because he's like, dude, Cam Newton's good. I agree. He gets a bad rap. And I think he's right.",
    "timestamp" : "52:07-52:24",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "52:25-52:35",
    "speaker" : "Andy",
    "text" : "I agree. I just don't think the Patriots are in a position to put like my big name uh Free agent quarterback right now."
  },
  {
    "text" : "Yeah, but I'd rather like if we have to go to a backup, I almost would rather be comfortable going to Cam Newton than Brian Hoyer. Who gives you a better chance to win? He has to be a starter. Yeah. Well if he wants, I mean too. But like there's no starting jobs left in the NFL.",
    "timestamp" : "52:35-52:52",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "52:55-53:13",
    "speaker" : "Greg",
    "text" : "That's what I'm saying. I I would love him. You get him at a bargain right now. Like of all the free agent quarterbacks, you're talking about the Red Rocket, whatever his name is. Call and signed. Joe Flacco's, yeah, all those guys. I was like, please no. Right. Uh Cam Newton, I'm like, yeah, you could be our MVP."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "53:14-53:14"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, you could like theoretically make a Super Bowl with Cam Newton.",
    "timestamp" : "53:14-53:17"
  },
  {
    "speaker" : "Steve",
    "text" : "And the other part is you don't have to like Switch your offense for him either. Like some of those quarterbacks can run, but he can also throw.",
    "timestamp" : "53:17-53:25"
  },
  {
    "text" : "And he's like, I don't know. He's just so high upside that it's like, all right, we have a chance in any game. Whereas like Andy Dalton, you're like, oh, just don't blow this, you know? Yeah.",
    "timestamp" : "53:25-53:37",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "And the I feel such a like, what have you done for me recently? Like this fantasy football season, the one that just ended. My f my two quarterbacks were Andy Luck and Cam Newton. And I was like, yeah, I'm sitting fine. And then Luck retires the fourth season and Cam Newton doesn't play a snap, and I was absolutely screwed the whole year. But like going into the year, you're like, yeah, Andrew Locke and Cam Newton. Yeah. Oh yeah. Two of the top 15 quarterbacks in the league.",
    "timestamp" : "53:37-54:04"
  },
  {
    "text" : "I would sign him if there was a stipulation in the contract that he can't write in those stupid hieroglyphics on his fucking social media. What like how has his publicist not been like, dude, just drop drop the fucking stupid font? Like it's not doing you any favors in the public. Yeah, that might be part of the reason he's not signed right now.",
    "timestamp" : "54:05-54:24",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Well if you play on the pictures, no social media at all anyways, right?",
    "timestamp" : "54:25-54:28"
  },
  {
    "timestamp" : "54:28-54:39",
    "text" : "Well it think about it, right? It's like the perception met m matters as much as anything. We've seen it with Kaepernick of Is this guy gonna come in and keep his head down and play, right?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I think the pages care less about that though.",
    "timestamp" : "54:39-54:41"
  },
  {
    "timestamp" : "54:41-55:03",
    "speaker" : "Greg",
    "text" : "Yeah, I think they just gonna it'll sort itself out more than anything. It like that if you're his publicist, right, you say, dude This is an easy win if you just drop the hieroglyphics. Like if you want to dress funny, that's fine. You know? Yeah. Whatever. Like style's a big thing too. But the hieroglyphics, like, what just drop it. you're gonna make more money."
  },
  {
    "text" : "Yeah, he's already made a ton of money, so I don't know if it really cares because he came out when those rookie contracts are crazy. Yeah, that's true. That's true.",
    "timestamp" : "55:03-55:09",
    "speaker" : "Steve"
  },
  {
    "text" : "But I I don't even know if that's it. Again, like or anybody really gives a shit in terms of like the business side of things? I think they do.",
    "timestamp" : "55:09-55:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Well your quarterback is like the face of your franchise. If it's some other random player, maybe not, but",
    "timestamp" : "55:23-55:28"
  },
  {
    "timestamp" : "55:29-55:40",
    "speaker" : "Steve",
    "text" : "Well that's that's part of the bad stigma, you know. I mean yeah who cares if you write some stupid higher I I actually didn't know that until just now, to be honest, because I've never followed Cam Newton on social media."
  },
  {
    "speaker" : "Greg",
    "text" : "Look it up, Steve. It's hilarious.",
    "timestamp" : "55:40-55:43"
  },
  {
    "timestamp" : "55:42-56:10",
    "text" : "I'm sure it is hilarious. And I've seen his his postgame interviews, which are equally I'm just assuming it looks like how he dresses. Yes, it does. So I already got it. I need to look it up. But like, I don't care. As long as you can throw the goddamn ball and Again, my point earlier, I think you can be a better chance of women than Hoyer. I mean, we know what Hoyer is. Well, not don't get me wrong, I love Hoyer, but Cam Newton probably will give you a better chance to win.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "56:11-56:13",
    "speaker" : "Greg",
    "text" : "Yeah, but you gotta sign him as a starter if you're signing him."
  },
  {
    "timestamp" : "56:13-56:26",
    "text" : "I don't think I mean at some point Cam Newton's gonna be like, wow, there's no starting jobs left. Where am I going to go or have the best chance to start is probably where they're starting Jarrett Stidum, who could be a boom or a bust. Right. So yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "People talk about Kaepernick getting blackball, but how the hell is Cam Newton not been?",
    "timestamp" : "56:28-56:32",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, who does an MVP?",
    "timestamp" : "56:33-56:34"
  },
  {
    "speaker" : "Greg",
    "text" : "And like he was injured.",
    "timestamp" : "56:35-56:36"
  },
  {
    "speaker" : "Steve",
    "text" : "It wasn't like he was sucked. And he sucked, but because he is like a foot fracture.",
    "timestamp" : "56:36-56:40"
  },
  {
    "text" : "And he won the MVP like within the last like three, four years. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "56:40-56:44"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:44-56:47",
    "text" : "He took a team to a Super Bowl. Like he's legit good."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "56:47-57:15",
    "text" : "Like extremely good. Yes. Hey, I don't get it. And like you you see ESPN writing all these articles. Who's gonna sign Kaepernick? Dude, that's what drives me crazy about ESPN is like it's it's just so like transparently click-bait where you have like the same quarterback who is everybody knows is legit good who's also not signed. Talk about him, you know? But that's not what drives the clip. So that's yeah, exactly."
  },
  {
    "text" : "It's the same with talk radio. We would never do that on this podcast.",
    "speaker" : "Andy",
    "timestamp" : "57:16-57:26"
  },
  {
    "timestamp" : "57:27-57:36",
    "text" : "You're on Patriots Dynasty. We watch games from twenty years ago. Subscribe Each play in death.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "57:36-57:46",
    "text" : "I actually have something I wanna say that I think is a hot take. Wait, what was your first hot take? Breath."
  },
  {
    "text" : "That he's a serial killer, yeah.",
    "timestamp" : "57:46-57:47",
    "speaker" : "Andy"
  },
  {
    "text" : "I think he meant the whole thing, the whole concept. And that was so long ago I can't remember. Whole concept of what? This whole podcast. Yeah. Episode one, season one. I only stayed for half of it. I went to the bar.",
    "speaker" : "Steve",
    "timestamp" : "57:49-58:06"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "58:08-58:17",
    "text" : "J mid podcast? You left? Yeah. It's not a good sign for listeners. He did, yeah. He uh terrible on the podcast is leading."
  },
  {
    "speaker" : "Steve",
    "text" : "He did it's week one versus the Bengals. Who cares? That was an important thing. I do have a hot take though.",
    "timestamp" : "58:17-58:25"
  },
  {
    "timestamp" : "58:25-58:26",
    "speaker" : "Greg",
    "text" : "Let's hear it."
  },
  {
    "text" : "The refs taking their hat off as a penalty flag is dumb. Yeah, they should just have multiple flags. No, just throw the goddamn flag. Why the fuck are you taking your hat off for that one specific penalty?",
    "speaker" : "Steve",
    "timestamp" : "58:27-58:42"
  },
  {
    "timestamp" : "58:42-58:43",
    "speaker" : "Andy",
    "text" : "That's fair."
  },
  {
    "timestamp" : "58:44-58:56",
    "text" : "What? Why is that a goddamn rule? There's so many stupid fucking rules. Well, you gotta do that. The tight end wasn't covering up the offensive line tackle, so that's a penalty.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "58:56-59:01",
    "speaker" : "Greg",
    "text" : "But you have to know there's a second penalty called. That's why they throw 'em like live during the play."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "59:02-59:04",
    "text" : "I don't get it. What do you mean?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:04-59:11",
    "text" : "No, the the guy going out of bounds and touching it illegally They're supposed to throw their hat for some reason. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "They throw it if there's a second penalty and they don't have a second flag. No, no, no. They will also do that too.",
    "timestamp" : "59:11-59:16"
  },
  {
    "speaker" : "Steve",
    "text" : "Legal touching penalty, they throw their hat. Yeah.",
    "timestamp" : "59:17-59:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Same with like if a gunner runs out of bounds and doesn't come back in, they throw their hat. This is the worst part.",
    "timestamp" : "59:21-59:25"
  },
  {
    "speaker" : "Steve",
    "text" : "In this game they did it But the guy didn't throw his hat off, so the refs huddle and the ref takes his hat on the fucking ground.",
    "timestamp" : "59:26-59:32"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:32-59:33",
    "text" : "Yeah, that shit's hilarious."
  },
  {
    "timestamp" : "59:33-59:40",
    "speaker" : "Steve",
    "text" : "They can see them laughing in their huddle. Like, uh, you forgot to take your hat off and throw it on the ground, bro. Which would be."
  },
  {
    "timestamp" : "59:44-59:48",
    "speaker" : "Andy",
    "text" : "It negated an amazing DNA branch catch too."
  },
  {
    "timestamp" : "59:48-59:50",
    "text" : "Yeah, baller guy. He snagged that thing.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "59:50-59:54",
    "speaker" : "Greg",
    "text" : "Don't they do that um if there's two if there's a second penalty too?"
  },
  {
    "text" : "Yes. They might. Which is why they should ho carry multiple flags. They should carry a yellow flag and a red flag.",
    "timestamp" : "59:55-01:00:00",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:00:00-01:00:04",
    "speaker" : "Greg",
    "text" : "Yes. Well, but no, we're that's a challenge flag, Andy. Yeah."
  },
  {
    "text" : "Well get rid of challenge flags, make those purple. No make those make those pink for um breast cancer awareness. And then the red flag would be if you have a second um personal foul and you're kicked out of the game.",
    "timestamp" : "01:00:04-01:00:20",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:00:25-01:00:32",
    "text" : "You know what was worse? These are conversations they've probably had. What about for the colorblind?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:32-01:00:34",
    "text" : "Uh so no red and green."
  },
  {
    "timestamp" : "01:00:34-01:00:37",
    "text" : "The point, Steve, this is pretty problematic now that I think about it.",
    "speaker" : "Greg"
  },
  {
    "text" : "All right, blue. Blue flag. Like in like in indoor soccer, you get a blue card and you have to sit out for two minutes. I've had a lot of those.",
    "timestamp" : "01:00:37-01:00:45",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, you have.",
    "timestamp" : "01:00:45-01:00:46",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:46-01:00:49",
    "text" : "A lot of those. Referees all like being indoor."
  },
  {
    "timestamp" : "01:00:49-01:00:50",
    "speaker" : "Steve",
    "text" : "Because you just hack."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:51-01:00:54",
    "text" : "And then I tell them how to do their job correctly. Surprise, surprise."
  },
  {
    "timestamp" : "01:00:54-01:01:02",
    "speaker" : "Greg",
    "text" : "And Andy hates refs. You wouldn't say News at eleven. At least you're consistent, Andy. You hate all refs."
  },
  {
    "text" : "Yeah, oh yeah. No, me and referees don't get along. Which is great because I I used to be um flag football ref in in college for the flag foot like the",
    "timestamp" : "01:01:02-01:01:11",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Was it flag football that they were doing? Sure everyone hated you. Yeah, they definitely did.",
    "timestamp" : "01:01:11-01:01:16"
  },
  {
    "timestamp" : "01:01:16-01:01:18",
    "speaker" : "Andy",
    "text" : "No, I was never the head referee, so thank you."
  },
  {
    "speaker" : "Greg",
    "text" : "No, they still did. Yeah. Good. Fuck it.",
    "timestamp" : "01:01:19-01:01:21"
  },
  {
    "text" : "It all refs.",
    "speaker" : "Steve",
    "timestamp" : "01:01:21-01:01:22"
  },
  {
    "timestamp" : "01:01:24-01:01:26",
    "speaker" : "Andy",
    "text" : "I hate it myself, so it worked out well."
  },
  {
    "timestamp" : "01:01:26-01:01:28",
    "speaker" : "Steve",
    "text" : "All right, you guys want to do uh play of the game?"
  },
  {
    "speaker" : "Andy",
    "text" : "Um yes. Because I don't think we'll have the same one.",
    "timestamp" : "01:01:28-01:01:32"
  },
  {
    "timestamp" : "01:01:33-01:01:34",
    "speaker" : "Steve",
    "text" : "Yeah, I went nothing else."
  },
  {
    "timestamp" : "01:01:35-01:01:37",
    "speaker" : "Andy",
    "text" : "All right, Steve, give me your play of the game."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, I actually have like four, so I'm when you guys go to first. Pick one, you prick. No, I want you guys go first, so I don't pick yours because you Greg, I didn't I know didn't watch the game.",
    "timestamp" : "01:01:37-01:01:48"
  },
  {
    "timestamp" : "01:01:48-01:01:56",
    "text" : "Yeah, and doesn't have one. Greg uses like whatever touchdown he saw on the fucking highlights. Well, isn't that a valid choice for play of the game?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01:57-01:01:59",
    "speaker" : "Steve",
    "text" : "Yeah, that's what I'm saying. So I'm not gonna take that from you, Greg."
  },
  {
    "timestamp" : "01:01:59-01:02:01",
    "text" : "All right. Yeah, Greg, maybe you should go first.",
    "speaker" : "Andy"
  },
  {
    "text" : "All right, I'll go first. Whatever play we scored our touchdown on, that was my play of the game. David Gibbons first catch, four yards, touchdown with six oh three left in the third, fourth quarter. Which garbage time for the touchdown.",
    "timestamp" : "01:02:01-01:02:18",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "It was actually his second catch of the game. Mm-hmm.",
    "timestamp" : "01:02:21-01:02:24"
  },
  {
    "timestamp" : "01:02:24-01:02:29",
    "speaker" : "Steve",
    "text" : "And his third he had three catches on the game. Yep. But he went right back to him after that touchdown."
  },
  {
    "text" : "Shout out David Givens. David Gives.",
    "speaker" : "Greg",
    "timestamp" : "01:02:30-01:02:32"
  },
  {
    "text" : "From Givens guy.",
    "speaker" : "Steve",
    "timestamp" : "01:02:32-01:02:33"
  },
  {
    "text" : "From",
    "timestamp" : "01:02:33-01:02:34",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:02:36-01:02:49",
    "speaker" : "Steve",
    "text" : "I don't know. Notre Dame. Notre Dame. Oh yeah, they mentioned it. Yeah, that's right. I used to have the Notre Dame hat if you remember back in the day. Oh, that's right, yeah. I was like big in Notre Dame because I loved David Givens. God, is that why?"
  },
  {
    "timestamp" : "01:02:49-01:03:03",
    "speaker" : "Andy",
    "text" : "I thought you were just chasing it. Seventh round draft pick. Yeah, he was their last Last pick they kept saying. Mm-hmm. He wasn't Mr. Irrelevant though, was he?"
  },
  {
    "timestamp" : "01:03:04-01:03:16",
    "speaker" : "Greg",
    "text" : "He was two for two three overall. Yeah. What was Brady? He was somewhere in that range, right? 199. What is it? 199. Oh wow."
  },
  {
    "timestamp" : "01:03:17-01:03:22",
    "speaker" : "Andy",
    "text" : "Yeah, so there's he was 253 out of 261 picks. You know the guy picking after him?"
  },
  {
    "timestamp" : "01:03:27-01:03:32",
    "speaker" : "Steve",
    "text" : "We have? Yeah. We talked about this in the one of the playoff episodes. Oh, good."
  },
  {
    "text" : "He caught a total of four touchdowns at college. Really? Yeah, th I I think they didn't throw the ball back then at Notre Dame. They were like a run heavy offense.",
    "speaker" : "Greg",
    "timestamp" : "01:03:33-01:03:44"
  },
  {
    "speaker" : "Steve",
    "text" : "I wish he'd stayed. That would have been sweet.",
    "timestamp" : "01:03:44-01:03:46"
  },
  {
    "text" : "He's him and Malcolm Mitchell are like the same person in my memory.",
    "timestamp" : "01:03:47-01:03:50",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Gibbons was way better than Malcolm Mitchell.",
    "timestamp" : "01:03:51-01:03:53"
  },
  {
    "text" : "But the same type of receiver for sure. And Mitchell was good. He just had same trajectory too, though, of like played really well for a short stint and then had a really bad injury and we never saw him again.",
    "timestamp" : "01:03:53-01:04:05",
    "speaker" : "Greg"
  },
  {
    "text" : "I'm telling you, you're about to find out. Givens played well for longer than a short stand. He played out his rookie contract, then left.",
    "speaker" : "Steve",
    "timestamp" : "01:04:06-01:04:11"
  },
  {
    "speaker" : "Andy",
    "text" : "That's what I'm saying though, is that Malcolm Mitchell only played in the Malcolm Mitchell was was going to be that guy, but his knees fell apart.",
    "timestamp" : "01:04:12-01:04:18"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, yeah, I agree. Oh yeah, same type of receiver, same almost personality too. All right, Andy, what's your play of the game?",
    "timestamp" : "01:04:18-01:04:26"
  },
  {
    "timestamp" : "01:04:27-01:05:04",
    "speaker" : "Andy",
    "text" : "So my play of the game was uh the replay they showed of Ty Law and Lloyd Malloy ganging up on the gunner on a on a punt return. And they were talking about how Ty Law lulled him into a false sense of security and Laurie Malloy came out of nowhere and just lit this guy up multiple times. Like lit him up so he fell over and then hit him like three times while he was on the ground, just wouldn't let him up. Yeah, he blindsided. He thought that was Terry Glenn and it wasn't."
  },
  {
    "text" : "Also in that same vein where the Packers guy didn't call fair catch. Yes. And Lawyer was like Gunner. That was Dubucky, right? And he just Yeah, it was. It was a it was bad. Like he timed that ball coming in the hit absolute perfect. And he bobbled it.",
    "speaker" : "Steve",
    "timestamp" : "01:05:04-01:05:20"
  },
  {
    "timestamp" : "01:05:20-01:05:24",
    "speaker" : "Andy",
    "text" : "And yeah, and he just phoned it back to the five and couldn't recover it."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:05:24-01:05:25",
    "text" : "If we covered that, that would have been a different game."
  },
  {
    "speaker" : "Andy",
    "text" : "New game. Yep. I agree. Oh, it's gonna be terrifying.",
    "timestamp" : "01:05:26-01:05:33"
  },
  {
    "speaker" : "Greg",
    "text" : "You just have to look up in the air and just wait for someone to just light you up.",
    "timestamp" : "01:05:33-01:05:39"
  },
  {
    "text" : "I would call for a catch every time, I think.",
    "timestamp" : "01:05:39-01:05:41",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:41-01:05:41",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Right. Fuck it. Yeah, I definitely would. And then even if you do catch it and start running, like everybody has a full head of steam coming right at you.",
    "timestamp" : "01:05:41-01:05:50"
  },
  {
    "text" : "Yeah. And it's like certain players you can tell have that like instinct where I think they can keep like one eye on the ball and one eye on the field for a brown. Like the true good punt returners can like not They know what's coming.",
    "timestamp" : "01:05:50-01:06:06",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:06:06-01:06:12",
    "text" : "Oh, of course. They can catch it and immediately make a move because they know that guy is coming hard on their right, sort of thing. Right."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. What was the guy in the past that we drafted high? That cornerback from Alabama was recent.",
    "timestamp" : "01:06:12-01:06:20"
  },
  {
    "text" : "Oh yeah, yeah. He went to the Ravens. Uh was his name.",
    "timestamp" : "01:06:21-01:06:23",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:06:24-01:06:32",
    "speaker" : "Greg",
    "text" : "And you could tell he didn't have it. The ball was in the air and you could tell he was just like nervous. He's like staring the ball down because he'd"
  },
  {
    "speaker" : "Steve",
    "text" : "I think he like he fucked up some early ones and that just killed him.",
    "timestamp" : "01:06:33-01:06:36"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:06:37-01:06:43",
    "text" : "Yeah. And it'd be like calm fair catcher, no one's around him, or like getting lit up like it. Yep."
  },
  {
    "text" : "Um poor Bass.",
    "timestamp" : "01:06:44-01:06:45",
    "speaker" : "Andy"
  },
  {
    "text" : "Cyrus Jones or something like that.",
    "timestamp" : "01:06:45-01:06:46",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That was it. Cyrus Jones. Cyrus the virus.",
    "timestamp" : "01:06:47-01:06:49"
  },
  {
    "text" : "See, this is why I had you guys go first. Those two were in my plays of the game.",
    "timestamp" : "01:06:51-01:06:54",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:06:55-01:06:55",
    "text" : "Oh my goodness.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:06:58-01:07:14",
    "text" : "Well now I have one that I watched it all the way through and I saw this and I loved it. Okay, let's hear it way way deep in um this is between my the stadium is empty note and joey harrington blew it note",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:07:15-01:07:18",
    "speaker" : "Andy",
    "text" : "So we get our garbage time, we get it. Yeah."
  },
  {
    "timestamp" : "01:07:18-01:07:21",
    "speaker" : "Steve",
    "text" : "We get our first sack, I think, of Brett Five."
  },
  {
    "text" : "Oh yeah, Brett Five.",
    "timestamp" : "01:07:21-01:07:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07:23-01:08:04",
    "speaker" : "Steve",
    "text" : "Yeah, Bobby Hamilton gets it. And uh he comes up and he's like he's doing something with his hands. Look at he's making like a like a a motion, like he's rolling his hands over each other. And I was like, is he celebrating a sack down, you know, 28 to 10 with a minute and a half left? Like, what an asshole. Then I realized he's calling time out. And I was like, I like that. Yes, that was a good one. But even like at least Bobby Hamilton's playing hard all the way through the whistle and and understanding like yeah, cause that was third down, you know, they have to punt out their own end zone, maybe we block the punt and get a touchdown, and it's kinda like 1728, you know."
  },
  {
    "timestamp" : "01:08:04-01:08:17",
    "text" : "Yeah, and then I I mean the Pages went down throwing too. Like they didn't just take a knee at the end. Like they got the ball back and they were still trying to throw it down the field even though they were down. 2810 with like under a minute left, you know.",
    "speaker" : "Andy"
  },
  {
    "text" : "Also, Brett Favre played this whole game, which I thought was a little strange.",
    "timestamp" : "01:08:17-01:08:20",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "You can tell Brett Favre he can't he you can't tell you.",
    "timestamp" : "01:08:20-01:08:22"
  },
  {
    "text" : "It's a little Tom Brady-ish too.",
    "timestamp" : "01:08:23-01:08:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "They kept showing all of his like celebrations on touchdowns and he's like headbutting people in the face and stuff and just like the standard 300 with like linemen still though but like even after like they had a rushing touchdown he's like grabbing on the lineman headbutting them in the face and like pushing them around.",
    "timestamp" : "01:08:25-01:08:40"
  },
  {
    "timestamp" : "01:08:40-01:08:40",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:08:41-01:08:41",
    "text" : "He's the best.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:42-01:08:46",
    "text" : "I like that part of Brett Favre. I generally don't like Brett Favre though."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:08:46-01:08:52",
    "text" : "No, here I have a a take on this, Steve. You don't like the way that the media treats Brett Favre."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:53-01:09:02",
    "text" : "That's that's not unfair. I think you're right. And you would uh that's why a lot of people are. I would appreciate a more measured approach to Brett Favre."
  },
  {
    "timestamp" : "01:09:02-01:09:12",
    "speaker" : "Greg",
    "text" : "Yeah, it's the same thing with Brady. That's why people hate him. They think that Brady's awesome. They think that the media slobs his knob a little bit, which is different."
  },
  {
    "speaker" : "Steve",
    "text" : "But Brady, but the problem is like Brady, like his knob deserves to be slobed. You know, like the performance on the field deserves the knob slobbing. So does Brett Favre. Does it though? You just you're the one who told us he has as many turnovers as he has touchdowns. He's a one-to-one machine.",
    "timestamp" : "01:09:12-01:09:29"
  },
  {
    "timestamp" : "01:09:29-01:09:33",
    "text" : "Yeah, he's also won MVPs, he's won Super Bowls, he plays.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:09:33-01:09:36",
    "text" : "Because like because the media's slob and his not the other thing like MVPs.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:09:39-01:09:42",
    "speaker" : "Greg",
    "text" : "First all time in yards. He's first all time interceptions."
  },
  {
    "text" : "I'm sorry, weren't you the one that told us that he won an MVP throwing more interceptions and touchdowns? Yeah. No, he made the pro ball.",
    "timestamp" : "01:09:42-01:09:48",
    "speaker" : "Andy"
  },
  {
    "text" : "That's that's that's knob slob in. I think Brady gets I'm just saying you need to No, I think I I think Brady because he's Like too consistently good and it's always crushing dreams as opposed I mean I I get a little bit of the media knob slobbing, but like The media knob slobbing is because he's doing so well. The Brett Fire of knob slobbing was undeserved based on his play. He was, I'm not saying he's bad and not good. He was good. But They made him to be oh and they just dismiss his mistakes like oh he's just a gunslinger. Anytime he'd scramble out the pocket and tell only Brad Farr can make that play.",
    "timestamp" : "01:09:49-01:10:36",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:10:36-01:10:47",
    "speaker" : "Greg",
    "text" : "Oh so many times. That play he makes when he's in Minnesota and he Sure. That touchdown. But the greatest football players I've ever seen."
  },
  {
    "timestamp" : "01:10:48-01:11:03",
    "speaker" : "Steve",
    "text" : "They don't count the flip side of the coin when he rolls out and throws a fucking million pick sixes, too. Like yeah, Brett Favre plays a risky game. Sometimes he makes big plays like that, and sometimes he throws pick six. That's why he has a one-to-one turnover to interception, uh turnover to touchdown ratio."
  },
  {
    "text" : "Here's a hot take.",
    "speaker" : "Andy",
    "timestamp" : "01:11:03-01:11:04"
  },
  {
    "timestamp" : "01:11:04-01:11:07",
    "speaker" : "Steve",
    "text" : "There's no measure that they're always like, wow, what a great play by Brad Farr."
  },
  {
    "timestamp" : "01:11:09-01:11:11",
    "speaker" : "Andy",
    "text" : "Poor man's version of Pat Mahomes."
  },
  {
    "timestamp" : "01:11:12-01:11:17",
    "text" : "Uh Okay. Their games are very similar, yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:17-01:11:22",
    "text" : "He's Pat Mahomes, but with more mistakes. He's Pat Mahomes if Pat Mahomes couldn't read a coverage."
  },
  {
    "timestamp" : "01:11:22-01:11:39",
    "text" : "He's more charismatic than Pat Mahomes though. Yeah. I don't know. Pat Maholes with that voice of his? Dude, he is like he's football. You know what I'm saying? That's why a lot of people relate to him is because he's just like a normal dude that happened to be really good. He's like an artist. Huh?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "He wears regulars, you know?",
    "timestamp" : "01:11:40-01:11:41"
  },
  {
    "text" : "Exactly. He's just a real comfortable dude.",
    "timestamp" : "01:11:42-01:11:45",
    "speaker" : "Greg"
  },
  {
    "text" : "He is exactly exactly real comfortable painkillers.",
    "speaker" : "Andy",
    "timestamp" : "01:11:45-01:11:50"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:11:50-01:11:55",
    "text" : "Yeah. And Brady's over here like Mr. Flexibility eating water ice cream."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:11:58-01:11:59"
  },
  {
    "speaker" : "Greg",
    "text" : "He is. He's a fucking he's a Brady's a robot. Yeah. Brent Far Brett Farber is a normal person.",
    "timestamp" : "01:11:59-01:12:05"
  },
  {
    "text" : "I I'm I'm not debating that",
    "timestamp" : "01:12:05-01:12:07",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "If I played football, I would definitely be addicted to painkillers. I don't think you need to play football.",
    "timestamp" : "01:12:08-01:12:14"
  },
  {
    "speaker" : "Mom",
    "timestamp" : "01:12:15-01:12:17",
    "text" : "So what's your excuse now?"
  },
  {
    "timestamp" : "01:12:19-01:12:24",
    "speaker" : "Andy",
    "text" : "They make me feel good. It made me real comfortable."
  },
  {
    "timestamp" : "01:12:26-01:12:29",
    "speaker" : "Steve",
    "text" : "Real comfortable painkillers."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, one of my favorite things to do is prescription drugs that I do not have prescription to. Yeah.",
    "timestamp" : "01:12:32-01:12:38"
  },
  {
    "text" : "We talked a lot about that on his podcast. I feel like we should probably have a s a spin-off podcast of just Gregging all the drugs he's done.",
    "timestamp" : "01:12:39-01:12:46",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:12:46-01:12:50",
    "speaker" : "Greg",
    "text" : "I could have joined a football league just to rationalize it."
  },
  {
    "text" : "You play soccer. Just rationalize that. Like, yeah, I got bad knees.",
    "speaker" : "Andy",
    "timestamp" : "01:12:51-01:12:53"
  },
  {
    "text" : "I need all these cocaine. I do have bad knees. You're right. There you go. That's a good point, Andy.",
    "timestamp" : "01:12:53-01:13:00",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:13:00-01:13:01",
    "speaker" : "Andy",
    "text" : "Break out the cocaine."
  },
  {
    "text" : "I'm not broken. The system's broken.",
    "speaker" : "Greg",
    "timestamp" : "01:13:01-01:13:05"
  },
  {
    "text" : "You're broken elsewhere as well. Blame Big Pharma.",
    "timestamp" : "01:13:07-01:13:09",
    "speaker" : "Andy"
  },
  {
    "text" : "So uh who we got next week?",
    "timestamp" : "01:13:10-01:13:13",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh well I have one more play of the game.",
    "timestamp" : "01:13:14-01:13:16"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh wait. Judy Wamp, but alright. I don't know if it's a good idea. I I got all the games. We'll see about uh is it the lawyer Malloy timed up sack?",
    "timestamp" : "01:13:16-01:13:28"
  },
  {
    "timestamp" : "01:13:28-01:13:46",
    "speaker" : "Andy",
    "text" : "No. It is third and ten, twelve minutes, fifty seconds left in the half. Braves and the shotgun. Drops back to pass and uh the right end comes off clean. Matt Light did not have a good game in this. He did not play Gabaja Biamila."
  },
  {
    "timestamp" : "01:13:47-01:13:48",
    "speaker" : "Greg",
    "text" : "He was pretty good."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:48-01:14:24",
    "text" : "Basically has Brady dead to rights, you know, blind side strip sack. And Brady somehow manages to pass the ball to his left hand so he doesn't drop it. And takes a couple steps to his left, puts it back in his right hand, and rifles the ball to our boy Troy Brown, who's very excited to make this catch. Um yards. Yeah. 13 yards keeps the drive alive. And um I'm pretty sure you don't go underscore this. But at the same point, this was like one of those Brady trying to do his Brett Farb impression."
  },
  {
    "timestamp" : "01:14:25-01:14:52",
    "speaker" : "Steve",
    "text" : "Actually I think it was the third the the field goal drive. It may have been it was right after the Loy Mullight and Tylaw combo punk coverage. Yeah, I think you're right. And Falk had a sweet blitz pickup on that. I don't know. They they highlighted it in the commentary where They did. Like uh Kevin Falk took on a linebacker, just doned just straight up. A lot of like backs cut them, you know. Yeah."
  },
  {
    "timestamp" : "01:14:52-01:14:52",
    "speaker" : "Andy",
    "text" : "No."
  },
  {
    "text" : "Yeah. Got under his paths and just stoned him straight up.",
    "timestamp" : "01:14:53-01:14:57",
    "speaker" : "Steve"
  },
  {
    "text" : "There you go, Greg.",
    "speaker" : "Andy",
    "timestamp" : "01:14:57-01:14:58"
  },
  {
    "speaker" : "Steve",
    "text" : "While Matt light gets beat like a rug.",
    "timestamp" : "01:14:58-01:15:00"
  },
  {
    "timestamp" : "01:15:01-01:15:08",
    "speaker" : "Greg",
    "text" : "That's my favorite thing to like see highlights of is running backs making huge blocks."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:15:08-01:15:08"
  },
  {
    "timestamp" : "01:15:09-01:15:41",
    "speaker" : "Greg",
    "text" : "Because you know it like goes under the radar. There was actually an interesting going back to last week Um I think it was it was Ricky Williams talking about Mike Dicka and how like their relationship Oh and he said that like he made like a huge block on one play and then he came off the field and Mike Dick has said to him, like, that's the best play I've seen you make all season. You keep doing that, you're gonna be like a great player in this league. Damn, Ricky Williams is like, that's when I knew that like we were going to be a fit. I was like, that's pretty cool."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, if you can't let's pick up, you can't start for the Patriots. Yep, right.",
    "timestamp" : "01:15:43-01:15:48"
  },
  {
    "text" : "You got the video for me here, Andy? Yeah, here you go. There's Kevin Falk down there.",
    "speaker" : "Andy",
    "timestamp" : "01:15:48-01:15:52"
  },
  {
    "text" : "Oh yeah, Kevin. Yeah, dude. He just like washes him out.",
    "timestamp" : "01:15:53-01:15:56",
    "speaker" : "Steve"
  },
  {
    "text" : "He pushes him into the line. Yeah, but this play was Like it's definitely Kevin Falk. Troy Brown very sad. Troy Brown's he's fugging. That might have been Troy's first catch of the game. Watch Kevin Falk here. No, it wasn't. He got the first catch of the game. But just like do pushes him backwards. Yeah. But Brady watch watch Brady's hands on this play. Tucks it to his other hand. Puts it back, two steps, balls out. First down on third and ten. Keeps it driving.",
    "timestamp" : "01:15:56-01:16:27",
    "speaker" : "Andy"
  },
  {
    "text" : "There was another play later in the game where he like avoids two guys.",
    "timestamp" : "01:16:28-01:16:30",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:16:31-01:16:33",
    "speaker" : "Andy",
    "text" : "He throws it incomplete, but like Yeah, that was a good one too."
  },
  {
    "speaker" : "Steve",
    "text" : "Just one, two, and like it showed his This started to be where you could kind of see his like elite in-the-pocket movement. Right. I mean even up to this point, you hadn't quite seen that yet that we're so used to of like his prenatural sense of like there's a guy coming up let me take one step up and he goes right by me sort of thing There's a little bit more of that in this game.",
    "timestamp" : "01:16:34-01:16:56"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:16:56-01:17:03",
    "text" : "Yeah, I think same same as the punt return thing, right? It's keeping your eyes downfield, but also like feeling pressure."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. That's a great comp, Craig. You're right. Yeah.",
    "timestamp" : "01:17:03-01:17:06"
  },
  {
    "timestamp" : "01:17:06-01:17:06",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:17:07-01:17:41",
    "text" : "And also I wonder if this goes because I know we talked about Brady practicing his play action as well, like a few weeks ago. And I wonder if this is something that he has to practice as part of that too. Because if you ever see his like workout videos and shit online these days, it's all about like he's just in his shell and he's you know, and his helmet. He's dropping back to pass. He has guys just like punching him with boxing gloves on while he's like keeping his head downfield and and like moving around as if he's in a pocket. So I wonder if that was like an active part of the things that he works on during the off season."
  },
  {
    "speaker" : "Greg",
    "text" : "And then he lengthens his hamstrings by two sending them vigorously.",
    "timestamp" : "01:17:41-01:17:46"
  },
  {
    "text" : "Yeah, me too.",
    "timestamp" : "01:17:46-01:17:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:17:47-01:17:47",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:17:48-01:17:51",
    "text" : "It's all about length, Andy. At least that's a good thing."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "01:17:56-01:17:56"
  },
  {
    "speaker" : "Steve",
    "text" : "And he drinks a ton of water too.",
    "timestamp" : "01:17:57-01:17:59"
  },
  {
    "timestamp" : "01:17:59-01:18:02",
    "text" : "That's why he doesn't get sunburned. We can say it's about it.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:18:09-01:18:24",
    "text" : "Rat Far is out there doing it like the copper like with a sleeve shit. Ads regular guys like yeah cropper that sounds good it kills like you know that'll be great for my arthritis Ray's like, nah bro, just drink a shitload of water and stretch a bunch."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:18:25-01:18:26",
    "text" : "Yeah, and stop eating strawberries."
  },
  {
    "text" : "Everybody hates stretching. I've never night shades. Yeah. I love stretching.",
    "speaker" : "Greg",
    "timestamp" : "01:18:27-01:18:31"
  },
  {
    "speaker" : "Andy",
    "text" : "What do you mean you love stretching? I love it. I feel so good. Yoga is different.",
    "timestamp" : "01:18:31-01:18:36"
  },
  {
    "timestamp" : "01:18:36-01:18:38",
    "text" : "I'm on team Andy. I don't I love stretching too.",
    "speaker" : "Steve"
  },
  {
    "text" : "That's just stretching though, because if I don't stretch I just I feel like I'm a hundred years old. So when you go play soccer, you stretch before? Yes. Well, and well I now I'm also kicking Forty's door down, so I kind of have to, otherwise uh bad very bad things will happen.",
    "timestamp" : "01:18:38-01:18:57",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:18:58-01:19:01",
    "text" : "I think stretching helps me poop better, so I'm kind of a big stretcher.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:19:01-01:19:03",
    "text" : "I'm I've never had a problem pooping. Not gonna lie.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Me neither, but like I'm more relaxed just in general, you know.",
    "timestamp" : "01:19:04-01:19:06"
  },
  {
    "text" : "You should try like the Asian pooping. Like squat we got a squat? Yeah, squat on top of the toilet seat. Yeah, I'm all set with that.",
    "timestamp" : "01:19:07-01:19:15",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:19:15-01:19:32",
    "text" : "See when I'm going in there, I'm going in there for a while. Like I my my bathroom, my sanctuary. So I'm you know, I'll bring a book or I'll bring my phone or something, you know, maybe bring my computer, bring a guitar, just just twiddle around a bit. It's just me, myself, uh, and my turds. Love it.",
    "speaker" : "Andy"
  },
  {
    "text" : "I agree. I'm on a schedule, so it's nice to do that. Four or five times today. I'm gonna get a little 10 15 minute break where I can just fuck around on my phone.",
    "timestamp" : "01:19:32-01:19:44",
    "speaker" : "Steve"
  },
  {
    "text" : "You guys ever damn like you like you'll like sit down and you you won't sit far enough back? And it kind of pinches your uh your old wiener there. And then you stand up and you realize that you haven't peed. And then you turn around and pee.",
    "timestamp" : "01:19:44-01:20:03",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:20:04-01:20:11",
    "text" : "No. No. Because I'm a fucking grown up. What the hell? Do you just did you not learn how to do this growing up?",
    "speaker" : "Andy"
  },
  {
    "text" : "How do you not notice that you're pinching your dick and you can't pin I've I've thought about this a lot. Like I've never Shit, but not piss. Even if I peed like 20 minutes beforehand, like a little bit of pee comes out just in my relaxation, you know, like I relax a little bit.",
    "speaker" : "Steve",
    "timestamp" : "01:20:12-01:20:28"
  },
  {
    "timestamp" : "01:20:28-01:20:36",
    "text" : "Like I could if I wanted to. This is not where I thought this episode would go, by the way.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "But well it's only ever happened to me under the influence of marijuana, but it's happened. I and I think I think that's what's happening. I'm not positive, but I never actually should up and be like, oh, I forgot to pee, and then I'll turn around and pee.",
    "timestamp" : "01:20:36-01:20:52"
  },
  {
    "text" : "No, I I how many times we talking, Greg?",
    "timestamp" : "01:20:53-01:20:56",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:20:56-01:20:58",
    "speaker" : "Greg",
    "text" : "I don't know, like five to ten maybe."
  },
  {
    "speaker" : "Steve",
    "text" : "Over my lifetime. Over my lifetime.",
    "timestamp" : "01:20:58-01:21:00"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:01-01:21:05",
    "text" : "Once a month. Jesus."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, no, it never happened to me. I guess uh we could put a poll out on on our social media and find out how many people have forgotten to piss other shitting.",
    "timestamp" : "01:21:05-01:21:13"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know if I want that poll associated with us, but yeah.",
    "timestamp" : "01:21:13-01:21:15"
  },
  {
    "speaker" : "Steve",
    "text" : "Everyone I I have a pinch your dick off on the front of the toilet while you're shitting and forgotten.",
    "timestamp" : "01:21:16-01:21:20"
  },
  {
    "timestamp" : "01:21:22-01:21:28",
    "speaker" : "Greg",
    "text" : "Everyone I've has had the same reaction, so I think I'm in the minority. I think you might be."
  },
  {
    "text" : "I mean the closest I've got is I will sit there for too long and cut off circulation to my legs and I can't stand up anymore.",
    "timestamp" : "01:21:29-01:21:35",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh yeah, we have a we have a picture of Greg with that.",
    "timestamp" : "01:21:35-01:21:38",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Oh, that's right, because he fell asleep on the toilet.",
    "timestamp" : "01:21:38-01:21:41",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, the the biggest red ring around your ass of all time.",
    "timestamp" : "01:21:42-01:21:45",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:21:46-01:21:46",
    "text" : "Yeah, that was funny.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:21:47-01:21:52",
    "speaker" : "Andy",
    "text" : "How long have you got to be able to do that? The funniest part was the fact that you posted that into the the Brown family chat."
  },
  {
    "timestamp" : "01:21:52-01:21:52",
    "speaker" : "Greg",
    "text" : "I did?"
  },
  {
    "text" : "Oh yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:21:53-01:21:53"
  },
  {
    "timestamp" : "01:21:53-01:21:54",
    "text" : "I think Kelly did.",
    "speaker" : "Greg"
  },
  {
    "text" : "No, I think it was Greg. Mama. I'm pretty sure it's Kelly.",
    "speaker" : "Andy",
    "timestamp" : "01:21:55-01:21:59"
  },
  {
    "text" : "That's brutal. Oh, everyone's seen that photograph. I'm surprised it's not in the family calendar.",
    "speaker" : "Steve",
    "timestamp" : "01:21:59-01:22:05"
  },
  {
    "speaker" : "Andy",
    "text" : "It's I actually printed it out and and posted it up around uh my town just put on on polls and said uh you know have you seen this this these cheeks they're not missing I just wanted you to see them well so let's let's give our our our listeners some context here",
    "timestamp" : "01:22:05-01:22:23"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, uh we were out drinking in Boston, staying at like a hotel, and I left early because I was like, oh, I'm too bamboozled. So I went back to the hotel by myself. Got into the to the went to the bathroom. Was on the toilet in the bathroom. And I think what it what had happened was I was Marijuana again. Unbelievable. But one of the k the guys who was staying in the same hotel room came back like an hour later and I was still sitting there with my pants in my ankles with like a bowl in my hand. So he like grabbed me and like dragged me to my to the bed and like threw me face down. And then there's a picture with like my pants around my ankles and just my butt cheeks with this and this. huge red circle from where the toilet seat because I hadn't put the seat down. I just sat directly. Wait, wait, you sat on the rim? You can one picture of like me sitting on the toilet and you can see that the seat's not done. Oh my god.",
    "timestamp" : "01:22:23-01:23:33"
  },
  {
    "timestamp" : "01:23:33-01:23:46",
    "speaker" : "Andy",
    "text" : "I didn't know you sat on the rim, bro. That's even worse. Hang on. So so back to your other story of forgetting to pee. Is that is the rim down in that one? Is the uh seat down in those stories?"
  },
  {
    "speaker" : "Greg",
    "text" : "It is.",
    "timestamp" : "01:23:48-01:23:48"
  },
  {
    "text" : "I think that's my problem. Yeah, maybe you should just not straight ball. I should just raw dog it from here and uh here on up. You should just squat every time. Problem solved.",
    "timestamp" : "01:23:49-01:24:00",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I I think there is something to squatting. Not gonna rule it out.",
    "speaker" : "Greg",
    "timestamp" : "01:24:00-01:24:07"
  },
  {
    "timestamp" : "01:24:07-01:24:18",
    "speaker" : "Andy",
    "text" : "Uh all right, speaking of um coil turds, you guys wanna do your best and worst? Oh, you know what we haven't done? Speaking of coil turns."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:24:18-01:24:23",
    "text" : "Um we haven't given this game a watchability score."
  },
  {
    "text" : "It's I think we'll start with Greg because um That way you can get the watchability score of the highlights of this game.",
    "speaker" : "Andy",
    "timestamp" : "01:24:23-01:24:31"
  },
  {
    "speaker" : "Greg",
    "text" : "Well the highlights are worth watching, I think. The uniforms were unique. Oh, good call. Um, the prime time is on the internet.",
    "timestamp" : "01:24:32-01:24:40"
  },
  {
    "text" : "Place to keep keep you interesting?",
    "timestamp" : "01:24:40-01:24:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, the prime time is on YouTube. So true. Chris Berman, classic. Yeah. I think I'm gonna I think I'm gonna bow out of these these ratings given that I don't watch the games.",
    "timestamp" : "01:24:42-01:24:55"
  },
  {
    "timestamp" : "01:24:57-01:25:06",
    "speaker" : "Steve",
    "text" : "I give us a watchability of the highlights because they're always like four Lombardi, some somewhere like six of them. You can always tell how long they are too. The longer the highlight, the better."
  },
  {
    "timestamp" : "01:25:07-01:25:16",
    "speaker" : "Greg",
    "text" : "Yeah, that's a pretty good highlight, I guess. Four? What are we out of six? Just let me not do these ones."
  },
  {
    "text" : "You you setting when you do it.",
    "timestamp" : "01:25:19-01:25:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:25:25-01:25:31",
    "speaker" : "Greg",
    "text" : "Alright, fine. From here on out, Andy, I'm just gonna give you one word answers. Four. Okay. Great. That's all I need."
  },
  {
    "speaker" : "Andy",
    "text" : "Cool.",
    "timestamp" : "01:25:31-01:25:32"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:25:32-01:25:32",
    "text" : "Four."
  },
  {
    "text" : "Okay, that's that's pretty high. Steve, what would you give this?",
    "timestamp" : "01:25:32-01:25:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Ooh, uh I got two. Yeah, that's where I was having some some novelty to it, but honestly, the the Patriots are so sloppy and it was just such a blowout after that fumbled screen pass and then it just went it just snowballed and it was frustrating.",
    "timestamp" : "01:25:35-01:25:56"
  },
  {
    "timestamp" : "01:25:57-01:26:34",
    "text" : "Yeah anytime the patrons are down and it's garbage time which I feel doesn't happen often. Like even these other losses, they've still been in it at the end. But this one was like, it's 28 to 3 and there's no chance they're coming back. It's in the rain. The like Greg said, the uniforms were nice with the blues and everything. There was a couple of good plays there, but I think two is probably about as generous as you can get when you lose the turnover battle four to nothing. And you commit 12 penalties for 126 yards. Mm-hmm. Yeah. So yeah, I mean we could do bests and worst. Does anybody have a best?",
    "speaker" : "Andy"
  },
  {
    "text" : "We've already done them all in the play of the game. Maybe. I've used all my notes.",
    "speaker" : "Greg",
    "timestamp" : "01:26:36-01:26:40"
  },
  {
    "speaker" : "Andy",
    "text" : "All three of them.",
    "timestamp" : "01:26:41-01:26:42"
  },
  {
    "timestamp" : "01:26:43-01:26:46",
    "text" : "I come on, I had some good breath fire stats in there.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:26:46-01:26:51",
    "speaker" : "Andy",
    "text" : "That's true. Um I have some worst."
  },
  {
    "speaker" : "Greg",
    "text" : "Darren Sharper.",
    "timestamp" : "01:26:52-01:26:54"
  },
  {
    "text" : "Um well Uh the Pages red zone defense they sort of showed a stat last season. Um the touchdown percentage, the Patriots allowed a touchdown on thirty-nine percent of red zone. uh appearances by the other teams offense, which was good for third in the NFL. This season they've allowed a touchdown on seventy-nine percent. Oh teams, which is good for thirty-first.",
    "timestamp" : "01:26:56-01:27:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Red zone T D percentage is statistically random year to year though, right? Is it? I don't know. How do you how do you quantify it being statistically random? That dude uh Bill Barnwell on ESPN is all about that. What makes everything?",
    "timestamp" : "01:27:25-01:27:41"
  },
  {
    "timestamp" : "01:27:42-01:27:43",
    "text" : "I can see that just yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:27:43-01:27:51",
    "text" : "Like a good red zone defense last year does not predict a good red zone defense this year. Uh and doesn't mean you're gonna be good next year either."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I see what you're saying. Yeah, I mean I think if you're a a decent run defending team, you probably have a slightly I w I wonder if that correlates with having a better red zone defense. Yeah, we'll have to write that down, Greg.",
    "timestamp" : "01:27:51-01:28:08"
  },
  {
    "speaker" : "Greg",
    "text" : "If we have mom, we'll uh what's the p value on statistical correlation year to year?",
    "timestamp" : "01:28:08-01:28:14"
  },
  {
    "text" : "Yeah, for or or is there a correlation between run defense and uh red zone defense?",
    "timestamp" : "01:28:14-01:28:20",
    "speaker" : "Andy"
  },
  {
    "text" : "All right.",
    "timestamp" : "01:28:21-01:28:21",
    "speaker" : "Mom"
  },
  {
    "speaker" : "Andy",
    "text" : "Because the uh last four rushers the Patriots have faced Week three, Priest Holmes ran for 180 yards. Week four, LT ran for 217. Week five, Ricky Williams ran for 105. And this week, Amon Green ran for 120. So that's not going to correlate into a good defense in any phase. No. Um and uh on the other side of the ball, Tom Brady has performed probably just as bad. In his first 14 quarters, he had 11 touchdowns, two interceptions. In his last nine quarters, he's had two touchdowns and seven interceptions. And the completion percentage has dropped from 70% to under 60. 58 and a half. He sucks. But The worst in this game. They showed a sign. This was it had to be in garbage time. Somebody must have been a Packer fan. Maybe came from Green Bay. And a big old picture of Brett Favre on it and the sign says you've just been farved. Oh. And Greg's boy, Chris Callsworth. decided with the the yellow markup thing that they do um to cross out the R because we're in New England so it's faved.",
    "timestamp" : "01:28:21-01:29:40"
  },
  {
    "speaker" : "Steve",
    "text" : "I like Colin's earth. Do you do you think he put that on the caption of his dick pic to Jen Sturger and like you've just been farved?",
    "timestamp" : "01:29:42-01:29:51"
  },
  {
    "speaker" : "Andy",
    "text" : "You've just been farved. No, that should be the name of the 30 for 30.",
    "timestamp" : "01:29:51-01:29:57"
  },
  {
    "speaker" : "Greg",
    "text" : "Isn't his name the most like infuri infuriating spelling ever? This is what I mean. It's it has to be a typo, right? Like somewhere along the line on a birth certificate it was a typo.",
    "timestamp" : "01:29:58-01:30:11"
  },
  {
    "timestamp" : "01:30:10-01:30:16",
    "speaker" : "Andy",
    "text" : "Oh yeah, like when his family came over and they were in like Staten Island. This And I was like, Faved? Yeah, sure, fuck it. And just like wrote something down."
  },
  {
    "speaker" : "Steve",
    "text" : "Get the fuck out of here, Fav.",
    "timestamp" : "01:30:17-01:30:18"
  },
  {
    "timestamp" : "01:30:19-01:30:29",
    "speaker" : "Greg",
    "text" : "Like some some you can be like, all right, yeah, like you the Latin, you know, pronunciation, but but there's no way you pronounce F-A-V-R-E as far."
  },
  {
    "speaker" : "Andy",
    "text" : "Right, does it doesn't make any sense?",
    "timestamp" : "01:30:30-01:30:32"
  },
  {
    "text" : "The R sounds become comes before the V sound. It drives me crazy. It I actually like the I watched the football life, Brett Favre, and when they announced him when he got drafted, they pronounce his name wrong. They were like Brett Favor. Uh I don't know. I think at some point you just gotta fix it, you know?",
    "timestamp" : "01:30:32-01:30:59",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:31:00-01:31:11",
    "text" : "Right. My best is Troy Brown's back catching balls. Yeah, he is. My worst is Brian Kelly's in defending balls.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that's fair.",
    "timestamp" : "01:31:13-01:31:15"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:31:15-01:31:21",
    "text" : "Now Brown, there is the last name I can get behind. Oh, of course. How do you spell it?"
  },
  {
    "speaker" : "Steve",
    "text" : "Have you ever had anybody fuck your name up? Yes.",
    "timestamp" : "01:31:21-01:31:24"
  },
  {
    "text" : "Oh, I've had people ask how to spell it. Yeah. Brown like the color? Yeah, like no the other thing. Here's my brown with an ear.",
    "timestamp" : "01:31:24-01:31:33",
    "speaker" : "Andy"
  },
  {
    "text" : "Have you ever oh there's a double sided uh coin here, right? Because sometimes at the bar you'll get drinks put on your tab that aren't your drinks. And trying to argue that in a bar at like two in the morning when you're drunk is really hard. Like, no, I don't drink dra I don't drink Jack and Coke. Like yes you do. They're on your no dude, there's gonna be another brown in here.",
    "timestamp" : "01:31:34-01:31:55",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:31:56-01:31:58",
    "text" : "I'm not gonna lie, I just leave bars."
  },
  {
    "timestamp" : "01:32:00-01:32:06",
    "speaker" : "Steve",
    "text" : "So you just collect all the browns on the on the whatever browns are floating out and come to you But my strategy."
  },
  {
    "speaker" : "Greg",
    "text" : "Hey, you guys figured this all out.",
    "timestamp" : "01:32:06-01:32:08"
  },
  {
    "speaker" : "Steve",
    "text" : "I go to the first show up and they go, What's the what's your tab under? I say brown, like the color. And look at me like yeah, no shit. But I say that every single time. So like yeah, that's the dumbass. He says brown like the color.",
    "timestamp" : "01:32:09-01:32:23"
  },
  {
    "timestamp" : "01:32:24-01:32:28",
    "speaker" : "Greg",
    "text" : "I've always wondered how like what's stopping people from just like putting it under a different tab."
  },
  {
    "timestamp" : "01:32:28-01:32:33",
    "speaker" : "Steve",
    "text" : "There's nothing. You can go they'd be like, yeah, Smith. Uh which Smith? Um John."
  },
  {
    "text" : "Or you just overhear someone at the bar putting saying their name and you just use theirs for the rest of the night.",
    "timestamp" : "01:32:34-01:32:39",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:32:39-01:32:39",
    "text" : "Yeah."
  },
  {
    "text" : "Ain't nothing.",
    "timestamp" : "01:32:40-01:32:41",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "And I wouldn't do it because I'm uh a brown and we are virtuous upstanding citizens like Troy. Yeah.",
    "timestamp" : "01:32:41-01:32:48"
  },
  {
    "text" : "Yeah, we have a name to protect.",
    "timestamp" : "01:32:48-01:32:49",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:32:50-01:32:52",
    "speaker" : "Steve",
    "text" : "Mm-hmm. Troy, if you're listening, we'd never let you down."
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, my best in this game was uh the banter between the three. Well, actually it was more Collinsworth and Eggman. They were explaining how Aikman was uh a good wet ball thrower. He's a bad wet ball thrower. Oh right, you're right. And Collinsworth because he didn't grip the laces, and Collinsworth's quote was, You're one of the great wet ball throwers, even though he wasn't.",
    "timestamp" : "01:32:52-01:33:16"
  },
  {
    "timestamp" : "01:33:16-01:33:18",
    "speaker" : "Steve",
    "text" : "I feel like they secretly hated each other."
  },
  {
    "timestamp" : "01:33:18-01:33:29",
    "speaker" : "Andy",
    "text" : "It felt that way because then Aikman was relentless about Collinsworth's hair to the point where Collinsworth like definitely got self-conscious about it and kept bringing it up about how he had fixed his hair."
  },
  {
    "speaker" : "Steve",
    "text" : "It was a little awkward in that booth for a bit. I bet Dick was like, what have I got myself into? How does Joe Buck do this? And Joe Buck's like, I don't have any feelings, so I'm good.",
    "timestamp" : "01:33:30-01:33:40"
  },
  {
    "text" : "Oh, Steve Brad. I feel I have to say I feel like Steve Brown has come into his own in season two of this podcast. And maybe we're just that.",
    "speaker" : "Andy",
    "timestamp" : "01:33:41-01:33:51"
  },
  {
    "text" : "putting more beers into it, you know? More effort. Drinking beforehand.",
    "speaker" : "Steve",
    "timestamp" : "01:33:51-01:33:55"
  },
  {
    "timestamp" : "01:33:55-01:33:59",
    "text" : "Yeah. As it should be. Yeah. You weren't before?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:33:59-01:34:02",
    "text" : "Uh in that wine episode, you know."
  },
  {
    "text" : "Yeah, that's fair.",
    "timestamp" : "01:34:03-01:34:04",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:34:04-01:34:10",
    "speaker" : "Steve",
    "text" : "Alright, who we got next week? Hopefully this is the week we break the streak, but I don't know. I guess I'll find out. Don't ruin it"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:34:10-01:34:15",
    "text" : "Next week, the Patriots still at home hosting the Denver Broncos."
  },
  {
    "timestamp" : "01:34:15-01:34:22",
    "text" : "I don't have a lot of high hopes. This is post-John Oway, yes? Yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "I mean he didn't play last on LA. You were there for that. I was. Because it was um Uh what's his name? Um Brian Greasy? Yeah, Brian Greasy, who was uh Brady's starter at uh Michigan. Good call. So something to look forward to perhaps.",
    "timestamp" : "01:34:22-01:34:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:34:48-01:34:51",
    "speaker" : "Steve",
    "text" : "Well either way I agree with the Broncos. I hate the Broncos."
  },
  {
    "text" : "Me too. I hope there's commentators that are there that I hate too. We can just handle together.",
    "timestamp" : "01:34:53-01:34:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Pray for Dan Deerdorf.",
    "timestamp" : "01:34:57-01:34:59"
  },
  {
    "timestamp" : "01:34:59-01:35:09",
    "speaker" : "Andy",
    "text" : "Oh my god, you'll come around. Greg's like, oh I I don't buy Collinsworth, but fucking Give us another like 20 episodes and you'll be like awesome."
  },
  {
    "timestamp" : "01:35:13-01:35:16",
    "speaker" : "Steve",
    "text" : "I don't mind him at all. I like how he calls out the refs."
  },
  {
    "timestamp" : "01:35:17-01:35:18",
    "speaker" : "Greg",
    "text" : "Give it time"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:35:18-01:35:22",
    "text" : "There's there's legitimate bad and good announcers, right?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:35:22-01:35:45",
    "text" : "Like Diodorf, I admit he's terrible. Terrible. But you you hate like 90% of them? Yes. So it's definitely a personal thing. If you hate some and you like some and you're somewhere in the middle there. Yeah, that's a good one. I like some. You hate 'em all. Nope, not all of 'em. I like Romo. You just dig in your heels and just admit you hate them all. I like Romo."
  },
  {
    "timestamp" : "01:35:46-01:35:50",
    "speaker" : "Steve",
    "text" : "And uh that ref with the big biceps, I like him too. I can't stand that guy. That guy's a dick."
  },
  {
    "timestamp" : "01:35:51-01:35:51",
    "speaker" : "Greg",
    "text" : "Yeah, I'm just kidding."
  },
  {
    "speaker" : "Steve",
    "text" : "And he hate all about refs and one commentator and so like, yeah, I'm not like I don't hate all of them. No.",
    "timestamp" : "01:35:52-01:35:57"
  },
  {
    "timestamp" : "01:35:58-01:35:59",
    "speaker" : "Greg",
    "text" : "Andy likes himself as a ref."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:36:00-01:36:01",
    "text" : "Like, see?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:36:01-01:36:03",
    "text" : "So I don't hate four."
  },
  {
    "text" : "I'd be I'd be much better referee than they would. Guaranteed. All right. Well, you'll find out who we hate next week. when we uh when we have the Denver Broncos into town. Hopefully the patriots get off the schneid. We will see you then on the Patriots Dynasty podcast. Bye guys. See you later.",
    "speaker" : "Andy",
    "timestamp" : "01:36:03-01:36:24"
  }
]