[
  {
    "timestamp" : "00:00-00:18",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother.",
    "speaker" : "Mom"
  },
  {
    "text" : "Welcome back everybody. Especially the two of my brothers. Nice to see you guys again.",
    "timestamp" : "00:24-00:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Andy, we've been here this entire time.",
    "timestamp" : "00:30-00:32"
  },
  {
    "text" : "Wait, you you don't you don't go away after we finish?",
    "speaker" : "Andy",
    "timestamp" : "00:33-00:36"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "00:36-00:41",
    "text" : "No, I just feel like we've been on every episode for a while. There was a bit there where we missed a bunch."
  },
  {
    "timestamp" : "00:42-00:52",
    "speaker" : "Andy",
    "text" : "Yeah, early on. Basically pre-COVID. You boys had lives and the podcast wasn't important. Hanging out with your older brother was not as important as it is now."
  },
  {
    "timestamp" : "00:52-01:01",
    "speaker" : "Greg",
    "text" : "Well it's more Greg. It it'll revert back to that once you know, I have better and cooler friends to hang out with than you guys."
  },
  {
    "timestamp" : "01:02-01:05",
    "text" : "So you mean if It reverts.",
    "speaker" : "Andy"
  },
  {
    "text" : "If it doesn't and I'm just stuck with you two chumps, I'm I'll I'll honestly take my own life.",
    "speaker" : "Greg",
    "timestamp" : "01:07-01:14"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh good to see you too. Anyway, this is 2002 week nine in Orchard Park. New York? Right? It's not technically Buffalo, is it? I don't know. Stat Trek? Fuck is Buffalo.",
    "timestamp" : "01:15-01:33"
  },
  {
    "timestamp" : "01:33-01:44",
    "text" : "Are the Bills stadium in Buffalo? It is. It's like in the suburbs. It's like you're just driving past houses, houses, houses, boom.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I think so. I think Siri.",
    "timestamp" : "01:47-01:49"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:50-01:52",
    "text" : "Is Buffalo a city?"
  },
  {
    "speaker" : "Siri",
    "text" : "According to WN dot com Buffalo Flow Is the city in western New York in the seat of Erie County, located on the eastern shores of Lake Erie?",
    "timestamp" : "01:53-02:01"
  },
  {
    "speaker" : "Greg",
    "text" : "I hate Siri so much. I've been trying to I like I took like two years off from Siri when they invented it and I was like it's no it technology's not there yet. I'll come back. And I think it will be. And I came back and it still blows.",
    "timestamp" : "02:04-02:18"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:19-02:21",
    "text" : "I'm not a big talker to technology."
  },
  {
    "text" : "Yeah. It's a similar feeling we get when we say, hey stat check.",
    "timestamp" : "02:25-02:29",
    "speaker" : "Andy"
  },
  {
    "text" : "Should we just start calling Greg Siri?",
    "speaker" : "Steve",
    "timestamp" : "02:31-02:32"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Well we were calling him Alexa for a while.",
    "timestamp" : "02:33-02:35"
  },
  {
    "text" : "We can call him Greary.",
    "timestamp" : "02:37-02:39",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:40-03:02",
    "speaker" : "Greg",
    "text" : "The difference is when you insult me like you just did, you can see my reaction and get some satisfaction in knowing that you hurt me on the inside, right? Theory is just like, please don't say that. I want Siri to be offended. Exactly. I'm in on that. Tell her she's a goddamn bitch."
  },
  {
    "timestamp" : "03:04-03:28",
    "text" : "Uh speaking of batches, this is the game that uh I don't even remember what channel it was that was broadcasting this, but they deem this the Bled So Bowl because Drew Bledsoe and in his revenge game against a team that traded him in the division after giving him a 10-year, $100 million contract.",
    "speaker" : "Andy"
  },
  {
    "text" : "Is so bold.",
    "timestamp" : "03:28-03:29",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:30-03:33",
    "speaker" : "Andy",
    "text" : "And he was doing well so far this season."
  },
  {
    "speaker" : "Steve",
    "text" : "They were the number one offense, right?",
    "timestamp" : "03:33-03:35"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:36-03:44",
    "text" : "Uh, they were up there. I know Blood to himself was second in the NFL in passing yards per game and touchdown passes coming into this."
  },
  {
    "text" : "I feel like the commentators said they were the number one offense.",
    "timestamp" : "03:44-03:48",
    "speaker" : "Steve"
  },
  {
    "text" : "I mean I mean if it makes sense like Eric Mold's Travis Henry over under his forty seven and a half, so pretty high.",
    "timestamp" : "03:49-03:58",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, they were uh they're putting up a lot of points too. I don't think their defense had played very well because they were losing games like forty to forty-three in overtime. I think the the first few games went to overtime. But they came into this game at 5-3 on a three-game win streak. They were one game behind the AFC East leading Miami Dolphins, who I think were five and two. Um they beat the Texans, Dolphins, and Lions coming in.",
    "timestamp" : "03:59-04:26"
  },
  {
    "text" : "So I have a confession to make.",
    "timestamp" : "04:26-04:29",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh oh",
    "timestamp" : "04:30-04:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "04:31-04:59",
    "text" : "Well, like I'd kept myself intentionally in the dark on when the slide was gonna end. You know? Yeah, we talked about that later. I knew this was the longest losing streak of the Patriots dynasty and I didn't know when it was gonna end, but then I saw the bills and I was like, well Tom Brady's like 28 to 3 against the Bills, and I know exact I can like list off all three losses. So he's definitely gonna win this game."
  },
  {
    "text" : "Yeah. So I ca I came into it kind of with a similar feeling except I knew what the score was. Uh because I have to just to put the show notes together.",
    "timestamp" : "05:00-05:08",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "05:08-05:09",
    "speaker" : "Steve",
    "text" : "Throw it out there."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:10-05:11",
    "text" : "Uh do you want to do the honors?"
  },
  {
    "timestamp" : "05:12-05:15",
    "text" : "Uh I don't remember. Shitload to nothing.",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh 38 to 7 was the final score.",
    "timestamp" : "05:16-05:18",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "05:18-05:18",
    "speaker" : "Steve"
  },
  {
    "text" : "It was a slacking. Yeah. And I think 38 was actually probably higher than the amount of Bills fans left in the stadium. Uh from the state of the state.",
    "timestamp" : "05:18-05:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Dude, there's a ton of Pats fans there though.",
    "timestamp" : "05:29-05:31"
  },
  {
    "text" : "Yep. There's a good amount, which the both announcers seemed surprised by.",
    "speaker" : "Andy",
    "timestamp" : "05:31-05:35"
  },
  {
    "text" : "You not taking into account that Buffalo is drivable from New England, but they did, but they also threw out a bunch of cred to Bill's Mafia.",
    "timestamp" : "05:35-05:43",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "05:43-05:49",
    "text" : "Yeah. I mean you have to consider it is drivable, but why would anybody want to go there?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:49-05:52",
    "text" : "Because they're cheaper tickets than Foxborough."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "05:53-06:02",
    "text" : "Were they at that point though? I don't know. They lost four in a row, you know, like I don't know. This isn't like the Patriots tickets we know and hate."
  },
  {
    "text" : "And it's the city of Buffalo. Like you go there, you go to the game, then you go home. You're not like going for the nightlife and also catching a game.",
    "timestamp" : "06:02-06:09",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "06:10-06:10"
  },
  {
    "text" : "You know?",
    "speaker" : "Greg",
    "timestamp" : "06:10-06:11"
  },
  {
    "timestamp" : "06:12-06:17",
    "speaker" : "Andy",
    "text" : "Well, I mean that's what you would do, right? You would go to the casino in uh what's it?"
  },
  {
    "timestamp" : "06:17-06:18",
    "speaker" : "Steve",
    "text" : "Niagara Falls."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "06:18-06:18",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Niagara, yeah.",
    "timestamp" : "06:18-06:19"
  },
  {
    "text" : "That's on the way. I revel in the filth though, you know? And I don't think a lot of people that are jet setters like love like a grimy, dirty time where I do. I believe the phrase is pig and shit Yes.",
    "timestamp" : "06:20-06:32",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Happy is a big insh, I believe it is the entire phrase, which sums every up perfectly.",
    "speaker" : "Andy",
    "timestamp" : "06:32-06:37"
  },
  {
    "text" : "Um yeah, so the The Patriots The Patriots punted once this game.",
    "speaker" : "Greg",
    "timestamp" : "06:38-06:42"
  },
  {
    "timestamp" : "06:42-06:42",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "06:43-06:44",
    "text" : "Yeah, I don't know."
  },
  {
    "speaker" : "Steve",
    "text" : "I just I enjoyed that the announcers called out and they showed some Bills fans in the stadium. Like looking like Dorothy from Wizard of Oz, and like they had like a Wizard of Oz character getting on. It's good to know that like Bill's mafia is pre-social media.",
    "timestamp" : "06:44-07:02"
  },
  {
    "text" : "Oh yeah. No, this was yeah, even this was.",
    "timestamp" : "07:02-07:04",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "07:04-07:15",
    "text" : "You know, they're not you you can you can tell that Bill's Mafia is not doing it for the social media fame. Maybe that's like supercharged a little bit, but it's always been there. That's that's been my take about this."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. And that's like the d the huge difference between like the uh whatever the twelfth man that Seattle does, whatever they call it the twelves. That's the the big difference, right? Really passionate fan base, but they are so fucking corny and forced and like you can tell they're doing it to like, hey, look at me, whereas Buffalo, it's the most authentic ridiculous fan based ever. A hundred percent. Yeah. And I hope they never change. And part of me thinks that they aren't like on social media so they'll never even re realize that they have this following.",
    "timestamp" : "07:16-07:50"
  },
  {
    "timestamp" : "07:51-07:52",
    "speaker" : "Andy",
    "text" : "They haven't got the internet up in Buffalo yet."
  },
  {
    "timestamp" : "07:53-07:54",
    "text" : "Hopefully they don't listen to this podcast.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "We just got it now in New Hampshire, so They'll get it next 10 years or something. Yeah, there were some uh uh so actually, yeah, let's let's do the uh let's give a watchability score. Um Greg, you don't have to because you didn't watch again, I'm sure. But",
    "timestamp" : "07:55-08:06"
  },
  {
    "speaker" : "Steve",
    "text" : "Did you actually watch it, Greg?",
    "timestamp" : "08:07-08:09"
  },
  {
    "text" : "No, I watched the highlights.",
    "timestamp" : "08:09-08:10",
    "speaker" : "Greg"
  },
  {
    "text" : "Okay.",
    "timestamp" : "08:11-08:11",
    "speaker" : "Andy"
  },
  {
    "text" : "As like a competitive game, not very competitive, but nothing like snapping the slide by absolutely burying the bills.",
    "speaker" : "Steve",
    "timestamp" : "08:20-08:29"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, see, I disagree with you. Because going into this, like we've been doing a month of Patriots losses on this podcast. We record once a week, and the last four weeks have been Like more and more brutal losses.",
    "timestamp" : "08:29-08:45"
  },
  {
    "text" : "Wait, is that it was only four games in a row they lost?",
    "timestamp" : "08:45-08:49",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, count 'em.",
    "speaker" : "Andy",
    "timestamp" : "08:49-08:50"
  },
  {
    "timestamp" : "08:51-08:56",
    "speaker" : "Steve",
    "text" : "That's the longest losing streak in Patriots' history is four games in a row. Yeah, you made it."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:56-08:57",
    "text" : "How do you feel?"
  },
  {
    "text" : "Uh vindicated. Like a new man, like a new appreciation. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "08:59-09:04"
  },
  {
    "timestamp" : "09:04-09:05",
    "text" : "So it's four games, but there was a bye week.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "09:06-09:12",
    "text" : "Can we take a moment and appreciate that? The longest losing streak is four games.",
    "speaker" : "Steve"
  },
  {
    "text" : "Right. And we almost stopped doing the podcast because of it.",
    "timestamp" : "09:12-09:15",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "09:15-09:27",
    "speaker" : "Steve",
    "text" : "The Lions lost all sixteen in a year. That's insanity. Yeah. Didn't the the Tampa Bay Bucks lose like twenty-something over two seasons?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, they almost went two full seasons before they won their first football game. I can't imagine I",
    "timestamp" : "09:27-09:32"
  },
  {
    "text" : "I can't wrap my head around being a fan of a team that's just so bad Well, but the Because like we were Patriots fans when we were little kids. But we were little kids, you know?",
    "speaker" : "Steve",
    "timestamp" : "09:33-09:47"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:47-09:48",
    "text" : "Yeah, we didn't really know."
  },
  {
    "timestamp" : "09:48-10:01",
    "text" : "I can't imagine being a 30-year-old man and being like, Yeah, well, the lions are gonna suck dick again. We're gonna make a bunch of dumb front office moves and we're gonna draft a wide receiver in the first round. That's just what we do.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "10:02-10:12",
    "speaker" : "Greg",
    "text" : "Um the Celtics are kind of dog shit for a while there. That's true. Well early Pierce. Yeah, early Pierce."
  },
  {
    "speaker" : "Steve",
    "text" : "I mean the Pierce and Antoine were fun to watch, but I mean they won that one playoff game against Indiana, which we enjoyed. And then they pulled it together at the end of it. Yeah.",
    "timestamp" : "10:12-10:25"
  },
  {
    "timestamp" : "10:26-10:31",
    "speaker" : "Greg",
    "text" : "But they've always been competitive. Like all the Boston teams have been like On and off competitive at least some point."
  },
  {
    "timestamp" : "10:31-10:31",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "10:36-10:39",
    "text" : "Mm-hmm. The Celtics rebuild year was pretty bad.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "But like having one team just be Awful for super duper long. Especially if it's like your favorite team. That's gonna be so tough. Yeah.",
    "timestamp" : "10:40-10:47"
  },
  {
    "timestamp" : "10:47-10:53",
    "speaker" : "Andy",
    "text" : "It's true. Yeah, because I don't really give a shit about the other sports. Like you guys were bad, it'd be just because you're closed-minded."
  },
  {
    "text" : "I just I don't know what I like. Again, I watched this game and I I I felt very well a sense of appreciation. Like this is the worst that you have to deal with for the next eighteen years.",
    "speaker" : "Steve",
    "timestamp" : "10:54-11:08"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "11:08-11:28",
    "text" : "Right, but that's what I'm saying. It's like this game was kind of the sports uh equivalent of like going on a really long car ride, say to Buffalo, New York, and getting out like hat busting, having a piss and taking that piss and it's just like the relief and the feeling of it."
  },
  {
    "speaker" : "Greg",
    "text" : "Or, you know, I'm sure there's other examples that we won't get into, but shaving your half beard off.",
    "timestamp" : "11:28-11:38"
  },
  {
    "timestamp" : "11:39-11:42",
    "speaker" : "Andy",
    "text" : "Oh yeah, there you go. And just just feeling the lightness."
  },
  {
    "timestamp" : "11:43-11:49",
    "text" : "Well, is that I mean like a feeling a deep sense of regret for it. Immediate regret.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "So I'll be on a Bills fan. I wake up every morning, Greg. Or going camping for a week.",
    "timestamp" : "11:50-11:56"
  },
  {
    "timestamp" : "11:57-12:02",
    "text" : "When you look at yourself in the mirror and you feel shame. That's is that what you're talking about?",
    "speaker" : "Greg"
  },
  {
    "text" : "That's that's yeah, it's being a bithit. But no, talk about like, you know, you go camping for a week and you know, you you get all super dirty, never feel clean, then you come home and take a short shower. Yeah, exactly. You sleep in your your clean bed that first night. That's what this football game felt like to me.",
    "timestamp" : "12:02-12:17",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "12:17-12:22",
    "speaker" : "Steve",
    "text" : "I agree. And I'm I'm not discounting that, but it was only four games."
  },
  {
    "text" : "Only? This is the longest losing streak we've had to endure and we'll have to endure.",
    "timestamp" : "12:23-12:27",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh but like we've had to endure like think about all the other people we've had on this podcast and we will have on the podcast of like God just Cleveland Browns fans.",
    "timestamp" : "12:27-12:39"
  },
  {
    "timestamp" : "12:39-12:48",
    "speaker" : "Greg",
    "text" : "But also like expectations too. Exactly. It doesn't feel that bad when you're not coming off a Super Bowl."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:48-12:49",
    "text" : "Yeah. When you're expected to lose."
  },
  {
    "timestamp" : "12:50-12:59",
    "speaker" : "Steve",
    "text" : "Right. Still though. I think it's I mean you get like a you get an odd bone here and there with like a an occasional win and you're like four and twelve."
  },
  {
    "timestamp" : "12:59-13:10",
    "speaker" : "Greg",
    "text" : "Yeah, but that you're you're playing Yeah, you're playing not to have a good season, but to have good games within a season. Exactly. Yeah, but this game felt like I've played on soccer teams like that."
  },
  {
    "timestamp" : "13:12-13:25",
    "text" : "There are there are some Cleveland Browns fans out there who would love to do the same sort of podcast idea of rewatching every Cleveland Browns game from 2001, but they're like Actually, we absolutely blow the entire team.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't think they would though. I don't even think that would cross their mind because they they haven't had any success. It's like why would you anybody that sucks for them though?",
    "timestamp" : "13:26-13:34"
  },
  {
    "text" : "That's why we're gonna do it for them, browns on browns. Browns on browns on browns.",
    "speaker" : "Greg",
    "timestamp" : "13:34-13:38"
  },
  {
    "speaker" : "Andy",
    "text" : "Browns on browns on browns. Don't think I haven't looked up how many uh players named Brown have started for the Cleveland Browns over the years. How many? Uh there are one, two states five, six, seven, eight. Eight. Courtney Brownson, Jim. Courtney Brown. Oh yeah. Oh, you want to do this? All right. Yep.",
    "timestamp" : "13:39-13:59"
  },
  {
    "timestamp" : "14:00-14:02",
    "speaker" : "Greg",
    "text" : "Jim. Jim Brown."
  },
  {
    "timestamp" : "14:02-14:17",
    "speaker" : "Andy",
    "text" : "Jim Brown. Courtney Brown. You'll know when I know any. Played for the Patriots. Yeah. More recent than more recent than Courtney Brown. Defensive lineman. Malcolm Brown. Bill like a square."
  },
  {
    "speaker" : "Steve",
    "text" : "Malcolm Brown. No.",
    "timestamp" : "14:17-14:18"
  },
  {
    "text" : "Built like a square. Yeah. Name Brown? I got nothing. Oh, sorry. No, I'm thinking somebody else. He's a cornerback for Philly for a long time.",
    "speaker" : "Andy",
    "timestamp" : "14:19-14:31"
  },
  {
    "timestamp" : "14:33-14:38",
    "text" : "Oh. Uh Chris Brown. Malcolm. Malcolm Brown.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "No, Sheldon Brown.",
    "timestamp" : "14:38-14:39"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "14:39-14:41",
    "text" : "Sheldon Brown. Sheldon Brown."
  },
  {
    "text" : "So Sheldon Brown, Courtney Brown, Lomas Brown.",
    "speaker" : "Andy",
    "timestamp" : "14:42-14:45"
  },
  {
    "text" : "I believe it was uh speaking of Sheldon, tune in this Sunday for Young Sheldon. That's about sports.",
    "timestamp" : "14:45-14:56",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, it's fucking young Sheldon commercials. I am I have been surprised by how often they're pushing the fantasy football angle. Yeah, it started. Like to me in my head, fantasy didn't start until like Randy Moss and Tom.",
    "timestamp" : "14:56-15:10"
  },
  {
    "timestamp" : "15:11-15:13",
    "text" : "This is like uh the CBS one too, which I think is a paper.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:14-15:29",
    "speaker" : "Steve",
    "text" : "Yeah. But like it's it's strange to see like in 2001 and even two thousand two, like NFL. com. Well AOL keyword NFL. com. Yeah. Fantasy. You know, like it's weird how early they're pushing it."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:30-15:33",
    "text" : "Yeah, it's true. Do we want to talk about these bills?"
  },
  {
    "timestamp" : "15:33-15:34",
    "text" : "I guess.",
    "speaker" : "Steve"
  },
  {
    "text" : "So yeah, I just I just want to set the scene though for me watching this game. So yeah. I made it into a little event and ran myself a bath. Pour a glass of wine, lit some candles. Really? Washi. I took no notes. Just revel. Do you even have a bathtub in your house? Yeah, do you bathe? Uh not often, but yes. I like I like to save it up for weeks other than that that that first.",
    "timestamp" : "15:34-15:56",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh yeah bubbles.",
    "speaker" : "Greg",
    "timestamp" : "16:02-16:02"
  },
  {
    "text" : "Yeah, sometimes a bath bomb.",
    "timestamp" : "16:04-16:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "See the thing the thing about baths that uh is it's always like uh decreasing returns, right? the best part is getting in when it's super hot and then it just gets worse and worse. So I don't I don't really like bass for that reason.",
    "timestamp" : "16:05-16:18"
  },
  {
    "text" : "Yeah you gotta keep the hot water running.",
    "speaker" : "Andy",
    "timestamp" : "16:18-16:20"
  },
  {
    "text" : "That's what Kelly told me. That's a genius idea. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "16:20-16:23"
  },
  {
    "text" : "But my problem with bass is I'm too big for 'em So I can never all the way underwater. The head floats, it's weird. Sticks out if it's cold. Dick won't fit in the tub. No, my knees don't. A cold knees Yeah. Oh Lordy.",
    "timestamp" : "16:23-16:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "See watching big It's either I take the bath or the dick takes the bath. None of my favorite ones.",
    "timestamp" : "16:51-16:59"
  },
  {
    "text" : "Yeah, I usually shower, but then I'll after I'll take a bath, a dick bath.",
    "timestamp" : "17:00-17:04",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "17:09-17:20",
    "text" : "Um I did think the Bills were super stacked on offense. Oh god. They had Drew Bledsel, who was still legit as fuck back then. Yeah. No matter what you said.",
    "speaker" : "Steve"
  },
  {
    "text" : "I think this was like his best year.",
    "speaker" : "Andy",
    "timestamp" : "17:21-17:22"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "17:22-17:23"
  },
  {
    "timestamp" : "17:23-17:25",
    "speaker" : "Andy",
    "text" : "At least up until this point it was."
  },
  {
    "timestamp" : "17:25-17:38",
    "speaker" : "Steve",
    "text" : "They had uh those two sick receivers. Eric Mole and Pearless Price. Who was the third receiver that was also super good as a rookie? Josh Reed. He played pretty well. Yeah, Josh Reed. Uh Jay Remersma."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "17:39-17:40"
  },
  {
    "text" : "Sweet name for time and yeah. Oh yeah. Travis Henry, like Greg, is in your number one Hall of Fame of kids, right? Oh yeah, he's got very good seed. Yeah.",
    "timestamp" : "17:41-17:54",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "17:55-18:00",
    "speaker" : "Greg",
    "text" : "I mean for those of you that don't know, he has like fifteen children by like twelve women."
  },
  {
    "speaker" : "Andy",
    "text" : "So Antonio Cromardi are",
    "timestamp" : "18:01-18:03"
  },
  {
    "speaker" : "Steve",
    "text" : "Didn't they ask him about it and he's like all there is to do in Buffalo is fuck. That might have been uh no it's him or Willis McGahee, one of the two.",
    "timestamp" : "18:04-18:13"
  },
  {
    "text" : "Yeah, I th I thought it was McGee.",
    "timestamp" : "18:13-18:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "So your offense was like legitimately stacked. Yeah.",
    "timestamp" : "18:15-18:18"
  },
  {
    "text" : "Yeah, I mean Bledsoe threw for 4,300 yards and 24 touchdowns. Travis Henry went for 1400 yards on the ground and 13 touchdowns. Eric Mold had 100 catches. Peel's price at 94.",
    "speaker" : "Andy",
    "timestamp" : "18:18-18:30"
  },
  {
    "text" : "Can I do my uh Can I do my notes right now? Because it's kind of kind of relevant to their roster. So this whole page of notes that you see here is all Chris Berman nicknames. Nice. I have maybe like seven or eight Berman nicknames and then I gave a I gave a run myself at making some for the Bills.",
    "speaker" : "Greg",
    "timestamp" : "18:31-18:57"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. That might have to be a new thing.",
    "timestamp" : "18:57-18:59"
  },
  {
    "timestamp" : "18:59-19:01",
    "text" : "To grade my Burman nicknames.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "19:02-19:08",
    "speaker" : "Andy",
    "text" : "Alright. Well how about how about you? I'm actually reasonably excited for this. How about you give us a nickname and we tell you who came up with it?"
  },
  {
    "text" : "Ooh, I like that.",
    "speaker" : "Steve",
    "timestamp" : "19:08-19:10"
  },
  {
    "timestamp" : "19:10-19:10",
    "text" : "Okay.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "All right.",
    "timestamp" : "19:11-19:11"
  },
  {
    "timestamp" : "19:11-19:21",
    "text" : "Okay. All right. Mix them up a bit. All right. Uh Ruben Extra Coleslaw Brown.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:22-19:35",
    "text" : "Pepsi. That's a good one though. It was like Ruben drones or some of that? Wasn't it? Was this a do you have like Do you have the bourbon nickname as well, or are you just coming up with random nicknames?"
  },
  {
    "text" : "Uh I basically just they're all gonna be me for the Bills, because I went through their roster and used that. I'll give you a couple of my favorite ones.",
    "timestamp" : "19:35-19:47",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, start with the strong ones. That was not your best, Greg.",
    "timestamp" : "19:47-19:49"
  },
  {
    "text" : "Oh that was my best. How about this one? Koy wire, you know koy wire. Yeah, you played decent. Don't play koy with me, wire. Oh my um Alex Van Bieverpelt.",
    "speaker" : "Greg",
    "timestamp" : "19:50-20:14"
  },
  {
    "speaker" : "Andy",
    "text" : "That's not bad. That's not bad.",
    "timestamp" : "20:15-20:16"
  },
  {
    "timestamp" : "20:16-20:18",
    "speaker" : "Greg",
    "text" : "That's your oh that's fine."
  },
  {
    "timestamp" : "20:18-20:20",
    "speaker" : "Andy",
    "text" : "That's a Berminism right there. That's a Berman."
  },
  {
    "timestamp" : "20:20-20:23",
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. Larry centers of attention."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:23-20:25",
    "text" : "Not bad, not bad."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "20:25-20:35",
    "text" : "Not a good one. Uh David Dinkins Donuts. I love it. Steve really liked that one. That one's a great one."
  },
  {
    "timestamp" : "20:39-20:41",
    "speaker" : "Steve",
    "text" : "Because like I don't even know who the fuck that is."
  },
  {
    "timestamp" : "20:41-20:47",
    "speaker" : "Greg",
    "text" : "Uh he was a injured reserve quarterback. Digging deep."
  },
  {
    "speaker" : "Steve",
    "text" : "That explains why that's is that Berman's name for him or is it yours?",
    "timestamp" : "20:49-20:53"
  },
  {
    "timestamp" : "20:56-21:01",
    "speaker" : "Greg",
    "text" : "Uh this one, Deshaun Poke, a dotted bikini."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:02-21:05",
    "text" : "That that I can see Berman saying it saying that one."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:07-21:21",
    "text" : "Uh I think that's that's all ones that I came up with. I'll give you some of Berman's ones because I went down that rabbit hole. Well what actually got me down the the rabbit the rabbit hole is Christian Euphoriae. Which I thought was pretty good. So that's clear."
  },
  {
    "text" : "I actually can't help but think that in my head when he scores a touchdown. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "21:22-21:26"
  },
  {
    "timestamp" : "21:26-21:30",
    "text" : "Like that with Andre Bad Moon Rising. Yep, that's on here.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:30-21:51",
    "speaker" : "Greg",
    "text" : "So apparently um I I watched an interview with Berm and and he was saying that's one of his favorites. And apparently Andre Ryzen has a tattoo that just says bad moon on his arm. No way was like Chris Burr was like, there's no way he's a Cleadon's Clearwater Revival fan. He's like, he got that from me."
  },
  {
    "text" : "He is now. Which is like 100% true. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "21:51-21:55"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:55-22:04",
    "text" : "So that was uh an interview with Rich Eisen, and Rich was like, you got any nicknames for me? And he's like, Rich Lucy in the sky with uh Eisen."
  },
  {
    "text" : "Just off the top of the dome.",
    "timestamp" : "22:07-22:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "22:09-22:12",
    "text" : "I think he had thought of it before because he had like four or five of them."
  },
  {
    "timestamp" : "22:12-22:13",
    "speaker" : "Andy",
    "text" : "Got him."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Let's see. Jay Touchy Feely. Yeah.",
    "timestamp" : "22:13-22:17"
  },
  {
    "speaker" : "Andy",
    "text" : "That's a good one.",
    "timestamp" : "22:18-22:19"
  },
  {
    "timestamp" : "22:19-22:23",
    "speaker" : "Greg",
    "text" : "This one this one's my favorite. Natron Refried Means."
  },
  {
    "timestamp" : "22:24-22:27",
    "speaker" : "Andy",
    "text" : "He also did a Natron Means Business."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "22:27-22:36",
    "text" : "Yeah. Uh John Kitna Caboodle. Hardy Har Har Nickerson"
  },
  {
    "timestamp" : "22:38-22:40",
    "text" : "Wasn't he on the Buccaneers too?",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, I think it was.",
    "timestamp" : "22:40-22:42",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "22:42-22:44",
    "text" : "That makes that a million times better."
  },
  {
    "timestamp" : "22:44-23:03",
    "speaker" : "Greg",
    "text" : "Yeah. Eric sleeping with the enemy. That's a classic one. Oh yeah. And here's actually another Buffalo Bill one. Peerless actual retail price. He's the best. He's the best."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:03-23:06",
    "text" : "And the funny thing is No Ricky Pro ones?"
  },
  {
    "text" : "He shampoos his way for a first down, I remember.",
    "timestamp" : "23:07-23:10",
    "speaker" : "Greg"
  },
  {
    "text" : "Ricky Pearl position. Ooh Do you think he just like sits there and like thinks of nicknames? Like how does he come up with them?",
    "speaker" : "Steve",
    "timestamp" : "23:10-23:18"
  },
  {
    "timestamp" : "23:19-23:52",
    "speaker" : "Greg",
    "text" : "Yeah, so they kinda asked him about that. They were like, where did this like come from? Why did you start doing this? And he was like, Yeah, a lot of people thought I was doing it to just like I don't know, be corny, but he was like back when Sports Center started, like, he was he's like, I'd be like on at two AM Reading like a box score in the summer from like a five three Royals Indians game. And he's like, they didn't even have highlights for it. So I just be like reading a box score live and he's like I have to do something to just like be ridiculous With this, which is how all beautiful things start. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Out of pure boredom.",
    "timestamp" : "23:52-23:53"
  },
  {
    "timestamp" : "23:54-23:55",
    "text" : "I'm bored. Let's do something fun.",
    "speaker" : "Greg"
  },
  {
    "text" : "Spice us up a bit.",
    "speaker" : "Andy",
    "timestamp" : "23:56-23:57"
  },
  {
    "timestamp" : "23:57-23:59",
    "speaker" : "Steve",
    "text" : "I mean, let's be honest, that's how this started."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:00-24:01",
    "text" : "Exactly. Like what it's head into."
  },
  {
    "text" : "Yeah. So that's all the notes I have for this game. Alright, well I guess we can get into the game and then and Greg, you can go eat your dinner or something.",
    "timestamp" : "24:02-24:15",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "24:16-24:17",
    "text" : "I'll talk to you guys next week.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "All right.",
    "timestamp" : "24:17-24:18"
  },
  {
    "text" : "Thanks for coming on, bro.",
    "timestamp" : "24:18-24:20",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So I got a couple of fun facts before we get into the game. Sure. Uh Drew Bloodsoe is the second leading rusher on this team. He finished the season with sixty-seven yards.",
    "timestamp" : "24:20-24:35"
  },
  {
    "speaker" : "Greg",
    "text" : "I knew that Travis Henry had the notes.",
    "timestamp" : "24:36-24:38"
  },
  {
    "timestamp" : "24:39-24:49",
    "text" : "All Travis Henry. All 1400 of them. Nobody else had any. But Bloodstone Travis Henry did lead the team, co-led the team with 11 fumbles each.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "24:50-24:57",
    "speaker" : "Steve",
    "text" : "Him and Travis Henry both fumbled eleven times. Each. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "But they still put up points in the place.",
    "timestamp" : "24:57-24:59"
  },
  {
    "text" : "Was there an ending record?",
    "timestamp" : "25:01-25:03",
    "speaker" : "Steve"
  },
  {
    "text" : "Yes. They started five and three.",
    "timestamp" : "25:04-25:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:07-25:23",
    "text" : "We get you got hit with the old robot voice. Yeah. What is that, by the way? It's lag. Lag. Nine and seven. So what is lag, by the way? Fuck you. Explain like I'm five.",
    "speaker" : "Greg"
  },
  {
    "text" : "I do that with everything with you, Greg.",
    "speaker" : "Andy",
    "timestamp" : "25:24-25:26"
  },
  {
    "speaker" : "Steve",
    "text" : "Greg, guess their ending record. I'm gonna say nine and seven. Eight and eight.",
    "timestamp" : "25:27-25:31"
  },
  {
    "text" : "They came in fourth place.",
    "timestamp" : "25:31-25:33",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "25:39-25:44",
    "text" : "I knew I knew that. Well I can't read the show notes because it's gonna spoil the end for me.",
    "speaker" : "Steve"
  },
  {
    "text" : "Even though it's a and for me. I know, yes. He's super chubby.",
    "timestamp" : "25:44-25:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It's actually called lag Andy. You'll get it one day. Is that any better? Is that any better?",
    "timestamp" : "25:49-25:59"
  },
  {
    "timestamp" : "26:00-26:08",
    "speaker" : "Steve",
    "text" : "Alright, Greg. What do you think if your first name had two G's? Like Greg Williams."
  },
  {
    "timestamp" : "26:09-26:34",
    "text" : "I think it's a dickhead move. Yeah. And and I was reading about like Greg Williams and Bounty Gate and like one of his most critical Like one of the most critical um journalists on him was another guy named Greg with two G's in it. And I was like, what is this world coming to? Greg Easter B. That everybody Oh yeah, I think it was him. Yeah, you some guy from the New Orleans newspaper. I was like, Jesus Christ.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Wait. And I hate I do have a question. Is it like Gregory? Because your name's Gregory. Correct. But is it like Gregory with two G's? Or were were they like names and their birth certificates Greg with two G's?",
    "timestamp" : "26:34-26:50"
  },
  {
    "speaker" : "Greg",
    "text" : "It's a good it's a valid question, Andy.",
    "timestamp" : "26:50-26:52"
  },
  {
    "timestamp" : "26:53-26:53",
    "speaker" : "Andy",
    "text" : "I don't know."
  },
  {
    "speaker" : "Greg",
    "text" : "Here's what I'm gonna do.",
    "timestamp" : "26:54-26:55"
  },
  {
    "speaker" : "Andy",
    "text" : "You gonna fact check that for me? Hmm. Hmm. Greg Williams is I think it's just Greg with two G's. Yeah, because according to pro football reference. I mean like what about Wikipedia?",
    "timestamp" : "26:55-27:06"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "27:06-27:09",
    "text" : "They should have their full name. Wik yeah, Wikipedia use"
  },
  {
    "timestamp" : "27:10-27:11",
    "text" : "Pro football reference always says too.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And can we also talk about what a revenge game this was for Antoine Smith?",
    "timestamp" : "27:12-27:17"
  },
  {
    "timestamp" : "27:17-27:23",
    "speaker" : "Andy",
    "text" : "How about we do one thing at a time? Yeah. Do we want to talk about Bounty Gate? Because this is Greg Williams."
  },
  {
    "text" : "Let's talk about it. I didn't know I actually didn't put that together, but you're right. He was uh what? Offensive coordinator for them?",
    "speaker" : "Steve",
    "timestamp" : "27:23-27:30"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:30-27:34",
    "text" : "No, he was the defensive coordinator. Like D E C this was his thing."
  },
  {
    "timestamp" : "27:34-27:38",
    "speaker" : "Steve",
    "text" : "Well he was not very good at it, clearly, because we fucking hung 38 on him."
  },
  {
    "timestamp" : "27:40-27:42",
    "speaker" : "Greg",
    "text" : "Well he was the head coach for the Bills, right?"
  },
  {
    "speaker" : "Steve",
    "text" : "And and we can also dovetail this into Antoine Smith's revenge game.",
    "timestamp" : "27:43-27:47"
  },
  {
    "speaker" : "Andy",
    "text" : "We will.",
    "timestamp" : "27:47-27:48"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "27:49-27:55",
    "text" : "Because Antoine Smith had what a hundred yards running and two screen pass catching touchdowns."
  },
  {
    "timestamp" : "27:55-27:56",
    "text" : "We'll get there.",
    "speaker" : "Andy"
  },
  {
    "text" : "We'll get there. Bump your fucking body. Jesus Steve. I'm just trying to shit on Greg Williams a lot.",
    "speaker" : "Steve",
    "timestamp" : "27:56-28:00"
  },
  {
    "timestamp" : "28:00-28:16",
    "speaker" : "Andy",
    "text" : "Ruin the whole thing. Well, let's let's talk about him first and then we'll shit on him. Oh so he was the Bills head coach oh one through oh three. Uh went seventeen and thirty-one. Wait, he was the head coach? Yeah."
  },
  {
    "text" : "Oh I miss that.",
    "timestamp" : "28:16-28:17",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "28:18-28:28",
    "speaker" : "Andy",
    "text" : "Seventeen and thirty-one. So they were they were three fifty-four winning percentage. Uh so not great. And then I think he started as a defensive coordinator four years before that."
  },
  {
    "timestamp" : "28:28-28:30",
    "text" : "This is this is his first head coach job.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Didn't go well. And then back to defensive coordinating with uh Washington. for a bunch of years, Jacksonville and then New Orleans in oh nine, ten, and eleven. And then No real know what happened, but the quote I pulled was on March 2nd, 2012, the NFL announced that it had evidence that defensive coordinator Greg Williams had created the program soon after his arrival in 2009. and alleged that between 22 and 27 Saints players were involved. Williams and the players pooled their own money to pay out performance bonuses. So I know uh what's his name, the coach um Peyton. Yeah, Peyton got suspended for a year.",
    "timestamp" : "28:30-29:16"
  },
  {
    "timestamp" : "29:16-29:16",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "text" : "Um Greg Williams actually got suspended indefinitely.",
    "timestamp" : "29:17-29:21",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "29:21-29:21",
    "text" : "Yeah."
  },
  {
    "text" : "But that would eventually get overturned the next year.",
    "timestamp" : "29:22-29:24",
    "speaker" : "Andy"
  },
  {
    "text" : "Um well this had this is like it almost forced Tagliu Boo to resign, right? Didn't have a lot to do with his retirement and that's how we got Goodell.",
    "timestamp" : "29:24-29:34",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Well wow, what the fuck, Dragon?",
    "timestamp" : "29:34-29:36"
  },
  {
    "text" : "I think I think I heard them say that. I was watching a video about it.",
    "speaker" : "Greg",
    "timestamp" : "29:37-29:41"
  },
  {
    "text" : "That's crazy. But like he's clearly doing that everywhere else he went to. It wasn't like he's like going to the Saints. He's like, you know what? Oh, it's new program.",
    "speaker" : "Steve",
    "timestamp" : "29:41-29:50"
  },
  {
    "timestamp" : "29:51-29:56",
    "speaker" : "Andy",
    "text" : "I think Paul Taglibu was like the uh the mediator or something."
  },
  {
    "timestamp" : "29:56-29:57",
    "speaker" : "Greg",
    "text" : "Oh, okay."
  },
  {
    "text" : "Between the league and the Saints, because like the Saints filed some The Saints players were suspended. Um but former Commissioner Paul Taglibu overturned all sanctions against the players in December. after finding that despite the players being very much involved, the coaches in the Saints organization were primarily responsible for the scandal.",
    "timestamp" : "29:57-30:18",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "So where is he at now? He was at Cleveland, right? And then he was their interim coach.",
    "timestamp" : "30:19-30:24"
  },
  {
    "timestamp" : "30:24-30:49",
    "speaker" : "Andy",
    "text" : "Oh yeah, exactly. So he was he was that Cleveland um defensive coordinator and then was their interim head coach after What's his name? The guy that went oh and Hugh Jackson. Yeah, Hugh Jackson got fired. And he finished the season five and three and everybody Like all the Browns fans wanted them to get Greg Williams, the head coaching job, and they went with they all wanted the other guy to get it and then they gave it to him."
  },
  {
    "speaker" : "Greg",
    "text" : "He sucked too. Yeah, kitchen's blue.",
    "timestamp" : "30:49-30:51"
  },
  {
    "text" : "Right, right, right, right. Well, like, you can't get a call back drag out there with two G's.",
    "timestamp" : "30:52-30:57",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "30:58-31:10",
    "speaker" : "Greg",
    "text" : "Two G's can't play any D's. And they were on uh hard knocks that year. And he was like openly like shitting on uh Hugh Jackson."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah, yeah.",
    "timestamp" : "31:11-31:12"
  },
  {
    "text" : "He came off as a prick.",
    "timestamp" : "31:13-31:14",
    "speaker" : "Greg"
  },
  {
    "text" : "Well, clearly he's a bounty gate and I mean you can't take that Bill's roster and turn him into nothing.",
    "speaker" : "Steve",
    "timestamp" : "31:15-31:22"
  },
  {
    "timestamp" : "31:23-31:28",
    "speaker" : "Andy",
    "text" : "Yeah, but uh last year he was the defensive coordinator for your New York Jets."
  },
  {
    "timestamp" : "31:31-31:45",
    "speaker" : "Steve",
    "text" : "Yes, I love that. I didn't know that. Oh wow, it comes full circle. 2G Greg. The Jets defense sucked. Jamal Adams is like, get me the fuck out of here."
  },
  {
    "timestamp" : "31:45-31:46",
    "speaker" : "Andy",
    "text" : "Yeah. Oh, that's amazing."
  },
  {
    "text" : "Wow, this whole podcast thing isn't worth it just for that little nugget of knowledge right there. that Greg Williams like everyone's like oh Sam Darnold sucks but like Loki their defense should be way better than it could be because the talent on there and like all the talent on there is like I don't want to be here Show all the haters is the face of that. Yep. I love it. Oh yes. She opened a kind of gaze. Yeah. Oh. The old Bills head coach, the old Thomas head coach uniting and shit. Oh, that's true, yeah.",
    "timestamp" : "31:49-32:27",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "32:28-32:28",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "32:29-32:42",
    "text" : "So the yeah, the the Patriots against uh Greg Williams. Buffalo Bills teams were five and one. Capably lost in the three years. I y I bet you know the loss though. That 31 notin'.",
    "speaker" : "Andy"
  },
  {
    "text" : "That was that was not Greg Williams. That was nothing to do with Greg Williams. That was called Bill Bell check.",
    "timestamp" : "32:43-32:50",
    "speaker" : "Steve"
  },
  {
    "text" : "I have some Greg Williams quotes from Bounty Gate that are well. So I I actually have an admission myself. I was like I was like, oh yeah, like Bounty Gate. I never really read much about it at the time, I think. Yeah. Yeah, me too. And I was like, you know what? I'm gonna revisit this and like s see what all the details were. Cause like in my mind I was like, you know what? It's already like a super violent sport. And like You're going out there to hurt people regardless, right? You're you're trying to hit people as hard as you want, like being aggressive in football, especially on the defensive side of the ball, is like a legitimate strategy, right?",
    "timestamp" : "32:51-33:31",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Let me give you a quote that that touches on that exactly. Yeah, they're talking about Drew Bledsoe and um Willie McGuinness and how good friends they were and stuff and they showed pre-game Willie McGinnis coming up and giving Drew a a bear hug from behind before the game. And then uh the quote was from McGuinness. I like 'em, but I want to hit 'em. Yeah. And that's against guys you're friends with and you spent like all this time in the middle of the year.",
    "timestamp" : "33:32-33:57"
  },
  {
    "text" : "Congrats plenty that's always existed. So I'm again I'm interested to learn how you can set a bounty and a money system to like make that worse.",
    "timestamp" : "33:57-34:07",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "34:08-35:19",
    "text" : "Right. And even like Paying players fines, I almost like I can wave my hand at it and be like, whatever. You know? Because it's like you want him to be aggressive. You don't want to go out there and play with like some you know, being timid and shit like that. But then the more the more I got into it, uh they so they were filming a document. This is how it all came out is they were filming a documentary in the locker room Of like an NFC championship game around that time for the Saints. And one of the filmmakers caught his like hype speech the night before the game. Uh and this is against uh San Francisco back in like the Alex Smith days. Oh yeah. I I'll just read you some of the quotes from this. Oh boy. It's gonna be bad. Yeah. Kill the head and the body will die. Kill the head and the body will die. We've got to do everything in the world to make sure we kill Frank Gore's head. We want him running sideways. We want his head sideways. So pretty aggressive, but you know, he's not explicitly playing that away. Yeah. He could explain it away, right? Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "He is the head. He's he's the the what did you want to stop.",
    "timestamp" : "35:20-35:24"
  },
  {
    "text" : "But he goes on. Every single one of you before you get off the fi get off the pile, affect the head. Ye Early, affect the head. Continue. Touch and hit the head.",
    "speaker" : "Greg",
    "timestamp" : "35:25-35:37"
  },
  {
    "timestamp" : "35:39-35:40",
    "speaker" : "Andy",
    "text" : "Uh football number one."
  },
  {
    "speaker" : "Greg",
    "text" : "So that one you can't really just be like. So they had a wide receiver, um Kyle Williams, that had like concussion stuff coming out of college.",
    "timestamp" : "35:40-35:51"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:51-35:53",
    "text" : "Oh, that sounds familiar. Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "35:53-36:20",
    "text" : "The little wide receiver, number 10, about his concussion. We need to fucking put a lock on him right now. He needs to decide. He needs to fucking decide. Michael Crabtree. We need to decide whether Crabtree wants to be a fake ass pre- Madonna, which is hilarious, or if he wants to be a tough guy. We need to find it out. He becomes human. Oh, he becomes human when we fucking take out that outside ACL."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:21-36:22",
    "text" : "Jesus Christ."
  },
  {
    "text" : "We need to decide on how many times we can beat Frank Gore's head. I'm thinking of theme. Psychopath, dude. We need to decide how many times we can bull rush and we can fucking put Vernon Davis's ankles over the pile.",
    "speaker" : "Greg",
    "timestamp" : "36:23-36:39"
  },
  {
    "speaker" : "Steve",
    "text" : "Damn.",
    "timestamp" : "36:40-36:40"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah. So yeah, he there's a line between like I want you guys to play aggressive football. Sure. And and like I don't I don't want you to like feel bad about Playing hard. And then there's like this guy's had concussions in the past. Hit him in the head. Hit him in the head. Hit him in the fucking head. Or his ACL.",
    "timestamp" : "36:40-37:00"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, exactly. Yeah. And and go for his right ACL because that's the one that's dodgy.",
    "timestamp" : "37:00-37:05"
  },
  {
    "speaker" : "Steve",
    "text" : "You know? And and for real, he's going after Frank Gore, who is like an absolute tank. It's like go up and go up and punch that N1 Abrams. Take your fist and it's an M1 Abrams. I know it's an M1 Abrams to go up there and just like just like beat on it with your fists. Just headbutted.",
    "timestamp" : "37:05-37:25"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't want you to come out the field unless you've headbutted that.",
    "timestamp" : "37:25-37:27"
  },
  {
    "text" : "Dude, that that Greg, that shit is way more fucked up than that um Richie Incognito shit. Yeah, for sure. Way like and like just no sportsmanship in that, that's just real fun. That's even more fucked up than anything the Patriots have been ever getting caught for too. Like Spygate, Bonnegate, whatever. Bonnegated, that that shit is. Like he's literally telling people to tear ACLs and give people concussions. That's the last thing you need to do. It's worse when it's already violent enough.",
    "timestamp" : "37:28-38:00",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, it's worse than the actual bounty though, I in in my opinion. Like a bounty is like they were they were the bounties were a thousand dollars. Yeah. The guys that are making million. It's like it's like doing one of those like when you're at work and they're like, hey, guess guess the day your co-worker's baby arrives. Like that no one gives a shit. You're just phone numbers out here.",
    "timestamp" : "38:01-38:18",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "38:20-38:29",
    "speaker" : "Andy",
    "text" : "For sure guys in a locker room. Like But it's a culture thing, right? It's not just that sort of thing. Like the they're betting on if you score a touchdown this this week, I'll give you a thousand bucks, you know? Yeah."
  },
  {
    "text" : "Culture, exactly. Yeah, it extended beyond injuries too. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "38:31-38:34"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:34-38:36",
    "text" : "It was like the amount of punishment."
  },
  {
    "timestamp" : "38:37-38:38",
    "speaker" : "Steve",
    "text" : "Damn, that's fucked up."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "38:38-38:39",
    "speaker" : "Andy"
  },
  {
    "text" : "Well, I'm glad we beat his bitch ass in this fucking game.",
    "speaker" : "Steve",
    "timestamp" : "38:39-38:42"
  },
  {
    "timestamp" : "38:43-38:44",
    "text" : "In all other games.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "38:44-38:48",
    "text" : "It's kind of crazy. He's still like pretty prominent too. Right, yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:48-38:49",
    "text" : "Back in the league is the right."
  },
  {
    "timestamp" : "38:49-38:51",
    "speaker" : "Steve",
    "text" : "How's he not blacklisted from that?"
  },
  {
    "timestamp" : "38:51-39:00",
    "speaker" : "Andy",
    "text" : "It's crazy. Well, I mean, just look at the Redskins. Although that trick came out today, so we'll see."
  },
  {
    "timestamp" : "39:00-39:11",
    "speaker" : "Steve",
    "text" : "We should probably put a date on this. Uh Redskins Washington Post article came out July 16, 2020. They're still called the Redskins."
  },
  {
    "text" : "Uh no, they're technically not.",
    "speaker" : "Andy",
    "timestamp" : "39:11-39:14"
  },
  {
    "timestamp" : "39:14-39:19",
    "speaker" : "Steve",
    "text" : "Well, do you see that statement he released? Like he said Redskins like 15 times in it."
  },
  {
    "timestamp" : "39:19-39:20",
    "text" : "Oh yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Who Snyder. Yeah.",
    "timestamp" : "39:20-39:22",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "39:23-39:26",
    "speaker" : "Andy",
    "text" : "We realized that it's just getting from Redskins to something else."
  },
  {
    "speaker" : "Steve",
    "text" : "So we're the name of the Redskins team is so proud of the Redskins history and the Redskins are definitely gonna make their best decision for the Redskins. Did I live in DC? Everybody hates Redskins.",
    "timestamp" : "39:26-39:39"
  },
  {
    "speaker" : "Andy",
    "text" : "I know.",
    "timestamp" : "39:39-39:40"
  },
  {
    "text" : "Uh what should what would your name change be? The DC Defenders.",
    "timestamp" : "39:40-39:46",
    "speaker" : "Greg"
  },
  {
    "text" : "Let's just pay the XFL franchise, which was like everybody loved, and just like let's just reboot it as them. Oh, I really like that. I haven't heard that.",
    "timestamp" : "39:46-39:55",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "39:57-40:13",
    "text" : "Yeah, I have two I have two things. Two of them they're kind of either end of the spectrum. One is the washing bald motherfucking eagles. Okay. And the other is the Washington Cucks because all politicians are cucks."
  },
  {
    "timestamp" : "40:14-40:15",
    "text" : "All right.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I think you have to play the politician angle.",
    "timestamp" : "40:15-40:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:18-40:35",
    "text" : "I think uh ship in England call them the London Redcoats. Call it The Redcoats. I love it. I love it. That's brilliant. Washington doesn't deserve a team. Should they Snyder doesn't deserve a team? That's what I mean."
  },
  {
    "timestamp" : "40:35-40:39",
    "speaker" : "Steve",
    "text" : "The area kind of does. I mean they they of course it does."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Well they have one.",
    "timestamp" : "40:39-40:40"
  },
  {
    "timestamp" : "40:40-40:49",
    "speaker" : "Steve",
    "text" : "They got good fans. Well we we had the DC Defenders for like eight weeks. Yeah. We are crushing the XFL up here."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "40:50-40:55",
    "text" : "The capitals get great crowds, like the Nats do. Whenever it's like a good team that's like worth rooting for."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:56-40:58",
    "text" : "Do you know who nobody gives a fuck about?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "40:58-41:02",
    "text" : "The Wizards. Oh, you mean the bullets? They should do that."
  },
  {
    "speaker" : "Steve",
    "text" : "That's insane.",
    "timestamp" : "41:03-41:03"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "41:04-41:06",
    "text" : "They should go back to the bullets."
  },
  {
    "text" : "If the Wizards ever, which they don't, but if they ever got to the NBA finals, I have so many fucking people to call out. Even the caps are a little bit that way, but there's some definitely like caps fans, but like I didn't know you were a caps fan Wow, that jersey looks really new. And the wizards is gonna be way worse. Way even like a billion. I've met one wizard. I've been down here for 15 years. I've met one guy who's like I'm a Wizards fan and you gotta respect it.",
    "timestamp" : "41:06-41:38",
    "speaker" : "Steve"
  },
  {
    "text" : "They've had some like players you can root for too. Yeah, John Wall's like John Wall, Bradley Beale, Marcin Gortad.",
    "timestamp" : "41:38-41:46",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "The game seven is uh Kelly Olenek game. Uh-huh. I watched that in I'm sorry. Oh yeah, he's so soft.",
    "timestamp" : "41:46-41:59"
  },
  {
    "text" : "I fucking hated him.",
    "timestamp" : "41:59-42:01",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "42:01-42:27",
    "speaker" : "Steve",
    "text" : "But he really in that one game, he's super balled out. I watched that with that one wizards fan. He was distraught. Distraught. We were in Bermuda on a cruise and we like we found some bar in Bermuda to watch Game Seven Celtics Wizards because you're both about it and like He's like, What? And I was like, dude, I hate Kelly Olenek too. I don't know what to tell ya."
  },
  {
    "text" : "So next up on the Celtics Dynasty Podcast.",
    "timestamp" : "42:28-42:32",
    "speaker" : "Andy"
  },
  {
    "text" : "Mm. Oh, you bothered Andy, because we're talking about something other than the Patriots.",
    "speaker" : "Greg",
    "timestamp" : "42:32-42:37"
  },
  {
    "speaker" : "Andy",
    "text" : "On the Patriots Downs Podcast? No. I'm just gonna cut all this anyway.",
    "timestamp" : "42:37-42:41"
  },
  {
    "text" : "Damn it. He does have that power.",
    "speaker" : "Greg",
    "timestamp" : "42:41-42:43"
  },
  {
    "text" : "Talk away.",
    "timestamp" : "42:45-42:45",
    "speaker" : "Andy"
  },
  {
    "text" : "Yo, give me one, Steve.",
    "speaker" : "Greg",
    "timestamp" : "42:46-42:47"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't give a fuck.",
    "timestamp" : "42:47-42:48"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm gonna get a beard too. I'll be right back.",
    "timestamp" : "42:48-42:50"
  },
  {
    "timestamp" : "42:50-42:55",
    "speaker" : "Andy",
    "text" : "All right. I was gonna Make you talk about Antoine Smith while Steve was gone."
  },
  {
    "speaker" : "Steve",
    "text" : "Well I don't know much about I'm back, baby.",
    "timestamp" : "42:55-42:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh good. You you missed our talk about uh Antoine Smith.",
    "timestamp" : "42:59-43:03"
  },
  {
    "text" : "Oh no, I love Antoine. He falled out in this game.",
    "speaker" : "Steve",
    "timestamp" : "43:03-43:08"
  },
  {
    "text" : "Uh well I was gonna talk about him with Greg, but Greg didn't watch a game, so he has no idea what happened.",
    "timestamp" : "43:08-43:15",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, sorry. But I got a fresh beer. We're good ready to go.",
    "timestamp" : "43:14-43:17"
  },
  {
    "timestamp" : "43:17-43:21",
    "text" : "All right. Just waiting on Greg to figure out his technology.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "So Antoine signed last year. So the first two Bill Games I guess were his revenge game?",
    "timestamp" : "43:21-43:28"
  },
  {
    "text" : "Yeah. I I think there was a even though every time he did it he said it wasn't.",
    "speaker" : "Andy",
    "timestamp" : "43:28-43:33"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:33-43:45",
    "text" : "But I feel I still feel like there is so much hype in this game leading up to the Drew Bledsoe revenge game that Anton might have But like what about me? A little bit."
  },
  {
    "text" : "I don't know. I think he's had his cause this wasn't his f like this is Bledsoe's first time back and been back to Buffalo twice already.",
    "timestamp" : "43:45-43:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:53-43:57",
    "text" : "But it was like a different Antoine in this game."
  },
  {
    "timestamp" : "43:58-44:05",
    "speaker" : "Andy",
    "text" : "Uh I think part of it was that yeah, he had a he had a good game. He had twenty-nine carries, 111 yards, and a rushing touchdown."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "44:06-44:10",
    "text" : "That's that's that's classic Twan. But what else would he have?"
  },
  {
    "text" : "He had five catches for thirty-one yards and two touchdowns.",
    "timestamp" : "44:10-44:13",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "44:15-44:18",
    "speaker" : "Steve",
    "text" : "Like, did he have five catches all last year?"
  },
  {
    "speaker" : "Andy",
    "text" : "So they actually Uh let me see if I can find it. There was a a note about it. Oh yeah. So um in the first 80 games of his career, he had one touchdown catch. And in this game alone he had two.",
    "timestamp" : "44:18-44:36"
  },
  {
    "text" : "Yeah. Well he's like it would be like Sony Michelle, like catching three touchdowns, you know, in a game. Or even two, like when no when Sony's in there, it's clearly a run.",
    "timestamp" : "44:37-44:50",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. And on third down the other thing.",
    "speaker" : "Andy",
    "timestamp" : "44:50-44:52"
  },
  {
    "text" : "And they done the same thing. They did the same thing to the to the Bills in this. They screened them to death with Antoine.",
    "timestamp" : "44:52-44:59",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:59-45:17",
    "speaker" : "Andy",
    "text" : "So that was the thing. I think that was more what it was than it was Antoine Smith's revenge game. It was for uh I don't know if this is a Greg Williams defensive trade or what, but Uh his this defense couldn't recognize the screen to save their fucking life."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "45:17-45:46",
    "text" : "Well yeah, well Charlie Weiss found something that worked on the screen and just Well did the old Anga do it until you can stop it and they never actually never actually figure out how to stop it. Yeah. So I think they had a fourth down conversion screen pass to Antoine Smith. Lost on those five catches. He had a couple touchdowns, which he made a little wiggle on too, but like it was fourth down and like one and they screen pass it to Antoine Smith."
  },
  {
    "text" : "I believe it was fourth and three. Yeah. Yeah. Crazy. From the Buffalo 35, but they didn't want to kick a field goal. It's like, fuck it. Yeah. But I also liked um so yeah, so the all Brady's touchdowns were to running backs. He had the screen to Antoine on the first on the uh actually no true. He had a screen to Antoine in the second quarter. Um uh screen to Antoine in the fourth quarter. And then he had what was uh basically a swing pass to Kevin Falk? It wasn't it? That play was ruled uh a run, not a pass. Oh really? That doesn't count. So that forty-five yard, yes, swing pass to Kevin Falk was Kevin Falk's longest rush of his career.",
    "speaker" : "Andy",
    "timestamp" : "45:47-46:37"
  },
  {
    "speaker" : "Mom",
    "text" : "No way.",
    "timestamp" : "46:38-46:38"
  },
  {
    "text" : "Which came on a on a swing pass, which That's such a Kevin Falk. It's the most Kevin Falk fact. It's his longest touchdown ever.",
    "timestamp" : "46:38-46:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "But if you watch that play, I have notes about it. It was like Kevin Fall played that play perfectly because the Bills were in the worst defense possible for the screen pass where they're blitzing off the like the right side where it's going to the left on the offense. And Kevin Falk like bull picked up the blocker. He even like blocked the dude and then like pulled off and caught the pass and was gone.",
    "timestamp" : "46:46-47:07"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, I don't know if you saw the the replay that CBS did, but they actually talked about it where The linebacker, I think they said it was London Fletcher, was supposed to be covering him. So he was on the same side. And when he came over to cover Kevin Falk, uh won the offensive lineman just ran out there and just like knocked his ass over and so falk was wide open. And then like I don't know one of the receivers blocked two. Yeah, I saw that too. I'm I wanna say it was Troy Brown. Of course it's Troy Brown. one defender into the other and knock them both over. Yeah. And Kevin Fall just walked in. Danced in it.",
    "timestamp" : "47:08-47:43"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "47:43-47:45",
    "text" : "It was sweet. Yeah."
  },
  {
    "text" : "You'll be able to find that replay on uh Patriot's Dynasty don't even book.",
    "speaker" : "Andy",
    "timestamp" : "47:45-47:49"
  },
  {
    "text" : "You know what I bet you don't have on Patriots Dynasty is my play of the game. Greg, you got a play of the game? You can go first since you didn't watch it.",
    "timestamp" : "47:49-47:57",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "47:57-47:59",
    "text" : "Yeah, Tylaw's interception.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "48:00-48:00",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:00-48:02",
    "text" : "Yeah. I knew that was coming. Obviously.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Which do you want to talk about that? Did you see the end of it? I don't know if they showed it on the uh the highlights.",
    "timestamp" : "48:03-48:08"
  },
  {
    "timestamp" : "48:09-48:11",
    "speaker" : "Greg",
    "text" : "I don't think I did. Was he doing the dance?"
  },
  {
    "text" : "No, but the end of it, because he got pushed out of bounds, and the first guy to come up to him to congratulate him and slap him on the head and was like screaming at him, Bill Belichick.",
    "timestamp" : "48:12-48:21",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Billy B 2002 Billy Belichick, way more animated.",
    "timestamp" : "48:24-48:28"
  },
  {
    "timestamp" : "48:29-48:37",
    "speaker" : "Andy",
    "text" : "Animated though. But this is like the most animated I've ever seen him Yeah. Like yell like yelling at him, slapping him on the head, just like fired up."
  },
  {
    "text" : "Well, according to Mike, he sells his soul at some point and then goes to the fire.",
    "speaker" : "Steve",
    "timestamp" : "48:38-48:42"
  },
  {
    "timestamp" : "48:43-48:44",
    "text" : "Yeah, it's gonna be pretty soon, I think.",
    "speaker" : "Andy"
  },
  {
    "text" : "Andy, you have your play of the game?",
    "timestamp" : "48:45-48:47",
    "speaker" : "Steve"
  },
  {
    "text" : "Um let me see. I do. It was I have a few, but I'll we'll go with this one. It was a pass to Troy Brown. Bledsoe uh Brady was on the run and he uh uh Brown wasn't even open. But he managed he managed to fit it literally like inches away from the defender's hands and Troy Brown caught it falling over. And I'm watching the game. And I'm literally yelling at the TV. I'm like, there's no way he caught that. And he gets up. And again, I've never seen anybody as animated as Troy Brown was in that on that play. He's jawing at people. He's like doing first down dances. Like, what is going on? There's something about Buffalo that Rouse these boys up.",
    "speaker" : "Andy",
    "timestamp" : "48:48-49:31"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm pretty sure the defender like got like just a touch on it. Like a the tip of his finger on it Um when it was going into his hands.",
    "timestamp" : "49:31-49:39"
  },
  {
    "speaker" : "Andy",
    "text" : "But Brady also had a couple of those like on the move, but he had two. One was like uh a shot put that he did to pass toy brown, yeah.",
    "timestamp" : "49:39-49:49"
  },
  {
    "timestamp" : "49:49-49:52",
    "speaker" : "Steve",
    "text" : "Might be the only shuffle pass I've ever seen Brady throw."
  },
  {
    "speaker" : "Andy",
    "text" : "It wasn't pretty. But it worked. And he converted another third down early where he like it looked like he was gonna he he got lit up, but it was like right at the last second he just like chucked it toever the the running back was in the middle. Yeah, and converted that.",
    "timestamp" : "49:52-50:07"
  },
  {
    "text" : "And no one thought to cover him on like third and like fifteen.",
    "speaker" : "Steve",
    "timestamp" : "50:08-50:10"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and he converted.",
    "timestamp" : "50:11-50:12"
  },
  {
    "text" : "Brady had some pretty good stats.",
    "speaker" : "Steve",
    "timestamp" : "50:13-50:14"
  },
  {
    "speaker" : "Greg",
    "text" : "Twenty-two of twenty-six of two sixty-five, essentially four touchdowns.",
    "timestamp" : "50:15-50:20"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "50:20-50:21",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And he uh all of those touchdowns are just literally screen passes.",
    "timestamp" : "50:21-50:25"
  },
  {
    "speaker" : "Andy",
    "text" : "He he set a pick one single game completion percentage record in this game.",
    "timestamp" : "50:26-50:31"
  },
  {
    "speaker" : "Greg",
    "text" : "That makes sense.",
    "timestamp" : "50:31-50:32"
  },
  {
    "timestamp" : "50:32-50:38",
    "speaker" : "Andy",
    "text" : "He broke his own record of last season of eighty percent. This was eighty-five point one percent completion per se."
  },
  {
    "speaker" : "Greg",
    "text" : "Dude Bledsoe's stats are so Bledsoe too. Twenty-eight of forty-five for three hundred two yards, one touchdown, one pick. four sacks. That's the most bloodsoe stat line ever.",
    "timestamp" : "50:38-50:51"
  },
  {
    "text" : "That's so blood so well if you want to get so blood so On the first drive of the game, the Bills drive straight down the field. Uh they the Patriots couldn't stop a kick return, so the they got the kick return to their own 38, so maybe it's their own 40. In two plays they're at the Patriots 25. And then on third down, Bledsoe gets sacked for 14 yards because he's there's a free rusher. Tries to outrun him, so he runs backwards and they get sacked.",
    "timestamp" : "50:51-51:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And then they missed the field goal short by two yards. My note on that is I'm surprised he didn't knock it up.",
    "timestamp" : "51:17-51:23"
  },
  {
    "timestamp" : "51:24-51:27",
    "speaker" : "Andy",
    "text" : "Yeah, I I was a little surprised he didn't throw it back over his shoulder like you normally."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:30-51:32",
    "text" : "Like he got a huge standing O when he showed up."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "51:32-51:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "As you as you would expect. Yeah. He was an awesome quarterback at that time.",
    "timestamp" : "51:33-51:37"
  },
  {
    "text" : "Yep. He could carry a team. I what did they the the announcers said something about uh They were calling him um pasta sauce or something like that because he covered over all the imperfections on the team.",
    "timestamp" : "51:38-51:53",
    "speaker" : "Andy"
  },
  {
    "text" : "Maybe we'll just leave the nicknames to Chris Berman, huh? The Bills.",
    "speaker" : "Greg",
    "timestamp" : "51:59-52:02"
  },
  {
    "speaker" : "Steve",
    "text" : "Those kickers suck though. He missed that field goal, which was like just barely short too. So if Ledso had thrown it away, definitely three points. Yep. He missed like a super chippy. He missed another one in the aft in like the third quarter. Then like Horsher Park let him know about it.",
    "timestamp" : "52:03-52:20"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, poor guy. He actually didn't have that bad of a year outside of this game either. Really? Really? Yeah. He was twenty-five of thirty-three on the year and he missed three kicks on this day. So yeah. I don't think he made a single kick.",
    "timestamp" : "52:21-52:35"
  },
  {
    "timestamp" : "52:36-52:38",
    "text" : "Outside of extra points, he didn't make a single kick.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he was three of five for fifty plus on the year.",
    "timestamp" : "52:38-52:41"
  },
  {
    "timestamp" : "52:42-52:42",
    "text" : "Wow.",
    "speaker" : "Steve"
  },
  {
    "text" : "So I mean he he was like a decent kicker. I think he just had a tough day. So shout out Mike Hollis, dude. We're we we stand with you. All right. Until you're fairly judged.",
    "timestamp" : "52:42-52:53",
    "speaker" : "Greg"
  },
  {
    "text" : "We're gonna stop unfairly judging people on this because every time we do a deep on we have to change our tune.",
    "speaker" : "Andy",
    "timestamp" : "52:55-53:00"
  },
  {
    "text" : "Did you see that guy in the stands wearing the cheese head hat?",
    "timestamp" : "53:02-53:05",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "53:06-53:07",
    "speaker" : "Andy",
    "text" : "The cheese head."
  },
  {
    "text" : "But not the cheese head with the buffalo wing. Whoa actually I think it's how how I've never seen that before.",
    "speaker" : "Steve",
    "timestamp" : "53:07-53:14"
  },
  {
    "text" : "Was he wearing zuubas too? Of course not.",
    "timestamp" : "53:14-53:16",
    "speaker" : "Greg"
  },
  {
    "text" : "No, this is 2002, buddy. I mean I couldn't see his legs, but It was like a cheese head but a buffalo wing.",
    "timestamp" : "53:17-53:23",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Buffalo wing, yeah, sticking out the side, wasn't it? It was huge. Yeah, it was legit.",
    "timestamp" : "53:23-53:28"
  },
  {
    "timestamp" : "53:28-53:33",
    "speaker" : "Steve",
    "text" : "Oh yeah. Yeah, like Google brings up some awesome images."
  },
  {
    "text" : "Where can I where can one purchase a chicken wing hat in Buffalo? Exactly. Red Reddit. com. And it's nice to know we're doing a live purchase, guys.",
    "timestamp" : "53:34-53:43",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "53:46-53:52",
    "text" : "Good to know he's been around at least since two thousand and two. 18 years old concept."
  },
  {
    "text" : "It's not on Amazon anymore.",
    "timestamp" : "53:52-53:54",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "53:54-54:11",
    "text" : "I feel like I feel like Bill's Mafia should really embrace the buffalo wing hat. The cheese hat. They would just make everything about the Bills Mafia just one little it's 21. You know? Just one Bill.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Bill's Mafia store.",
    "timestamp" : "54:12-54:13"
  },
  {
    "timestamp" : "54:14-54:19",
    "text" : "Dude, I saw those though. Yeah, the link I had had two links that were uh donezo.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "54:20-54:22",
    "text" : "Oh so they don't even make it right now.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "54:23-54:23",
    "speaker" : "Andy",
    "text" : "Brutal."
  },
  {
    "text" : "Oh wait. Ooh, wait. Wait. I found it. I found it. Oh How much forty-six dollars.",
    "speaker" : "Greg",
    "timestamp" : "54:26-54:33"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:34-54:36",
    "text" : "Worth it. Worth it. It's worth it."
  },
  {
    "timestamp" : "54:36-54:37",
    "speaker" : "Greg",
    "text" : "That's it's pricey."
  },
  {
    "speaker" : "Steve",
    "text" : "It's pretty steep, but it's awesome. How much are a pair of zubaz?",
    "timestamp" : "54:37-54:42"
  },
  {
    "text" : "Wait, what does it smell like though? Is what I want to know.",
    "timestamp" : "54:42-54:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:45-54:47",
    "speaker" : "Steve",
    "text" : "Fucking buffalo wings."
  },
  {
    "text" : "Oh, for the for the true wing lovers out there who aren't afraid to show their pride. I ain't scared. I'll wear I'll make myself look like a fucking jackass to show how much I love chicken wings, goddammit.",
    "speaker" : "Greg",
    "timestamp" : "54:48-55:01"
  },
  {
    "text" : "Prove it. Prove it. I feel this is an opportunity for Bill's mafia to remote the wing hat.",
    "speaker" : "Steve",
    "timestamp" : "55:01-55:08"
  },
  {
    "timestamp" : "55:09-55:12",
    "speaker" : "Andy",
    "text" : "I agree. I'm a little surprised they haven't already."
  },
  {
    "text" : "I I yeah I am shocked as well.",
    "speaker" : "Steve",
    "timestamp" : "55:12-55:14"
  },
  {
    "timestamp" : "55:14-55:19",
    "speaker" : "Andy",
    "text" : "And I haven't seen any wagons either, which is a little disappointing. Because nobody circles a wagon."
  },
  {
    "text" : "I feel like yeah. That was a Chris Berman thing, but like a buffalo wing thing. Everybody can get behind that.",
    "timestamp" : "55:19-55:25",
    "speaker" : "Steve"
  },
  {
    "text" : "That's true. So Steve, what was your play of the game?",
    "timestamp" : "55:25-55:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, um because I watch every game all the way to the last play. Oh, so it was the last play. The last play actually. So it's thirty eight. It's thirty-eight to seven.",
    "timestamp" : "55:30-55:46"
  },
  {
    "timestamp" : "55:47-55:49",
    "speaker" : "Andy",
    "text" : "You want to talk about just the last drive in general?"
  },
  {
    "timestamp" : "55:51-55:53",
    "text" : "I wasn't watching a ton on the last driving jump.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "It was great because so you're right.",
    "timestamp" : "55:53-55:55"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "55:56-56:04",
    "text" : "I have a note here. 99 to go, down by 31 with 153. Why is blood so out there?"
  },
  {
    "speaker" : "Andy",
    "text" : "So yeah, 'cause the Patriots running down the clock uh after Bloodsley gets picked off the first time. Um well the only time, but the first time in the series against the Patriots, I guess. Uh so the bads you just run it down the clock and basically just like running Antoine up the middle. They get fourth and goal from the three and you know do the the classy thing and just run up the middle again. And they get stopped at the one. So Buffalo starts at their own one yard line in literal garbage time.",
    "timestamp" : "56:04-56:32"
  },
  {
    "timestamp" : "56:32-56:35",
    "speaker" : "Steve",
    "text" : "Less than two minutes. They're down thirty-one points."
  },
  {
    "text" : "And Greg Double G Williams decides, you know what? It's fucking we're going out. We're going out slinging. Well, I I'm sure there's a bunch of bounties on the line. Bloodsoe's gotta get his uh his touchdown pass in here. Get himself another another grand so he can buy some chicken wings And so they come out slinging it and the Patriots you know like whatever. So they they drive all the way down to the Patriots five yard line, right? And there's a lot of things. And Kind of. It reminded me of the um the Steelers game earlier this season, where the Steelers are trying to score that last touchdown for whatever fucking reason and like running trick plays and all that sort of shit. Like dying to score that last touchdown. It kind of felt like that.",
    "speaker" : "Andy",
    "timestamp" : "56:36-57:22"
  },
  {
    "speaker" : "Steve",
    "text" : "So here's here's a accounting of the last play. The Patriots had zero blitz on like the three plays before it. Because they knew they're playing true blood cells and they're like bringing the house.",
    "timestamp" : "57:22-57:36"
  },
  {
    "speaker" : "Andy",
    "text" : "But what happens on those the two previous plays? Uh the refs decided to call pass interference on the Patriots in the end zone twice in a row. The Patriots are like, we don't give a shit. Like we're just gonna keep bringing the house. They did. They brought everybody and played man coverage on the outside. And which leads us to the last play of the game, Steve.",
    "timestamp" : "57:36-57:56"
  },
  {
    "timestamp" : "57:57-58:00",
    "speaker" : "Steve",
    "text" : "Which is but zero blitz."
  },
  {
    "text" : "Yeah, there's like three free rushers.",
    "timestamp" : "58:00-58:02",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "58:02-58:02"
  },
  {
    "timestamp" : "58:03-58:09",
    "speaker" : "Andy",
    "text" : "And he just ends up on his back with Billy McGuinness on top of him, which is how he started his day."
  },
  {
    "text" : "Deep down in his soul being like, how did I get here? How did I end up on the Bills?",
    "timestamp" : "58:10-58:14",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "58:15-58:21",
    "speaker" : "Andy",
    "text" : "And on the turf for Ralph Wilson Stadium. Yeah. Having lost by 31 points."
  },
  {
    "timestamp" : "58:22-58:32",
    "text" : "31 points? Can't even get a garbage time TD. Romeo, what what did I do to Romeo to make make him so mad at me?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "58:32-58:55",
    "text" : "Rest were doing their best. There was three defensive penalties on that that drive. Because the other one was the uh the the personal foul. Oh actually no, there was the personal foul face mask Um oh and then there was another one, there was a personal foul on Willie McGinnis for slamming Bledsoe to the ground on a sack. Yes, I don't think I actually body slammed him.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:55-58:56",
    "speaker" : "Steve",
    "text" : "That was totally deserved."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that was. Um But the the horse call the face mouse wasn't because you would have grabbed him by the uh it was Tabucky Jones, our friend Tabucky Jones. grab the guy by the uh the shoulder pad, then we just clothes lined his ass and then got called for the uh the penalty because nobody expected that anybody could do that to a man.",
    "timestamp" : "58:56-59:15"
  },
  {
    "timestamp" : "59:15-59:20",
    "speaker" : "Steve",
    "text" : "So I saw an advertisement. for PlayStation 2 in this game."
  },
  {
    "timestamp" : "59:21-59:21",
    "speaker" : "Andy",
    "text" : "Really?"
  },
  {
    "timestamp" : "59:22-59:22",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "I didn't see that.",
    "timestamp" : "59:22-59:23"
  },
  {
    "timestamp" : "59:24-59:29",
    "text" : "And I had the thought is who's older, Tom Brady or PlayStation?",
    "speaker" : "Steve"
  },
  {
    "text" : "Well Tom Brady. He was twenty at this point. Not true.",
    "speaker" : "Andy",
    "timestamp" : "59:31-59:36"
  },
  {
    "timestamp" : "59:37-59:41",
    "text" : "What? So PlayStation 2 is older than Tom Brady.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "59:42-59:42",
    "speaker" : "Greg",
    "text" : "Older"
  },
  {
    "timestamp" : "59:43-59:56",
    "text" : "Football career wise or older? Right. No, yeah, yeah. Oh that's around. It's close. It's very close. So PlayStation 2 debuted March 4th. Dra Brady was drafted April 16.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "In two thousand.",
    "timestamp" : "59:57-59:58"
  },
  {
    "timestamp" : "59:59-01:00:13",
    "text" : "Yeah. Yeah. So like a month and a half between PlayStation 2 getting released and Tom Brady getting drafted. And Tom Brady's still playing and PlayStation 5 is about to come out. That's true.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:00:13-01:00:18",
    "text" : "PlayStation 5 came out and mom and dad bought us the Sega Saturn.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. We had Dreamcast too. Whoops. What a what a whoops.",
    "speaker" : "Steve",
    "timestamp" : "01:00:19-01:00:22"
  },
  {
    "text" : "Oh Dreamcast is awesome.",
    "timestamp" : "01:00:22-01:00:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:24-01:00:28",
    "text" : "That's crazy thing about like Tom Brady started when PlayStation 2 started."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I wonder what the first yeah he must have been in Madden 2000.",
    "timestamp" : "01:00:28-01:00:33"
  },
  {
    "timestamp" : "01:00:34-01:01:28",
    "speaker" : "Steve",
    "text" : "Yeah. I wonder what it looked like back then compared to the first one. He's in the first Madden PlayStation Madden PlayStation 2 Madden. Jesus. Again, like it's weird to watch these games, and I know everyone listening to this is watching them, but like you're watching them on like a square screen too, not like eight not widescreen. Right. That wasn't a thing back then. There's no HD You definitely have to wear your glasses to see the score and the time. Like, well, ooh, wow, this game has the yellow line for the first down. That's nice for it, you know. It's crazy to watch the games back then versus like now we're in PlayStation 5 and Yeah, production quality is Vastly superior these days. Do you know though the only two quarterbacks to sign a 10-year deal are True Bledsoe and Pat Mahomes? Oh Brett Farp."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:01:28-01:01:39",
    "text" : "Yeah, it's not true. And also um McNab. D think we talked oh yeah, we talked about it. We talked about this after you left, you bitch ass. We went through the whole thing."
  },
  {
    "timestamp" : "01:01:40-01:01:49",
    "speaker" : "Steve",
    "text" : "Yeah. Dumb fucking bitch. Who was the first one to sign a ten-year deal? Gino Capoletti."
  },
  {
    "timestamp" : "01:01:50-01:01:50",
    "text" : "McNab.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Drew Bledsoe's deal with the Patriots was 10 years.",
    "timestamp" : "01:01:52-01:01:55"
  },
  {
    "text" : "Yeah. So is McNabb was like 12.",
    "speaker" : "Andy",
    "timestamp" : "01:01:55-01:01:59"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but McNabb is post Bre Bledzo.",
    "timestamp" : "01:02:00-01:02:03"
  },
  {
    "timestamp" : "01:02:03-01:02:06",
    "text" : "What about Brad Five? Post Bledzo.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:06-01:02:08",
    "text" : "Nope. I don't think that's true.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Same time as Platzon. Wrong. Grab Fav's first one. Rep Favre's first one. Stat check. Like ninety-eight he signed that thing.",
    "timestamp" : "01:02:08-01:02:16"
  },
  {
    "speaker" : "Steve",
    "text" : "Hey, Alexa.",
    "timestamp" : "01:02:17-01:02:18"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:02:18-01:02:19",
    "text" : "Earlier than that."
  },
  {
    "speaker" : "Steve",
    "text" : "Hey girl Greg Leck",
    "timestamp" : "01:02:19-01:02:21"
  },
  {
    "text" : "Hey Siri. Who was the first NFL player to sign a 10-year contract? Not a chance.",
    "timestamp" : "01:02:24-01:02:33",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Siri",
    "text" : "The regular season of NFL is scheduled to start September 10th, 2017.",
    "timestamp" : "01:02:33-01:02:37"
  },
  {
    "speaker" : "Greg",
    "text" : "Did you hear this answer? Do you hear this answer? She's so fucking dumb, dude. How do you get like when is the season starting over? Who's the first?",
    "timestamp" : "01:02:37-01:02:47"
  },
  {
    "text" : "I give up, dude. Is the season even starting? We should probably wrong on that too anyway. God damn it.",
    "speaker" : "Andy",
    "timestamp" : "01:02:47-01:02:53"
  },
  {
    "text" : "Dude. Makes me so mad. Hey but update. I bought the hat.",
    "timestamp" : "01:02:53-01:02:58",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:02:58-01:02:59",
    "text" : "Nice. All right."
  },
  {
    "speaker" : "Greg",
    "text" : "We're in business. Which hat? The chicken wing hat It's on its way.",
    "timestamp" : "01:02:59-01:03:06"
  },
  {
    "timestamp" : "01:03:06-01:03:07",
    "text" : "That's amazing.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. I'll wear it. If it comes before next episode, I'll wear it on the on the pod.",
    "speaker" : "Greg",
    "timestamp" : "01:03:07-01:03:12"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, we're gonna get some Bills guns on the next Bills game and chess. Really suss out how they've done it.",
    "timestamp" : "01:03:12-01:03:22"
  },
  {
    "text" : "Dude, I'm gonna I'm gonna award that hat to somebody.",
    "timestamp" : "01:03:22-01:03:25",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:03:26-01:03:27",
    "speaker" : "Steve",
    "text" : "Oh, that's a good call."
  },
  {
    "speaker" : "Greg",
    "text" : "You know, cause I already have so much useless shit in my house. And I know a lot of Bills fans, so I I might do some sort of competition. I like that.",
    "timestamp" : "01:03:27-01:03:35"
  },
  {
    "speaker" : "Steve",
    "text" : "We should just give one to anybody who a any Bills fan is gonna willingly come on this podcast and Maybe get pooped on.",
    "timestamp" : "01:03:35-01:03:42"
  },
  {
    "text" : "If you have the best Bills fan.",
    "timestamp" : "01:03:42-01:03:44",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:03:44-01:03:46",
    "text" : "We can have our our listeners vote."
  },
  {
    "speaker" : "Andy",
    "text" : "That's what I was gonna say. Yeah, have a few different Bills fans on for the next few Bills games.",
    "timestamp" : "01:03:46-01:03:50"
  },
  {
    "speaker" : "Steve",
    "text" : "Honestly, as like a Bills fan, you deserve it just for being a Bills fan.",
    "timestamp" : "01:03:50-01:03:55"
  },
  {
    "text" : "It's true, which is bound for all of them.",
    "speaker" : "Andy",
    "timestamp" : "01:03:56-01:03:57"
  },
  {
    "text" : "Like anybody they all deserve it. Like I can't say one is more deserving than the other because I'll wear it too. Every Bills fan I've met is just so hardcore. Yeah. Buffalo Buffalo wings rock too. They are.",
    "timestamp" : "01:03:58-01:04:11",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, for our listeners, if you're ever thinking about going to Buffalo for an away game, just do it.",
    "timestamp" : "01:04:12-01:04:17"
  },
  {
    "text" : "Oh yeah.",
    "timestamp" : "01:04:17-01:04:18",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:04:18-01:04:21",
    "text" : "You know, it's not glamorous, but it is an experience.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean the commentators talking about in this game broadcast of like, oh, this is the best. Place to go watch a game. Yeah.",
    "timestamp" : "01:04:22-01:04:29"
  },
  {
    "text" : "You can go to Niagara, you can go to the casino, you can go get Buffalo Wings, and you can go to a football game. That's enough to fill up a long weekend. Yeah. Just with those things alone.",
    "speaker" : "Greg",
    "timestamp" : "01:04:30-01:04:40"
  },
  {
    "timestamp" : "01:04:40-01:04:41",
    "text" : "Rent an RV, right?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:04:41-01:05:15",
    "text" : "Yeah. You don't need a nightclub. You don't need like more than six people at a bar. Like you just want They're legitimately the first time I went there, I was driving through the city of Buffalo. On a Saturday night. It was the night before the game. We were looking for a bar. We couldn't find one anywhere. And a fucking deer ran across the highway. A deer ran across the highway. It was like they",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:05:15-01:05:20",
    "speaker" : "Andy",
    "text" : "It's like those wily coyote fucking Don't laugh too la that happens in your hamster too, bud."
  },
  {
    "timestamp" : "01:05:20-01:05:29",
    "text" : "Yeah, but there was it was completely safe. Because there was no one on the fucking highway on a Saturday night in Buffalo in the middle of like it was in the middle of the city.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:05:29-01:05:41",
    "text" : "It is a special beat up there. Yep. Yep. They're super fun. And uh I I agree. I mean, if you're gonna go if honestly, if I had one away Patriot scheme to go to, Buffalo.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:05:41-01:05:42",
    "text" : "Yeah, I agree.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "New Orleans is pretty good too. Alright. But like just like the atmosphere in the parking lot with New Orleans versus Buffalo is just not the same. Like the like with the pre-game buildup. Honestly, Pittsburgh's up there too. Yeah, I could see Pittsburgh being similar.",
    "timestamp" : "01:05:42-01:05:58"
  },
  {
    "timestamp" : "01:05:58-01:06:01",
    "speaker" : "Andy",
    "text" : "All right boys, let's do our best and worst here"
  },
  {
    "text" : "Okay. Greg.",
    "speaker" : "Greg",
    "timestamp" : "01:06:02-01:06:03"
  },
  {
    "speaker" : "Mom",
    "timestamp" : "01:06:03-01:06:04",
    "text" : "Alright, you go first, Greg."
  },
  {
    "text" : "No, you guys go first. Greg already had his best Ta interception.",
    "timestamp" : "01:06:04-01:06:10",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That was his play of the game. No, it was my play of the game, yeah. Steve.",
    "timestamp" : "01:06:10-01:06:13"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, which is also his best because Craig only watches like five minutes of these games.",
    "timestamp" : "01:06:14-01:06:18"
  },
  {
    "speaker" : "Andy",
    "text" : "He watches the highlights.",
    "timestamp" : "01:06:18-01:06:19"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:06:19-01:06:24",
    "text" : "How about theirs? My best is NFL primetime highlights."
  },
  {
    "timestamp" : "01:06:24-01:06:25",
    "speaker" : "Andy",
    "text" : "Yep."
  },
  {
    "text" : "This thing was legitimately five minutes long.",
    "speaker" : "Greg",
    "timestamp" : "01:06:25-01:06:27"
  },
  {
    "timestamp" : "01:06:27-01:06:29",
    "speaker" : "Andy",
    "text" : "Yeah, and they do that for every game."
  },
  {
    "speaker" : "Greg",
    "text" : "Think about what like SportsCenter does for highlights for football these days. It's like it's like six plays max.",
    "timestamp" : "01:06:29-01:06:36"
  },
  {
    "timestamp" : "01:06:36-01:06:39",
    "speaker" : "Andy",
    "text" : "Oh yeah. Max. And that's if the game was good."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:06:39-01:06:50",
    "text" : "Yeah, and then they'll just read and then they'll have like Shannon Sharp like You got trapped. Just stop Give me five minutes of give me five minutes of yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "There's probably like twenty, twenty one plays. Yeah, yeah. We should do that. We should just start our own YouTube channel where we fucking.",
    "timestamp" : "01:06:50-01:06:55"
  },
  {
    "text" : "People are sick of fucking listening to talking heads. Mm-hmm. Like, well, let's talk about Colin Kaepernick. Damn it, not again.",
    "timestamp" : "01:06:58-01:07:07",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:07:10-01:07:12",
    "speaker" : "Andy",
    "text" : "Uh all right, see you can eat best and worst."
  },
  {
    "timestamp" : "01:07:12-01:07:24",
    "text" : "I haven't done my warfare. Okay Deshaun Jackson's comments on Jewish people. Just getting cut that.",
    "speaker" : "Greg"
  },
  {
    "text" : "All right. You guys go. You're my worst. Um I'll go. I think I have a commentation best. It was Phil Sims.",
    "timestamp" : "01:07:29-01:07:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, we've already been down this row broad.",
    "timestamp" : "01:07:56-01:07:58"
  },
  {
    "speaker" : "Andy",
    "text" : "But Phil Sims The quote was the Buffalo offense has not played that bad today and Drew Bledsoe has played well. Um literally five seconds before Drew Bledzo throws the interception to tie off. Perfect. Perfect timing. Just Chef's kid. He also had a quick comment about how this Buffalo team is about where new the New England team was this time last year. I don't think that would work out for Buffalo. Um but in terms of bests for like plays, I would say the Kevin Falk longest rushing touchdown of his career was a swing pass. It just feels so right.",
    "timestamp" : "01:07:59-01:08:38"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that's pretty cool. Um also can we like he's coming into his own I feel like this year. Yes. Fourth year, right? This is fourth year in the league, which is crazy to think about. And he was like pretty highly regarded coming out of school. So I think he went through that like is he a bust phase. Right. And then he And",
    "timestamp" : "01:08:38-01:09:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Really pulled it together and 'cause I think in two thousand they tried to have him be the the lead back and he just couldn't do it.",
    "timestamp" : "01:09:00-01:09:06"
  },
  {
    "speaker" : "Steve",
    "text" : "He's not a lot he's not a giving the baldum every time. Yep. Yeah, but he's like the original Shane Verein. You know?",
    "timestamp" : "01:09:06-01:09:15"
  },
  {
    "timestamp" : "01:09:15-01:09:17",
    "speaker" : "Andy",
    "text" : "Yeah, Danny Woodhead."
  },
  {
    "text" : "Yeah. He's a James White to me, where it like James White wasn't he everyone would be like he's he's looking really good in camp in practice. But He'd get the ball and he'd be like, eh, eh, I don't know. But then like eventually he just like found his footing and now James White is like the best player on our offense.",
    "timestamp" : "01:09:17-01:09:36",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh yeah. position in her offense the same way Troy Brown created Wes Welker and Dylan Edelman's position",
    "timestamp" : "01:09:36-01:09:48",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:09:48-01:09:50",
    "text" : "Yeah, Kay Falk was the original, the OG."
  },
  {
    "text" : "Kevin Falk's like his stats at LSU were pretty ridiculous.",
    "speaker" : "Greg",
    "timestamp" : "01:09:51-01:09:54"
  },
  {
    "timestamp" : "01:09:54-01:09:55",
    "speaker" : "Andy",
    "text" : "They were."
  },
  {
    "timestamp" : "01:09:55-01:10:19",
    "text" : "I think he's uh Second most career rushing yards in SEC history behind only Herschel Walker. Which is next. Yeah. Yeah. Like all purpose yards. He was tied for fifth in NCA history and first in SEC history when he when he went to the NFL. He was at LSU, right? Yeah. Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:20-01:10:23",
    "text" : "And that's where he's coaching now. He's coach. Uh I think he's a running backs coach."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:10:23-01:10:25",
    "text" : "Yeah, really drafted in?"
  },
  {
    "text" : "Second round. Yeah. So he was like highly regarded coming on.",
    "timestamp" : "01:10:26-01:10:31",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:10:32-01:10:35",
    "speaker" : "Andy",
    "text" : "Worked out. Yeah. Not the way I think anybody expected him to when he was gonna do it."
  },
  {
    "speaker" : "Steve",
    "text" : "James White was a second round draft pick. Wisconsin, he did like he was kind of behind somebody, but he definitely had that all purse yardage shit.",
    "timestamp" : "01:10:40-01:10:47"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:47-01:10:48",
    "text" : "And"
  },
  {
    "text" : "Yeah, I think there's a lot of uh We let Shane Breen go and d I'm so glad we kept James White. Yes, fucking man. Sweet feet. Jimmy Blanco. I'm a Blanco. I got my best the worst.",
    "timestamp" : "01:10:49-01:11:03",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:11:03-01:11:19",
    "speaker" : "Andy",
    "text" : "Hang on, hang on, I haven't done my worst yet. But I have one more quote that this is for Greg. It was about uh quote from Ty Law. Talking about how he's gonna approach the game covering uh speedster Eric Molds. So we can play the speed game if we want, but we can wrestle two if we need to."
  },
  {
    "timestamp" : "01:11:21-01:11:24",
    "text" : "I feel like the Patriots are more wrestling at this point though.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, oh there was a whole bunch of wrestling happening.",
    "timestamp" : "01:11:25-01:11:27",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Otis Smith is definitely like a liability. It was kind of coming a little clear that like If you put a speed guy on him, he can definitely get burned.",
    "timestamp" : "01:11:28-01:11:36"
  },
  {
    "speaker" : "Andy",
    "text" : "And Terrell Buckley was kind of a little too bad. But my worst was well, you know what the good thing about wrestling is, right?",
    "timestamp" : "01:11:37-01:11:46"
  },
  {
    "speaker" : "Greg",
    "text" : "Only takes one person to wrestle. That's right.",
    "timestamp" : "01:11:46-01:11:48"
  },
  {
    "text" : "One person has the water wrestle. Oh fuck you. Yeah So my worst in this game was uh New England kit coverage.",
    "timestamp" : "01:11:49-01:12:01",
    "speaker" : "Andy"
  },
  {
    "text" : "It was yeah. They ended up squibbing it. Special teams.",
    "speaker" : "Steve",
    "timestamp" : "01:12:02-01:12:05"
  },
  {
    "speaker" : "Andy",
    "text" : "They ended up squibbing out of bounds and actually like Giving the Bills worse field position than if they had kicked off. Yeah, special in a bad way. Starting at their own forty.",
    "timestamp" : "01:12:05-01:12:16"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:12:16-01:12:23",
    "text" : "That was bad. Not great. And Charlie Rogers was their return. It was really good."
  },
  {
    "speaker" : "Andy",
    "text" : "A lot of respect.",
    "timestamp" : "01:12:26-01:12:27"
  },
  {
    "speaker" : "Steve",
    "text" : "Well he had a couple of returns where he almost broke it and Belchak saw that and was like, fuck this. Now you can let them get back into it with a big one play.",
    "timestamp" : "01:12:29-01:12:39"
  },
  {
    "text" : "But then out of the interior starts kicking out of balance. Yeah, great.",
    "speaker" : "Andy",
    "timestamp" : "01:12:39-01:12:42"
  },
  {
    "text" : "Alright. I have my best and worst.",
    "timestamp" : "01:12:43-01:12:44",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:12:45-01:12:45",
    "speaker" : "Andy",
    "text" : "Alright, let's hear it."
  },
  {
    "text" : "Um the worst, and I I don't know this for sure, but I'm pretty sure. that this might have ended Victor Green's career.",
    "timestamp" : "01:12:46-01:12:56",
    "speaker" : "Steve"
  },
  {
    "text" : "You think?",
    "timestamp" : "01:12:57-01:12:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Stat check.",
    "timestamp" : "01:12:58-01:12:58"
  },
  {
    "timestamp" : "01:12:59-01:12:59",
    "speaker" : "Andy",
    "text" : "He did get hurt."
  },
  {
    "speaker" : "Steve",
    "text" : "Did he play after this, Greg? Because I know he's like this is his last season-ish, but um he's coming on a blitz and uh the they're like again it's like the fourth quarter. The Patriots is bringing him blitz after blitz after blitz. They're just bringing the house. And um Larry Senters, the Buffalo fullback, blocked some guy. And then kicks his right leg out and hits Victor Green right in the fucking knee.",
    "timestamp" : "01:12:59-01:13:28"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:13:28-01:13:29",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:13:29-01:13:35",
    "speaker" : "Steve",
    "text" : "And Victor Green just collapses. And I I think that ends his career. Wrong."
  },
  {
    "text" : "Not quite.",
    "speaker" : "Andy",
    "timestamp" : "01:13:35-01:13:36"
  },
  {
    "text" : "No? No. Did he play again this year? Yeah. Played every game.",
    "timestamp" : "01:13:36-01:13:42",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:13:43-01:13:45",
    "speaker" : "Andy",
    "text" : "Really? Doesn't start though."
  },
  {
    "text" : "He's not a stat check guy. Either way then.",
    "speaker" : "Greg",
    "timestamp" : "01:13:47-01:13:49"
  },
  {
    "text" : "Like it was it was a clearly only ten year deal in NFL history. Four more games this year.",
    "timestamp" : "01:13:49-01:13:56",
    "speaker" : "Andy"
  },
  {
    "text" : "It was a dirty ass move. Regardless how you slice it, it was a super dirty like he's blocking some dude, sees a free blitzer comic and then sticks out.",
    "timestamp" : "01:13:57-01:14:06",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "They didn't call you",
    "timestamp" : "01:14:07-01:14:08"
  },
  {
    "speaker" : "Steve",
    "text" : "But like he he doesn't have to be. He went shin to knee on on Victor Green and he was out. He like Victor Green was down for a bit. And then My best left is uh Daniel Graham.",
    "timestamp" : "01:14:08-01:14:26"
  },
  {
    "timestamp" : "01:14:26-01:14:28",
    "speaker" : "Andy",
    "text" : "Oh yeah, that was gonna be mine."
  },
  {
    "timestamp" : "01:14:28-01:14:33",
    "speaker" : "Steve",
    "text" : "He had a couple catches early on and like The Bills had no answer for him."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:14:34-01:14:55",
    "text" : "He was catching a bunch of screen pass. There was one that I'll have on the website where he caught a screen pass, but the two defenders like just blew straight past their blocks. So he had two guys coming on him after like immediately catching the ball. And he sidestepped them both and took off for like another 10-15 yards. It was amazing."
  },
  {
    "timestamp" : "01:14:55-01:15:06",
    "speaker" : "Steve",
    "text" : "Especially the first half. Graham was uh I mean this is this is the the Patriots original Hernandez Gronk plan. This Graham uh first round draft pick."
  },
  {
    "timestamp" : "01:15:06-01:15:09",
    "speaker" : "Andy",
    "text" : "Yeah, I think they wanted him to be the Ben Coates replacement."
  },
  {
    "text" : "Who who who would you take, uh Watson or Graham?",
    "timestamp" : "01:15:09-01:15:12",
    "speaker" : "Greg"
  },
  {
    "text" : "That's a good question.",
    "speaker" : "Andy",
    "timestamp" : "01:15:13-01:15:14"
  },
  {
    "speaker" : "Greg",
    "text" : "They're like they're almost a save to me. Yeah, me too.",
    "timestamp" : "01:15:14-01:15:17"
  },
  {
    "timestamp" : "01:15:18-01:15:31",
    "speaker" : "Andy",
    "text" : "I think Watson just barely, because I feel like I can remember more like Big play like clutch touchdowns from him. Like that game where they beat the Bills on Brady's first game back in 08. Yeah. And it came back for like"
  },
  {
    "speaker" : "Greg",
    "text" : "To Watson. Watson rather, yeah.",
    "timestamp" : "01:15:35-01:15:37"
  },
  {
    "timestamp" : "01:15:37-01:15:40",
    "speaker" : "Andy",
    "text" : "And Watson ran down Champ Bailey too."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that play was sick. Yeah, that was sick. Let's take a look here. So Watson, 6,000 career yards, 44 touchdowns.",
    "timestamp" : "01:15:41-01:15:51"
  },
  {
    "text" : "We're talking career or Patriots career?",
    "speaker" : "Steve",
    "timestamp" : "01:15:52-01:15:54"
  },
  {
    "text" : "Uh career. He he",
    "timestamp" : "01:15:54-01:15:56",
    "speaker" : "Greg"
  },
  {
    "text" : "Watson's had a better career, but who was better for the pants? I don't know, I can't I I don't think Dana Brady.",
    "timestamp" : "01:15:57-01:16:05",
    "speaker" : "Steve"
  },
  {
    "text" : "I think it's Watson.",
    "timestamp" : "01:16:05-01:16:07",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:16:07-01:16:10",
    "speaker" : "Steve",
    "text" : "Neither of them lived up to their first round billing, though."
  },
  {
    "speaker" : "Greg",
    "text" : "I think it's Ben Watson. I think by uh statistical standards.",
    "timestamp" : "01:16:10-01:16:14"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:16:16-01:16:30",
    "text" : "Double dipped back to back years, first round tight ends right now. I'd be okay with that. That's what they did, right? Because Graham was The year before. Watson was the year before. Watson's rookie year is last year."
  },
  {
    "speaker" : "Greg",
    "text" : "Watson. Watson's last year. Watson's no Watson's 04 rook",
    "timestamp" : "01:16:30-01:16:33"
  },
  {
    "timestamp" : "01:16:38-01:16:46",
    "speaker" : "Steve",
    "text" : "Either way, I mean we're talking two thousand two, two thousand and four. Two first round picks in three years. Yeah. In three drafts."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:16:46-01:16:52",
    "text" : "Well that that says what they say about what they think about Daniel Graham too. Or their tight end position in general."
  },
  {
    "speaker" : "Andy",
    "text" : "True, yeah, because eventually they figured it out with",
    "timestamp" : "01:16:53-01:16:55"
  },
  {
    "text" : "And now they did it again this year, right?",
    "timestamp" : "01:16:56-01:16:58",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:16:58-01:17:06",
    "text" : "Level dipped again, yeah. Yeah, remember your Well last year this past year they didn't They didn't throw it to the Titans at all."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:17:07-01:17:14",
    "text" : "I've been thinking a lot about another hot take, which might be my my hottest take. Oh, I'm so ready for this."
  },
  {
    "speaker" : "Andy",
    "text" : "Are you ready to launch it?",
    "timestamp" : "01:17:14-01:17:16"
  },
  {
    "speaker" : "Greg",
    "text" : "I think I've actually mentioned it on this podcast before. But I I feel even stronger about it now that I've look read about it. Uh Pete Carroll throwing on second down was the right decision.",
    "timestamp" : "01:17:16-01:17:30"
  },
  {
    "timestamp" : "01:17:31-01:17:39",
    "text" : "Yeah, it was. Yeah, that's not that hot take. It's not that nearly as hot as the Aaron Hernandez is better than Cronkta.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:17:40-01:17:48",
    "text" : "Dude, people fucking murder Pika. They basically chalked that a game up to a bad coaching decision. It's the right coaching decision."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:17:48-01:17:51",
    "text" : "Sure. If he threw the fade, it would have been uh a little bit better."
  },
  {
    "text" : "Yeah. It's second down, you have one timeout. If you run the ball, you have to burn that timeout, and you basically lose fourth down.",
    "speaker" : "Greg",
    "timestamp" : "01:17:51-01:18:00"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, Greg. We've we've already sliced and diced this a bunch. If he throws a fade as instead of the slant, the play call is a was the wrong call. I even like the play call. That's a pretty safe throw.",
    "timestamp" : "01:18:00-01:18:12"
  },
  {
    "timestamp" : "01:18:13-01:18:15",
    "text" : "Well, I'm a disagree with you there.",
    "speaker" : "Andy"
  },
  {
    "text" : "It's an incredible play by Butler. Right. You have them thinking run, just r and you have a mobile quarterback. Like get him outside the pocket on the back. And then you can tuck it and run too. So that's the that's the problem I have with the play call. But Throwing a pass to me, I think, is a is a good decision in that.",
    "timestamp" : "01:18:15-01:18:38",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:18:39-01:18:42",
    "text" : "Yeah, you shouldn't be running a shotgun and throwing it inside the Well I agree.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:18:42-01:18:47",
    "text" : "I mean I I don't think that's it's not that hot of a take, right. I think I think a lot of people would disagree with that.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I think you get a lot of defenders too though. I've heard that a lot.",
    "timestamp" : "01:18:48-01:18:51"
  },
  {
    "text" : "A bunch of times people are like, what are you a fucking idiot?",
    "timestamp" : "01:18:51-01:18:55",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:18:55-01:18:56",
    "text" : "It's peaceful."
  },
  {
    "speaker" : "Steve",
    "text" : "Your Hernandez take is significantly more lava. Molten hot. Yeah. All right. Greg, put it down on record right here, right now. Who's going to be a better tight end the Patriots just drafted? Uh Keen or uh Devin Asiasi?",
    "timestamp" : "01:18:58-01:19:14"
  },
  {
    "text" : "You see, uh I'm not uh I differ, Steve, from maybe you or you and your friends and associates in that I don't make I don't just pull takes out of my ass.",
    "timestamp" : "01:19:16-01:19:27",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:19:28-01:19:28",
    "speaker" : "Andy",
    "text" : "You do?"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't know. I haven't watched them. I haven't watched these guys play. Talk to me after the second preseason game.",
    "timestamp" : "01:19:29-01:19:37"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:19:37-01:19:52",
    "text" : "Bro, bro. Talk to me after the game. What do you think this whole goddamn podcast is about? Just firing shit out Absolutely unbiased on cold. I I already been on like five times tonight."
  },
  {
    "text" : "No, you and your associates, me.",
    "timestamp" : "01:19:52-01:19:54",
    "speaker" : "Greg"
  },
  {
    "text" : "I said Pat Mahomes and Drew Bloodsill, the only tiny data quarterback.",
    "timestamp" : "01:19:55-01:19:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Me and uh stats over storylines. We are all data guys. You",
    "timestamp" : "01:20:00-01:20:06"
  },
  {
    "text" : "You're just a fucking You just held up a a thing of nicknames.",
    "timestamp" : "01:20:06-01:20:09",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:20:11-01:20:17",
    "text" : "A sheetful of Chris Berman nicknames. You're literally writing your data down by pen and pimper.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:20:18-01:20:25",
    "text" : "I am all about the data. And by data I mean Chris Barbon nicknames that I mean Harge Har Har Nickerson.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:20:26-01:20:28",
    "speaker" : "Steve",
    "text" : "Yeah, I mean that's pretty sick."
  },
  {
    "timestamp" : "01:20:29-01:20:31",
    "speaker" : "Andy",
    "text" : "Oh god damn it."
  },
  {
    "text" : "I I'm doing that from here on out. No, I think I'll narrow it down to like maybe my best three, but um I'm gonna scout away teams for nicknames because I'm a big fan of I'm a big fan of funny names, so you're the funny name Hall of Fame guy.",
    "timestamp" : "01:20:31-01:20:48",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:20:48-01:20:49",
    "speaker" : "Steve",
    "text" : "Oh yeah. Yeah."
  },
  {
    "timestamp" : "01:20:49-01:20:51",
    "text" : "Yeah, no, I think that's reasonable.",
    "speaker" : "Andy"
  },
  {
    "text" : "We should have a Mount Rushmore of funny names if we're gonna do this though. Sure. And hardy hard hard Nickerson, my number one vote. Just because he played at the goddamn Bucks. Natron refried means is uh but Andy said they have two names for him, Hardy Har Har Nickinson's the only one I'm willing to enshrine right now. Hardy Harhar.",
    "timestamp" : "01:20:51-01:21:13",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Like that's just it's just so it plays so hard.",
    "timestamp" : "01:21:14-01:21:17"
  },
  {
    "text" : "It's and it's the Buccaneers. He played in the Bucks. That's that makes it a billion times better.",
    "timestamp" : "01:21:18-01:21:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:21:25-01:21:26"
  },
  {
    "timestamp" : "01:21:26-01:21:33",
    "speaker" : "Andy",
    "text" : "All right, boys. What's next week? The Patriots Miracle in Champ Champagne."
  },
  {
    "timestamp" : "01:21:34-01:21:36",
    "text" : "Oh, I got newspaper clippings from this.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:36-01:21:41",
    "text" : "Wait, we win? Wait, think we're gonna lose again? Well it could be a win or a loss, Steve."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:21:41-01:21:41",
    "text" : "You don't know."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:21:41-01:21:51",
    "text" : "That's fine. I'm I'm over like not knowing the score. Now that one. Why? Well I'm not gonna like actively seek out the score, but if I see it, I'm not gonna be upset."
  },
  {
    "timestamp" : "01:21:52-01:21:56",
    "speaker" : "Andy",
    "text" : "I want to know when this This is just a good game."
  },
  {
    "speaker" : "Steve",
    "text" : "Is it at the Bears or at home?",
    "timestamp" : "01:21:56-01:21:58"
  },
  {
    "timestamp" : "01:21:58-01:22:02",
    "text" : "It is at Memorial Stadium in Champaign, Illinois.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:22:02-01:22:09",
    "text" : "It's Champaign, Illinois. It's not Champlain. That's what I thought. Isn't it Lake Champlain?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:22:09-01:22:12",
    "speaker" : "Andy",
    "text" : "Or am I am I Champagne, Illinois?"
  },
  {
    "text" : "I don't know actually. It might be Champlain. I'm pretty sure it's Champlain.",
    "timestamp" : "01:22:13-01:22:17",
    "speaker" : "Steve"
  },
  {
    "text" : "Look yeah, and you've been right so far on this podcast.",
    "timestamp" : "01:22:17-01:22:19",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:22:21-01:22:22",
    "speaker" : "Steve",
    "text" : "You're like over seven today, Steve."
  },
  {
    "timestamp" : "01:22:23-01:22:24",
    "speaker" : "Andy",
    "text" : "It's over eight, because I'm looking at it."
  },
  {
    "text" : "I have a lot of golf courses in Chicago, so I should know guys.",
    "speaker" : "Steve",
    "timestamp" : "01:22:24-01:22:27"
  },
  {
    "timestamp" : "01:22:30-01:22:36",
    "speaker" : "Greg",
    "text" : "No, we're looking for it. Yeah, we're looking for an L Champlain. We'll figure it out."
  },
  {
    "timestamp" : "01:22:36-01:22:42",
    "speaker" : "Steve",
    "text" : "Isn't there uh did you ever get in touch with that guy who wanted to be on this podcast this episode, Andy? Champlain?"
  },
  {
    "timestamp" : "01:22:42-01:22:47",
    "text" : "That's in New York. Okay. That's what we're thinking of.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:22:48-01:22:49",
    "text" : "So I think that."
  },
  {
    "timestamp" : "01:22:49-01:22:56",
    "text" : "So like Vermont, New York border. Yeah. In Canada. I don't remember this game at all, so I'm excited to watch it again.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I I've seen the highlights of this game and it's very exciting.",
    "timestamp" : "01:22:56-01:23:00"
  },
  {
    "text" : "Alright, I'm gonna do a I'm gonna do a Lake Champlain uh deep dive. I'm gonna talk about the biodiversity of the lake. It's good.",
    "timestamp" : "01:23:00-01:23:08",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. How much acres of wetlands, Craig? Well, it's uh four hundred and ninety square miles. Uh Any word from that guy who left us a review who wants to be on this thing on that?",
    "speaker" : "Steve",
    "timestamp" : "01:23:13-01:23:28"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:23:28-01:23:34",
    "text" : "Well I tried to answer you, but you interrupted me last time. No, we have not heard from whoever that was that left us. No thank you."
  },
  {
    "speaker" : "Steve",
    "text" : "Where did they leave a review on? On Facebook or iTunes. Somewhere else. iTunes? Yeah. Uh um we we we did post one, right? On Facebook saying if you with this review on everything, yeah.",
    "timestamp" : "01:23:34-01:23:49"
  },
  {
    "speaker" : "Andy",
    "text" : "I haven't heard back.",
    "timestamp" : "01:23:50-01:23:51"
  },
  {
    "text" : "I'll throw that again.",
    "timestamp" : "01:23:51-01:23:52",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I might reach out to who I think it is. Who do you think it is? The guy that left us the",
    "timestamp" : "01:23:53-01:23:57"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:24:00-01:24:03",
    "text" : "I'm thinking of Bears fans I know. I don't know any bears."
  },
  {
    "timestamp" : "01:24:03-01:24:06",
    "speaker" : "Greg",
    "text" : "Yeah, he probably got a couple twink friends, right, Steve?"
  },
  {
    "speaker" : "Steve",
    "text" : "And I actually know I know I mean I know some from work.",
    "timestamp" : "01:24:06-01:24:09"
  },
  {
    "text" : "Work.",
    "timestamp" : "01:24:10-01:24:11",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Nice. Great joke. Well did you hear the beginning part of it? Well I'm the only one who knows any fucking I only knows any friends of any other team. Well, did you hear what I said though? That I know gay guys. No, I said you know twink friends. No, I said no bears fans.",
    "timestamp" : "01:24:17-01:24:38"
  },
  {
    "timestamp" : "01:24:38-01:24:48",
    "text" : "I said I probably know a couple from work. I know gay f I know gay people from work too. Oh, do you? Oh I I can't I got some of my best friends are gay.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:24:53-01:24:57",
    "text" : "Yeah, I've convinced uh another person on Twitter to come on."
  },
  {
    "speaker" : "Greg",
    "text" : "That's hilarious though. I actually I actually do know a gay person from Chicago. They live next door. We're good buddies. Shout out Jake. He's awesome.",
    "timestamp" : "01:24:58-01:25:07"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I met Jake. All right. All right. We wrapped up. We'll see you next week. Oh, we're still recording? On the Pages Dynasty podcast.",
    "timestamp" : "01:25:07-01:25:17"
  },
  {
    "text" : "Wow. Dude, by the way, Lake Champlain sounds like it's got like some sort of fucking sweet underwater reef. An extensive Ordovician carbonate rock formation.",
    "timestamp" : "01:25:17-01:25:28",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Andy, you should just cut the uh ending in way earlier.",
    "timestamp" : "01:25:28-01:25:32",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, that's exactly what I'm gonna do. I'm gonna cut all this shit. Dude, but what about the ecology of the fucking lake, Andy?",
    "timestamp" : "01:25:33-01:25:39"
  },
  {
    "speaker" : "Andy",
    "text" : "Cutting all",
    "timestamp" : "01:25:39-01:25:40"
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, it's actually pretty big like the the War of 1812, the Revolutionary War, the Siege of Quebec.",
    "timestamp" : "01:25:41-01:25:49"
  },
  {
    "speaker" : "Steve",
    "text" : "Ever heard of it? Should I try and get my Chicago friend on it for next week? Yeah.",
    "timestamp" : "01:25:50-01:25:56"
  },
  {
    "timestamp" : "01:25:57-01:26:02",
    "speaker" : "Andy",
    "text" : "I'll try to reach out to this other person. What are you doing?"
  },
  {
    "speaker" : "Greg",
    "text" : "I have my foot on the underside of my chair and I accidentally press the button that lowers it and like fuck it's like jammed my foot. Holy shit. Damn it",
    "timestamp" : "01:26:04-01:26:14"
  },
  {
    "timestamp" : "01:26:15-01:26:16",
    "speaker" : "Andy",
    "text" : "All right, boys."
  },
  {
    "speaker" : "Greg",
    "text" : "That's all we have for this week. Thanks for tuning in again, and we will see you next week. Hey later.",
    "timestamp" : "01:26:17-01:26:24"
  }
]