[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:18"
  },
  {
    "speaker" : "Andy",
    "text" : "So welcome back. To all of you loyal listeners, because you keep listening, we keep doing this, and now we are doing a second season This is the 2002 NFL season. And we're starting here week one, Patriots Banner Knight opening their new stadium with uh a nice show. You skip the preseason or what? Did you watch a preseason?",
    "timestamp" : "00:21-00:46"
  },
  {
    "text" : "I watched every game. Rohan Davies, the future.",
    "speaker" : "Greg",
    "timestamp" : "00:46-00:53"
  },
  {
    "speaker" : "Andy",
    "text" : "Well all right yeah let's let's back up a little bit then because uh we could talk about some off season stuff since this is week one. Um And there were some there were some big changes in the offseason. The biggest one being um Drew Bledsoe is no longer a a New England patriot and has gotten traded to the Bills. Greener Pills. Great. Going up north to uh to Buffalo is it Orchard Park? New York?",
    "timestamp" : "00:55-01:22"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:22-01:25",
    "text" : "Yep, wider pastures. Exactly."
  },
  {
    "timestamp" : "01:25-01:41",
    "speaker" : "Andy",
    "text" : "Yeah, there's not a lot of greenery happening up there, I don't think. But I'm sure we'll see him uh in a in uh future episodes. But yeah, let's talk about uh the off season, what happened. There was uh Some interesting there wasn't really anybody else who got let go, was it?"
  },
  {
    "timestamp" : "01:42-01:43",
    "text" : "Terry Glenn, see you later.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Off to the Packers. Which uh we talked about in the offs in our uh last season with the uh the bye week deep dive of Terry Glenn, where he actually did uh not well on the Packers, I don't think, but then would get back to his normal uh productive self when he would reconnect with Bill Parcells on the the Cowboys. And Drew Bledsoe. Drew Bledsoe as well, yes. He would also do that. Yeah, they would all get back together, getting the gang back together in Dallas. Yikes. Also a big loss of Rod Rutledge. The was he the leading tight end in two thousand one? I think he may have been, but just by default because he was the only tight end that actually caught any passion. Until the playoffs. Well true, yeah.",
    "timestamp" : "01:44-02:27"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "02:27-02:30",
    "text" : "Then our boy Wig Wiggy. Jermaine Wiggins. That's right."
  },
  {
    "timestamp" : "02:31-02:36",
    "speaker" : "Greg",
    "text" : "What does he do, Connor, right now? Is he still on the radio? Yeah, he's on EEI, I think."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "I think he's on the wait, is Wiggy on OMF? I thought he was on like one of those late night TV shows on Boston's.",
    "timestamp" : "02:40-02:47"
  },
  {
    "timestamp" : "02:51-02:52",
    "text" : "Who was the racist community?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "02:52-02:54",
    "text" : "Callahan. Yeah, yeah."
  },
  {
    "text" : "So I think he took over for him.",
    "timestamp" : "02:54-02:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "02:57-03:00",
    "text" : "A racist talk show host in Boston? Yeah. You get a big thing.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "03:02-03:05",
    "speaker" : "Andy",
    "text" : "Yeah, they they they got well as him and uh whoever the other guy was."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Who was always Minahan. Yeah.",
    "timestamp" : "03:05-03:07"
  },
  {
    "timestamp" : "03:07-03:08",
    "speaker" : "Andy",
    "text" : "I liked Mina."
  },
  {
    "text" : "He Me too.",
    "timestamp" : "03:09-03:11",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh he got old fast for me.",
    "timestamp" : "03:11-03:13"
  },
  {
    "text" : "He was a good interview he was he g he was a really good interviewer though. I mean he did not pull any punches. It didn't matter who they were interviewing. He he was he was pretty solid.",
    "timestamp" : "03:13-03:23",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. But he left to start his own podcast on Barston. And so now it's uh they got the guys from AAF, the morning show from AAF, which isn't uh Greg Hill. Yes, the Greg Hill morning show.",
    "timestamp" : "03:23-03:36"
  },
  {
    "timestamp" : "03:37-03:39",
    "speaker" : "Connor Ireland",
    "text" : "I'll just keep doing your job for you, Andy."
  },
  {
    "text" : "It's cool. This is this is what we're doing.",
    "timestamp" : "03:39-03:41",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "03:50-03:51",
    "speaker" : "Connor Ireland",
    "text" : "Lately."
  },
  {
    "timestamp" : "03:53-03:55",
    "speaker" : "Steve",
    "text" : "I don't listen to Boston Sports talk at all."
  },
  {
    "text" : "It's the fucking worst. It's awful. It's so much better than in North Carolina. It's hilarious. Feel like the Hurricanes dropped another one, but you know, they'll get them next game.",
    "timestamp" : "03:55-04:08",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, so it's not just because they're negative about a different team, they're just less negative in general.",
    "timestamp" : "04:08-04:13"
  },
  {
    "timestamp" : "04:13-04:25",
    "speaker" : "Greg",
    "text" : "Oh yeah. Yeah. Oh yeah. They're less negative across the board. They even like make fun of Boston Sports. They have like a segment of like pissed off Boston Sports Radio. It's hilarious."
  },
  {
    "text" : "We should do that and just have Connor on.",
    "timestamp" : "04:27-04:29",
    "speaker" : "Andy"
  },
  {
    "text" : "Bill's Bill's radio is pretty good too. Uh You got Brendan obviously, I have to hear it. Um, you know, Ricochet Bill's radio up from time to time and God the depression in their voices and and and and the the lack of optimism.",
    "speaker" : "Connor Ireland",
    "timestamp" : "04:30-04:48"
  },
  {
    "speaker" : "Greg",
    "text" : "It's so it's it's like watching the NFL draft. Tragedy porn.",
    "timestamp" : "04:50-04:59"
  },
  {
    "timestamp" : "05:01-05:12",
    "speaker" : "Andy",
    "text" : "I I know we've joked about doing a a a Browns on Browns podcast, but I think that'd be really interesting just to hear how Cleveland Sports is there Cleveland Sports Talk Radio? Of course."
  },
  {
    "speaker" : "Steve",
    "text" : "I'm sure there is, yeah.",
    "timestamp" : "05:12-05:13"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "No, browns are hardcore. It's probably just like built buff like Buffalo Sports Radio, you know.",
    "timestamp" : "05:17-05:24"
  },
  {
    "speaker" : "Steve",
    "text" : "You know who's sneaky also depressed? Detroit",
    "timestamp" : "05:24-05:27"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't think that's very sneaky.",
    "timestamp" : "05:28-05:29"
  },
  {
    "speaker" : "Steve",
    "text" : "Detroit, Cleveland, right there, that little pocket. Oh boy.",
    "timestamp" : "05:29-05:33"
  },
  {
    "text" : "Pocket of sadness. Little rust belt.",
    "speaker" : "Andy",
    "timestamp" : "05:33-05:35"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. All right, what else we got from the off season? The draft?",
    "timestamp" : "05:35-05:41"
  },
  {
    "text" : "The draft, yeah. The almond branch. I know Connor has thoughts about this draft.",
    "timestamp" : "05:41-05:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Does he?",
    "timestamp" : "05:46-05:46"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:47-05:49",
    "text" : "I couldn't wait to share it with you."
  },
  {
    "timestamp" : "05:50-06:31",
    "text" : "What an incredible draft. I mean, take out Rohan Davey or Antoine Antoine Romac uh Womack. And I mean that just looking at, you know, knowing what we know now and and seeing their careers in in completion, just like Daniel Graham, Jarvis Green, Dion Branch, and then David Givens in the seventh. Yeah, that's one of the oldest. Yeah. He Think how many he had so many big catches for us in those uh the 2003 and 2004 season, but yeah, what a what a steal. He was just Mr. Reliable for Tom.",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "He was the guy that would move the chains every time.",
    "speaker" : "Andy",
    "timestamp" : "06:32-06:34"
  },
  {
    "text" : "I had his jersey. Yeah.",
    "speaker" : "Connor Ireland",
    "timestamp" : "06:34-06:35"
  },
  {
    "speaker" : "Andy",
    "text" : "You had a David Gibbons jersey?",
    "timestamp" : "06:35-06:37"
  },
  {
    "timestamp" : "06:37-06:46",
    "speaker" : "Steve",
    "text" : "I did, yep. Yeah. And then he got hurt and was like never played again. So it's your fault."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yeah. Yeah Yeah and Jar and even like Jarvis Green, he was he was never a superstar, but he was solid for years. Just it was a really, really, really good draft, obviously, Dion being the highlight, Dion Branch being the highlight.",
    "timestamp" : "06:46-07:05"
  },
  {
    "text" : "That's true, but I think the uh the newspapers were were big on uh the Patriots drafting their Drew Bloodsell replacement in Rohan Davy. They were a big fucking fan of him.",
    "timestamp" : "07:06-07:17",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:18-07:24",
    "speaker" : "Connor Ireland",
    "text" : "Yeah. He had a rocket arm. Yeah, I I remember people were gushing over him."
  },
  {
    "timestamp" : "07:25-07:25",
    "speaker" : "Andy",
    "text" : "Yeah, yeah."
  },
  {
    "timestamp" : "07:27-07:43",
    "text" : "He's Jamaican. He was born in Jamaica. Really? Uh-huh. Wow. Got a little Rasta quarterback. Arena Arena League legend too. Was he? I I think he played a couple years.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:44-07:49",
    "text" : "I'm surprised at how many people were discovering who spent time in the the AFL."
  },
  {
    "speaker" : "Greg",
    "text" : "I know we gotta bring it back. Connor, have you heard of the LA Kiss?",
    "timestamp" : "07:50-07:55"
  },
  {
    "text" : "Okay, so Andy told me one of you guys is doing like a spotlight on it after your interview with m Matt Chatham. Um How is it? Ch Chatham, Chatham, Matt Chatham. Chatham.",
    "timestamp" : "07:58-08:12",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "Um Are you not from around here?",
    "timestamp" : "08:12-08:14"
  },
  {
    "text" : "Fucking Chatham?",
    "timestamp" : "08:14-08:15",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Fucking chat 'em, kid.",
    "speaker" : "Andy",
    "timestamp" : "08:16-08:17"
  },
  {
    "text" : "Alright. Chatham. Sorry about that. Uh apology except No, I really I I have no idea about I have no idea anything about it. I didn't even look into it. I figured one of you guys were gonna talk about it.",
    "speaker" : "Connor Ireland",
    "timestamp" : "08:17-08:30"
  },
  {
    "text" : "Uh you have to listen to the episode that that comes out. Yeah, recap for two hours. The entire season of the show.",
    "speaker" : "Andy",
    "timestamp" : "08:30-08:38"
  },
  {
    "timestamp" : "08:38-08:46",
    "text" : "I watched ten episodes. of like a hard knocks version of for Arena Football League.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Of a team sponsored by Kids.",
    "timestamp" : "08:46-08:48"
  },
  {
    "text" : "Is that a rock band. Is that is that what a Is that what it is? Yeah. Is it like uh Gene Simmons? Oh, okay. Oh yeah. Okay, I think I could get behind I think I could get behind this. Right.",
    "speaker" : "Connor Ireland",
    "timestamp" : "08:48-08:59"
  },
  {
    "text" : "Yeah. Highly recommended. Uh speaking of of tight ends. Uh KISS has some tight ends, I would say. Um Uh some other in free agency. The Patriots seem to want to address the tight end position this year since they didn't have one the year before. Brought in Cam Celand from the Saints. And our all our uh old friend Christian Fourier from the Seahawks. I think he starred on the Seahawks, didn't he? Mm-hmm. Back check.",
    "speaker" : "Andy",
    "timestamp" : "09:01-09:27"
  },
  {
    "timestamp" : "09:29-09:31",
    "text" : "Nah, it's not worth it.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I remember I remember looking at it briefly and he didn't do much on oh fucking hell. He played on the Seahawks for since 95 to 2001. Jesus Christ. I I thought he was younger than that when he came to the Patriots, but I guess not.",
    "timestamp" : "09:32-09:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "And ironically, he's not Christian at all. He's Jewish.",
    "timestamp" : "09:47-09:51"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:54-10:00",
    "text" : "Seven years with the Seahawks, he caught seven touchdowns. Four years with the Patriots, he caught thirteen. So"
  },
  {
    "timestamp" : "10:00-10:08",
    "speaker" : "Greg",
    "text" : "Remember that time that he was suspended from EEI for uh making fun of Don Ye? I do remember that. Speaking of EEI."
  },
  {
    "text" : "I mean that's that's kind of what happens.",
    "speaker" : "Andy",
    "timestamp" : "10:11-10:12"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Is that Don Yi a sports agent? Yeah, yeah. Yikes.",
    "timestamp" : "10:16-10:20"
  },
  {
    "speaker" : "Steve",
    "text" : "Sorry, I like the warrior yikes. I have a trivia question for you guys. All right. Who caught more balls and yards? Cam Cleeland in this year or Matt Lacoste in the past year?",
    "timestamp" : "10:20-10:33"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh fuck.",
    "timestamp" : "10:34-10:35"
  },
  {
    "text" : "Cam Cleeland.",
    "speaker" : "Connor Ireland",
    "timestamp" : "10:35-10:36"
  },
  {
    "text" : "Cam Cleeland probably in the game. Yeah, I've already seen him catch like two balls in this first game.",
    "timestamp" : "10:36-10:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yeah, he had six catches, I think, this game.",
    "timestamp" : "10:42-10:45"
  },
  {
    "timestamp" : "10:46-10:50",
    "speaker" : "Steve",
    "text" : "He ends up. He ends up with sixteen grabs for a hundred and twelve yards."
  },
  {
    "text" : "Damn. So that's about as much as any Patriots tight ends this year combined.",
    "timestamp" : "10:50-10:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "10:55-11:01",
    "text" : "No. Matt Lacrosse had 131 yards in your face, Cam. Damn"
  },
  {
    "text" : "You showed him.",
    "speaker" : "Andy",
    "timestamp" : "11:02-11:03"
  },
  {
    "text" : "But he was supposed to be like legit, right? Like Cleveland. I f I felt like I was set for him.",
    "speaker" : "Steve",
    "timestamp" : "11:03-11:07"
  },
  {
    "text" : "Did he get hurt? He did he get hurt? He came out of the gate with six catches. I mean it was only forty yards, but he Six uh six targets, six receptions first game. I wonder if he got hurt or if they just I I have no idea.",
    "speaker" : "Connor Ireland",
    "timestamp" : "11:08-11:23"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "11:24-11:31",
    "text" : "So he does get a touchdown. I actually had a note about this. He gets a touchdown in this game, I believe, right? In this game?"
  },
  {
    "timestamp" : "11:31-11:32",
    "speaker" : "Andy",
    "text" : "I don't think he's touched."
  },
  {
    "text" : "No, he doesn't. Fourier had the touchdown. I'm looking at his Wikipedia. And it says while when he was a rookie with the Saints, he was struck in the eye by a teammate with a sock filled with coins during a hazing incident. What? Nearly lost his eye in addition to suffering a broken eye socket. and broken nose. The injury permanently affected his eyesight. What? Good Lord. Wow. Wow. I might if it was Richie Incognito. That's one of the referenced articles.",
    "timestamp" : "11:32-12:08",
    "speaker" : "Greg"
  },
  {
    "text" : "That's a a wild wild story. I mean, especially next to now compared to yeah, compared to like PC culture now. I mean Someone did that in today's game. I mean they you know, they didn't rape y it's not rape or beating up kids, so they'd probably like suspend them for a year to hit someone in the eye with Sock filled with coins.",
    "timestamp" : "12:12-12:41",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, it's like probably. What is he joining a gang? Well it depends on how good the guy who hit him was, probably. I'll do some research and let you know. All right, if you if you could, that'd be great.",
    "timestamp" : "12:41-12:51"
  },
  {
    "text" : "We'll do a deep dive on that one.",
    "timestamp" : "12:51-12:52",
    "speaker" : "Andy"
  },
  {
    "text" : "There's a whole L LA Times article on it.",
    "timestamp" : "12:53-12:56",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh All right, so that's kind of the the big changes for the offseason. Um so there wasn't a ton of turnover really uh on this Patriots team other than Drew Blood's own Terry Glenn. Uh Brian Cox is on the Saints. Which uh you didn't play much down the street. Not really. He uh he broke his leg middle of the season and then came back and played on it. Um but was not the same guy, so couldn't really Couldn't really move much. So he was he was like a just a run stopper on short yardage down sort of.",
    "timestamp" : "12:57-13:37"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yeah, I liked uh Yep, I liked old man. I think what do you wear, number ninety-two or ninety-five or something like that? I loved I like Brian Cox.",
    "timestamp" : "13:37-13:46"
  },
  {
    "timestamp" : "13:46-13:51",
    "speaker" : "Steve",
    "text" : "He uh for the Saints So he wants to get hurt again."
  },
  {
    "speaker" : "Andy",
    "text" : "I don't I don't and then he got into coaching and coached uh Matt Chatham when he went to the Jets. They were uh didn't see eye to eye when they were on the Patriots, if I recall Um and uh the opponent tonight was the Pittsburgh Steelers, who also really hadn't changed much. Their team was basically the same as well. Yeah. So the commentators actually mentioned that where it was basically almost an exact rematch of the AFC championship game the year before because both these teams were exactly the same. Um except even though the Steelers defense was the same, uh they struggled a lot for our Steelers defense, I would think. Um it was the same defense where they finished 16th in points allowed, which is like what middle of the table? And seventh in yards allowed, which is not bad, but they gave up a shit ton of passing yards and rushing touchdowns for some reason, which we actually saw Kind of in in this game where the Patriots decided they weren't gonna run the ball and just spread them out and just gas them to death. So they ranked actually twentieth in passing yards allowed and twentieth in rushing touchdowns allowed. So I think there was a blueprint that came out early.",
    "timestamp" : "13:52-15:04"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "15:12-15:33",
    "text" : "maybe the best linebacking core I've ever seen in my entire life. There's some big names of the Steelers. I Jason Gilden, uh Farrier, I don't know if you guys remember Kendrell, Joey Porter, Kendrell Bell. Yeah, Kendrell Bell was so many It's a second year. Yeah."
  },
  {
    "timestamp" : "15:33-15:39",
    "text" : "James Harrison. I think this is Har Harrison's rookie year.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. No. Was it really?",
    "timestamp" : "15:39-15:42",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he's undrafted. He was undrawn.",
    "timestamp" : "15:42-15:45"
  },
  {
    "timestamp" : "15:45-15:54",
    "text" : "Yeah, they also fucking hell. And they also had Larry Foot. Larry Foot was no slouch either. Larry Foote had some good years in the league as well.",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "15:54-16:14",
    "speaker" : "Andy",
    "text" : "I mean I mean this was a linebacker crew that Mike Vrabel couldn't crack. And now he's starting on the Patriots and winning Super Bowl. Yeah. He was the only one that did anything in this game, I think. But I mean, having said all that, the the Steelers could get almost no pass rush in this game whatsoever. He was like the first two drives."
  },
  {
    "text" : "All time sack leader in the Steelers and still is.",
    "timestamp" : "16:15-16:17",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "16:18-16:34",
    "speaker" : "Andy",
    "text" : "Who is? Gildin? Yeah, he was a monster. To be fair, he was also the only one uh still celebrating down three touchdowns in the fourth quarter when he makes a tackle for a loss. Uh they gotta style that that Steelers deep."
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "16:34-16:37",
    "text" : "Yeah, so we're gonna be able to use the detect case."
  },
  {
    "timestamp" : "16:38-16:38",
    "speaker" : "Andy",
    "text" : "Go ahead."
  },
  {
    "timestamp" : "16:38-16:59",
    "speaker" : "Connor Ireland",
    "text" : "No, go ahead. I was just gonna say their D their D line wasn't bad either, like Casey Hampton. Uh I remember all these names, like Clark Hagen's, Chemo, Chemo on Oldhoffen. Yeah, I mean do you think I was like, yeah."
  },
  {
    "text" : "It's classic football name right there. Oh yeah. It is.",
    "timestamp" : "17:00-17:04",
    "speaker" : "Greg"
  },
  {
    "text" : "Wonder where he's from. Yeah.",
    "timestamp" : "17:04-17:06",
    "speaker" : "Steve"
  },
  {
    "text" : "But yeah, so uh two of those linebackers, Gilden and Porter, would actually make the Pro Bowl, along with Heinz Ward, who I still hate to this day, and Alan Fanaker, their guard. Oh yeah, of course you do, because you're you're an asshole too. Just like here.",
    "speaker" : "Andy",
    "timestamp" : "17:08-17:22"
  },
  {
    "text" : "Yeah, well you're an asshole too, Steve. Yeah, goddamn right.",
    "speaker" : "Greg",
    "timestamp" : "17:26-17:29"
  },
  {
    "timestamp" : "17:30-17:33",
    "text" : "I said I like Heinzwein. I think I like his compete level.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, because you're an asshole.",
    "timestamp" : "17:33-17:34",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, that's true. On both accounts.",
    "timestamp" : "17:34-17:37",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "17:37-17:38",
    "speaker" : "Greg",
    "text" : "It's a transitive property."
  },
  {
    "timestamp" : "17:38-17:39",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:39-17:40",
    "text" : "Yeah, I think that works."
  },
  {
    "text" : "You'll recognize real.",
    "timestamp" : "17:40-17:42",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "17:42-17:50",
    "speaker" : "Andy",
    "text" : "And uh the the new face on this offense was uh Antoine Randall L, which is also fantastic uh but he was mostly a return man this season."
  },
  {
    "timestamp" : "17:50-17:52",
    "speaker" : "Greg",
    "text" : "Well, he's a Swiss Army knife."
  },
  {
    "timestamp" : "17:53-17:59",
    "speaker" : "Andy",
    "text" : "He was, yeah. He was their Troy Brown, according to John Matton. He was a college quarterback, right? Was that him?"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "17:59-18:07",
    "text" : "Yeah, was it not it wasn't it wasn't uh I almost said VTech, but that can't be right. I can't remember where he went to school."
  },
  {
    "speaker" : "Greg",
    "text" : "I got you. Fact check. Fact check guy. You went to Indiana. Indiana.",
    "timestamp" : "18:08-18:14"
  },
  {
    "timestamp" : "18:14-18:15",
    "text" : "Quarterback?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:16-18:17",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "18:20-18:20",
    "text" : "Maybe not."
  },
  {
    "timestamp" : "18:21-18:22",
    "speaker" : "Greg",
    "text" : "I'll get back to you on that."
  },
  {
    "timestamp" : "18:22-18:27",
    "text" : "There was a yeah, who was the Steelers wide receiver that that threw a a touchdown pass in the Super Bowl?",
    "speaker" : "Andy"
  },
  {
    "text" : "I'm almost positive it's Randall L. I think it's the Seahawks. I thought it was like his fun fact. Right.",
    "timestamp" : "18:28-18:32",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "18:33-18:39",
    "text" : "And then they and they talked right and they talked about him playing quarterback in college. I s I swear to goodness.",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Yeah, he yeah, he was the first player in Division I history to pass for 40 career touchdowns and score forty career rushing touchdowns. He also played uh for the Indiana basketball team, which is no like middle league program.",
    "speaker" : "Greg",
    "timestamp" : "18:41-18:59"
  },
  {
    "speaker" : "Steve",
    "text" : "Wait, dual sported at Indiana?",
    "timestamp" : "19:00-19:02"
  },
  {
    "speaker" : "Greg",
    "text" : "Under Coach Bob Knight. What a monster. Yeah. That's impressive. That's pretty sick.",
    "timestamp" : "19:02-19:09"
  },
  {
    "timestamp" : "19:09-19:14",
    "speaker" : "Andy",
    "text" : "God damn. See him I like. Hands work and eat a dick though."
  },
  {
    "text" : "Yeah, he almost he almost didn't get it. He had to sit out a year before we're going to Indiana because of low SAT scores though. Fucking dummy.",
    "timestamp" : "19:14-19:23",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "SATs don't translate to football, bud.",
    "timestamp" : "19:24-19:26"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "19:26-19:32",
    "text" : "What was a lot of community service though. He's a well-rounded applicant."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh so we actually saw Cordell Stewart again in this game, but he would not last long on the season. He uh he got benched in week four because he couldn't stop throwing interceptions. Uh which he started doing From the get-go in this game, if we want to actually get into it.",
    "timestamp" : "19:34-19:51"
  },
  {
    "timestamp" : "19:51-19:59",
    "speaker" : "Steve",
    "text" : "Let's be real. He didn't stop doing it, right? He threw two picks to close out the AFC Championship game, comes right back, goes 0 for 3-2 INT."
  },
  {
    "text" : "That's true, yeah. Yeah, he threw uh two picks on his first three passes. Uh uh both of those those two were actually back to back. So he threw an interception, came right back and decided one wasn't enough and threw another one immediately. To Mike Vrabel of all people, which is hard to do.",
    "speaker" : "Andy",
    "timestamp" : "19:59-20:14"
  },
  {
    "speaker" : "Steve",
    "text" : "He threw it right into Vrabel's bed back. He just didn't see him and is like, here you go. Yeah, that was bad.",
    "timestamp" : "20:15-20:20"
  },
  {
    "text" : "But I have to say he can he can huck a football deep from any body position. Like he's running sideways and diagonally backwards and just like Just slings it like he's he's skipping rocks and it goes sixty yards out.",
    "speaker" : "Andy",
    "timestamp" : "20:21-20:34"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "You you all y'all remember his nickname, right? Slash Yeah.",
    "timestamp" : "20:34-20:39"
  },
  {
    "speaker" : "Andy",
    "text" : "Not him? Yeah. I don't know why. Didn't he play a bunch of positions too?",
    "timestamp" : "20:39-20:44"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "20:44-20:48",
    "text" : "Quarterback and wide receiver and running back and all that shit."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "20:49-20:50",
    "text" : "That's what I was about to get."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "20:50-20:50",
    "speaker" : "Andy"
  },
  {
    "text" : "Yo Randall L, he got drafted too for uh Major League Baseball.",
    "timestamp" : "20:51-20:55",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "What about Cordell Stewart?",
    "timestamp" : "20:56-20:57"
  },
  {
    "timestamp" : "20:58-21:00",
    "speaker" : "Greg",
    "text" : "I don't know. I'm too deep into Randall L right now."
  },
  {
    "timestamp" : "21:05-21:19",
    "speaker" : "Andy",
    "text" : "So but uh yeah, I want to bring up I wanted to touch on somebody who I I found fascinating in this while I was doing my research, and that was the guy who took over for Cordell Stewart. And that was my boy Tommy Maddox."
  },
  {
    "text" : "Yep.",
    "timestamp" : "21:21-21:22",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "Pittsburgh legend, Tommy Maddox, apparently. Uh he played in the AFL. Just like everybody else. New Jersey Red Dogs did okay and also played in the the original XFL, if you remember that, with He Hate Me. And was the league MVP for that one season. Uh he actually got drafted by the Broncos. He was supposed to be Elway's replacement, and then, you know. Well obviously wasn't. He's a first round pick. Yeah. By the yeah back. Tommy Maddox was a first round pick. What the fuck, dude? By the Broncos though, so. Yeah, LA had a hand in it.",
    "timestamp" : "21:23-22:00"
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, I I always thought he was just like a journeyman. I never realized that he had an XFL career before. Like I remember him coming there being like, oh yeah, he played XFL, this and that. I didn't realize that he'd already had an NFL career.",
    "timestamp" : "22:00-22:16"
  },
  {
    "text" : "Yeah, he he had uh he'd been around the game for a while. 'Cause he from he was already a journeyman. He played for Denver for two years. um the Rams and then the Giants, and then took what six years off to play for the XFL and the AFL, and then came back to the NFL because he was the XFL League MVP. the Steelers picked him up and now he was backing up Cordell Stewart. And then he came in and all he did was um I don't know which game it was, but it was one of his earlier games. He set the It was week 10 against the Falcons. He set the Steelers record for passing yards in a game with 473 in a game that the Steelers would go on to tie. 34-34. Which has to that's gotta be like the worst tie in NFL history. That's probably worse than like a a 3-3, like a shootout that ends in a tie. Just",
    "timestamp" : "22:17-23:15",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "23:15-23:18",
    "speaker" : "Steve",
    "text" : "That that feels like a blue ball sort of thing. Yeah, well come on."
  },
  {
    "text" : "Right. And then the week after, uh, against the Titans, he uh got hit as he was throwing it like tripped over somebody and apparently the hit left him briefly paralyzed and he was taken to the hospital on a stretcher",
    "timestamp" : "23:18-23:34",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh yeah. I remember that.",
    "timestamp" : "23:35-23:37",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Right. But then came back in time for the playoffs and the playoffs to the Ravens. No, sorry, to the uh the Titans actually went and lost to the Titans again. In a shootout 31-34. Lost in overtime. So he is one of the more fascinating stories that I had no idea about because The only reason I recognize the name Tommy Maddox is because I'm pretty sure I had his rookie card, his football card back in the day.",
    "timestamp" : "23:38-24:04",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "24:04-24:06",
    "speaker" : "Greg",
    "text" : "From 1992."
  },
  {
    "text" : "Yeah, yeah. We were collecting football cards back then. What was I nine? That was like peak football cards.",
    "timestamp" : "24:06-24:13",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "24:13-24:19",
    "speaker" : "Connor Ireland",
    "text" : "It uh wasn't Bragg just a a a twinkle in your father's eye in nineteen ninety two?"
  },
  {
    "text" : "I was three years old, four years old. That sounds about right.",
    "speaker" : "Greg",
    "timestamp" : "24:19-24:25"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yeah. I was five. I don't remember shit from nineteen ninety-two.",
    "timestamp" : "24:26-24:30"
  },
  {
    "timestamp" : "24:32-24:46",
    "speaker" : "Andy",
    "text" : "I was nine, I barely remember it, except for my Tommy Maddox UCLA uh rookie card. Apparently that would have been worth money now if I knew it was gonna be an XFL MVP. I would have kept it. But you know, easy come easy go."
  },
  {
    "text" : "The New Jersey Red Dogs is a pretty sick name. I wonder if that's related to the beer. Uh",
    "speaker" : "Greg",
    "timestamp" : "24:47-24:52"
  },
  {
    "speaker" : "Andy",
    "text" : "If it wasn't they missed uh a great opportunity.",
    "timestamp" : "24:53-24:56"
  },
  {
    "text" : "Oh yeah, dude. Talk about branding. That's what I mean. See like free giveaways at the game.",
    "speaker" : "Greg",
    "timestamp" : "24:56-25:01"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, all all the beers cost money except for red dogs. Yeah. But you can get as many as you want for free.",
    "timestamp" : "25:01-25:08"
  },
  {
    "timestamp" : "25:09-25:11",
    "speaker" : "Greg",
    "text" : "The mascots just shitface the whole time."
  },
  {
    "timestamp" : "25:14-25:19",
    "speaker" : "Andy",
    "text" : "He's got the t-shirt gun, but he's just shooting out cans of red dog. Apparently."
  },
  {
    "speaker" : "Greg",
    "text" : "There was another LA uh oh wait, LA Extreme is the XFL, right?",
    "timestamp" : "25:20-25:26"
  },
  {
    "text" : "Yes, yeah, yeah.",
    "speaker" : "Andy",
    "timestamp" : "25:26-25:27"
  },
  {
    "timestamp" : "25:28-25:29",
    "text" : "Did he have a nickname?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Tommy Maddox?",
    "timestamp" : "25:30-25:31"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "25:32-25:44",
    "text" : "Yeah, you remember nicknames on the back of their jerseys. Yeah, I mean He is pretty white, so he probably just went with Maddox."
  },
  {
    "text" : "He probably went with Tommy. That's the other thing. The guy is don't go by Tommy. Like you're la if you're a grown man, you Like Andy? I'm Andrew, thank you very much. How dare you call me Andrew? It's reserved for my mother.",
    "speaker" : "Andy",
    "timestamp" : "25:44-26:00"
  },
  {
    "text" : "Stop it. Greg don't",
    "timestamp" : "26:00-26:03",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Greg",
    "text" : "What about Gregory? It ends in a while. That's pretty terrible. That's what I mean.",
    "timestamp" : "26:05-26:09"
  },
  {
    "timestamp" : "26:10-26:12",
    "text" : "Bad parenting is what that is.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:12-26:14",
    "speaker" : "Greg",
    "text" : "Thomas Alfred Maddox."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:15-26:50",
    "text" : "And he goes like that. That's the whitest human ever. Go by Tom, but Alfred though. Alfred. Tommy. You sure he's gone by TA Maddox That would be a TA, yeah. TA Maddox. Sounds like he's a fucking writer of short stories. But luckily we didn't have to we didn't have to see TA Maddox playing this game. It was all Cordell. And uh he was he was generous, I thought. Uh even starting from his first drive, he threw an interception by our old friend Terrell Buckley. Who was one of my favorites back in the day?"
  },
  {
    "timestamp" : "26:50-26:56",
    "text" : "Before we get too far, should we talk about the banner raising, the opening ceremony, it's Gillette's first game?",
    "speaker" : "Greg"
  },
  {
    "text" : "I have I yes, I have notes about about that. Well, let's hear. Uh well, I I don't wanna go I mean, uh and l did everyone get to watch any of it like the do do you guys see the Dennis Hopper opener?",
    "timestamp" : "26:57-27:11",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Yeah, dude, what was that?",
    "speaker" : "Greg",
    "timestamp" : "27:12-27:14"
  },
  {
    "text" : "Yeah, it run us through that.",
    "timestamp" : "27:15-27:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "So Dennis Hopper, you know, I think w you know, like usual, it was the first game of the NFL season. Um I think there was the first televised game of or was that is right? Wasn't that wasn't that the first televised game of that season?",
    "timestamp" : "27:18-27:33"
  },
  {
    "text" : "No, it was a Sunday night game, so it was the first Sunday night game.",
    "speaker" : "Andy",
    "timestamp" : "27:33-27:36"
  },
  {
    "text" : "Yep, prime time game, yeah.",
    "speaker" : "Greg",
    "timestamp" : "27:36-27:37"
  },
  {
    "text" : "It was a Monday night it was it was a Monday night. Oh, Monday night, sorry, yeah, yeah. Got it. Yeah. Yeah, it was it was a Monday n Game, um And Dennis Hopper is just like, you know, recapping the Patriots miracle season from the year before, talking about the young kid Tom Brady. And then he gets into the snowball game with the tuck fool and he like is dressed like the an abominable snowman with like white paper confetti f fake snow like f it was the corniest it was the corniest thing I've ever seen And I thought that was gonna be the thing that the thing that pissed me off the most, but no. Uh Nick Nick Carter from the Backstreet Boys being on the shoulder. To sing the national anthem for the fucking banner raising night for the Patriots pissed me off so bad. Nick Carter, I was disgusted. And I loved it, I loved It's like I liked the Backstreet Boys kind of, but I was yeah, I was just appalled seeing that.",
    "timestamp" : "27:37-28:45",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "It was an odd choice. But they also coming back from commercial on one of the Like the the coming back into it things. Um they had a nickelback song on too. I think it was Nickelback.",
    "timestamp" : "28:45-28:58"
  },
  {
    "text" : "Maybe getting Nick Maybe getting Nick Carter to sing the national anthem in two thousand and two is like a huge deal and I just don't realize it, but",
    "timestamp" : "28:59-29:10",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "29:12-29:16",
    "text" : "Is he even from around here, Nick Carter? Is he a local boy?",
    "speaker" : "Andy"
  },
  {
    "text" : "Okay, Nick Carter.",
    "speaker" : "Greg",
    "timestamp" : "29:16-29:18"
  },
  {
    "text" : "I feel like you'd want somebody who's like from around here.",
    "speaker" : "Andy",
    "timestamp" : "29:18-29:21"
  },
  {
    "timestamp" : "29:22-30:05",
    "speaker" : "Greg",
    "text" : "No, he's for the game. Well, I mean it's nationally televised game. The the Boston Globe is pretty pissed off about it too. Jeff Jeff Wagenheim, one of his best sim worst was um uh a backstreet boy singing in quotations the anthem. And then in parentheses, wasn't it past bedtime for teeny boppers? Oh shit. Oh That's old man yells at crowd. I mean I I I'm gonna throw Connor in that category too. I mean it's a song. We can't have like a singer sing a song before a game. What's wrong with that?"
  },
  {
    "timestamp" : "30:06-30:35",
    "speaker" : "Connor Ireland",
    "text" : "I y y I don't know if I uh you would just think that they could find someone more impressive. Oh, like Beethoven or something? Beethoven? I don't I don't know. It just again, it is old man that yells at Cloud. I I was watching the game fucking eighteen years later today and I was just like, what is this?"
  },
  {
    "speaker" : "Steve",
    "text" : "I can see both sides of it. On one hand, I get you know Nick Carter, 2002, pretty fucking famous.",
    "timestamp" : "30:36-30:44"
  },
  {
    "text" : "Yep. Probably. That's probably the highest.",
    "timestamp" : "30:45-30:46",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "30:46-31:00",
    "speaker" : "Steve",
    "text" : "But the flip side is you're having this guy with frosted tips. That also matched Lonnie Paxton's newly five minutes. And like, is that really the tone you want to be setting with your football team for the season?"
  },
  {
    "speaker" : "Andy",
    "text" : "And John Madden was all about giving Lonnie Paxon shit for what happened to his hair. It's like look like something fell into his hair.",
    "timestamp" : "31:00-31:06"
  },
  {
    "speaker" : "Steve",
    "text" : "It was ridiculous.",
    "timestamp" : "31:06-31:08"
  },
  {
    "text" : "Uh we should probably talk about John Madden too, because this was his First game on was it ABC?",
    "timestamp" : "31:09-31:16",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And his first game with Al, right?",
    "timestamp" : "31:17-31:18"
  },
  {
    "text" : "Doing Al Michaels, yeah.",
    "speaker" : "Andy",
    "timestamp" : "31:18-31:20"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "31:20-31:20"
  },
  {
    "speaker" : "Andy",
    "text" : "And that was uh It wasn't bad.",
    "timestamp" : "31:21-31:23"
  },
  {
    "timestamp" : "31:24-31:31",
    "text" : "It was the first time since 1979 that he had there wasn't an NFC team involved in the game he was calling.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "31:32-31:37",
    "speaker" : "Andy",
    "text" : "Holy shit. Wow. Yeah. That's a long ass time. Yeah, because all it he used to be on Fox and they only did MC."
  },
  {
    "text" : "Exactly. So He did have one mess up. Well, one of many. It was uh at the beginning of the second quarter, he's like replaying a screen and there's three defenders on the screen, and he's like, this guy right here, and he circles the wrong one.",
    "speaker" : "Steve",
    "timestamp" : "31:38-31:54"
  },
  {
    "timestamp" : "31:54-31:55",
    "text" : "And then circles two of them, yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Circles the other guy, so you only end up not circling the guy you're supposed to watch.",
    "timestamp" : "31:56-32:01"
  },
  {
    "timestamp" : "32:01-32:44",
    "text" : "Yeah. Yeah. And then there was the play uh where they were replaying uh Troy Brown's toe tap catch And it was going to replay and first they called it a a catch, so Bill Cower tried to challenge it. And then they overruled it and called it incomplete, so Belichick challenged it. And Madden seemed to think it was blatantly not a catch, so he decided to go on a tangent while they kept replaying that it was obviously a catch and it was gonna get overturned and ruled a catch. And it took him a good five minutes like of a couple of different stories before somebody must have tapped him on the shoulder and be like, hey, by the way, you should probably talk about this because it's it's gonna be a catch. He's like, oh, oh actually look at this. Are you guys seeing what I'm seeing?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:47-32:54",
    "text" : "Jeff Wagenheim from Boston Globe had a comment on that as well. He seems to have some opinions."
  },
  {
    "text" : "Let's hear it.",
    "timestamp" : "32:54-32:54",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Apparently the ref said that Brown drug his other foot inbounds rather than dragged. So Jeff said that that was the the worst drug test of the game.",
    "timestamp" : "32:54-33:05"
  },
  {
    "text" : "Oh Jeff. Oh my god. Jeff This guy's like Greg Easterboard.",
    "speaker" : "Andy",
    "timestamp" : "33:06-33:11"
  },
  {
    "timestamp" : "33:14-33:18",
    "text" : "Typical Jeff Wagenheim, am I right?",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "33:21-33:44",
    "speaker" : "Andy",
    "text" : "Is I I wonder if he's still doing his thing. No, it doesn't seem racist enough. Jeff Wagenheim. There's a Jeff Wagenheim on Twitter. He doesn't know how to use it. When you come to a fork in the road, take it. Yeah, that's that's his quote is by Yogi Bea, I assume. Oh man."
  },
  {
    "speaker" : "Greg",
    "text" : "What's your favorite Yogi Bear quote?",
    "timestamp" : "33:45-33:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Nobody goes there anymore. It's too crowded.",
    "timestamp" : "33:47-33:48"
  },
  {
    "text" : "Yeah, that's my favorite too.",
    "timestamp" : "33:49-33:50",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "33:51-33:53",
    "speaker" : "Steve",
    "text" : "No, it gets laid out there early."
  },
  {
    "timestamp" : "33:53-34:06",
    "speaker" : "Andy",
    "text" : "That's a good one too. But speaking of early, um if we're talking about the crowd in this game, there was a a thing in the Boston Globe about how great the f traffic flow was."
  },
  {
    "text" : "Yeah, fucking right.",
    "speaker" : "Greg",
    "timestamp" : "34:07-34:08"
  },
  {
    "text" : "No, and exactly because and they their their only praise was that they were planning on opening the uh the stadium an extra hour early at 4 p. m. for this what nine o'clock game. Is that what time it started? It started at nine o'clock. Um, but because people had arrived so early, the traffic was starting back up, so they opened it at 3. 30. Just so they could let everybody in early enough to get super fucking drunk. And they they felt drunk to me. Well they haven't gone to a few games over the years. Like this this crowd was fucking rowdy. They started a Madden chant at the end. Like at him.",
    "timestamp" : "34:09-34:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Monday night football, you just come off a Super Bowl raising a banner, brand new stadium. Hell yeah.",
    "timestamp" : "34:47-34:53"
  },
  {
    "speaker" : "Steve",
    "text" : "First banner.",
    "timestamp" : "34:53-34:54"
  },
  {
    "timestamp" : "34:54-34:55",
    "text" : "Absolutely.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "34:55-35:00",
    "speaker" : "Andy",
    "text" : "Well, they didn't know that. It's like the first battle of Little Bighorn. They don't fucking know, do they?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, it could be the last one.",
    "timestamp" : "35:00-35:01"
  },
  {
    "text" : "Surprisingly they're they were underdogs, the Pats going in.",
    "timestamp" : "35:05-35:09",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, they were.",
    "speaker" : "Andy",
    "timestamp" : "35:10-35:10"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "35:11-35:13",
    "text" : "Three point dogs, which I found surprising."
  },
  {
    "text" : "For the s it was uh they showed us that it was the first time since eighty three that the Super Bowl champs were underdogs in their season opener.",
    "speaker" : "Andy",
    "timestamp" : "35:13-35:19"
  },
  {
    "timestamp" : "35:20-35:20",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "35:20-35:21",
    "speaker" : "Steve",
    "text" : "Shit stomped them."
  },
  {
    "text" : "Fuck bullshit. That'll teach you.",
    "timestamp" : "35:21-35:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:24-35:26",
    "text" : "Yeah, we should stay at say the final score. What was it?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:27-35:27",
    "text" : "Oh yeah."
  },
  {
    "timestamp" : "35:28-35:30",
    "speaker" : "Greg",
    "text" : "30 to 14 pass."
  },
  {
    "speaker" : "Andy",
    "text" : "Which we'll get to. And it wasn't even that close.",
    "timestamp" : "35:30-35:32"
  },
  {
    "speaker" : "Steve",
    "text" : "It wasn't even near that. It was way worse than that.",
    "timestamp" : "35:33-35:35"
  },
  {
    "timestamp" : "35:35-35:38",
    "speaker" : "Andy",
    "text" : "It was thirty to seven, really. But we'll get to that."
  },
  {
    "text" : "This is officially Gillette by this point, right?",
    "timestamp" : "35:41-35:43",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yes. Yeah, it was no longer we don't know what happened. Like nobody ever said what happened from uh CMGI field. to Gillette, but they announce it as Gillette Field.",
    "timestamp" : "35:43-35:53"
  },
  {
    "timestamp" : "35:53-35:57",
    "speaker" : "Greg",
    "text" : "Well I I I read an article in the Hartford Current about it."
  },
  {
    "speaker" : "Andy",
    "text" : "As you do.",
    "timestamp" : "35:58-35:59"
  },
  {
    "text" : "Yeah. See CMGI's stock. was like the hottest thing in the streets. Yeah. As um recently as January 2000, it was at $163 a share. And then by August two thousand happened. Yeah. Well, it was that and nine eleven, I guess.",
    "speaker" : "Greg",
    "timestamp" : "36:00-36:21"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh. But I think 9-11 kind of like the dot-com bubble happened and then 9-11 happened and just kind of like crushed any anything that was left of Right.",
    "timestamp" : "36:21-36:30"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "36:30-36:49",
    "text" : "They were really dependent on the stock market. So like when everything there was no money out there for them. Yeah. But it went from $163 a share to uh 40 cents a share in like a year and a half. Oh my god. So uh I think some people lost a shitload of money."
  },
  {
    "timestamp" : "36:51-36:57",
    "speaker" : "Andy",
    "text" : "God damn, that's brutal. Well that explains why I don't have the the rights to the naming of the stadium, I guess."
  },
  {
    "text" : "Yep.",
    "timestamp" : "36:58-36:58",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "36:59-37:00",
    "text" : "Do you take stock?",
    "speaker" : "Steve"
  },
  {
    "text" : "They were paying ten million dollars a year for the rights.",
    "timestamp" : "37:03-37:06",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "37:07-37:08",
    "text" : "That seems reasonable.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "37:09-37:10",
    "text" : "Yeah, this day and age.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:10-37:12",
    "text" : "Like from a business perspective, yeah."
  },
  {
    "timestamp" : "37:12-37:13",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "text" : "I wonder if you have to sign like a multi-year thing though. Like a half.",
    "speaker" : "Andy",
    "timestamp" : "37:14-37:17"
  },
  {
    "text" : "Yeah, it was 114 for 15 years. Wow, all right, yeah. But then the stadium itself only costs $325.",
    "speaker" : "Greg",
    "timestamp" : "37:17-37:25"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so you you're getting a good chunk of money back. I wonder if all that has to be paid up front.",
    "timestamp" : "37:27-37:31"
  },
  {
    "speaker" : "Steve",
    "text" : "Like isn't the new Raider Stadium like or the Ram Stadium a billion?",
    "timestamp" : "37:31-37:34"
  },
  {
    "timestamp" : "37:34-37:49",
    "text" : "Probably but I mean all that money is like all inflate and everything anyway nowadays. Yeah, it's fake money. At the time it was at the time it was a ridiculous amount of money to spend on a stadium. On top of the money that he spent on the the team itself. Right.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "37:52-37:55",
    "speaker" : "Connor Ireland",
    "text" : "What were you guys talking about? I had to uh feed my dog."
  },
  {
    "timestamp" : "38:00-38:01",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Sorry, sorry.",
    "timestamp" : "38:01-38:02"
  },
  {
    "speaker" : "Andy",
    "text" : "I hit it.",
    "timestamp" : "38:02-38:03"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "38:03-38:28",
    "text" : "I remember when it first when It wasn't a brag. I'm sorry. He was bitching. Anyways. You guys that open concept I when it first yeah, I do. I I don't know if it's still the allure from when I was younger and like the that big archway with the open concept seemed like it was pretty cutting edge. Not cutting edge, but like a a new"
  },
  {
    "text" : "Yeah, we're going on what eighteen years now of that thing being what it is. So for an eighteen year old stadium, I think.",
    "timestamp" : "38:32-38:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Like I like it because of like the memories I have there, but I I I don't think it has anything to do with like how the stadium's designed. To me, it's kind of like, man.",
    "timestamp" : "38:43-38:54"
  },
  {
    "speaker" : "Steve",
    "text" : "I think the stadium's fine. The whole experience with the Route 1 really hurts.",
    "timestamp" : "38:54-39:00"
  },
  {
    "text" : "Right. And you go to other stadiums around the country and you're like, this stadium is like way better like whole process of everything, you know.",
    "speaker" : "Greg",
    "timestamp" : "39:01-39:08"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:08-39:13",
    "text" : "Yeah, resgance games are great. In and out in no time."
  },
  {
    "speaker" : "Greg",
    "text" : "Heinz Fields is sweet. Or like Seattle State.",
    "timestamp" : "39:14-39:16"
  },
  {
    "text" : "Do you think it's because the Do you think it's because our tailgate is so blah that you walk into the stadium not feeling Inspired because af a after Bill's tailgate, I don't walk in the and I know it's a shithole. I don't walk in and I'm like, God, this place is a shithole. I'm all pumped because it was just like the best tailgate of my life. Whereas Gillette, everyone is just kinda like I don't know, maybe in two thousand one p or two thousand two people were had a little more pep in their step, but Going back in recent these past these past couple years, it's just people are just sitting around like we're the best. Like like I don't you know, oh maybe yeah Exactly.",
    "speaker" : "Connor Ireland",
    "timestamp" : "39:17-40:03"
  },
  {
    "timestamp" : "40:03-40:17",
    "speaker" : "Andy",
    "text" : "Well, I think even just watching I remember the feeling watching games back then compared to now. And I felt it again recently When Brady was suspended for the four first four games of whatever season that was, was it 2018?"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "And you would go into the game his first game back.",
    "timestamp" : "40:18-40:21"
  },
  {
    "timestamp" : "40:22-40:24",
    "text" : "No, no, th those first four games.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "40:26-40:27",
    "text" : "Oh, yeah, right, yeah.",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "And you go into them and it had a completely different feeling because I realized that over the years you'd go into the game expecting the Patriots to win. And now you have this this stress of them living up to your expectations. And if they didn't, you get all pissy. Well, I got all pissy. Um, because they're not playing like I know that they can sort of thing. Whereas when you had Jimmy G in there, it was like, hey, maybe they'll win this and maybe they won't, but at least it's exciting, let's find out. And I think That part of it I think is probably what's missing from Patriots tailgating these days.",
    "timestamp" : "40:27-40:59"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yeah, I mean you don't really even care I don't want to say you don't care about you don't really even care about the games until the playoffs this pa these past like yeah the wins the wins don't mean it's because there's no many of them.",
    "timestamp" : "41:01-41:13"
  },
  {
    "timestamp" : "41:14-41:15",
    "text" : "Just such a spot.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "41:15-41:21",
    "speaker" : "Connor Ireland",
    "text" : "I don't know when that started. I I would say probably from like the two thousand seven season on."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "41:21-41:22"
  },
  {
    "text" : "Right? I think when we were f w won those first three were still kind of spunky you know, spunky fan base, like we still have like you know, we're finally starting to see success with the socks. You know, we're like the miserable Boston fan It's just it was gr it was groomed in Red Sox misery. So we brought that like chip on we brought that chip on our shoulder. like over into football season and and with our Patriots fans. Um and then we just became like just cocky and didn't really get up for games probably.",
    "speaker" : "Connor Ireland",
    "timestamp" : "41:22-41:57"
  },
  {
    "timestamp" : "42:05-42:24",
    "text" : "elite at what he was doing. Like you said, in probably 2000, even maybe even 2006, he was dragging the team along with him. And so you just never felt like you're actually out of any game. And you kind of expected him to win it every time. So it came with this expectation of if they don't do it, you're disappointed in Tom Brady because he didn't do what he normally does, you know?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "42:24-42:29",
    "speaker" : "Greg",
    "text" : "Yeah, like I hope they win this game in like a unique way that I remember. Yeah, exactly."
  },
  {
    "timestamp" : "42:29-42:35",
    "speaker" : "Steve",
    "text" : "You know how many Lions and Browns and Bills fans you're pissing off right now?"
  },
  {
    "text" : "None because I don't even listen to the fucking Pages podcast.",
    "speaker" : "Andy",
    "timestamp" : "42:36-42:38"
  },
  {
    "text" : "Literally earlier today I had my Lions friend try to tell me he's talking himself into Matt Stafford as league MVP. Because it's odd to like six 6,000, you know, plus six thousand. He's like, yeah, man, it's actually not a bad bet. I was like, okay, let me let me know it's how.",
    "speaker" : "Steve",
    "timestamp" : "42:39-42:58"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "42:59-43:03",
    "text" : "Who are they throwing to? Like that doesn't even Jesus."
  },
  {
    "timestamp" : "43:05-43:07",
    "speaker" : "Andy",
    "text" : "He's getting Megatron out of retirement like Gronk did."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:08-43:14",
    "text" : "But like that's his the he's like, this is my cycle, you know? I'm at the point right now where like Shit, man, anything's possible."
  },
  {
    "timestamp" : "43:14-43:15",
    "speaker" : "Andy",
    "text" : "Exactly."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:15-43:22",
    "text" : "What's most possible that their like 25 year like playoff streak continues? Yeah."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "43:23-43:24"
  },
  {
    "text" : "I think that is. You you know what part of Gillette is really nice though is their drunk tank.",
    "timestamp" : "43:24-43:30",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:31-43:32",
    "text" : "Oh really?"
  },
  {
    "timestamp" : "43:32-43:32",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "43:33-43:34",
    "speaker" : "Andy",
    "text" : "Yeah, explain it to me."
  },
  {
    "timestamp" : "43:35-43:37",
    "speaker" : "Greg",
    "text" : "It's under the s well I actually don't know where it is."
  },
  {
    "timestamp" : "43:39-43:40",
    "text" : "Or you don't remember where it was.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:41-43:48",
    "speaker" : "Greg",
    "text" : "Correct. It's very cavernous though. So I thought it was under the stadium, but I'm not positive."
  },
  {
    "timestamp" : "43:49-43:50",
    "speaker" : "Andy",
    "text" : "So it's very roomy, is what you're saying?"
  },
  {
    "timestamp" : "43:50-43:52",
    "speaker" : "Greg",
    "text" : "Yeah, yeah. Yeah, yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:52-43:55",
    "text" : "All right. That's that's nice. Uh any any accoutrement?"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh I was in there with another kid. No. You didn't you didn't like me. Ye No, why's that? I don't know, don't remember.",
    "timestamp" : "43:56-44:04"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "44:06-44:07",
    "text" : "Was the game on?"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh I was banging on the window. I was like, tell me the score. And they were like, no.",
    "timestamp" : "44:08-44:12"
  },
  {
    "text" : "Oh Jesus Christ.",
    "timestamp" : "44:16-44:18",
    "speaker" : "Andy"
  },
  {
    "text" : "And then Kelly's mom.",
    "speaker" : "Greg",
    "timestamp" : "44:20-44:21"
  },
  {
    "text" : "You were with your in-laws?",
    "timestamp" : "44:23-44:25",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "44:25-44:26",
    "speaker" : "Greg",
    "text" : "That's correct."
  },
  {
    "timestamp" : "44:31-44:38",
    "speaker" : "Andy",
    "text" : "Oh can't these are early days too. God bless 'em. God. And they're still stuck around."
  },
  {
    "timestamp" : "44:39-44:49",
    "speaker" : "Connor Ireland",
    "text" : "Yep. I mean in in Gillette securities defense, you are insufferable."
  },
  {
    "timestamp" : "44:49-44:49",
    "speaker" : "Greg",
    "text" : "Yes."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Especially when he's blackout. Once once you get past that level, you are you are you're pretty insufferable. Um in terms of I mean I personally love it because it's usually directed at I mean, Bills fans, we go to Bills games together, so and that's always fun. Um, but you've certainly gotten some RV tires slashed uh due to your Oh yeah. Yep. That could have been rocks thrown at rocks thrown at us. Rocks thrown at us. Yeah.",
    "timestamp" : "44:49-45:24"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:24-45:31",
    "text" : "Greg had beer surrounded at you, didn't you? When you were sitting on top of the RV with the inflatable penis. Yeah, yeah."
  },
  {
    "timestamp" : "45:31-45:33",
    "text" : "Yeah, that's that's annual.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:33-45:34",
    "text" : "That's commonplace."
  },
  {
    "text" : "Yeah. Just like snow.",
    "speaker" : "Greg",
    "timestamp" : "45:34-45:36"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Dear Jesus. Are we we we gonna get into this game?",
    "timestamp" : "45:41-45:44"
  },
  {
    "timestamp" : "45:44-45:52",
    "speaker" : "Andy",
    "text" : "I I want to talk about it while we've been talking, um Cordell Stewart just do another interception. We could probably talk about that."
  },
  {
    "timestamp" : "45:53-45:57",
    "speaker" : "Connor Ireland",
    "text" : "So Yeah, I was gonna talk about you wanna talk about Cordell?"
  },
  {
    "text" : "Go ahead. You have the floor.",
    "speaker" : "Andy",
    "timestamp" : "45:57-46:00"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "46:00-46:19",
    "text" : "I was just gonna I I was just gonna say that with all the offseason talk about like, you know, is Tom Brady Was this just a fluke? Um, is Rohan Davy gonna, you know, upsettle you know take the starting job at some point and"
  },
  {
    "text" : "Yeah, a defense is gonna figure out Tom Brady and yeah.",
    "speaker" : "Andy",
    "timestamp" : "46:20-46:23"
  },
  {
    "text" : "Big Dick Tommy had himself a game. I mean I wanna it i he sixty seven percent completion percentage, uh a C hair under three hundred yards, no picks, three T Ds, just came out there and was just slanging.",
    "speaker" : "Connor Ireland",
    "timestamp" : "46:23-46:42"
  },
  {
    "timestamp" : "46:43-46:46",
    "text" : "Yeah. Obviously, you know our team to run the ball.",
    "speaker" : "Andy"
  },
  {
    "text" : "No. No. Our our defense, give granted, put us in great spots. All throughout the game. There's just a ton of turnovers. Um But what a statement from Tom, I I thought. A bunch of new faces too. I mean Deion Branch had a huge game. Six receptions to Cam Cleland. I mean, he was Throwing it all over the field.",
    "speaker" : "Connor Ireland",
    "timestamp" : "46:47-47:13"
  },
  {
    "timestamp" : "47:16-47:24",
    "speaker" : "Steve",
    "text" : "They started off poor because the first Steelers pick they turned into nothing. I think they went three and out. They did. They went to midfield. Yeah, they got a touchdown on."
  },
  {
    "text" : "I think that was the first ever points scored in the New Gillette Stadium. Christian Fourier. And then but even that drive was only because the SEALs kept committing penalties on third down, like defensive holding and jumping off sides and all sorts of bullshit.",
    "speaker" : "Andy",
    "timestamp" : "47:25-47:42"
  },
  {
    "speaker" : "Steve",
    "text" : "And then Steelers got some they got it going, right? They had that bullshit pass interference on Ty Law.",
    "timestamp" : "47:42-47:48"
  },
  {
    "timestamp" : "47:48-48:16",
    "text" : "Ty Law. Greg, it's a good job you didn't watch this game because Ty Law. This, I thought you were gonna actually join me on the dark side because the reason the the pass interference calls were getting called on Tylaw was because Heinz Ward was flopping all over the place. Anytime he wasn't gonna catch the ball, he just kind of like flopped over onto the ground and Tylaw kept getting called for pass interference. It happened twice, once in the end zone.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:16-48:24",
    "speaker" : "Connor Ireland",
    "text" : "Dude, he he he was the that's literally Heinz Ward's He was the best in the league at that. He was known for that."
  },
  {
    "text" : "So he was doing that and he's he's like starting fights after after turnovers and stuff and he's just like You know, he's obviously known for his his uh we'll call them generously his borderline blocks, his crackback blocks on people who he's injured and stuff. Just not a fan of him. Although to be fair. Oh yeah. And and in his defense, there's a lot of people looking to get their shots in on him. So even if he caught the ball winter ground, nobody like tagged him down. They fucking jumped on him like helmet first. And especially Laurie Malloy, who was just going in heavy literally every time he was even close to the ball. And you just like pop back up. He's like, Yeah, I get it. You know. Gave the guy a pat on the button and the next play.",
    "timestamp" : "48:25-49:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "49:14-49:22",
    "text" : "That was like elite Ty Law years too, and he still had a game. Yeah, he had like ten tackles. He had he had a back."
  },
  {
    "text" : "Heinz had that one touchdown on him. He got him pretty good. Law was lazy getting over on the defense on the motion and he beat him pretty clean.",
    "timestamp" : "49:23-49:31",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "49:31-49:32",
    "speaker" : "Andy",
    "text" : "Yep."
  },
  {
    "speaker" : "Steve",
    "text" : "But that PI on that first drive of the second half or second quarter, where they called two PIs on tie, both of them pretty bullshit. So Steelers get the ball first and goal from the one. This is in the end of",
    "timestamp" : "49:33-49:46"
  },
  {
    "text" : "And then they fall the fuck apart.",
    "speaker" : "Andy",
    "timestamp" : "49:46-49:48"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:48-50:13",
    "text" : "Well yeah, the reps called a false start, which was also bullshit, which wasn't there. Yeah, that was a bad call. And then like Chris Fumatu Maafala like had the ball knocked away from him by a lawyer or someone after the play. Gets a personal foul. So then they kick in a field goal. Then they have a false start. So then they miss their field goal. And then it cuts Cower's face. Oh baby. It was amazing. It was loving it."
  },
  {
    "text" : "It was like, yeah, it it was the Bill Cower face is up there, I think, with on the Pantheon of of annoyed faces. Yeah. Yeah, the Manning Brothers. Yeah. He's definitely like that kind of that. That jaw where his mouth almost becomes like non existent and it's all bottom chin.",
    "timestamp" : "50:13-50:31",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "50:31-50:34",
    "text" : "Yeah, it extends past his nose. It's ridiculous.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, it's it's fantastic, yeah. And that was that was peak because yeah they did. I I actually wrote this down because they they get a first down Um first like you said, first and goal from the one, and then uh they get backed up on penalties, and then they complete a pass on third down to. Fumatu Mafala.",
    "timestamp" : "50:34-50:53"
  },
  {
    "timestamp" : "50:53-50:55",
    "speaker" : "Greg",
    "text" : "One bad Mafala."
  },
  {
    "text" : "Exactly. So he gets tackled at the one or the two, right? So chip shot field goal, but then Lori Malloy does his bullshit like Because Fumato Mafala tries to reach it out, so he just like knocks it out of his hand. And so he gets up and like pushes Malloy in the chest and gets a 15-yard penalty. So now they kick in from the 15. Which still makeable field goal, but then they they do a false start, which moves them back another one even further back, and then they miss the field goal wide left.",
    "speaker" : "Andy",
    "timestamp" : "50:55-51:22"
  },
  {
    "text" : "Then the pages take the ball back down and hit the exact same field goal from Benateri.",
    "speaker" : "Steve",
    "timestamp" : "51:22-51:26"
  },
  {
    "timestamp" : "51:27-51:28",
    "text" : "Exactly. Yeah. Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:28-51:32",
    "speaker" : "Greg",
    "text" : "Jeff Jeff Wagenheim said that that was the uh best bus stop."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:38-52:11",
    "text" : "There was a lot of bus stops in this. I don't know if that's the best one. There was one that I think it was um Willie McGinnist. just came off the edge in the bus tried to do he was like it wasn't even a sweep it was just like out uh off tackle sort of thing and just ran him over like he was It was like uh us playing football back in the day where I was like a foot taller than all of you and I could just tackle you at will in like whatever angle. It didn't matter if you had the uh the uh momentum or anything, like you just hit me and you just fall over and it looked just like that."
  },
  {
    "speaker" : "Greg",
    "text" : "I don't remember this at all. I don't remember that either.",
    "timestamp" : "52:12-52:14"
  },
  {
    "speaker" : "Andy",
    "text" : "Of course you don't. It's all the concussions I gave you.",
    "timestamp" : "52:14-52:17"
  },
  {
    "timestamp" : "52:21-52:32",
    "speaker" : "Steve",
    "text" : "So Pets open up half two with a Donald Hayes touchdown. It was actually a really nice Turn after you get the ball and a awesome block by Dion."
  },
  {
    "text" : "Dahl Hayes, who we saw uh at the end of last season, regular season, playing for the Panthers. And he's the one that had a couple of footballs come off his hands that were returned for touchdowns.",
    "timestamp" : "52:33-52:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "52:46-52:50",
    "text" : "And they were like, I like what I see there. Let's sign this guy. Exactly.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I was like, what are like the skill position players that we've got in that haven't caught a touchdown? Because we all know that list of Brady touchdown passes.",
    "timestamp" : "52:53-53:02"
  },
  {
    "timestamp" : "53:02-53:03",
    "speaker" : "Andy",
    "text" : "Yeah, it's on the road."
  },
  {
    "speaker" : "Steve",
    "text" : "Donald Hayes and Cam Cleeland are on it. Like, who couldn't crack that group? I couldn't find a people who played more than eight games of Brady and still couldn't catch a T D.",
    "timestamp" : "53:03-53:13"
  },
  {
    "timestamp" : "53:14-53:22",
    "speaker" : "Andy",
    "text" : "Uh well actually let's do it. You know is a weird one? Steven Ridley. That's true, yeah. He never caught a Tom Brady touchdown pass."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "53:23-53:23",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "He didn't really catch the ball too much though.",
    "timestamp" : "53:23-53:25"
  },
  {
    "text" : "Still, I mean you gotta think. I mean like four years as a starting tailbag, you get one in there at some point.",
    "speaker" : "Greg",
    "timestamp" : "53:25-53:31"
  },
  {
    "text" : "You would think.",
    "timestamp" : "53:31-53:32",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "53:32-53:34",
    "speaker" : "Greg",
    "text" : "It's off a screen or something."
  },
  {
    "timestamp" : "53:34-53:42",
    "speaker" : "Andy",
    "text" : "Yeah. So you can you guys name the top five um receivers in terms of touchdowns?"
  },
  {
    "speaker" : "Greg",
    "text" : "Branch, welker.",
    "timestamp" : "53:42-53:43"
  },
  {
    "text" : "Gronk, Moss, Welker so far.",
    "speaker" : "Andy",
    "timestamp" : "53:43-53:46"
  },
  {
    "speaker" : "Greg",
    "text" : "Branch. Edelman. Edelman.",
    "timestamp" : "53:47-53:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh yeah. So it's Gronk, Edelman, Moss, Welker, James White.",
    "timestamp" : "53:49-53:53"
  },
  {
    "speaker" : "Greg",
    "text" : "See? Told ya.",
    "timestamp" : "53:54-53:56"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:58-54:02",
    "text" : "And then Dion Branch is sixth. Number seven."
  },
  {
    "timestamp" : "54:03-54:10",
    "speaker" : "Greg",
    "text" : "Theoretical question for Connor. Who's a bigger Patriot? David Patton or Branch, right?"
  },
  {
    "text" : "Who was what?",
    "speaker" : "Connor Ireland",
    "timestamp" : "54:11-54:11"
  },
  {
    "timestamp" : "54:12-54:16",
    "speaker" : "Greg",
    "text" : "Who is like more legendary Patriots player? Branch or patent."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Oh god. I the o the only huge branch uh I remember more legendary David Patton catches. The one in the back of the end zone, was that the one from Drew Bledsoe?",
    "timestamp" : "54:18-54:32"
  },
  {
    "timestamp" : "54:32-54:32",
    "speaker" : "Andy",
    "text" : "Mm-hmm."
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "54:33-54:36",
    "text" : "In the back of the end zone when Drew had to step in. All right."
  },
  {
    "speaker" : "Andy",
    "text" : "Then it did it again in the Super Bowl.",
    "timestamp" : "54:36-54:37"
  },
  {
    "text" : "I remember more legendary catches probably for in those um Especially the first in well, Branch wasn't there. Two thousand one David Patton had a bunch of catches throughout the playoffs.",
    "timestamp" : "54:44-54:56",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "54:56-54:57",
    "speaker" : "Greg",
    "text" : "Yeah, and Snowball."
  },
  {
    "timestamp" : "54:57-55:06",
    "text" : "I think Branch Yeah. Yep. Branch was better. Patton I don't know, h sticks out more in terms of catches.",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Yeah, that was our analysis too.",
    "timestamp" : "55:06-55:08",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I think it was Patton had the the more memorable catches. Because he also had that game where he ran past Passed and caught a touchdown too.",
    "timestamp" : "55:08-55:17"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but Dion's best receiver we've ever drafted and developed.",
    "timestamp" : "55:17-55:22"
  },
  {
    "speaker" : "Andy",
    "text" : "Ooh.",
    "timestamp" : "55:22-55:23"
  },
  {
    "speaker" : "Greg",
    "text" : "There's a hot take.",
    "timestamp" : "55:24-55:25"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean it's Himmer Edelman, right? Yeah.",
    "timestamp" : "55:25-55:31"
  },
  {
    "timestamp" : "55:31-55:36",
    "speaker" : "Steve",
    "text" : "Oh it's probably Adam. Either way, they're like 1A, 1B, right?"
  },
  {
    "text" : "Oh James White.",
    "timestamp" : "55:37-55:38",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, yeah. You can put him on there. He's fifth on this team in touchdown catches in the Brady era.",
    "timestamp" : "55:39-55:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:47-55:48",
    "text" : "Jimmy Blanco."
  },
  {
    "text" : "That's fascinating though.",
    "speaker" : "Andy",
    "timestamp" : "55:51-55:52"
  },
  {
    "timestamp" : "55:52-55:57",
    "speaker" : "Greg",
    "text" : "Yo, he's gonna move to wide receiver this year. I'm calling it right now. Interesting. Where though?"
  },
  {
    "timestamp" : "55:57-55:59",
    "text" : "Were you gonna put him in the slot?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:59-56:01",
    "text" : "Yeah, they play them they play them all wide receiver all the time."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:01-56:06",
    "text" : "Anyways, so they might as well They play everybody a wide receiver though."
  },
  {
    "text" : "Yeah, exactly.",
    "timestamp" : "56:06-56:07",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "56:08-56:16",
    "speaker" : "Andy",
    "text" : "I mean the Patriots aren't uh afraid to throw a tight end out there. Uh not a tight end, a uh a fullback out there. Yep. All the way back to the Mark Edward days."
  },
  {
    "speaker" : "Greg",
    "text" : "Trust me, I've done the film review.",
    "timestamp" : "56:18-56:19"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:21-56:22",
    "text" : "I don't trust that."
  },
  {
    "text" : "We have uh we have like a top three tight uh fullback this year. Uh uh Danny Vital is can catch uh yeah he's what do you think I was reading I was reading some articles Oh boy.",
    "timestamp" : "56:23-56:39",
    "speaker" : "Connor Ireland"
  },
  {
    "timestamp" : "56:42-56:43",
    "speaker" : "Greg",
    "text" : "Justin Rohrwasser?"
  },
  {
    "timestamp" : "56:45-57:11",
    "text" : "Yeah, I guess he can I I guess he can kick at a country mile. Um I don't know. I think it was one of those classic like he knew exactly what tattoo it was and was just coasting until It came up post-draft and now he's crying on social media saying he's getting it covered up. It's a classic the t story as old as time.",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "He failed all this time. His name translates to Justin Pipe Water.",
    "timestamp" : "57:12-57:17",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it does.",
    "timestamp" : "57:17-57:18"
  },
  {
    "speaker" : "Greg",
    "text" : "So they passed on Rodrigo blank and ship for fucking tap water.",
    "timestamp" : "57:21-57:25"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yeah.",
    "timestamp" : "57:28-57:28"
  },
  {
    "text" : "I just I can't believe I wanted hot I wanted Hot Rod so bad. That would have been great, yeah. He's just a fucking legend. Those glasses, man.",
    "timestamp" : "57:29-57:38",
    "speaker" : "Greg"
  },
  {
    "text" : "The kid from Georgia?",
    "speaker" : "Connor Ireland",
    "timestamp" : "57:38-57:40"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, with the with the rec specs.",
    "timestamp" : "57:40-57:42"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "57:42-57:44",
    "text" : "Yeah. Yeah. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "And he's like a rapper. He like hangs out with all the Oh god, really? Yeah, yeah. Yeah. He's awesome. And his name's Rodrigo Blank and shit. Like, fucking come on, dude. As a kicker, you gotta you have to sign that guy.",
    "timestamp" : "57:45-58:02"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yeah. Yeah, the Colts got him, right? Yeah.",
    "timestamp" : "58:02-58:05"
  },
  {
    "text" : "Oh, did they? Yeah, he went undrafted and they signed him.",
    "speaker" : "Greg",
    "timestamp" : "58:06-58:08"
  },
  {
    "text" : "Oh no shit. Well, all right. Speaking of kickers though. Connor's boy Adam Benateri uh had himself uh some kickoff problems in this game.",
    "timestamp" : "58:09-58:19",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:20-58:20",
    "speaker" : "Greg",
    "text" : "Uh oh."
  },
  {
    "text" : "Yeah. Decided to uh R uh right at the end of the third quarter, kick it out of bounds on the kickoff.",
    "timestamp" : "58:21-58:27",
    "speaker" : "Andy"
  },
  {
    "text" : "What a fucking idiot. Time to time to hit the panic button? What do you think?",
    "timestamp" : "58:27-58:32",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "I think so. Yeah, I think we should probably cut him and draft uh Draft a uh kicker in the third round.",
    "timestamp" : "58:32-58:38"
  },
  {
    "speaker" : "Greg",
    "text" : "Maybe someone more accurate.",
    "timestamp" : "58:38-58:39"
  },
  {
    "text" : "Yeah, preferably somebody more accurate would be good.",
    "timestamp" : "58:40-58:41",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:42-59:31",
    "text" : "Yeah. But we'll see. Statistically speaking. So well Connor, to this up to you. I wanted to bring this up to you because just to to hammer my point of like you just you have selective memory. We were watching the AFC championship game from last year against these Steelers, right? The Pat the Patriots are up seven and they're driving with like, I don't know what, two minutes left, something like that. Yep. And they get a 45 yard field goal to basically win the game. It's gonna make a ten point game. Pushed it. Gave the Steelers another chance. Steels throw an interception, but if the Steelers go down and score there, that's a whole different there's a whole different perception on what Adam Vinateri's career is It was real, yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "Okay. That's a sulda coulda woulda. It was the only it was the only field goal he missed. Um like I said, I from week fourteen on. Yep. But guess what? We won the game, so no one remembers it. You remember every fucking Gustavo.",
    "timestamp" : "59:32-59:49",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "59:54-59:57",
    "text" : "It only matters when like people remember it."
  },
  {
    "text" : "When your team loses.",
    "timestamp" : "59:58-59:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yes. Oh my gee.",
    "timestamp" : "59:59-01:00:02"
  },
  {
    "timestamp" : "01:00:07-01:00:10",
    "speaker" : "Steve",
    "text" : "Alright, I have the answer to my question."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:10-01:00:13",
    "text" : "He had one of the What was your question?"
  },
  {
    "speaker" : "Steve",
    "text" : "Which Which player has like the most catches but no touchdowns from Tom Brady?",
    "timestamp" : "01:00:13-01:00:18"
  },
  {
    "text" : "Oh, okay. Ooh. What era? Like what you think we can guess it?",
    "speaker" : "Andy",
    "timestamp" : "01:00:18-01:00:22"
  },
  {
    "timestamp" : "01:00:22-01:00:28",
    "speaker" : "Steve",
    "text" : "Uh maybe, probably not. Played 2007 to 2010, 47 games."
  },
  {
    "timestamp" : "01:00:28-01:00:30",
    "speaker" : "Andy",
    "text" : "What position did he play?"
  },
  {
    "timestamp" : "01:00:30-01:00:31",
    "text" : "Running back.",
    "speaker" : "Steve"
  },
  {
    "text" : "Ben Jarvis Green Ellis.",
    "speaker" : "Andy",
    "timestamp" : "01:00:32-01:00:34"
  },
  {
    "timestamp" : "01:00:34-01:00:45",
    "speaker" : "Steve",
    "text" : "No, he's on here though. He did not catch one. Ben Jarvis had fo 26 catches. Let's see. This guy had 49."
  },
  {
    "timestamp" : "01:00:45-01:00:49",
    "speaker" : "Andy",
    "text" : "49 catches and no touchdowns. From the running back spot?"
  },
  {
    "text" : "Not Woodhead, right? Nope. No, he scores. Legarrett blend? No. McGarrett must have one. He's not on the list.",
    "speaker" : "Steve",
    "timestamp" : "01:00:49-01:00:58"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:58-01:01:01",
    "text" : "Damn. Yeah, I think he does actually."
  },
  {
    "speaker" : "Steve",
    "text" : "Ridley for reference had twenty-three catches.",
    "timestamp" : "01:01:02-01:01:05"
  },
  {
    "text" : "Wow, double that almost?",
    "timestamp" : "01:01:06-01:01:08",
    "speaker" : "Andy"
  },
  {
    "text" : "Fucking hell. Ridley has the most games, 52 games. That makes sense.",
    "timestamp" : "01:01:08-01:01:12",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "49 catches.",
    "timestamp" : "01:01:14-01:01:15"
  },
  {
    "text" : "No, no, no. I no, don't tell us just yet. That's needs more time to Google. No no give some mince. Sam Sammy Morse.",
    "timestamp" : "01:01:15-01:01:26",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Connor got it, yeah. Sammy Morse.",
    "timestamp" : "01:01:27-01:01:29",
    "speaker" : "Steve"
  },
  {
    "text" : "Damn. Dude. Google really is a fucking wonder. Just give me two more seconds.",
    "timestamp" : "01:01:29-01:01:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I thought I heard Alexa in the background.",
    "timestamp" : "01:01:37-01:01:39"
  },
  {
    "text" : "Okay, well the Well there was a b there was other running backs to choose from on there besides Timmy Morris. Wow. Yeah. I almost asked if you were going f like if you were being coy and it was like actually a fullback, but you called him a running back. just to throw us off. 'Cause I almost said Heath Evans, but that would have been a lie. I think he's caught one. James Devlin never did.",
    "timestamp" : "01:01:39-01:02:02",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "He did, but it was in the playoffs.",
    "timestamp" : "01:02:03-01:02:04"
  },
  {
    "text" : "James Devon's Res he has one.",
    "speaker" : "Steve",
    "timestamp" : "01:02:04-01:02:07"
  },
  {
    "text" : "It was a g it was in one of those bloats against the uh Yeah, this is just regular season. Like Aaron Blunt only has one though against the Coast. Yeah, of course.",
    "timestamp" : "01:02:07-01:02:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Jacoby Myers is on this list.",
    "timestamp" : "01:02:14-01:02:16"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:02:16-01:02:19",
    "text" : "Jacoby Myers. Well, yeah, okay."
  },
  {
    "timestamp" : "01:02:19-01:02:22",
    "speaker" : "Steve",
    "text" : "I mean that's Devlin, Sony Michelle."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep.",
    "timestamp" : "01:02:24-01:02:24"
  },
  {
    "speaker" : "Steve",
    "text" : "There's really not a lot.",
    "timestamp" : "01:02:25-01:02:26"
  },
  {
    "text" : "A lot of people that have one though.",
    "timestamp" : "01:02:28-01:02:29",
    "speaker" : "Greg"
  },
  {
    "text" : "Hollister, 23 games.",
    "timestamp" : "01:02:30-01:02:32",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:02:32-01:02:36",
    "speaker" : "Greg",
    "text" : "Antonio Brown. He's got one. Missed a big chest himself."
  },
  {
    "timestamp" : "01:02:37-01:02:40",
    "speaker" : "Andy",
    "text" : "He's got as many touchdowns as Matt Mulligan does. I miss him."
  },
  {
    "speaker" : "Greg",
    "text" : "I miss him too.",
    "timestamp" : "01:02:42-01:02:43"
  },
  {
    "text" : "I wish he was still Antonio Brown. This would have been a whole different season if we had had Antonio Brown. Yep Could could have masked a lot. I mean, not it it we probably had what the worst production from the tight end position in in the history, maybe in league history this year.",
    "timestamp" : "01:02:43-01:03:03",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh one patriots will probably argue. They probably give that a run for their money.",
    "timestamp" : "01:03:04-01:03:10"
  },
  {
    "speaker" : "Steve",
    "text" : "We just determined Cam Cleveland was worse.",
    "timestamp" : "01:03:11-01:03:14"
  },
  {
    "speaker" : "Andy",
    "text" : "But he wasn't the starter though. He was uh Daniel Graham who for all intents and purposes looks like a fucking wagon. Yeah. I don't know how he didn't work out because that that's a big man who moves quick.",
    "timestamp" : "01:03:15-01:03:27"
  },
  {
    "timestamp" : "01:03:27-01:03:30",
    "speaker" : "Steve",
    "text" : "He played it while while in the league. Yeah, he didn't not work out."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:31-01:03:46",
    "text" : "I mean he wasn't the Gronkowski that he looks like he should be. So it looks like he has that same like speed and and smoothness to his route running and stuff, but played ten years. Yeah. Did he play where'd he go to the Saints?"
  },
  {
    "speaker" : "Steve",
    "text" : "Denver.",
    "timestamp" : "01:03:47-01:03:48"
  },
  {
    "speaker" : "Andy",
    "text" : "Watson went to the Saints.",
    "timestamp" : "01:03:48-01:03:49"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Watson could have he was a specimen coming out of college. He was uh I thought he was gonna be I thought he was gonna be dominant when I remember when we f I think it was what, two thousand four when we drafted Watson. I thought he was going to be dominant. He was so fast. He was kinda like He's the one that ran down champion before Vernon did yeah, he did run de that was an im that was an incredible play. That's an all time. I'll never forget that play.",
    "timestamp" : "01:03:58-01:04:25"
  },
  {
    "text" : "Yeah, no, it's super underrated. So speaking of underrated, should we talk about this uh fourth quarter? This fourth quarter is not underrated, by the way. It's uh overrated. Cause at this point it's 30 to 7 Patriots and the Steelers have given up literally.",
    "speaker" : "Andy",
    "timestamp" : "01:04:25-01:04:38"
  },
  {
    "timestamp" : "01:04:38-01:04:41",
    "speaker" : "Steve",
    "text" : "What? This has my best play in this."
  },
  {
    "speaker" : "Andy",
    "text" : "Does it?",
    "timestamp" : "01:04:41-01:04:42"
  },
  {
    "text" : "Yes.",
    "timestamp" : "01:04:42-01:04:43",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:04:43-01:04:47",
    "speaker" : "Andy",
    "text" : "Okay. Um let's hear it."
  },
  {
    "text" : "It actually didn't count. Well went down.",
    "speaker" : "Steve",
    "timestamp" : "01:04:48-01:04:51"
  },
  {
    "text" : "This is gonna be my best actually.",
    "timestamp" : "01:04:52-01:04:53",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:04:54-01:04:56",
    "speaker" : "Connor Ireland",
    "text" : "My boy. Roman Pfeiffer?"
  },
  {
    "text" : "No, it was Willie. Oh no, the other one, Willie McGuinness.",
    "speaker" : "Andy",
    "timestamp" : "01:04:56-01:04:59"
  },
  {
    "text" : "Oh Willie.",
    "timestamp" : "01:04:59-01:05:00",
    "speaker" : "Connor Ireland"
  },
  {
    "text" : "Just being a grown ass man and wrecking plays.",
    "timestamp" : "01:05:00-01:05:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Bodies, Cordell Stewart.",
    "timestamp" : "01:05:03-01:05:05"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Cordell Stewart rolls out and uh decides to pump fake. Uh to give himself some more time and William McGinnis just doesn't take that bait and just lights him the fuck up.",
    "timestamp" : "01:05:05-01:05:15"
  },
  {
    "timestamp" : "01:05:15-01:05:27",
    "speaker" : "Steve",
    "text" : "Perfectly clean tackle. And like in review, it wasn't a fumble, right? Cordell kind of held it until He met the ground. Yeah. So it looked like a fumble in real time and"
  },
  {
    "timestamp" : "01:05:29-01:05:32",
    "speaker" : "Connor Ireland",
    "text" : "So Roman Pfeiffer returned it to the house, right? Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:33-01:05:54",
    "text" : "Yeah, yeah, yeah, yeah. But if you watch the replay of that, um Willie McGuinness gets up to go to recover the fumble. And I think realizes that Pfeiffer probably has the better angle. So he peels off and blocks whoever the running back or the whoever the stealer is running after him. Yeah. And that's what sprung him for the touchdown, but like you said, it it got overturned."
  },
  {
    "timestamp" : "01:05:54-01:05:57",
    "speaker" : "Steve",
    "text" : "It was he absolutely bodied him."
  },
  {
    "timestamp" : "01:05:57-01:06:00",
    "speaker" : "Andy",
    "text" : "It was that that was Peak Willie McGuinness."
  },
  {
    "text" : "It ended up what 38 we scored. We should add another six-seven on top of that. Yeah, yeah, yeah.",
    "timestamp" : "01:06:00-01:06:06",
    "speaker" : "Steve"
  },
  {
    "text" : "But uh yeah, that it did also set up a third and thirty-four, which the uh Steelers couldn't Convert after that.",
    "speaker" : "Andy",
    "timestamp" : "01:06:07-01:06:14"
  },
  {
    "speaker" : "Greg",
    "text" : "Roman Cypher was so good.",
    "timestamp" : "01:06:15-01:06:17"
  },
  {
    "timestamp" : "01:06:17-01:06:19",
    "speaker" : "Andy",
    "text" : "Oh yeah. Underrated for sure."
  },
  {
    "speaker" : "Greg",
    "text" : "Great name too. For the PH and the Pfeiffer, you know?",
    "timestamp" : "01:06:20-01:06:24"
  },
  {
    "timestamp" : "01:06:24-01:06:39",
    "speaker" : "Steve",
    "text" : "Yeah. Also, way late in this when they're like scraping for content, they cut to this guy in the Patriots booth called Bucko Kilroy. Which Absolutely an amazing name."
  },
  {
    "speaker" : "Andy",
    "text" : "Who had spent like 60 years in the league or something.",
    "timestamp" : "01:06:39-01:06:42"
  },
  {
    "text" : "Yeah, I went, I went, I did a little research on him because like what an amazing name. And uh why is he in the Pages booth and I've never heard of this guy. Nope. He was the founder of the draft. Whoa. Fuck holy shit. He shaped the modern Super Bowl as we know it now. He's trophy. He's generally no like the like the game. Cause remember he used to be at the NFL championship. Oh right, right, right. That's how old this guy was. Uh he's generally known as the dirtiest player ever. Even John Madden on the broadcast calls him that. He he was a Patriot Scouting assistant and the only reason he stopped is because he died.",
    "speaker" : "Steve",
    "timestamp" : "01:06:42-01:07:24"
  },
  {
    "text" : "Holy shit.",
    "timestamp" : "01:07:24-01:07:25",
    "speaker" : "Andy"
  },
  {
    "text" : "He was RGM in the eighties. And he was our head scout in the 2000s when we drafted like Brady and Richard Seymour and all these guys.",
    "timestamp" : "01:07:25-01:07:34",
    "speaker" : "Steve"
  },
  {
    "text" : "Fucking hell. Dude, Bucko. Bucko Kilroy. Yeah. God damn. This guy's a legend. He was instrumental in drafting Roger Staubach.",
    "timestamp" : "01:07:34-01:07:46",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:07:46-01:07:51",
    "speaker" : "Steve",
    "text" : "Yeah He played for the Philadelphia Steagles."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:07:51-01:07:51"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:07:52-01:07:57",
    "text" : "Which was the World War II team that they made when they combined the the Steelers and the Eagles."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, I caught that name. I'm like, there's gotta be some story behind why it's the Steelers and the Eagles combined.",
    "timestamp" : "01:07:58-01:08:04"
  },
  {
    "timestamp" : "01:08:04-01:08:14",
    "speaker" : "Greg",
    "text" : "That's awesome. Fucking Kilroy. How about that? The Beanie Steagle. I need I need a fucking Kilroy Steagles jersey."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:08:19-01:08:20",
    "text" : "We could probably make it happen."
  },
  {
    "speaker" : "Steve",
    "text" : "Who's that odd? Just no one, the dirtiest player in NFL history. Yeah.",
    "timestamp" : "01:08:20-01:08:24"
  },
  {
    "text" : "Absolutely. Yeah, they were they were definitely uh grasping at straws in terms of like content because they were focusing in on the uh like the the tray of all the medical equipment. Yeah. And they were talking about how they didn't know what any of it was. And John Madden made a joke, something about what was it? Um Thermometer Airlines or Thermometer Airways is what it said. Which sounds like a terrible box to have to open, but uh Which I didn't know he was afraid of flying, clearly he must be.",
    "timestamp" : "01:08:27-01:08:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:55-01:09:00",
    "text" : "And that's why they had always had like that stupid trailer at all games that he would do."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:09:01-01:09:01",
    "text" : "Right. Right."
  },
  {
    "speaker" : "Steve",
    "text" : "And they'd eat the turkey after Thanksgiving in front of the trailer.",
    "timestamp" : "01:09:02-01:09:05"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Yeah.",
    "timestamp" : "01:09:05-01:09:05"
  },
  {
    "timestamp" : "01:09:05-01:09:08",
    "text" : "And they put the player of the game on the side of the trailer.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:09:08-01:09:14",
    "text" : "He had a fear of flying, but he did it was definitely a a full fledged, like diagnosed phobia."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:09:14-01:09:14",
    "text" : "Oh yeah. Yeah."
  },
  {
    "text" : "Battery wouldn't fit in the seat. I mean you remember that part. You remember that bus and uh the little giants? Remember when he made his cameo in the little giants with like Bruce Smith and uh bunch of those other.",
    "speaker" : "Connor Ireland",
    "timestamp" : "01:09:15-01:09:30"
  },
  {
    "speaker" : "Steve",
    "text" : "Which there's actually content on the field too. Like we had Willie bodying people and then The Steelers scored a last second absolute garbage time TD.",
    "timestamp" : "01:09:38-01:09:51"
  },
  {
    "timestamp" : "01:09:51-01:10:38",
    "text" : "Oh my god. This was fucking brutal. Teddy Bruce King is super mad. This was shades of when the Patriots were blowing out the the Colts last year, and the Colts kept calling timeout so they could the ball back and then they threw in their backup quarterback. That's kind of what this felt like. Oh yeah. I remember. Like they were just there there was literally no reason to score. They're down thirty to seven, under two minutes left, and they're just like pulling out all the stops. They're they're running trick plays, they're running no huddle. They're like desperate to get in the end zone. And then Cordell barely scores a touchdown because he can't figure out to put the ball across the plane instead of his feet. Um And uh Teddy Bruski was fucking livid about it. Like he had to get pulled off of the referee by multiple players.",
    "speaker" : "Andy"
  },
  {
    "text" : "It was kind of like that um Bills game, a thirty-one nothing bookend year, you know. Yeah. But like on that game I totally understood the Bill's motivation there. I was like, yeah. Right. You don't want to get shut out. You don't want to lose by the same score you beat us on week one. Like I I was not like, what are you doing, Bills? You're just wasting your real time. This would felt a lot more like what are you doing, Steelers? You're just wasting everyone's time.",
    "timestamp" : "01:10:38-01:11:06",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:11:06-01:11:16",
    "text" : "Yeah, they were. And so to the point where they scored one second left? And the referee's just like, you know what, we're just gonna run the clock off. It's not worth doing the kickoff. Yeah. We're just done. We'll go home.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:17-01:11:20",
    "text" : "Don't worry about that last second. We'll just find it off.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "No big deal. So uh I think that brings us to best and worst. Greg, did you did you have any uh best and worst from your boy Jeff Wagenheim?",
    "timestamp" : "01:11:20-01:11:29"
  },
  {
    "text" : "Yeah, he's got a he's got a ton of them here.",
    "timestamp" : "01:11:29-01:11:32",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Well give me Wagenheim's best of his best.",
    "timestamp" : "01:11:32-01:11:35"
  },
  {
    "text" : "Yeah. I'll just give you the two corniest ones he's got left on here. Christian Fourier, number eighty-eight in your program, actually made it onto the field, caught a TD pass, and didn't get hurt.",
    "timestamp" : "01:11:35-01:11:56",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:11:57-01:12:01",
    "text" : "Holy shit. That's some fucking fire, god damn.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. And then uh worse superiority complex. The Steelers have claimed their AFC championship game lost as a fluke. And that they were the better football team. Based upon their tackling last night, maybe they meant best touch football team. Oh. Dude, Jeff Wagenheim Fire flames. Just risk You'll be here all week. They're so bad. More like touch football.",
    "timestamp" : "01:12:02-01:12:30",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "How many more of these do you have, Greg?",
    "timestamp" : "01:12:31-01:12:33"
  },
  {
    "timestamp" : "01:12:33-01:12:38",
    "speaker" : "Greg",
    "text" : "Dude, he he has like, I don't know, twelve, fifteen. You have the whole season here?"
  },
  {
    "timestamp" : "01:12:40-01:12:45",
    "text" : "Uh I bet we can find him. Yeah, I definitely have some Jeff Wagenhouse.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, no, I will uh keep holding. Future games. Perfect.",
    "timestamp" : "01:12:45-01:12:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, Connor, let's hear your best and worst from this game.",
    "timestamp" : "01:12:51-01:12:54"
  },
  {
    "timestamp" : "01:12:54-01:16:09",
    "speaker" : "Connor Ireland",
    "text" : "Okay. I I'll I'll be uh I got some good ones here. Um So best here's here's a here's a fun stat for you. Tom Brady was incredible. He had three touchdown passes which matched his total. for the last eight games of the 2001 season. So in the last regular eight in the last eight regular season games Which we won all of. Tom Brady had a total of three touchdowns across those eight games. So he came out, I think he uh shut up a lot of the uh media pundits pundits. He probably shut up a lot of fans who were wondering if it was a fluke. He was awesome. Um he was. Terrell Buckley Terrell Buckley was so underrated. You know, being in that secondary with Lawyer Merloy and Ty Law, uh Terrell Bucky Buckley and even Tobucky Jones He was just really solid and I I think he had a five or six, maybe seven interceptions this year. Maybe five or six. He only had three um the season before, so he had two two picks this game. Um and my third star I'm just gonna do losers and winners. My third star probably goes It it's it's tough to say. I'd have to go give it to Dion. Uh first game as a rookie coming out with I think he had like seven or eight catches. Eighty five yards. Um was the d the exact kind of like long player and by long I mean just like the stretches the field runs a lot on those like deep posts and and fade routes Uh, I think it was just what the offense was made need needed. So that was sweet. Uh biggest losers, bums, or things that sucked. Uh Kendrell Bell, I think, uh getting injured in the in the first uh I think it was the first quarter, he was defensive rookie of the year last year. He was supposed to be a stud. I'm not gonna say they would have won I do think it kind of changed um the trajectory of the game. Um Jerome Buttis stinks, what a big fat load. Um all he did was I I I I think he had like six hundred rushing yards this season. He just stunked I mean, granted he p punched it in nine times, but Jerome Bettis Blah. Um and then obviously and he had a fumble, yeah, which led I think it led to the branch uh T D Um and then the third biggest loser is I I gotta go back to Bill Cow um I gotta go back to Bill Cower's face. And then honorable mention is um Honorable mention is what's his face, the quarterback, Corderell, uh Stewart. He Cordell's dear. He after being offensive player of the year in two thousand one, all pro. He uh he was like he was I think he was the AFC MVP or or uh offensive player of the year the year before he came out and Showed he still had the yips from uh the AFC championship the AFC game."
  },
  {
    "speaker" : "Andy",
    "text" : "It was not a yeah. And he would last two and a half more games after this.",
    "timestamp" : "01:16:09-01:16:14"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "So Yeah.",
    "timestamp" : "01:16:14-01:16:15"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:16:15-01:16:22",
    "text" : "Yeah, fair slash, yeah. Oh bad. All right, Steve Brown. Say your best and worst, bud."
  },
  {
    "timestamp" : "01:16:23-01:16:33",
    "text" : "Alright. Um my worst I have The every run is a hold note in all caps.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:16:33-01:16:33"
  },
  {
    "timestamp" : "01:16:33-01:16:41",
    "speaker" : "Steve",
    "text" : "Because I don't think the Peaches couldn't run the ball. It's just like literally every time they did, they had a holding penalty."
  },
  {
    "text" : "I I mean they didn't exactly try. They had four runs in the first half. That's like four or quarter runs.",
    "speaker" : "Andy",
    "timestamp" : "01:16:41-01:16:48"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:16:49-01:16:52",
    "text" : "They had like four holding penalties too. Every single run would that's true."
  },
  {
    "timestamp" : "01:16:53-01:17:07",
    "speaker" : "Andy",
    "text" : "But most of the most of the they had twenty-three consecutive passing plays between the seconds. Yeah. But they just went five wide. You know, fuck it. Five wide. Let's just let's just gas this defense."
  },
  {
    "timestamp" : "01:17:08-01:17:11",
    "speaker" : "Steve",
    "text" : "So they had a couple of uh Belichick bests."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh good.",
    "timestamp" : "01:17:11-01:17:12"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh they talked about the T-shirt he gave everybody in the organization.",
    "timestamp" : "01:17:12-01:17:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:17:18-01:17:19",
    "text" : "Yes."
  },
  {
    "timestamp" : "01:17:19-01:17:21",
    "text" : "Like all the standings are at zero.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. And the everybody's standings on the back and everybody was at zero. Yeah. Fucking Beljack move.",
    "speaker" : "Andy",
    "timestamp" : "01:17:22-01:17:28"
  },
  {
    "timestamp" : "01:17:28-01:17:35",
    "speaker" : "Steve",
    "text" : "Um Can confirm that he's been keeping the replay sock or the replay flag in his sock since 02."
  },
  {
    "text" : "Yep. Yep.",
    "timestamp" : "01:17:35-01:17:36",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:17:36-01:17:39",
    "speaker" : "Steve",
    "text" : "I didn't see that in the first year. I think they had buzzers last year."
  },
  {
    "timestamp" : "01:17:39-01:17:43",
    "text" : "They did. And because they were so unreliable, they've now got the the flag.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. So he's like that's always been his spot in his sock with his I've always found hilariously endearing.",
    "timestamp" : "01:17:44-01:17:51"
  },
  {
    "timestamp" : "01:17:51-01:17:54",
    "speaker" : "Andy",
    "text" : "Yeah, I'm I'm I'm curious why the sock and why not just a pocket."
  },
  {
    "text" : "And then they were talking about Scott Pioli. They called him the son-in-law. And how he's married to Bill's daughter. And I was like, what? I didn't know that. Like Belichick and Scott Pioli like that. And I Googled it and it's not, they were talking about Bill Parcells.",
    "timestamp" : "01:17:55-01:18:11",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:18:12-01:18:13",
    "text" : "Oh, that's right."
  },
  {
    "text" : "Yeah, yeah, yeah. Did not know Scott Pioli is Bill Parcel's son-in-law.",
    "timestamp" : "01:18:13-01:18:19",
    "speaker" : "Steve"
  },
  {
    "text" : "Very incestuous. Same with um Yeah. What's his name in Tom Brady's sister? Eucolis.",
    "timestamp" : "01:18:20-01:18:26",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Euculus and and Brady's sister, yeah.",
    "timestamp" : "01:18:27-01:18:29"
  },
  {
    "text" : "Yeah, yeah. It's all sorts of cross pollination like that.",
    "speaker" : "Andy",
    "timestamp" : "01:18:29-01:18:33"
  },
  {
    "text" : "All right, my best butt chin in the postgame. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:18:33-01:18:39"
  },
  {
    "timestamp" : "01:18:40-01:18:41",
    "speaker" : "Andy",
    "text" : "Oh I got I have that."
  },
  {
    "timestamp" : "01:18:41-01:18:45",
    "speaker" : "Steve",
    "text" : "That's pretty fun. We just like spread it out and threw the ball. I hope we get to do more of that."
  },
  {
    "text" : "I have the audio here. Let me see if I can actually I want to see if I can get it because I have it here.",
    "timestamp" : "01:18:46-01:18:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Plaxical burst saying we didn't lose this one.",
    "timestamp" : "01:18:53-01:18:56"
  },
  {
    "timestamp" : "01:18:56-01:19:04",
    "speaker" : "Andy",
    "text" : "We got whipped after the game. As it should be. Love that. Welcome to the final and let's check in with Melissa."
  },
  {
    "speaker" : "Speaker 6",
    "text" : "Alright, Al, well when we talked to Tom Brady yesterday or actually on Saturday, he said we are going to kick their butt. Tom, how'd you know that?",
    "timestamp" : "01:19:04-01:19:13"
  },
  {
    "text" : "Yeah. We uh, you know, I think we had a good game plan. I think we were all confident. And we you know what? It's real tough for me is we had a good week of practice. So good to come out in our own stadium and play that way. It's uh good way to open this thing up, you know, a good way to defend our title.",
    "timestamp" : "01:19:14-01:19:29",
    "speaker" : "Speaker 7"
  },
  {
    "timestamp" : "01:19:29-01:19:34",
    "speaker" : "Speaker 6",
    "text" : "This Steelers defense was ranked number one in the NFL last season. How were you able to exploit them so well?"
  },
  {
    "speaker" : "Speaker 7",
    "text" : "Well you're right, they do have a great defense. And um, you know, it was just uh you know Charlie Weiss came up with a great plan and I think we you know we uh we come out here in the first game, we run a lot of a lot of the no huddle stuff, it's tough on the defense. you know, conditioning wise and you know we kind of got on our heels and guys guys Donald Hayes made an awesome play on the on the curl route when he when he you know kind of hooked and ran and Dion branch and Christian. I mean the three guys we didn't have last year make came out big so it was a great win.",
    "timestamp" : "01:19:35-01:20:01"
  },
  {
    "text" : "How does not how does anyone not love Brady? Yeah, he's the fucking best.",
    "timestamp" : "01:20:01-01:20:04",
    "speaker" : "Greg"
  },
  {
    "text" : "But he's so fucking goofy back in these days. I didn't even realize.",
    "speaker" : "Andy",
    "timestamp" : "01:20:06-01:20:10"
  },
  {
    "timestamp" : "01:20:10-01:20:14",
    "speaker" : "Steve",
    "text" : "Sticks out on that interview is like he didn't say hi mom. That's true."
  },
  {
    "timestamp" : "01:20:17-01:20:24",
    "speaker" : "Andy",
    "text" : "I had my parents real quick and they're like yeah. But he sounded just like nitpicking a little bit here, Steve."
  },
  {
    "speaker" : "Steve",
    "text" : "I'm just using that as an example to show how awesome of a guy Tom Brady is when my thought is like, man, he's also usually very gracious to his parents as well.",
    "timestamp" : "01:20:28-01:20:36"
  },
  {
    "text" : "I miss him already.",
    "timestamp" : "01:20:37-01:20:39",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "God, I miss him. I miss him so, so much. You'll never not miss him.",
    "timestamp" : "01:20:40-01:20:44"
  },
  {
    "timestamp" : "01:20:44-01:20:51",
    "text" : "So is that your worst Steve Brown? The fact that you missed Tom Brady? Sure. Did you have a worse?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:20:51-01:20:52",
    "text" : "It's the worst."
  },
  {
    "speaker" : "Steve",
    "text" : "I mean when Every run being a holding penalty was my worst.",
    "timestamp" : "01:20:52-01:20:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright. Um What the hell is going on over there, Connor?",
    "timestamp" : "01:21:01-01:21:05"
  },
  {
    "text" : "Dog's still hungry.",
    "timestamp" : "01:21:06-01:21:06",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh my roommates are talking in the kitchen. My audio's been fantastic. I'll tell you what, Andy, your audio's cut out a couple of times. You gotta you know, hear a little ricochet noise from my roommate telling a shitty story. I'm sorry",
    "timestamp" : "01:21:07-01:21:24",
    "speaker" : "Connor Ireland"
  },
  {
    "speaker" : "Greg",
    "text" : "But it sounded like a good story.",
    "timestamp" : "01:21:25-01:21:26"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Sorry guys.",
    "timestamp" : "01:21:26-01:21:27"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Maybe we'll get him on the podcast instead.",
    "timestamp" : "01:21:27-01:21:30"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "What what what w what are yours? What are yours, Andy?",
    "timestamp" : "01:21:31-01:21:34"
  },
  {
    "timestamp" : "01:21:34-01:21:48",
    "speaker" : "Andy",
    "text" : "Alright, my best was the referee cam Yeah. Camera's on the the middle referee, the guy behind like in the middle of the defense, like behind the linebackers. Which I've seen in college. Fuck they don't still have that is being offense."
  },
  {
    "speaker" : "Steve",
    "text" : "I've seen in college for sure. And it's I could see the rest not wanting that. Well they already had it. They already had it in 2002. I could see if they'd never done it before, but you already did it.",
    "timestamp" : "01:21:49-01:22:00"
  },
  {
    "timestamp" : "01:22:00-01:22:11",
    "speaker" : "Andy",
    "text" : "It was so good. It was good. Because it just looks like chaos when you're in the middle of it. Like the fact that anybody understands what they're supposed to be doing is beyond me when you look at it from that angle. It was fantastic."
  },
  {
    "speaker" : "Steve",
    "text" : "I'm 100%. And like the college version is cool as shit. The NFL version will only be cooler because it won't be quicker and faster.",
    "timestamp" : "01:22:11-01:22:18"
  },
  {
    "text" : "Right, yeah, it'd be great. So uh that was one of my best. My other best was uh the fullback from the Steelers when they're doing introductions, Dan Krater. Uh UNH alum. So how about that? Possibly the most famous UNH football player?",
    "timestamp" : "01:22:18-01:22:34",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:22:35-01:22:35",
    "text" : "No.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Can we say that? Give me another one.",
    "timestamp" : "01:22:35-01:22:37"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:22:37-01:22:38",
    "text" : "Jerry Azuma."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah.",
    "timestamp" : "01:22:39-01:22:40"
  },
  {
    "text" : "Alright, alright, yeah, I'll give you that.",
    "timestamp" : "01:22:40-01:22:42",
    "speaker" : "Andy"
  },
  {
    "text" : "Also there's a guy that played for the reason. The cornerback.",
    "timestamp" : "01:22:42-01:22:47",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:22:48-01:22:52",
    "text" : "Yeah. Kyle uh What's his name?"
  },
  {
    "timestamp" : "01:22:53-01:23:03",
    "speaker" : "Greg",
    "text" : "Kyle played for the Bears too. No. He picked off Manning in a big game, I remember. Jimmy s Jimmy something? Ravens?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Jimmy Smith? Okay. No, it's not him.",
    "timestamp" : "01:23:03-01:23:09"
  },
  {
    "speaker" : "Greg",
    "text" : "I got it.",
    "timestamp" : "01:23:10-01:23:10"
  },
  {
    "timestamp" : "01:23:10-01:23:22",
    "speaker" : "Andy",
    "text" : "One sec. I thought it was uh It was definitely yeah, uh Azuma was one of them. You're right. But I don't know who this new guy is talking about. Corey Graham? Corey Graham. Corey Graham."
  },
  {
    "timestamp" : "01:23:22-01:23:30",
    "speaker" : "Connor Ireland",
    "text" : "Oh nice. Yeah. I knew it. Kyle Corey. I knew it. I didn't even have to. Use Google."
  },
  {
    "text" : "I don't believe that.",
    "timestamp" : "01:23:32-01:23:32",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:23:36-01:23:38",
    "text" : "Was Azuma the wide receiver?"
  },
  {
    "text" : "I don't know, you tell me, you're on Google. No, I don't think so.",
    "timestamp" : "01:23:39-01:23:42",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "He's a D B I'm uh No, there's David Ball who was uh He broke Jerry Rice's touchdown record, touch on catch record, when I was there.",
    "timestamp" : "01:23:42-01:23:55"
  },
  {
    "text" : "And then who broke that record?",
    "timestamp" : "01:23:56-01:23:57",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:23:57-01:24:01",
    "speaker" : "Andy",
    "text" : "In the Chip Kelly days. I don't know who broke that record."
  },
  {
    "speaker" : "Greg",
    "text" : "He's in the NFL right now. He's a white receiver. James White record. James White.",
    "timestamp" : "01:24:01-01:24:06"
  },
  {
    "timestamp" : "01:24:06-01:24:09",
    "speaker" : "Andy",
    "text" : "Cooper Cup. Oh no shit. Yep."
  },
  {
    "timestamp" : "01:24:10-01:24:11",
    "speaker" : "Greg",
    "text" : "Cooper Cup"
  },
  {
    "speaker" : "Andy",
    "text" : "Set the college football touchdown receiving record. Yeah, one of those yards, maybe catches. There was a undrafted free agent who played for the Bears. Well Signed by the Bears.",
    "timestamp" : "01:24:11-01:24:23"
  },
  {
    "text" : "I don't think it's Corey Graham played twelve years in the league.",
    "speaker" : "Steve",
    "timestamp" : "01:24:23-01:24:26"
  },
  {
    "text" : "Yeah, he's really good. Yeah. I recognize his name. Didn't know he was a U and H guy. Yep. How about that? Represent.",
    "speaker" : "Andy",
    "timestamp" : "01:24:26-01:24:32"
  },
  {
    "timestamp" : "01:24:33-01:24:37",
    "text" : "How about them Wildcats? They each had a third round pick in 1982. There you go.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:24:38-01:25:17",
    "text" : "And my worst was basically the Steelers. They had six turnovers and thirteen penalties in their season opener when they had an entire offseason to prepare for the team that knocked them out of the playoffs the year before. They were just a hot fucking mess. And uh off of that, my favorite quote was um because this is the the beginning of the new division alignments, so it's the the first year of the A AFC North that the CLs are in. And even with this loss, they were still tied for first place. And Madden, his quote, was luckily they were in a bad division because it was the Browns and the Ravens were falling apart too. And uh who else in that division?"
  },
  {
    "text" : "Redskins. Oh no, never mind. Bangings. When they're when they're like they were like because again they were scraping for content and they're talking about the f<unk>ing NFC East for some reason.",
    "timestamp" : "01:25:17-01:25:34",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:25:35-01:25:56",
    "speaker" : "Andy",
    "text" : "Because that's what John Madden knows about. I th it was yeah, it was the dark time for the Bengals. And the Browns for that matter because it's the Browns. But yeah, and basically the the Steelers would get their doors blown off here, finish ten, five, and one and still Uh win their ACE and sit on the side."
  },
  {
    "speaker" : "Connor Ireland",
    "timestamp" : "01:25:56-01:26:43",
    "text" : "For the Steelers being recognized as as one of the greatest um You know, just teams and in in franchises. Uh we have an incredible win-loss record against them. I think we've beat them like Like twelve like we've won twelve, they've won three I mean it's some preposterous number. We've always had their number. Bill has oh I mean i it was an easy game plan. It's like oh you have all these big huge linebackers. Okay, we'll just go no huddle. and catch you in the wrong scheme and just wear you the fuck out. You know, it was Bill Cower was always always um Out out coached by Belichick, that's for sure."
  },
  {
    "timestamp" : "01:26:44-01:26:48",
    "text" : "So the Patriots against the Steelers in the Belichick era are twelve and four.",
    "speaker" : "Andy"
  },
  {
    "text" : "All of this information is available on PatriotsDynasty. info.",
    "timestamp" : "01:26:49-01:26:53",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:26:54-01:27:30",
    "speaker" : "Andy",
    "text" : "That's exactly right where I'm getting from. And uh if we want to talk, actually I had a uh quick before we end this, a quick trivia question, because I know how much you boys like that So the Patriots have played the Steelers three times to open the season and never lost. They're 3-0. And they actually average a score of 30 to 13, which is very close to this one. But uh there's one team that they played more times to open the season. Do you guys know who that is? The Dolphins. No."
  },
  {
    "text" : "Baltimore or the Chiefs.",
    "timestamp" : "01:27:30-01:27:32",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:27:32-01:27:33",
    "text" : "Nope.",
    "speaker" : "Andy"
  },
  {
    "text" : "Um assuming it's an AFC team.",
    "timestamp" : "01:27:33-01:27:35",
    "speaker" : "Steve"
  },
  {
    "text" : "Yes, it is an AFC. Yes. They played the Bills four times. They have lost once, and I can guarantee you all remember. I guarantee you don't remember any of the wins though, because I sure don't.",
    "timestamp" : "01:27:36-01:27:46",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:27:47-01:27:48",
    "text" : "I'm looking forward to re-watching that game.",
    "speaker" : "Steve"
  },
  {
    "text" : "I don't know if I am, but I don't know. Yeah, I believe it is.",
    "speaker" : "Andy",
    "timestamp" : "01:27:49-01:27:52"
  },
  {
    "timestamp" : "01:27:53-01:27:56",
    "text" : "Only because they know how the season ends, you know.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true. If this were the same thing.",
    "timestamp" : "01:27:56-01:27:58"
  },
  {
    "text" : "I'll be mad.",
    "timestamp" : "01:28:01-01:28:01",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:28:01-01:28:30",
    "speaker" : "Andy",
    "text" : "So yeah. Oh, and we have a new thing before we go. Um you can actually now leave reviews for our podcast. Don't tell them that. Yeah, no, I want to get some feedback. So and I think maybe we'll we'll put together for the the second season, we'll put together something where the best or our favorite review gets I don't know a free t-shirt or something. If you go to ratethispodcast. com slash Pat's Pod, you can rate it on your podcast listener of choice."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "You should give that pitch in the first fifteen seconds when people are still listening instead of you know the last minute of the Okay.",
    "timestamp" : "01:28:33-01:28:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:28:42-01:28:54",
    "text" : "No, I I want I want I want to know what they really think. I want them to have suffered all the way through this. I want it I want them to stretch in their mind when they go to leave a fucking comment about this."
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Well that's the thing. You need someone to listen listen all the way to this point. You might not get any ratings.",
    "timestamp" : "01:28:54-01:29:02"
  },
  {
    "speaker" : "Steve",
    "text" : "So we'll get will be like, wow, I didn't know that much about Bucko Kilroy. Great podcast, guys.",
    "timestamp" : "01:29:02-01:29:09"
  },
  {
    "speaker" : "Greg",
    "text" : "Speaking of which, speaking of which, when they ended their partnership, the Steelers and the Eagles, the Steelers then merged with the Chicago Cardinals, forming a team known as the Carpits.",
    "timestamp" : "01:29:10-01:29:24"
  },
  {
    "timestamp" : "01:29:27-01:29:28",
    "speaker" : "Steve",
    "text" : "That's the dumbest shit ever."
  },
  {
    "text" : "And it says pronounced carpets. And they went oh and ten. No shit they did.",
    "timestamp" : "01:29:28-01:29:34",
    "speaker" : "Greg"
  },
  {
    "text" : "They were fucking carpet.",
    "timestamp" : "01:29:34-01:29:35",
    "speaker" : "Andy"
  },
  {
    "text" : "Dude, I found an article on this. It's awesome. It's all about like the players from back then like smoking cigarettes on the practice field. Dude, their coach was Greasy Neal. Good Lord.",
    "timestamp" : "01:29:35-01:29:50",
    "speaker" : "Greg"
  },
  {
    "text" : "It was a part-time job, wasn't it?",
    "timestamp" : "01:29:54-01:29:55",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:29:56-01:29:57",
    "text" : "Yeah, yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:30:00-01:30:02",
    "speaker" : "Connor Ireland",
    "text" : "War was their full time job, right?"
  },
  {
    "timestamp" : "01:30:05-01:30:16",
    "speaker" : "Andy",
    "text" : "Uh and on that note, I think we will bring this to a merciful end. Again, rate us. Leave us some feedback if you dare. And if we get any good ones, we'll use the swag."
  },
  {
    "text" : "What's the uh what is it?",
    "speaker" : "Connor Ireland",
    "timestamp" : "01:30:17-01:30:19"
  },
  {
    "timestamp" : "01:30:19-01:30:29",
    "text" : "It's rate this podcast. com slash patspod. P-A-T-S-P-O-D. And it'll be in the show notes too. So look in the show notes, it'll be there.",
    "speaker" : "Andy"
  },
  {
    "text" : "If your comment is to put the uh The ratings thing it's the beginning of the episode. You can go fuck yourself, okay?",
    "speaker" : "Greg",
    "timestamp" : "01:30:30-01:30:37"
  },
  {
    "text" : "If your comment is that Connor needs to come back on, we'll know it's you, Connor. And stop leaving us that do that.",
    "speaker" : "Andy",
    "timestamp" : "01:30:37-01:30:42"
  },
  {
    "speaker" : "Connor Ireland",
    "text" : "Okay, ratings and reviews. Yep. Oh Jesus. Got it. I'm I'm not I'm I I'm gonna juice up our reviews, so Love it.",
    "timestamp" : "01:30:42-01:30:51"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and yeah, boys, if you want if you want to add some uh some positivity to this, you're more than welcome to balance out all the negativity we're about to get. Feel free.",
    "timestamp" : "01:30:52-01:30:59"
  },
  {
    "timestamp" : "01:30:59-01:31:04",
    "speaker" : "Connor Ireland",
    "text" : "But this has been leave a hot a really good review. Yep. All right. Sorry, Andy."
  },
  {
    "speaker" : "Andy",
    "text" : "No, it's all right. This has been uh a joy as always, gentlemen. Appreciate you joining us. And uh we'll see you next week on the Patriots Dynasty Podcast. What is next week? How many ever prepared for this? It's week two. They're playing.",
    "timestamp" : "01:31:04-01:31:20"
  },
  {
    "text" : "This is true. According to the Boston Globe, it's Route Two. Route too. Like route. Route. It's another Boston Globe pun.",
    "timestamp" : "01:31:20-01:31:31",
    "speaker" : "Greg"
  },
  {
    "text" : "Giving it away. Alright, yeah. We're uh traveling to Giants Stadium. Good morning. And we will jets. Exactly. And we'll see ya then. Take it easy, guys.",
    "speaker" : "Andy",
    "timestamp" : "01:31:31-01:31:45"
  },
  {
    "timestamp" : "01:31:45-01:31:46",
    "speaker" : "Greg",
    "text" : "See ya."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:31:46-01:31:46",
    "text" : "See ya."
  }
]