[
  {
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother."
  },
  {
    "text" : "Welcome back to the Patriots Dynazy Podcast. We've made it to week eight of the 2003 season. The Patriots are hosting the New re-new um Cleveland Browns because they're new, but they're still the same old Cleveland Browns that they always were. Uh and they're hosting them at Gillette Stadium. And I believe they said this was Halloween, but I didn't actually look up the date on this. They mentioned Halloween, and there's a bunch of like Ben pumpkins kicking around, but yeah, that doesn't make a lot of sense. As you can tell, if you haven't joined us before, this is a very well-researched podcast. Sunday, October 26th, 2003. So it was uh Halloween weekend. There you go. Week ago. This is Sunday. We're also really good at telling uh dates and stuff. Uh but I am your host, Andy Brown. With me today is Steve Brown. How you doing, Steve?",
    "speaker" : "Andy",
    "timestamp" : "00:22-01:18"
  },
  {
    "timestamp" : "01:18-01:19",
    "speaker" : "Steve",
    "text" : "I'm doing great."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. You're quarantining currently for in preparation for the holiday season?",
    "timestamp" : "01:19-01:23"
  },
  {
    "text" : "Quarantining is easy.",
    "speaker" : "Steve",
    "timestamp" : "01:24-01:26"
  },
  {
    "timestamp" : "01:27-01:31",
    "text" : "Quarantining for you is easy. Quarantining with you, it sounds like is is No, yeah, no.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:32-01:40",
    "text" : "Quarantining with me is is probably hell, but for me, eat a lot, drink a lot of beer, and watch a lot of stuff on TV."
  },
  {
    "speaker" : "Andy",
    "text" : "It's just it doesn't sound like much has changed for you.",
    "timestamp" : "01:40-01:43"
  },
  {
    "timestamp" : "01:43-01:59",
    "speaker" : "Steve",
    "text" : "Yeah, right. And watch football games from 2003. Yeah, so you know, the huge What do you want to do tonight? I have to watch this 9-3 Cleveland Browns New England Patriots game from 2003. It's gonna take a couple hours."
  },
  {
    "timestamp" : "01:59-02:22",
    "text" : "Yeah. I I was not particular like there there are there are some games in this that I'm like oh I can't wait to watch this and I'll watch it like a few days before I'm ready, you know, and I'll or I'll like maybe watch it a couple times. This ain't that. This was one of the least exciting Patriots wins we've we've witnessed so far, I would say.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, it was it was definitely a snoozer. Uh watchability score, you want to go there?",
    "speaker" : "Steve",
    "timestamp" : "02:23-02:28"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Um so I think we've talked about this before, about how our out of six Lombardies that we give this game in terms of a watchability score. It's usually an inverse of how many punts there were, right? We've kind of loosely based uh that uh we we've we've noticed a trend. Um so I'm just gonna read you the the drive. uh charts on this and how they ended. Uh punt, field goal, punt, punt, punt, punt, punt, punt, punt, miss field goal, field goal. And that's the first half. So with that being said, this game ending 9-3. Oh, it's 3-3 at the half.",
    "timestamp" : "02:28-03:15"
  },
  {
    "speaker" : "Steve",
    "text" : "3-3.",
    "timestamp" : "03:15-03:16"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:16-03:22",
    "text" : "So with this game ending 9-3, I will give this one. Lombardi out of six."
  },
  {
    "timestamp" : "03:22-03:31",
    "speaker" : "Steve",
    "text" : "From a Browns fan perspective is though, because like they're probably used to that. That's just another day at the office. At least they're not losing 48, nothing at happen."
  },
  {
    "speaker" : "Andy",
    "text" : "They lost by less than a touchdown. So this is gotta be",
    "timestamp" : "03:31-03:33"
  },
  {
    "timestamp" : "03:33-03:47",
    "speaker" : "Steve",
    "text" : "The whole game was in dead in in play the whole time. Yeah, yeah. Um yeah, I would say one big play from the combination Helly Kelly Holcomb Tim Couch. Right back on top, baby."
  },
  {
    "timestamp" : "03:47-04:02",
    "speaker" : "Andy",
    "text" : "The The two-headed monster of Kelly Holcomb, Tim Couch. Yeah, I would say out of zero lum bodies, they would probably give this a zero. I would say out of zero zero Lombardies, they would probably give all Browns games a zero."
  },
  {
    "timestamp" : "04:03-04:09",
    "speaker" : "Steve",
    "text" : "I'll give it an AFC championship game just because the first time you see the Browns. And I have a soft spot for the Browns."
  },
  {
    "text" : "Uh we've seen them I thought we saw them in 2001.",
    "speaker" : "Andy",
    "timestamp" : "04:09-04:12"
  },
  {
    "text" : "Uh I maybe not have been on that game at all.",
    "timestamp" : "04:13-04:15",
    "speaker" : "Steve"
  },
  {
    "text" : "Maybe not. It wasn't particular uh that game was only memorable because of how many shots the uh Brown's quarterback took and how vicious they were. And the fact that he lasted the whole game was impressive.",
    "speaker" : "Andy",
    "timestamp" : "04:16-04:27"
  },
  {
    "text" : "Let's see. Let's go to Patriots Dynasty. info and see uh you're right, Cleveland Brown 1627",
    "speaker" : "Steve",
    "timestamp" : "04:28-04:34"
  },
  {
    "timestamp" : "04:34-05:18",
    "text" : "Yeah, also not not a hugely entertaining game. Um, I think there's a lot of missed opportunities by the pages in that, and I think you could say the same in this game. The Patriots were the better team, but not by a lot. By about nine to three, they were a better team. Um there let me give you the halftime stats here. Uh you know, like the Pages were moving the ball a bit. They had 166 total yards to the Browns 120. Of which 50 of those Browns yards came on their last drive. So not great. But on third down conversions, they were a combined. I wrote this down somewhere. They were combined three for 15 on third down.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean, but let's be real, 45 of the Patriots' first half yards came on the first play they had the ball.",
    "timestamp" : "05:19-05:25"
  },
  {
    "text" : "Correct. So that's what kind of game we're talking about here. But before we get too deep into that, let's let's talk about these Cleveland Browns back in 2003. Because like most of the time, these are kind of like these interesting snapshots of these teams that we do. You know, we look at the lines like, oh, this is cool. It's Joey Harrington. But this Cleveland Browns team could be any Cleveland Browns team from the past 20 years.",
    "speaker" : "Andy",
    "timestamp" : "05:25-05:52"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "05:53-06:04",
    "text" : "It's true. You always look for the names, right? There was one team we played where there was no names on it, and I didn't know anybody on the team except for a couple."
  },
  {
    "speaker" : "Andy",
    "text" : "Was that the Giants game a couple weeks ago maybe?",
    "timestamp" : "06:05-06:06"
  },
  {
    "timestamp" : "06:06-06:07",
    "text" : "Yes, that's what it was.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Was it yeah?",
    "timestamp" : "06:08-06:08"
  },
  {
    "timestamp" : "06:08-06:13",
    "speaker" : "Steve",
    "text" : "Yeah, it was like Tiki Barber and Kerry Collins and like that's it. Right. Nobody else."
  },
  {
    "timestamp" : "06:14-06:39",
    "speaker" : "Andy",
    "text" : "But yeah, let me give you some names from this. This is probably worse. The running back, the leading running back was William Green, who finished the season season with 559 yards and one whole touchdown. Not good. Top wide receiver, Dennis Northcutt, who the receivers I did I did recognize. I recognized the names, but I couldn't picture any highlights from any of them in my head."
  },
  {
    "timestamp" : "06:39-06:40",
    "text" : "Quincy Morgan.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "06:42-06:45",
    "speaker" : "Andy",
    "text" : "I vaguely remember the name, yeah. I may have had his football card."
  },
  {
    "speaker" : "Steve",
    "text" : "Yep.",
    "timestamp" : "06:45-06:46"
  },
  {
    "speaker" : "Andy",
    "text" : "But those were the guys that like you got the football card and you're like, yeah, I recognize him. But you know it's not worth anything. They're like the filler cards when you're looking for the Drew Bledzos and the Right, right. The Drew Breezes and the the Brett Favres. But they were so but Dennis Northcut finished with seven hundred and twenty-nine yards and two whole touchdowns. leading receiver on the team.",
    "timestamp" : "06:47-07:08"
  },
  {
    "text" : "It's because they were spreading the ball around, Andy.",
    "timestamp" : "07:08-07:10",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:11-07:47",
    "text" : "No, it's because their offense was hot garbage. Kelly Holcomb, as we talked about, was Technically the quote unquote leading quarterback of this team. Um but he split his time with Tim Couch. Uh I think they both had Uh injury issues? Because I remember they were talking I think I got them confused, but I think Tim Couch maybe started the season and then Didn't play well, so they put Kelly Holcomb in and he played less bad and then he got hurt. Yeah, and then Tim Couch came back in."
  },
  {
    "speaker" : "Steve",
    "text" : "And then then right before this they'd had the the Tim Couch crying game.",
    "timestamp" : "07:47-07:51"
  },
  {
    "speaker" : "Andy",
    "text" : "Right, which we'll get into. But they both they both played eight games. Uh Kelly Holcomb went two and six. Tim Couch went three and five.",
    "timestamp" : "07:51-07:59"
  },
  {
    "timestamp" : "07:59-08:01",
    "speaker" : "Steve",
    "text" : "In your face, Kelly Holcomb."
  },
  {
    "text" : "Kelly Holcomb went for 1700 yards, 10 touchdowns, 12 interceptions. Tim Couch, uh 1300 yards, seven touchdowns, six interceptions. So Tim Couch was the less worse quarterback because he won an extra game and I've been playing since ninety-nine. Yeah, so let's let's do it. Let's I wanted to get into uh because I think we've all seen that uh picture of the Browns quarterback jersey with all the names taped on the back and how many there were.",
    "speaker" : "Andy",
    "timestamp" : "08:01-08:35"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "08:35-08:35"
  },
  {
    "speaker" : "Andy",
    "text" : "So I just kind of wanted to dig into that a little bit when we talked about these browns because we use uh I think the term factory of sadness in this podcast, maybe a little too much. And we kind of throw it around flippantly because we don't understand what it means because we're Patriots fans. But this, if you there's literally a Wikipedia page for a list of Cleveland Browns starting quarterbacks because there's so many of them. And I just looked at starting in two thousand two.",
    "timestamp" : "08:35-09:02"
  },
  {
    "timestamp" : "09:02-09:18",
    "speaker" : "Steve",
    "text" : "Well let's put this in perspective. I was talking to a coworker from the Cleveland area the other day and he made note That Baker last year was the first quarterback to start all 16 games since our buddy Tim Couch in 2001."
  },
  {
    "timestamp" : "09:19-09:40",
    "text" : "Correct. That's exactly what I was gonna say. If you look at this list Um the list is by season and yes, the only since 2000 When, you know, Belichick took over the Patriots. There has been one other season where only one quarterback played for the Cleveland Browns, and that was 2001 with Tim Couch.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And even before that, 1991, Bernie Kozar.",
    "timestamp" : "09:40-09:44"
  },
  {
    "text" : "Yeah, which was that was kind of around the time of Belichick being the coach of the Cleveland Browns, too. So then it's actually right before.",
    "timestamp" : "09:45-09:54",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Thirty some odd years, they've had three sixteen game seasons out of a quarterback.",
    "timestamp" : "09:54-09:59"
  },
  {
    "timestamp" : "09:59-10:37",
    "speaker" : "Andy",
    "text" : "Yeah. And he and like you can keep coming back and like none of these are good. The longest starting quarterback in terms of like years If you don't count Otto Graham being the starting quarterback from 46 to 55, because I mean even our parents weren't born back then. And we're I'm kicking 40s door down. I'm 37. Uh is from 1978 to 1981 by himself, and then he played some more games in 82 and 83, was Brian Sype. Yeah, no, I don't even know if I'm pronounced that right because I've never heard of this dude."
  },
  {
    "speaker" : "Steve",
    "text" : "Zipe?",
    "timestamp" : "10:38-10:38"
  },
  {
    "text" : "Yeah. He made the Pro Bowl in 1980, first team All Pro, second team all pro. He was the NFL MVP in 1980 apparently. What? Threw for 4,000 yards and 30 touchdowns.",
    "timestamp" : "10:39-10:52",
    "speaker" : "Andy"
  },
  {
    "text" : "Again, this is before our Either of us are born Andy.",
    "speaker" : "Steve",
    "timestamp" : "10:53-10:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Just barely. I mean I was born in '83, so he was still playing.",
    "timestamp" : "10:56-10:59"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, that's three years. You're negative three at that point.",
    "timestamp" : "10:59-11:02"
  },
  {
    "speaker" : "Andy",
    "text" : "This is correct. But all right, so let's start in 2000 then. Because this is the time frame we know. This is the time frame we're talking about. 2000, Tim Couch. Who had been playing since nineteen ninety-nine. So I think he was like their big draft pick when they came back as a team in nineteen ninety-nine was Tim Couch. uh who split time with Ty Detmer the year before. Tim Couch started seven games. Spurgeon Wynn. Fucking great name. Started one game. And then I don't know if you recognize his name, but Doug Peterson started eight games for the Cleveland Browns in 2000. So I went down a little bit of a road.",
    "timestamp" : "11:02-11:38"
  },
  {
    "text" : "rabbit hole with this. Yeah, how did Doug Peterson do as a quarterback? Why didn't it give him more of a shot?",
    "speaker" : "Steve",
    "timestamp" : "11:38-11:42"
  },
  {
    "timestamp" : "11:43-12:43",
    "speaker" : "Andy",
    "text" : "So, well here's the thing. Uh Doug Peterson had been a journeyman up until this, right? He played for, I think he was drafted by the Dolphins, I want to say. Oh, he's a rookie free. He wasn't even drafted. He was signed as a uh he was signed with the Dolphins in his rookie year. Then he did stint with the Packers, then with the Eagles. Um didn't play a lot, I don't think, with any of those teams. And then according to Wikipedia, Peterson considered retirement after being released by the Eagles, but instead signed a two-year contract with the Cleveland Browns on September 2nd, 2000. Not a good decision, I feel. I mean, I think Doug Peterson in today's age as a head coach of an NFL team, especially right now with the whole Carson Wentz thing going on, is being criticized for his bad decision making. Uh I think there's some red flags back in 2000 when he decided, you know what? No, I still want to play. That Cleveland Brown job, that looks like a good idea."
  },
  {
    "speaker" : "Steve",
    "text" : "What did he do? How did he go as a Cleveland Brown quarterback?",
    "timestamp" : "12:43-12:46"
  },
  {
    "timestamp" : "12:47-14:19",
    "speaker" : "Andy",
    "text" : "Um, let's take a look real quick. Uh Cleveland Browns, ba ba-ba. The Browns backup Ty Detmer suffered a season engine injury and the Browns needed a backup quarterback to start Tim Couch. This is the second time in Peterson's career that he was signed to replace injured Ty Detmer, I'm guessing back in the Eagles. Um Peterson started as the third quarterback behind Couch and Spurgeon win until Couch suffered a seasoning and ended ending injury in week seven. Peterson started the next six games. How do you think he went in those six games? How do you think the Browns did record-wise? It was terrible. 0-6. 1-5. In week 13 game against the Ravens, he was knocked out of the game with bruised ribs and replaced with Win. Win started the next week against the Jacksonville Jaguars, but he suffered a seasoning ending injury and Peterson replaced him. He returned for the final two games of the season, losing both. including a thirty five twenty four loss to his former team the Eagles and a twenty four nothing shutout to the Tennessee Titans. Peterson was released after the season on february twenty second, two thousand one, and then he went on to uh play for the Packers again before retiring officially. In 2005. So that's only 2000. We have those those three. And that was just like, you know, Tim Couch sees an ending injury. So they bring in um They bring in Doug Peterson who gets hurt. And so they bring in Spurgeon Wynn. He suffers a season ending injury and then they have to put Doug Peterson back in. for them to go one and five while he's there."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "14:20-14:26",
    "text" : "Yeah, but Tim Couch is number five on the all-time game-started Cleveland Browns quarterback list. Suck on that, Andy."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:28-14:33",
    "text" : "How ma uh where does he stand on the list of season ending injuries? I don't know."
  },
  {
    "text" : "Greg talked about this earlier. You gotta be bad enough. to keep your job. He played 59 games and a 373 winning percentage. That's impressive.",
    "timestamp" : "14:38-14:46",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "He started 16 games one of those seasons.",
    "timestamp" : "14:47-14:50"
  },
  {
    "timestamp" : "14:50-14:54",
    "text" : "He also had the last playoff start in Brown's history.",
    "speaker" : "Steve"
  },
  {
    "text" : "Tim Couch?",
    "timestamp" : "14:55-14:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:56-14:57",
    "speaker" : "Steve",
    "text" : "Yes."
  },
  {
    "speaker" : "Andy",
    "text" : "That can't be right. They didn't Derek Anderson take him to the Playoffs in like the 0708 or no Kelly Holcomb. You're just making shit up now, aren't you?",
    "timestamp" : "14:58-15:11"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "15:11-15:17",
    "text" : "That's what Wikipedia is telling me, Andy. Postseason. 2002, Kelly Holcombe, 0-1."
  },
  {
    "text" : "Greg, can we fact check this, please?",
    "timestamp" : "15:17-15:19",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:20-15:29",
    "text" : "Nice to see you back. Sure can. Hey guys, good evening, Steven. Nice to see you. Good evening. You look like an alien.",
    "speaker" : "Greg"
  },
  {
    "text" : "I like your hair, Greg. Thanks. Oh wait, let me let me give you the intro you you deserve.",
    "timestamp" : "15:30-15:35",
    "speaker" : "Andy"
  },
  {
    "text" : "No, no applause. No doubt. That's new, huh? That's new, yeah. I got a new toy. What else you got on there?",
    "speaker" : "Greg",
    "timestamp" : "15:39-15:48"
  },
  {
    "speaker" : "Andy",
    "text" : "That's the right intro. Yeah. And there's another one I'll save for later. There's one more. That you'll have to earn.",
    "timestamp" : "15:51-15:59"
  },
  {
    "speaker" : "Steve",
    "text" : "I feel like the trombone one is very appropriate for the Cleveland Browns episode.",
    "timestamp" : "15:59-16:02"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "16:03-16:18",
    "text" : "We got one of those. That's what we need. Yakity sax, is that what that's called? Yes, it is. Exactly what it's called. Uh we'll see if I can find some yakity sacks. We need a yakity sax. Sound bite."
  },
  {
    "text" : "So uh since you're you're just joining us, we are talking about the list of Cleveland Browns starting quarterbacks. Yes, the 2000 onwards. Yes. And this list, because I I like I was saying to Steve, we throw around the term like factory of sadness kind of a little loosely because we don't really understand what it means because we're Patriots fans. But this list is kind of a glimpse into what that actually means. Because as Steve pointed out, or his his co-worker from the Cleveland area pointed out. Uh before 2019 when Baker Mayfield started all 16 games, the last time a Brown starting quarterback started every game. of a season was 2001 with Tim Coach. Yes.",
    "speaker" : "Andy",
    "timestamp" : "16:19-17:08"
  },
  {
    "timestamp" : "17:09-17:22",
    "speaker" : "Steve",
    "text" : "All right. I just looked it up. 2002 playoffs. Steelers, Browns. Browns are the six. In the snow. Kelly Holcomb. 26 to 43, 429 yards, three touchdowns, and an interception."
  },
  {
    "text" : "Yeah, remember I wore the Holcomb jersey on that podcast right by the playoffs? Yeah. Because that was his best game ever.",
    "speaker" : "Greg",
    "timestamp" : "17:22-17:30"
  },
  {
    "speaker" : "Steve",
    "text" : "And they gave up 22 points in the fourth quarter to lose 36-33.",
    "timestamp" : "17:31-17:36"
  },
  {
    "text" : "Yeah. Yeah. It's a crazy game. It was snowing too.",
    "speaker" : "Greg",
    "timestamp" : "17:36-17:40"
  },
  {
    "timestamp" : "17:43-17:52",
    "speaker" : "Andy",
    "text" : "I thought they made the playoffs in like 2007. Did they just not make it, but they were they had a winning season? Am I confusing the two? I think I might be."
  },
  {
    "text" : "Let's see. Quarterback since two thousand seven. Derek Anderson fifteen. Charlie Fry one. Didn't Derek Anderson have like one little stretch there where he was like legit?",
    "timestamp" : "17:52-18:01",
    "speaker" : "Steve"
  },
  {
    "text" : "That's yeah, that I think that's that season, that two thousand seven season where they were like leading the division for a while. And Derek, because I think wasn't it Derek Anderson and um I don't know, some big wide receiver too and they were putting up like obscene numbers. Like them and the Browns put up like a 54 to 50 game. Was it Josh Gordon? I thought it was before his time. It was like Braylon Edwards or something.",
    "timestamp" : "18:01-18:23",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "18:23-18:31",
    "text" : "Yeah, maybe Braylon Edwards. Oh, Braylon Edwards. Yeah, apparently they had a winning record in 2007, but I don't think they made the playoffs. Wow."
  },
  {
    "timestamp" : "18:31-18:39",
    "speaker" : "Steve",
    "text" : "But then the year after they get nine games from Derek Anderson, three games from Brady Quinn, three games from Ken Dorsey, and one game from Bruce Gadakowski."
  },
  {
    "timestamp" : "18:39-18:47",
    "speaker" : "Andy",
    "text" : "Yeah, the wheels fell off. I think that's probably that seems to be the most quarterbacks they started in one season is four."
  },
  {
    "timestamp" : "18:47-18:48",
    "text" : "Four starting quarterbacks.",
    "speaker" : "Steve"
  },
  {
    "text" : "They did it back in eighty eight with Bernie Kozar, Mike Pagel, Gare, Gary Danielson, Don Strzok. But 2008 just seems sadder.",
    "timestamp" : "18:48-18:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "18:58-19:08",
    "text" : "I'm gonna read out the names who I have no idea who they are on this list. Because even like Spurgeon Wynn, I sort of remember him just because his name is hilarious. Yeah."
  },
  {
    "timestamp" : "19:09-19:15",
    "text" : "Well he's he's a Brady he's one of the Brady seven. Right. Yeah, that's right. He was drafted 16 spots ahead of Tom Brady. Okay.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "So who is Seneca Wallace?",
    "timestamp" : "19:16-19:17"
  },
  {
    "timestamp" : "19:18-19:28",
    "speaker" : "Greg",
    "text" : "Seneca Wallace was Iowa State. He was like a a speedy quick guy. I think he might have been like a converted. He ended up converting to wide receiver at some point."
  },
  {
    "speaker" : "Andy",
    "text" : "I feel like he was supposed to be what um Russell Wilson turned into. Eating wasn't very big. It's kind of like a a bulky kind of but he he could move and he could throw on the run, yeah, like Greg was saying. Run for a school.",
    "timestamp" : "19:28-19:41"
  },
  {
    "timestamp" : "19:41-19:46",
    "speaker" : "Greg",
    "text" : "Yeah, pretty sure he ended up playing wide receiver in the NFL. Ken Dorsey?"
  },
  {
    "timestamp" : "19:51-19:51",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "19:51-19:52",
    "text" : "Oh, that's right.",
    "speaker" : "Greg"
  },
  {
    "text" : "What about Connor Shaw? No idea who that is. Austin Davis? He sucked.",
    "timestamp" : "19:52-19:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:00-20:00",
    "text" : "Nope."
  },
  {
    "text" : "Kevin Davis.",
    "timestamp" : "20:00-20:01",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Who?",
    "timestamp" : "20:03-20:03"
  },
  {
    "text" : "Kevin Hogan?",
    "timestamp" : "20:04-20:05",
    "speaker" : "Steve"
  },
  {
    "text" : "Isn't he the wide receiver?",
    "speaker" : "Andy",
    "timestamp" : "20:05-20:07"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "20:08-20:18",
    "text" : "He's fairly recent too, I think. Cody Church. I think he was I think I've seen Kevin Hogan play live. Is that the game where Brady came back from the suspension?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:19-20:20",
    "text" : "Is that that game really?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "20:20-20:22",
    "text" : "I think he was starting for the Browns."
  },
  {
    "speaker" : "Andy",
    "text" : "2017, yeah, that would make sense. Yeah. Yeah. The one game Deshaun Kaiser didn't start that season. I remember him. He was a high pick.",
    "timestamp" : "20:22-20:32"
  },
  {
    "text" : "Cody Kessler was a high pick.",
    "speaker" : "Steve",
    "timestamp" : "20:32-20:34"
  },
  {
    "timestamp" : "20:34-20:43",
    "text" : "Johnny Manzel obviously high pick. RG3, Johnny Manzel, Josh McCow. Brian Hoyer on here.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "20:43-20:46",
    "text" : "Yeah. Brandon Whedon was a high pick. Thad Lewis."
  },
  {
    "timestamp" : "20:47-20:57",
    "speaker" : "Andy",
    "text" : "Was it wasn't Brandon Wheaton the the oldest draft pick? Yes, yeah, yeah. It was like 24 when he got drafted or something. Like twenty-eight when he got drafted."
  },
  {
    "speaker" : "Greg",
    "text" : "I think he played baseball for a few years.",
    "timestamp" : "20:57-20:59"
  },
  {
    "timestamp" : "20:59-21:13",
    "text" : "Yeah, yeah, he did, yeah. Uh but apparently he wasn't good enough, so he kind of like he got drafted. I I did a quick Wikipedia search on him. And uh he basically wasn't getting any playing times. Like, oh, I'll try football. And then got drafted by the Browns in like the first round.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, well, he lit it up at Oklahoma State. Well I'm pretty sure wasn't he like a Heisman finalist too? Brandon But everybody was like nah he's too old except for the Browns they were like fuck yeah let's fucking first round pick baby yeah Well everybody was like, you know, Manzell, he's not really mature and he's he's kind of small, but not the Browns. They were like, fuck it.",
    "timestamp" : "21:13-21:39"
  },
  {
    "text" : "I mean, Colt McCoy played 21 games as their starter. He's still around. Didn't he start? He just started a game for the Giants.",
    "speaker" : "Steve",
    "timestamp" : "21:40-21:47"
  },
  {
    "timestamp" : "21:48-21:49",
    "text" : "Oh, that's right, yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "God, that's 2010, 2011. He won a game for the Giants.",
    "timestamp" : "21:50-21:53"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:53-22:01",
    "text" : "Yeah. Because there was somebody else playing that week too, who also One that shouldn't have. I'm sure it was a Luke McCown."
  },
  {
    "text" : "Luke McCown and Josh McCown.",
    "speaker" : "Steve",
    "timestamp" : "22:02-22:04"
  },
  {
    "speaker" : "Greg",
    "text" : "I think I get Cade McCown in there. They got a full hat trick.",
    "timestamp" : "22:05-22:08"
  },
  {
    "timestamp" : "22:09-22:15",
    "text" : "The McCown hat trick. Oh, you're missing Jeff Garcia and Trent Dilfer, though.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean I know Jeff Garcia, the old nine years guy. Yeah.",
    "timestamp" : "22:15-22:18"
  },
  {
    "text" : "Trent Dilfer, the old. Bucks. Everything guy. Yeah, Bucks. And he uh well is he's the one that everybody Oh no never think anybody else doesn't matter. Charlie Fry Oh cry Brady Quinn. But Brandon was Brandon Whedon the one that got caught underneath the flag, the huge American flag?",
    "timestamp" : "22:18-22:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:40-22:41",
    "text" : "I don't remember that.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "22:42-22:47",
    "speaker" : "Andy",
    "text" : "Oh, do you oh Brandon Wien."
  },
  {
    "text" : "Well, I got I got some stats on this. Want me to give you some of those? I found a website that's like specifically about this. Okay.",
    "speaker" : "Greg",
    "timestamp" : "22:48-22:54"
  },
  {
    "text" : "Yeah, people getting trapped underneath giant American flags?",
    "speaker" : "Steve",
    "timestamp" : "22:55-22:58"
  },
  {
    "timestamp" : "22:58-23:02",
    "speaker" : "Greg",
    "text" : "No. About the Browns quarterbacks."
  },
  {
    "text" : "All right, hang on. Let me just show you this video and we'll post it in the show notes too. Because this is it Wheedon? It is Brandon Wheedon. That was correct. I'm excited. And he was warming up before the game. Experience in the NFL. Pulling the the big American flag out.",
    "speaker" : "Andy",
    "timestamp" : "23:02-23:20"
  },
  {
    "timestamp" : "23:22-23:36",
    "text" : "See I was telling you about that maturity and that confidence, but he still is a rookie. Hopefully he'll come out of that in the game. Of course it'll be a a while first because the Eagles will Get the ball first, they have won the twenty.",
    "speaker" : "Announcer"
  },
  {
    "text" : "Oh, there he is. Now he's out. Yeah, with the uh with the parachute.",
    "timestamp" : "23:36-23:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "23:44-23:49",
    "text" : "Yes. Nightcrawlers That game used to scare the shit out of me.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:49-23:52",
    "text" : "Really? I used to love that game. Yeah, I hated it. I hate it enough."
  },
  {
    "text" : "So what do we have, Graph? Stats on here. This is an article from 2016, so it might be slightly dated, but Um so the Browns have started more than one quarterback in 15 consecutive seasons. And they've started 26 different quarterbacks since 2000. So that's 16 years. Yep. Only six of those six of those quarterbacks have started at least sixteen games in their Browns career. Tim Couch is the only one to s start a full season, like you said. Uh the median number of games started is eight. Oh seven quarterbacks have been drafted in the first round.",
    "timestamp" : "23:53-24:32",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "24:32-24:33",
    "text" : "That's the hardest one.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh my god.",
    "timestamp" : "24:34-24:34"
  },
  {
    "text" : "Not like the lack of trying. That's the thing.",
    "timestamp" : "24:35-24:37",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "24:38-24:52",
    "text" : "So um here's a question. Oh, here's a good one. Only three of its starting quarterbacks, Tim Couch, Derek Anderson, and Brian Hoyer, have won more than six. games as a brown. Their average QBR is sixty six point zero."
  },
  {
    "timestamp" : "24:53-25:05",
    "speaker" : "Steve",
    "text" : "Well here here is a this is a probably a good Good for Baker because like it's wide open for him to be the best Browns quarterback ever. Maybe outside of Otto Graham."
  },
  {
    "timestamp" : "25:06-25:21",
    "speaker" : "Greg",
    "text" : "Well, no, I mean they had some good Bernie Kozar. Like you go I think before they came, whatever they call it when they is it an expansion? You know, that weird? Right."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:21-25:23",
    "text" : "A reintroduction, maybe. Yeah."
  },
  {
    "timestamp" : "25:23-25:25",
    "speaker" : "Steve",
    "text" : "Bernie Kozar was 500."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:26-25:27",
    "text" : "Yeah."
  },
  {
    "text" : "But didn't they use two games over 500? You know, Bernie Kozar was is 51% and Began Mayfield is 51. 2% winning percentage. So But like I'm just saying, the bar is real low.",
    "speaker" : "Steve",
    "timestamp" : "25:27-25:40"
  },
  {
    "text" : "Yeah, for sure.",
    "speaker" : "Greg",
    "timestamp" : "25:41-25:42"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so of those names you mentioned, Greg, um, that won more than six games. Uh only Brian Hoyer has a winning record, he's 10 and 6.",
    "timestamp" : "25:42-25:52"
  },
  {
    "text" : "No Brian. Love it. Oh, actually that's that's something funny too. I I saw a website that has it was 538 and they're talking about um they have this stat. Uh it's called yards above backup quarterback. So it's like it it takes it and it says like what your average backup quarterback would be, and like How many more yards is your starter outputting? So this is since 1999. This is written in 2018. So it's like 20 years of data. Okay. So first on the list, can you guess? Tom Brady. Tom Brady and the New England Patriots.",
    "speaker" : "Greg",
    "timestamp" : "25:52-26:39"
  },
  {
    "speaker" : "Andy",
    "text" : "So how do they figure that out when his backups never play?",
    "timestamp" : "26:39-26:43"
  },
  {
    "text" : "Well, they're just saying what an average backup. Oh backup. So yeah. So he's 21,000 yards more than an average backup. Colts are second because of Manning. Saints are third, Breeze, all the people you expect. Packers, Steelers.",
    "timestamp" : "26:43-27:00",
    "speaker" : "Greg"
  },
  {
    "text" : "Right.",
    "timestamp" : "27:00-27:00",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:01-27:15",
    "text" : "Um and then you get down to dead last, yeah, and their average Yards above a backup quarterback, negative two thousand eight hundred and five.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Average he averaged two thousand yards less. Oh over tw okay, all right.",
    "timestamp" : "27:16-27:24"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "27:33-27:55",
    "text" : "I just summed up uh the w records for Deshaun Kaiser. Um Cody Kessler and Josh McCown a total of 34 games they went one and thirty-three. And they're they weren't even like that far apart when they were playing either, you know?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:55-27:56",
    "text" : "Right."
  },
  {
    "speaker" : "Steve",
    "text" : "They're all within five years of each other.",
    "timestamp" : "27:56-27:59"
  },
  {
    "text" : "I believe I I can find it real quick. Yeah, there was a so the Browns from 2009 to 2017, over nine seasons, nine seasons, almost a decade. One thirty-four games. This 2003 and 2004 season, the Patriots will win 34 games. So in two seasons, in the 2003, 2004 seasons.",
    "timestamp" : "28:00-28:31",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "28:32-28:32",
    "text" : "Yeah, okay.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "The Patriots will win 34 games in those two seasons if you count the playoffs, right? Which is the same amount of wins the Brown Tad between 2009 and 2017. Almost an entire decade",
    "timestamp" : "28:33-28:44"
  },
  {
    "text" : "Yeeikes.",
    "timestamp" : "28:45-28:46",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "28:47-29:00",
    "speaker" : "Andy",
    "text" : "That's the difference we're talking about. So factory so like I said, we throw factory of sadness around. That doesn't begin to explain it. I just feel that people in New England need this sort of perspective right now. Mm-hmm."
  },
  {
    "text" : "Oh yeah, it's kind of ironic that we're discussing this now that The Patriots are all but eliminated from the playoffs.",
    "timestamp" : "29:00-29:08",
    "speaker" : "Greg"
  },
  {
    "text" : "And this is officially the first season the Patriots will not have At least tied for the best record in the AFC East since 2000 Two thousand the last time that happened.",
    "speaker" : "Andy",
    "timestamp" : "29:08-29:22"
  },
  {
    "speaker" : "Steve",
    "text" : "More ironic, tonight the the Cleveland Browns at nine and three play the Ravens, who we need the Browns to win the keys to the playoff.",
    "timestamp" : "29:23-29:30"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:32-29:35",
    "text" : "So this feels serendipitous, if you will."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:38-29:41",
    "text" : "If that's not uh 2020, then I don't know what is."
  },
  {
    "text" : "That's what I'm saying. Yeah. The Bills are and the uh Cleveland Browns are both nine and three. Are the Bills ten and three now, right? Might be. And the Cleveland Browns may also be ten and three after tonight. That's 2020.",
    "timestamp" : "29:41-29:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "29:57-29:59",
    "text" : "At least we can trust Jacksonville."
  },
  {
    "timestamp" : "30:00-30:07",
    "speaker" : "Andy",
    "text" : "That feels nice. There's there's some Yeah, there's some light, there's a rock in this this ocean of"
  },
  {
    "timestamp" : "30:07-30:08",
    "speaker" : "Steve",
    "text" : "Uncertainty."
  },
  {
    "speaker" : "Andy",
    "text" : "Uncertainty, exactly.",
    "timestamp" : "30:08-30:09"
  },
  {
    "timestamp" : "30:09-30:10",
    "speaker" : "Steve",
    "text" : "Yes."
  },
  {
    "timestamp" : "30:12-31:14",
    "speaker" : "Andy",
    "text" : "Speaking of uncertainty, these 2003 Cleveland Browns, all over the fucking map. Um When I was doing my my research for this, I found a uh a fun little anecdote for that just I think sums up the Cleveland Browns, not just necessarily in 2003, but generally. In week two before the game, the Browns were playing the Ravens and the Browns linebacker Andre Andra Davis and D R A Davis. Who was the leading tackler for this Cleveland Browns team with 138 combined tackles, 98 solo, which is kind of a lot. But he telephoned Ravens running back Jamal Lewis before the game and stated he wanted Lewis to carry the ball at least 30 times in their upcoming matchup. Quote, if that happens, it's going to be a career day, Lewis replied. And then Lewis erupted for 295 rushing yards, breaking the previous The record previously held by Corey Dillon as the Browns fell. 36."
  },
  {
    "text" : "I remember that. I remember that game.",
    "speaker" : "Greg",
    "timestamp" : "31:15-31:16"
  },
  {
    "speaker" : "Andy",
    "text" : "He ran for almost 300 yards. But not only that, the Browns defense called him up and be like, yo, carry the fucking ball, dickhead. He's like, okay. And ran with 300 yards on him. Dude, I dare you. That was week two. And this was actually like for the Browns, not their worst season. They went five and eleven. They went out with 16, didn't they?",
    "timestamp" : "31:16-31:39"
  },
  {
    "timestamp" : "31:39-31:46",
    "text" : "They won five games. That's not bad. Wait, did the Browns even out in six? No, I don't think they did, right? Not this year.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "31:46-31:48",
    "text" : "They did in like twenty seven.",
    "speaker" : "Greg"
  },
  {
    "text" : "Okay, yeah.",
    "timestamp" : "31:50-31:50",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, could well they it's huge accents.",
    "timestamp" : "31:50-31:52"
  },
  {
    "speaker" : "Andy",
    "text" : "You won one game over two seasons. Yes. Um but right uh in two thousand three they were coached by Butch Davis, who the Patriots um were origin were two and oh against Bush Davis Is that his real name? Um I didn't check. Yeah, I'm on on on Pro Football Reference Colin Butch Davis, but my guess is probably check.",
    "timestamp" : "31:56-32:16"
  },
  {
    "timestamp" : "32:16-32:20",
    "speaker" : "Greg",
    "text" : "I mean it's from Paul Hilton Butch Davis Jr."
  },
  {
    "timestamp" : "32:22-32:24",
    "speaker" : "Steve",
    "text" : "From Oklahoma and about the college from Arkansas."
  },
  {
    "text" : "Dude, Butch is such a kick-ass nickname. Is it though?",
    "timestamp" : "32:25-32:29",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. I don't know. From Oklahoma and go to college in our college.",
    "speaker" : "Steve",
    "timestamp" : "32:29-32:33"
  },
  {
    "text" : "I feel like if you're from Oklahoma, like everybody's nickname is Butch. And I think that that's just like for for the guys who are overweight in middle school. You know, you're just called Butch now.",
    "timestamp" : "32:33-32:44",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Do you know what my favorite nickname is? Uh fast Willie Parker. It's just the dumbest nickname. Yeah, it's not great. It's just describing Willie Parker. He's fast.",
    "timestamp" : "32:44-32:59"
  },
  {
    "text" : "Uh you don't like Erwin's Will Fork? No one called him that. He called him that. They had the t-shirts when he blocked the uh field goal.",
    "timestamp" : "33:02-33:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:11-33:13",
    "speaker" : "Greg",
    "text" : "Oh yeah, I remember that."
  },
  {
    "timestamp" : "33:13-34:06",
    "text" : "Uh we have Butch Davis. Um he was uh the Cowboys defensive coordinator for the two years before taking over the Cleveland Browns uh in 2001. And he kind of had a bit of a flash in the pan in 2002 when they went nine and seven. You know, that's when they they went to that playoff game, right? And Kelly Holkin had his yeah, had his uh at his career game. But then he would go 5 and 11 this year, 3 and 8 the year after that, and would not coach as a head coach in the NFL again. Some other good names in this coaching tree were Todd Bowles, who was the secondary coach of the nickel package Which I don't know how that's a so specific coaching position. Right, yeah. Um, but he was, you know, one of the many failed head",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Just call him what he is. He's an unpaid intern, okay? But even better.",
    "timestamp" : "34:07-34:11"
  },
  {
    "timestamp" : "34:12-34:44",
    "text" : "Where are we going with this, Andy? So well no, because it gets even better because his I guess boss, the the secondary coach, Chuck Pagano. So I think Todd Bulls learned a lot on this Cleveland Browns team on what not to do from Chuck Pogano. Although I never really saw Todd Bowles run any uh horrifically planned swinging gate punt formations. So He wasn't listening a lot. But yeah, Chuck Pogato, best known for ruining Prime Andrew Luck.",
    "speaker" : "Andy"
  },
  {
    "text" : "And they can say perfectly planned teams, which Yeah, no, he figured that out all by himself.",
    "timestamp" : "34:44-34:50",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "34:50-35:05",
    "speaker" : "Andy",
    "text" : "Um doesn't take a lot. But for some reason they the way they were talking about this Browns team was uh that they were actually kind of Good. Which surprised me because they were fine."
  },
  {
    "timestamp" : "35:06-35:07",
    "speaker" : "Steve",
    "text" : "Who were the commentators, Andy?"
  },
  {
    "speaker" : "Andy",
    "text" : "So the first the the literally the first shot of this YouTube video. is the heads of Dickenberg and Dan Dierdorf. And my first notes on this game were oh no. Just oh no",
    "timestamp" : "35:08-35:20"
  },
  {
    "speaker" : "Steve",
    "text" : "How many games do you think they've done and how many movies?",
    "timestamp" : "35:21-35:24"
  },
  {
    "speaker" : "Andy",
    "text" : "Most of the Patriots game. This is what I'm telling you. We're going to have a lot. I like it. Of Dan Deerdorf. Oh, you want more food talk, Steve? They're last fucking six weeks of of games. Like, oh well last week we're in we're we're doing the Packers game, so they fed us bratwurst in this week. Uh it was uh it was lobster rolls because it's New England and and they were hand delivered by Robert Krat. I don't fucking care. Holy shit. This game was boring enough already. You gotta sit here and listen to what Dan Deerdorf ate. Oh fuck it. Let's get into this.",
    "timestamp" : "35:25-36:01"
  },
  {
    "timestamp" : "36:02-36:04",
    "speaker" : "Greg",
    "text" : "Tell me tell me how you really feel, Andy."
  },
  {
    "speaker" : "Andy",
    "text" : "No, you you you starred this, so we're we're gonna get into this.",
    "timestamp" : "36:04-36:06"
  },
  {
    "speaker" : "Greg",
    "text" : "Andy, what did you have for dinner? It's you.",
    "timestamp" : "36:07-36:10"
  },
  {
    "text" : "I had I had I had just b hate. I hate my anger. Um but Dan Deerdorf, I think my problem with him is he tries to be clean, he's not an unusual concept in this game so far.",
    "speaker" : "Andy",
    "timestamp" : "36:12-36:23"
  },
  {
    "timestamp" : "36:23-36:31",
    "speaker" : "Announcer",
    "text" : "Someone threatening the goal line. That's for those of you that forgot in the first half, that's called a touchdown when they get across the goal line."
  },
  {
    "timestamp" : "36:34-36:36",
    "speaker" : "Greg",
    "text" : "Well it's funny because there's no touchdowns, Andy."
  },
  {
    "timestamp" : "36:36-36:51",
    "speaker" : "Andy",
    "text" : "It's not funny it's five minutes left in the middle. It's like that guy at work who's like Who wants to be the funny guy but has to try really hard and it just doesn't come off as funny. And I think that's what bothers me the most about him is he's trying really hard, but none of it lands."
  },
  {
    "timestamp" : "36:52-36:57",
    "speaker" : "Greg",
    "text" : "That's true. It is very workplace appropriate humor, which is the worst kind of humor."
  },
  {
    "text" : "Exactly. Yeah.",
    "timestamp" : "36:57-36:58",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:58-36:59",
    "text" : "Watered down.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "36:59-37:27",
    "speaker" : "Andy",
    "text" : "I mean, at least with Brent Jones, you get like you get football, not football, and Brent Jones being a fucking goober. And that I can deal with, you know, it's like, all right, he's whatever, you know, or Joe Thizeman like walking that line of, yeah, this is borderline appropriate. I want to kiss you, Susie. I think that we might actually get to that game soon. But is that a Patriots game? That wasn't Joe Thysman. That was um"
  },
  {
    "timestamp" : "37:28-37:29",
    "speaker" : "Greg",
    "text" : "That was Broadway Joe."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "37:29-37:29"
  },
  {
    "timestamp" : "37:30-37:36",
    "speaker" : "Greg",
    "text" : "Oh he was ship faced. Yeah. Yeah. So"
  },
  {
    "text" : "Damn fucking Deerdorf.",
    "speaker" : "Andy",
    "timestamp" : "37:38-37:39"
  },
  {
    "timestamp" : "37:39-37:56",
    "text" : "I'm surprised they don't say more like, well, I don't know, you guys will have to tell me. Do they say like problematic stuff? Cause a lot of like, you know, humor has you watch movies from this time era and you're like, whoa, baby, like you ain't getting away with that today.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, it's not that bad, but there's a lot of like Like poor Bonnie Bernstein in this. Uh they call her B squared, which I think is actually kind of a cool nickname.",
    "timestamp" : "37:56-38:06",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "38:06-38:07",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "But they just kind of like talk down to her the entire time. Every time they throw it down to her, they just kind of like talk down. Like she had this cool hat on. And so they cut to her and like she says something actually interesting and meaningful. And then they cut back to the the booth and the guy's like, oh Dan Deere was like, oh yeah I think that hat will look good on me And Dick Ember's like, no, drop it. Like, this isn't funny. Like, just leave this alone. And he just wouldn't. Like, because fucking he's a fucking meathead.",
    "timestamp" : "38:07-38:34"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "38:35-38:39",
    "text" : "Oh thanks, white knight and for bee squared over here."
  },
  {
    "timestamp" : "38:39-38:44",
    "text" : "Ah, B Square can handle our own, but like fuck Something else to shit on Dan.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "She's abroad, Andy. You know they don't know.",
    "timestamp" : "38:44-38:46"
  },
  {
    "speaker" : "Andy",
    "text" : "That's exactly what Dan Dieror would call her. You call her abroad. Not that he would know, because his fucking nose abroad. She knows football.",
    "timestamp" : "38:46-38:54"
  },
  {
    "timestamp" : "38:55-38:57",
    "speaker" : "Greg",
    "text" : "It's a man's game."
  },
  {
    "timestamp" : "38:58-39:12",
    "speaker" : "Andy",
    "text" : "Yeah, so fuck Dan Deerdorf. So that was the fuck Dan Deerdorf uh segment of this podcast. Um yeah. There you go. Brief applause from the crowd. Oh, you want a longer?"
  },
  {
    "text" : "Yeah, fuck him. Yeah, yeah, fuck that guy. No, he's a beach.",
    "timestamp" : "39:15-39:19",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "39:20-39:54",
    "text" : "That's what Dan Dr. needed a fucking laugh track. Um I did since we're since we're gonna uh there's really nothing to talk about in this game because like I already said it went Punt field goal, punt, punt, punt, punt, punt, punt, punt. Um and then the Patriots moved the ball. Brady got sacked on third down. Adam kicked a field goal, but it was a false start. So they moved him five yards back and he missed it. Cleveland kicked a field goal and that's the first half. 3-3. So there's like nothing else to talk about.",
    "speaker" : "Andy"
  },
  {
    "text" : "Well, there's one other player I can think of. Well they're they're missing their best player. Who is? Cleveland. Kelly Holcomb. Willie Green. Willie Green. They were He's a PC product.",
    "speaker" : "Greg",
    "timestamp" : "39:54-40:08"
  },
  {
    "speaker" : "Steve",
    "text" : "No, I don't remember him at all.",
    "timestamp" : "40:09-40:10"
  },
  {
    "speaker" : "Greg",
    "text" : "Was he really?",
    "timestamp" : "40:10-40:11"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:11-40:20",
    "text" : "He was. I recognize the name, but I would I was I used to be hyped on William Green. That might be why I remember him, because I remember you hyping up."
  },
  {
    "timestamp" : "40:20-40:47",
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. He was uh he was a first team All-American at BC. Oh shit. And he he was uh he was pretty good. And uh remember that that scrapbook thing I have? Yeah. I actually was doing it for the Patriots and Boston College at the time. That's right. fandom of Boston College until I realized it wasn't worth it. And I was a big Willie Green Stan."
  },
  {
    "speaker" : "Andy",
    "text" : "I wonder if a lot of uh Brown scarat books on that way too.",
    "timestamp" : "40:48-40:51"
  },
  {
    "text" : "Yeah. Yeah. Fuck this. Uh but he was a good player. At least in college he was.",
    "speaker" : "Greg",
    "timestamp" : "40:51-41:01"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:01-41:15",
    "text" : "Yeah, he only played in seven games this season. Uh due to injury, but he still had the team in Russian with 559 yards. But he didn't I mean uh he had the misfortune of being drafted by Cleveland, right?"
  },
  {
    "timestamp" : "41:15-41:23",
    "speaker" : "Greg",
    "text" : "So yep. Yeah. He was a first round pick in two thousand and two. Sixteenth overall."
  },
  {
    "timestamp" : "41:24-42:08",
    "text" : "Played four seasons with him. Ran for about 500 yards a season, give or take. 2100 yards per yeah So not great. I wonder it just makes you wonder like would any of these players drafted to these um factories of sadness, would they have been like the next phenom if they had been put in a different position? Definitely. Like if Willie if Willie Green got drafted by the Chiefs instead. And ended up sitting a couple years behind Priest Holmes. Then Priest Holmes goes down and now all of a sudden it's Willie Green's turn. Does he run for a thousand yards? Does he run for sixteen hundred yards in a season?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "42:08-42:25",
    "text" : "I mean we talked about the Broncos and put anybody back there and they'd be successful, right? Right, yeah, yeah. You can't you can't draft seven quarterbacks in the first round in like 14 years and say every single one of those players is the problem. At some point it's not players. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "But it's interesting that none of them really went anywhere else and did anything good. It's almost like once you're ruined in the NFL, you're ruined. factor in it. Josh.",
    "timestamp" : "42:25-42:38"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:39-42:57",
    "text" : "And I think running backs especially too, just because their their careers are so short in that position, like you're getting four years tops maybe, right? And then you've run ragged. And it's not like you're not playing, so it's not like you can save yourself for a different team. Who is like who bucks that trend?"
  },
  {
    "timestamp" : "42:57-43:02",
    "text" : "Who's the quarterback that was highly touted, sucked, went somewhere else, and then was super good?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Drew Brees. Did he suck though? He was not great in San Diego. I mean they they literally got rid of him for um what's his name Phillip Rivers and just let him walk",
    "timestamp" : "43:02-43:15"
  },
  {
    "timestamp" : "43:16-43:33",
    "speaker" : "Greg",
    "text" : "I would like more recently, Jared Goff. I mean, he didn't change teams, but they had a new coaching staff for that first year. I was ready to call him a bust. I was like, this dude blows. And then, you know, McVeigh comes in and he really turned his career around. That's valid. That one really surprised me."
  },
  {
    "text" : "I was like, well, I didn't see that coming.",
    "speaker" : "Steve",
    "timestamp" : "43:33-43:34"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "43:34-43:35",
    "text" : "I know it is."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:35-44:03",
    "text" : "Sam Darnold. Goes the Patriots. Leads us to like three more Super Bowls next time. That would be amazing. Classic Jets. That would be amazing. Because they're the same type of organization right now where they're just just chewing people up and they're sitting here being like, oh, Trevor Lawrence, he's gonna fix everything. And it's like, you know what? You might have deeper problems than just We're one quarterback away from it, you know?"
  },
  {
    "timestamp" : "44:03-44:08",
    "text" : "Yeah, I think but even there's transcend transcendent quarterbacks can do it though.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "44:08-44:11",
    "speaker" : "Steve",
    "text" : "Well Ryan Lee was supposed to be transcendent, you know?"
  },
  {
    "timestamp" : "44:11-44:16",
    "speaker" : "Greg",
    "text" : "Yeah, but like Joe Burrow did it this year with Cincinnati. He kept him in games."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "44:16-44:18",
    "text" : "Yeah, but Andrew Luck did it."
  },
  {
    "timestamp" : "44:19-44:23",
    "speaker" : "Greg",
    "text" : "He went on to a one in fifteen Colts team and the next year they're like in the playoffs. Good point."
  },
  {
    "timestamp" : "44:23-44:28",
    "speaker" : "Steve",
    "text" : "I feel like even the Colts had a little bit more like a few years. It's true. Yeah, the Colts had more stuff around them."
  },
  {
    "text" : "Yeah, because they had already built that system around Peyton Manning and they basically just like suck for year and then plug Daniel Luck into that.",
    "speaker" : "Andy",
    "timestamp" : "44:29-44:35"
  },
  {
    "text" : "That's my point of like the Jets organization as a culture is what the Browns I mean Browns have actually sort of pulled themselves out of it a little bit.",
    "speaker" : "Steve",
    "timestamp" : "44:35-44:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Finally. But yeah, you can say the same with the lions too. Like the lions do the same shit all the time as well. Yeah. Because it is a bit of a culture of losing. Not that we know what that's about.",
    "timestamp" : "44:43-44:52"
  },
  {
    "text" : "No idea.",
    "timestamp" : "44:53-44:54",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:54-45:57",
    "speaker" : "Andy",
    "text" : "Speaking of losers, head referee in this, Bernie Kukar, not a loser. No. You didn't think I was going there, did you? No. No, you didn't. Uh but I was very excited about how much effort he put into his hand gestures for uh calling penalties. And especially when he called uh drop blocks, he called it twice. He called choplock twice, which I haven't seen like ever. The chop block is where you kind of like cut your arms down to your thighs. And he was wailing on his thighs. Like he did the first time. Like, I actually wrote down. I'm like, bet he's got bruises on his thighs from that chop block call. And then he had to do it again. I'm like, boy, he's gonna have to ice those thighs. Because he's such a fucking hardow calling goddamn chop block. He was giving it his all. He's like, I don't care if this is a nine to three Patriots fucking Brown slug fest. I'm gonna be the star of this show. I'm gonna put my all into it. And he showed up for all four quarters, 60 minutes, had himself a game."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "45:57-46:00",
    "text" : "He's just making sure the people in the upper decks know what's going on."
  },
  {
    "text" : "Well, they knew they could they could hear the s the thigh slaps of the Of the uh the calls.",
    "timestamp" : "46:01-46:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:07-46:24",
    "text" : "That could only be a chop block. Yeah. I can't quite see what he's saying, but I heard the slap, so they must have called chop block. It wasn't a slap block, it was a chop block. Oh, he was chopping away at them thighs. I can't wait till we get to replacement ref season. That was the best.",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh, that's good.",
    "timestamp" : "46:25-46:25",
    "speaker" : "Andy"
  },
  {
    "text" : "Pretty forgotten about that. See, that's what people don't understand is these guys are the best in the world at their job. And they're but they're part-time at it though. Yeah, but they're still the best in the world. These guys are like legit, they're like lawyers, they're all they're not dummies",
    "timestamp" : "46:26-46:42",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. They're better than you or I could ever do in a million years. Well they're not getting paid like fifteen bucks an hour either at part.",
    "speaker" : "Steve",
    "timestamp" : "46:42-46:49"
  },
  {
    "text" : "time like yeah that's true part time but they're getting they're getting compensated pretty well yeah but they're not doing a lot like like this isn't their full-time job they're not like watching film and they're off days you know they're just like showing up and they know the rules and they call them as they see it. But they're uh they're as good as you can get. I don't know if I agree. I bet I bet there's some college refs that are better, they just don't get the chance 'cause of seniority. You know what I mean? I bet there's some guys that like would do it full time or like gung-ho. I mean there's guys like that in every case, right? Like this thing is like the Steve Brown of yo-yos. There's definitely some guy out there who's like I I fucking practice refereeing in my in my free time when I'm not working at whatever the fuck my job is where I'm watching film and seeing what calls the referees missed, you know. Terrible analogy because Steve Brown's job is yo-yo.",
    "speaker" : "Andy",
    "timestamp" : "46:49-47:34"
  },
  {
    "text" : "E-Brown is like the grandmaster of yo.",
    "timestamp" : "47:34-47:36",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "47:36-47:37",
    "speaker" : "Greg",
    "text" : "Yo-Yo is life."
  },
  {
    "speaker" : "Steve",
    "text" : "He's the referee. And for my final point, even if those good college refs did make him the NFL, you'd still hate them, Andy.",
    "timestamp" : "47:38-47:46"
  },
  {
    "timestamp" : "47:46-47:52",
    "text" : "Yep. I I don't I don't hate this guy. You're just saying that to try to hate Bernie Kukar.",
    "speaker" : "Andy"
  },
  {
    "text" : "It's not gonna fool me and Greg. We know you too well.",
    "timestamp" : "47:53-47:55",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah I hate I hate to tell you when they call it too tight. That's my issue.",
    "speaker" : "Andy",
    "timestamp" : "47:55-48:00"
  },
  {
    "text" : "You gotta let them play. Andy, when when it smells like dog shit everywhere you go, maybe you should try looking under your own shoe. Okay. Fuck it.",
    "speaker" : "Greg",
    "timestamp" : "48:01-48:10"
  },
  {
    "timestamp" : "48:10-48:22",
    "speaker" : "Steve",
    "text" : "yourself. Or your nose. I don't know. Next you can be like, well, you know, he's not that bad. He's he's trying his best. You know, he's just commentating as good as he can. He's in the hall of fame."
  },
  {
    "speaker" : "Andy",
    "text" : "No. No.",
    "timestamp" : "48:22-48:24"
  },
  {
    "text" : "Absolutely not. I will admit that Dan Diedorf sucks at his job. He's so bad. Like I I maybe he was better before.",
    "timestamp" : "48:25-48:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:36-49:15",
    "text" : "2000. Like the two maybe he's been doing it for years. I don't know when he started. Maybe this was like his senile days, you know what I mean? Because everybody's have I mean, who's uh Dan Fouts at the end too? You know, everybody's like fucking everybody hates Dan Fouts at the end because he fell the fuck off. And uh You know, even uh you could even make an argument, I'm not going to make it, but I've heard some people say the same thing about like um Gil Santos and Gino Capoletti at the end there. They were kind of like missing plays and things like that. But I I think Dan Deerdorf is a whole a whole another level of suck."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he's just uh it's not even his commentating, it's just his personality. Yeah. I think you're right about the biggest thing. Yeah. Yeah. But there's a ton of guys that are bad that you're like, whatever. You know, it's like",
    "timestamp" : "49:16-49:30"
  },
  {
    "timestamp" : "49:33-50:12",
    "speaker" : "Andy",
    "text" : "But he's just get used to because it's like dope. You know you're watching like some like middle of the road teams that are getting the the the JV team. It's like, yeah, right, fine, whatever. I'll just kind of tune you out more than anything, but the problem and the problem with this is that it was always Dan Deardor for the Patriots games for some reason. And so you just hurt him so much and he was so bad every time. That's why that's where the hatred comes from. It wasn't just like an on-off switch. This has been A rock that's been ground down. That used to be my heart, and it's just it's slowly calcified over the years. That spot for Dan Deerdorf."
  },
  {
    "text" : "I think we need to get you into therapy, Andy.",
    "speaker" : "Greg",
    "timestamp" : "50:13-50:16"
  },
  {
    "text" : "Yeah. What do you think this is? This is my therapy.",
    "timestamp" : "50:16-50:18",
    "speaker" : "Andy"
  },
  {
    "text" : "We'll have the first session at the NFL Hall of Fame. Where you can go to Dan Diodore's bust and just yell at him.",
    "speaker" : "Steve",
    "timestamp" : "50:20-50:27"
  },
  {
    "timestamp" : "50:28-50:29",
    "text" : "Just slap it around a bit.",
    "speaker" : "Andy"
  },
  {
    "text" : "Love it. Well, which Hall of Fame? He's in a bunch of Hall of Fames. Multi-Hall of Fame.",
    "speaker" : "Greg",
    "timestamp" : "50:30-50:35"
  },
  {
    "timestamp" : "50:40-50:52",
    "speaker" : "Andy",
    "text" : "Oh, god damn it. Um But speaking of bizarre incidents, I'm pretty sure we brought that up at some point. Uh they made a mention of Kenyatta Jones."
  },
  {
    "text" : "Wait, wait, wait, wait, wait before we move on. Sorry to bring you back to Dan Deer, Fandy. And really what a great transition. The 2008 recipient of the Pro Football Hall of Fame's Pete Roselle Radio Television Award. The award given annually recognizes longtime exceptional contributions in radio and television in professional football.",
    "speaker" : "Steve",
    "timestamp" : "50:52-51:11"
  },
  {
    "speaker" : "Andy",
    "text" : "You know who gives that out? People who don't listen to the fucking commentation of the games for the past eight years.",
    "timestamp" : "51:12-51:17"
  },
  {
    "timestamp" : "51:17-51:19",
    "speaker" : "Greg",
    "text" : "Who do you who gives it out then, Andy?"
  },
  {
    "timestamp" : "51:20-51:22",
    "speaker" : "Andy",
    "text" : "That's what I'm saying. People who don't listen to fucking games."
  },
  {
    "text" : "Obviously, I'm extremely flattered on many levels. State of Deardorf. First of all, because my close relationship with the Hall of Fame, you know, because he's a big Hall of Fame, but he's in the Hall of Fame. All right, hang on. I just need to go and then he continues on also I knew Pete Rosell",
    "speaker" : "Steve",
    "timestamp" : "51:23-51:37"
  },
  {
    "timestamp" : "51:37-51:50",
    "speaker" : "Andy",
    "text" : "I just I just need to Google real quick how to kick somebody out of a Zoom meeting. This is getting out of hand. He actually grew up near the Hall of Fame. That's why he has such a such a what?"
  },
  {
    "text" : "Finish that sentence. It's better. Dude have noted he has worked on radio or television with six previous winners. Jack Buck, Dick Edinberg, your buddy. Frank Gifford, Lindsay Nielsen, Ray Scott, and Leslie Vissler.",
    "speaker" : "Steve",
    "timestamp" : "51:50-52:07"
  },
  {
    "text" : "Leslie Nielsen from Nielsen Ratings.",
    "speaker" : "Greg",
    "timestamp" : "52:07-52:09"
  },
  {
    "text" : "So do they have um like different wings of of this commentation hall of fame? Like um The because I I think Dick Eng Enberg would be in there for um most miscalled um players by number. Or misrecognized players by number?",
    "speaker" : "Andy",
    "timestamp" : "52:10-52:28"
  },
  {
    "timestamp" : "52:28-52:30",
    "text" : "They don't give stats on that, Andy. Get real.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "52:31-52:34",
    "text" : "You know what? Maybe we'll start. We'll start a new website.",
    "speaker" : "Andy"
  },
  {
    "text" : "Tell you what, Andy, it may if it makes you feel any better, he's from Canton, Ohio, which is where the Hall of Fame is, and is an inside job, what you're saying. So he's probably a proud.",
    "speaker" : "Steve",
    "timestamp" : "52:34-52:46"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:46-52:50",
    "text" : "It's home cooking. Oh, that's even off as a Browns fan."
  },
  {
    "text" : "You've gotta be from Canton, you gotta be a Browns fan.",
    "timestamp" : "52:50-52:53",
    "speaker" : "Steve"
  },
  {
    "text" : "No, I I he's one of those assholes like I'm I'm a football fan because I'm from Canton, so I'm all about the Hall of Fame. I'm just I'm just in it for the good players and the good plays. He's that asshole. 27 years calling games. See, so maybe he was at the hit the end of his his rope there. Maybe the first 20 were fine and we're just getting the last",
    "speaker" : "Andy",
    "timestamp" : "52:54-53:14"
  },
  {
    "text" : "No, he says 10 more years. I got nothing. 87th of 2013.",
    "speaker" : "Greg",
    "timestamp" : "53:14-53:21"
  },
  {
    "speaker" : "Andy",
    "text" : "You're not gonna talk me off of this this hill. Like I will die on this hill.",
    "timestamp" : "53:22-53:26"
  },
  {
    "text" : "You go well let's actually let's explore that a little bit because Dan's hospital named after Dan Deerdorfit.",
    "speaker" : "Steve",
    "timestamp" : "53:26-53:33"
  },
  {
    "timestamp" : "53:35-53:42",
    "text" : "I guarantee all the signs in that are pointing in the wrong direction. That are mislabeled. Everything's mislabeled.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "53:43-54:01",
    "text" : "He's in the College Football Hall of Fame, Pro Football Hall of Fame, Michigan Sports Hall of Fame, St. Louis Walk of Fame. And Arizona Cardinals Ring of Honor, Andy. What do you got on your resume? Uh I'm in the Dan Deerdorf Hader Hall of Fame."
  },
  {
    "speaker" : "Andy",
    "text" : "How about that? That's true, you are. Speaking of assholes, other than my brothers, they were talking about Kenyatta Jones in this game and how he's no longer a P.",
    "timestamp" : "54:01-54:14"
  },
  {
    "speaker" : "Steve",
    "text" : "Yes, I looked this up.",
    "timestamp" : "54:14-54:16"
  },
  {
    "speaker" : "Andy",
    "text" : "So did I. They will they released him after a quote unquote bizarre incident, according to B Squared. And so what happens is It's kind of weird and there's not like I did some Googling. There wasn't a ton of information about it.",
    "timestamp" : "54:16-54:34"
  },
  {
    "timestamp" : "54:34-54:54",
    "speaker" : "Steve",
    "text" : "Is it more bizarre than Chandler Jones showing up naked to a channel level? Okay. So the Redskins in classic Redskins moves said wait. This yeah, I know your name. Even though you just had surgery on two knees"
  },
  {
    "text" : "Wait, let me read this first and then you can go into your Redskins rant because you're dead on. But um So so this is I think maybe the same article that you you found. Um, but it's it says this quote, Jones pleaded no contest, this Kenyatta Jones pleaded no contest to one account of assault and battery with a dangerous weapon. and was issued a continued without a finding ruling in April after he threw hot water on roommate Mark Paul. If Jones does not violate his one year probation, the case will be dismissed. Paul who suffered second and third degree burns was sitting on the toilet when he was hit by w the water. Jones described the incident as a prank gone awry, and said he thinks Paul exaggerated the nature of the altercation for possible financial gain. I was tormented because of a friend and it was a lesson learned, a hard lesson learned, but hey, we all have to learn, Jones said. And basically.",
    "timestamp" : "54:56-55:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "55:47-55:56",
    "text" : "Wait, I got one more quote. I'm glad it happened the way it happened because I could have been a more wealthy guy and he could have went for more than what he went for."
  },
  {
    "text" : "No, Greg, it it was. He he threw tea on his roommate who was sitting on the toilet and it barned him. It was a prank gone awry. And the prank was I'm throwing T on you while you take a fat dump.",
    "timestamp" : "55:58-56:14",
    "speaker" : "Andy"
  },
  {
    "text" : "It's gotta be around the time when Jackass came out, right?",
    "speaker" : "Greg",
    "timestamp" : "56:15-56:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:18-56:27",
    "text" : "And then oh probably. Yeah, Jackass was like 2000, 2001. Yeah. Uh so to this point. Yeah, the Redskins looked at that and thought, yeah, that's our guy."
  },
  {
    "timestamp" : "56:29-56:30",
    "speaker" : "Steve",
    "text" : "Double knee surgery."
  },
  {
    "speaker" : "Andy",
    "text" : "It's Johnny Knoxville. Yeah, no, he he hadn't actually played any games for the Pages because he was yeah, he was recovering from knee surgery. Yeah. On both. So I mean, I think you both remember my jackass days where we me and uh Milo stole mom and dad's video camera and filmed us doing stupid shit. But it was never like throwing scalding hot tea at each other while we're on the toilet, though. What did you do? Can you do you remember them? Um I d the one that I do remember was uh actually you guys were in it when we had the that huge snowstorm and we had the snowbanks piled up wicked high and so we rode our bikes as fast as we could into the snowbanks and hit them and flipped forward over into the snow. Remember that?",
    "timestamp" : "56:30-57:15"
  },
  {
    "timestamp" : "57:15-57:17",
    "speaker" : "Greg",
    "text" : "Jack is right."
  },
  {
    "text" : "But that well the thing is so wild. We recorded that, right? And then I used the camera to record a um a school project on the same tape because it was tape back then so you had to like reuse the tape and it just worked out so that like I re-recorded the project and then the next then it cut to us doing that. And so I finished my project and you know we we play it. I didn't realize that so I just played it and then like I didn't stop it in time. So all of a sudden like there was this like serious project of us doing I don't know Spanish project or whatever. And all of a sudden it cuts the three of us riding our bikes full speed into snowbanks, slipping over, and giggling to ourselves hysterically.",
    "timestamp" : "57:17-58:00",
    "speaker" : "Andy"
  },
  {
    "text" : "You did that on purpose.",
    "timestamp" : "58:00-58:02",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "58:02-58:04",
    "text" : "I wish I did. That would have been great.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I think you did it on purpose. Maybe even subconsciously.",
    "timestamp" : "58:04-58:07"
  },
  {
    "text" : "You don't think I would have I you don't think I would have uh claimed that I did that on purpose That would have been that would have been too perfect.",
    "timestamp" : "58:08-58:13",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "58:13-58:33",
    "text" : "You've been like you were like, oh man, this was so sick, this jackass video. I'm so badass. The whole class is gonna love this. Yo, and then Get the mops out because chicks are gonna be so wet. We're bringing extra towels to s La clase de Espanol."
  },
  {
    "timestamp" : "58:36-58:43",
    "speaker" : "Steve",
    "text" : "Somebody had give the janitor a heads up. Yeah. We're showing the bike flipping video."
  },
  {
    "speaker" : "Greg",
    "text" : "Bring your mopping bucket boys. Every every kid like our age. Did homemade jackass videos?",
    "timestamp" : "58:44-58:52"
  },
  {
    "text" : "Oh yeah. And honestly, I can almost sort of understand Kenyatta Jones while you we can sit here and be like, that's really fucking stupid. So is a lot of shit that Jackass did and even like today's day and age is so much really dumb shit that Yeah, Tide Pods. Yeah. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "58:53-59:10"
  },
  {
    "speaker" : "Greg",
    "text" : "Like is that any worse than throwing tea on your buddy?",
    "timestamp" : "59:10-59:13"
  },
  {
    "timestamp" : "59:13-59:14",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "text" : "Well usually you're you're ingesting TIP pods yourself, so you just do that to yourself. But like hot teons, that's people like especially team pods. I just don't want to say it like it was supposed to be funny though. Like how is that Funny.",
    "timestamp" : "59:14-59:24",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "59:25-59:26",
    "speaker" : "Greg",
    "text" : "There might be more to it."
  },
  {
    "timestamp" : "59:26-59:27",
    "speaker" : "Andy",
    "text" : "Maybe."
  },
  {
    "speaker" : "Greg",
    "text" : "Maybe he had like Greg, make that funny for me. That's what I think. Okay. All right. He had peed in the tea mug. Put boiling hot water in it and then splashed it right in the guy's face. No, no, he made tea out of poop.",
    "timestamp" : "59:27-59:42"
  },
  {
    "timestamp" : "59:45-59:49",
    "text" : "I feel like that would have come out in the court proceedings. That would have come out in the findings.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. I feel like it would be a net you a higher charge",
    "speaker" : "Steve",
    "timestamp" : "59:49-59:53"
  },
  {
    "text" : "Well and to be fair, his Wikipedia here says in 2008, Jones was arrested outside a Tampa nightclub after attempting to urinate on the dance floor and then shoving the off-duty police officer who threw Jones out of the establishment.",
    "timestamp" : "59:54-01:00:07",
    "speaker" : "Greg"
  },
  {
    "text" : "Well, I mean everyone's been there. Yeah.",
    "timestamp" : "01:00:07-01:00:09",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh yeah. I mean we've all tried to pee on the dance floor, right? Yeah. Cause I mean you're dancing and you and you've been drinking, so you have to pee and You don't want to stop dancing because that there's no point in that. You're already out there. So you may as well just let her loose. I get that.",
    "timestamp" : "01:00:10-01:00:23",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "And who's this fucking jerk off trying to kick me out of here? He's too funny. Oh yeah, no, you're a cop. I'm a cop too. We're all cops. Show me your badge, dick ed. Exactly.",
    "timestamp" : "01:00:23-01:00:34"
  },
  {
    "text" : "You know where I bet that happens all the time.",
    "speaker" : "Steve",
    "timestamp" : "01:00:34-01:00:36"
  },
  {
    "timestamp" : "01:00:36-01:00:38",
    "speaker" : "Andy",
    "text" : "Show you my badge, you just pee on the guy, you know?"
  },
  {
    "timestamp" : "01:00:38-01:00:43",
    "speaker" : "Steve",
    "text" : "And they're They mentioned it in this uh game, the world's largest cocktail party."
  },
  {
    "text" : "Oh yeah, where was that? I don't remember.",
    "timestamp" : "01:00:44-01:00:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "What's that? It is the Florida Georgia game. That's right, yeah. That happens in Jacksonville. I'm pretty sure every year.",
    "timestamp" : "01:00:45-01:00:55"
  },
  {
    "speaker" : "Andy",
    "text" : "You have to prepare, you have to get a running start or something three days before?",
    "timestamp" : "01:00:56-01:01:00"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:01:00-01:01:11",
    "text" : "It's just apparently like I think college football is known for Not selling booze in the stadium. I found this out a couple years ago actually. They don't sell booze inside college football stadiums."
  },
  {
    "timestamp" : "01:01:11-01:01:12",
    "text" : "Right.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "A majority of them, vast majority. So everyone It just blacks out in the parking lot. Oh, is allowed and therefore it's got two of like the biggest party colleges in the South and they just get together and everyone just gets super duper bamboozled. And they literally mark it as the world's largest cocktail party. Not only like still today.",
    "timestamp" : "01:01:12-01:01:45"
  },
  {
    "timestamp" : "01:01:45-01:02:01",
    "speaker" : "Greg",
    "text" : "Yeah, not for long. You know what they do at NC State is they don't well, they just started selling beer this year, but They would let you leave at halftime and then get you you had re-entry into the stadium."
  },
  {
    "text" : "That seems dangerous.",
    "speaker" : "Andy",
    "timestamp" : "01:02:02-01:02:03"
  },
  {
    "text" : "If you don't do that because so many people were blacking out. going into the game because they're like, I just gotta drink enough to last me these four hours. They just have tons of blacked out kids. So they're like, hey, hey. Blackout at halftime. Yeah. Yeah. And I I bet a ton of people don't come back too, right?",
    "timestamp" : "01:02:05-01:02:24",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I bet that's what it is. Yeah.",
    "timestamp" : "01:02:25-01:02:25"
  },
  {
    "timestamp" : "01:02:25-01:02:27",
    "speaker" : "Greg",
    "text" : "Yeah. They're like, oh, we're getting blown out. Let's get out of here."
  },
  {
    "timestamp" : "01:02:28-01:02:30",
    "text" : "Yeah, but the stadium doesn't give a shit because they don't have to deal with that.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, and they already bought their tickets, so fuck it, right?",
    "timestamp" : "01:02:30-01:02:33"
  },
  {
    "text" : "Right, exactly. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:02:33-01:02:34"
  },
  {
    "speaker" : "Greg",
    "text" : "So ridiculous.",
    "timestamp" : "01:02:34-01:02:35"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:02:35-01:02:36",
    "text" : "Money's in the bank."
  },
  {
    "speaker" : "Greg",
    "text" : "Yep.",
    "timestamp" : "01:02:36-01:02:37"
  },
  {
    "speaker" : "Andy",
    "text" : "Um, speaking of ridiculous. There was a not necessarily a quote, but they were talking about Butch Davis and why the um why he thought the Browns were better on the road because they were actually seven and one in their last eight-row games coming into this game. So I think that's why the spread was only passed by four and a half. So basically like plus one and a half over the the home field advantage, right?",
    "timestamp" : "01:02:38-01:03:01"
  },
  {
    "speaker" : "Steve",
    "text" : "Right.",
    "timestamp" : "01:03:02-01:03:02"
  },
  {
    "text" : "And it was um it's because they don't get booed as much on the road.",
    "timestamp" : "01:03:03-01:03:07",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. Well Tim Couch, remember we said he'd got booed for Or you remember we were saying he was crying? Yeah, that's a mistake. They booed his head injury. Yeah. Yeah. So um And the the title of this story is Angry Couch Fires Back at Fans. Pissed off sofa.",
    "timestamp" : "01:03:08-01:03:29",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:33-01:03:38",
    "text" : "Wow, this time it's not the f the the couch getting caught on fire. It's the couch giving fire."
  },
  {
    "text" : "I mean honestly I can definitely get to the couch. Fuck that shit. Oh yeah.",
    "timestamp" : "01:03:38-01:03:42",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:03:42-01:03:59",
    "text" : "Do you want to hear his quote? Yeah. I've been in this city four years now and I've laid it I've laid it all on the line. For them to turn on me and boom me, it's a joke. It's a fucking joke. I'm lying in the end zone hurt and they're cheering. That's bullshit. That's fair. Yeah, that's totally fair.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Having said that, um they made a uh a comment about how Tim Couch had a black eye in this game. And it was because a couple weeks before, or actually it was the week before, um, and I had to like I just want to put this out there, uh fuck the Sun Journal, sunjournal. com. for making me have to hack their site just to read this shitty article from two thousand.",
    "timestamp" : "01:04:00-01:04:23"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, dude. Nothing makes me more mad than these fucking sites that",
    "timestamp" : "01:04:24-01:04:29"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. So you go there and and it shows you the article first and then it puts a pop-up. It's like, oh, you have pop-up blockers on. So you turn that off so we can make our money on ads. So I turn it off. I'm like, fine, whatever, great. So I turn it off and then it pops up another one after that saying uh subscribers to our to to our newspaper can read articles like this for five bucks a month. Like no, I I saw that you showed me the article, so I had to go fucking hack it and copy it and put it in a word doc. So fuck them. But the the title of it is Another Black Eye for Browns, Couch Browns quarterback Tim Couch had a nasty black eye on Monday. The San Diego Chargers left a much deeper mark. Couch's right eye was still swollen and shaded in hues of black, blue, and purple, the result of a pregame collision he said happened with an unidentified teammate on Sunday. So he uh but even before the game started, he ran to his own teammate and gave himself a black eye and then came out and um Put up a 30. 2 quarterback rating against the Chargers. The third worst of his career. Um, and so that's why uh with Holcomb improving, uh getting healthier, he uh Wasn't sure he was even gonna start. And apparently Butch Davis did wasn't sure that he was gonna start until they made the decision at like noon on game time, an hour before the game started. Not great. Um, but Tim Couch did get the start. Um didn't play well Uh but he was taking a lot of hits. Like a lot of hits. Brown's quarterback, I feel like, always take a lot of hits. This was no different because they said something about how the offensive line Only the right tackle had started double digit number of games. And everybody else.",
    "timestamp" : "01:04:30-01:06:18"
  },
  {
    "speaker" : "Steve",
    "text" : "I feel that's how the Browns have gotten out of their Current they're they're funk with bakers. I don't think Baker is significantly better than those other guys, but they like finally figured out that we need to get in more than build an offensive line. We got Joe Thomas, we're good in the L line.",
    "timestamp" : "01:06:19-01:06:33"
  },
  {
    "text" : "Yeah. So yeah, and against this pages defense, these guys were getting eaten for lunch. Rabel had three sacks, a couple of strip sacks.",
    "timestamp" : "01:06:34-01:06:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Richard, Big Richard had this like the OG Gronk spike after that fumble recovery.",
    "timestamp" : "01:06:44-01:06:49"
  },
  {
    "timestamp" : "01:06:49-01:06:50",
    "speaker" : "Andy",
    "text" : "Yep. He did."
  },
  {
    "timestamp" : "01:06:51-01:06:51",
    "text" : "Big fan of that.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Um but then Tim Couch actually got hurt halfway through the first half. Uh the Brown, he hadn't done anything. And then Kelly Holcomb came in and immediately led them down the field on the last drive of the first half. And uh the kicker field goal, the tied at three. Um, but the one other play that I think was worth talking about in the first half was in the first quarter. on the aforementioned strip sack that uh Vrabel had, that turned out to be another example of the Tuck rule going against the Patriots. Because it was And and the the um TV crew had this like queued up immediately coming back from commercial where every single Patriots game man that shit queued up. Yeah. It's like, oh remember this play, Patriots fans? Like, yeah, fucking course we do. That's what I had thought too. Just popped up again. But how yeah, how long did the tuck rule actually last before I'm gonna stat check it? Yeah. Yeah. Like before I got over because it was definitely happening in 2003 because they called it and they literally called it the tuck rule. Your boy challenged even called it.",
    "timestamp" : "01:06:51-01:08:08"
  },
  {
    "speaker" : "Steve",
    "text" : "Your Dorf is like, that's a tuck rule.",
    "timestamp" : "01:08:08-01:08:10"
  },
  {
    "timestamp" : "01:08:10-01:08:10",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "2013.",
    "timestamp" : "01:08:11-01:08:12"
  },
  {
    "timestamp" : "01:08:12-01:08:15",
    "speaker" : "Andy",
    "text" : "2013 it got turned off? Wow."
  },
  {
    "text" : "No way. The talk rule was abolished on March 20th, 2013 by a 29 to 1 vote of current teams.",
    "timestamp" : "01:08:15-01:08:22",
    "speaker" : "Greg"
  },
  {
    "text" : "Who voted against that?",
    "speaker" : "Andy",
    "timestamp" : "01:08:23-01:08:24"
  },
  {
    "timestamp" : "01:08:25-01:08:35",
    "speaker" : "Greg",
    "text" : "I'll fucking Davis probably. It's like nah fuck it. Steelers voted against and the Patriots and Redskins abstained. Well of course I mean the page is kind of half to obsane, don't they?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, yeah. I think I can't believe the Raiders didn't either.",
    "timestamp" : "01:08:35-01:08:38"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:08:39-01:08:47",
    "text" : "That's funny. No, the Raiders definitely voted against it. Remember we played that clip of the lat like in 2002 of Al Davis being like that's a bullshit."
  },
  {
    "text" : "You mean that big sheet of leather? Yeah.",
    "timestamp" : "01:08:51-01:08:54",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "The the handbag. The sentient handbag. But yeah, so that that play is also on um on page dynasty. info. And uh at some point I'm gonna create a uh a clip of all the the tuck rules that we come across. So whenever a salty Raiders fans come comes up, we can we can present them with all the other tuck rules. I can't believe it. We're up to three so far. We're only in two three.",
    "timestamp" : "01:08:54-01:09:19"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:09:20-01:09:34",
    "text" : "Still, they didn't lose a playoff game because of the duck rule. That's fine. But they're but let's not pretend we're like the ones being like marginalized. We're the grieved party here."
  },
  {
    "timestamp" : "01:09:35-01:09:50",
    "speaker" : "Andy",
    "text" : "No, but a lot of Raiders fans, especially these days who like were really young. Yeah, yeah. At that time. Instead, we have a Super Bowl. They had they had more than that chance to stop us. It wasn't that play that ended it for them."
  },
  {
    "text" : "Yeah, but that play would have ended it. But it yeah, but they had plenty of other times we've had this argument a few times. You guys know where I stand. I know where you stand.",
    "timestamp" : "01:09:50-01:10:00",
    "speaker" : "Greg"
  },
  {
    "text" : "Original championship episode where we discuss this in depth. That's right. TLDR, Greg hates Bill Belichick.",
    "speaker" : "Steve",
    "timestamp" : "01:10:04-01:10:13"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:13-01:10:18",
    "text" : "Yeah. And the rest of us recognize his genius."
  },
  {
    "speaker" : "Steve",
    "text" : "And he hates the rest in common.",
    "timestamp" : "01:10:18-01:10:20"
  },
  {
    "text" : "If I recognize his genius, you mean slob on his knob, then yes, I agree. You guys love his genius in and around your mouths.",
    "timestamp" : "01:10:20-01:10:29",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "But I can't believe that it wasn't abolished until 2013. That's",
    "timestamp" : "01:10:29-01:10:33"
  },
  {
    "speaker" : "Andy",
    "text" : "That's a long time.",
    "timestamp" : "01:10:33-01:10:34"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:10:34-01:10:36",
    "text" : "Plus years after that Raiders game."
  },
  {
    "speaker" : "Andy",
    "text" : "Because regardless of what you think of the call, it's it's a bad rule to have.",
    "timestamp" : "01:10:36-01:10:40"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I think it was a right call, bad rule. I can't believe bad rule stuck around until 2013. That's insane. Yeah. All right. Speaking of bad, let's throw some best and worse out.",
    "timestamp" : "01:10:41-01:10:53"
  },
  {
    "speaker" : "Andy",
    "text" : "All right. Um Actually, before we do that, I I just want to bring up one last thing. And it doesn't really have to do with this game because uh it has to do with touchdown celebrations and there weren't any in this. Uh, but they showed Uh highlights of other games are like, you know, they throw it to New York and whatever. Uh and one of the touchdowns was finished with a uh goalpost dunk. Which I think got outlawed as a celebration. Can't do it anymore. But that I think to me was one of my favorite touchdown celebrations. I want to know where that where that stands on on your list of touchdown celebrations. Like like not not the pre-planned ones. Like not the choreograph things, because I think those are but just like in terms of like You know, spontaneous touchdown celebrations.",
    "timestamp" : "01:10:53-01:11:48"
  },
  {
    "timestamp" : "01:11:48-01:11:52",
    "speaker" : "Steve",
    "text" : "That's my favorite. No, the Lambo Leap is that but better person."
  },
  {
    "timestamp" : "01:11:52-01:11:53",
    "speaker" : "Andy",
    "text" : "Lambo Leap's pretty good."
  },
  {
    "timestamp" : "01:11:53-01:12:26",
    "speaker" : "Greg",
    "text" : "I like when they do like silly dances, like Victor Cruz's salsa. That was always my favorite. I'll give you that, yeah. And I know there's a lot of players that do like funny dances when they score now. Like Justin Jefferson's, I like his a lot. Oh yeah. There's that little toe-tap thing. Yeah. I like seeing 'em dance because they're all good dancers too, you know. It's true. It's true. Robot Tom. It's even better when they're bad dancers. Professional athletes just be horrific at dance."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:12:27-01:12:30",
    "text" : "But Gronk has the Gronk spike, which is also epic."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:12:30-01:12:34",
    "text" : "Yeah, it's pretty sweet. It's on brand for sure. It's on brand."
  },
  {
    "timestamp" : "01:12:34-01:12:44",
    "speaker" : "Steve",
    "text" : "It's definitely on brand, but it's just like You know which one I sneaky liked? What? He's gonna come out of left field. The Shane Veren kicked the door down. Oh no, it wasn't Shane Vereen."
  },
  {
    "timestamp" : "01:12:44-01:12:48",
    "speaker" : "Andy",
    "text" : "Ridley. Oh Ridley, Ridley, Ridley. Yeah. Ridley. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "The Randy Moss opened the coverage on Dowins Legend.",
    "timestamp" : "01:12:48-01:12:52"
  },
  {
    "timestamp" : "01:12:53-01:12:54",
    "speaker" : "Andy",
    "text" : "Is that what that was? Open the coverage? Yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:12:55-01:12:57",
    "text" : "It was from the first Randy Moss touched down."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:12:57-01:13:00",
    "text" : "I don't know what you're talking about, but I didn't know that that's what it was meant to be"
  },
  {
    "text" : "When he splits the coverage, yeah, he raised throws it forever to split the cross.",
    "speaker" : "Steve",
    "timestamp" : "01:13:00-01:13:04"
  },
  {
    "timestamp" : "01:13:06-01:13:26",
    "text" : "I remember when there was that dude in the stands. That like kind of looked like him, but not really, and they showed him on the Jumbotron and the two of them were going back and forth doing it. Oh, it's wicked funny. You gotta YouTube it, Steve. It's oh yeah. It's absolutely legendary. And Randy Moss is fucking like giggling on the sideline.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:13:27-01:13:30",
    "speaker" : "Andy",
    "text" : "Randy Moss has had himself a good time playing football."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:13:30-01:13:30"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:30-01:13:49",
    "text" : "He's one of those guys. I love it. Alright, so now we can do best and worse. I just wanted to get that because I saw that. I'm like, oh that's that's one of my favorites. I was curious what your favorites were. But all right. Um Greg, you want to go first? Sure. All right."
  },
  {
    "text" : "I have two bests this week, one from each team, player of the game. For New England, I'm going Tylaw.",
    "timestamp" : "01:13:50-01:13:58",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:58-01:14:01",
    "text" : "Yeah, we didn't we didn't touch on that. I kind of left that for you."
  },
  {
    "timestamp" : "01:14:01-01:14:06",
    "speaker" : "Greg",
    "text" : "Back from injury. Well, still standard games again."
  },
  {
    "speaker" : "Andy",
    "text" : "He didn't practice all week, they said. And they decided an hour before game time, yeah, he's good to go. Which is so tied along. It's like, yeah, fuck, I can do this. It's the Browns. And then all he does is go out there and get the game ceiling interception.",
    "timestamp" : "01:14:06-01:14:20"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. 51 seconds left.",
    "timestamp" : "01:14:20-01:14:22"
  },
  {
    "timestamp" : "01:14:22-01:14:40",
    "speaker" : "Andy",
    "text" : "Literally the six point game. the play after the Browns convert of fourth and fifteen to keep it going. And um here I have the sound for this too because This is your boy fucking deer. Actually, I don't even think it was Deirdorf. It was his uh shut up."
  },
  {
    "timestamp" : "01:14:41-01:14:42",
    "speaker" : "Steve",
    "text" : "Watching that video"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:14:43-01:14:45",
    "text" : "Oh it's great, isn't it?"
  },
  {
    "timestamp" : "01:14:49-01:14:52",
    "text" : "He's just the most lovable human ever.",
    "speaker" : "Greg"
  },
  {
    "text" : "He is. But this this was this was the call on the interception too.",
    "timestamp" : "01:14:53-01:14:58",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Announcer",
    "timestamp" : "01:15:00-01:15:17",
    "text" : "It's not over yet. Holcomb hurries his team to the line of skirmish. There's contact between Law and the receiver. Kevin Johnson, no flag, and Law has the ball."
  },
  {
    "timestamp" : "01:15:17-01:15:21",
    "speaker" : "Andy",
    "text" : "So immediately goes to this contact from Tyler, which Tylock."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:15:25-01:15:27",
    "text" : "Watch how quickly it's proven."
  },
  {
    "text" : "Oh, they love it here in Foxboro, but Butch Davis and all of those watching in Ohio have to wonder, ooh, wasn't that excessive contact? Well on both sides. Kevin Johnson had a hold of Ty Law's jersey as well.",
    "timestamp" : "01:15:27-01:15:43",
    "speaker" : "Announcer"
  },
  {
    "text" : "But I think that It was literally the wide receiver grabbing Ty Law between the two and the four and trying to drag him to the ground and Ty Law just caught the ball anyway.",
    "speaker" : "Andy",
    "timestamp" : "01:15:43-01:15:52"
  },
  {
    "timestamp" : "01:15:52-01:16:01",
    "speaker" : "Greg",
    "text" : "Just one-handed, like across his body picking unbelievable ball skills, Tylaw. Oh, incredible. Just a mock."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. On a bad leg, by the way. On no practice. Fuck it. Just gonna go out and do that. So you're gonna seal it too.",
    "timestamp" : "01:16:01-01:16:10"
  },
  {
    "timestamp" : "01:16:11-01:16:14",
    "text" : "They held the Browns to 203 total yards.",
    "speaker" : "Greg"
  },
  {
    "text" : "Which is damn good. Not a great game. But the uh the Browns defense also played pretty well. Uh I think the Browns defense was there. their uh strength and and on this team.",
    "speaker" : "Andy",
    "timestamp" : "01:16:14-01:16:25"
  },
  {
    "timestamp" : "01:16:25-01:16:36",
    "speaker" : "Steve",
    "text" : "Yeah, I had something I didn't know if this was the best or worst. I it was just like a big old question mark to me. I have a note here, Ben Taylor with 13 tackles and there's three minutes left in the third."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:16:37-01:16:44",
    "text" : "That was just that was my my other best. Yeah, Ben Taylor. Yeah, 18 tackles, 16 unassisted."
  },
  {
    "text" : "Who's Ben Taylor?",
    "timestamp" : "01:16:44-01:16:45",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:16:45-01:16:48",
    "text" : "I don't know. That's a fucking crazy stat line.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. He was all over the place. That's a lot of people. Like, you know, you put Ben Taylor on this defense.",
    "timestamp" : "01:16:48-01:16:58"
  },
  {
    "text" : "And then some guy Kevin Bentley had 15 tackles. Jesus. It's ridiculous. Like how many tackles were they tackling?",
    "timestamp" : "01:16:59-01:17:08",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Ben Taylor was the right outside linebacker. And Kevin Bentley was their middle linebacker. So. Well, and I think to be fair, the Patriots were Towards especially like most of the fourth quarter, just running as much clock as possible. They're just like fuck this game trying to get out. And so I think One of their drives was just like a shit ton of runs. It took like four or five minutes off the clock. Which I'll go next because that's that long, Andy. In this game, it felt like longer. It felt like 20. But on that note, I think my player of the game would be Kevin Falk. Um I had K Falk for MVP.",
    "timestamp" : "01:17:09-01:17:54"
  },
  {
    "speaker" : "Steve",
    "text" : "I had that note too, Andy. I'm not going to be able to do that.",
    "timestamp" : "01:17:54-01:17:56"
  },
  {
    "timestamp" : "01:18:04-01:18:07",
    "text" : "Sixty yards rushing, fifty yards receiving, something like that.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:18:07-01:18:13",
    "speaker" : "Greg",
    "text" : "It's a bold move picking a offensive player as MVP in a nine three game."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, well you know what?",
    "timestamp" : "01:18:13-01:18:14"
  },
  {
    "text" : "We were talking about having a season-long MVP conversation.",
    "timestamp" : "01:18:15-01:18:18",
    "speaker" : "Steve"
  },
  {
    "text" : "Fucking idiots. I'm gonna do it again. Ready? Watch this. Daniel Graham, co-MVP of this game. Co MVP. Yeah.",
    "timestamp" : "01:18:19-01:18:26",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:18:26-01:18:27",
    "text" : "Graham had a couple good plays, yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "This was his second best game of his career in this game, and he had some fucking snags. This was uh 110 receiving yards. Not bad for a tight end. And like they were not easy catches either.",
    "speaker" : "Andy",
    "timestamp" : "01:18:28-01:18:45"
  },
  {
    "timestamp" : "01:18:45-01:18:48",
    "text" : "He had that one play where he was dragging like a bunch of dudes.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. So you had one there where he looked like uh an old Bang Coates out there, just like caught caught a uh a pass in the flat across the middle and just ran through like four or five guys to get the first down. And he had a couple like down the scene that Bertie found him and he just made some nice snags over the top of guys. Hell of a game. And he was basically the only tight end left on this team because Fourier went down. He kept like coming in and going out again because he was hurt. So he was kind of like the only uh receiving option in this game, really. Like none of the wide receivers did anything, even Troy Brown. didn't have a great game except for the one play, which might be Steve's best, so I'll leave that.",
    "timestamp" : "01:18:48-01:19:27"
  },
  {
    "timestamp" : "01:19:27-01:19:29",
    "speaker" : "Steve",
    "text" : "No, you can take it. I have an on yet."
  },
  {
    "text" : "So that was great. Uh there's and it's on the website. Troy Brown, the the Patriots getting tricky. In the fourth quarters, like I think it was the drive where they're trying to run the clock out. It was third and two, just inside the Cleveland's half of the field. And Brady's in the shotgun and he's, you know, like calling out his his like calling to his receivers, calling out different whatever audibles that turns out to be bullshit because Tylock goes in motion and as he goes in motion just jumps under center, grabs the snap, and then runs around left end for four yards for the first down. So reaching those bag of tricks. So even when he's not having a good day, uh receiving yards and things, he's uh still contributing in big ways Big ways. Four yard game. Yeah. Hey, he took a snap on the center. That makes him a quarterback, right? Yeah. Now he's played quarterback in an NFL game. So add that to the list, quarterback check. Wide receiver, check. Punt returner, check, kick returner, check. Running back. He's taking a handoff on that draw play that got blown up. Check. And we'll see him play defense. What else you want him to do, Greg? Huh? Well, you want him to take a field goals too?",
    "timestamp" : "01:19:30-01:20:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I want him to be the accountant.",
    "timestamp" : "01:20:39-01:20:40"
  },
  {
    "timestamp" : "01:20:41-01:20:49",
    "speaker" : "Steve",
    "text" : "I just watched a highlight video of Randy Moss returning a punt for a touchdown. Check. Check."
  },
  {
    "text" : "Well, I I have a picture here of uh a Johnny Manzell jersey. And it just says, instead of Manzan Manzel, it says, man, we suck. Which is I like that. Check.",
    "speaker" : "Greg",
    "timestamp" : "01:20:50-01:21:05"
  },
  {
    "timestamp" : "01:21:08-01:21:10",
    "text" : "That's more of the wah wah.",
    "speaker" : "Steve"
  },
  {
    "text" : "Operation now that we have the sad trombone noise. Oh yeah. Just wait till we get a yakity sacks. This podcast is going to the stratosphere.",
    "timestamp" : "01:21:20-01:21:31",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh fuck yeah, yes. Right. So um and I think my worst I just had here was probably Bethel Johnson as a wide receiver. He showed why he didn't last very long as a wide receiver on this team because it didn't seem like he had a clue what was going on. There was a couple where I think he was supposed to run a certain route. And Brady like threw an out pattern, and then you just see Bethel Johnson standing there with his arms up like wood? And then having multiple times, which is kind of, I think, why a couple of drives stalled out. Um And then this probably isn't a award. This is actually probably a best. Is I'm going to show you this picture and we will put it in the show notes of um The last time or yeah, uh Bill Belichick when he was a coach of the Browns and his favorite moment was um beating the Newland Patriots in the playoffs. But this is the picture they showed.",
    "speaker" : "Andy",
    "timestamp" : "01:21:31-01:22:31"
  },
  {
    "speaker" : "Steve",
    "text" : "And the date on that picture?",
    "timestamp" : "01:22:32-01:22:34"
  },
  {
    "speaker" : "Andy",
    "text" : "January 1st, 1995.",
    "timestamp" : "01:22:34-01:22:36"
  },
  {
    "timestamp" : "01:22:37-01:22:37",
    "speaker" : "Steve",
    "text" : "Woo!"
  },
  {
    "speaker" : "Andy",
    "text" : "And the outfits are phenomenal. For those who can't see them, I will explain. They're both wearing khakis, because as you do. Um, you know, business casual. It looks like they both have collared shirts underneath.",
    "timestamp" : "01:22:37-01:22:49"
  },
  {
    "text" : "He's doing that collared shirt over this brown sweater.",
    "speaker" : "Steve",
    "timestamp" : "01:22:51-01:22:53"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but but the collar the collar itself, it like the bottom of the collar is still tucked into the sweater. Yeah, so that's quite executed. And it's this it's like those uh old school starter jackets that are the pull like um Belchek has the pullover. Yeah, not even the full is it. Nice brown, it has like the word brown in script. And then uh uh Parcellus has the one that I think I used to have something very similar to that, like the zip-up version, the big puffy one That was the starter jacket that almost looks like um the Zubaz jer the Zubaz pants that the the Bills would wear. And the haircut on Balacek too is just top-notch. So we'll share that too. That's it.",
    "timestamp" : "01:22:54-01:23:36"
  },
  {
    "text" : "That's the Browns last playoff with 95.",
    "speaker" : "Steve",
    "timestamp" : "01:23:37-01:23:39"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. Pretty good. Bill Belichick as their head coach. Still the last time they won a playoff game. So all right, Steve, what do you got? Give me some best and worst.",
    "timestamp" : "01:23:39-01:23:51"
  },
  {
    "text" : "Yeah, I just thought of a worst is We did we signed Josh Gordon and I have a bunch of Browns fans that I work with. And the level of like they don't like Josh Gordon is pretty high. Really? Yeah, yeah. They're very anti-Josh Gordon. Why? I don't know. But the same uh same kind of thing as Boo and Tim Couch when he's concussed, you know? Yeah. They may be a little too passionate on sometimes. Safety SF fans. I think Bills fans will maybe walk that line a little better.",
    "timestamp" : "01:23:52-01:24:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I think so.",
    "timestamp" : "01:24:25-01:24:26"
  },
  {
    "speaker" : "Steve",
    "text" : "Even Lions fans as well. You know, Browns fans maybe just get a little over their skis sometimes. But I still love them. Deep down inside.",
    "timestamp" : "01:24:26-01:24:34"
  },
  {
    "speaker" : "Andy",
    "text" : "But like that little brother who's just not very good at anything, but you're like, but he's still my brother. It's cool. Yeah, he's funky brown.",
    "timestamp" : "01:24:35-01:24:42"
  },
  {
    "timestamp" : "01:24:42-01:24:44",
    "speaker" : "Greg",
    "text" : "Wait, which little brother?"
  },
  {
    "speaker" : "Andy",
    "text" : "You decide. We'll let the listeners decide.",
    "timestamp" : "01:24:45-01:24:48"
  },
  {
    "text" : "Only two people on this call have little brothers, Greg. That's true.",
    "timestamp" : "01:24:49-01:24:54",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Valid point. Maybe we're all just talking about different brothers. Who knows?",
    "timestamp" : "01:24:55-01:24:58"
  },
  {
    "timestamp" : "01:25:00-01:25:44",
    "speaker" : "Steve",
    "text" : "Um the best was um actually inspired by the commentators and good commentator. Which I'm sure you're happy to hear, Andy. Uh Teddy Brisky got like just made a tackle and got the wind knocked out of him. And they're they they saw it and they commented like, oh I think Brewski's kinda hurt. And he's like, he's definitely feeling it. And then right before the snap, it like cut real close to Brewski's face and lets out the whoo, you know, like you could see him just be like, holy shit, that hurts. Like right before the snap. He's just like, oh my he like shakes his head like a half shake and good God, you know? So it was really great like commentating camera work just to capture that emotion of Brucey being like, Jesus Christ."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:25:44-01:25:46",
    "text" : "That's a very typical Bruce too."
  },
  {
    "text" : "Yeah. And then the worst by far is they showed the stat and I kind of updated it throughout the game. This season, the Patriots are eight for 22 in the red zone.",
    "timestamp" : "01:25:46-01:25:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, not good.",
    "timestamp" : "01:25:59-01:26:00"
  },
  {
    "text" : "That's fucking terrible. It's not good. More evidence of like this team is not about the team is about to rip off. the longest win streak in NFL history.",
    "timestamp" : "01:26:00-01:26:11",
    "speaker" : "Steve"
  },
  {
    "text" : "Like that's abysmal. However, there were other there were two other stats that they they showed as well. Um thirty six was that they still haven't allowed a defensive touchdown in the first quarter since week one. And they had one Before this, they had won their last 20 games with the league going into the fourth quarter. So now 20 for 21 games. So defensively, they're grave diggers. A shining example. Yeah, exactly. So if if if you if they take a lead on you going into the fourth quarter, you're kind of shit out of luck.",
    "speaker" : "Andy",
    "timestamp" : "01:26:11-01:26:46"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but even every single red zone possession, only 36% turn into touchdowns.",
    "timestamp" : "01:26:46-01:26:50"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's not great. That's really bad. And this this is the again, this is the team.",
    "timestamp" : "01:26:51-01:26:56"
  },
  {
    "timestamp" : "01:26:56-01:27:09",
    "text" : "I thought they practiced that. Well, we've always said, you know, I think Belchek stresses red zone and situation football, especially. Heavily and you can't they better at it you can't kick field goals and beat Tom Brady.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Because they don't have a lot of their starters on offense right now. Oh you're starting Bethel Johnson who's running the wrong routes. That ends some some drives prematurely.",
    "timestamp" : "01:27:09-01:27:20"
  },
  {
    "timestamp" : "01:27:21-01:27:27",
    "text" : "And as great as Troy Brown and Kevin Falk are, all of those shifty slot guys get less effective in the red zone.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yep. That's but yeah, they don't have that finishing back too. Which again to Steve's point earlier is in the season is why they probably go after a guy like Corey Dillon. Probably because of these these issues that they have in the red zone.",
    "timestamp" : "01:27:27-01:27:41",
    "speaker" : "Andy"
  },
  {
    "text" : "I'm very excited for the Corey Dillon years.",
    "speaker" : "Steve",
    "timestamp" : "01:27:42-01:27:45"
  },
  {
    "text" : "Yeah, well coming up soon. But uh I think that about does this game justice. I mean, we'll use the term game. It might be a little strong for what this was.",
    "timestamp" : "01:27:45-01:27:58",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:27:59-01:28:14",
    "speaker" : "Steve",
    "text" : "I should have one more for you, Andy. Give it to me. Yeah, me and Greg were shitting on you and you were like, oh, the high the high voices in the commentators on certain levels. I heard it on this game. It was on the promos. All of a sudden Dick Edinburgh's voice goes."
  },
  {
    "text" : "Exactly. He gets a little Tony Roma wish and just just a little bit. But now that I pointed out you notice it.",
    "speaker" : "Andy",
    "timestamp" : "01:28:16-01:28:21"
  },
  {
    "text" : "You're right. I'll give you that.",
    "timestamp" : "01:28:22-01:28:23",
    "speaker" : "Steve"
  },
  {
    "text" : "I can admit when I'm wrong. It's back. So, uh, oh, and one last thing. I had um the Patriots the last time New England was unbeaten in October. Before this season? 1978. October's not been kind to this Pagers team. But I think they'll do it again this year. So good for them. Nice. But As we go into November of 2003, Monday, November 3rd, Monday night game, baby. Heading to Invesco Field at Mile High Stadium. To play Mike Shanahan and the uh five and three Denver Broncos.",
    "timestamp" : "01:28:24-01:29:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Brady's House of Horrors.",
    "timestamp" : "01:29:10-01:29:11"
  },
  {
    "timestamp" : "01:29:11-01:29:32",
    "speaker" : "Andy",
    "text" : "Primetime matchup, baby. Trouble. That's trouble, but this is the Patriots in 2003. Don't give it away, Andy. So we'll see what happens next week on the Patriots Dynasty Podcast See ya later. See ya later. I didn't even give up the phone number. Oh well."
  }
]