[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17"
  },
  {
    "timestamp" : "00:22-00:36",
    "speaker" : "Andy",
    "text" : "Alright, welcome back to the Patriots Dynasty Podcast. 2003 season, we're making our way through, Steve Brown. We are uh week 11 of 17. So what's the what's that percentage-wise?"
  },
  {
    "text" : "Uh half.",
    "speaker" : "Steve",
    "timestamp" : "00:37-00:38"
  },
  {
    "text" : "Eleven seventeenths? I don't think so. Half-ish. We're half-ish way through. The 2003 season. Um Patriots have just come off their bi-week and are facing at home the Dallas Cowboys. And why is that significant, Stephen?",
    "timestamp" : "00:39-00:58",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "00:59-01:04",
    "speaker" : "Steve",
    "text" : "So I have been reading, which I know. Shocking."
  },
  {
    "text" : "I was wondering why you you had a pained face.",
    "speaker" : "Andy",
    "timestamp" : "01:04-01:07"
  },
  {
    "timestamp" : "01:07-01:12",
    "speaker" : "Steve",
    "text" : "Yeah. I uh I had a buddy give me that Patriots Dynasty book."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:12-01:13",
    "text" : "Oh yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "The title you read. You mentioned it. Yeah. Yeah. Was his name Jeff something?",
    "timestamp" : "01:13-01:18"
  },
  {
    "timestamp" : "01:19-01:20",
    "speaker" : "Andy",
    "text" : "Jeff Benedict. Highly recommended."
  },
  {
    "speaker" : "Steve",
    "text" : "Never heard of. Good. Never heard of that guy, but.",
    "timestamp" : "01:21-01:22"
  },
  {
    "timestamp" : "01:23-01:26",
    "speaker" : "Andy",
    "text" : "Apparently he wrote a Tiger Woods book."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:26-02:07",
    "text" : "Oh, okay. Um yeah, well as for never hearing the guy, you clearly got a ton of access. Yeah. Yeah. I'm not, I'm only like uh I don't know, a quarter of the way through it, but it does detail, goes real deep, and I learned a ton of stuff about RKK getting this the team and all that shit. And And the rift with build parcels and how m and like how that all went down. Yes. So I'm glad I read that before I watched this. game otherwise have been like oh yeah he used to coach for us but there's a ton of animosity there and I actually I'd had had already hated Parcells yeah because I blame him for stealing Curtis Martin right"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. Yeah, that that hate has now shifted, right?",
    "timestamp" : "02:08-02:10"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:11-02:30",
    "text" : "Right, right. So burning hatred hyper Chris Martin focused solely on Barcell's, then I read that book and I hate him even more. So I uh When I saw that he was coaching the cowboys of his time, which I had not forgotten, but sort of forgotten. Yeah I was a little I was oh I got up for it. I was a little juiced."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah. Uh you and the entire ESPN crew was juiced because my first note on this game was in all caps. Parcells versus Belichick, they didn't say hello before the game.",
    "timestamp" : "02:31-02:45"
  },
  {
    "timestamp" : "02:46-02:51",
    "speaker" : "Steve",
    "text" : "They showed that clip of them making eye contact across the field very briefly."
  },
  {
    "text" : "Yeah, yeah, yeah, throughout the game on a regular basis. Yes. Um and then they're like, well, once it got toward the end of the game, they're like, will they shake hands after the game? Let's go down to Susie Calder. And she's like, I don't know. Let's find out. I'm sure we'll have cameras on it. Uh for the record, spoiler alert, they did. They had like a big long hug and everything.",
    "speaker" : "Andy",
    "timestamp" : "02:53-03:13"
  },
  {
    "text" : "Yeah. The best was the Eric Mancini snub. I loved that one.",
    "speaker" : "Steve",
    "timestamp" : "03:13-03:17"
  },
  {
    "timestamp" : "03:18-03:32",
    "speaker" : "Andy",
    "text" : "Yeah, that was great. Also underrated is the McDaniels one. Oh yeah. Yeah, when McDaniels beat Belichick and was like doing a victory lap around the stadium instead of giving a handshake. That was a good one."
  },
  {
    "timestamp" : "03:33-03:35",
    "text" : "Surprising welcomed his ass back.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Um, so I was trying to come up with a name for this game. I was gonna like the Bill Bowl or the Battle of the Bills or I don't know. Do you have any suggestions for me?",
    "timestamp" : "03:35-03:45"
  },
  {
    "speaker" : "Steve",
    "text" : "Um I don't know. We we sort of stuck tuna in a locker.",
    "timestamp" : "03:46-03:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, something about the tuna. That's pretty good.",
    "timestamp" : "03:49-03:51"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "03:52-03:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Oh well there there was uh a sign that reminds me. I wrote this down because I thought the sign was good. Um The sign is a can of tuna. And then underneath in little letters, the chicken of the sea. The tagline made it.",
    "timestamp" : "03:52-04:10"
  },
  {
    "timestamp" : "04:10-04:12",
    "speaker" : "Steve",
    "text" : "Yep. I get he is a chicken."
  },
  {
    "timestamp" : "04:12-04:13",
    "speaker" : "Andy",
    "text" : "Chicken of the sea, yeah, I agree."
  },
  {
    "timestamp" : "04:13-04:15",
    "speaker" : "Steve",
    "text" : "Patriots after the Super Bowl"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:15-04:17",
    "text" : "Yep. Didn't even fly home with the team."
  },
  {
    "text" : "Couldn't shop for the groceries, as the famous line went.",
    "speaker" : "Steve",
    "timestamp" : "04:18-04:21"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:21-04:22",
    "text" : "That's correct."
  },
  {
    "text" : "And the commentators are falling over with each other to try and blow Jerry Jones for letting him have total control of their franchise.",
    "timestamp" : "04:22-04:30",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "They even interviewed uh Michael Irvin to to prove the fact yeah that he had complete control which you know Good for him, but he didn't actually.",
    "timestamp" : "04:30-04:39"
  },
  {
    "text" : "How did the Cowboys finish up this year?",
    "speaker" : "Steve",
    "timestamp" : "04:39-04:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:41-04:44",
    "text" : "Uh they finished 10 and 6 and lost in the wild card."
  },
  {
    "text" : "And then his whole career at Dallas, how did he do there?",
    "timestamp" : "04:44-04:47",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh that was about it. It wasn't much more than that, I don't think. Let's stat check that real quick. Bill Parcells, yeah, 10 and 6 this season, 2003. Uh six and ten, nine and seven, nine and seven. And that was his last uh NFL head coaching. So he was 64, uh let me see now, 34 and 30 as a head coach.",
    "timestamp" : "04:47-05:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "05:12-05:13",
    "text" : "Cool.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "05:13-05:14"
  },
  {
    "timestamp" : "05:14-05:18",
    "speaker" : "Steve",
    "text" : "So probably put 'em in salary cap purgatory too."
  },
  {
    "timestamp" : "05:18-05:19",
    "text" : "Quite possibly.",
    "speaker" : "Andy"
  },
  {
    "text" : "I mean that was the thing about Parcells. I mean he was a good coach from the eighties. You know, he just couldn't do it in the modern game.",
    "speaker" : "Steve",
    "timestamp" : "05:20-05:25"
  },
  {
    "timestamp" : "05:26-05:41",
    "speaker" : "Andy",
    "text" : "Pre-salary cap, right, yeah. And so when yeah, that was in the book, wasn't it, when RKK came in and was like They want to re-sign Bruce Armstrong. They're just like, well, we just give him a contract. And they're like, well, no, we can't do that anymore. We actually have to like figure out how much he's worth of our our salary cap. He's like, I don't give a shit."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "05:41-05:54",
    "text" : "Sally Cap is a little a little pre-me remembering. You know, for like my entire life has been a thing, but I didn't realize that it had sort of started in like what two thousand or nine late nineties, right?"
  },
  {
    "text" : "Uh that sort of time frame, yes.",
    "timestamp" : "05:54-05:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "05:56-05:56",
    "text" : "Yeah."
  },
  {
    "text" : "It was right around the time that Kraft bought uh the Patriots. Which is crazy. Late 90s.",
    "speaker" : "Andy",
    "timestamp" : "05:56-06:02"
  },
  {
    "timestamp" : "06:02-06:23",
    "speaker" : "Steve",
    "text" : "I thought it would have been in since like the I don't know the early 90s or like when since I've been around, but I guess not. No, no, it's been around for uh Ian, it's about to come in the Page's favor again when this coming season it's drops by 15% everyone has a cut, a bunch of really good players, and the pages are sitting there with a ton of cap space."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. Checkers and chest, baby.",
    "timestamp" : "06:23-06:25"
  },
  {
    "timestamp" : "06:25-06:26",
    "speaker" : "Steve",
    "text" : "That's right."
  },
  {
    "timestamp" : "06:26-06:29",
    "speaker" : "Andy",
    "text" : "But Bill Parcell is spending his little heart out right now."
  },
  {
    "timestamp" : "06:29-06:29",
    "speaker" : "Steve",
    "text" : "Yeah, right."
  },
  {
    "timestamp" : "06:30-07:01",
    "text" : "Or he would be. Apparently, uh, according to Wikipedia, he is uh a courtesy consultant with the Cleveland Browns. I don't know what that means. Since 2014. You never hear his name come up, but I I guess the courtesy consultant. Well, yeah. Um I th I think we also can't miss the opportunity to mention that uh Bill Parcells is uh also not named Bill. He is Dwayne Charles Parcells.",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh yeah.",
    "speaker" : "Steve",
    "timestamp" : "07:02-07:02"
  },
  {
    "text" : "Everybody calls him Bill because why the fuck not? I don't even remember why. I don't remember how that came out. Let's say it's his father, Charles Chubby Parcels.",
    "timestamp" : "07:03-07:11",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "His dad's like nickname was Chubby. Chubby. I bet his dad's a real asshole to Bill, and that's why he was an asshole to everybody else.",
    "timestamp" : "07:13-07:20"
  },
  {
    "text" : "Yeah, just like our dad to us.",
    "speaker" : "Andy",
    "timestamp" : "07:20-07:22"
  },
  {
    "text" : "Sure. Yeah. But he loves you deep down.",
    "timestamp" : "07:22-07:24",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "07:24-07:25",
    "speaker" : "Andy",
    "text" : "Sarcastic asshole, yeah."
  },
  {
    "timestamp" : "07:26-07:32",
    "text" : "But he'll never tell you he loves you, but you know, you know. Ish. Sometimes when he's drunk that he loves you.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:32-07:41",
    "text" : "Yeah. Oh, so while at high school he was routinely mistaken for another boy named Bill, as he had always disliked his given name of Dwayne, he decided to adopt Bill as his nickname."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "07:42-07:44",
    "text" : "The rock is like, bro, that's the best you could do."
  },
  {
    "text" : "Right? I went with the rock.",
    "timestamp" : "07:44-07:46",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:49-07:50",
    "text" : "Come on, dude.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Although if if you're taking a life lesson from this, don't name your kid Dwayne because they're gonna hate it. And they're gonna change they're gonna hate it so much they're gonna call themselves something else.",
    "timestamp" : "07:50-07:57"
  },
  {
    "timestamp" : "07:58-08:02",
    "speaker" : "Steve",
    "text" : "That's true. I can't even think of one Dwayne that I'm like, yeah, that guy's sweet No."
  },
  {
    "speaker" : "Andy",
    "text" : "Dwayne Almond. Yeah, not that sweet. Almond. Almond. Jesus. There's no D in that. Almond. Um Yeah, uh another Bill Parcel, Dwayne Parcell's fact that I find interesting that they they shared in this was that um His teams had only been shut out once before this 2003 season in 1993. Um, which I believe that was With the Patriots? Is that right?",
    "timestamp" : "08:02-08:34"
  },
  {
    "timestamp" : "08:34-08:35",
    "speaker" : "Steve",
    "text" : "No. Fact check."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh 2000, 1993. Yeah, it was his first year as it with the Patriots when they were kind of crap and he was dragging him out of that. Um they would this season be shut out twice.",
    "timestamp" : "08:37-08:50"
  },
  {
    "timestamp" : "08:51-08:52",
    "text" : "Including this game.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:53-08:54",
    "text" : "Including this game."
  },
  {
    "text" : "A rolling 12-0.",
    "speaker" : "Steve",
    "timestamp" : "08:55-08:56"
  },
  {
    "text" : "Yep. Nice little baseball score to break up the football season.",
    "timestamp" : "08:57-09:02",
    "speaker" : "Andy"
  },
  {
    "text" : "Do you want to give a watchability on this?",
    "timestamp" : "09:02-09:04",
    "speaker" : "Steve"
  },
  {
    "text" : "Ooh, yeah, we should, shouldn't we? Um Oh, I mean, the game itself not amazing From like an offensive output. Not a lot of scoring, not a lot of big plays.",
    "timestamp" : "09:04-09:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Brady, fifteen of thirty-four, two hundred and twelve yards, which like Had three quarters of those came on three plays.",
    "timestamp" : "09:22-09:29"
  },
  {
    "timestamp" : "09:29-09:32",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, like 200 of those yards came on like two plays."
  },
  {
    "text" : "No TDs, no interceptions.",
    "timestamp" : "09:32-09:34",
    "speaker" : "Steve"
  },
  {
    "text" : "Right. Um, but then Show uh what was Quincy Carter's numbers?",
    "timestamp" : "09:34-09:40",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Cowboys Quincy fucking Carter. Twenty of thirty-six to ten Three interceptions.",
    "timestamp" : "09:42-09:48"
  },
  {
    "timestamp" : "09:48-09:51",
    "text" : "And uh no touchdowns, spoiler alert.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah. There was actually a touchdown scored. Don't let the school uh score fool ya.",
    "timestamp" : "09:51-09:56"
  },
  {
    "text" : "Yes. This game was all over the place, yeah. So Uh like we said it ended 12-0 Patriots, but that was not all field goals. Antoine Smith scored a touchdown in the second quarter, but Adam Venateri had his extra point blocked. He didn't even miss it. It was straight up blocked. kicked it into the armpit of the oncoming defender.",
    "speaker" : "Andy",
    "timestamp" : "09:56-10:16"
  },
  {
    "text" : "From the two. Must be clear.",
    "timestamp" : "10:17-10:18",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, yeah. Yeah, this this was a chip shot that he got blocked. But then still kicked two other field goals. So whatever. Which were also chip shots. So the scoring was a 23-yard field goal, a two-yard rush, and a 26-yard field goal. I'm still gonna give this a two and a half out of six.",
    "speaker" : "Andy",
    "timestamp" : "10:19-10:41"
  },
  {
    "timestamp" : "10:41-10:42",
    "text" : "That's generous.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't think so, because I think defensively it was a great game to watch. And watching Bill Parcells get more and more frustrated that uh his offense couldn't do anything. And like the Patriots were basically up nine-nothing for most of the game. They they scored that last field goal. just after the two-minute warning at the end of the game.",
    "timestamp" : "10:43-11:02"
  },
  {
    "timestamp" : "11:02-11:04",
    "text" : "After a Quincy Crowder interception.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. And and just like watching him and and then also comparing that to listening to the um The commentators try as hard as they could to be like Quincy Carter, not that bad of a quarterback.",
    "timestamp" : "11:04-11:20"
  },
  {
    "timestamp" : "11:20-11:42",
    "text" : "It's not even true. They thought he was fucking awesome. I gave this like a one Super Bowl, most a Super Bowl in an AFC championship, just from the Parcells factor. If if Parcells was not part of this game It's like a like an AAC championship alone. It's it was it was a slog and the commentators were awful.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I enjoyed them.",
    "timestamp" : "11:43-11:44"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "11:44-11:53",
    "text" : "No. This is the back in the day when they did the three-man booth, which no one's done that before and no one's done that since because it's a fucking terrible idea."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "11:54-11:58",
    "text" : "I disagree. I think they were good. Sizeman, Mike Patrick, and Paul Maguire."
  },
  {
    "text" : "Paul Maguire was fucking awful.",
    "timestamp" : "11:58-12:01",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:05-12:07",
    "text" : "It sounded like a tier-man both booth to me."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "12:07-12:09",
    "text" : "It was so Fucking bad."
  },
  {
    "text" : "And I think Theizman, we've talked about this before. Theisman's kind of that like original um he's the original Tony Romo, the ex-quarterback who actually like knows what he's talking about. Yeah. So I like I like listening to him. They they were so bad.",
    "speaker" : "Andy",
    "timestamp" : "12:09-12:24"
  },
  {
    "speaker" : "Steve",
    "text" : "I disagree. I'll I'll get some quotes while we while we uh Well we figure it out, you know. Yeah, right. There was one thing that did make the game a little better. Oh. And gave me hope for the future. Oh, what was that? Uh they had a commercial in it for HD. Oh did they really?",
    "timestamp" : "12:25-12:47"
  },
  {
    "speaker" : "Andy",
    "text" : "I missed that.",
    "timestamp" : "12:47-12:48"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, they had a they had a a shot of like the camera truck inside the camera truck.",
    "timestamp" : "12:48-12:52"
  },
  {
    "text" : "Oh yeah yeah.",
    "timestamp" : "12:52-12:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And they're like, get an HD TV. It's you can see what we see.",
    "timestamp" : "12:53-12:57"
  },
  {
    "timestamp" : "12:57-13:06",
    "speaker" : "Andy",
    "text" : "And I Oh that's what they were talking about, because I missed the beginning of that. And they kept going on and on about how well I've got one now, so maybe I'll get a second. Pleo. Must be nice."
  },
  {
    "text" : "Okay, here you go. And An errant pass hits the Patriots like a screen a screenplay hits the Patriots guy in the head. Yeah. It's a header. It's no good. It's a soccer game. Yeah, that was pretty bad. Was he kicking a field goal with his fucking head?",
    "speaker" : "Steve",
    "timestamp" : "13:08-13:23"
  },
  {
    "timestamp" : "13:23-13:27",
    "speaker" : "Andy",
    "text" : "Yeah, that's that's not how soccer works at all. There's no no good in soccer."
  },
  {
    "text" : "There is none of that.",
    "speaker" : "Steve",
    "timestamp" : "13:28-13:29"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:29-13:38",
    "text" : "But I mean that's that's a pretty typical American thing, right? Knowing soccer, that's like a rite of passage. It's like 4th of July and not knowing the rules of soccer."
  },
  {
    "timestamp" : "13:38-13:59",
    "speaker" : "Steve",
    "text" : "They used horse collar three times. By the seven minutes left in the second in the first half. These fucking horse collar, horse collar, horse, oh, horse collared him. Oh, horse collar. And this this is before horse collaring was a penalty. Yeah. Oh yeah Oh yeah. Look look at Quincy Carter. Read the blitz. It's a four-man rush."
  },
  {
    "text" : "It was a late blitz. They were they rushed to read. It wasn't.",
    "timestamp" : "14:00-14:03",
    "speaker" : "Andy"
  },
  {
    "text" : "It was a four fucking man rush. It wasn't a stunt.",
    "timestamp" : "14:03-14:05",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "14:05-14:10",
    "speaker" : "Andy",
    "text" : "It was a delayed blitz. Willie McGuinness was all over the field."
  },
  {
    "speaker" : "Steve",
    "text" : "No, then they talk about Charlie Weiss saying, you know, you know, there's overcoaching because we have a lot of injuries. And so, you know, you just kind of like keep it simple, let it go out there and play. Then they cut to to Irving on the sideline. And he's like, oh yeah, I told the receiver to go in to tell the quarterback to put more air under the ball. And they're like, wow. Just like Brady does. Yeah, wow. How great. How great is that?",
    "timestamp" : "14:10-14:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Typical Michael Erford though. It's like, listen, you guys are fucking doing this wrong. Here's what you gotta do. It's like bro, you don't play no more.",
    "timestamp" : "14:37-14:44"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "14:45-14:47",
    "text" : "They use the word wonder kid."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:48-14:49",
    "text" : "They did."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Just automatic fuck you. Wonder Kid, get fucked.",
    "timestamp" : "14:49-14:56"
  },
  {
    "timestamp" : "14:56-14:57",
    "speaker" : "Andy",
    "text" : "Look what I've created."
  },
  {
    "speaker" : "Steve",
    "text" : "I'm enjoying this. They said Tom Brady struggled last year because they didn't make the playoffs. I'm pretty sure he led the NFL in passing touchdowns. He did. Fucking dicks.",
    "timestamp" : "14:57-15:07"
  },
  {
    "timestamp" : "15:08-15:13",
    "speaker" : "Andy",
    "text" : "I think he also struggled, but yeah. 2002 was not his best year."
  },
  {
    "timestamp" : "15:13-15:16",
    "speaker" : "Steve",
    "text" : "And just like the the constant Quincy Carter dick sucking."
  },
  {
    "timestamp" : "15:17-15:19",
    "speaker" : "Andy",
    "text" : "There was a lot of that. It was egregious."
  },
  {
    "timestamp" : "15:20-15:21",
    "text" : "They wanted him to be good, so",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "15:22-15:48",
    "text" : "So badly, but they were trying to will him into at least mediocrity. And they c so yeah, because they kept talking about let's go in a Quincy Car. This is a good segue, I think. Um because For those of you like me who completely forgot about him, he was the starting quarterback for this um Cowboys team. He was very forgettable. For a few years. I I had to look it up. And I remember he actually played for it.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I found the worst one. Before we go deep in Quincy Carter, I'm gonna bring it back one last time.",
    "timestamp" : "15:48-15:53"
  },
  {
    "timestamp" : "15:53-15:54",
    "text" : "Give it to me",
    "speaker" : "Andy"
  },
  {
    "text" : "The referee is the one who makes this call of the penalty. No fucking shit, Paul Maguire. Who else is gonna make the call? Is the coach gonna throw the penalty flag?",
    "speaker" : "Steve",
    "timestamp" : "15:54-16:04"
  },
  {
    "speaker" : "Andy",
    "text" : "You know, it's like the lineman or the line points wins a game.",
    "timestamp" : "16:04-16:08"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "16:09-16:11",
    "text" : "No, who else is gonna make the call? Paul?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:12-16:18",
    "text" : "I think he's talking about throwing the flag uh actually calling the penalty. No, he the the other referees."
  },
  {
    "text" : "What he meant to say was like the the head judge, the guy all the way in the back is the one who made the holding call, but he just said the referee is the one who makes the call. Shit, buddy.",
    "timestamp" : "16:18-16:28",
    "speaker" : "Steve"
  },
  {
    "text" : "Good. I love this. This is great. Speaking of assholes, Quincy Carter played for the Cowboys for three seasons. Uh this is the only season he started all 16 games. He started eight games in 2001, seven games in 2002, and I think he got benched in 2002. for somebody whose name I didn't recognize, Hutchinson or something like that, they talked about. Yeah, I got nothing. I I didn't care. And they're like, oh, he's actually really improved from last year. He's cutting down his mistakes. So I looked it up. Uh this season he would throw 17 touchdowns, 21 interceptions. Yeah. So uh not really cutting down mistakes, but in the season before, that he didn't actually in his first three seasons, he never threw more touchdowns than interceptions. He was five and seven, then seven and eight, and then seventeen and twenty-one in those three seasons. And then he played a few games. He played three games with the Jets and was three touchdowns and one interception, which Yeah, in uh 2004 played a couple games. So we may see him again. Who knows? We'll have to find that next season. I hope so. So do I. Um yeah, they were the the commentators were like just their draw was dropped by the fact that he was an agile quarterback. Which this isn't like the first one we've ever seen.",
    "timestamp" : "16:30-17:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "17:59-18:00",
    "speaker" : "Steve",
    "text" : "No, yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "We've had Michael Vick in the league for a few years now, right?",
    "timestamp" : "18:00-18:02"
  },
  {
    "text" : "So they compared him to McNabb.",
    "speaker" : "Steve",
    "timestamp" : "18:03-18:05"
  },
  {
    "timestamp" : "18:05-18:31",
    "speaker" : "Andy",
    "text" : "Yep. Uh sh he was not McNabb. But yeah, I don't remember which commentator it was, but they were like he threw some like four yard pass on the run like back across his body and they're like this guy could throw a perfect spiral at a full sprint. Like yeah okay and now it's like you have to be Patrick Mahomes throwing underarm no look passes to get that sort of fully."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "18:32-18:38",
    "text" : "Well, there was there was Joe Thysman saying 17 for 30 is pretty good. It's a direct quote. Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:38-18:40",
    "text" : "Well, for Quincy Carter, it probably was."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, that's a good point. I mean, that's not pretty good though. That's relatively good.",
    "timestamp" : "18:40-18:45"
  },
  {
    "timestamp" : "18:45-19:27",
    "text" : "Well, okay, that's fair. Uh his career completion percentage. was 56 and a half percent. Yeah. So 17 for what was it, 30? That's that's above that. So that's that's pretty good. Um So that's that's not great. Um But the they were trying to make this work and it was like they were hanging in there until when did you start throwing inceptions? Until the third quarter. End of the third quarter when um like the Dallas the the the the way this game went was uh Dallas had the number one ranked defense in the league",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Their defense was legit, even though it didn't have a ton of names.",
    "timestamp" : "19:27-19:30"
  },
  {
    "text" : "No, there wasn't a lot of names. Um, but they held the pages in check for the most part, except for when they would bring everybody on the blitz. And Brady would read it every time and would complete a long pass. And they did it twice. And Brady hit um branch deep for one.",
    "speaker" : "Andy",
    "timestamp" : "19:31-19:48"
  },
  {
    "timestamp" : "19:48-19:52",
    "speaker" : "Steve",
    "text" : "Yeah, what a crazy pick by Gibbons, though. That was kind of play."
  },
  {
    "timestamp" : "19:52-19:55",
    "text" : "That was a huge that was a pick that was like 15 yards downfield.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:56-20:01",
    "text" : "It was pretty pretty egregious. And the commenters like wow great so open."
  },
  {
    "text" : "What a great play. What a great play design. Like that's it's an illegal play design, but yes, it was. Um, but then the other one was they they tried it again, I think the next quarter. And uh Bray had Gibbons just running straight down the middle of the field and he was covered and Bray was like, fuck, I'm gonna chuck it straight up in the air. And Gibbons had to like stop and come back for it and made the catch. And uh So that that's what set up the An Horn Smith touchdown run in the second quarter. Um But Dallas kind of did nothing. Their their whole game plan, I think, on the season. was to rely on that great defense, run the ball down people's throats with their like massive offensive line and Uh that running back. What the hell is a running back's name?",
    "speaker" : "Andy",
    "timestamp" : "20:01-20:47"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "20:47-20:49",
    "text" : "Troy Hambrick. Great name."
  },
  {
    "timestamp" : "20:49-21:03",
    "speaker" : "Andy",
    "text" : "Troy Hambrick, yeah, which Hambrick just sounds like a fantastic name for Not a running back. Like if he was a fullback or like a nose tackle. Yeah, or like a road grading uh tight end."
  },
  {
    "speaker" : "Steve",
    "text" : "Like the oh you just got ham bricked. You can't run it with ham brick in there.",
    "timestamp" : "21:03-21:07"
  },
  {
    "text" : "Right, just a just a brick of ham.",
    "timestamp" : "21:07-21:09",
    "speaker" : "Andy"
  },
  {
    "text" : "Putting up a wall.",
    "speaker" : "Steve",
    "timestamp" : "21:10-21:11"
  },
  {
    "text" : "Right, yeah.",
    "speaker" : "Andy",
    "timestamp" : "21:11-21:11"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "21:12-21:13",
    "text" : "I agree."
  },
  {
    "speaker" : "Andy",
    "text" : "Um, but apparently they would say that he angered people in Dallas last season because he was bitching about not getting enough playing time. Behind Emmett Smith?",
    "timestamp" : "21:13-21:23"
  },
  {
    "text" : "Well, that was when Emmett Smith was crap, right?",
    "speaker" : "Steve",
    "timestamp" : "21:23-21:26"
  },
  {
    "timestamp" : "21:26-21:28",
    "speaker" : "Andy",
    "text" : "I don't think he was crap."
  },
  {
    "speaker" : "Steve",
    "text" : "Is Emmett Smith and Tom Brady's careers crossed?",
    "timestamp" : "21:28-21:31"
  },
  {
    "speaker" : "Andy",
    "text" : "They do. Uh Emmett Smith at this they said this season was playing in uh Arizona. Yeah.",
    "timestamp" : "21:31-21:37"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "21:37-21:45",
    "text" : "I remember him finishing there. Huh. I did not know that. I thought I always put those two as two separate. Did Michael Irvin and Tom Brady's careers cross?"
  },
  {
    "timestamp" : "21:45-22:07",
    "speaker" : "Andy",
    "text" : "Um probably briefly. Uh let's see. Emmett Smith played until 2004, played 03 and 04 with the Cardinals. Michael Irvin. Michael Irvin uh's last season was 1999, so no. Just barely missed."
  },
  {
    "speaker" : "Steve",
    "text" : "It's crazy that Smith played five more years than Michael Every.",
    "timestamp" : "22:08-22:12"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, especially as a running back too. Like that's pretty unheard of to have that long of a career as a running back. I mean, good for him. Uh yeah, but uh Troy Hambrick, the leading rusher on this team with whopping 972 yards. And yet somehow this team went ten and six and like they'll like we're saying the whole their whole um game plan was to just like grind it out on offense and then just like suffocate you on defense. Which is why they had the first ranked defense in yards and second ranked in points against. Uh but they had the fifteenth ranked defense in y uh offense in yards and twenty-first ranked offense in uh points four.",
    "timestamp" : "22:13-22:56"
  },
  {
    "timestamp" : "22:56-23:09",
    "speaker" : "Steve",
    "text" : "Yeah, maybe if the Patriots had had the twenty nineteen defense and the twenty twenty offense. That I mean I think I think that formula can work. That's kind of like an old school formula, and it seems to where the Patriots are trying to go, just with the people they have, you know?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "23:09-23:10"
  },
  {
    "speaker" : "Steve",
    "text" : "But they didn't run Carter enough either to make that really effective, you know?",
    "timestamp" : "23:11-23:15"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I'm surprised that they didn't they didn't use him as a as a um as a running threat. Because he did kind of take off a couple times and picked up good yards with his feet, but he was mostly kind of trying to stay in the pocket. And they showed some stat like halfway through the game where Uh when he's in the pocket, he was throwing touchdowns and some interceptions, but when he's out of the pocket, he's only throwing interceptions. So yeah, I I guess he was like And they kept talking about like how much he was studying being a quarterback and like all of this stuff.",
    "timestamp" : "23:16-23:53"
  },
  {
    "timestamp" : "23:54-24:05",
    "speaker" : "Steve",
    "text" : "Yeah. They again they were just trying to they're like the snap hits him in the hand. And bounces off his hand and goes over his head and Adams is like, oh, what a bad snap. You would hit him right in the hand."
  },
  {
    "text" : "You fired it right back there, Adam's like, that's I think that's the idea, but okay. What do you want? But then he uses athleticism.",
    "timestamp" : "24:06-24:12",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "24:12-24:13"
  },
  {
    "speaker" : "Andy",
    "text" : "To throw it in completion. To go three and out. Uh yeah, so but this the story of this Cowboys team was um they allowed 16 points per game, which is fucking fantastic. Yeah. Uh they scored an average of 18 points a game. They were shut out twice in the season. And even though their defense held six uh in six games they held teams to seven or less points, which is fucking impressive. It's still one ten and six. So.",
    "timestamp" : "24:15-24:44"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean, they didn't even have any big names. There was Roy Williams at safety. Um, there's one of the linebackers. I recognize, but that was kind of it.",
    "timestamp" : "24:44-24:52"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:52-25:10",
    "text" : "Yep. So they had um, let's see, the Pro Bowlers on defense were Dexter Coakley, uh, Leroy Glover on the defensive line, and safety Roy Williams. They also had uh I think he was a rookie, Terrence Newman, uh at cornerback."
  },
  {
    "timestamp" : "25:11-25:13",
    "speaker" : "Steve",
    "text" : "He was a rookie, yeah. He wasn't starting, I don't think."
  },
  {
    "timestamp" : "25:14-25:39",
    "speaker" : "Andy",
    "text" : "Well he led the team with four interceptions. Um and then they had Greg Ellis was, I think, their kind of sack specialist who sacked Brady in this game. Uh he had he finished the season with eight sacks. And then their middle linebacker was kind of the original um undersized, um I don't know, fragile linebacker that they always have at middle linebacker. Like who do they have now?"
  },
  {
    "timestamp" : "25:40-25:42",
    "speaker" : "Steve",
    "text" : "Um the white guy, what's his name?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:42-25:42",
    "text" : "Yeah."
  },
  {
    "timestamp" : "25:43-25:44",
    "text" : "Van something, whatever.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Van Van Van Deresch.",
    "timestamp" : "25:44-25:46"
  },
  {
    "timestamp" : "25:47-25:47",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "25:47-25:51",
    "speaker" : "Andy",
    "text" : "And before that was like someone similar who couldn't stay on the field. You know what I'm talking about?"
  },
  {
    "timestamp" : "25:51-25:54",
    "speaker" : "Steve",
    "text" : "Always oh and they all like their Lee, something Lee, right?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:55-26:31",
    "text" : "Yes, yeah, yeah, yeah. Uh and they always play like out of control, but um they're super smart and super fast and so they can make up for it. And uh this This season was Dat Gwyn, I believe is how you pronounce it. Yeah. Um, and he finished the season with 90 solo tackles and 121 combined. Which is pretty fucking impressive. And he was. He was like, and they they made a big point of this being a very unparcells like middle linebacker. Yeah, he's usually like 6'4, like pushing 300 pounds that wins like 5'8 or something, but still making plays."
  },
  {
    "text" : "But still, for a kind of a no-name defense like that, those are some impressive stats.",
    "timestamp" : "26:32-26:37",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:37-26:58",
    "text" : "Yo, yeah. They were saying that um they allowed an average of six points in the first half of games. To teams. Which that's I mean, yeah, it's it's still like pre you know, passing era But still, allowing six points in a first half of pretty much every game is fucking impressive."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I mean you're trotting out Alchermond Singleton out there.",
    "timestamp" : "26:58-27:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, you know, the the household name. Yes. Al Sherman, is that what you said?",
    "timestamp" : "27:03-27:08"
  },
  {
    "text" : "Yes. He's one of their starting linebackers.",
    "timestamp" : "27:08-27:10",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "27:11-27:24",
    "speaker" : "Andy",
    "text" : "I'm sure he is. Um but I'm wondering if this helped. Their defensive coordinator gets some coaching jobs because um it is the current Vikings head coach Mike Zimmer was the defensive coordinator in this game."
  },
  {
    "speaker" : "Steve",
    "text" : "Yes, he was. Yeah. And they were even talking them up a little bit on this.",
    "timestamp" : "27:24-27:27"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Um Also on this coaching staff, which I found interesting, was uh Sean Payton, was a quarterback's coach and like assistant to the head coach or something like that, which sure. Um so he's the law, obviously the longtime Saints I coach now who's just lost to Tom Brady. Must be must feel nice. And then also uh I found this funny, their tight ends coach was Tony Sperano. The old Dol Dolphins head coach.",
    "timestamp" : "27:27-27:56"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah. Yeah. Is this the probably the biggest name from the Cowboys in this game was Witten.",
    "timestamp" : "27:56-28:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so I mean say what you will about Belle Parcells, but the man can draft. Because in this draft, their first round pick uh was Terrence Newman, I thought uh made the Pro Bowl I think in this year and probably uh multiple years. He I think he had a good career. And also Jason Witten in the third round, who was like Yeah, this is Witten's rookie year.",
    "timestamp" : "28:05-28:28"
  },
  {
    "text" : "And he did have he had one I mean it was a nice catch bat throw sort of thing.",
    "timestamp" : "28:28-28:32",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:33-28:42",
    "text" : "Yeah. Yeah, yeah. The one of the interceptions was kind of almost his fault, but I mean he made some plays with his hands. Early on in the game, he made some nice snags, you could tell he's gonna be."
  },
  {
    "text" : "But you're also crazy to think that he's still playing.",
    "timestamp" : "28:42-28:44",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:45-28:46",
    "text" : "Right, yeah."
  },
  {
    "text" : "Lordy.",
    "timestamp" : "28:46-28:47",
    "speaker" : "Steve"
  },
  {
    "text" : "And that Brady's got two years on him.",
    "speaker" : "Andy",
    "timestamp" : "28:47-28:50"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. He was drafted by Bill fucking Parcells.",
    "timestamp" : "28:50-28:52"
  },
  {
    "text" : "But didn't he didn't Witten retire for a year and then went in the booth and then wasn't very good so he decided to come back again?",
    "speaker" : "Andy",
    "timestamp" : "28:53-28:58"
  },
  {
    "timestamp" : "28:58-29:02",
    "speaker" : "Steve",
    "text" : "He retired in 2018 and then came back for the Cowboys again."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "29:02-29:02"
  },
  {
    "text" : "This past year he's like, you know what? Raiders.",
    "timestamp" : "29:03-29:05",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "29:05-29:09",
    "speaker" : "Andy",
    "text" : "That's right. Yes. He did play for the Raiders, didn't he? How did he do?"
  },
  {
    "text" : "13 catches for 69 yards and two touchdowns Nice. 16 games though.",
    "speaker" : "Steve",
    "timestamp" : "29:09-29:16"
  },
  {
    "timestamp" : "29:17-29:20",
    "text" : "Alright. Alright. Maybe it was uh more of a blocking role.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:21-29:23",
    "speaker" : "Steve",
    "text" : "Maybe he's gotta be old at this point"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:24-29:32",
    "text" : "Yeah. But you know, there's one player that we haven't talked about that I figured we would have gotten to by now."
  },
  {
    "text" : "On the Cowboys.",
    "timestamp" : "29:33-29:35",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "29:35-29:36",
    "speaker" : "Andy",
    "text" : "On the Cowboys."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh.",
    "timestamp" : "29:37-29:37"
  },
  {
    "text" : "A bit of a homecoming, if you will. You can't just call this the Bill Parcell's revenge game. That's true. When you also have star wide out and leading receiver for the 2003 Cowboys with 754 yards and five touchdowns, wide receiver Terry Glenn returning. Uh how did he feel about coming back?",
    "timestamp" : "29:37-29:58",
    "speaker" : "Andy"
  },
  {
    "text" : "The fucking shit booed out of him.",
    "speaker" : "Steve",
    "timestamp" : "29:59-30:02"
  },
  {
    "timestamp" : "30:02-30:05",
    "speaker" : "Andy",
    "text" : "Did you hear what he he had to say about coming back?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "30:05-30:10",
    "text" : "Yeah, I didn't I didn't go to like the the actual newspapers and read the quotes and shit."
  },
  {
    "text" : "No, me neither. But just what the the commentator is saying is like he couldn't wait to get back here because he hates everything about New England.",
    "timestamp" : "30:10-30:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Um uh but in true in the um he had the Patriots hard hat on, the silver one. He had Terry Glenn jersey and then he put like a piece of masking tape above it, like kind of below his chin above the numbers, and wrote she on it.",
    "timestamp" : "30:20-30:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. Uh tough look, but uh Okay.",
    "timestamp" : "30:37-30:42"
  },
  {
    "timestamp" : "30:43-30:45",
    "text" : "Ridiculous.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh yeah, like he literally like put a piece of duct tape on there. On his Terry Glenn jersey, which he still had and was still wearing.",
    "timestamp" : "30:45-30:51"
  },
  {
    "text" : "Yes.",
    "speaker" : "Steve",
    "timestamp" : "30:52-30:52"
  },
  {
    "timestamp" : "30:53-31:14",
    "speaker" : "Andy",
    "text" : "But um I think in kind of true Terry Glenn fashion, um he didn't exactly show up for this game. And he finished with one catch for eight yards Uh and got thoroughly booed when he made that catch. Um I don't even think he had many targets to be honest."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:14-31:23",
    "text" : "Like he just led Tyla on, I think for the most part. But actually it was like it was Belichick's classic take the best player away and throw a ton of different looks and coverages at him and double him on almost."
  },
  {
    "timestamp" : "31:24-31:27",
    "speaker" : "Andy",
    "text" : "Exactly. Yeah. They seem to have a guy over the top every time. And yeah."
  },
  {
    "text" : "What Joey Galloway was injured for the Cowboys?",
    "speaker" : "Steve",
    "timestamp" : "31:27-31:29"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so Joey Galloway was their other weapon, but he wasn't playing this game, which opened the door for Antonio Bryant, remember him?",
    "timestamp" : "31:30-31:38"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:38-31:40",
    "text" : "Yeah, he sucked in this game."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh uh that I think is almost an understatement. This this was uh I was gonna save this as my worst, but um He made he had three catches, uh, which is is good, except uh he took him 12 attempts.",
    "timestamp" : "31:40-31:56"
  },
  {
    "timestamp" : "32:01-32:09",
    "speaker" : "Steve",
    "text" : "And it's like, yeah, it's Quincy Carter. You really can't be dropping balls. Yeah, that's what I'm saying. That's an achievement in and of itself."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, uh yeah. No, I think uh I think Antonio Bryant actually had more footballs hit him in the face mask than he did in the hands in terms of catching the ball. Like he was just having balls bounce off his face, which is uh a tough look when you're a wide receiver. Um But yeah, I also think there was some some great coverage on him too, because they kept I it felt like uh the Cowboys game plan offensively was run the ball, run the ball, take a deep shot to Antonio Bryant. And he was Never open. He was always like just extremely covered. Where it uh there was actually a few of them where probably he was the one breaking up uh interceptions instead of the other way around.",
    "timestamp" : "32:09-32:54"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "32:55-33:01",
    "text" : "Well, to be fair on Quincy Carter, he was just running the plays that Bill Parcell's called. He had no freedom to change it."
  },
  {
    "timestamp" : "33:02-33:42",
    "text" : "No. Oh no. Yeah. Yeah, there there was a whole lot of like kind of veiled uh displeasure, I think, from Parcells' Point of view towards Quincy Carter about how he didn't consider him a real quarterback, I think, is what it felt like. Just the way that they were talking about him and how they were talking about his and Belcheck's relationship. It's like, oh, I've never had to study this hard in my life. And uh, you know, I'm finally starting to feel like a real quarterback. And uh some some coaches yeah some some coaches uh Will will only have their quarterback read half the field, but uh that doesn't happen here in Dallas.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:44-33:47",
    "text" : "Hear me out on this one. I have a theory.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "All right.",
    "timestamp" : "33:47-33:48"
  },
  {
    "text" : "If Parcells hadn't been a huge douche and left immediately after taking the Patriots to the Super Bowl, suck around, and then by some miracle they draft, you know, Tom Brady anyways. He may have stunted Tombury's growth by not letting him you know call plays and make audibles and do all that. Possibly. Parcells could have been such a control freak, because he clearly was a control freak, right? That's why he left the Patriots is They're like, oh wow, Jerry Jones is letting him do everything and he's got all the control he wants and it's like But like that went all the way through to you know look plays he's calling he doesn't he doesn't let the OC call the plays he's calling the plays and He's not letting the quarterback change it. He's calling Parcells plays and he's doing Parcell's thing and Parcells is the is the end-all be all. And maybe you don't let Tom Brady do that, then Tom Brady doesn't become as good as he is.",
    "speaker" : "Steve",
    "timestamp" : "33:49-34:41"
  },
  {
    "timestamp" : "34:42-35:05",
    "speaker" : "Andy",
    "text" : "It's true. And also, does that offense look differently if it's a Parcells offense too, where he's more focused on building that suffocating defense and then doing that ground and pound? offense with a game manager at quarterback. So maybe maybe it would have worked out still because that's kind of what Brady was in 2001 was that game manager for that style of team."
  },
  {
    "timestamp" : "35:06-35:12",
    "text" : "But yeah, but Parsels might like win that Super Bowl and then have the Hebrists will be like, this works, you know.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:13-35:15",
    "text" : "Yep. Oh, I mean it had before he'd already won two Super Bowls."
  },
  {
    "timestamp" : "35:16-35:17",
    "speaker" : "Steve",
    "text" : "Definitely my way now."
  },
  {
    "timestamp" : "35:17-35:18",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "And uh had foregone the evolution of Tom Brady into being awesome. So what we're really saying here is Bill Parcell's stubbornness is the root cause of the Patriots dynasty.",
    "speaker" : "Steve",
    "timestamp" : "35:18-35:31"
  },
  {
    "speaker" : "Andy",
    "text" : "So moral of the story is fuck Bill Parcells.",
    "timestamp" : "35:31-35:34"
  },
  {
    "timestamp" : "35:34-35:43",
    "text" : "Yeah, well thank God he was such a dickhead and left. Exactly. Good riddance. It's a stinky tuna.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Can that tuna.",
    "timestamp" : "35:46-35:47"
  },
  {
    "speaker" : "Steve",
    "text" : "Chicken of the sea. Cow. Chicken of the sea, that's right.",
    "timestamp" : "35:49-35:53"
  },
  {
    "timestamp" : "35:54-36:28",
    "text" : "Um Oh, another good note for this game was that the Patriots were for the first time, I think, wearing their new silver jerseys. Yeah. Which I had completely forgotten about. I don't love it. Yeah, they just look like they're white but dirty. Especially when if it's not in the i in high def. Like yeah, it just it looks dirty. It it were kind of like the um the Rams uniforms now. I don't like them. You know, they're kind of like the the off-white kind of cream curly. They just look dirty and then they have the like puff paint outlines on the numbers.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "36:28-36:29"
  },
  {
    "text" : "Ugh Ugh. No man. Come on.",
    "timestamp" : "36:29-36:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "36:33-36:34",
    "text" : "I don't mind him."
  },
  {
    "text" : "No. It's so LA. They're trying to be trendy. It just doesn't come off right.",
    "timestamp" : "36:34-36:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:39-36:43",
    "speaker" : "Steve",
    "text" : "Andy, you are you the fucking judge of what is trendy or not?"
  },
  {
    "text" : "Uh yeah, I was voted class trendsetter. Thank you very much. Yeah, that's right. Because nobody else can can can get on my level style-wise. So I gotta make my own t-shirts.",
    "timestamp" : "36:43-36:55",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, okay. Or maybe your style is so shit, no one even bothers to make such crap clothing that won't sell.",
    "timestamp" : "36:55-37:01",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm sorry, were you voted a class trendsetter in high school? Because I was.",
    "timestamp" : "37:01-37:05"
  },
  {
    "timestamp" : "37:05-37:07",
    "speaker" : "Steve",
    "text" : "That was an ironic award."
  },
  {
    "timestamp" : "37:08-37:15",
    "speaker" : "Andy",
    "text" : "Regardless, it still happened and I can hold it over you. Oh boy."
  },
  {
    "speaker" : "Steve",
    "text" : "Speaking of things that I can't read.",
    "timestamp" : "37:15-37:18"
  },
  {
    "timestamp" : "37:18-37:19",
    "speaker" : "Andy",
    "text" : "What?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:19-37:21",
    "text" : "I said, I don't know what I was voted. I couldn't read the yearbook."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:21-37:47",
    "text" : "Well, that's that makes sense. You're voted least likely to learn how to read, probably. Um I think a big Part in this game that nobody really talked about, at least the announcers didn't, was um I'm coming around to your take that they weren't very good. Was that um This Patriots defense was a whole lot less injured than they have been in a while."
  },
  {
    "timestamp" : "37:48-37:50",
    "text" : "Yeah, they're getting guys back now",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "37:50-37:57",
    "speaker" : "Andy",
    "text" : "Cause last time we talked um last week who did they play? Uh oh the Broncos, yeah, and the Broncos ran all over 'em, right?"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "37:58-37:58",
    "speaker" : "Steve"
  },
  {
    "text" : "And you kind of almost forest.",
    "timestamp" : "37:58-38:00",
    "speaker" : "Andy"
  },
  {
    "text" : "He was legit and the stretch run game scheme was really good.",
    "speaker" : "Steve",
    "timestamp" : "38:00-38:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:04-38:13",
    "text" : "But also they had no remember Richard Seymour was a late scratch, so they had no Richard Seymour. Uh no Ted Johnson, like their linebacking crew is real thin."
  },
  {
    "text" : "No Ted Washington.",
    "timestamp" : "38:13-38:14",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "38:14-38:27",
    "speaker" : "Andy",
    "text" : "Right. So you get all three of those guys back here, and the Patriots, uh, how many rushing yards did they allow in this game? Any? Uh let's see. Dallas 28 carries, 84 yards as a team."
  },
  {
    "timestamp" : "38:27-38:32",
    "text" : "Ted Washington was legit. I mean, he definitely makes he changed that whole team inside there.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "He does. And they kind of mentioned a bit too where They were able to switch it up between him and Richard Seymour playing at that nose tackle too. So you can have like a lighter guy and whenever Richard Seymour seemed to line up inside. The cowboys guards would get called for holding cause he would just blow straight past him. There's one play where they actually showed the replay and So uh the ball got snapped and Richard Seymour just kind of stood up. And so the guard stood up and he just kind of just kind of like pushed him out of the way and ran past him. And the guy had to tackle his ass.",
    "timestamp" : "38:32-39:03"
  },
  {
    "text" : "Seymour was they had no answer for.",
    "timestamp" : "39:04-39:06",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "39:06-39:19",
    "speaker" : "Andy",
    "text" : "No, and I I remember, you know, you you think of like good defensive players, you're like, oh yeah, Richard Seymour, he's on that list, but I'd forgotten how much of like a man amongst boys he actually was, you know what I mean?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. They're all like trying to campaign for his Hall of Fame right now. Like Brady's going pretty hard on it, Belichick is as well and saying like he didn't have a ton of stats. like sacks but he played everywhere he played end inside outside every single then he played them all really well and like and he was again watching games like these where Cowboys offensive line was like the strength of their team and he's just saying, see you later. And even the announcers like that was Leroy Glover. He's like there, he's like all pro and he's a massive dude, and he's just",
    "timestamp" : "39:19-39:47"
  },
  {
    "text" : "Yeah, exactly. He's just he's pushing. Yeah, yeah. Leroy Glover was um a second team all pro and a um And a pro bowler this year. Yeah, it didn't fucking matter. Same with Flozell Adams and Larry Allen. Like this this this this offensive line was stacked. And Seymour is just like making look like rookies. Yeah, it was it was a it's a huge shift when he's in there versus when he's not. Like they're just not allowing any run. game to get going. Like they uh obviously they had some runs, but they was it it just never kind of got rolling like we've seen in some of these other games.",
    "speaker" : "Andy",
    "timestamp" : "39:47-40:25"
  },
  {
    "timestamp" : "40:26-40:29",
    "text" : "Yeah they couldn't catch like the four four yards a clip so they can just keep running and running it right.",
    "speaker" : "Steve"
  },
  {
    "text" : "Exactly, which is what we saw last week when he wasn't there and and the Broncos, especially at the end of the game, they're just like running it and running it and they just can't make the stop. Um and on that note, like last season too, remember, there was that big issue where they couldn't stop at anybody because they didn't have that guy in the middle. Um and I think that was actually in the book too that you uh started to read. It might be chapter two, so yeah, I don't know if you've got there yet, but um this season that we just watched, the 2020 season.",
    "timestamp" : "40:30-40:57",
    "speaker" : "Andy"
  },
  {
    "text" : "It was like they couldn't stop the fucking run.",
    "timestamp" : "40:57-40:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:59-41:13",
    "text" : "Very similar, right. Um and so last season, two thousand two, they were thirty-first against the run on defense, and this year with you know the Ted Washingtons in the the Richard Seymour is there now seventh in the league."
  },
  {
    "text" : "Yeah, we shouldn't underappreciate it. I think he's only here this year because we draft Vince next year.",
    "timestamp" : "41:14-41:20",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "41:20-41:23",
    "text" : "I think you're right. Mount Washington does not stick around for a long time.",
    "speaker" : "Andy"
  },
  {
    "text" : "Because Vince definitely got one Super Bowl ring for sure.",
    "timestamp" : "41:24-41:26",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "He's not here this year.",
    "timestamp" : "41:27-41:28"
  },
  {
    "text" : "He's got to get one next year.",
    "speaker" : "Steve",
    "timestamp" : "41:28-41:29"
  },
  {
    "timestamp" : "41:29-41:40",
    "speaker" : "Andy",
    "text" : "Right, let's see. Uh Ted Washington. He was yeah, he was only here for 2003 and then after this, two years in Oakland, two years in Cleveland. Man, he started 1991 though. Like he's been around for a long time."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "41:41-41:41",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "41:42-41:44",
    "text" : "Yeah, Jesus.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "41:44-41:50",
    "speaker" : "Steve",
    "text" : "That's uh I know we've mentioned him before, but like Bobby Hamilton is also sneaky, legit."
  },
  {
    "timestamp" : "41:50-42:08",
    "text" : "Very underrated, yep. Yeah, because he he's the one that that showed up big in the uh in the snowball game and was just like manhandling people. And I think also some if we're talking underrated defensive players on this this team, Tyrone Poole, who was a free agent pickup too.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "42:09-42:12",
    "text" : "Yeah, I'd also I'd always sort of assume Tyrone Pool sucked."
  },
  {
    "text" : "No, I I I remember him being good, but I it was similar to like not quite on the same level as as Seymour, but it was one of those things where I forgot why I thought he was good. I'm just like, oh yeah, no, I'll add him to the list of like good players. But yeah, he's almost, I mean he's he's no Ty Law, but he was kind of almost that locked down corner on the other side of Ty Law, especially when he's going up against the number two guy. He's kind of a bigger guy than Ty Law, so he was able to take the taller receivers. And the way he plays a deep ball is like clinical.",
    "speaker" : "Andy",
    "timestamp" : "42:12-42:43"
  },
  {
    "speaker" : "Steve",
    "text" : "It's ridiculous. He loses his job, probably to what? Asante. Next year. Something like that.",
    "timestamp" : "42:43-42:51"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:51-42:59",
    "text" : "Yeah, I I think he was basically just a rental. Uh he was here. Yeah."
  },
  {
    "text" : "Three years. Yeah, I mean he has a good year this year.",
    "timestamp" : "42:59-43:02",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:02-43:08",
    "text" : "Yeah, this is the only year he starts all 16 games though. That it's four games in 2004 and one game in 05."
  },
  {
    "speaker" : "Steve",
    "text" : "Before we get the skills to our performance, but I don't know, I'd never really thought he was awesome.",
    "timestamp" : "43:09-43:14"
  },
  {
    "text" : "No, but I remember him being good right around now. Um kind of the same way Otis Smith was in 2001. Where you had that guy opposite Ty Law that was shutting down the number two receiver on the opposite team. Right. So it felt very similar to that. Uh do we have anything to talk about on offense? That's off one. It was because they had no wide receivers because Troy Brown is out again this week with a leg injury. Uh so no Shroy Brown and that I think hurt them in terms of staying on the field and like keeping drives going. Because uh I think even David Gibbons went out of at some point during this game, he just like stopped showing up. So they had to rely on people like uh Daniel Graham. Brady was targeting him a lot, especially on third down.",
    "speaker" : "Andy",
    "timestamp" : "43:14-44:08"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh wait, wait. I thought his name was David Graham.",
    "timestamp" : "44:09-44:11"
  },
  {
    "timestamp" : "44:12-44:13",
    "speaker" : "Andy",
    "text" : "Daniel Graham?"
  },
  {
    "text" : "They called him David Graham like four times.",
    "timestamp" : "44:13-44:16",
    "speaker" : "Steve"
  },
  {
    "text" : "Did they really?",
    "timestamp" : "44:16-44:17",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "44:17-44:37",
    "speaker" : "Steve",
    "text" : "Yes. I missed that. No, maybe if you called him Daniel instead of David, he would fucking catch it. Uh and Thysman would correct him each time. Like Thizman make a point of saying Daniel Graham and When fucking Paul or whoever the play-by-play guy was would get it wrong every time."
  },
  {
    "speaker" : "Andy",
    "text" : "Not gonna stick. I mean who needs to remember their names? It's not like part of their job or anything, so whatever. It's all good.",
    "timestamp" : "44:37-44:46"
  },
  {
    "text" : "They were the worst.",
    "timestamp" : "44:47-44:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:49-44:50",
    "text" : "I liked them.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I almost would rather maybe not quite, but they were almost as bad as Deirdorf.",
    "timestamp" : "44:51-44:56"
  },
  {
    "speaker" : "Andy",
    "text" : "No, no, no, no, no. We're definitely not going that far. Rain it in, Steve Brown. Um, yeah, no, I think uh if we're talking about The only player who on offense really did anything. It was my Early dynasty MVP Kevin Falk again.",
    "timestamp" : "44:56-45:23"
  },
  {
    "text" : "Wait, wait, wait, wait. You're expanding it from this season to the entire early dynasty?",
    "timestamp" : "45:23-45:27",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "45:27-45:32",
    "speaker" : "Andy",
    "text" : "Yep. Well it was last season too, and he's continuing it into this season, I think."
  },
  {
    "text" : "No.",
    "timestamp" : "45:32-45:33",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "45:33-45:50",
    "text" : "Yep. It's the engine that keeps the the motor of the offense running. When they need that yard and Troy Brown's not there, or he's he's actually getting more attention now because of the year he had in 2002 and he's battling injuries, who do you go to?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Mm-hmm.",
    "timestamp" : "45:50-45:50"
  },
  {
    "timestamp" : "45:50-45:52",
    "speaker" : "Andy",
    "text" : "Who do you go to?"
  },
  {
    "speaker" : "Steve",
    "text" : "Mm-hmm.",
    "timestamp" : "45:52-45:52"
  },
  {
    "timestamp" : "45:52-46:12",
    "speaker" : "Andy",
    "text" : "Yeah, that's right. You go to my boy, Kevin Falk, who had himself had himself a solid little game. Well, I mean, compared to everybody else. Let's see, he uh eight carries for 11 yards. Oh, so maybe not. Uh yeah. Four catches for 22 yards."
  },
  {
    "text" : "Okay, we have Antoine Smith got 16 carries.",
    "timestamp" : "46:12-46:14",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "46:14-46:18",
    "speaker" : "Andy",
    "text" : "Oh sorry, no, three catches for 22 yards. Long as the 12."
  },
  {
    "text" : "So he got 33 yards.",
    "speaker" : "Steve",
    "timestamp" : "46:18-46:21"
  },
  {
    "timestamp" : "46:22-46:26",
    "speaker" : "Andy",
    "text" : "Uh he was the leading receiver. Him and Christian Fourier both had three catches."
  },
  {
    "timestamp" : "46:27-46:29",
    "speaker" : "Steve",
    "text" : "Well yeah, in catches, but not in yards."
  },
  {
    "speaker" : "Andy",
    "text" : "Well he's a running back. He also had he also had a huge gain on a screen callback too.",
    "timestamp" : "46:29-46:38"
  },
  {
    "timestamp" : "46:39-46:40",
    "text" : "Oh, okay.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "46:40-47:01",
    "speaker" : "Andy",
    "text" : "Which probably would have put him close to The team lead in receiving yards, which was Dion Branch, two catches for 69 yards, along a 46. Not a great day for uh Patriots receivers in general. David David Gibbons, two catches, 67 yards, longest of 57."
  },
  {
    "text" : "So weed though. Hit those long ones.",
    "speaker" : "Steve",
    "timestamp" : "47:01-47:04"
  },
  {
    "text" : "Yeah, I mean that that's kind of seemed to be it almost felt like the Patriots were waiting for the cowboys to blitz and when they did they take a deep shot and it worked every time but because it worked so well the cowboys stopped blitzing and the patrons like didn't really it almost felt like they were content to just like they knew that their defense could handle Quincy Carter, so they're like, we're just not gonna take any chances.",
    "timestamp" : "47:04-47:28",
    "speaker" : "Andy"
  },
  {
    "text" : "It was definitely a grinded out game for sure. That's why it was so fucking boring.",
    "speaker" : "Steve",
    "timestamp" : "47:28-47:31"
  },
  {
    "text" : "Yeah, there's a Because this well, oh yeah, so there were a lot of three and outs.",
    "timestamp" : "47:31-47:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "There's so many punts.",
    "timestamp" : "47:38-47:39"
  },
  {
    "text" : "A lot of punts. Um",
    "timestamp" : "47:40-47:42",
    "speaker" : "Andy"
  },
  {
    "text" : "Ken Walter had eight. Toby Gowen had seven. Yeah.",
    "timestamp" : "47:43-47:47",
    "speaker" : "Steve"
  },
  {
    "text" : "Let's see. One, two, three, four, five, six, seven. Eight, three and outs.",
    "timestamp" : "47:48-47:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "The the yards per punt was 36 and 34. Yeah, oh yeah the punting was the punting was atrocious.",
    "timestamp" : "47:57-48:07"
  },
  {
    "speaker" : "Andy",
    "text" : "I they said that um Ken Walter was the 31st ranked right no I think it was the worst pun worst ranked punter in the league. Either 31st or 32nd ranked punter in the league.",
    "timestamp" : "48:08-48:20"
  },
  {
    "timestamp" : "48:21-48:49",
    "speaker" : "Steve",
    "text" : "So I had this I had this question and that sort of sparked it. Like nowadays I mean, we just finished that 2020 season and Jake Bailey is like our best player on our team. He's the only one. Scotch him for for and that's a classic loser. Bright spot like well our punter was really good. Yeah. Because he was, and like we've had like really good punting for a while now, you know. You kind of take it for granted."
  },
  {
    "timestamp" : "48:49-48:50",
    "speaker" : "Andy",
    "text" : "It was Ryan Allen before that. Yeah."
  },
  {
    "timestamp" : "48:51-48:54",
    "speaker" : "Steve",
    "text" : "Remember he won the Super Bowl against the Rams. He was so good in that."
  },
  {
    "timestamp" : "48:54-48:54",
    "speaker" : "Andy",
    "text" : "Yep."
  },
  {
    "timestamp" : "48:55-49:05",
    "speaker" : "Steve",
    "text" : "And it's like, when did that flip? Like, who was the first of the Patriots punters who were like, dude, this guy is legit? I think I but I want to see if you got one."
  },
  {
    "timestamp" : "49:06-49:27",
    "text" : "I think it was actually Lee Johnson until he uh struggled against the Chargers in 2001, and then they had a string of Ken Walters. Uh I don't know who I would put on that list. Who do you you're you're not talking about Zoltan Mesco, are you? Zoltan! I don't think he was as good as his name.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, he had the fucking Z-han thing. That thing is sweet. Everyone loved Zultan.",
    "timestamp" : "49:28-49:33"
  },
  {
    "speaker" : "Andy",
    "text" : "He did have the Z-han thing.",
    "timestamp" : "49:33-49:34"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:34-49:42",
    "text" : "It's a great name. Dude. I mean. What a name? I feel like he he was 2010."
  },
  {
    "timestamp" : "49:42-49:49",
    "text" : "Yeah, and then who is after that? Like give give me a list of Paiges Punters. Oh god.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "49:49-50:07",
    "text" : "Yeah, that's that's a hmm. But I feel like he was the first one where like the dude was like good enough to be like to come up with the Zoltan thing, you know. You know, Lee Johnson ain't getting a nickname. He's not getting any like any calls. status where Zoltan was like good enough to like you can't you can't do that if he sucks.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:08-50:13",
    "text" : "Yeah I I don't I mean he wasn't on like a Ryan Allen level though"
  },
  {
    "speaker" : "Steve",
    "text" : "No, he wasn't like awesome awesome.",
    "timestamp" : "50:13-50:15"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:15-50:17",
    "text" : "No, he was like middle of the road, punter, I think."
  },
  {
    "text" : "But I remember when like he he left New England and he didn't sign on anywhere and I was like, how did he not sign on because he's good? And same thing with With Ryan Allen. Why did Ryan Allen not catch on with anybody? Because he was good. Like he was a solid punter. He wasn't maybe, I mean, I think we're better off with the guy we have, but they're both like He was still good.",
    "timestamp" : "50:17-50:33",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "50:33-51:01",
    "speaker" : "Andy",
    "text" : "Yeah, yeah. The fact that the Patriots drafted a punter and then went with the rookie over Ryan Allen. And then Ryan Allen didn't get picked up by anybody was a little baffling to me too. I don't know why that was. But yeah, this this I because I remember this being an issue for a while, just the punting from the pages in general, which is strange because of how much Focus Belichick puts on special teams in general."
  },
  {
    "speaker" : "Steve",
    "text" : "Patriots career punting average. Okay.",
    "timestamp" : "51:01-51:05"
  },
  {
    "timestamp" : "51:06-51:06",
    "speaker" : "Andy",
    "text" : "Okay."
  },
  {
    "timestamp" : "51:07-51:10",
    "speaker" : "Steve",
    "text" : "Number one, Matt Castle."
  },
  {
    "timestamp" : "51:11-51:14",
    "speaker" : "Andy",
    "text" : "Oh, right, yes. One punt for like 60 yards, right?"
  },
  {
    "text" : "57, yeah.",
    "speaker" : "Steve",
    "timestamp" : "51:14-51:15"
  },
  {
    "timestamp" : "51:15-51:16",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:15-51:16",
    "speaker" : "Steve",
    "text" : "Legitimate."
  },
  {
    "text" : "It rolled a lot. Where's Tom Brady on that? Because he's got a few punts.",
    "speaker" : "Andy",
    "timestamp" : "51:16-51:21"
  },
  {
    "timestamp" : "51:22-51:25",
    "speaker" : "Steve",
    "text" : "Uh number two is Jake Bailey."
  },
  {
    "text" : "Okay, makes sense.",
    "timestamp" : "51:25-51:26",
    "speaker" : "Andy"
  },
  {
    "text" : "Three, Ryan Allen. Four Tom Tupa. Wow. Five, Zoltan.",
    "speaker" : "Steve",
    "timestamp" : "51:26-51:31"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:32-51:32",
    "text" : "Okay."
  },
  {
    "timestamp" : "51:33-51:35",
    "text" : "Josh Miller, 04-06.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yep, yep. Yeah, he was probably the first, like Solid punter that you had that you didn't think, oh fuck, here we go again.",
    "speaker" : "Andy",
    "timestamp" : "51:35-51:44"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Uh and then Lee Johnson is number 10, 99 in 2001. Chris Hansen? I don't remember him. 0709?",
    "timestamp" : "51:44-51:55"
  },
  {
    "timestamp" : "51:55-51:55",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:56-51:57",
    "text" : "Probably didn't use him that much."
  },
  {
    "text" : "No, not in 07.",
    "timestamp" : "51:57-51:59",
    "speaker" : "Andy"
  },
  {
    "text" : "Todd Sauerbron. He's the old Panthers guy.",
    "speaker" : "Steve",
    "timestamp" : "51:59-52:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:03-52:05",
    "text" : "He was the the like the beefy one."
  },
  {
    "text" : "Yeah, 2006.",
    "timestamp" : "52:05-52:06",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "52:07-52:07",
    "speaker" : "Andy",
    "text" : "Yep."
  },
  {
    "timestamp" : "52:08-52:22",
    "text" : "He's fourteen. Alright. Ken Walters 21. For point of reference, Ken Walters at 38. 6 yards per punt. Jake Bailey's at 46.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "52:24-52:31",
    "speaker" : "Andy",
    "text" : "That's I mean, uh my neither of us are good at math, but that seems like a a decent difference."
  },
  {
    "timestamp" : "52:31-52:32",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "52:32-52:33",
    "text" : "Oh boy.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "52:34-52:42",
    "text" : "See Tom Brady on here. 35. He has an average of 34 yards per punt."
  },
  {
    "text" : "With I think two punts in his career. Because I remember one I think sparked it was against the Jets and it sparked a uh a scuffle at the end of the game between some Jets players.",
    "speaker" : "Andy",
    "timestamp" : "52:43-52:55"
  },
  {
    "text" : "Interestingly, Adam Benateri is on here.",
    "timestamp" : "52:56-52:59",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "53:00-53:00",
    "text" : "Oh yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Number 30. I don't remember him punting.",
    "timestamp" : "53:01-53:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:03-53:16",
    "text" : "He only ever did it once, and it was like they were it they set up for a long field goal. Oh really? And they they would like snap it directly to him and he would just pooch it in there. Try to pin him down. And yeah, not great though."
  },
  {
    "speaker" : "Steve",
    "text" : "The worst, number 41, Jeff White, 73, six punts, 27 hours.",
    "timestamp" : "53:16-53:22"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm pretty sure you and I can probably punt it further than 27 yards. Maybe not very high, but it would go more than 27 yards. I'm guessing in 73 he wasn't taking very high either.",
    "timestamp" : "53:23-53:34"
  },
  {
    "speaker" : "Steve",
    "text" : "I guess a preview of what's to come.",
    "timestamp" : "53:35-53:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:37-53:37",
    "text" : "Uh-oh."
  },
  {
    "text" : "2003 Brooks Barnard. Who? Yeah. Who?",
    "timestamp" : "53:37-53:43",
    "speaker" : "Steve"
  },
  {
    "text" : "Okay.",
    "timestamp" : "53:43-53:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Ten punts. Thirty six and a half yard half ridge, he's 31st.",
    "timestamp" : "53:44-53:49"
  },
  {
    "text" : "Spoiler alert.",
    "speaker" : "Andy",
    "timestamp" : "53:50-53:51"
  },
  {
    "text" : "Yeah, so we're like, fuck it, Ken Walter, you suck. Alright, bring this guy on. Oh good. So I am I'm in for the Brooks Barker buttons.",
    "timestamp" : "53:51-54:02",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:02-54:28",
    "text" : "Can't wait. Something to look forward to in these games, apparently. Oh my god. Um I think they're uh speaking of uh forty yard uh distances, they showed a stat in this game where Tom Brady this season Has as many touchdowns of 40 yards or more uh as he had 40 yard completions last season."
  },
  {
    "text" : "Oh yeah, they say he's already up to there.",
    "speaker" : "Steve",
    "timestamp" : "54:28-54:30"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. He's had seven completions and three touchdowns of 40 yards or more this season, and he had three completions total over More than 40 yards last season.",
    "timestamp" : "54:30-54:38"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean, Ken Walter probably doesn't even have that many 40 yard punts. He couldn't even punt it to the first down marker on one on play.",
    "timestamp" : "54:39-54:45"
  },
  {
    "text" : "Yeah, it was uh I think I I wrote it down. Uh let's see, it was fourth and thirty-seven and Ken Walter had a 34-yard punt.",
    "timestamp" : "54:45-54:54",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:54-54:57",
    "speaker" : "Steve",
    "text" : "Yeah, I saw him bounced and he making the fucking first down by"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "55:00-55:01",
    "text" : "Not a good look."
  },
  {
    "speaker" : "Steve",
    "text" : "It's infuri and it wasn't like you're backed up your own side too.",
    "timestamp" : "55:01-55:04"
  },
  {
    "text" : "Yeah, and he punched it to like midfield. Awful. Because they had driven to midfield. Yeah. And then Falk had the screen, like a big screen that got him like it about the 20-yard line of the Cowboys that got called back for a hold. And then the next play, the um it was like a running play, and then there was that egregious uh late hit call on Joe Andruzi that wasn't.",
    "timestamp" : "55:05-55:33",
    "speaker" : "Andy"
  },
  {
    "text" : "Like I think the referees in this game were overbearing.",
    "timestamp" : "55:34-55:38",
    "speaker" : "Steve"
  },
  {
    "text" : "They were not good. To the point where even the broadcast was criticizing the calls. That's when you know it's bad when they're like, that was bad. Oh, oh.",
    "speaker" : "Andy",
    "timestamp" : "55:39-55:47"
  },
  {
    "timestamp" : "55:47-56:07",
    "text" : "There's so many penalties. And it was like it just it that's another reason why this game's fucking unwatchable is because it was just so disjointed because of They couldn't get in any flow and they're running the ball a shitload and there's a shitload of penalties. And every time the goddamn ref wanted to call a penalty, he would do the hand signal. So you knew what the fuck it was.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "56:07-56:07",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "But then it would take him like three minutes to actually like find space in the field and he walks like 20 yards away from everybody to turn on his mic on and say it and you're like we already know what it is",
    "speaker" : "Steve",
    "timestamp" : "56:08-56:19"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and and then uh there was one where there was a penalty on the cowboys. But they were like within the on third down and it was within like borderline field goal range. And so he just assumed that they wanted to decline it to bring it fourth down. And so he announced he was like, Oh yeah, the uh It's uh, I don't know, sh uh uh hands to the face on the on the offense. Uh Pelogy's decline brings a fourth down to Belichick's they cut to Belichick being like What the fuck? No, I want I want to accept the penalty. And so that there's like another five minutes of that, and then he comes back. He's like, uh, during the announcement, the patrons have changed their mind and we'll accept the penalty. And Thizman's like, that's not how that works. You're not allowed to change your mind. He just didn't ask them. And just like straight up threw him under the bus.",
    "timestamp" : "56:22-57:08"
  },
  {
    "speaker" : "Steve",
    "text" : "They also called Offensive penalty offensive pass interference on defense number 82.",
    "timestamp" : "57:09-57:15"
  },
  {
    "text" : "Yep. Which was actually offensive pass interference.",
    "timestamp" : "57:16-57:18",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Penalty off on the Patriots. Yes. On the defense, they called offensive pass interference on 82, Jason Witten. Yeah. Marked the penalty on the Patriots. And then everyone was like, wait, what?",
    "timestamp" : "57:18-57:29"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "57:29-57:29"
  },
  {
    "text" : "And then they oh shit, our bad. We gotta go 20 yards that way.",
    "timestamp" : "57:29-57:34",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, yeah. Yeah.",
    "timestamp" : "57:34-57:36",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Shit together.",
    "timestamp" : "57:37-57:38"
  },
  {
    "timestamp" : "57:38-58:06",
    "speaker" : "Andy",
    "text" : "And then they called like right at the end of the game, second and last play, uh, the Cowboys took a deep shot and I think it was Eugene Wilson. Went and lit the wide receiver up, which at the time was a legal call. And uh they threw a flag for uh after the play was over, unsports and like conduct, defensive player launch into the the offensive wide receiver. And they're like the that's That's not a a penalty."
  },
  {
    "text" : "Even like by today's standards, it wasn't that it wasn't bad. It was like cause he led with his shoulder. It was like a trying to separate the guy in the ball.",
    "speaker" : "Steve",
    "timestamp" : "58:06-58:13"
  },
  {
    "timestamp" : "58:14-58:15",
    "speaker" : "Andy",
    "text" : "And caught him like square in the chest."
  },
  {
    "text" : "Maybe defenseless receiver thing, but like",
    "speaker" : "Steve",
    "timestamp" : "58:16-58:18"
  },
  {
    "speaker" : "Andy",
    "text" : "It probably would be now, but even then it would be kind of close.",
    "timestamp" : "58:18-58:22"
  },
  {
    "speaker" : "Steve",
    "text" : "Man, no, there's so much more egregious shit out there to call. And like they didn't call any passing inferences.",
    "timestamp" : "58:22-58:27"
  },
  {
    "timestamp" : "58:28-58:35",
    "speaker" : "Andy",
    "text" : "But that's where the commentators got livid. Like all of them, like that was a garbage call. This like didn't leave it."
  },
  {
    "speaker" : "Steve",
    "text" : "Paul was like, oh my god, that great call. And Joe was like, no, it's not. And then they fucking argued for like five minutes into the next play about is this a great call or not? Oh, dude, that three-man booth was brutal.",
    "timestamp" : "58:36-58:50"
  },
  {
    "timestamp" : "58:50-59:04",
    "text" : "And then the next play? Ty law interception in the end zone to end it. And then he started running like he caught it probably five yards in the end zone running backwards, like towards the back of the end zone. He's like, you know what? Nah, fuck this team.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "59:06-59:08",
    "text" : "Well there's no time left either. It was like two seconds.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "59:09-59:30",
    "text" : "So they so they cut to Belichick. Oh well he could have just down and the game's over, but he's like, you know what? Nah, fuck this, and decide to run it out. And Belichak was like, fucking go, let's go. Like he wanted that. Yeah. But then of course you're to your point the commentator's like, well, you know, Belichick obviously didn't want him running that out. He's they're gonna cause then he tried to like lateral it to somebody And that didn't worry about fucking whatever.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "59:34-59:36",
    "speaker" : "Steve",
    "text" : "Oh, he's gonna get a talking to after the game."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I got a talking to on Monday. And like celebrating because he knew the game was over already. Anyway, the play was literally did not matter. Yeah, there's no there's no seconds left. So I mean you're just trying to make it close at that point. You're just trying not to get shut out. But uh yeah, I think that was a a pretty fitting end to the game. And then Belichick and uh Parcells met in the middle and hugged it out a bit. And then Belichick was like. legitimately like giddy giddily celebrating and hugging his team, kind of hugging his players and stuff. Yeah, he was excited that he won this football game, which is dope.",
    "timestamp" : "59:36-01:00:20"
  },
  {
    "text" : "We probably saw that uh ESPN poll that they did during the game.",
    "timestamp" : "01:00:21-01:00:26",
    "speaker" : "Steve"
  },
  {
    "text" : "I have a screenshot of it, which I will, if I remember, I will post it to uh Twitter when this comes out. Um yes. Let me make a note of this so I don't forget. Who is Coach of the Year? Yeah, so they did they did a uh a poll that you could uh I don't know call in Texas. Sports Nation poll.",
    "timestamp" : "01:00:26-01:00:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:00:48-01:00:50",
    "speaker" : "Steve",
    "text" : "Espn. com is the internet is a thing now."
  },
  {
    "timestamp" : "01:00:50-01:01:17",
    "speaker" : "Andy",
    "text" : "Oh, that's right. Yeah, it's sports nation. That was ESPN. com. That's right. Sunday stud was The name of the poll. Who's the NFL coach of the year? And the options are Bill Parcells, Marvin Lewis, Dick Vermil, John Fox, and Bill Belichick. Uh for some context, Dick Vermil had his Chiefs at uh 9-1, and they had only just lost their first game this week to Marvin Lewis's Bengals, who I think were 5-5."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Mom",
    "timestamp" : "01:01:18-01:01:18"
  },
  {
    "timestamp" : "01:01:19-01:01:28",
    "speaker" : "Andy",
    "text" : "Um but I think this may have been like early Marvin Lewis when the Bengals like they they showed some like after the game they're gonna talk about how the Bengals aren't the Bungles anymore."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but now we know that five and five in eight hundred is",
    "timestamp" : "01:01:28-01:01:32"
  },
  {
    "text" : "Yeah, that's exactly where he's gonna be. He he he plateaued right there in this poll. Uh Parcells had Taken over the Cowboys is his first year with the Cowboys. Um had taken over, but they already had like some good pieces on defense. And uh they had those wide receivers in Terry Glenn and Joey Galloway. Uh John Fox with the Panthers. I think this was taking over from remember 2001 when we had Bobby on, our brother-in-law, the Panthers fan talking about uh the end of that season, they were one in fifteen. All right. And they just like gave up on in that game against the Patriots and they just got their yeah, they got their shit kicked in. And so I think John Fox had taken over that team and he was like rebuilding it here.",
    "speaker" : "Andy",
    "timestamp" : "01:01:33-01:02:17"
  },
  {
    "speaker" : "Steve",
    "text" : "And they go to the Super Bowl this year.",
    "timestamp" : "01:02:17-01:02:19"
  },
  {
    "timestamp" : "01:02:19-01:02:38",
    "text" : "They do. Um, and then Bill Balichek, obviously, we talked about last week, is the only team in recent memory to have uh the league lead in number of different starters. I think they had 40 at this point. And it was the only Team to actually have a winning record.",
    "speaker" : "Andy"
  },
  {
    "text" : "That he would then talked about it day and wall. This also drove me nuts. They're like Wow, Bill Belichick doing so good with all his injuries. And look at Jerry Jones though giving up all the control to fucking Bill Barcel. Like it was the same sentence.",
    "speaker" : "Steve",
    "timestamp" : "01:02:38-01:02:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. As if those two things were the same. For the record, Bill Par Bill Belichick finished last in this poll out of five with 10. 4%.",
    "timestamp" : "01:02:52-01:03:01"
  },
  {
    "speaker" : "Steve",
    "text" : "Hater feel. That's what I'm saying. He knows. He sees that poll.",
    "timestamp" : "01:03:01-01:03:04"
  },
  {
    "text" : "Uh first, uh the the the coach that he would beat tonight, Bill Parcells, 34. 8%, which of all these guys, I would probably put last, honestly. Uh yeah, he's got his defense playing well, but I think it's a a stacked defense, really, from the sounds of it, the way they were talking about it. Um and I think it was Thyseman who was kind of disagreeing with the poll. They're like, yeah, Parcells, I mean If you're gonna put anybody, put like Vermil or Marvin Lewis up frontly. Okay.",
    "speaker" : "Andy",
    "timestamp" : "01:03:04-01:03:30"
  },
  {
    "timestamp" : "01:03:31-01:03:40",
    "speaker" : "Steve",
    "text" : "Someone said Belcheck just because all the injuries over, which it makes sense, I mean Yeah that's the hardest part about coaching is when you're injured and you're just plugging and playing and still playing really well."
  },
  {
    "text" : "And I and I think, you know, hindsight is also 2020 where we know that even with all these things and these close grinded out games, they don't lose again this season and they win a Super Bowl. So with all that exception too, right?",
    "speaker" : "Andy",
    "timestamp" : "01:03:40-01:03:53"
  },
  {
    "speaker" : "Steve",
    "text" : "Parcells is very like media savvy and everyone in the media loves Parcell. and Belichick has the exact opposite you know reputation.",
    "timestamp" : "01:03:53-01:04:02"
  },
  {
    "text" : "The literal opposite.",
    "timestamp" : "01:04:02-01:04:03",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:04:03-01:04:13",
    "speaker" : "Steve",
    "text" : "He's able to like cultivate and I mean winning all the Super Bowls allows him to just continue to be that way and just be kind of addictive. Everybody which personally about it."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:13-01:04:24",
    "text" : "Oh yeah, yeah, no, me too. Um but he should probably fight an offense because I'd like to read you the Cowboys drive chart and the result of each drive."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:04:24-01:04:25",
    "text" : "Yeah, let's go."
  },
  {
    "text" : "Are you ready for this?",
    "speaker" : "Andy",
    "timestamp" : "01:04:25-01:04:26"
  },
  {
    "text" : "Wait, wait, before we go there, uh at the end of the game, the announcer said, wow, this game really lived up to the billing.",
    "speaker" : "Steve",
    "timestamp" : "01:04:27-01:04:34"
  },
  {
    "text" : "I agree. The billing?",
    "timestamp" : "01:04:35-01:04:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh.",
    "timestamp" : "01:04:38-01:04:38"
  },
  {
    "speaker" : "Andy",
    "text" : "They just they try to sneak that by you, Steve, but he can't sneak a pun by me.",
    "timestamp" : "01:04:40-01:04:43"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:04:45-01:04:46",
    "text" : "Too pissed off."
  },
  {
    "timestamp" : "01:04:48-01:05:04",
    "text" : "Uh all right, so Cowboys drives in this game. There were 12 of them. As we know, none of them ended in a score. But here it was punt, punt, punt, punt, punt, end of half. Punt, punt, interception, downs, interception, interception.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:05:06-01:05:07",
    "text" : "Thrilling."
  },
  {
    "timestamp" : "01:05:07-01:05:13",
    "text" : "Not great. Uh their longest drive was 48 yards. They did twice to end each half.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:05:14-01:05:15",
    "text" : "That's Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Not great. And that last drive was literally just like the Patriots playing pre-event. Be like, yeah, I mean, you're gonna take all minute 56 you have left to score twice, and it's not gonna happen. And it didn't end up with the interception. Didn't even happen once. Just no, just not great. I mean, that's what you get when you have Quincy Carter. Not running the ball and trying to throw it instead. Uh and throwing it to Antonio Bryant, who's going to catch three of the 12 passes his way.",
    "timestamp" : "01:05:15-01:05:40"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:05:40-01:05:49",
    "text" : "He had a couple bad interceptions. I mean someone weren't one of them wasn't his fault where Yeah, bounce off bounce off Witten into Tyla's hands."
  },
  {
    "timestamp" : "01:05:49-01:06:07",
    "text" : "Uh it was still, I think, his fault for making that decision because he tried to do a bootleg and Willie McGuinness didn't buy it. And so he basically ran backwards fifteen. It all it was very Drew Bledsoe esque almost, where he ran backwards 10 yards and tried to kind of sidearm it around him to the tight end in the flat, who was covered by Ty Law.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:06:07-01:06:10",
    "text" : "Yeah, it wasn't a great throw. But it was a little unlucky.",
    "speaker" : "Steve"
  },
  {
    "text" : "It was. It was behind him, but basically Witten kind of knocked it straight up into Tylaw's arms. So in that way it was unlucky.",
    "timestamp" : "01:06:10-01:06:18",
    "speaker" : "Andy"
  },
  {
    "text" : "where he like just misread the cover.",
    "speaker" : "Steve",
    "timestamp" : "01:06:21-01:06:22"
  },
  {
    "text" : "He threw it to Tyrone Poole.",
    "speaker" : "Andy",
    "timestamp" : "01:06:23-01:06:24"
  },
  {
    "speaker" : "Steve",
    "text" : "It was like not even a receiver around him.",
    "timestamp" : "01:06:25-01:06:27"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And uh I think the last one was Just Tylaw running the route better than the receiver because he literally caught it in stride where the receiver probably should have been and wasn't because Tyla was there instead. Yeah, it was a perfect one. Do you want to do best and worse?",
    "timestamp" : "01:06:27-01:06:45"
  },
  {
    "text" : "Yeah, I think we're in that.",
    "speaker" : "Steve",
    "timestamp" : "01:06:45-01:06:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I think uh I don't think I have any other big old points. You want to go first?",
    "timestamp" : "01:06:47-01:06:51"
  },
  {
    "timestamp" : "01:06:52-01:06:54",
    "text" : "Uh no, you go first. I have a lot.",
    "speaker" : "Steve"
  },
  {
    "text" : "All right. I'll do a couple. Let's see. The one commercial coming back from the game that they do, you know, where they do like the sponsored by bullshit when they're showing shots of the fans. Um the there was only one that I remember catching in this game and it was UPS. And the tagline was what can brown do for you? Which felt appropriate us watching this game.",
    "timestamp" : "01:06:54-01:07:16",
    "speaker" : "Andy"
  },
  {
    "text" : "They should bring that back.",
    "speaker" : "Steve",
    "timestamp" : "01:07:17-01:07:18"
  },
  {
    "timestamp" : "01:07:18-01:07:24",
    "speaker" : "Andy",
    "text" : "What what Steve, what can Brown do for you? Maybe that should be our tagline now. We'll just steal it from UPS."
  },
  {
    "text" : "No.",
    "timestamp" : "01:07:25-01:07:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "No.",
    "timestamp" : "01:07:25-01:07:25"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:07:27-01:07:28",
    "text" : "I don't want to overpromise."
  },
  {
    "speaker" : "Andy",
    "text" : "We're not. We're just asking.",
    "timestamp" : "01:07:29-01:07:31"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:07:34-01:07:44",
    "text" : "I don't ask, you know. I don't even want to set any expectations, you know? I don't even want to ask that question because I'm gonna under deliver it. Whatever the answer is, I'm under-delivering."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh good. Um So I would say my best and worst are kind of the same play. It was Dion Branch getting another catch off a deflection for the second week in a row. uh Tom Brady threw a screamer that uh Kevin Falk I'm going to defend and say he decided to turn into a tip drill. On purpose, which I don't think it was, but we're gonna go with that. Uh directly into the hands of awaiting Dion Branch, who caught the ball, got tackled, got up, and then was immediately called for taunting after the catch. Which set them back 15 yards. So it was as as if the play didn't happen. Yeah. It was. Um And then, let's see, an honorable mention would be uh oh, there's a yo there's a um an interview, a sideline interview with a young Robert Kraft.",
    "timestamp" : "01:07:46-01:08:41"
  },
  {
    "timestamp" : "01:08:41-01:08:42",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:08:42-01:08:49",
    "text" : "Who I've decided I'm trying to like uh figure out who his voice reminds me of.",
    "speaker" : "Andy"
  },
  {
    "text" : "Sounds like a fucking goober.",
    "timestamp" : "01:08:49-01:08:51",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:08:51-01:08:54",
    "text" : "So yeah, but I I think I've I've come close.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:54-01:09:03",
    "text" : "Okay. I'm interested in this because he sounds like he's like he's a congested, he's kind of a goober. He's not a great interview. Like voice-wise."
  },
  {
    "text" : "I think what he says is fine, but Yeah, but so um I think it is.",
    "speaker" : "Andy",
    "timestamp" : "01:09:03-01:09:08"
  },
  {
    "timestamp" : "01:09:11-01:09:23",
    "text" : "Alright, you wolf. Alright, sheep herder. Good joke, man. How's that sound world? Like this.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Good joke, man. He sounds like Droopy the Dog. Do you remember Droopy Dog? He's like, always a little but he has that same like Yeah. That same voice. That sort of thing.",
    "timestamp" : "01:09:25-01:09:39"
  },
  {
    "text" : "All right. You know I can definitely see it.",
    "timestamp" : "01:09:40-01:09:42",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So I'm gonna I'm I I just figured out like right before we started recording this, so I just found like the first clip I could, but I'm gonna see if I can find some and see if I can put together a Roderick Kraft versus Droopy the Dog.",
    "timestamp" : "01:09:43-01:09:54"
  },
  {
    "text" : "Got it in his offense. At least he always thinks the fans. Every time he got some. Tom Brady always says, hi mom. Hi, Dad. Actually in the Broncos interview he said hi mom, hi dad, hi sisters, because they say I never say hi to them. RKK always thank the fans. Yeah, I appreciate that.",
    "timestamp" : "01:09:53-01:10:12",
    "speaker" : "Steve"
  },
  {
    "text" : "He does, but he was like super awkward in this too because they they're just asking him like softball questions. He's like, oh yeah, no, we're uh we're a big fan of Jerry Jones. Our our family's really close, we get dinner together all the time. And so it's like, oh, so uh Will the winner of this game be the one to to buy dinner next time? And he just like blanked. He's like, uh, I'm sure we'll have dinner. Yeah, okay. Just like trying to get out of the interview. Like, oh, you poor bastard. That's exactly how because that's exactly how I would be if I was the owner of the Patriots and you're trying to interview me on live television. Like, uh yeah. I eat dinner.",
    "speaker" : "Andy",
    "timestamp" : "01:10:13-01:10:50"
  },
  {
    "text" : "What do you mean who's gonna buy it? We're both fucking millionaires, lady Jesus.",
    "timestamp" : "01:10:51-01:10:55",
    "speaker" : "Steve"
  },
  {
    "text" : "Dropping the bucket, baby. All right. So what's your uh best and worst?",
    "timestamp" : "01:10:56-01:11:00",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "All right. You know, deep down, happy parcels will never be part of the Patriots Hall of Fame. Ooh. How do you think that's a good thing? Because we know that guy on the inside, and we both we all told him don't do it. Right, right, right. So this game, all that confirms my feelings there. So it's nice that they'll have a little validation there.",
    "timestamp" : "01:11:00-01:11:19"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. Yep.",
    "timestamp" : "01:11:19-01:11:20"
  },
  {
    "timestamp" : "01:11:21-01:11:26",
    "text" : "I learned that back in the day, I guess, hitting the offensive lineman with a pass is a penalty.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:11:27-01:11:31",
    "speaker" : "Andy",
    "text" : "It is. It still is. It's um illegal touching, yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know. I feel like if you could just like inadvertently hit the offensive lineman with a pass, it's not a penalty.",
    "timestamp" : "01:11:31-01:11:37"
  },
  {
    "timestamp" : "01:11:38-01:11:43",
    "speaker" : "Andy",
    "text" : "Uh no, I think it's still us. At least as far as I know, but I mean you might be right. Maybe they've changed it."
  },
  {
    "speaker" : "Steve",
    "text" : "Back check? Because it was weird because it it wiped out a penalty on the Patriots defense. Yeah. She's had a brain fart and the offset.",
    "timestamp" : "01:11:43-01:11:52"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:53-01:11:53",
    "text" : "Let's see."
  },
  {
    "text" : "I'm not quite sure how to probably my worst is like a little combination. Of Antoine Smith and Field, because they both looked awful. Yeah. Yeah. And like they also like contribute to each other looking awful because like Anton Smith couldn't get footing, so he's fallen down.",
    "speaker" : "Steve",
    "timestamp" : "01:11:53-01:12:16"
  },
  {
    "speaker" : "Andy",
    "text" : "There was that one play, I think it was like I don't think it was third. It might have been like second and short. And Antoine Smith got the handoff and had like days of open space and just like fell over the dirt. Yeah. Like two yards in the backfield.",
    "timestamp" : "01:12:16-01:12:28"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:12:29-01:12:36",
    "text" : "Like, oh I haven't done here. Has he broken a tackle yet this year? Like he he's definitely got like he's running on fumes."
  },
  {
    "text" : "Yeah, because there were some plays where it started off and they had like A couple of pulling guards and it looked really good and there's like nobody out there and it goes for like three yards.",
    "speaker" : "Andy",
    "timestamp" : "01:12:36-01:12:44"
  },
  {
    "text" : "Like how did you get tangled? We we redo the grass at Gillette. I don't remember when that is, but",
    "speaker" : "Steve",
    "timestamp" : "01:12:44-01:12:50"
  },
  {
    "speaker" : "Andy",
    "text" : "They just I think it's after all of the uh Colts teams come to visit in the playoffs. Because that was uh on purpose to slow down those faster teams was was creating garbage feel because it conditions. It was I mean this is early it was only a week eleven and it looked well they talked about how it was because they shared the stadium with the New England Revolution. Yeah and so they're like the revolution are tearing to bits too. Which I remember from high school, we weren't as a soccer team, we weren't allowed to play on the football field because soccer games tear up the and you're a bunch of foot fairies. God damn right, a bunch of foot fairies. But at least we know that a header it doesn't uh no good.",
    "timestamp" : "01:12:51-01:13:32"
  },
  {
    "speaker" : "Steve",
    "text" : "It's a header, it's no good. Can't be no good. What?",
    "timestamp" : "01:13:33-01:13:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:37-01:13:38",
    "text" : "Oh my god."
  },
  {
    "speaker" : "Steve",
    "text" : "Uh and not a worse for the Patriots, but I'm sure if you ask Bill Parcells, they had an offsides on a field goal attempt.",
    "timestamp" : "01:13:38-01:13:46"
  },
  {
    "timestamp" : "01:13:47-01:14:17",
    "speaker" : "Andy",
    "text" : "Oh, that was a good one. By their first round draft pick. Yes. Terrence Newman, who on it was like a fourth and three. Patriots a kick and field goal with like just over two minutes left, so they would have got the two minute warring and everything. Yeah, and uh And so the pages do a hard count on the field goal, get him to jump. Adam kicks the field goal anyway, but then they run through get to run three more plays before he kicks another chip."
  },
  {
    "speaker" : "Steve",
    "text" : "It was like, hey, maybe you take the points. Yeah.",
    "timestamp" : "01:14:18-01:14:21"
  },
  {
    "timestamp" : "01:14:21-01:14:34",
    "speaker" : "Andy",
    "text" : "Right. No, I think it was Steisman and they'll and everyone's like, nope. He's like, well, to be fair, I'm an idiot. So I was just thinking it uh thinking it through out loud for all the other idiots out there listening with me."
  },
  {
    "speaker" : "Steve",
    "text" : "Like, well, all right, at least he's honest. And my best. And then I have a uh bonus football or not football when we're done here.",
    "timestamp" : "01:14:34-01:14:42"
  },
  {
    "text" : "Ooh.",
    "speaker" : "Andy",
    "timestamp" : "01:14:42-01:14:42"
  },
  {
    "text" : "The best though, and I can't believe we didn't mention this, is the um it's I don't know, halftime-ish or first half or I don't know, it was still pretty close. Cowboys had a third and one, fourth and one. And the fourth and one play, Teddy just Crushes it. Oh yeah. Blows the blocker by, hits him like four yards deep. So it's like a loss of three on fourth and one.",
    "speaker" : "Steve",
    "timestamp" : "01:14:43-01:15:05"
  },
  {
    "timestamp" : "01:15:06-01:15:09",
    "text" : "It wasn't even four. It was like fourth and inches. It was short.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:15:10-01:15:10"
  },
  {
    "timestamp" : "01:15:10-01:15:10",
    "text" : "But yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:15:10-01:15:17",
    "speaker" : "Steve",
    "text" : "It wasn't like it wasn't like, oh, where's the spot gonna be? It was like they he got the he got the handoff and he got hit. Yeah. Awesome."
  },
  {
    "text" : "No, that's one of the highlights on the on the website. Uh is that Bruce 4,000 stop. It was it was huge. Yeah. Because they blew up that whole play. Like it didn't have a chance from the get-go. Because it it the uh commentators talking about how, oh well, of course you go for it here because you have Quincy Carter and he's so good with his legs and he'll convert the the QB sneak no problem. But then the Patriots lined up with like three guys over the center, basically run literally anything else.",
    "speaker" : "Andy",
    "timestamp" : "01:15:17-01:15:43"
  },
  {
    "text" : "Anything on the edges.",
    "timestamp" : "01:15:44-01:15:45",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. And so they tried and it didn't fucking work.",
    "timestamp" : "01:15:45-01:15:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "They didn't they tried to run fucking up the gut. Whatever.",
    "timestamp" : "01:15:47-01:15:50"
  },
  {
    "speaker" : "Andy",
    "text" : "Not a great play call.",
    "timestamp" : "01:15:50-01:15:52"
  },
  {
    "timestamp" : "01:15:52-01:16:02",
    "speaker" : "Steve",
    "text" : "And then my football, or not football, help me out here. Um he just slides in the hole, all you need is eight inches."
  },
  {
    "speaker" : "Andy",
    "text" : "Eight Oh God. Well I well I'm about to disappoint whatever hole that is.",
    "timestamp" : "01:16:04-01:16:10"
  },
  {
    "speaker" : "Steve",
    "text" : "Well it's Quincy Carter. So they were actually talking about that on his uh QB sneak early in the game that kind of set up that fourth and one play. You know, he just he slides in the hole. He steps back. Waits for him and then slides in the hole. All you need is eight inches.",
    "timestamp" : "01:16:11-01:16:31"
  },
  {
    "timestamp" : "01:16:32-01:16:33",
    "speaker" : "Andy",
    "text" : "Oh my goodness"
  },
  {
    "speaker" : "Steve",
    "text" : "All you can thought I thought the commentators were awful and I am really not looking forward to any more Paul Maguire. How did that guy even get a fucking job? I didn't know his fucking dude.",
    "timestamp" : "01:16:35-01:16:43"
  },
  {
    "text" : "I mean, yeah. I I don't know much about Paul McGuire. Hmm. I can't find anything about the offensive players. So if any if any but any of you know the rule about uh a forward pass hitting an offensive lineman in the back of the head and that being called an eligible man, an eligible receiver or something like that. I don't exactly remember what the call was because They didn't do a good job of explaining it. Something like that, yeah. Um let us know. Uh hit us up on Twitter or Facebook. or wherever or or or great segue like this steve brown uh you can text us on the dynasty hotline do you remember the number",
    "timestamp" : "01:16:43-01:17:26",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:17:28-01:17:30",
    "text" : "Uh 505 Troy Brown for three."
  },
  {
    "speaker" : "Andy",
    "text" : "Yes. 603-505-8043. The Dyson Holland. You can shoot us a text and um Let us know let us know what that rule is or let us know uh anything else about this game that we have missed. Uh I don't think there's anything, but who are we to decide what's important about this game We're the CD.",
    "timestamp" : "01:17:30-01:17:54"
  },
  {
    "text" : "That's what our job is.",
    "timestamp" : "01:17:54-01:17:56",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:17:57-01:18:14",
    "text" : "Well, you know what? I'm not going to take that out of the uh the listeners' hands. If they have something that they think is important, they can let us know. Okay. Maybe we'll even have them on to discuss it in a future episode. But speaking of future episodes, what is next week, Steven?"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know. You don't fucking know.",
    "timestamp" : "01:18:15-01:18:17"
  },
  {
    "text" : "Well, Patriots are, I was gonna say staying in Texas, but they're actually traveling to Texas this time to take on the Houston Texans in Texas at Reliance Stadium.",
    "timestamp" : "01:18:18-01:18:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:18:30-01:18:32",
    "text" : "This is the Houston Texans first year."
  },
  {
    "text" : "I don't believe it's their first year, no, but it is very early on in there. Is it their first year? Ooh, no, I think they came after that. Didn't they? Houston Texans started in 2020, uh 2002. This is their second year. They went four and twelve in their first year. This year they were going five and But I remember this game, I think. I don't only because I believe I was extremely hungover at Ryan's Story's house and we're watching it And the game was uh it felt like a hangover. So I guess we'll find out then. We sure will on the Patriots Dynasty Podcast.",
    "timestamp" : "01:18:33-01:19:13",
    "speaker" : "Andy"
  }
]