[
  {
    "speaker" : "Mom",
    "timestamp" : "00:00-00:17",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother."
  },
  {
    "text" : "Welcome back to the Patriots Dynasty podcast. Hi gentlemen. I realize we've stopped introducing ourselves because uh we all know who we are. Since we've grown up together, but if anybody's joining this week, they don't know who we are. So I am your host, Andy Brown. I'm the The reason this podcast exists, it's my fault. Is it my fault or is it not?",
    "speaker" : "Andy",
    "timestamp" : "00:23-00:51"
  },
  {
    "timestamp" : "00:53-00:56",
    "speaker" : "Greg",
    "text" : "Yeah, it is. Exactly. I'll give you that one."
  },
  {
    "timestamp" : "00:56-01:00",
    "text" : "The asshole you're hearing now is our baby brother Greg Brown. Hi, Greg.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:00-01:07",
    "text" : "Hey Andy. How are you doing? Great to be here. I like to think I'm the uh creative direction of this program."
  },
  {
    "timestamp" : "01:07-01:11",
    "speaker" : "Andy",
    "text" : "That's not true. I understand why you think you are."
  },
  {
    "text" : "I am the captain now.",
    "speaker" : "Greg",
    "timestamp" : "01:12-01:13"
  },
  {
    "timestamp" : "01:15-01:21",
    "speaker" : "Andy",
    "text" : "Uh and also with us, uh introduced last because he gets no respect is middle brother Steve Brad."
  },
  {
    "timestamp" : "01:21-01:32",
    "speaker" : "Steve",
    "text" : "How you doing Steve? Yeah. I'm only here because Greg refused to do it at the beginning. He said, no, it's stupid. So Andy, I was on vacation. He said, do you want this microphone? Greg doesn't want it. And I said, sure, I'll do this."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:33-01:42",
    "text" : "Why not? And here we are 40 something episodes later. You know it's been that many? It's been that many episodes. Ridiculous."
  },
  {
    "text" : "Yeah, it feels like 400, Andy",
    "speaker" : "Greg",
    "timestamp" : "01:42-01:45"
  },
  {
    "timestamp" : "01:47-02:05",
    "speaker" : "Andy",
    "text" : "Uh feels like just yesterday. We've actually been doing this for a year. We started last October because right around this time we released one of the first few episodes. And I spent an entire week editing it editing out all of the uh sounds of Greg carving a pumpkin while he was doing the episode."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "02:06-02:08",
    "text" : "Oh. That's true."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:08-02:10",
    "text" : "That son of a bitch."
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, it's festive.",
    "timestamp" : "02:11-02:13"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:14-02:21",
    "text" : "You know what else they love to hear? I don't know if you have any food you can eat or uh something you can drink on the microphone because people love listening to that."
  },
  {
    "text" : "Andy, you you broke up again.",
    "timestamp" : "02:22-02:24",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that all right, that was our fourth person, the robot that we have on this call.",
    "timestamp" : "02:24-02:29"
  },
  {
    "timestamp" : "02:35-02:40",
    "speaker" : "Andy",
    "text" : "I fucking hate this. All right, hang on. We're back."
  },
  {
    "timestamp" : "02:40-02:53",
    "speaker" : "Greg",
    "text" : "And we're back. Thanks. Andy. Yeah. Give me a test. Test. Me ma me mama ma ma ma me. How did that sound on your end?"
  },
  {
    "text" : "Sounded great on my end. How does it sound on your end?",
    "timestamp" : "02:53-02:56",
    "speaker" : "Andy"
  },
  {
    "text" : "Well, give me one. Give me a range. No. Okay.",
    "timestamp" : "02:56-02:59",
    "speaker" : "Greg"
  },
  {
    "text" : "No, no, no, no, no. How is that?",
    "speaker" : "Andy",
    "timestamp" : "03:00-03:03"
  },
  {
    "text" : "Okay. That was a good one.",
    "timestamp" : "03:03-03:04",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh wait, here, hang on. I have I have something to show you boys.",
    "timestamp" : "03:04-03:08"
  },
  {
    "timestamp" : "03:10-03:14",
    "speaker" : "Greg",
    "text" : "Better not be your dick again. All right. This comes in from the top."
  },
  {
    "timestamp" : "03:18-03:44",
    "text" : "I would be super impressed if I was able to do that. Just dangle my my Johnson out from over the top of the keyboard. Ma Johnson. So during this whole pandemic, every time I get a little depressed and shit, I buy something stupid that I don't need. And in this case. Padres. It is a Tom Brady high school jersey.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "03:44-03:50",
    "text" : "Holy shit. Get that right."
  },
  {
    "timestamp" : "03:53-04:07",
    "text" : "I don't even know. Yeah, like that's that's pretty you don't know where you got it. Uh the internet, man. You know, I just I went down a rabbit hole and somehow found a Tom Brady That's ridiculous. It was like 40 bucks. It was like from China, obviously.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "04:07-04:12",
    "speaker" : "Greg",
    "text" : "Did you feel weird buying uh a jersey of a player that's not currently on the Patriots?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:13-04:30",
    "text" : "No, but I felt weird of buying uh a jersey of somebody who at the time was uh Not of legal age. I basically bought a kid's jersey. And that that when it got here, that that hit me and I felt a little weird about it. No, no one thinks of it that way though. It's a pretty sweet jersey. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Well, the older I get, the more I think like it's kind of ridiculous that I like idolize these people that are like younger than me. Yeah. You know? Like when you were like 15, it was like, yeah, one day I want to grow up and be that. No, no.",
    "timestamp" : "04:30-04:45"
  },
  {
    "text" : "It was aspirational, yeah.",
    "timestamp" : "04:46-04:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, yeah. Now it's like it's kind of sad. Nah, not for me, but that Like I'm so fucking useless in my life that I have to like watch I have to block off one day of my week every week just to watch these fucking young kids that are actually doing something with their lives.",
    "timestamp" : "04:47-05:02"
  },
  {
    "timestamp" : "05:02-05:07",
    "text" : "Yeah, welcome to America Green. Jesus Christ. Looking like a true one percenter there.",
    "speaker" : "Steve"
  },
  {
    "text" : "Okay, Steve.",
    "timestamp" : "05:09-05:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "05:12-05:15",
    "text" : "All of us over here sitting at home. We got Sundays, baby."
  },
  {
    "timestamp" : "05:16-05:18",
    "text" : "I mean, don't get me wrong.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "05:22-05:30",
    "speaker" : "Andy",
    "text" : "Oh yeah, no, I'm I'm still all in for no. Yeah. Speaking of jerseys though, who are you who do you have on there?"
  },
  {
    "text" : "Oh, this is a special treat for you guys, right? Yeah. Yeah. This should make the pod though, because this. In honor of the 2003 starting is a Eugene Wilson jersey.",
    "timestamp" : "05:31-05:43",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "05:45-05:45",
    "speaker" : "Steve",
    "text" : "Not that"
  },
  {
    "timestamp" : "05:46-05:56",
    "speaker" : "Andy",
    "text" : "Talk about a deep cut, huh? Right? So so like my excuse for my jersey purchases are you can find anything on the internet. Where the hell did you find a Eugene Wilson jersey?"
  },
  {
    "text" : "It's an interesting story because I'll stand up for ya. This thing's massive, right? It's a dress. So I would have been younger than like sixteen when I got this. Okay. And I remember it fitting like a dress and I got it for Christmas And I'm pretty sure mom and dad had to personalize or sorry, Santa Claus had to personalize the jersey with the name and number on it, because they didn't actually sell Eugene Wilson jerseys.",
    "timestamp" : "05:57-06:33",
    "speaker" : "Greg"
  },
  {
    "text" : "Damn. That's an expensive gag gift. What do you mean gag gift?",
    "timestamp" : "06:34-06:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "06:39-06:44",
    "speaker" : "Greg",
    "text" : "I loved you Gene Wilson. Did you? I did. You had Gene Wilson stand."
  },
  {
    "text" : "Okay. This is his debut game here, right? Uh it may have been. Uh because yeah, he was his anti-season. Yeah, he was fine in week one, but yeah. Was he? Yeah. Yeah. I mean, there wasn't much happening in week one.",
    "timestamp" : "06:45-06:58",
    "speaker" : "Andy"
  },
  {
    "text" : "Next year is where he really puts his stamp on the league.",
    "speaker" : "Greg",
    "timestamp" : "06:59-07:02"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:02-07:10",
    "text" : "Yeah. Well, I mean he has Similar stats this year actually."
  },
  {
    "timestamp" : "07:10-07:24",
    "text" : "Four interceptions. But there's one game in particular. I'm not gonna I'm not gonna give too much of a spoiler, but there's one game where he just lays lumber. All right. And that's what made me buy the jersey is basically that one game.",
    "speaker" : "Greg"
  },
  {
    "text" : "Alright. I can't wait till we get there. But uh for now we're talking about New England traveling to Philadelphia, where I hear it's always sunny.",
    "speaker" : "Andy",
    "timestamp" : "07:24-07:34"
  },
  {
    "timestamp" : "07:36-07:37",
    "speaker" : "Greg",
    "text" : "City of brotherly love."
  },
  {
    "text" : "Yeah. No, I'm I I I know there's a lot of love happening in in that area of the country.",
    "speaker" : "Andy",
    "timestamp" : "07:38-07:43"
  },
  {
    "text" : "Um unless you're Santa Claus or This is the podcast of Brotherly Love. Oh nice I love you guys. I love you too.",
    "timestamp" : "07:43-07:53",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "07:54-08:02",
    "speaker" : "Andy",
    "text" : "I can't wait until like half an hour into this power where Greg decides like he usually does every week to say that he hates us. Yeah."
  },
  {
    "text" : "I just did yoga. I'm in very Zen mood right now.",
    "speaker" : "Greg",
    "timestamp" : "08:03-08:08"
  },
  {
    "timestamp" : "08:08-08:11",
    "text" : "Yeah. That's nice. Maybe we should do that every time before the pub.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. I agree. Shout out Andy's wife. She's an excellent yoga teacher.",
    "timestamp" : "08:11-08:16"
  },
  {
    "timestamp" : "08:17-08:38",
    "speaker" : "Andy",
    "text" : "I agree. Yeah. I am also biased, but No, she's legit. Yeah, she is legit. And she has the patience to put up with me and doing this podcast every week. Uh yeah, she's she's a preschool teacher, so she deals with three-year-olds all day and then comes home and deals with another one at home all day. A two-year-old all day. Yeah."
  },
  {
    "text" : "Yeah. Don't give me something that's a it's a step down when she gets home.",
    "timestamp" : "08:38-08:42",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "But yes, uh City of Brotherly Love in the brand new Lincoln Financial Field, which has just been built this year. Yeah. Um, and the commentators made some sort of Comments Phil Sims and Greg Gumble made some sort of comment about how when the Eagles are actually good, this stadium's gonna be great to play in for the Eagles. Hasn't happened yet. So but the booze were resounding. Like you can hear them fantastic. Which brings me to my first point of this game. It was really weird for me, and I'm surprised it hasn't hit me yet, of listening to a game or watching a game where you can hear the crowd and it being like having an effect on the game. Like it was super loud at the beginning of this game to the point where, you know, those like false starts happening and Brady was having trouble like getting audibles out and stuff like that.",
    "timestamp" : "08:45-09:41"
  },
  {
    "text" : "And I forgot what hardcore booze stood out a lot more to me than just like them making it tough on Brady. And the boo birds were out in this game early. Early, yeah. Hard. And like I was like, wait a minute, haven't the Eagles been to like the NFC Championship game a bunch of years in a row? Like, didn't they just come off an NFC Championship game? And it's like Week two.",
    "timestamp" : "09:42-10:03",
    "speaker" : "Steve"
  },
  {
    "text" : "Well that's part of it though, right? I mean they're they're they've gone to two straight NFC championships with a really talented team and blown it. And they're coming in this year being like, okay, this is the year like it's Super Bowl or bust. We can't keep doing NFC championships and then lose two straight games right off the bat.",
    "timestamp" : "10:04-10:22",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "10:22-10:35",
    "text" : "And they actually got shut out week one as well. 'Cause and they played in week one the Eagles played the Bucks, who is who they had lost to last year in the NFC Championship game. And got shut out 17 nothing."
  },
  {
    "text" : "Yeah, shut out Ronde Barba. Put fucking Veteran Stadium to rest. I mean yeah. He did. He fucking put that stadium to sleep.",
    "speaker" : "Greg",
    "timestamp" : "10:35-10:50"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "10:52-11:09",
    "text" : "They went to this the NFC championship this year as well and next year. Yeah. So those those Philly fans are just like overreacting like crazy. Just like earlier and last week when they said drive into the game and they said this is a must-win game and then week two weekends are booing them. You know, like two like a a week and a half into the season."
  },
  {
    "text" : "Bo yeah, booing them like halfway through the second quarter when the pages are up fourteen to three or whatever it was.",
    "timestamp" : "11:09-11:14",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "11:14-11:35",
    "speaker" : "Greg",
    "text" : "But is there an overreaction though? If if like you have a a t enough talent on a team to win Super Bowls and you feel like you're kind of pissing away that like those golden years, which they kind of did. If you're good enough to make it to four straight NFC championships and you don't win a Super Bowl, that's that's a disappointment, right? Yeah."
  },
  {
    "text" : "Well we can ask Trevor about the Tigers going to the like NLDS or ALCS a bunch and losing.",
    "timestamp" : "11:35-11:41",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Didn't the Braves do something similar too?",
    "timestamp" : "11:41-11:43"
  },
  {
    "text" : "Yeah. I get what you're saying, but I think you'd rather be there. Same with the Bills going to the Super Bowl and losing them all. They'd rather be there.",
    "speaker" : "Steve",
    "timestamp" : "11:43-11:49"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, but it's true. But there's a different standard when you're that good of what you expect from your team.",
    "timestamp" : "11:50-11:54"
  },
  {
    "timestamp" : "11:55-12:04",
    "speaker" : "Steve",
    "text" : "I agree, but like at least in New England, they're a little more You know, week two you're not booing. You're like, all right, you know, week early stuff's always, you know, most important football's later and blah blah blah."
  },
  {
    "timestamp" : "12:04-12:16",
    "text" : "I'm sorry, are you talking about these New England Patriots? Have you have you listened to sports talk radio this year? No, I don't listen to sports talk radio because it's all just idiots. This guy is falling. They touched the city.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "They they uh they did 'em on they did a bit on North Carolina radio uh this week. They played a clip of Michael Falgar. Like shitting on the Patriots and then shit on Michael Felger. That was like their bit. It was awesome. That's amazing. And they called him Kirk Minahan too. That was the best part. Intentionally or unintentionally. I think unintentionally. That's even better. Yeah. And you know that probably pissed off Felgar.",
    "timestamp" : "12:18-12:47"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:49-13:10",
    "text" : "Yeah, that that's all the shtick Izzy. They're talking about how Belichick the game is beyond him and yada yada yada and he he can't draft anymore. Yeah, I I don't even want to get into it. Yeah, I'll get around real quick. Yeah, just typical bullshit New England sports talk radio."
  },
  {
    "timestamp" : "13:10-13:48",
    "speaker" : "Greg",
    "text" : "So I do have some notes on Eagles fans though. Wanna get into that now? Because I mean obviously they have quite a reputation. They do. And and it's worth discussing whether that uh reputation is legit or not. Okay. Um I I have a quote here. Uh the national perception of Philadelphia sports fans is that they are lunatics, almost pathologically negative. And I think it is a richly justified reputation. Who said that? It was like some guy who wrote for a Philadelphia newspaper."
  },
  {
    "speaker" : "Andy",
    "text" : "So a guy who knows.",
    "timestamp" : "13:48-13:50"
  },
  {
    "timestamp" : "13:51-14:09",
    "text" : "Yeah. Perfect. Yeah. Uh also have a quote from Emmett Smith. Uh I don't know why they call it the city of brotherly love. They never they never gave no love to no brothers here. Which coming from Evan Smith makes sense because they definitely hate the Cowboys.",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh yeah. They they booed Michael Irvin when they thought he was paralyzed. Yes.",
    "timestamp" : "14:09-14:15",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "14:15-14:26",
    "text" : "Yep. His last like moments on a field was Philadelphia cheering his neck injury. Yeah. Has he never played again after that? I think that was the end of his career, yeah."
  },
  {
    "timestamp" : "14:27-14:27",
    "text" : "Wow.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "14:28-15:08",
    "speaker" : "Greg",
    "text" : "Um I wrote down a couple other ones that I thought were noteworthy. I mean, obviously we all know about the them throwing snowballs at Santa. Of course. Um what I did not know is that part of the reason was because the team was winning. They were pissed off. So they they had started the season at 0-11. What? Yeah, they started at 0-11 and they won two straight games and everyone was pissed because they were losing their draft position. And it was the year OJ Simpson was coming out of college. Oh my god. Yeah. So they're all fucking boozed up and pissed off because the team was winning. So they fucking two snowballs of Santa."
  },
  {
    "timestamp" : "15:11-15:13",
    "speaker" : "Andy",
    "text" : "That sounds like that sounds like a jet sort of thing right there."
  },
  {
    "text" : "Yeah. Yeah. Um there's uh instance this is uh for the Flyers where uh Ty Domi, a guy from Maple Leafs, was getting fights. Uh he was like an enforcer and he and some fan broke through the glass in the penalty box and tried to fight Taidomi. And then Taidomi just kicked his ass.",
    "speaker" : "Greg",
    "timestamp" : "15:13-15:35"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, no shit. That's what he does for a living.",
    "timestamp" : "15:35-15:39"
  },
  {
    "text" : "Yeah, exactly. This one this one was probably the the most like offensive. Um There were this was at a Phillies game where there were these two fans there that were getting kicked out. So there's an off-duty cop and he's like he's getting these two guys, he's like reported and they're getting kicked out. He's like 21-year-olds And as the guy is leaving, he sticks his finger down and throat and intentionally pukes on an off-duty cop and his 11-year-old daughter.",
    "timestamp" : "15:40-16:10",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "16:10-16:10",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Cool.",
    "timestamp" : "16:11-16:11"
  },
  {
    "text" : "I remember that one. Yeah. Oh shit. Yeah. Wasn't there like a whole bunch of stuff around when they won the Super Bowl too?",
    "timestamp" : "16:11-16:20",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "16:21-16:25",
    "speaker" : "Steve",
    "text" : "Like there was somebody some with a horse and poop."
  },
  {
    "timestamp" : "16:25-16:35",
    "speaker" : "Andy",
    "text" : "Yeah, like like one of the fans eating horse shit, which you know that's you do you could find out if you want to celebrate that's great, but yeah, it really doesn't hurt anybody else but that person, you know."
  },
  {
    "timestamp" : "16:34-16:45",
    "text" : "Yeah. Yeah. Intentionally puking on somebody else who has got a lot of collateral damage, you just eating horse poop, you know. You do you, I guess. I mean I can't imagine it stayed down though, right?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "16:46-16:48",
    "speaker" : "Andy",
    "text" : "Find a guy and get him on the pod, Andy."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "16:48-16:48"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:49-16:56",
    "text" : "Alright, yeah, we'll we'll look him up next time the Pages play the Eagles. Maybe for the for maybe for the 2004 Super Bowl episode we'll have him on."
  },
  {
    "text" : "Yeah, that'll be a guest.",
    "timestamp" : "16:56-16:57",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That's a get.",
    "timestamp" : "16:59-16:59"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "17:01-17:48",
    "text" : "So just like to touch on Veteran Stadium too. So that's 1971 to 2002 was Veterans Stadium. And obviously it had like quite a reputation. And I guess it had like a it was like unique in that it had a ton of different like levels. So there was a seven hundred level. Where it was so high up there that like they said you had to use binoculars to see what was going on. And uh the Wikipedia said it had uh The 700 level had a reputation for hostile taunting, fighting, public urination, and general strangeness. Like what a way to describe a section of a stadium. That's hilarious. Yeah"
  },
  {
    "text" : "I mean that's usually how the top levels of stadiums go. Like if you're in the three hundreds Pats game.",
    "timestamp" : "17:48-17:52",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "17:53-17:56",
    "text" : "There's not really seven hundreds, there's like three or four maybe. That's what I mean.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, it's usually the three hundreds.",
    "timestamp" : "17:56-17:57",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "17:58-18:00",
    "text" : "Oh, give me the seventh floor, please. Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "And that barrier, you know, just like creates more like I'm I want to get away with something because I'm like there's some sort of like they can't see you down there, they're in the 600 level.",
    "timestamp" : "18:00-18:10",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "18:10-18:22",
    "text" : "You know, I could do whatever You end up pissing off the edge of the 700 level on the 600 level though. Those hoity toity motherfuckers in their 600 level. Have no idea how good they are.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "18:23-18:25",
    "text" : "That guy's not even using binoculars."
  },
  {
    "timestamp" : "18:26-18:46",
    "speaker" : "Andy",
    "text" : "Hit that motherfucker with a snowball. Well that was like Greg when uh the Brown family went to the past game and for some reason there was like two sets of tickets. One was down in the hundred level. Which is where everybody sat, but those two other tickets that were up in the 300s and me and you took those, remember?"
  },
  {
    "timestamp" : "18:46-18:46",
    "speaker" : "Greg",
    "text" : "Mm-hmm."
  },
  {
    "text" : "And it was a snow game. And literally every time somebody stood up to walk out of the section, Literally the rest of the section pelted them with snowballs. Yeah.",
    "timestamp" : "18:46-18:54",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "18:55-18:55"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:55-18:59",
    "text" : "Including like a seven-year-old kid. What? Felt a little rough."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah. Yeah. Well there there was a story about that too in Philly in uh 1989 a game against the Cowboys. They were all it was snowing, they're all piss drunk, and they were like they had to like Take the players off the field because they were throwing like ice snowballs onto the field. And they ended up the NFL banned Beers from their stadium for two games after that incident.",
    "timestamp" : "18:59-19:23"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh my goodness. That would just made him more angry though. I was gonna say, did anybody show up to the game?",
    "timestamp" : "19:24-19:30"
  },
  {
    "timestamp" : "19:30-19:33",
    "speaker" : "Steve",
    "text" : "But having on the game back, what happened three games later?"
  },
  {
    "text" : "Oh god. Uh yeah, so this Eagles that's the environment they're going into here. Right, yeah. And and with a brand new stadium and um Uh like you said, an Eagles team is kind of underperforming because this is this is year three of their four-year string of uh NFC Championship games, right? And like we said, this didn't start off well. The the At first I thought they were misspeaking, but they were talking about how the first points of the season for either team. was the field goal that New England kicked in the first quarter of this game. They had gone like four and a half quarters without scoring uh any points. And the Eagles didn't score until the second quarter. So they didn't score until their sixth quarter of the NFL season, which tough look, but you know, different era is what it is. Uh obviously running this team was a very decisive character, I would say, in Donovan McNabb. Like every time you read. I think so. Well, uh, for Philadelphia fans. Is that the right word? Decision making. Decision making or divisive. Yeah, not decisive. Divisive. Yes. This is on tape, Andy. We can go back and find out what he said. Well, I think they hated him from the get-go. They didn't like when they drafted him, right? Didn't he get booed when he got drafted? I don't remember Ricky Glenn.",
    "speaker" : "Andy",
    "timestamp" : "19:34-21:01"
  },
  {
    "speaker" : "Greg",
    "text" : "Ricky Williams. And I watched a video of that too. And just seeing a grown man who flew to the draft An NFL draft got dressed up in shoulder pads, painted his face green, and then started yelling at the stage when they didn't draft the player he wanted. It's just like imagine like imagine what his wife thinks or just like anybody, like his friends. Like how are you not embarrassed to do that?",
    "timestamp" : "21:03-21:34"
  },
  {
    "timestamp" : "21:34-21:37",
    "text" : "I love the fact that you think that dude is married.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:37-21:45",
    "speaker" : "Greg",
    "text" : "Yeah, right. He's probably married to the game. He sure the fuck is. Ball is life."
  },
  {
    "text" : "Yeah, yeah. Um but even this season, like the the Wikipedia was talking about how uh there were calls early in the season to replace McNabb with backup AJ Feely.",
    "timestamp" : "21:45-21:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:58-21:59",
    "text" : "Touchy feely."
  },
  {
    "text" : "But McNabb would find his rhythm and enjoy a great season. Uh I think great might be a little overstated. Through for 3,200 yards, 16 touchdowns, 11 interceptions. But I don't know if you can put that all on him because this receiving crew is one of the worst I've seen like since we've started doing this podcast. Like there's usually at least a name that you're like, okay, yeah, that's the number one guy in this. But I'm gonna I'm gonna give you some names. You tell me who was a leading receiver in terms of yards. Ready?",
    "timestamp" : "22:00-22:33",
    "speaker" : "Andy"
  },
  {
    "text" : "Freddie Mitchell.",
    "timestamp" : "22:34-22:35",
    "speaker" : "Greg"
  },
  {
    "text" : "Freddie Mitchell, James Thrash, Todd Pinkston, Deuce Staley. I don't think they're not the worst, but those are those are the top four wide receivers. I mean, who's your number one guy? Who's your number one guy in that? Uh Freddie Mitchell, James Thrash, Todd Pinkston, Deuce Staley.",
    "timestamp" : "22:35-22:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "You talking yards? Yeah, he is talking about.",
    "timestamp" : "22:57-22:58"
  },
  {
    "text" : "He's talking receiving yards. Yep. Mitchell was our number one guy, I feel like.",
    "speaker" : "Andy",
    "timestamp" : "22:58-23:02"
  },
  {
    "text" : "His he was Fred X, remember? Because Mitchell was delivers.",
    "timestamp" : "23:03-23:06",
    "speaker" : "Greg"
  },
  {
    "text" : "It was Deuce. Uh Deuce was number four. He was the fourth leading receiver as a running back with 382 yards and two touchdowns. Freddie Mitchell didn't cross 500. He had 498. Pinkston? Todd Pinkston was your number one wide receiver on this Eagles team with 575 yards and two touchdown catches.",
    "speaker" : "Andy",
    "timestamp" : "23:10-23:31"
  },
  {
    "speaker" : "Greg",
    "text" : "It's such a beta name too. Rod Pinkston. Be more of a cuck, bro.",
    "timestamp" : "23:31-23:38"
  },
  {
    "text" : "So I had some uh it it it did uh for some reason spark something in me for nicknames.",
    "speaker" : "Andy",
    "timestamp" : "23:38-23:46"
  },
  {
    "text" : "Okay.",
    "timestamp" : "23:46-23:46",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "23:47-24:14",
    "speaker" : "Andy",
    "text" : "Because as soon as I heard Pingston, all I could think was Todd 2 in the Pingston. Okay. Yeah. Okay. Uh and so I I put together a couple more. Uh James, don't forget to take out the thrash. Or James Thrash medal would be good too, but that's a little too easy. Two on the nose. Uh the Patriots had um Tyrone paddling pool. Or Tyrone deep into the pool, whichever one you want to do. Tyrone deep."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "24:17-24:19",
    "text" : "When they're throwing it deep, it's deep into the pool."
  },
  {
    "timestamp" : "24:19-24:25",
    "speaker" : "Andy",
    "text" : "Yeah. Uh and then also Brian Kanye Westbrook. Oh, which I kind of liked."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "24:25-24:34",
    "text" : "What about Dan copin a feel? I got one that's even worse."
  },
  {
    "speaker" : "Steve",
    "text" : "All right, listen. Todd Simpson.",
    "timestamp" : "24:34-24:37"
  },
  {
    "speaker" : "Greg",
    "text" : "What's his real name? Pinkston. Oh okay That's a cuck name. I like that. Mm-hmm.",
    "timestamp" : "24:41-24:49"
  },
  {
    "speaker" : "Steve",
    "text" : "Simpson?",
    "timestamp" : "24:50-24:50"
  },
  {
    "speaker" : "Greg",
    "text" : "I like that a lot, Steve, because it is a cuck name too.",
    "timestamp" : "24:51-24:54"
  },
  {
    "text" : "Oh man. Yeah, but speaking of cucks, uh there Oh wait, wait, one more.",
    "timestamp" : "24:56-25:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:01-25:22",
    "speaker" : "Greg",
    "text" : "Okay. Uh Adrian Crispy Clem That was a stretch. Yeah, that was a bit of a stretch. Uh Adrian Globe. Richard Seymour Butts. So Simpsons shout out there. Oh yeah. We'll tell that to Steve when he gets back."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:24-25:52",
    "text" : "Yeah, where the fuck did he go? I didn't even see him leave. Uh but yeah, speaking of of betas. The rushing attack on this team was not great either. How the f by the way, the Eagles finished 12-4 and made it to the NFC Championship game. With like not much going on. They didn't have a thousand-yard rusher. They did, they barely had a 500-yard receiver. They barely had a thousand yards receiving in general and still went 12-4 with this team."
  },
  {
    "timestamp" : "25:53-25:56",
    "speaker" : "Greg",
    "text" : "Don McNapp, Andy Reed. McNabb was good."
  },
  {
    "speaker" : "Andy",
    "text" : "McNabb, I mean he could win some games.",
    "timestamp" : "25:56-25:58"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean they had a decent defense, right? Dawkins.",
    "timestamp" : "26:01-26:03"
  },
  {
    "timestamp" : "26:04-26:29",
    "text" : "Yep. Yeah, the defense was uh led by Troy Vincent. He had three picks. Uh Corey Simon had seven and a half sacks as a defensive tackle, which is pretty impressive. He was a monster. He had a great sack in this game, too. And at linebacker, the leading tackler was Mark Simeno. So I mean Names I've heard of, but they're not like the Pantheon, you know what I mean?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Well what about Dawkins? I mean he the this is Dawkins team, right?",
    "timestamp" : "26:29-26:33"
  },
  {
    "speaker" : "Andy",
    "text" : "Is he on this team?",
    "timestamp" : "26:33-26:34"
  },
  {
    "text" : "I don't think so. I think he was he was injured in this game, I believe.",
    "timestamp" : "26:34-26:37",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, oh that's right. Yeah, they had they had a bunch of injuries coming into this. And they had a bunch of injuries leaving it too. Like yeah, they were in their like they're at one point in the fourth quarter, they're back up defensive interior lineman was down on the ground and had to get carted off. So there was just like nobody left on defense.",
    "timestamp" : "26:38-26:58"
  },
  {
    "text" : "Yeah, so McNabb was a pro bowler. Um Troy Vincent was a Pro Bowler. Corey Simon. Yeah. Maybe Dawkins isn't on this. No, he he's on it. He didn't make the Pro Bowl. Yeah, I think he probably played seven games. Yeah, he only played seven games this year.",
    "timestamp" : "26:59-27:16",
    "speaker" : "Greg"
  },
  {
    "text" : "Um but yeah, I I think the like the defense was was decent on this team. Uh but It was kind of the the combined rushing attack because I think what happened was Deus Staley sat out at the beginning of the season and um Uh yeah, he had a he had a hold a preseason holdout. And so they kind of turned it into a running back by committee that you would see the Patriots do. With, I mean, these are these are some names. You got uh Brian Westbrook, Corey Buckhalter, and Deuce Staley. Oh yeah. And and McNabb chipping in there too. Yeah",
    "timestamp" : "27:16-27:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, so there were seven there was a seventh ranked defense in points, but twentieth in yards, and 11th ranked offense in points, but 18th in yards. So you know what? That might have something to do with coaching.",
    "timestamp" : "27:56-28:09"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "28:10-28:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "You know, the more you think about it. Yep. If if there's a big disparity between your yards and your points, I think that's that's probably a lot to do with Andrew.",
    "timestamp" : "28:10-28:17"
  },
  {
    "timestamp" : "28:18-28:20",
    "text" : "Yeah. Executing once you get in that red zone.",
    "speaker" : "Andy"
  },
  {
    "text" : "This is young Brian Westbrook too, right?",
    "speaker" : "Steve",
    "timestamp" : "28:21-28:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:24-28:30",
    "text" : "Uh Youngish. Young young ish, yeah. I don't know how it's 2002."
  },
  {
    "timestamp" : "28:30-28:43",
    "speaker" : "Steve",
    "text" : "This is rookie year Really? Look, I watched the highlights and they said because Westbrook has a pretty bad fumble on a punt return on this game. Yep. And they're like, oh, we like this guy, but here's a fumble."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, let's talk about Andy Reed real quick though, because I think he at this point he's probably one of the top coaches in the league, right? For sure. Yes. I mean, he finally won his first Super Bowl. I think that a lot of people seem to think that's going to get him over the edge in terms of being in the Hall of Fame. They're saying that was like the one thing holding him back. Um, so in terms of playing the Patriots, though, they really had his number while he was on the Chiefs. He never beat Belichick. Or Belichick Patriots anyway, while he was on the Chiefs, he was 0-4 in his four tries with the Eagles. This one, obviously, then the Super Bowl, and then a couple others.",
    "timestamp" : "28:45-29:26"
  },
  {
    "speaker" : "Steve",
    "text" : "What's his total record?",
    "timestamp" : "29:26-29:28"
  },
  {
    "text" : "But since he's been on the Chiefs, uh, he's even it up a bit. He's three and three against Belichick as a member of the Chiefs. So seven and three? Yeah. But much better lately than he has been. But how many of those have been like the the most recent? Because obviously, you know, 2020 he had one.",
    "timestamp" : "29:28-29:52",
    "speaker" : "Andy"
  },
  {
    "text" : "Um but just in general terms, he's he's always been like a pretty excellent coach, right? I mean 2000 through 2004, so five straight years he had 11 plus wins with the Eagles. Yeah. And then 2015 through current, he's he just had five straight seasons of ten or more wins.",
    "timestamp" : "29:53-30:14",
    "speaker" : "Greg"
  },
  {
    "text" : "How did that separation happen then? How is like Jeff hanging out here at mediocrity and just floating by. And Andy Reed is cut from the Eagles. What the fuck do the Eagles? How did that happen? How did they let this guy go? That's a good question. I don't know.",
    "timestamp" : "30:14-30:28",
    "speaker" : "Steve"
  },
  {
    "text" : "I think it's because he couldn't deliver the Super Bowl. Yeah, maybe. You see that with a lot of teams who can't get over hop. I mean, think of Marty Schottenheimer. He got fired when he went like eleven and five or something. 12 and like after 12 and 4 or 11 and 5 season because his whole thing was he couldn't win the playoffs. I think it was after maybe after 06 when the Patriots beat him when they shouldn't have. And with the Marlon McCree got stripped by Troy Brown.",
    "timestamp" : "30:28-30:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "30:56-30:57",
    "speaker" : "Greg",
    "text" : "Mm-hmm."
  },
  {
    "text" : "That game. And I think after that, like Marty Schottenheimer won all the games he was ever in, at least in the regular season.",
    "speaker" : "Andy",
    "timestamp" : "30:57-31:04"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:04-31:06",
    "text" : "Yeah, but Marty Schottenheimer wasn't great, right?"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean so he the last few years in Philly he wasn't great. He was eight and eight and then four and twelve. And then he went to Kansas City. So there's like a six or seven year stretch here where he's got I mean he's not that four and twelve is his worst season as a coach. But there's a couple like there's a six and ten in there, eight and eight, a couple eight and eights, nine and six.",
    "timestamp" : "31:06-31:34"
  },
  {
    "text" : "So yeah, I don't know But having said that, even though the Patriots have had success against him, if you think about it, their kind of worst losses have been to like an Andy Reid Chiefs team. Like in 2014. That game where um what's his name came out and said Tom Brady's not good anymore or this page team is not good anymore. Yeah, Delphora, right. And he came out and said that about the Patriots because what had just happened. Got their shit kicked in by the Kansas City Chiefs on Monday night.",
    "speaker" : "Andy",
    "timestamp" : "31:34-32:07"
  },
  {
    "text" : "Got their shit pushed in.",
    "timestamp" : "32:07-32:08",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "32:08-32:09",
    "text" : "Right.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "32:09-32:30",
    "speaker" : "Greg",
    "text" : "And then 2017, week one, when you ever had your shit pushed in. You know, you know it moves that throne? No. Training day. Steve, oh sorry, sorry to interrupt. Steve, um we have one more nickname that when you left, we I thought you might like."
  },
  {
    "timestamp" : "32:30-32:31",
    "speaker" : "Steve",
    "text" : "Oh wait on me."
  },
  {
    "text" : "Um Richard Seymour Butts.",
    "speaker" : "Greg",
    "timestamp" : "32:31-32:34"
  },
  {
    "text" : "Oh, that's yeah.",
    "timestamp" : "32:34-32:36",
    "speaker" : "Steve"
  },
  {
    "text" : "I knew you'd like the Simpsons rapper.",
    "speaker" : "Greg",
    "timestamp" : "32:36-32:38"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, that's the Simpsons, yeah. Todd Simpsons in there telling that joke.",
    "timestamp" : "32:38-32:42"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm glad you interrupted for that. That was the perfect time for it. Very important. No, you're not. You're right. Uh but speaking of not being sorry, the other Like big loss recently, the Pages have suffered was the opening week of 2017, where remember Kareem rookie Kareem Hump fumble fumbled his first carry. Page recovered and it looked like it was gonna be a shit show.",
    "timestamp" : "32:44-33:08"
  },
  {
    "speaker" : "Steve",
    "text" : "Look, Andy, I'm not here to relive these memories more than having to watch the game, you know?",
    "timestamp" : "33:08-33:13"
  },
  {
    "timestamp" : "33:13-33:15",
    "text" : "Tough luck, Steve.",
    "speaker" : "Andy"
  },
  {
    "text" : "Andy Reed is good.",
    "speaker" : "Steve",
    "timestamp" : "33:15-33:16"
  },
  {
    "timestamp" : "33:17-33:23",
    "speaker" : "Andy",
    "text" : "Eagles are dumb for letting him go. And yet, what happened in 2003 week two?"
  },
  {
    "speaker" : "Steve",
    "text" : "What was the score? We should probably say the final score here. What was the final score, Steve?",
    "timestamp" : "33:24-33:29"
  },
  {
    "timestamp" : "33:30-33:34",
    "speaker" : "Andy",
    "text" : "31-10. 31-10, your New England Patriots."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "33:34-33:46",
    "text" : "Yeah, at some point it was like 10 to 7. I think it might have even been 7-3 Eagles at one point, but then they just kept turning the ball over and we scored a million touchdowns to a 48."
  },
  {
    "timestamp" : "33:46-33:54",
    "speaker" : "Andy",
    "text" : "Yeah, I think they had they had like five total turnovers. They were sloppy with six six total turnovers. Not great."
  },
  {
    "speaker" : "Greg",
    "text" : "I mean, I don't think it was as lopsided as a score, though, right?",
    "timestamp" : "33:55-33:58"
  },
  {
    "text" : "No, it was pretty lopsided. Uh the boo boys had a lot of a lot of booing going on.",
    "timestamp" : "33:58-34:05",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "34:05-34:09",
    "speaker" : "Greg",
    "text" : "I mean it's the turnovers, right? I think that was the what the game hinges on."
  },
  {
    "speaker" : "Steve",
    "text" : "They couldn't get anything going without turning the ball over.",
    "timestamp" : "34:10-34:12"
  },
  {
    "timestamp" : "34:12-34:18",
    "text" : "I mean Philly had more first downs. The yardage was pretty similar, 309 to 268.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:18-34:21",
    "text" : "Yeah, third down conversions were about the same. Mm-hmm."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "34:21-34:24",
    "text" : "It's just the turnovers, right? Six turnovers to zero."
  },
  {
    "text" : "Yeah, here we go. And then we were super efficient in the red zone. Like every turnover was a touchdown. Yeah. We weren't kicking field goals. They were they were Bellcheck football, baby.",
    "speaker" : "Steve",
    "timestamp" : "34:24-34:31"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I think they they turned those six turnovers into four touchdowns, I believe. I think that's what it was.",
    "timestamp" : "34:31-34:39"
  },
  {
    "text" : "One of them being a Bruce key pick six.",
    "speaker" : "Steve",
    "timestamp" : "34:43-34:45"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:45-34:46",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "That was number two on the watch, right? Yeah. Dude, I feel like I feel like every game now is like a Teddy Brisky touchdown. We talked about it once and now it's like, what the fuck? How is he scoring so many touchdowns?",
    "timestamp" : "34:46-34:57"
  },
  {
    "text" : "I don't remember any of these, but he's done it. If you watch the game, you can see Pepper Johnson so hype about it. Yeah.",
    "timestamp" : "34:58-35:06",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "He was all about that.",
    "timestamp" : "35:06-35:07"
  },
  {
    "text" : "And the commentators are like, are they saying boo or brew? Like I said, a lot to boo about for the Eagles.",
    "speaker" : "Steve",
    "timestamp" : "35:07-35:15"
  },
  {
    "timestamp" : "35:17-35:31",
    "text" : "Boo Earns. Booerns. Simpsons reference, but we should work in more Simpsons references here. Apparently we're about to. Yeah. I mean this is like Heyday Simpsons too. That is. I've been watching them all over again too. Of course you have.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "35:32-35:38",
    "speaker" : "Steve",
    "text" : "Fucking nerd. Eat my salad, eat and watch the Simpsons episode on lunch every day. That's what I'll do from work from home."
  },
  {
    "text" : "You lead a thrilling life.",
    "speaker" : "Andy",
    "timestamp" : "35:39-35:40"
  },
  {
    "speaker" : "Greg",
    "text" : "You and your salad. That is the most typical Steve thing over there. He's like bragging about eating a salad and watching Simpsons. Great life, dude.",
    "timestamp" : "35:41-35:51"
  },
  {
    "text" : "Salads are huge too. It's the size of my head. I put a fucking million things in them. They're delicious.",
    "speaker" : "Steve",
    "timestamp" : "35:51-35:54"
  },
  {
    "timestamp" : "35:54-36:01",
    "speaker" : "Greg",
    "text" : "They're not even healthy if they're like that, dude. They're delicious though. You might as well just eat four cookies instead."
  },
  {
    "timestamp" : "36:02-36:10",
    "speaker" : "Andy",
    "text" : "That's what I knew. I eat four cookies and watch fucking Patriots Highlights. That's my lunch. Oh cool. Because this is a cool"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "36:11-36:11"
  },
  {
    "text" : "I think you hit a nerve, Greg.",
    "timestamp" : "36:11-36:12",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I have a tall glass of ice water and I read books at my lungs. Just cause I like to stay hydrated.",
    "timestamp" : "36:13-36:20"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:22-36:24",
    "text" : "I read the New Yorker magazine. Yeah."
  },
  {
    "text" : "So speaking of nice hydrated body parts. We can go into how much you hate the commentators, Annie, because there was one that was so bad I rewinded it and watched it again Which one was that? They had um like a cut to Armin Katayan on the sideline.",
    "timestamp" : "36:25-36:44",
    "speaker" : "Steve"
  },
  {
    "text" : "It's a great name by the way.",
    "speaker" : "Greg",
    "timestamp" : "36:44-36:45"
  },
  {
    "text" : "Looking like a snack, I'll give them that. And uh they like made a joke about him being on GQ and he's like, Yeah, I was on the cover of GQ magazine recently, like ha ha ha. And then they cut back to the booth and I forget who it was ago said, yeah, they were showing your feet. Yeah. And that's where it ended. And then he went on to like the play. And I was like, yeah. So his feet were on the cover of GQ?",
    "speaker" : "Steve",
    "timestamp" : "36:45-37:07"
  },
  {
    "text" : "What that one definitely didn't land either because it was silent afterwards.",
    "speaker" : "Andy",
    "timestamp" : "37:08-37:12"
  },
  {
    "timestamp" : "37:12-37:14",
    "text" : "It was it was so ridiculous.",
    "speaker" : "Steve"
  },
  {
    "text" : "What could you even be inferring there?",
    "timestamp" : "37:14-37:17",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Do you think Army Casane watches that and then like model? I don't know.",
    "timestamp" : "37:18-37:22"
  },
  {
    "text" : "He's kinda he's gonna like feel like the only good thing about him is his feet.",
    "speaker" : "Andy",
    "timestamp" : "37:22-37:26"
  },
  {
    "speaker" : "Greg",
    "text" : "That's what I that's what I'm saying. I mean the only thing I can think of is like, you know, like uh you're I'm a model. No, I'm a hand model. Oh right, right. But but then you would say like hand, not foot. Like no one's a foot model except for like foot fetish porns.",
    "timestamp" : "37:27-37:41"
  },
  {
    "text" : "So maybe the world was just a more naive place back in the day. Yeah. They didn't have Foot fetish porn.",
    "timestamp" : "37:42-37:51",
    "speaker" : "Andy"
  },
  {
    "text" : "Phil Sims loves it when he does uh Rets Ryan games, you know, meetup afterwards. Search for AOL keyword, foot fetish. But you know, they had some good ones with the brew instead of boo, and they had some misses with the feet thing.",
    "timestamp" : "37:51-38:08",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "38:08-38:20",
    "speaker" : "Andy",
    "text" : "Well, they did have um something that I I'm going to claim as Uh vindication because it's not just me that hates the Eagles or the commentators."
  },
  {
    "speaker" : "Announcer",
    "text" : "The camera zoomed in on you and they intensified, so I felt pretty good about that. Yeah, they shouldn't boom me here though. I threw many interceptions, lots of them, so I should have loved it when I came to time.",
    "timestamp" : "38:28-38:38"
  },
  {
    "text" : "That's pretty hilarious. Alright, Phil Sims. So it's not just me that hates commentators, it's the entire city of Philadelphia. So I don't know if I feel vindicated by that because they seem to hit everybody. Yeah, they can't. Including their own team when they're winning. And food Santa, Andy. But I feel a kinship to the city of Philadelphia.",
    "speaker" : "Andy",
    "timestamp" : "38:40-39:01"
  },
  {
    "timestamp" : "39:01-39:03",
    "speaker" : "Greg",
    "text" : "Yeah, you would fit in there."
  },
  {
    "timestamp" : "39:03-39:05",
    "speaker" : "Andy",
    "text" : "I think I would. I think I was born in the wrong area of the country."
  },
  {
    "timestamp" : "39:07-39:46",
    "speaker" : "Greg",
    "text" : "It's very dist it's very like The I don't know where I fall on that as far as like one end of the spectrum, right, is like complete apathy, like an LA sports town where it's Yeah, no one gives a shit and they're not actually like they don't care about the sport. And then there's the far other end where it's like Philadelphia where they're like destructive in how serious they take it. Yeah. And I think I don't I don't know where do you think the Pats fall there? Not nearly on they're towards the Philadelphia end of things. I think so too. But recent years it feels a bit apathetic, I gotta admit."
  },
  {
    "timestamp" : "39:46-40:06",
    "speaker" : "Andy",
    "text" : "Well I think that's because we're spoilt. I mean it's hard to be destructive in your fandom when you win the Super Bowl every other year. Right, right, right. But six Super Bowls last twenty years. It's like, and if we're not winning the Super Bowl, we're winning you know, uh a World Series or a Stanley Cup or the NBA championships. Like, yeah."
  },
  {
    "timestamp" : "40:06-40:24",
    "speaker" : "Greg",
    "text" : "Yeah, because even bef before all of these this happened, like Red Sox Nation was considered As bad. Yeah, yeah. Yeah. And then you talk about the media, they're always shitting on people. I think David Price would like to have a word. Exactly."
  },
  {
    "text" : "They're just a bunch of big meanies. Probably even. Tom Brady at the end there. Like all the only thing. Because I actually heard something today about how um when does the Tampa Bay media start asking him if he's coming back next year?",
    "timestamp" : "40:24-40:40",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I can't believe they're not already asking this here at Lossaka leaves the game.",
    "timestamp" : "40:41-40:44"
  },
  {
    "timestamp" : "40:44-40:54",
    "speaker" : "Andy",
    "text" : "I mean we're already half or a quarter of the way through the season and uh you know, is he coming back? This is about the time that New England media would would start asking that question for the past what 10 years."
  },
  {
    "timestamp" : "40:55-41:15",
    "speaker" : "Steve",
    "text" : "I don't know. I think it's only certain voices are amplified louder than others. I don't think a lot of people feel that way. But it's a lot of things. So a lot of frustration gets let out when you win a ton. So There's no build-up like you do have in like Philly at this time, right? You mean even getting teased Buffalo? Probably the prime example for that. Going to all the Super Bowls and losing and then being bad for so long. Yeah. Yeah."
  },
  {
    "text" : "I think Buffalo is where, like, I think is the ideal place of like fandom because they are super passionate, they know what's going on, but they never cross that line of like what is what is over the top like It's too much. You know, like I go to a Buffalo fan game and everyone shits on me because I'm a Pats fan and they all like chirp at you, but then you you don't have to worry about getting in a fight. Yeah, they're still in party mode. Yeah, they're still like having a good time. They're like self-aware. They like yeah, they're they're just there to chirp, you know, and have a good shit. But I think Philly crosses that line maybe to a certain degree. Oh yeah.",
    "timestamp" : "41:15-41:54",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I've never been to Philly or Baltimore because uh for that same sort of reason. Yeah. Baltimore's pretty close. The Orioles are fine, but I don't know.",
    "timestamp" : "41:53-42:01",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I mean I've been to Bill's game and nobody's purposely thrown up on me",
    "timestamp" : "42:02-42:06"
  },
  {
    "text" : "So I'm just afraid of the projectile virus.",
    "speaker" : "Steve",
    "timestamp" : "42:06-42:10"
  },
  {
    "text" : "Something that's happening like every time something gets thrown out like you're throwing me out, or you know what you're doing, right, bro?",
    "timestamp" : "42:11-42:15",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that's just his go-to. I hope he knew the guy was an under or uh off-duty cop too. Oh undoubted. Because that would make it so much like more ballsy.",
    "timestamp" : "42:18-42:27"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah. You can't arrest me. Yes I can. I'm an undercover cop. Oh yeah",
    "timestamp" : "42:27-42:31"
  },
  {
    "text" : "Strong undercover this. Was it Philly where the where the guys punched the uh punch the the horse too? Is that Philly? Yeah.",
    "timestamp" : "42:33-42:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Nobody did it like Sunderland though. Oh boy. English Premier League soccer, Sunderland Newcastle. Have you seen that video? Uh-oh of the guy, there's a fan, like they're like, not a riot, but there's like a little kerfuffle after the game and they send in the cops with the horses. And this dude legitimately squares up a horse and is just like, what are you gonna do? What are you gonna do? And just fucking thumps it. Like he was like boxing a horse, not just like ran through and punched. Not just a sucker punch. Yeah, just like it's one of the funniest things I've ever seen. Oh my god. All right, we may have to add that to the horses take it? Oh yeah, he got fucked up, right? Yeah, the horse probably like it off me. Yeah, the horse didn't give a shit. It's a fucking like 65-year-old overweight English dude that's drunk.",
    "timestamp" : "42:44-43:37"
  },
  {
    "timestamp" : "43:38-43:40",
    "text" : "Probably no shirt on, sunburned.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Definitely sunburned. Yeah.",
    "timestamp" : "43:42-43:44"
  },
  {
    "timestamp" : "43:45-43:53",
    "speaker" : "Greg",
    "text" : "Oh god. So you want to give a quick run through how this how this game unfolded then?"
  },
  {
    "timestamp" : "43:53-44:58",
    "speaker" : "Andy",
    "text" : "That's basically what I was gonna do. I was trying to figure out a good way to segue into it. But yes. Not much really happened in the beginning because both teams were still, I think, struggling generally. Um the Patriots did manage uh to kick a field goal. And that was about it. But I mean they drove to inside the 10-yard line and settled for a field goal. Uh start of the second quarter, the Eagles would actually put together their only real drive of the of the game. And it was a Duce Daley touchdown run, which was I believe one of their three third down conversions on the game. Oof. Yes. Was a touchdown run on third and goal. out of 14 tries. So not great. So New England actually gets the ball back and responds, drives all the way down, and then Ken Walter muffs the halt. Bounces off his noggin, goes backwards. Patriots don't get a field goal. That was probably the low point of this game for the Pets."
  },
  {
    "text" : "Wasn't that the Was it the long snap or it looked like the snap was the issue?",
    "timestamp" : "44:58-45:02",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "45:02-46:06",
    "text" : "The snap was high, but it still went right through Ken Walder's hands. There's a had already had a 26 yard punt in the first quarter. When the pages were like doing well in field position and basically just like changed the whole field position like battle. And then he lets that go through his hands off his face and uh The Eagles recover like almost at midfield at that point because it was kind of a long-ish field goal already anyway. Um, but not to be outdone on the very next play. And this this highlights on the website because it's fantastic. McNabb somehow just straight up drops a football He like soap in the shower, like pulls his hand up to to throw it, and the ball just doesn't come with him, and just drops on the ground. And uh page to recover. This is literally like the first player after the muffed. Don't drop the cell. That's right. And he did. Rule number one. And he it kind of looked like he made a bit of a business decision, uh, Cam Newton style.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:06-46:08",
    "text" : "A Cam Newton decision.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "46:08-46:42",
    "text" : "Yeah, not jumping on that football. So New England recovers. And this is where the Pages actually get start to get moving. They drive downfield and Brady finds Fourier for his first touchdown. Uh and then New England gets once they get the ball back, they don't go anywhere and they have to punt it. But then it uh this is where another turnover happens where um what's his name, rookie Brian. Kanye Westbrook muffs the punt and is recovered by Bethel Johnson.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:43-46:43",
    "speaker" : "Greg",
    "text" : "Bethel."
  },
  {
    "speaker" : "Andy",
    "text" : "Who, yeah.",
    "timestamp" : "46:43-46:44"
  },
  {
    "timestamp" : "46:45-46:45",
    "speaker" : "Greg",
    "text" : "Rookie."
  },
  {
    "timestamp" : "46:46-46:52",
    "speaker" : "Andy",
    "text" : "Rookie Bethel Johnson, who I'd forgotten about, but he actually like had himself a game this game."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "46:53-46:58",
    "text" : "He actually had a pretty decent career if I remember. Like not like amazing, but not terrible."
  },
  {
    "text" : "He was a second round draft pick though. So I think that he came in. Probably should have yeah. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "46:58-47:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh he had two catches for 21 yards. Well the longest of 17. We'll uh leave that part out.",
    "timestamp" : "47:04-47:10"
  },
  {
    "timestamp" : "47:11-47:19",
    "speaker" : "Greg",
    "text" : "He's also like uh him and Charles Johnson, remember? You that's what you might be thinking of, Steve. Charles Jackson?"
  },
  {
    "text" : "No, no, Charles Jack Johnson went to another team.",
    "timestamp" : "47:19-47:21",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Ethel Johnson, yeah, he played for the Ravens afterwards, I want to say. Oh no, Minnesota. A couple other teams too. Nope. No? Stachek. You played three years with New England and one with Minnesota. Okay.",
    "timestamp" : "47:25-47:38"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:39-48:16",
    "text" : "Never started more than five games, which is apparently Bethel Jackson is a Presbyterian church in Jackson, Mississippi. Interesting. Yeah, you may want to look for Bethel Johnson? John, dude, Johnson's Jackson's fucking it's all I always get those guys confused because it's all the same shit. What? Are you with me? No. Like tall, skinny, fast guy that really couldn't do much. Chad Jackson, Charles Rogers, Bethel Johnson. They're all just such generic names. It's all the same player to me."
  },
  {
    "text" : "Not like Browns. It's like one of those made-up names.",
    "speaker" : "Steve",
    "timestamp" : "48:16-48:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:20-48:50",
    "text" : "Oh yeah. Browns I'll remember. That's not generic at all. But yeah, Bethel Johnson, uh, I believe they drafted him because he was like he was supposed to be super fast. Yeah. And that was like all he had. So he was returning kicks too. Uh because I think he returned the opening kick in this game. Which made me write down his name and think, oh fuck, Bethel Johnson. And then like he actually done other stuff. One of those things was recovering this muff punt that we're talking about. To the Patriots up and like inside the 20-yard line."
  },
  {
    "speaker" : "Greg",
    "text" : "Can I do a can I do a uh a name pun here?",
    "timestamp" : "48:50-48:54"
  },
  {
    "text" : "Okay.",
    "speaker" : "Andy",
    "timestamp" : "48:54-48:54"
  },
  {
    "timestamp" : "48:55-49:06",
    "text" : "Give me a barbanism. Oh little town of Bethlehem Johnson. Wow, that's a little too much.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:06-49:07",
    "text" : "Too long."
  },
  {
    "speaker" : "Greg",
    "text" : "All right. Noted.",
    "timestamp" : "49:07-49:08"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:10-49:16",
    "text" : "He's gonna say it over and over again. You know, Chris Burman's gotta deliver these highlights if he's if the names are too long to take too long to come out, you know?"
  },
  {
    "text" : "Dude, some of his names were like Like a 15-second song.",
    "speaker" : "Greg",
    "timestamp" : "49:17-49:21"
  },
  {
    "timestamp" : "49:22-49:26",
    "speaker" : "Steve",
    "text" : "That's true. Yeah. Can't have too many of those though, you know?"
  },
  {
    "text" : "That's my point. Well, we've only got the Battle Johnson one. Yeah, so uh after this muff punt that Bethel Johnson recovers, uh New England basically started the Philly 15, and I think it was like first or second play. Brady finds 4AA off that. Hard play action that he does that for some reason working really well even though they they weren't running the ball because this is Definitely like Antoine Smith running out of gas, right? Yeah. Yeah. I I don't think I saw him actually find a hole in the in the the defensive line to to actually run through. He just like puts his head down, just like runs into the line, not looking where he's going, just like trying to bash out a few yards.",
    "speaker" : "Andy",
    "timestamp" : "49:26-50:10"
  },
  {
    "text" : "I I feel like we all realized this earlier, but I thought Corey Dillon was on this team. And he comes a year later. Yeah. Which is like the bowl with like him just floundering back there and knowing they're not going to like put somebody in who's like really good because then we wouldn't have gone and got Corey Dillon.",
    "speaker" : "Steve",
    "timestamp" : "50:11-50:27"
  },
  {
    "timestamp" : "50:27-50:38",
    "text" : "Yeah, and Kevin Falk was kind of like the main running back in this game. He he had the most snaps, I think. Like he started as the as the the running back like to open the game.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "But if for like 2003, that's a different like no one had a light guy in there all the time, you know? Right, that's a deck.",
    "timestamp" : "50:39-50:44"
  },
  {
    "text" : "the lead rusher back in like 99 or 2000 and he finished with like six seven hundred yards so he wasn't like great at it you know because he's like you said he's too small to run between the tackles but in this game Let's see. Patriots leading rushers. Antoine Smith, 12 carries, 25 yards. Yeah. With a longest of nine. It's even worse. So averaging about two yards a carry and Kevin Falk seven carries twenty-three yards. It's not great, but better. But Kevin Falk also had four catches for 59 yards.",
    "speaker" : "Andy",
    "timestamp" : "50:48-51:25"
  },
  {
    "text" : "Yeah. See that's Brady played really well, so it didn't really matter. I mean he was slinging it. Brady was spreading it out.",
    "timestamp" : "51:25-51:31",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "51:32-52:00",
    "text" : "Do you think it's that he's too small to run between the tackles? I always thought it was like he wasn't he relied a lot on like change of direction and like change of pace. Where it's like a a a a traditional running back is like put your foot in the ground and just like drive. Right. Where Kevin Falk was always like, I'll catch it and then like juke quit, you know? It's he always seemed better fitted for uh like a receiving back because of that or like a draw draw play running back."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:01-52:04",
    "text" : "Exactly. Yeah, he's really good out in in space, but like yeah."
  },
  {
    "text" : "Yeah, I don't think he was that athletic, but he was just like a savvy Yeah like shifty change of pace direction guy.",
    "speaker" : "Greg",
    "timestamp" : "52:04-52:11"
  },
  {
    "timestamp" : "52:11-52:40",
    "speaker" : "Steve",
    "text" : "Alright, I have a hot take for you. You know who's the best receiving back that we've had? We can call Shane Vereen, Kevin Falk, James White. at running in between the tackles is James White. No, that's someone better on the team. Rex Burkhead. Yeah. He's actually legit at getting through those. He's actually his body's a little different. He's a little thicker. And he's not quite as good receiving as some of those other guys, but he's definitely a good receiver and you get him in space and he's pretty shifty too."
  },
  {
    "text" : "So that's the thing. I think Rex Burkhead is a better runner than the Patriots uh receiving running backs and a better receiver than their like run-first running backs. Like he's a better receiver than No, he's a better receiver than like Sony Machine. Receivers. But he's he's a better runner uh like between the tackles than James White.",
    "speaker" : "Andy",
    "timestamp" : "52:40-53:05"
  },
  {
    "speaker" : "Steve",
    "text" : "So he's that kind of thing.",
    "timestamp" : "53:05-53:06"
  },
  {
    "text" : "Unless he's but the thing you never know is like good at what is he at uh blitz pickup though because we always rate running backs by how they how they run or how they catch, but that's a huge part of especially like a Belcheck offense is how can you pick up blitzes. And that's something that like unless you've you're studying game film, you're not gonna like pick up on every like good play, you know? Right. Yeah, absolutely. Absolutely.",
    "timestamp" : "53:09-53:34",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and I think that's why the like a page is getting a lot of heat for drafting Sony Michelle over Nick Chubb. But yes, I think one of the knocks on Nick Chubb is that he he's not great at Pass protection and blitz pickup and that sort of stuff.",
    "timestamp" : "53:34-53:48"
  },
  {
    "text" : "So I mean that change and that changed the Atlanta Super Bowl. The running back missing a blitz pickup. So Brian Jack is is not gonna stop him now. He's like, well, look. If he was good at his job, that play wouldn't have happened and who knows.",
    "timestamp" : "53:48-54:01",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "54:01-54:13",
    "speaker" : "Greg",
    "text" : "It's a fair point. I mean uh the the drop off between one running back to the other is probably less than missing a critical block and getting a sack or a turnover in a in a big spot, you know?"
  },
  {
    "text" : "Especially in today's NFL too, where it's mostly pass driven. Like at this point it feels like most offenses are using the pass to set up the run instead of what it used to and these the other way around. Yeah.",
    "timestamp" : "54:13-54:24",
    "speaker" : "Andy"
  },
  {
    "text" : "So yeah, that's a good point.",
    "timestamp" : "54:24-54:25",
    "speaker" : "Steve"
  },
  {
    "text" : "So uh there was no setting up anything in this game though. Uh the Patriots Didn't do anything on the ground like we talked about. They have 50 total yards rushing or something garbage like that. Tom Brady, third leading rush on the Patriots. With seven yards in this game. Nice. On six attempts. Good for him. But they did do a couple of like I I feel like they've been doing it this season and a little bit of last season where even on like Second and five, they're doing the Brady like goose the center QB sneaks just to get in third and short, like third and one, third and two, just to get those like free yards, which I'm surprised you don't see more of. Because it's almost automatic, really. But yeah, so six characters. You just like saying goose. I do.",
    "timestamp" : "54:26-55:12",
    "speaker" : "Andy"
  },
  {
    "text" : "I've noticed every time you say it, you're like goose the sound. You like really emphasizes the the goose part. You you goose him. It's nice.",
    "timestamp" : "55:12-55:23",
    "speaker" : "Greg"
  },
  {
    "text" : "Give him the old facing goose done. Yeah. Um, so yeah, that that's all we have in the the first half of this game.",
    "speaker" : "Andy",
    "timestamp" : "55:23-55:32"
  },
  {
    "timestamp" : "55:33-55:37",
    "speaker" : "Greg",
    "text" : "So they're going to have the what's the score? 17-7 out half."
  },
  {
    "timestamp" : "55:37-55:42",
    "speaker" : "Andy",
    "text" : "17-7 and the boobirds are out in force like a lot."
  },
  {
    "speaker" : "Greg",
    "text" : "And for perspective, their four-point favorites come into this game, the Eagles.",
    "timestamp" : "55:43-55:47"
  },
  {
    "timestamp" : "55:48-55:50",
    "text" : "I was wondering that actually.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "55:50-56:02",
    "text" : "Yeah, I mean the Patriots got their Doors blown off in week one. They're they're the team hates their coach and yada yada yada. You know, Tom Jackson, all that.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:02-56:07",
    "text" : "Oh, yeah, and I guess the Eagles were NFC championship and we didn't even make the playoffs.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. Right. So and there's like a whole lot of turnover too.",
    "timestamp" : "56:07-56:10"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "56:11-56:11",
    "text" : "Home."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Yeah. So it makes sense. The uh Ted Washington played really good in this game.",
    "timestamp" : "56:11-56:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I think the the defense as a whole did like the there was a lot of blitzing happening and it seemed like every blitz got home. Uh the Patriots sacked McNabb, I think it was eight times I saw.",
    "timestamp" : "56:18-56:33"
  },
  {
    "speaker" : "Announcer",
    "text" : "Yeah.",
    "timestamp" : "56:33-56:34"
  },
  {
    "timestamp" : "56:34-56:42",
    "text" : "Eight times For 43 yards. And even when he wasn't getting sacked, he was getting a helmet in the chest pretty much every time he dropped back to pass.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That's how Bruski got his pick six. It was silent similar to that uh Rams Super Bowl. Yeah.",
    "timestamp" : "56:42-56:47"
  },
  {
    "text" : "Yeah. It was uh I think Vrabel on both of them because there was also another Yeah, it was Vrabel. Actually, let me see if I can bring this up because there was uh an interception before that where here's a name for you. Let me find it. Uh continue talking while I find this fucking game.",
    "timestamp" : "56:49-57:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "So Donovan McNabb has he's sacked eight times. He throws two picks. And how many fumbles did he have?",
    "timestamp" : "57:11-57:21"
  },
  {
    "timestamp" : "57:22-57:24",
    "speaker" : "Andy",
    "text" : "I think he had two, but he recovered one of them."
  },
  {
    "text" : "That's a fucking rough day at the office. In front of your home fans. He goes 18 of 46 for 186 yards. He almost threw the ball 50 times and he didn't even break 200. Oh yeah, yeah. He was like 30% completion or something garbage. God, no touchdowns. He had a rough day at the office.",
    "speaker" : "Greg",
    "timestamp" : "57:24-57:47"
  },
  {
    "timestamp" : "57:49-58:35",
    "speaker" : "Andy",
    "text" : "So, can you boys see this? Yes. So this is the interception that he threw to Eric Morris, I believe. Aric. A-R-I-C. A-R-R-I-C. Never heard of him. Me neither. But like it looks bad. And this is like a can of corn. He threw it deep, and the receiver didn't actually go deep. Um, but if you watch the play. I'm gonna I'm gonna key you into Mike Vrabel on the replay here, who is right here. And watch how he gets blocked. The offensive lineman's like, nah, not my problem. Just watch this guard. Like, nah."
  },
  {
    "speaker" : "Steve",
    "text" : "This is the GIF from your website, right Andy?",
    "timestamp" : "58:35-58:37"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, this so this is on the Pagers Dynasty website.",
    "timestamp" : "58:37-58:40"
  },
  {
    "speaker" : "Steve",
    "text" : "That's the title of the GIF, which was the name of it.",
    "timestamp" : "58:40-58:43"
  },
  {
    "timestamp" : "58:43-58:54",
    "speaker" : "Andy",
    "text" : "Uh it is, where is it? Uh oh yeah, McNabb takes a shot from Vabel and is easily picked off by Eric Morris. Ericks."
  },
  {
    "timestamp" : "58:57-59:10",
    "speaker" : "Steve",
    "text" : "You know he's telling people, yeah, I got an interception with the Patriots. They're like, no, you didn't. He's like, yeah, I got a Super Bowl ring. And they're like, no way, Eric. I never heard of you. Now we can say, hey, dude, go on our website. We have a gift for you. Show all your friends."
  },
  {
    "speaker" : "Andy",
    "text" : "It's yeah. Uh he is on here somewhere? He's not.",
    "timestamp" : "59:10-59:17"
  },
  {
    "text" : "Oh, you're you're hitting him up now. Okay.",
    "speaker" : "Steve",
    "timestamp" : "59:18-59:20"
  },
  {
    "text" : "Eric? I'm just trying to find oh I must spell it right. A-R-I-C. Eric Morris. I've never heard of him. Have you?",
    "timestamp" : "59:20-59:30",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "59:30-59:31",
    "speaker" : "Steve",
    "text" : "No."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:31-59:32",
    "text" : "Nope."
  },
  {
    "timestamp" : "59:32-59:38",
    "speaker" : "Greg",
    "text" : "Played in Tennessee for three years and then this is his last season of his career."
  },
  {
    "timestamp" : "59:38-59:41",
    "speaker" : "Andy",
    "text" : "Only ever star he started ten games in 2001."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "59:42-59:45",
    "text" : "Is this his only interception? It is. Yeah. Yes."
  },
  {
    "timestamp" : "59:46-59:48",
    "speaker" : "Steve",
    "text" : "That's a sweet he's gotta have a Super Bowl ring though, right?"
  },
  {
    "speaker" : "Greg",
    "text" : "You would expect so, yeah.",
    "timestamp" : "59:49-59:50"
  },
  {
    "text" : "I guess so, yeah. That's on the team.",
    "speaker" : "Andy",
    "timestamp" : "59:50-59:53"
  },
  {
    "speaker" : "Steve",
    "text" : "We're just finding new Super Bowl heroes we don't even know about. Eric Morris.",
    "timestamp" : "59:53-59:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Eric Morris. Yeah, with the can of corn interception.",
    "timestamp" : "59:57-01:00:00"
  },
  {
    "text" : "Just embodying the next man up philosophy of our team.",
    "speaker" : "Steve",
    "timestamp" : "01:00:00-01:00:03"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Because I yeah, I think somebody went down.",
    "timestamp" : "01:00:04-01:00:06"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:07-01:00:17",
    "text" : "With an injury, which is why he was well he probably doesn't play because they actually hit on a couple draft picks this year, right? Yeah. Sante Samuel."
  },
  {
    "text" : "Yeah, you want to talk about our draft? Because you guys didn't get to that, right? No, we're really gonna talk about it week one, yeah. Because this draft is stacked full of talent. Talk to me. All right. So uh first round, 13th pick, Ty Warren out of Texas AM. Nice. Uh second round, they picked Eugene Wilson, the uh, I guess he was a cornerback in college, but ended up playing safety. Yep. Yep. Bethel Johnson also in the second round. Fourth round, Dan Klecko out of Temple. All right. Asante Samuel, a fucking steal in the fourth round.",
    "timestamp" : "01:00:18-01:00:56",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:00:56-01:00:58",
    "speaker" : "Andy",
    "text" : "Yeah. Oh, damn."
  },
  {
    "speaker" : "Greg",
    "text" : "Dan Copen, fifth round. There's another stud. Uh Tully Bantacane in the seventh round. Yeah. Yep. Oh, we did talk about one of these. Seventh round pick. I didn't know this. The sixth round draft pick. Yes. Cliff Kingsbury. We did talk about him last week.",
    "timestamp" : "01:00:58-01:01:15"
  },
  {
    "timestamp" : "01:01:15-01:01:19",
    "speaker" : "Steve",
    "text" : "Is it that is that their entire draft picks, or is it any really no guys?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:01:19-01:01:24",
    "text" : "Spencer Need in the seventh and Ethan Kelly in the seventh that didn't make the roster. Okay."
  },
  {
    "speaker" : "Steve",
    "text" : "But the rest of those guys that's a great draft.",
    "timestamp" : "01:01:24-01:01:26"
  },
  {
    "timestamp" : "01:01:26-01:01:27",
    "speaker" : "Greg",
    "text" : "Great draft."
  },
  {
    "timestamp" : "01:01:28-01:01:30",
    "text" : "All those guys contributed meaningfully.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Two pro two pro bowlers, Samuel and Copin. Yep.",
    "timestamp" : "01:01:31-01:01:35"
  },
  {
    "text" : "And Tully Bancane had at least a year with double-digit sacks.",
    "speaker" : "Steve",
    "timestamp" : "01:01:36-01:01:40"
  },
  {
    "text" : "Yeah, he led the team in sacks in what was that like 06-ish, give or take? Seventh round draft pickets.",
    "timestamp" : "01:01:40-01:01:46",
    "speaker" : "Andy"
  },
  {
    "text" : "At some point, yeah. I've ever told you that story about uh Kelly giving him the credit card.",
    "speaker" : "Greg",
    "timestamp" : "01:01:46-01:01:54"
  },
  {
    "timestamp" : "01:01:55-01:02:00",
    "speaker" : "Andy",
    "text" : "I think you should tell it again. I feel like I've heard it in passing. This is showed up on the pocket."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:02:01-01:03:00",
    "text" : "Six or seven years ago? It was actually It was probably closer to 10. It was when me and Kelly first started dating, my wife. Um and we were we went to the some kid in Maine. So I went to UNH, some kid in Maine used to throw this like big party every year. And you had this big mansion, blah, blah, blah. And uh Tully Bantacane ended up showing at the showing up at the party with like a fucking ridiculous Lamborghini. It was fucking so sweet. But we're all like we're all like college kids that love the pets and we're like, Oh my god, sucking Tully Vantacane, Tully Vanticane. You know. Too nervous to fucking talk to him or that shit. But we're on the dance floor and Kelly's like, oh, these are the Patriots. And she goes up behind him. And goes sh swipes between his butt cheeks with her hand. She's like, Oh, I gave him the credit card I was like, what the fuck?"
  },
  {
    "text" : "What did the Delyman game do?",
    "speaker" : "Steve",
    "timestamp" : "01:03:00-01:03:02"
  },
  {
    "timestamp" : "01:03:04-01:03:11",
    "text" : "I don't know where it came from or why she did it, but it was awesome. And then uh and then we got married.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:14-01:03:18",
    "text" : "So has she ever given you the credit card? Or is she just saved that for famous Patriot?"
  },
  {
    "text" : "That's the only time I've seen her do it, too. Maybe it's jealous, Greg. I mean it sounds like you're a little upset about that. I'm not jealous at all. I thought it was awesome.",
    "speaker" : "Greg",
    "timestamp" : "01:03:18-01:03:26"
  },
  {
    "timestamp" : "01:03:27-01:03:29",
    "speaker" : "Steve",
    "text" : "Oh I mean I can credit card you if you want"
  },
  {
    "text" : "Yeah, I mean just the fact that she's credit carding the fucking star the the leading sacker on the New England Patriots at a house party in Maine.",
    "timestamp" : "01:03:30-01:03:40",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:41-01:03:53",
    "text" : "Yeah. Yeah. Oh, god damn. You two are made for each other, really. Yeah. Yeah. Like we give you a lot of shit for the shit you give her, but like, yeah We're one and the same."
  },
  {
    "text" : "Yeah. Think about this. Kelly comes downstairs. Mom's listening to the podcast, looks over here and goes, Kelly, I'm learning a lot about you.",
    "timestamp" : "01:03:53-01:04:01",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Chris is gonna be awkward this year, isn't it? Yeah. You guys come back to visit.",
    "timestamp" : "01:04:02-01:04:06"
  },
  {
    "timestamp" : "01:04:06-01:04:16",
    "text" : "Oh mom yelled at me the other day when I called her. Why? Uh for the the the when we were talking about pictures of our willies.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mom",
    "text" : "I don't remember that one.",
    "timestamp" : "01:04:17-01:04:18"
  },
  {
    "text" : "I remember the background. Yeah. So I mom, I would like to take this moment to say sorry. I apologize. No more Willy talk on the on the pod.",
    "timestamp" : "01:04:19-01:04:29",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. He says directly after the credit card story. Well we've officially moved the butt talk. No. Oh boy. Well, the uh the Cam Newton erotica uh book review will have come out by this point, so Yeah. You've got you'll have other stuff to apologize when that comes out.",
    "timestamp" : "01:04:30-01:04:54"
  },
  {
    "timestamp" : "01:04:54-01:05:02",
    "text" : "Yeah. Is there any way we can like block her from listening to that? You have an IP address or something.",
    "speaker" : "Greg"
  },
  {
    "text" : "That can help you out. Oh shit. Speaking of credit cards though.",
    "timestamp" : "01:05:02-01:05:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "You guys want to plop down your best and worst?",
    "timestamp" : "01:05:11-01:05:13"
  },
  {
    "speaker" : "Andy",
    "text" : "You want to swipe that best right up your crack? Um oh all right, yeah. Uh do you guys want to go first? I got a couple things to touch on that aren't necessarily game related. So you guys can Take your pick. Go ahead, Steve.",
    "timestamp" : "01:05:15-01:05:32"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:05:32-01:06:01",
    "text" : "I had a setup this weekend where I had two TVs going. All right. So I watched the Patriots game and Red Zone. And then after the Patriots game, I put on old Patriots games with red zone on it. And the uh red zone game that it was like only two games were on at that point, and one of them was the Titans and one of them was the Bucs. So I was watching Vrabel coaching and Brady playing while watching this game of Brady and Grabo playing. It was crazy. That's pretty. That's sick."
  },
  {
    "timestamp" : "01:06:01-01:06:06",
    "speaker" : "Greg",
    "text" : "I was like, this is from Crossing Generations. Oh my God."
  },
  {
    "speaker" : "Steve",
    "text" : "And like the difference in the quality between the two broadcasts was, you know, you don't really notice until you put them right next to each other.",
    "timestamp" : "01:06:06-01:06:13"
  },
  {
    "text" : "Yeah, this was like, you can definitely tell that some of these games were recorded on VHS. Yeah. Yeah. And have been like digitized from the actual tape. Cause they have the like squiggles every once in a while.",
    "speaker" : "Andy",
    "timestamp" : "01:06:13-01:06:26"
  },
  {
    "timestamp" : "01:06:27-01:06:27",
    "speaker" : "Steve",
    "text" : "Yep."
  },
  {
    "text" : "Well there's I don't know. That just throws you back.",
    "timestamp" : "01:06:27-01:06:29",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:06:29-01:06:33",
    "speaker" : "Steve",
    "text" : "You see some like the letters and stuff in the bottom, the numbers in the bottom corner. Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:34-01:06:39",
    "text" : "Where it's say it's still saying twelve o'clock midnight because the guy hasn't set the time on his VCR."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. All right, and my worst I don't know. There was a fifty-seven yard field goal hit by David Greenacers. Which he hit flush. That thing had another like ten yards in it.",
    "timestamp" : "01:06:39-01:06:52"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:52-01:06:55",
    "text" : "Oh yeah. Yeah, that thing hit the netting halfway up."
  },
  {
    "timestamp" : "01:06:55-01:07:37",
    "text" : "And we talked about our like mess up on the holder snap operation. And Greg, this may be a good one for you, but I feel like I remember some time about the long snapping being a huge issue this whole season. I remember it being an issue once. Maybe like the pressure to perform was too much and then maybe some dude got hurt or something. There was some whole backstory about how long snapping and especially the Super Bowl was like all sorts of messed up. I remember that. So maybe a negative in this game because I don't know if that was the holder. I know you love bringing the punters, but it might be the snapper. And I wonder how many of like bad snaps we're gonna see this year and that'd be something to keep an eye on.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:07:38-01:07:55",
    "text" : "Yeah, I think we yeah, maybe we'll have to find that out and do a deep dive if it is this season. Cause yeah, I remember hearing about that where like One of the issues the Patriots had was their long snapper who was having like confidence issues. And it was like uh who was that catcher who couldn't throw it back to the the pitcher?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07:58-01:08:00",
    "speaker" : "Greg",
    "text" : "John Lester couldn't throw to first base."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, there was that too, yeah. But wasn't there uh Scott Hatterberg? Was it him? Yeah, it was it was some Red Sox catcher who just couldn't throw the ball back to the pitcher.",
    "timestamp" : "01:08:00-01:08:10"
  },
  {
    "speaker" : "Greg",
    "text" : "He's a guy from Moneyball. I just rewatched that.",
    "timestamp" : "01:08:10-01:08:13"
  },
  {
    "timestamp" : "01:08:15-01:08:22",
    "speaker" : "Andy",
    "text" : "But yeah, no, that that sounds familiar, so we'll find out about it. Yeah. What about you, Greg?"
  },
  {
    "speaker" : "Greg",
    "text" : "Got some best of worst. All right, so for my worst, I'm gonna start out with the Eagles offense. They had a grand total of sixteen drives in this game. Yeah. And fucking 10 points punt punt touchdown fumble punt punt punt fumble punt punt punt field goal interception interception fumble end of game Close and strong.",
    "timestamp" : "01:08:22-01:08:53"
  },
  {
    "text" : "Like I said, like you said, uh it sounds like it's closer than it was. You listen to that drive chart. No, it doesn't. God, dude. And one of those interceptions at least is a pick six, you know, because that's Bruski's. Yeah, yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:08:53-01:09:05"
  },
  {
    "text" : "They finished uh the game with 268 yards total. Which uh if you break it down by drive, they they had like uh just over 16 yards per drive.",
    "speaker" : "Andy",
    "timestamp" : "01:09:06-01:09:18"
  },
  {
    "speaker" : "Steve",
    "text" : "That's tough.",
    "timestamp" : "01:09:19-01:09:20"
  },
  {
    "text" : "Which if you're starting in your own 20, it doesn't get you into midfield.",
    "speaker" : "Andy",
    "timestamp" : "01:09:20-01:09:24"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:09:24-01:09:25"
  },
  {
    "timestamp" : "01:09:25-01:09:26",
    "text" : "Not great.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:09:26-01:09:55",
    "speaker" : "Greg",
    "text" : "Yeah. Um so for my best I'm kind of winging it here. Uh we'll go with Tom Brady. I mean, offensively, there was no one that had like big stats jump out. There's no one over a hundred yards receiving or or rushing. But Brady had a pretty decent statistical day, 30 of 44 for 255, three touchdowns, no picks. So he looks like he's back on track after that disaster last week."
  },
  {
    "text" : "It looked like one of those games where he knew where he wanted to go with the ball. Like that completion percentage surprises me a little bit. That'd be way higher because like it felt like everything he put, the ball was right where the receiver needed it and he was super accurate and making great calls.",
    "speaker" : "Steve",
    "timestamp" : "01:09:55-01:10:08"
  },
  {
    "text" : "How'd the line play? Better. Yeah. Because I think that has a lot to do with it too. Once he gets those like happy feet when he's getting rushed, that's when he starts like getting inaccurate too.",
    "timestamp" : "01:10:08-01:10:20",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:20-01:10:53",
    "text" : "Yeah, I mean it still wasn't You know, you think of 2003 Patriots and you think of like how dominant they were because how many games they won in a row and all that stuff and what they finished like 14 and 2 or whatever it is. But yeah, this it didn't quite look like they were in sync offensively. It was just the defense, you know, getting eight sacks and getting pressure on McNabb basically every play. And uh Yeah, but I mean Brady, I think he hit 10 different receivers. So it was that kind of error where you know his favorite receiver was the open one."
  },
  {
    "text" : "Yeah, exactly. I love that quote. Yeah.",
    "timestamp" : "01:10:54-01:10:56",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So uh It was like it was an efficient game, but it wasn't like blowing you away. I did have a play that again is in the uh on the website. Brady completing a pass to uh Daniel Graham, who I believe was his tenth wide receiver of the day. Uh, but this one was a bit by accident. But it's still fantastic. Like this was the kind of day they were having. Yeah. That play still goes for three years.",
    "timestamp" : "01:10:56-01:11:26"
  },
  {
    "timestamp" : "01:11:26-01:11:30",
    "text" : "He tries to set up a screen rolling to his left and it gets kind of blown up because he's getting pressured too much.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:30-01:11:33",
    "text" : "I don't think it was a screen. It was just one of those like Design rollouts."
  },
  {
    "text" : "It's a screen to Gramps. Bootlock. Watch it's a screen to Gram. And they blitz from the left, so there's a ton of dudes coming. And if he can get it out, I think he's got it.",
    "speaker" : "Steve",
    "timestamp" : "01:11:34-01:11:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:42-01:11:58",
    "text" : "I don't think so because Usually the whole offensive line will run that way and like let their blockers through, but the the blitz just came from the other side and Brady didn't see it. Because you can watch the other receivers actually going like down the field looking for rounds like there's open receivers. Right. He shifted the protection the wrong way."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:11:58-01:11:58"
  },
  {
    "timestamp" : "01:11:58-01:12:02",
    "text" : "Yeah. And so the whole thing just didn't work out, but it worked out.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That's a great play from Graham to go from blocking to turn around and catching it.",
    "timestamp" : "01:12:03-01:12:06"
  },
  {
    "speaker" : "Greg",
    "text" : "Yep. He's on the uh all dynasty team. Do you guys see that list got released? Uh right.",
    "timestamp" : "01:12:06-01:12:11"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know if I agree with him on there over like Watson.",
    "timestamp" : "01:12:11-01:12:15"
  },
  {
    "timestamp" : "01:12:15-01:12:17",
    "speaker" : "Greg",
    "text" : "Yeah, but that was the only real talk."
  },
  {
    "text" : "That's what it is. Yeah, I agree, yeah, we'll have to put our own.",
    "speaker" : "Andy",
    "timestamp" : "01:12:17-01:12:25"
  },
  {
    "timestamp" : "01:12:25-01:12:30",
    "speaker" : "Steve",
    "text" : "Because we know someone who had an influence in it so we can just drag him. Idiot."
  },
  {
    "timestamp" : "01:12:31-01:13:32",
    "speaker" : "Greg",
    "text" : "I have another worse too. Ye All right, I'm listening. Speaking of uh the drafts this year, I mean the Pat said that stacked ass draft. The Philadelphia Eagles 2003 draft, they had um six draft picks. And only two of them actually made the roster. Their first and second picks, Jerome McDougal and LJ Smith. And they cut their third, third, fourth, sixth, and seventh round picks. In that training camp? Yeah, and didn't make the roster. Imagine the uproar. Yeah. So they they do. Yeah. They they cut four of their six draft picks. They lose week one, week two in blowout fashion after coming off. uh NFC championship. Yeah. So you could the boo birds are kind of justified here."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:13:33-01:13:38",
    "text" : "How close was the NFC championship game? Was that like a close game or did they get shit stomped by the Bucks?"
  },
  {
    "text" : "I think I think it was a close-ish game, but they never really got rolling, right? Because that's the Ronde Barber pick six game. Yeah. Remember that? Nope. Yeah. Okay. Uh Yeah, you want me to find the score? Now did you do your best yet? Yeah, my best was Brady, but also I think I want to give it to uh uh a full team effort from the defense.",
    "speaker" : "Greg",
    "timestamp" : "01:13:38-01:14:03"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, specifically Dean Wilson.",
    "timestamp" : "01:14:04-01:14:06"
  },
  {
    "text" : "Eugene Wilson, he's just died, but I mean what they had eight sacks spread over seven seven players Yeah?",
    "speaker" : "Greg",
    "timestamp" : "01:14:06-01:14:14"
  },
  {
    "text" : "Eight sacks, five force fumbles, four of which they rec uh yeah, four of which the defense recovered. Yeah.",
    "timestamp" : "01:14:15-01:14:21",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Five force fumbles. Jeez, and then how many picks?",
    "timestamp" : "01:14:21-01:14:25"
  },
  {
    "timestamp" : "01:14:25-01:14:26",
    "text" : "Two picks.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "They recovered four of those five force fumbles too. Lord. And no one had more than one. So it's like everyone chipped into the game.",
    "timestamp" : "01:14:26-01:14:34"
  },
  {
    "timestamp" : "01:14:34-01:14:46",
    "speaker" : "Andy",
    "text" : "Yeah, this is an absolute shellacking. Yep. Yeah, it was a great play. Um, I think going off of that, my game ball will go to Matt Chatham. Yes. That's right."
  },
  {
    "timestamp" : "01:14:47-01:14:49",
    "speaker" : "Greg",
    "text" : "I did watch that in the highlight package."
  },
  {
    "timestamp" : "01:14:50-01:15:28",
    "speaker" : "Andy",
    "text" : "Early on, he had a great play where I think it was the first Patriots drive. It was. The yeah the Patriots got to like uh in s just inside the the like Philly side of the field, but they ended up having to punt. And the punt was actually really good. It it hit at like the one or two yard line and bounced straight up. And it was over towards the the sideline. And Matt Chatham went out there and instead of like trying to do anything, just took it and just batted it straight out of bounds. It's volleyball. Yeah. It was like a great heads-up sort of play that you w you want your your guys to be making on special teams. And so the Eagles first drive started from their own two yard line."
  },
  {
    "speaker" : "Steve",
    "text" : "Well that's smart. Instead of trying to catch it and it bounces off your hands and goes in the end zone and you thinking I'm not the best hands, but I can definitely just smack this out of bounds.",
    "timestamp" : "01:15:28-01:15:35"
  },
  {
    "timestamp" : "01:15:35-01:15:36",
    "speaker" : "Andy",
    "text" : "Especially as a linebacker. Yeah."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:15:36-01:15:37"
  },
  {
    "timestamp" : "01:15:37-01:15:39",
    "speaker" : "Andy",
    "text" : "So yeah, it was a perfect heads-up sort of play."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:15:39-01:15:40",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:15:40-01:16:09",
    "speaker" : "Andy",
    "text" : "Uh and then uh right after Bruski's pick six, uh, Philly actually started driving, got to about midfield. This is, you know, towards the end of the game, right in the fourth quarter, late in the fourth. uh right before like official garbage time. But garbage time would start when uh McNabb rolled out to his right and Matt Chatham like from the other side of the field just ran his ass down. and put on one of the like textbook linebacker blind side hits."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:16:09-01:16:12",
    "text" : "Like uh I think calling it that we got fucked up."
  },
  {
    "speaker" : "Andy",
    "text" : "I think calling it uh Lawrence Taylor-esque is probably a bit too strong, but yeah. He got lit up. Drop the ball.",
    "timestamp" : "01:16:12-01:16:18"
  },
  {
    "timestamp" : "01:16:18-01:16:24",
    "speaker" : "Steve",
    "text" : "It's a clean hit. McNabb just doesn't see. He's looking downfield, pumping, and just does not see Chatham coming on the backside."
  },
  {
    "timestamp" : "01:16:25-01:16:28",
    "speaker" : "Greg",
    "text" : "One of those ones that make you neck hurt. Just walking down. One of those."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. So I think that was the last play that McNabb.",
    "timestamp" : "01:16:29-01:16:31"
  },
  {
    "text" : "And then Anthony Pleasant scoops it up and tries to do the old Troy Brown lateral to Billy McGuinness.",
    "timestamp" : "01:16:31-01:16:37",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, who gets another like five yards out of it.",
    "timestamp" : "01:16:37-01:16:39",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, it's Willie McGuinness. He's not like fleet of foot. No. Otherwise it would have worked.",
    "speaker" : "Steve",
    "timestamp" : "01:16:41-01:16:45"
  },
  {
    "speaker" : "Andy",
    "text" : "He's not Antoine Harris, is he?",
    "timestamp" : "01:16:45-01:16:47"
  },
  {
    "text" : "Love the effort though. We're down, we're up 3110. Let's make sure we can wild this fucking strip sack for another TD, baby.",
    "speaker" : "Steve",
    "timestamp" : "01:16:47-01:16:53"
  },
  {
    "text" : "It's a crazy call.",
    "timestamp" : "01:16:54-01:16:55",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Um, my worst in this was uh I'm not gonna blame the referees even though it looked like it was their fault. No, I think it was it was more Belichick than anything, but every time it was like third and one, Belichick would call for measurement. And so they bring out the chains and it was like a yard and a half short. It wasn't even close. But Belichick did it like four or five times in the first half.",
    "timestamp" : "01:16:56-01:17:21"
  },
  {
    "speaker" : "Steve",
    "text" : "Just like, yeah, like three timeouts with it. I feel like it's a little bit more.",
    "timestamp" : "01:17:21-01:17:23"
  },
  {
    "timestamp" : "01:17:24-01:17:30",
    "speaker" : "Andy",
    "text" : "Can I get a measurement on this? It's like w it it it's not you're you're like two yards away. I'm surprised they didn't just say no."
  },
  {
    "text" : "Yeah. But it's like the game every time it was calling for a measure, it was in like at least like should I go for this sort of thing.",
    "speaker" : "Steve",
    "timestamp" : "01:17:30-01:17:37"
  },
  {
    "speaker" : "Andy",
    "text" : "Kind of, yeah. But it was usually like third down for most of them. But Yeah, this game just took so long because there was a lot of like that sort of stuff happening. There's a bunch of injuries, like they had to get the card out at one point. Like even the condensed version of this game. Without commercials was like two and a half hours long. It was a blowout, and it was still just like it took forever to watch this game. Um my best Was Bill Belchek, trendsetter? I don't know if you caught what he was wearing, but he was wearing what was like the button-up shirt version of their color rush jerseys now. All blue with the red and white stripes like across the shoulders.",
    "timestamp" : "01:17:37-01:18:23"
  },
  {
    "timestamp" : "01:18:24-01:18:26",
    "text" : "I didn't note this. I can't even picture it either.",
    "speaker" : "Steve"
  },
  {
    "text" : "Here, I'll uh I'll show you the picture that I have here.",
    "timestamp" : "01:18:27-01:18:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I can't picture, yeah.",
    "timestamp" : "01:18:29-01:18:31"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:18:32-01:18:37",
    "text" : "So a jer a button jersey? No, a button-up shirt, but in the exact same design."
  },
  {
    "text" : "Okay, yeah. Like a call. Is this a golf ball though actually? I think he looks nice. Yeah. I have a Patriots one, but it's got like silver underneath the arms. A little strange. That one looks fresh though. They should sell that.",
    "timestamp" : "01:18:38-01:18:52",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Well, I mean you can buy it in jersey form now.",
    "timestamp" : "01:18:53-01:18:55",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:18:56-01:19:04",
    "speaker" : "Steve",
    "text" : "You're right though. That looks exactly like their uniforms now. Yeah. With the the blue blue, yeah. White stripe on the co on the shoulders. Yep. And the belt."
  },
  {
    "timestamp" : "01:19:04-01:19:33",
    "speaker" : "Andy",
    "text" : "He was doing it before it was cool. That's true. And my best for the podcast, couple couple of uh news items. We ranked on the Spotify uh list, Spotify charts for football podcasts this time. Uh number 152 on the charts in Great Britain. Oh. So the one person in England Who's probably our family maybe? Yeah, oh yeah."
  },
  {
    "text" : "Let's just shout out our cousins right now. What's up, Ian, Andy? Um, we love you guys. Thanks for listening.",
    "timestamp" : "01:19:33-01:19:40",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, thanks for the one listen you gave us between the three of you. Maybe to put us on that list.",
    "timestamp" : "01:19:40-01:19:45"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:19:46-01:19:49",
    "text" : "Auntie Pauline listens. Does she? I didn't know. Yeah."
  },
  {
    "timestamp" : "01:19:53-01:19:57",
    "speaker" : "Andy",
    "text" : "Well, they didn't listen this week because that was last week and we're not on the the list this week."
  },
  {
    "text" : "So they got grandma's not listening to this podcast, Greg G's.",
    "speaker" : "Steve",
    "timestamp" : "01:19:57-01:20:00"
  },
  {
    "timestamp" : "01:20:03-01:20:36",
    "speaker" : "Andy",
    "text" : "Uh and the other thing I wanted to bring up, since now is the time, since you've actually gotten this far, is since nobody could could figure out how to actually leave us reviews, we're gonna make it even easier. We have a phone number. So you can text us. You can call and leave us a voicemail. And we will listen to them. We will read them all And we will uh if it's good, we'll fucking read it all we'll read text messages on the podcast and we will actually play the audio of any voicemails that we get."
  },
  {
    "speaker" : "Steve",
    "text" : "So I feel like a dangerous door to unlock.",
    "timestamp" : "01:20:37-01:20:39"
  },
  {
    "text" : "What's the number?",
    "timestamp" : "01:20:40-01:20:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Okay, what's the number?",
    "timestamp" : "01:20:41-01:20:43"
  },
  {
    "timestamp" : "01:20:43-01:21:05",
    "speaker" : "Andy",
    "text" : "Area code 603. If you're dialing from outside the country, you can put a one in front of that. 505-8043 Six oh three five oh five eight oh four three and that is the Patriots Dynasty hotline Oh no. So we've got a hotline now, boys."
  },
  {
    "timestamp" : "01:21:05-01:21:08",
    "speaker" : "Steve",
    "text" : "Six oh three eight oh five five a million."
  },
  {
    "text" : "Close, Steve.",
    "speaker" : "Greg",
    "timestamp" : "01:21:10-01:21:11"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:21:12-01:21:20",
    "text" : "You were I I can't imagine. People's names too. I'm bad with names. I'm instantly forgetting as soon as you told it to me. Same with that."
  },
  {
    "text" : "Does that work out to any like funny words? You know how like Oh yeah, I'll see that too.",
    "timestamp" : "01:21:20-01:21:25",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't think so. I was trying to find some funny words.",
    "timestamp" : "01:21:25-01:21:26"
  },
  {
    "speaker" : "Steve",
    "text" : "Dial 1-800 Pats pod.",
    "timestamp" : "01:21:27-01:21:29"
  },
  {
    "text" : "I tried to get that. Zero is not a. It's not a letter.",
    "timestamp" : "01:21:30-01:21:35",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:21:35-01:21:46",
    "text" : "But it's it's the way I remember is 505, which is easy enough to remember. And then 80 is Troy Brown 4-3. So it's it's Troy Brown shooting a three-point shot in basketball.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Troy palomalo. Oh no, Greg.",
    "timestamp" : "01:21:47-01:21:50"
  },
  {
    "timestamp" : "01:21:50-01:21:50",
    "text" : "No.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:21:52-01:21:54",
    "speaker" : "Andy",
    "text" : "What? You're Troy Palomalo?"
  },
  {
    "text" : "Because he's 43. I don't remember he's number 43.",
    "timestamp" : "01:21:54-01:21:56",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:57-01:21:58",
    "text" : "Yeah, no, nobody's us."
  },
  {
    "text" : "Troy brown for three brown three, baby, yeah for three. Yeah, yeah. Like if Troy Brown got on the Celtics and hits a triple, the announcer You know, in the stadium. Time's running out.",
    "speaker" : "Steve",
    "timestamp" : "01:21:59-01:22:12"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:22:12-01:22:16",
    "text" : "Ball gets kicked out. 80 for three. It's God."
  },
  {
    "text" : "Celtics win. Tylaw Barry Sanders. Yeah. That was our old house phone number. Phone phone number growing up. 893 Tyler Barry Sanders. That's how you do it.",
    "speaker" : "Greg",
    "timestamp" : "01:22:17-01:22:28"
  },
  {
    "timestamp" : "01:22:31-01:22:38",
    "speaker" : "Steve",
    "text" : "That they're now gonna get calls. While we're talking about phone numbers, that time you got lost at uh Redskin Stadium, Greg?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:22:38-01:22:43",
    "text" : "Yeah. And I remember I I that's how I remembered it too."
  },
  {
    "timestamp" : "01:22:44-01:22:47",
    "speaker" : "Steve",
    "text" : "The house no, you didn't call the house on, did you? You were that drunk?"
  },
  {
    "text" : "No, I called you. No, I called Kelly. I had Kelly's number memorized. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:22:47-01:22:52"
  },
  {
    "timestamp" : "01:22:52-01:23:42",
    "speaker" : "Steve",
    "text" : "So we go to the Patriots Redskins game and we get to the bottom of the whole walkway and Greg goes, oh, I left my phone up there. So he walks back and goes to get it. We meet our friends in the parking lot and someone's like, your brother dropped this and gives me his phone. Now he's looking for the phone that I have in my hand. Yeah. And I was like, Greg's smart enough to get up there and be like, well, I don't see the phone. Let me just go back to where we're tailgating and meet my brother. And then just doesn't show up. And then I'm like, well, I'm standing for hours. I'm like, well, I guess I just gotta go home. So what you did is you memorized your wife's number, had the cabbie call her because you didn't have any money for the cab. Had her filed a cabbie. Yeah, so I couldn't I couldn't count to my address from Redskin Stadium."
  },
  {
    "text" : "I couldn't Uber because I didn't have my phone. So I had to like hail a regular cab. But then I also didn't have any cash on me. So I could and he and I didn't have a credit card, obviously, right? Waited, obviously, what did you have? Did you not have your wallet on me? No, he he wouldn't accept a credit card. That's what it was. And so We we get there and I had to call Kelly from memory, her phone number, and have her Venmo the guy's like private fucking Venmo thing. Which consider it all things considered, you know. I'm so shocked you knew my address first of all. Exactly Right. I I was blacked out enough that I couldn't find my way to the parking lot, but I remembered a phone number that I haven't physically dialed in probably 10 years and an address that I've gone to like maybe once a year.",
    "timestamp" : "01:23:42-01:24:37",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:24:38-01:24:39",
    "speaker" : "Andy",
    "text" : "Jesus Christ."
  },
  {
    "text" : "I mean the address is because he steal my cable and that's a tie to like my address Gmail. Yeah, something like that. The phone number I I have no explanation for, but I was like, I couldn't call Lauren's number at all. So I took her name off my contacts and now I just see her phone number because I'm like I'm gonna do the same thing at some point. I'm gonna be like, fuck, I don't know Lars numbers. That should save Greg's ass at some point. I need to figure this out",
    "speaker" : "Steve",
    "timestamp" : "01:24:40-01:25:06"
  },
  {
    "speaker" : "Greg",
    "text" : "So and it was a football thing too. It was I'm trying to think of what it was there was a Mike Vrabel in there. Please don't give out your voice. I know there is a mic very much.",
    "timestamp" : "01:25:06-01:25:18"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, we already gave out don't give up. Actually, Kelly's phone number is six oh three-five oh five-eight zero four three. Please let her know what big mistake she's making.",
    "timestamp" : "01:25:18-01:25:27"
  },
  {
    "timestamp" : "01:25:28-01:25:48",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, we should say that if you leave us a voicemail or a text message, let us know which brand you like the least. And why it's Steve. Yeah. And by how much. Oh Jesus. So when we talk about big dick dummies, this is what we're talking about. It's like idiot savant shit. Where we go."
  },
  {
    "speaker" : "Greg",
    "text" : "I don't think remembering uh what ten numbers in a row is savant. It is when you're blackout.",
    "timestamp" : "01:25:49-01:25:57"
  },
  {
    "timestamp" : "01:25:59-01:26:08",
    "text" : "I'm talking about the address. Yeah. You're blackout drunk and you you you forget how to get to the parking lot. That's true. I couldn't tell you your address. Right? I couldn't tell you.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:26:09-01:26:32",
    "speaker" : "Greg",
    "text" : "Oh well that was his like password to his fucking Comcast. I remembered it that way. Actually, you know what I fucking no, I didn't even I don't even think I remembered it. I was like go to the fucking IHOP in in this city And I know where it was for the IHOP. Because I've been blacked out at that IHOP before and I remember that."
  },
  {
    "text" : "That makes a shitload more sense. Yeah. Oh Brownie.",
    "speaker" : "Steve",
    "timestamp" : "01:26:32-01:26:36"
  },
  {
    "timestamp" : "01:26:37-01:26:42",
    "speaker" : "Greg",
    "text" : "No, I know I know what it is. I could give away your address right now. I have it in the top of my head right now."
  },
  {
    "timestamp" : "01:26:42-01:27:11",
    "speaker" : "Andy",
    "text" : "Well, all right. I'm just gonna hand out our personal information. I love it. Yeah, 603-505-8043. And we I'm not gonna say we can't wait to hear from you, but I'm I'm interested to see if we get any feedback. But Troy Brown for three. That's right. That's how I remembered it when I first got it. So what's next week?"
  },
  {
    "timestamp" : "01:27:12-01:27:14",
    "speaker" : "Steve",
    "text" : "The Jets, right? Yeah."
  },
  {
    "timestamp" : "01:27:16-01:27:28",
    "speaker" : "Andy",
    "text" : "At home. Oh, that's right. Yeah. The 0-2 Jets, the windless jets so far, visiting Fox Gillette Stadium. See how the Patriots do. See if they uh can put some stuff together here."
  },
  {
    "text" : "Also a quick update on Ryan Tannehill, uh MVP candidate, Steve. Uh do you have any comment?",
    "speaker" : "Greg",
    "timestamp" : "01:27:28-01:27:36"
  },
  {
    "timestamp" : "01:27:37-01:28:45",
    "text" : "Yeah, I still. I just don't think he's that good. You know, can't COVID pandemic has really simplified things for them and have a good game plan, but someone's gonna figure it out. Remember the the Rams were the hottest offense in history until they met the Patriots and then They kind of figured out what their scheme was and someone's gonna be able to do that. It's really more Derrick Henry than Ryan Tannehill. Ryan Tannehill's just benefiting off of Derrick Henry is clearly the best player on that offense. You can't say Ryan Tannehill is your best player. Um Uh yeah, okay. Okay, so Josh Allen, while I think he's improved, he's uh he's always had that running game to his his his game and He still has that for a bit. I think he makes bad decisions when he carries the ball. He takes a lot more punishment hits than he really should. But he's a big boy, but eventually it's going to catch up to you. A la, you know, Donovan McNabb. and some of the players in Steve McNair that we're seeing in this season. And his he's really a roller coaster. His decision making is suspect and he's either like really good or really bad. There's really no in-between like steady hand Where like Ryan Tanner actually kind of shines in that as like he's pretty reliable. That is his ceiling. He's pretty he's going to give you that. Josh Allen is a fucking crapshoot play-to-play. And eventually that's gonna catch up to them.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay. That's actually not bad. I'll have a counter counter-argument. Uh both of those quarterbacks are in the top 10 for best odds to win MVP this year, currently. Yeah. Yeah. Decent quarterbacks.",
    "timestamp" : "01:28:45-01:29:01"
  },
  {
    "timestamp" : "01:29:02-01:29:06",
    "speaker" : "Steve",
    "text" : "I'm just not sold. I love it. I need to see more."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:29:06-01:29:20",
    "text" : "I love it. They suck, I believe, was the terms you use. Don't ever change Steve. Yeah. They're in like The 99 and a half percentile of NFL players."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:29:21-01:29:25",
    "text" : "When I'm matched up in fantasy, I'm all right. I'm I'm feeling good. Okay."
  },
  {
    "text" : "And on that note, this has been the Pages Dynasty Podcast. Wait, wait, I got one more.",
    "timestamp" : "01:29:27-01:29:33",
    "speaker" : "Andy"
  },
  {
    "text" : "I got one more interesting interesting fact. Uh this is your question about how the Eagles ended their last year. They lost to the Buccaneers. Who up to that point had been one and twenty-two in games played under forty degrees, and then they lost twenty-seven to ten.",
    "speaker" : "Greg",
    "timestamp" : "01:29:33-01:29:54"
  },
  {
    "text" : "At home as tough. But something to look forward to is this year's playoffs because it is out of control. There's some great stuff that happens, both with the Patriots and in the NFC. Like this is this is just an exciting year. So this is a great forward to that. But first things first next week New York Jets at home. Maybe her memory's I don't even fucking know. We'll find out next week. Nobody shits their pants like the New York Jets. The Adam Gase version. All right. See you next week, gentlemen, on the Patriots Dynasty Podcast.",
    "speaker" : "Andy",
    "timestamp" : "01:29:57-01:30:38"
  }
]