[
  {
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother."
  },
  {
    "speaker" : "Andy",
    "text" : "Welcome back to the Patriots Dynasty Podcast. We are back to our regularly scheduled programming. No more eulogy talk. We're back to 2003, week nine. Six and two Patriots heading to Denver to face the Broncos at mile high. I'm assuming it's still mile high back then, right? No, they had just made a new one, right? I think it's still called mile high though.",
    "timestamp" : "00:23-00:50"
  },
  {
    "speaker" : "Steve",
    "text" : "This is like the first or second season of Investgo Field. Whatever it was.",
    "timestamp" : "00:51-00:56"
  },
  {
    "speaker" : "Greg",
    "text" : "It's like calling the garden, the garden, sort of thing, you know. Isn't it like just Denver, the mile high city?",
    "timestamp" : "00:59-01:05"
  },
  {
    "text" : "Yes. It is, yeah. But I think that I don't know this for sure, but I feel like they built a new stadium at some point recently during the",
    "speaker" : "Steve",
    "timestamp" : "01:06-01:15"
  },
  {
    "speaker" : "Andy",
    "text" : "Two thousand one apparently according to this. Yeah. Uh but it's known as Invesco Field at Mile High.",
    "timestamp" : "01:15-01:21"
  },
  {
    "speaker" : "Steve",
    "text" : "And the because the Patriots had never won at Mile High until that game. Wow.",
    "timestamp" : "01:21-01:27"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:28-01:42",
    "text" : "So apparently it's exactly one mile high. The third the thirteenth step on the west side of the state capitol building. is exactly 5,280 feet above sea level."
  },
  {
    "timestamp" : "01:43-01:45",
    "speaker" : "Andy",
    "text" : "Well there you go. That's why it's called mile high."
  },
  {
    "timestamp" : "01:45-01:47",
    "speaker" : "Greg",
    "text" : "Mile high. Exactly mile high."
  },
  {
    "speaker" : "Andy",
    "text" : "And our listeners thought they weren't going to learn anything today coming here.",
    "timestamp" : "01:48-01:51"
  },
  {
    "timestamp" : "01:53-01:56",
    "speaker" : "Greg",
    "text" : "I thought it was because they like smoking weed, bro."
  },
  {
    "timestamp" : "01:56-01:57",
    "text" : "Yo, get lit.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yo, you like token up, dog?",
    "timestamp" : "01:57-01:59",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Um but let's do a quick snapshot of where we are because uh I don't know about you boys, it's been a while for me. Uh this season did not start well. Cut Laurie Malloy the week before the season started and then lost to the Bills and that same Laurie Malloy 31-0 to open the season. And then we haven't had many losses since then. We we lost to the Skins in week four after a couple of wins back to back for the Eagles and the Jets. And now we are, let's see, one, two, three, four. This is we've had four wins up until this. And so this is win number five. We're just gonna get out there and say it. See, what was the score of this game?",
    "timestamp" : "02:02-02:45"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:46-02:47",
    "text" : "I don't remember."
  },
  {
    "speaker" : "Andy",
    "text" : "Craig, what was the score scheme? Stat check. Twenty-six, twenty-four That's it. I actually watched it. I just remember. It is a one-score game. I watched this a few weeks ago.",
    "timestamp" : "02:48-03:05"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "03:05-03:07",
    "text" : "But let's say why people wouldn't know it because"
  },
  {
    "timestamp" : "03:07-03:15",
    "speaker" : "Andy",
    "text" : "So yeah, so this this one is one of those named games. You're right. This is the intentional safety game."
  },
  {
    "speaker" : "Steve",
    "text" : "I feel like we should dive right into that because I mean Again, this game has the name, but like that name, there's so much more to the game than there was that just that one play, but that one play is what sticks out because we were talking on the last one where we're Yeah, talking about all the different best coaching decisions in Belchak's history, this game was kind of tops on that list. It is, yes.",
    "timestamp" : "03:16-03:42"
  },
  {
    "timestamp" : "03:42-04:02",
    "speaker" : "Andy",
    "text" : "And um on that note, I I pulled a clip of of our man Bill Belichick and uh what he had to say about the game. The post-game stuff. Because this had the postgame in the case. Yeah. These are some old school like definitely converted from VHS tapes. You can see like the score."
  },
  {
    "speaker" : "Steve",
    "text" : "But then whoever recorded it Thank God they recorded the post-game interview with Brady and Belichick.",
    "timestamp" : "04:03-04:09"
  },
  {
    "text" : "Yeah. Well this is this is the one clip I pulled from because I mean we'll we'll talk about the rest of it, but this was my favorite.",
    "timestamp" : "04:09-04:15",
    "speaker" : "Andy"
  },
  {
    "text" : "I thought we had played a terrible first half. I thought it was just awful. Uh it was a miracle that we were as close as we were in the game.",
    "speaker" : "Bill Belichick",
    "timestamp" : "04:17-04:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:26-04:44",
    "text" : "So Bill, how do you feel about uh your coaching your like one of a kind coaching decision? Come to fruition these things that you practice that were like completely out of uh left field. How do you feel about that paying off and you winning the game? Well, the fact we were in this game was fucking bullshit in the first place."
  },
  {
    "timestamp" : "04:45-04:47",
    "speaker" : "Steve",
    "text" : "He wasn't wrong either. No."
  },
  {
    "timestamp" : "04:47-04:54",
    "speaker" : "Andy",
    "text" : "Yeah, this this team had um oh there were so many penalties. Let's see. Um Patriots had"
  },
  {
    "timestamp" : "04:55-04:56",
    "text" : "to that point.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, 14 penalties for 85 yards. Denver had four penalties for 30 yards in the game.",
    "timestamp" : "04:56-05:01"
  },
  {
    "timestamp" : "05:01-05:05",
    "speaker" : "Greg",
    "text" : "So nine in the first half too, right? Because he was specifically upset with the first half."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:05-05:08",
    "text" : "He was, yeah, he was he was bullshit about the first half."
  },
  {
    "speaker" : "Steve",
    "text" : "They were they were the there weren't even like cheapo penalties either. They were all, I mean, for the there's one penalty I can remember that was not reserved, but most of them were like",
    "timestamp" : "05:08-05:16"
  },
  {
    "timestamp" : "05:17-05:24",
    "speaker" : "Andy",
    "text" : "Yeah, and one there was one call that was but the rest of them were like legit calls."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh That means they're really legit.",
    "timestamp" : "05:24-05:27"
  },
  {
    "speaker" : "Steve",
    "text" : "The only one that was kind of bullshit was like they drew Matt Light offsides. And even Madden was like that's bullshit.",
    "timestamp" : "05:29-05:36"
  },
  {
    "text" : "Yeah, and called it a false star, which it it like that's another thing that the Patriots practice is if a guy jumps off sides, the offensive line will will reach out and grab him. So they make the call specifically.",
    "timestamp" : "05:36-05:46",
    "speaker" : "Andy"
  },
  {
    "text" : "Do you want to talk more about the commentators on this Annie? Because I know you're just burning it.",
    "speaker" : "Steve",
    "timestamp" : "05:48-05:51"
  },
  {
    "timestamp" : "05:52-05:53",
    "speaker" : "Andy",
    "text" : "John Madden, bud."
  },
  {
    "speaker" : "Greg",
    "text" : "This is Monday Night Football, too.",
    "timestamp" : "05:53-05:55"
  },
  {
    "timestamp" : "05:55-06:11",
    "speaker" : "Andy",
    "text" : "Monday Night Football. ABC, John Madden, Al Michaels. Love it. I love that car. I am I'm converted uh John Madden fan. I know he got a bunch of shit when he like was towards the end of his career, but he was nowhere near as bad as Dan Deerdorf was."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:11-06:27",
    "text" : "I just I used to have a very negative opinion of Madden and now watching the games again, he's so fucking good. He's so good. He's so good. Al Michaels kind of sucks with his like stoicism. Don't not a fan of that."
  },
  {
    "text" : "I just I I like that. I think it's more professionalism than anything, especially when he's when he's paired with a John Madden who's so like flamboyant and over the top, having that kind of like calming influence there I think is helpful. But he's like, say what you will about Al Michaels, but he actually called the intentional safety. Yes. Which are you fucking kidding me? This Name me one commentator today that you think would do that other than Tony Romo.",
    "timestamp" : "06:27-06:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:53-07:10",
    "text" : "Because like I knew it was coming and you're watching it and it was earlier than you'd think. There was what almost three minutes left in the game. Something like that, yeah. Yeah, it's like 251 left. Yeah. And you know, they're lining up the punt, and Al's like, I bet you take, you know, might might be smarter, take a safety here."
  },
  {
    "speaker" : "Andy",
    "text" : "Mm-hmm.",
    "timestamp" : "07:10-07:11"
  },
  {
    "speaker" : "Steve",
    "text" : "And I I thought because my recollection of this game was the commentators are shitting on them as well for taking the intentional safety. No. And like we proved the commentators wrong, but they actually They both called it and John's like asked that would actually be a great call.",
    "timestamp" : "07:11-07:25"
  },
  {
    "timestamp" : "07:25-07:44",
    "speaker" : "Andy",
    "text" : "Exactly, yeah. And then even like after that when they got the ball back. And the Patriots driving, John Madden's like, this is right right here is exactly where they should uh take a couple shots the end zone because they were down by three. Like uh go for the win and then settle for the field goal. And as soon as he said that, the Patriots threw a touchdown, which is the game winner."
  },
  {
    "speaker" : "Greg",
    "text" : "So let's let's describe the circumstances then, right? So people uh",
    "timestamp" : "07:46-07:49"
  },
  {
    "speaker" : "Andy",
    "text" : "understand why we might have some listeners who you know didn't watch at this point so or or just don't remember it right yeah Steve give me a recap of kind of how this game unfolded for me",
    "timestamp" : "07:49-08:00"
  },
  {
    "text" : "Uh Patriots. I mean, didn't Belichick just recap it for us? Didn't you want me to do it? You didn't let that clip go wrong enough, cause long enough, because he's like, yeah, actually we figured out in the second half, but yeah. Yeah. They played It wasn't actually like dog shit. It was just so sloppy.",
    "speaker" : "Steve",
    "timestamp" : "08:01-08:20"
  },
  {
    "speaker" : "Andy",
    "text" : "It was. So uh on their first on their second snap of the game Brady fumbles a snap and Denver recovers somehow. Even though the replay looked like Brady fell directly on it and tucked it underneath him. So I don't know how the hell he lost the football.",
    "timestamp" : "08:20-08:32"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:33-08:58",
    "text" : "Dude, they actually showed a replay of him like recovering it. Yeah. And Ron Madden was like, that's bullshit. He definitely has that. Yeah. How does how does how that came out? The sideline judge ran in like pointing the way. Like he could fucking see in the middle of the pile of X-ray vision Yeah. But it's even more important to note that like the Broncos didn't have Jake the snake. He had broken his foot cracking his toes."
  },
  {
    "timestamp" : "09:01-09:03",
    "speaker" : "Greg",
    "text" : "I have s I have some stuff on that."
  },
  {
    "text" : "Yeah, so the Broncos are like already like expected to lose a little bit because they're a starting quarterback. had broken his foot by taking his shoe off and cracking his toes.",
    "timestamp" : "09:03-09:13",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, as if you're cracking your knuckles. He did that with his toes. And somehow this time he apparently he's done it for like his entire life, but this time It broke his foot.",
    "timestamp" : "09:13-09:23"
  },
  {
    "speaker" : "Steve",
    "text" : "What she got, Greg?",
    "timestamp" : "09:24-09:25"
  },
  {
    "speaker" : "Greg",
    "text" : "Um, well, I don't know if we want to get into it now, but I just went uh looked up some funny injuries of pro athletes.",
    "timestamp" : "09:26-09:34"
  },
  {
    "speaker" : "Andy",
    "text" : "Well I they there's even the other one from uh from like another Broncos quarterback Brian Greasy.",
    "timestamp" : "09:35-09:42"
  },
  {
    "timestamp" : "09:42-09:43",
    "text" : "Yes",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Also hurt himself, uh, I think it was previous to that. I don't think he was on the team. It was previous. Hurt himself tripping over his dog to the point where he couldn't play football for a few weeks. But yeah, I mean great, this is probably as good a time as any. So like what other funny injuries did you come across in your Infamous deep dive.",
    "timestamp" : "09:43-10:05"
  },
  {
    "speaker" : "Greg",
    "text" : "Sure. So I mean some of the ones obviously we've heard of. There's like the infamous ones like Jason Pierre Paul. Right. Blows his hand over the firework, Plaxico Burris, Martin Grammatica celebrating an extra point and tearing his ACL.",
    "timestamp" : "10:06-10:21"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep.",
    "timestamp" : "10:21-10:21"
  },
  {
    "timestamp" : "10:22-10:38",
    "speaker" : "Greg",
    "text" : "Um there's some more obscure ones. Wait, there's an extra point. Wasn't even a field goal? Oh it might have been a field goal. Either way. Was it stupid or was it just unlucky? Okay."
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "10:39-10:39"
  },
  {
    "text" : "So unlucky I got uh Kendrick Morales from the Angels. Yep. He was uh he hit a walk-off grand slam and he and he was running around and you know how they crowd at home plate.",
    "speaker" : "Greg",
    "timestamp" : "10:40-10:51"
  },
  {
    "text" : "Yeah",
    "speaker" : "Bill Belichick",
    "timestamp" : "10:51-10:52"
  },
  {
    "timestamp" : "10:52-11:02",
    "text" : "He uh he does the jump up thing and then lands awkwardly on home plate, breaks his ankle and misses two years. Two years?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "11:05-11:06",
    "speaker" : "Andy",
    "text" : "I mean that's a way to go out though."
  },
  {
    "timestamp" : "11:07-11:39",
    "speaker" : "Greg",
    "text" : "I know that's so insane. If you retired it would have been awesome. Yeah. Damn. Um It's tough. Uh this one guy, this soccer player in England, Kirk Broadfoot, he uh he was he was trying to poach an egg and he was using the microwave. Where's this going? So he was poaching the egg in the microwave. He went to check on it and he opened the door and it exploded and like scalded his face."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "11:39-11:45",
    "text" : "Oh my god. He's like, I was putting this in for three minutes. What could possibly go wrong?"
  },
  {
    "speaker" : "Greg",
    "text" : "Holy shit. Um, that's kind of unfortunate. It's kind of stupid too. Yeah, it's on the line.",
    "timestamp" : "11:47-11:52"
  },
  {
    "timestamp" : "11:53-11:54",
    "text" : "It's definitely the line.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Sammy Sosa sneezed too hard and threw out his back. That's a pretty famous one. I remember that one Yeah. Um so let's talk about the stupid ones.",
    "timestamp" : "11:54-12:04",
    "speaker" : "Greg"
  },
  {
    "text" : "Yes, please.",
    "speaker" : "Andy",
    "timestamp" : "12:04-12:04"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh let's see. Tom Hodracourt. This was a uh baseball pitcher. He was trying to he had a lot he had a history of dislocated shoulders and he was Still trying to rip a phone book in half to impress his friends and then redislocated his shoulder",
    "timestamp" : "12:05-12:26"
  },
  {
    "text" : "I bet they were super impressed. Did he did he have the phone book in half or I don't know.",
    "timestamp" : "12:28-12:32",
    "speaker" : "Steve"
  },
  {
    "text" : "Unconfirmed. Yeah, if you have a history of shoulder injuries. That's not the way to impress your friends. And then uh my personal favorite, Brian Anderson from the Dime Backs, he was uh he was ironing a shirt. And instead of, you know, like spritzing water on it to see it hot, he put it to his face and then accidentally touched his face with it. And burnt his face.",
    "timestamp" : "12:32-13:01",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh my god. I'm noticing most of these are baseball players.",
    "timestamp" : "13:02-13:05",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, yeah.",
    "timestamp" : "13:05-13:06",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Jesus Christ. Wasn't there one uh there was some baseball player, maybe even someone local, who like dropped a kitchen knife and like sliced his toe and was out for ages too.",
    "timestamp" : "13:10-13:22"
  },
  {
    "timestamp" : "13:24-13:36",
    "speaker" : "Greg",
    "text" : "Yeah, there's all sorts of crazy ones. A guy like playing with a drone. There was a lot of like uh people getting tendonitis from like playing too much guitar hero or there was one guy that was too much Game Boy. It was like a guy from the 90s."
  },
  {
    "timestamp" : "13:36-13:40",
    "text" : "Holy shit. Ten and I've from Game Boy.",
    "speaker" : "Andy"
  },
  {
    "text" : "That's kind of impressive.",
    "speaker" : "Greg",
    "timestamp" : "13:40-13:40"
  },
  {
    "timestamp" : "13:41-13:53",
    "speaker" : "Steve",
    "text" : "Like stub their toe and break their foot. Yeah. I think a baseball pitcher did that, like their plant foot, like they just fucking kick their bed in the middle of the night. That's unlucky, I feel. Beautiful."
  },
  {
    "text" : "An unfortunate schmelting accident. Shadow Goldfinger. My vinky wasaki.",
    "timestamp" : "13:54-14:02",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "14:04-14:12",
    "text" : "Oh boy. Yeah, but to bring it back to the game, so with all these uh so they're on third string, right?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:12-14:22",
    "text" : "So injuries, yeah. Jake the snakes out and then Steve Berlin, the backups out too. So now you're on your third string quarterback. Danny Canal. Danny.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "14:23-14:27",
    "speaker" : "Andy",
    "text" : "Giants Hall of Famer, Danny Cannell. Wait, he's a Giants Hall of Famer? No."
  },
  {
    "text" : "Yeah, he wasn't bad. You know what?",
    "speaker" : "Steve",
    "timestamp" : "14:30-14:34"
  },
  {
    "timestamp" : "14:34-14:50",
    "text" : "Um watching. If you told me he was Jake Plummer, I would have believed you. Why Jake Plumber is good? I think Jake Plummer is underrated. I think every quarterback in this offense with um What's his name? Clinton Force?",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, Shanahan.",
    "timestamp" : "14:51-14:52",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, any Shanahan Broncos offense is just like A white quarterback who can uh throw really well off of rolling out on play action. It's all booting.",
    "speaker" : "Andy",
    "timestamp" : "14:52-15:03"
  },
  {
    "speaker" : "Steve",
    "text" : "Well hearing out. I was watching this game and I said This Broncos offense looks like the Patriots 2020 offense. Because they're running the three. Well like if you take Cam Newton plus some pages running backs this year, like those runs were as effective as Clinton Forrest by himself back in the day. And then everything else was bootlegs, like get him out of the pocket, show, throw for 10 yards, like easier completions, nothing down the field, no like, and then you contrasted it with Tom Brady in this game. whose only completions were like bombs. He was just throwing shots left and right.",
    "timestamp" : "15:03-15:44"
  },
  {
    "text" : "Yeah, exactly and I think it seemed as though that was the offensive game plan was like Because it coming into this game, we haven't seen that really this season. It's all been kind of your typical Brady short game, which makes sense because he's still playing with a What's what was the shoulder injury that he had? He had a separated shoulder. That's right. Yeah, he separated his shoulder at the end of last season. So now he's play he's still playing with that. But this game, like yeah, like you said, every Throw is 20 yards in the field.",
    "timestamp" : "15:45-16:13",
    "speaker" : "Andy"
  },
  {
    "text" : "Well like the Broncos didn't have a single deep shot. I can't remember a single deep shot from the Broncos",
    "speaker" : "Steve",
    "timestamp" : "16:13-16:18"
  },
  {
    "timestamp" : "16:18-16:21",
    "speaker" : "Andy",
    "text" : "They have one on the last play of the game that uh Asante Samuel picked up."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, sure. Their last Hail Mary was like the only time they even tried like getting the same pictures this year is like Yes, we can run the ball. We can sort of throw it intermediately, but we can't threaten the field deep. And like it was the same way with the Broncos because Clinton Portis was legit.",
    "timestamp" : "16:21-16:36"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "16:36-16:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That stretch running game from Shanahan was legit. And Shanahan knew like he had a quarterback who just like if I asked him to do too much, he's gonna fuck up. Right.",
    "timestamp" : "16:37-16:46"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:46-16:48",
    "text" : "So I have to card stringer for a reason."
  },
  {
    "text" : "Yeah, I have to I have to ha game plan around him to Solid run game, manage a game and don't make the big mistake. And honestly, Danny Cannell didn't make any big mistakes",
    "timestamp" : "16:48-17:00",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "17:00-17:15",
    "text" : "Well I mean that's cause he's uh your your typical wily veteran. They they made some comment in the game about how Uh like I don't remember which school he went to, but he was gonna become a doctor. Or decided to become a mediocre quarterback instead.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "17:15-17:26",
    "text" : "Bobby Bowden and uh his like parents were like the teen doctors for the Marlins and somebody else in Florida. Right, exactly. Yeah. So he not not."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "17:27-17:40",
    "text" : "He went to Florida State and then he went to the Giants, the Falcons, then he went to the Arena League. Yep. And then he played baseball for a while, played minor league baseball, and then this I think is his first year back in the NFL after the last year."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:40-17:43",
    "text" : "Something like that, yeah. They mentioned that he played baseball in arena football before."
  },
  {
    "timestamp" : "17:43-17:54",
    "speaker" : "Greg",
    "text" : "Yeah. So I mean he's only thirty though. He's not like he's like He really isn't he's really not like a wily vet. It's like his sixth year in the league. I mean he's been around though, and he's smart."
  },
  {
    "text" : "And yeah, I think he did poorly in this game. I think he did everything they could have asked him to do to win. And even Belichick said after the game, like, we just made one more play than they did. This game was Awesome start to finish. Let's throw a uh watchability out there because mine is for Super Bowl's an AC championship. This game is eminently watchable. It's entertaining the entire way through. John Madden is crushing it and it comes down to the last play.",
    "speaker" : "Steve",
    "timestamp" : "17:54-18:22"
  },
  {
    "text" : "Yeah, out of six, I'd give it a four and a half as well. That's probably where I'd be. Well it's one of the better regular season games.",
    "speaker" : "Andy",
    "timestamp" : "18:22-18:30"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "18:31-18:40",
    "text" : "I tried to watch it, but I didn't make it to the end. So I don't think I can really rate it because I think the most exciting part happens at the end."
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, it does. Yeah. But it was still like a good back and forth game all the way through too though.",
    "timestamp" : "18:40-18:45"
  },
  {
    "timestamp" : "18:46-18:54",
    "speaker" : "Steve",
    "text" : "Yeah, but there was no like yeah, there was a little bit of a lull like second quarter-ish where like no team could really get it going, but there's a ton of big plays."
  },
  {
    "timestamp" : "18:54-18:54",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:55-18:56",
    "text" : "Let's talk about those big plays.",
    "speaker" : "Steve"
  },
  {
    "text" : "I was just gonna say, yeah. So um first quarter each team Split uh touchdown. Clinton Porrys had a nice 15-yard touch a run off of the Brady fumble like a couple points later. Nice cut. Yeah, and then uh then Brady gets immediately picked off. Yes.",
    "speaker" : "Andy",
    "timestamp" : "18:56-19:17"
  },
  {
    "speaker" : "Steve",
    "text" : "We threw a double coverage deep on third and long. It was a wasn't the worst pick of all time.",
    "timestamp" : "19:18-19:22"
  },
  {
    "speaker" : "Andy",
    "text" : "It wasn't. Um but then Denver Uh Jason Elam, the longtime Denver kicker, ends up missing a 44-yard field goal, which in Denver is probably like a 34-yard field goal. But I think wasn't that when he Yes, I think that's a good thing.",
    "timestamp" : "19:23-19:38"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:52-19:54",
    "text" : "Old school Justin Tucker."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and and that kind of comes into play at the end. Um so but then out off of that missed field goal. Uh Brady, I think on the very next play, Antures with an absolute bomb, 67-yard bomb to uh Dion Branch on the first play, which reminded me a lot of The first play against the Steelers in the AFC Championship game. I think it might be this year. In the cold. It looks very similar to this.",
    "timestamp" : "19:54-20:24"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't remember that, but it will keep an eye out.",
    "timestamp" : "20:24-20:26"
  },
  {
    "text" : "Yeah. So remember I said this. Okay.",
    "timestamp" : "20:27-20:29",
    "speaker" : "Andy"
  },
  {
    "text" : "It's on tape, Andy, so we don't have to remember. We can just rewind it and listen. Right, yeah, because that'll happen.",
    "speaker" : "Steve",
    "timestamp" : "20:30-20:35"
  },
  {
    "timestamp" : "20:35-21:18",
    "text" : "That was it for the first quarter. Second quarter, Denver gets a field goal from Elam, a 43 yarder, so all he needed was an extra yard. In. And then Brady hits Givens deep and get inside the Denver 20, but have to settle for their own field goal. And then Denver kind of moves on a bunch of Patriot defensive penalties for the most part and put together the only touchdown drive of the second quarter. And there's 24 seconds left. Um and so Broncos are up 17 to 10 at this point. Look like they're gonna walk into the That was a good drive by them. It was, yeah. I mean most of the time.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:21-21:32",
    "speaker" : "Steve",
    "text" : "It was like a really long drive, 14 plays, like eight minutes, you know. That's what Shanahan was drawing up when he's sitting there waiting for this game, be like, hopefully Danny can give us these one of these long drives. Right."
  },
  {
    "text" : "But I think that's what uh That's what rankled Bill Belichick too was that drive because of the the penalties kept keep kept the defense on the field on third downs and stuff. And uh it ended with a touchdown pass to the fullback with 24 seconds left.",
    "timestamp" : "21:35-21:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "21:50-22:29",
    "text" : "Which was a great play design as well. So they've been so hard on play action and like Clinton Portis was awesome. And so they ran a they were on like the five or the four or whatever. And they ran a play action But instead of like the fullback blocking for the play action, he released in the play action and then Portis blocked the incoming defender, leaving that fullback wide, wide open. It was awesome. Nobody even wanted to cover him. Great play. But it was like forty seconds left, so I went to go switch to the second half because this YouTube video was like flipped into two. And I looked and I was like A little bit left in this game. Yep."
  },
  {
    "timestamp" : "22:30-22:42",
    "speaker" : "Andy",
    "text" : "There's actually 24 seconds left after that touchdown, but Bethel Johnson takes the ensuing kickoff. Uh sixty something yards, I think. Sixty-seven-ish yards. Yeah, I can't even take that to the house."
  },
  {
    "speaker" : "Mom",
    "timestamp" : "22:42-22:43",
    "text" : "He's three yards."
  },
  {
    "text" : "For how fast he was? I thought he would be I thought he was on like the When he got tackled, I was like, oh, he's on like the 13 yard line. And then I was like, oh, we're on the fucking 40. Yeah. Yeah, I was surprised how far. Well, you know, he's he was further. He did a bunch of moves. It was it was It was an awesome return. And he had one guy to beat and the guy got him.",
    "timestamp" : "22:43-23:01",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "23:02-23:04",
    "speaker" : "Andy",
    "text" : "Like by the shoestrings too. Yeah."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "23:04-23:04",
    "speaker" : "Steve"
  },
  {
    "text" : "Um so because of that, uh, the pages get to run one more play. Uh pick up eight yards and then they're able to squeak a Vinateri 46 yard field goal.",
    "timestamp" : "23:05-23:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Well how do they pick up those eight yards, Andy?",
    "timestamp" : "23:14-23:16"
  },
  {
    "timestamp" : "23:16-23:36",
    "speaker" : "Andy",
    "text" : "I don't have it written down, but my guess is uh team MVP Uh Kevin Falk? Yeah, buddy. Of course it is. Yeah. He actually eight yards. Hey, it was enough to to get Vinitarian field goal range. Troy Brown is clearly hurting in this game."
  },
  {
    "text" : "Troy Brown is definitely. Oh, let's make some excuses for our other MVP.",
    "timestamp" : "23:36-23:41",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, right? They talked about Troy Brown and they said he was doubtful a couple of days before the game.",
    "timestamp" : "23:44-23:50",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "23:50-23:54",
    "speaker" : "Andy",
    "text" : "Yeah, I think he was like a game time decision, but they just didn't have enough"
  },
  {
    "text" : "They said he was doubtful like three days before like someone going from doubtful three days before the game to playing in the game is incredible.",
    "timestamp" : "23:54-24:01",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "24:01-24:26",
    "speaker" : "Andy",
    "text" : "Yeah, not great. And if you want to wide receiver depth. Um Pretty much all the Patriots injuries in this game were two wide receivers. Troy Brown came back hurt, but was still out there returning punts in the fourth quarter. Which is which he wasn't he wasn't during the game, but as soon as like when they needed that pure hands and and like an actual return. Troy Brown."
  },
  {
    "speaker" : "Steve",
    "text" : "When they needed somebody to trot the fuck out there And not fuck up this punt. Like this of all the punts this game, you cannot fuck this one up. They put out Troy. And like, we can't put you out there because you're hurt, but I know you're hurt. Get out there. Receive this.",
    "timestamp" : "24:26-24:41"
  },
  {
    "timestamp" : "24:41-25:12",
    "speaker" : "Andy",
    "text" : "And he did and he did his job. And then Bethel Johnson of Kick Return Fame. I think he pulled a groin in the third quarter. He had that like he slipped on a on a return and like fucked his ankle up too. Something, yeah. And he went down like a few times where he had to get like helped off the field and then all of a sudden like, oh and Bethel Johnson's back. I'm like, really? 'Cause I didn't think he'd be back at all this season, but so he kept like going out for a while and coming back, but I think eventually went out for good. And then uh David Gibbons at one point was also being helped off the field."
  },
  {
    "text" : "So Beyond got helped off the field too. Everybody got help. Again, all the receivers got fucked up.",
    "timestamp" : "25:12-25:17",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:17-25:20",
    "text" : "Yep. All just like a walking wounded from that on the case."
  },
  {
    "speaker" : "Steve",
    "text" : "We'll get to Gibbons. We will get to Gibbons.",
    "timestamp" : "25:20-25:22"
  },
  {
    "speaker" : "Andy",
    "text" : "We will. So second half starts. Um let's see. The Patriots actually start putting some drives together. They're starting to figure out this Denver defense, who I think was one of the the number two defense in the league, according to the commentators. Yeah, but they're all no names. Well, they're also decimated by injuries, the the Broncos in general. Still. They had Delta O'Neal bench.",
    "timestamp" : "25:23-25:51"
  },
  {
    "text" : "Yeah, they did. They're starting like these. There's a lot of again. I mean, you look at it from their perspective of history of like, but like Al Wilson, I think, is the only dude I recognized on that defense.",
    "speaker" : "Steve",
    "timestamp" : "25:52-26:05"
  },
  {
    "text" : "Really?",
    "speaker" : "Greg",
    "timestamp" : "26:05-26:06"
  },
  {
    "text" : "Trevor Price. John Mobley. Mobley wasn't playing. Yeah. Delta O'Neill. He wasn't playing either. He wasn't starting. He was he was the like the third down. Yeah. He was like not even, he was like relegated to like nickelback, maybe.",
    "timestamp" : "26:07-26:22",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:23-26:23",
    "text" : "Yeah."
  },
  {
    "timestamp" : "26:23-26:25",
    "speaker" : "Steve",
    "text" : "And punt returner, which we'll get to."
  },
  {
    "timestamp" : "26:26-26:30",
    "speaker" : "Greg",
    "text" : "Yeah, he he didn't he didn't play well in this game at all, except for that fucking touchdown."
  },
  {
    "speaker" : "Steve",
    "text" : "No, he also fucked it up on the fucking free kick.",
    "timestamp" : "26:30-26:34"
  },
  {
    "timestamp" : "26:34-26:38",
    "text" : "Yeah, way to ruin that though. Yeah, we'll get there. Just killing that flow. Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "But well, let's go play by play till we get there, shall we?",
    "timestamp" : "26:39-26:41"
  },
  {
    "text" : "Okay. Yeah, let's let's do it. Okay. We're going score by score, because that's how we do on this podcast. Uh-huh. It's a third quarter. Page is starting to move the ball. Uh Brady throws a beautiful. I think this I I don't think it is, but I want it to be true that um This was off of a hard bootleg play action. Brady rolls out and throws a touchdown to Daniel Graham. And it felt like a fuck you to the Broncos who have been doing it all night on offense. Yes. We can do it too. We'll throw a touchdown. Because that was the only time they did it that I remember.",
    "timestamp" : "26:41-27:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "The well the the Broncos did it pretty successfully a couple of times. Where like they established the run. And then ran that naked bootleg off of it. Right. And ran some guys there. And it worked like twice. And then Romeo was like, nah, you know. And then it didn't work the rest of the game. It's kind of crazy. You could actually see the adjustments. You could see that like Shanahan and Belichick were like going toe to toe almost. Oh absolutely. Both teams are so injured and like they're making do with what they got. The Patriots defense is decimated and Yeah, there was a lot of parallel.",
    "timestamp" : "27:14-27:51"
  },
  {
    "text" : "And then also um came right back. Elam went down. So now their punter is kicking field goals, which meant um Danny Canal is also now the holder on field goals because the puncher was the holder, but now he's kicking, so they needed so like this happened.",
    "timestamp" : "28:00-28:16",
    "speaker" : "Andy"
  },
  {
    "text" : "If Ewam hadn't gotten hurt, we wouldn't have won this game because",
    "timestamp" : "28:18-28:21",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "But uh to go back to what Greg was talking about, um Denver after Brady's touchdown, Denver goes nowhere and punts. And then Branch was back there returning the punt and he fumbled it. Um but the and the the Broncos recovered, but it got overturned and I watched it.",
    "timestamp" : "28:28-28:47"
  },
  {
    "speaker" : "Steve",
    "text" : "That was a ground cloud fumble. It looked it was pretty clear.",
    "timestamp" : "28:48-28:51"
  },
  {
    "timestamp" : "28:50-29:17",
    "speaker" : "Andy",
    "text" : "Yeah, I think the ground causes fumble. So the Pagers got it at their own 18, uh, but it wasn't like it wasn't a good punt return or anything. And so they go three and out and punt it to the Broncos, but it gets called back for holding on the Patriots. So they have to punt it again. And this is where Greg was talking about uh your boy Delta. Takes a punt return basically right up the middle for a touchdown."
  },
  {
    "speaker" : "Steve",
    "text" : "That was a sweet punt return. He he gave a bunch of people the whoop, you know. It was not it was not the blocking, it was definitely Delta O'Neal. Yeah, he did a lot of that. But like that's such a classic Belichick call too of like",
    "timestamp" : "29:17-29:32"
  },
  {
    "speaker" : "Andy",
    "text" : "And I think in the the the post game he said like that's why we make him do it because They just ran all the way down there again. Now like there's a a better chance for them making a mistake the second time.",
    "timestamp" : "29:36-29:45"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:45-29:52",
    "text" : "Just like the uh Steelers 2001 AFC Championship game where they made him punch it again and Troy Brown took it to the house."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:52-30:00",
    "text" : "Exactly. Exactly the same thing. Just again see this time. So now we're into the fourth quarter. The Broncos have a 24-20 lead."
  },
  {
    "timestamp" : "30:00-30:21",
    "speaker" : "Steve",
    "text" : "Wait, before we move on Um did you catch that thing in Belchek's postgame? Which thing? Where they asked him about the intentional safety. And he's like, yeah, we did that in 2000. Like, yeah, it comes up every couple of years. Really? Against the Broncos."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:22-30:23",
    "text" : "No."
  },
  {
    "timestamp" : "30:23-31:08",
    "speaker" : "Steve",
    "text" : "And he's like, it didn't work out for us because Delta O'Neill took it to the house. Really? I looked it up and there's an there's a prime time highlight on this, and they don't show the intentional safety. But the pages took an intentional safety against the Broncos in 2000. The free kick to Delta O'Neill. And he has a very, very similar return to straight up the gut for a touchdown. So they free kick it and Delpha Neal takes it to the house. Wow. And then they decided to do it again. So there was like a quarter. Oh, we'll give up two points, then they give up seven more. Like, oh well, well that was a nine point swing. What the fuck? Yeah, fuck it. Oh, I did I missed that. It was the same player too. That's crazy. So like he already seen Delta O'Neal return one on him."
  },
  {
    "text" : "Yeah. But it's funny because they were talking about how Delta O'Neal was in the doghouse. With Shanahan for, I don't know, probably bad uh coverage, I guess. Yeah, they didn't say um but then he had that punt return for a touchdown. It's like, oh maybe that'll bring him out of the doghouse. Um spoiler, it doesn't.",
    "timestamp" : "31:08-31:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Um uh I mean You know, Al was like, oh yeah, he returns a re punt and return touchdown. Cool. Yeah, I was like, come on, Al, get excited, buddy.",
    "timestamp" : "31:30-31:39"
  },
  {
    "text" : "I'm okay with Al. He's fine. Um but yeah so at the end of the that third quarter, fourth quarter, the patrons are driving, end up settling for another field goal from you know it the Page's drove inside the 10. Uh can't finish drives in this, probably because they don't have anybody left on offense. Um But Denver is now starting to run the ball well. I think Clinton Porters had over 100 yards in this game, which is so far this season only the second player to run for a hundred yard the only second hundred yard rushing game versus Pats. Uh Miami was the other with um What's his face?",
    "timestamp" : "31:40-32:19",
    "speaker" : "Andy"
  },
  {
    "text" : "Well that zone blocking from the Broncos was revolutionary in this era. You know, they were the only team running that scheme of like lighter offensive linemen and they just block the zone and push everybody that way. Yeah. Which created gaps for the the one cut and go.",
    "timestamp" : "32:19-32:37",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "32:38-32:38",
    "text" : "Exactly.",
    "speaker" : "Andy"
  },
  {
    "text" : "And also the cutbacks and the bootlegs off of it. And I mean those Shane Hale is a great coach. I think that was clear in this game for sure. He could de he could definitely run the ball. They were even close with a third string quarterback and this is like a fucking hard fought game and we're the eventual Super Bowl champions. I mean speaks a lot to that",
    "speaker" : "Steve",
    "timestamp" : "32:38-33:00"
  },
  {
    "timestamp" : "33:00-33:02",
    "text" : "What were you gonna say, Jay?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:02-33:07",
    "speaker" : "Greg",
    "text" : "Well, did you hear Portis talking about that? Where he's like, I'm not that type of back."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "33:07-33:07"
  },
  {
    "text" : "Yeah. And he's like, fuck that. I'm not gonna do it just because they tell me to.",
    "speaker" : "Greg",
    "timestamp" : "33:08-33:12"
  },
  {
    "speaker" : "Steve",
    "text" : "They had a whole interview of him just being like, Yeah, I've like a six million coaches now, just like, nah, fuck it.",
    "timestamp" : "33:12-33:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Like, yeah, my running back coach tell me you something and then like The offensive line coach tell me something else and then the head coach, so I just do whatever the fuck I want.",
    "timestamp" : "33:21-33:28"
  },
  {
    "text" : "There's definitely some truth to that.",
    "speaker" : "Greg",
    "timestamp" : "33:31-33:32"
  },
  {
    "speaker" : "Steve",
    "text" : "For sure, but like don't go on Monday Night Football camera and say that. She could be Why not?",
    "timestamp" : "33:32-33:37"
  },
  {
    "timestamp" : "33:42-33:44",
    "speaker" : "Greg",
    "text" : "I mean pretty fucking good career."
  },
  {
    "text" : "Yeah, it worked. I mean how many yards do you have to do? Wait, wait, what would you rather have, Greg? Chant Bailey or Clinton Portis?",
    "speaker" : "Steve",
    "timestamp" : "33:44-33:49"
  },
  {
    "timestamp" : "33:50-33:57",
    "speaker" : "Greg",
    "text" : "Yeah, I mean we already talked about this, but I mean he had a good career. In 2003 he's a good running back."
  },
  {
    "speaker" : "Steve",
    "text" : "I'm not saying it's bad. I mean I think it's great, but like I don't know.",
    "timestamp" : "33:58-34:01"
  },
  {
    "text" : "I mean that's a real that's a real thing of like when you're getting coached in like a lot of different ways, like that once you like you have to be instinctive as a player of like",
    "timestamp" : "34:01-34:11",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mom",
    "text" : "Trust what trust, yeah.",
    "timestamp" : "34:11-34:12"
  },
  {
    "timestamp" : "34:13-34:24",
    "text" : "I think running back more than anything where you have to like trust your skill set and just fucking play to your strengths. Whereas like All these coaches you telling all this shit, you start thinking about it and then you and then you end up sucking.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "No, you overthink it.",
    "timestamp" : "34:24-34:26"
  },
  {
    "timestamp" : "34:26-34:39",
    "speaker" : "Andy",
    "text" : "Uh this this year in 2003 with Denver. He ran for 1,591 yards and 14 touchdowns. It's the most yards he would run for in a season. He averaged 5."
  },
  {
    "text" : "5 yards a carry.",
    "timestamp" : "34:39-34:40",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh the year after.",
    "timestamp" : "34:42-34:43"
  },
  {
    "text" : "Yeah, that's what I'm saying. Like the Reds, the Broncos sold high on him and got Chant Bailey, who was awesome for like a decade. Right.",
    "speaker" : "Steve",
    "timestamp" : "34:43-34:53"
  },
  {
    "timestamp" : "34:53-34:59",
    "text" : "I mean he had four thousand yard seasons out of five after getting traded. True.",
    "speaker" : "Greg"
  },
  {
    "text" : "But like Champ Bailey was a few years ago.",
    "speaker" : "Steve",
    "timestamp" : "34:59-35:00"
  },
  {
    "timestamp" : "35:01-35:05",
    "speaker" : "Andy",
    "text" : "The lowest one of those was twelve hundred yards. It wasn't even like barely breaking it though."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:05-35:10",
    "text" : "But Champ Bailey was Epically good at a more imposition."
  },
  {
    "speaker" : "Andy",
    "text" : "You're not wrong. All right. Um so yeah, so he's starting to move the ball in the fourth quarter. Uh Denver drives to the New England 34, and this is what you're talking about, Steve. Instead of going for a long field goal, you know, what's that 34 plus 17 is what almost 50 yard field goal give or take.",
    "timestamp" : "35:11-35:31"
  },
  {
    "timestamp" : "35:31-36:07",
    "speaker" : "Steve",
    "text" : "It was it was worse than that though. It was like fourth and three and they have Clinton Ports, who we just talked about, was a beast and like averaging like four point three yards per carry in this game. And then sitting looking at fourth and three and at the the thirty three and being like, let's punt it. Like and Those decisions in this day's in the game are just like, are you fucking kidding me? You know? Like they're the game now is so much more aggressive of like Once you're inside the 40, you're either going for it or you're kicking the field goal or you're getting a touchdown. You don't punt inside the 40."
  },
  {
    "text" : "Yeah, this felt like the the very uh I don't know if Belichick started or war. He he just because we're Patriots fans, that's where we learn it from. But that kind of like gray zone of like it's too close to punt, but it's too far for a field goal, so we're just gonna fucking go for it because even if we don't get it. Like punting it would only nut us an extra twenty yards anyway.",
    "speaker" : "Andy",
    "timestamp" : "36:07-36:26"
  },
  {
    "speaker" : "Steve",
    "text" : "It was a punt that had like thirteen yards.",
    "timestamp" : "36:26-36:29"
  },
  {
    "timestamp" : "36:29-36:39",
    "speaker" : "Andy",
    "text" : "There's this punt, right? Well this yeah, this this punt. The problem with this is They punt it from the 34 and it was a touchback, so it was like a 14 net 14-yard punt. I I have a note here."
  },
  {
    "timestamp" : "36:39-36:59",
    "speaker" : "Steve",
    "text" : "You can see it's fourth and three. They run the punt team on and then they cut to Belichick and he's like, what? He was legit confused that they were punting. But really? Yeah, exactly. We have a great running back. We can get these three yards. Like just line up and stop us. Like if you stop us, great. If you don't"
  },
  {
    "timestamp" : "36:59-37:05",
    "speaker" : "Andy",
    "text" : "A running back who up games averaging four point two yards a carry and on the season five point five yards a carry."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, but Belichick did it earlier in the game though.",
    "timestamp" : "37:05-37:07"
  },
  {
    "speaker" : "Steve",
    "text" : "Punting from the 30.",
    "timestamp" : "37:08-37:09"
  },
  {
    "timestamp" : "37:09-37:25",
    "speaker" : "Greg",
    "text" : "Short punt he did. Yeah, he had they were on the Denver 40, losing seventeen to thirteen in the third quarter. And he punted it was a net gain of 20 yards. So I don't think I don't think Belichick's much better."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:25-37:45",
    "text" : "What was our run rushing attack this game? It was fucking non-existent. And what was a down and distance at that time? It was like third and eight on from the 40 is totally different than fourth and three from the fucking 32. When you have Clinton Portis who's averaging four yards per tote in this game."
  },
  {
    "timestamp" : "37:45-37:48",
    "speaker" : "Greg",
    "text" : "Yeah, but Belichick's decision is just as bad statistically."
  },
  {
    "speaker" : "Andy",
    "text" : "That was like the first drive of the the half though, wasn't it?",
    "timestamp" : "37:49-37:52"
  },
  {
    "timestamp" : "37:52-38:14",
    "text" : "Tells them all, dude. Like if Beltek had a running game that makes it the entire you know, the down and distance makes all the difference. If you I really don't think so. The Patriots this year are a great example. T Like the at least the Patriots offense this year would would be aggressive in that situation. Like it's fourth and three. You're on the thirty-five. We're not kicking the field goal. We're gonna go for it with Cam Newton like Cam D.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I think the Patriots are behind the times on this. I think there's other coaches that got ahead of this way quicker than Belichick did.",
    "timestamp" : "38:14-38:21"
  },
  {
    "timestamp" : "38:21-38:23",
    "speaker" : "Andy",
    "text" : "I think there's a lot of analytics behind it now."
  },
  {
    "timestamp" : "38:23-38:23",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "38:24-38:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "And Belichick's not a big analytics guy.",
    "timestamp" : "38:24-38:26"
  },
  {
    "text" : "Right.",
    "timestamp" : "38:27-38:27",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Like Riverboat Ron is the first one that comes to mind that was like, okay, this guy is like setting the precedent for being super aggressive.",
    "timestamp" : "38:27-38:36"
  },
  {
    "timestamp" : "38:36-38:40",
    "speaker" : "Andy",
    "text" : "I would say, yeah, that's probably true. Uh we saw John Harbaugh."
  },
  {
    "timestamp" : "38:40-38:59",
    "speaker" : "Steve",
    "text" : "Yeah, Peterson and then jumping. Yeah. I think so. I don't want to get too far into it, but like you know, the Seattle Super Bowl was the perfect example of that of like What did the analytics say? Yeah. And what about not taking the timeout and putting pressure into the coach?"
  },
  {
    "timestamp" : "38:59-39:07",
    "text" : "I still think that was a terrible decision. But it worked out. Yeah, it worked out in hindsight, but I don't think that's the right call.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Like they're not the thing. That's the thing. You might not think it's the right car looking back, but like even in this game when the Patriots are backed up and like there's three minutes left and I was like they should probably punt this out. That was my initial thought when as soon as like they hit that and I was like, oh this is where they this is where they do the safety. And like I didn't it wasn't my like rational thought to be like let's take safety here and like Play that game.",
    "timestamp" : "39:08-39:33"
  },
  {
    "text" : "Right, and not only that, but uh on Denver's next drive too Uh they made some strange decisions where they were running well again. I mean they're just they're running for four yards a carry. Easy.",
    "timestamp" : "39:34-39:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Richard Seymour is out, by the way.",
    "timestamp" : "39:46-39:48"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:48-39:51",
    "text" : "Yeah, he he was a late scratch in this game, so he just didn't even play."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "39:51-39:54",
    "text" : "So I mean it it showed so much."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, there was huge gaping holes in the run game. Um But you know, Denver's running well. I wrote Denver running well again, so of course they start throwing the ball. uh once they cross midfield and from there that like once they cross the midfield they basically go three and out um they end up at the New England 35 and punt from there again. So that's twice. But this time they down the ball at the one. Yeah.",
    "timestamp" : "39:54-40:22"
  },
  {
    "speaker" : "Steve",
    "text" : "Instead of the 31, not the 35.",
    "timestamp" : "40:22-40:25"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. And uh the pages go three and out. Did not look good.",
    "timestamp" : "40:26-40:31"
  },
  {
    "timestamp" : "40:32-41:09",
    "text" : "But before we get there, Madden when they get the ball in the one yard line goes, I'm a believer they can score. I pronounce everything. They can definitely drive this down the field and score and win this game. I re- He did that throughout this year, but like, I don't know. I fucking I used like I had a perception of hating Madden because of that Super Bowl. But like going back and re-watching these games, he's awesome. He is. He's great. He's so awesome. I love him. And he's just like tongue-in-cheek, just I don't know. He's he's the best.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "41:10-41:24",
    "speaker" : "Andy",
    "text" : "I'm a big fan of him. I always thought him as just like a bumbling grandfather who just like didn't really know what he was talking about and just like Currently the team that scores the most points wins the game was like drawing a whole bunch of shit on the screen with the uh The telestrator."
  },
  {
    "text" : "Well there's one there's one thing in this game where he said something and uh Al Maga sort of called him out at it and he just like double dabbed said yes then realized as soon as he said yes He was being an idiot laughing, just kept going. It was the best.",
    "timestamp" : "41:25-41:42",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "41:42-41:49",
    "text" : "Yep, big fan of John Madd on this. So uh this I know what it was.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "It was like something about an orchestra. And uh Al Michaels was like, they were talking about oh yeah. Monday night on the mic. Yes. It was like, I guess, the voice or like all those singing shows way before they were like a",
    "timestamp" : "41:49-42:06"
  },
  {
    "speaker" : "Andy",
    "text" : "thing but with players players yeah that was weird I saw that too and I I tried to Google it nothing came up really there's nothing out there on it that's does any of our listeners know what the hell this is",
    "timestamp" : "42:06-42:19"
  },
  {
    "speaker" : "Greg",
    "text" : "Like it's like a karaoke thing, but they're saying some of them play it was like uh Kyle Turley was one of them. Yeah. Which I would I would love to see video footage of him like singing some sort of",
    "timestamp" : "42:19-42:33"
  },
  {
    "timestamp" : "42:33-42:40",
    "speaker" : "Andy",
    "text" : "Fucking karaoke the voice American Idol shit. But it's like that I think they had like other people with them, it sounded like."
  },
  {
    "timestamp" : "42:40-42:52",
    "text" : "So because John Madden would say something where It was a contest where like certain people would advance each week and then you'd vote and those people so it was like, whatever, America American Idol American Idol American Idol is American Idol.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "42:53-43:02",
    "speaker" : "Andy",
    "text" : "Right. But it he's his thing was like, uh, it seems that if the player is the one playing the instrument and they have somebody else singing, they're most likely to win the matchup."
  },
  {
    "text" : "Yes. He's like, well he's like, if you play if you have an instrument as well, you're always gonna beat the dude with the voice. And Al Michaels was like, what about if they're playing the kazoo? And he's like, yes. And then he's like, uh and then he's like went right into like the commentary of the He realized that he what he just agreed to and like Forcefully agreed to was absolute bullshit.",
    "speaker" : "Steve",
    "timestamp" : "43:03-43:28"
  },
  {
    "timestamp" : "43:29-43:31",
    "speaker" : "Andy",
    "text" : "And then just like kept dogged like fucking games."
  },
  {
    "speaker" : "Steve",
    "text" : "I loved it And then the where they had the little kid on the TV, you know, they had like a fucking one or two year old. Oh man, Madden love that kid. And he's like, oh man, he has no idea what's going on right now. I was like, I was thinking that same thing. That little kid is like, what is this? Why am I on TV? And imagine that I'm going to be able to do that. Oh.",
    "timestamp" : "43:33-43:57"
  },
  {
    "text" : "Beautiful.",
    "timestamp" : "43:57-43:58",
    "speaker" : "Andy"
  },
  {
    "text" : "Well, can we talk about barrel manual quick too?",
    "speaker" : "Steve",
    "timestamp" : "43:58-44:01"
  },
  {
    "timestamp" : "44:01-44:12",
    "speaker" : "Andy",
    "text" : "I mean, you don't want to talk about the intentional safety, the whole reason we're here right now. Barrel man? No, the fucking intentional safety. You don't want to talk about that? Literally the next thing up?"
  },
  {
    "speaker" : "Steve",
    "text" : "No, I want to talk about barrel man. Talk to me about barrel man They cut to like this old ass dude signing autographs in the middle of the stadium. Yeah. He looked like I think he's in a wheelchair or something like that. And like, oh, great to see Barrel Man here. And John Madden loved him. He's like, I love Belvin. He's the best. He's like the best person of all time. And I was like, who the fuck is Barrel Man? Wikipedia is this dude he's been going to Broncos games since 1971. Yeah. To like 19. Or 2003 or something, and he missed like three games total.",
    "timestamp" : "44:12-44:58"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "44:58-44:59"
  },
  {
    "timestamp" : "44:59-45:23",
    "speaker" : "Steve",
    "text" : "And his brother bet him. That you couldn't get on TV at the Broncos game. Ten bucks. Ten bucks. So he shows up in like a wooden like whiskey barrel, suspenders. Paints in orange like the soda, I guess, the time orange crust. Cowboy hat, cowboy boots, gets on TV"
  },
  {
    "timestamp" : "45:23-45:32",
    "text" : "Yeah, because at the time uh the nickname for the defense was Orange Crush. So he wore an Orange Crush can.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:32-45:41",
    "speaker" : "Steve",
    "text" : "Well it was like a barrel and orange crush can and then he did the same fucking outfit for like 40 years."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:42-45:43",
    "text" : "For a long fucking time."
  },
  {
    "text" : "Dude, do you know how many cold ass games have been in Denver in that time? He's going to every game. And like at that point, you're the barrel man. You can't not wear a barrel, you know? Yep.",
    "timestamp" : "45:43-45:54",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:55-45:57",
    "text" : "Yeah, he he first wore a barrel in 1977."
  },
  {
    "text" : "And he stopped in like two thousand like right before this, I think.",
    "speaker" : "Steve",
    "timestamp" : "45:59-46:02"
  },
  {
    "timestamp" : "46:03-46:26",
    "text" : "He retired m McCern McKernan retired his act after the 2007 season at the age of 67. Uh because he well he showed up to games da da where is it? The dude has serious health issues in 2003. And uh after that time, he was restricted by doctors to wearing his barrel for one half of play, and then only when the temperature was above freezing.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:26-46:57",
    "text" : "Imagine the doctor prescribing that Right. You can only wear this barrel the Broncos games one half a game when it's above freezing. The dude has a legit statue Here's a statue. In front of Bronco Stadium, yes. There's a barrel man statue. Wow, they do. Yes. And like this guy is there's like a Bud Light koozie with like the suspenders on it. This guy's a absolute fucking legend.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "46:57-47:15",
    "text" : "Well apparently uh he would spend his off season with his wife uh traveling in their RV. So according to Wikipedia, due to the space constraints of living in an RV, McKernan sold his Super Bowl 32 barrel for $30,000",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "47:17-47:44",
    "text" : "It had everybody's signature on all the players signed it. Yeah. Dude, what a fucking uh centerpiece. If you're a Broncos fan. Hey, welcome to my home. Here's Barrel Man's Barrel with everybody's Super Bowl winning signatures on it. Right? As you do, I guess. That's just that bad. I I mean I don't know if there's so much of that these days and age, you know? Yeah. Bill's mafia is like a conglomerate where like"
  },
  {
    "speaker" : "Andy",
    "text" : "Barrel Man is Yeah, I mean the only thing you have now is Fireman Ed, but he's kind of a tool.",
    "timestamp" : "47:45-47:50"
  },
  {
    "timestamp" : "47:50-48:03",
    "text" : "He's the worst. Yeah. The absolute worst dude. If we're rigging a continuum, barrelman's on the left and Fireman Ed is on the exact opposite of like douchebag, everybody hates him.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "48:03-48:07",
    "speaker" : "Andy",
    "text" : "Yeah. I mean there was the Hoggettes for a while. Those guys are great."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "48:07-48:11",
    "text" : "I don't think they're so good. I don't know if everybody hates Fire Maneta. I think it might just be Patriots fans."
  },
  {
    "speaker" : "Steve",
    "text" : "I think you're like, I don't hate the barrel man. No, I think he's showing up in a bare division rival.",
    "timestamp" : "48:12-48:19"
  },
  {
    "speaker" : "Greg",
    "text" : "But we hate him because he's a Jets fan.",
    "timestamp" : "48:20-48:26"
  },
  {
    "text" : "But no, but didn't he go through something where he like He stopped going to Jets games and then like tried to make them like pay him to come back or some bullshit like that. I don't know.",
    "speaker" : "Andy",
    "timestamp" : "48:26-48:36"
  },
  {
    "text" : "He's like the Marlins guy, you know? Like they they're both like they seem more More focused on themselves. Yes. Where barrel man just loved the Broncos. Wearing a barrel because it helps a team win. Yeah, you know. He's been wearing the Broncos because he's wearing the barrel because his brother bet him ten bucks in 1977. That I mean this is So he's in it for the money? No, he's in for the he's he's gritty. He's missed three games his entire fucking life.",
    "speaker" : "Steve",
    "timestamp" : "48:36-49:06"
  },
  {
    "timestamp" : "49:06-49:15",
    "speaker" : "Andy",
    "text" : "I th I think Greg needs to be the next uh Patriot Sparrow guy. I think he needs to be uh chicken wing hat guy. I'm just going to every Patscape."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "49:19-49:26",
    "text" : "Do you still have that? Yeah, I still got it. All right. I'm not going to games though, because we're not winning 13 games a season."
  },
  {
    "timestamp" : "49:26-49:29",
    "text" : "So uh it's 12 that we averaged.",
    "speaker" : "Steve"
  },
  {
    "text" : "Why would I why would I buy tickets if we're not? perennial favorites because they're cheap.",
    "timestamp" : "49:29-49:38",
    "speaker" : "Greg"
  },
  {
    "text" : "All right, you sold me on barrel, man. Initially I had written down that he was uh the fireman ed of the Broncos, but that's not true.",
    "timestamp" : "49:38-49:46",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "49:46-49:56",
    "speaker" : "Steve",
    "text" : "Don't slander him like that. Dude, like the Jets aren't gonna build a fucking statue to fireman ed. Well they might what else what else they have to celebrate?"
  },
  {
    "timestamp" : "49:56-50:11",
    "text" : "He's like the Bobby Orr of fucking the Broncos. I mean John Elway probably is, but okay. Sure. The Bobby over the Broncos, Jesus Christ. I'm hard on Barrel Man.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, no, we can see your fucker you mark hard apparently.",
    "timestamp" : "50:12-50:15",
    "speaker" : "Mom"
  },
  {
    "timestamp" : "50:15-50:17",
    "text" : "Yeah, I love it. I love that guy. Jesus.",
    "speaker" : "Andy"
  },
  {
    "text" : "RIP. Like someone needs to take a fucking ice bath over there. Relax.",
    "speaker" : "Greg",
    "timestamp" : "50:18-50:23"
  },
  {
    "text" : "Uh you know who else is about him? John Madden. John Madden also loved him",
    "speaker" : "Steve",
    "timestamp" : "50:25-50:29"
  },
  {
    "text" : "Oh yeah.",
    "speaker" : "Greg",
    "timestamp" : "50:29-50:30"
  },
  {
    "timestamp" : "50:30-50:55",
    "speaker" : "Andy",
    "text" : "Oh you've you've mentioned that. You know what else John Madden loved? When the pages took an intentional safety. And uh I think they asked Belichick about this in the the postgame show They're like uh so you practice that and he's like No, we just tell the s the the the long snapper just chuck it as far as he can over the punters' heads. He's like he doesn't need to practice that he does that I he does that by accident sometimes."
  },
  {
    "speaker" : "Steve",
    "text" : "That was a ridiculous question. We'd have to practice him not doing that. He's like we've we've we've practiced it and like I think he meant like we talked about it like wait this these situations we take an intentional safety and like did we practice a play? He's like He just fucking snap, he just as a long time will snap the fuck out of the ball. He just throws it as far as he can over the punch's head. But I think low-key Um Lonnie Paxson hitting the upright was a key part of this game. Because like that's what Also super memorable. Not only did they hit the safety, but you hit the thing and it bounced back in.",
    "timestamp" : "50:55-51:30"
  },
  {
    "timestamp" : "51:30-51:32",
    "speaker" : "Andy",
    "text" : "Yeah, hit the upright and came straight back down."
  },
  {
    "text" : "Beautiful. And uh also kind of constant on the field. People like, oh what the fuck?",
    "timestamp" : "51:32-51:37",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "51:37-51:53",
    "speaker" : "Andy",
    "text" : "Yeah, Ken Walter Ken Walter freaked the fuck out. He's like, no, that the play is dead, right? The play is dead. He didn't know like if he should go jump on the football or like what to do. Yeah Yeah. Cause I cause they were talking about the the comments were talking about usually you snap it to the the punter and he just catches it and steps out the back of the end zone."
  },
  {
    "speaker" : "Steve",
    "text" : "But I'll double check this and just see you later.",
    "timestamp" : "51:54-51:57"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, no, that's that's all that's a whole extra step that could get fucked up. If he drops it and you know it's touched it, no.",
    "timestamp" : "51:57-52:02"
  },
  {
    "timestamp" : "52:02-52:17",
    "speaker" : "Steve",
    "text" : "Well we're looking at the goalpost is technically considered out of bounds, right? Even though it's in the field of play, it's technically considered out of bounds, blah blah blah. Imagine if they hadn't had that, then that would have been like a fucking touchdown Broncos or whatever."
  },
  {
    "timestamp" : "52:17-52:19",
    "speaker" : "Andy",
    "text" : "It would have been a scrum, that's for sure. Yeah."
  },
  {
    "text" : "Um but yeah, so then uh this back to Delt O'Neill who Well you want to describe the the s the circumstances of this? Because it's really uh about as opportune as a time as you can get to do this, right?",
    "timestamp" : "52:20-52:34",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "52:34-52:34"
  },
  {
    "text" : "Two-point game. So it's twenty s 24-23. Yeah, twenty-four-twenty-three. Three minutes left. You're on your one yard line, right? So if you punt it away, they're probably gonna get the ball at like the 40th, 40, or like midside your head. We'll call it, right? And the alternative is you you're basically saying we'll have to kick a field goal to tie and then take our chances in overtime, right? Yep. You're you're hoping for a three and out either way. If you punt it, you're getting a three and out, you get the ball back probably around your own ten yard line, anyways.",
    "speaker" : "Greg",
    "timestamp" : "52:36-53:15"
  },
  {
    "text" : "Right.",
    "timestamp" : "53:15-53:16",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "You still gotta get a field goal and a touchdown wins it. So If you if you take the safety, you're basically gaining what like 40 yards of uh Yeah as long as you trust your defense you should be gaining about 40 yards. So either way you need a three and out. Yep. So there's probably not a better time to make this call. Yeah, there's really no other time to make this call.",
    "timestamp" : "53:16-53:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Like this is kind of the only time it comes up.",
    "timestamp" : "53:43-53:44"
  },
  {
    "timestamp" : "53:47-53:55",
    "speaker" : "Greg",
    "text" : "I I can't remember another time where I've been like, ooh, this is a decision. Should they take a safety? Right. Really it's just like almost never comes into no play."
  },
  {
    "speaker" : "Steve",
    "text" : "And they asked him about that in the postgame and he's like, well, this shit happens every so often. We did it in 2000. But brushed off like yeah it comes every couple years and like I haven't found it since since yeah I mean at the time yes it had happened every couple years because this is 2003 and it happened in 2000.",
    "timestamp" : "53:55-54:13"
  },
  {
    "timestamp" : "54:13-54:16",
    "text" : "So like yeah every few years it happens. And then it just never happens again.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. But that one they're up twenty-one three in two thousand. So that's like a they're you're not trying to come back in a game. That's just he's like, all right, I'm worried about This getting blocked and we're giving up a quick score.",
    "timestamp" : "54:17-54:31"
  },
  {
    "speaker" : "Andy",
    "text" : "Or return for a touchdown, which is exactly what happens anyway.",
    "timestamp" : "54:31-54:34"
  },
  {
    "text" : "Where he's like, I'll take the I'll take the two points to make sure That we don't give up seven here.",
    "speaker" : "Greg",
    "timestamp" : "54:34-54:39"
  },
  {
    "text" : "So it goes from 21. 3 to 21 to 12.",
    "timestamp" : "54:45-54:50",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "54:50-54:57",
    "text" : "Yeah. So Steve, walk me through the uh the return on this, because I you watch this.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean like that's the other part about this decision that Honestly work the opposite way of that whole what they did last time because they choose to say, all right, let's get the field position and give up the points and kick the field goal to force overtime if we have to. And which is crazy because think that the last time it did that they just had a return of their ass for a touchdown. The little bit bowl Yeah.",
    "timestamp" : "54:57-55:24"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "55:24-55:27",
    "text" : "In this case, Delta O'Neil, for some reason, it's the same return too."
  },
  {
    "timestamp" : "55:27-55:28",
    "speaker" : "Steve",
    "text" : "That's the crazy part."
  },
  {
    "speaker" : "Andy",
    "text" : "But he doesn't catch it clean. Like it is there was some miscommunication between him and whoever else was back there.",
    "timestamp" : "55:30-55:36"
  },
  {
    "text" : "Well they were saying that he was the punt returner, but not the kick returner. But still, like he had legit done it three years earlier and taken to the house. So it's not like this dude had never done that before What do you think about it?",
    "speaker" : "Steve",
    "timestamp" : "55:36-55:49"
  },
  {
    "timestamp" : "55:49-55:56",
    "speaker" : "Andy",
    "text" : "Yeah, but the kick was a little short, so the guy in front of him kind of like almost looked like he was gonna catch it and then at the last second kind of took off to go block."
  },
  {
    "text" : "It looked like he didn't yeah, it was like you you got it, I got it, whatever.",
    "timestamp" : "55:56-56:00",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "56:01-56:06",
    "speaker" : "Andy",
    "text" : "So it it bounced and went straight backwards. So by the time Delta O'Neill jumped on it, he was inside."
  },
  {
    "text" : "Oh my caught it and they tried to like loop around and then like a round wasn't there, so he ended up going backwards and they ended up starting at their own 16, which is like couldn't have done that any better. Yeah. It's like, okay, do you want to punt from your own back line of your end zone and they get it on your 40, or do you want to give up two points and they get it on their 16-yard line?",
    "timestamp" : "56:06-56:27",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. Which is like a massive change.",
    "timestamp" : "56:27-56:30"
  },
  {
    "speaker" : "Steve",
    "text" : "It's an easy decision at that point.",
    "timestamp" : "56:30-56:32"
  },
  {
    "text" : "And then the Patriots defense holds for One of the first three.",
    "timestamp" : "56:32-56:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Which is impressive because Portous was gashing. Yep. This was Teddy had some good stops there. He played he balled out in that last series.",
    "timestamp" : "56:38-56:49"
  },
  {
    "timestamp" : "56:49-56:54",
    "text" : "This was the third three and out of the game. The first was on the first drive of the game.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:54-56:54",
    "speaker" : "Steve",
    "text" : "Wow."
  },
  {
    "timestamp" : "56:55-56:59",
    "text" : "Yeah. And the second was on the first drive of the second half. And then this one was the only other three and out, I think.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:59-57:05",
    "speaker" : "Steve",
    "text" : "I mean they they needed it so bad. Yep. Like I said, Teddy was Key in that."
  },
  {
    "text" : "Yeah. And then this is where they send Troy Brown back to return the punt. So the Patriots end up starting at their own 42, which is perfect. Like you said, this is what happens when you punt out of your own end zone. The other team starts it around midfield. And so the Page start at their own 42 with two minutes and 15 seconds left and a few timeouts, I think, still. Yeah? No?",
    "timestamp" : "57:05-57:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "57:25-57:45",
    "text" : "They have timeouts left? They had they had three timeouts when they did the free kick. Oh so I believe they had two of them on the Three and out because they tried to throw for it to make the third down. They didn't get it. Right, right, right. Yeah, they threw a tile off of all people. Like like we're getting we need a third, we need to get this third down. Let's throw a tile off."
  },
  {
    "timestamp" : "57:47-57:51",
    "text" : "They had two minutes 15 with one timeout. So they had the two-minute warning and a timeout left.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "57:53-58:28",
    "speaker" : "Andy",
    "text" : "And so then it was uh MVP time. Kevin Falk picked up 19 yards on the screen. And then a couple plays later on third and ten, Brady hits Falk again for 16. And now the pass are driving. And this is where John Madden talks about this is where they should go for the win and then settle for the field goal if they don't don't get the touchdown. And the next play was Brady hitting the back shoulder throw to David Givens. Was it over uh Delta O'Neil? Or was it his backup? Yeah. Yeah."
  },
  {
    "timestamp" : "58:29-58:38",
    "speaker" : "Steve",
    "text" : "I mean that's off. defense from I mean it wasn't like Delto Neal's fault. That was a fucking no yeah it was it was the perfect throw on his coverage."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:38-58:38",
    "text" : "Yeah. Yeah."
  },
  {
    "timestamp" : "58:38-58:43",
    "text" : "The back right at the corner of the end zone. That's a hard, hard, hard, hard pass it.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, Brady threw it. At the pylon, Gibbs turned back shoulder, 18-yard touchdown.",
    "timestamp" : "58:43-58:49",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:49-59:25",
    "speaker" : "Steve",
    "text" : "Gibbons is a G in this game. Yeah. He was so awesome. And, you know, I now that I'm re-watching this season, I realize how formulative this was in my uh Patriots fandom because I loved David Givens. You did. I remember that. He balls out in this game. And I love the shark tooth hats. Yes. Because there's a bunch of pictures of me when we went to we must have gone to England at this time, wearing a broad shark tooth hat. I think this is this is the season where I I switched from hard ruins to hard patriots."
  },
  {
    "text" : "And also, uh, weren't you a Titans fan before this too? Uh no, that was like middle square.",
    "timestamp" : "59:26-59:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That's when I could draw. That's when I started started to figure out how to draw. They were always my second team.",
    "timestamp" : "59:32-59:38"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "59:38-59:39"
  },
  {
    "text" : "There are pictures of me wearing a Notre Dame hat, a Michigan State hat. True. Those two go together.",
    "speaker" : "Steve",
    "timestamp" : "59:39-59:45"
  },
  {
    "text" : "But never a Titans hat. No, never Titans pair. Well you had a jersey though, didn't you? Yeah, like an Eddie George jersey. I think so. Pretty sure there was an Eddie George jersey in the house at one point. Maybe yours, Greg? No, it was Steve's. Yeah, I thought that was.",
    "speaker" : "Andy",
    "timestamp" : "59:45-01:00:00"
  },
  {
    "speaker" : "Steve",
    "text" : "I used to love him because dad called him the man with two first names.",
    "timestamp" : "01:00:02-01:00:06"
  },
  {
    "speaker" : "Andy",
    "text" : "Of course he did. Uh But yeah, just to finish this game out, um Denver holding penalty on the kickoff, so they start their own 13 with 23 seconds left, so no chance. And then the one deep shot, like we talked about earlier by your boy Danny Connell was picked off by Asante Samuel to end the game.",
    "timestamp" : "01:00:07-01:00:29"
  },
  {
    "timestamp" : "01:00:30-01:00:33",
    "text" : "Did you know his son is in the draft right now?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "And isn't his son also named Asante Samuel?",
    "timestamp" : "01:00:33-01:00:36"
  },
  {
    "speaker" : "Greg",
    "text" : "Jr. is like a first round projected Cornerback out of Florida State. Yeah. No shit. Yeah. Yeah, he's like a top fifteen prospect. He's like the best corner in college football right now.",
    "timestamp" : "01:00:37-01:00:57"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:57-01:01:02",
    "text" : "And Winfield had a kid last year drafted, I feel like."
  },
  {
    "text" : "Yeah, he plays on the Bucks. Yeah. Antoine Winfield Jr. Yeah, I remember that.",
    "timestamp" : "01:01:02-01:01:06",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:01:06-01:01:43",
    "text" : "That's kind of cool. Damn it all showed up a little bit in this game, but it was more like the the vets, I feel like You know, the Teddy Bruskies, the Willie McGuinness, the guys who were, you know, the rookies have showed up earlier in this game, but like this game seemed like one of those like grinded out. win it with just making one more play than the other guys, sort of thing. Yep. And that's why Belichick put Troy Brown there to field that pump, because like, you know. I don't want to put somebody back there that could possibly move. Yeah, you don't want you don't want you to get it. Even though he could probably break it."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:01:43-01:01:45",
    "text" : "There's more of a chance of him breaking it for a big play."
  },
  {
    "speaker" : "Steve",
    "text" : "Not even breaking it, but him not fucking it up. They're like It w it seemed like they were both coaches were sort of playing to not make the big mistake. Yeah, that's true. Bullshit, by the way. A clear recovery by Tom Brady. That was the fucking worst call of all time. But you know, those two mistakes early in Belichick knew like we shouldn't have won because of that, you know, because they're the game was so tight. It was very tight. The game was awesome to watch start to finish.",
    "timestamp" : "01:01:45-01:02:16"
  },
  {
    "text" : "Yeah, no, this this is definitely a game that I would recommend rewatching if you can find it.",
    "speaker" : "Andy",
    "timestamp" : "01:02:18-01:02:22"
  },
  {
    "timestamp" : "01:02:22-01:02:30",
    "speaker" : "Steve",
    "text" : "Definitely this one and the um Bears one, the Lake Champlain one, those sort of stick out a little bit. They're similar."
  },
  {
    "timestamp" : "01:02:30-01:02:33",
    "text" : "And even the Chiefs one from 2002 as well.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. This one was probably the best of those three though, because just because John Madden and We didn't like getting over the hump in Denver too, you know?",
    "timestamp" : "01:02:34-01:02:42",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:02:42-01:02:49",
    "text" : "Yeah, that was the first time the Patriots had won in Denver. In a long time, I think.",
    "speaker" : "Andy"
  },
  {
    "text" : "No, they'd won in that 2000 season, which was the first time in forever, and then Brady had thrown those four picks in the fourth quarter or whatever it was last time he was there in 2001. He'd just shit the bed. It was the worst game as a pro at that point.",
    "timestamp" : "01:02:50-01:03:07",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:03:07-01:03:08"
  },
  {
    "text" : "And Denver had always, I mean, it continued to be honestly a tough place for them to play. And Belichick said it, you know, beating Denver and Denver is as hard as it gets.",
    "timestamp" : "01:03:08-01:03:17",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:03:18-01:04:03",
    "speaker" : "Andy",
    "text" : "Well, uh in the Boston Globe the next day, uh Dan Shaughnessy of all people wrote about how Basically, the Patriots weren't the Red Sox and didn't fail you at every turn. But he wrote, uh, the victory destroyed some of the socks-like ghosts that had tortured the Patriots in the city. New England had won only once here, here being Denver, since nineteen sixty eight, and Brady was 0-2 against the Broncos. It was at this new stadium two years ago that young Brady threw the first interception of his career The Broncos picked him off four times in a single half. The Patriots were also battling a Monday night jinx. New England came into the game with a lifetime mark of 9-19 in the NFL showcase for Monday night."
  },
  {
    "text" : "Yeah, people like take it at this point, understandably, take for granted of like the prime time show up and crush. And you know, at that point that was not It's unusual. Yeah.",
    "timestamp" : "01:04:03-01:04:16",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:16-01:04:21",
    "text" : "Yeah. And in Denver too. So we want to do best and worst?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yes.",
    "timestamp" : "01:04:22-01:04:22"
  },
  {
    "text" : "All right. Greg, you gotta do best and worst?",
    "timestamp" : "01:04:23-01:04:26",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:04:27-01:04:53",
    "text" : "Uh yeah. They're kind of like unrelated, but just a couple things we didn't talk about. Um Best, I guess we'll call it the best. The Broncos actually had a pretty decent season. So they go to five and four at this game, but they end up ten and six. They had the fourth ranked defense in the league and the seventh ranked offense in the league. Damn, with all those injuries too. Yeah."
  },
  {
    "timestamp" : "01:04:53-01:04:55",
    "text" : "Even surprised me because they had nobody back there.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:04:56-01:05:05",
    "speaker" : "Greg",
    "text" : "They Jake Jake Palmer nine and two as a starter this year. So that that's probably what really hurt him was Plummer's injury."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:05:05-01:05:06",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "And I did a little bit of reading about Plummer, and he's like kind of a cool cat. Like he's Yeah, he retired early to like he lives in like Idaho like completely off the map. He was like a s like professional handball player with his brother He did a bunch of shit with Pat Tillman because they played at Arizona State together and in Arizona together.",
    "timestamp" : "01:05:06-01:05:33"
  },
  {
    "speaker" : "Andy",
    "text" : "I was gonna say, yeah, he started in Arizona.",
    "timestamp" : "01:05:33-01:05:35"
  },
  {
    "timestamp" : "01:05:35-01:06:44",
    "speaker" : "Greg",
    "text" : "Yeah, so he's like a big Pat Tillman. He did a tons of ton of shit with that. So my worst is I found some quotes from like Colorado newspapers when he retired early. Oh boy. So they were all they were all pissy because like He was like he had made the Pro Bowl two years before that. Oh damn. So Milo F. Bryant of the Gazette in Colorado said, good riddance. And the Rocky Mountain news went further. If Plumber is willing to run away from five million dollars or so, his spirit is as weak as his arm. I feel like it's the opposite, isn't it? Yeah. Listen to this fucking guy. He said he says that uh Plumber is contradicting the soul of competition. We cannot accept that in ourselves. Or in our heroes. What a fucking who is this fucking douche? Some newspaper in Colorado. Oh, what a cow. Yeah. I thought it was Boston Idiot's dad."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:06:44-01:06:44",
    "text" : "That's fucking"
  },
  {
    "speaker" : "Greg",
    "text" : "And partly like I guess Plumber was like ahead of the curve on all the head injury stuff.",
    "timestamp" : "01:06:45-01:06:49"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:06:50-01:06:50",
    "text" : "Yeah."
  },
  {
    "text" : "He sounds like it, yeah. Yeah. And he was like he was ahead of the curve on medicinal marijuana. He was like talking about legalizing marijuana to like like deal with sp uh football injuries. So I don't know. Plummer seems like a pretty cool dude.",
    "timestamp" : "01:06:50-01:07:05",
    "speaker" : "Greg"
  },
  {
    "text" : "I always kind of conflated him with uh Jay Cutler, but like a cooler Jay Cutler. Yeah. Like a happy similar style of play, but like less douchey. Yeah. Jake I always remember him with the flowing locks.",
    "timestamp" : "01:07:05-01:07:19",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Well he did that. He did that because of um Pat Zillman. Well he grew out his hair and his mustache because that was like Tillman's signature look before he had to cut it for the military. So that was like a that was to honor Tillman.",
    "timestamp" : "01:07:19-01:07:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:07:36-01:07:37",
    "text" : "No way"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:07:37-01:07:51",
    "text" : "And he gave gave his eulogy at Tillman's w uh funeral in a in a suit with flip-flops on. What? He's my kind of guy. I need a friend like Jake Plummer, man."
  },
  {
    "text" : "I feel like we need we need a Jake Plummer jersey. Don't worry, Greg.",
    "speaker" : "Andy",
    "timestamp" : "01:07:51-01:07:54"
  },
  {
    "speaker" : "Steve",
    "text" : "I'll give your eulogy with a s tie-dye shirt that's cut off of the sleeves and a Santa on the middle of it. Yeah the Santa shirt. That's what you need. And flip-flops, dude. What a legend. That is, I mean I sort of like Jake Plummer and now I fucking love Jake Plummer. Big fan of Jake Plummer.",
    "timestamp" : "01:07:54-01:08:13"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:08:14-01:08:17",
    "text" : "Great nickname too. Jake the Snake. Jake the Snake. Jake the Snake's a great nickname, yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "All right, Steve, you want to go?",
    "timestamp" : "01:08:18-01:08:20"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, all right. Um there was a sweet double move to Gibbons I'm gonna highlight the David Gibbons great plays because he had a sick ass double play on move. And that was definitely part Brady, part Gibbons, but both awesome. Yeah Is that my most positive? I don't know.",
    "timestamp" : "01:08:21-01:08:44"
  },
  {
    "text" : "Do you have the play there where uh Brady hit Gibbons in the hands and deflected off it and uh Dion Branch caught it for like 20 yards? 'Cause that was a great play.",
    "timestamp" : "01:08:44-01:08:55",
    "speaker" : "Andy"
  },
  {
    "text" : "I did have the uh question that they had uh Broncos linebacker mic'ed up and he's talking about how he like was lined up for a play in his mouth. guard fell out. Yeah. Then they snapped it on him. Then they came back to show him that he was cutting his mouth guard and they get fitting his mouth against better. But then Al Michael's like, well, what are the archives of NFL Mic'Dupper like? And I'm like, that's a great point, Al. Imagine all of the NFL mic'd up shit that doesn't hit. That doesn't make, yeah. Yeah, we like we can get aired. Because like the Sam Darnold seeing ghosts thing, I remember them being pissed about that. Yep. Like they like they never ran it by his team or whatever. They released that without his acknowledgement. And uh There's gotta be like being the editor for that shit. It's gotta be one of the best jobs in like audiovisual just being like Listening to a fuck ton of sound effects and be like, yeah, these are we can actually release. But like, oh my god, this is all so ridiculous. If only my friends knew, you know.",
    "timestamp" : "01:08:55-01:10:10",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:10-01:10:15",
    "text" : "I paid good money to get into that archive. For sure. That'd be great."
  },
  {
    "text" : "And then uh probably my best best is uh the last bit of this entire VHS recording. Um this reporter asked Doljack. She's like How good does it feel to go into the bye with a W and you can you can see it in his face where he like He clearly had not even thought about that. He didn't even he didn't even process that the buy is next week. Oh shit, you're right. The bye is next week. That's kind of cool. Yeah, I guess that's cool. You know? Every week it's good to have a win was like his his like answer, but like You could see the gears grinding in his head. He was so focused on the week that he didn't even have a Thought he didn't even realize the bye was next week.",
    "timestamp" : "01:10:16-01:11:09",
    "speaker" : "Steve"
  },
  {
    "text" : "That's very Belichick, isn't it?",
    "speaker" : "Andy",
    "timestamp" : "01:11:09-01:11:11"
  },
  {
    "text" : "Yeah, oh yeah. Love it. So on brand.",
    "speaker" : "Steve",
    "timestamp" : "01:11:11-01:11:13"
  },
  {
    "text" : "You got any more?",
    "timestamp" : "01:11:14-01:11:16",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh the worst. I got a worse. Give me a worse. You were talking about this book the other day, Andy, the the dynasty book. I started reading that. Got it here. Which is tough because there's no pictures and uh RNS will read it to me and then I process it that way. But There's a there's a ton about Bill Parcells in there and I already hated Parcells, but now I hate him even more. And in this game, he came up like wow, he's doing such a great job with Dallas, you know? Yep.",
    "timestamp" : "01:11:16-01:11:54"
  },
  {
    "text" : "It's true. Yeah, yeah. That book doesn't uh doesn't paint a a particularly pretty picture of the building.",
    "timestamp" : "01:11:55-01:12:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:12:04-01:12:19",
    "speaker" : "Steve",
    "text" : "I feel yeah. Yeah, I guess that and Brady got to up to eight interceptions in what week nine? Yes, week nine. He has, but he's also Is this his year with the most interceptions?"
  },
  {
    "text" : "Uh let's find out.",
    "speaker" : "Andy",
    "timestamp" : "01:12:20-01:12:22"
  },
  {
    "speaker" : "Steve",
    "text" : "I feel like it's up there.",
    "timestamp" : "01:12:23-01:12:24"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:12:26-01:12:50",
    "text" : "Uh do we want to guess what the most inceptions he's ever thrown in a season is? I think 12 or yeah, I think it's 12. Incorrect. Incorrect. This also includes playoffs, I'm assuming. But in four years, he has thrown 16 interceptions."
  },
  {
    "speaker" : "Steve",
    "text" : "He's throwing 16 picks in four different seasons. Yep.",
    "timestamp" : "01:12:50-01:12:53"
  },
  {
    "text" : "Is this one of them? This is not. In this season, he would throw 14, which is the second most. He would also do that again. In 2002, three and four, he would throw 14 interceptions each season. In 2011 Oh of all seasons. Two thousand five, two thousand six, and two thousand nine, he would throw sixteen interceptions in each of those seasons. Yeah. In 2011, uh including playoffs, he also threw for 6,000 yards and 47 touchdowns. So 16 interceptions.",
    "speaker" : "Andy",
    "timestamp" : "01:12:54-01:13:22"
  },
  {
    "text" : "That's all right. 6,000. How many does he have this year?",
    "speaker" : "Steve",
    "timestamp" : "01:13:23-01:13:27"
  },
  {
    "text" : "I don't know.",
    "speaker" : "Andy",
    "timestamp" : "01:13:28-01:13:29"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:13:30-01:13:31",
    "text" : "He's got 40 tutties."
  },
  {
    "text" : "Yeah, I'm in on Tom Brady this year. And the Bills.",
    "timestamp" : "01:13:32-01:13:36",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Tom Brady this year has 2020. He has 12 interceptions on the year. I think they threw a lot of those early too. So the most in the regular season he's thrown is 14, which was 2002. Four and five.",
    "timestamp" : "01:13:36-01:13:54"
  },
  {
    "text" : "Surprising because he's he's got a lot early here. He's up to eight in through what nine weeks?",
    "speaker" : "Steve",
    "timestamp" : "01:13:54-01:14:01"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he'll throw twelve this season in the regular season.",
    "timestamp" : "01:14:01-01:14:04"
  },
  {
    "text" : "That's pretty good.",
    "timestamp" : "01:14:04-01:14:04",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:14:05-01:14:08",
    "speaker" : "Andy",
    "text" : "So he was eight and nine and then Yeah, he recovers."
  },
  {
    "speaker" : "Greg",
    "text" : "Sounds like uh a focus in the bye week.",
    "timestamp" : "01:14:09-01:14:12"
  },
  {
    "text" : "You're right. Taking care of the football. Get that shit sorted out. All right, so I'm gonna do the nerd stat of the week. Um the Patriots have started 40 players this season. uh 40 different starters, which is most in the league. And they showed a stat where uh NFL since 2000, the annual leaders of most starters used. 2008 was the Jaguars and the Patriots, both of these 42 starters. The Jaguars had the better record at 7-9. In 2001, it was the Bills and the Lions who combined for five wins. Each team had 44 starters. 2002 was the Bears with 49 starters. They had four wins. And this 2003 Patriots team has 40 starters. um which leads the league and they are currently seven and two, which is pretty impressive. Because if you have that many, you have that big of a turnover. That's uh usually not a good sign for your Yeah.",
    "timestamp" : "01:14:13-01:15:17",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:15:17-01:15:23",
    "speaker" : "Steve",
    "text" : "I mean and think about one of the starters is Laurent Malloy. Gone for the year before the year started."
  },
  {
    "timestamp" : "01:15:23-01:15:26",
    "speaker" : "Andy",
    "text" : "Yeah. So there's just so many different players. Um"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, this might be Belchek's, I mean, crowning achievement coaching, you know, just winning games, gutting them out. This is a gut em out game right here. Yep. With that s intentional safety as like the crowning achievement of like just think in playing chess and people playing chuggers.",
    "timestamp" : "01:15:27-01:15:44"
  },
  {
    "timestamp" : "01:15:44-01:16:01",
    "speaker" : "Andy",
    "text" : "Yeah. Uh my actual best in this game was they uh this was I I did they still do it? I'm not quite sure. Um but the Monday night game where each player used to say their name and like where they're from. Yes. And uh Damien Woody called himself Big Wood in the player intro."
  },
  {
    "timestamp" : "01:16:01-01:16:02",
    "speaker" : "Steve",
    "text" : "Okay."
  },
  {
    "timestamp" : "01:16:02-01:16:06",
    "speaker" : "Andy",
    "text" : "Did didn't say Damien Woody. He was like Big Wood. Wherever he's from."
  },
  {
    "timestamp" : "01:16:07-01:16:07",
    "text" : "Which is fucking.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, Al Cooper, Pennsylvania, it's his hometown. Oh. He's a big s he's a big fucking hometown stand. He like does a ton of work, but Where he grew up.",
    "timestamp" : "01:16:11-01:16:21",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Um and the worst was they showed a shot of Pat Bolin, the president of the Broncos, and he's definitely wearing wide receiver gloves. His suit and tie. Which here I'll even share the picture with you so you don't uh think I'm lying. But I'll believe you, but okay. I took a screenshot and this is what he looked like. Those are wide receiver gloves. The black outside, inside, white. The white, yeah, the white on the inside. And you can see the little logos on the yeah Fucking hell. So while city inside, by the way. I wanna I want to do a uh honorable mention to Micah Noor, the punter for the Broncos who went two for two on extra points. After Elam went down. Good for him. Cool.",
    "timestamp" : "01:16:24-01:17:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:17:11-01:17:14",
    "speaker" : "Greg",
    "text" : "Yeah, that's pretty sweet. It's not bad."
  },
  {
    "timestamp" : "01:17:14-01:17:41",
    "speaker" : "Andy",
    "text" : "Yeah. Um, all right. What's next week? Patriots are gonna win. Heading home. Oh, speaking of Bill Parcell, Steven. Bill Parcell's coming to town. We play the Cowboys with his six and three Dallas Cowboys. Oh seven and two Dallas Cowboys, excuse me, facing the seven and two New England Patriots. Sunday night game?"
  },
  {
    "timestamp" : "01:17:42-01:17:47",
    "text" : "Oh Sunday West. Oh yeah. Nice. I'm in on that.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That's awesome. So if you have uh anything you want to tell us, don't forget we uh we haven't been mentioned this lately, but we have the Dynasty Hotline, you can text us 603, what's the number?",
    "timestamp" : "01:17:47-01:17:57"
  },
  {
    "speaker" : "Steve",
    "text" : "Something about Trey Brown shooting a three.",
    "timestamp" : "01:17:58-01:18:01"
  },
  {
    "text" : "603-505-8043. Yes. 8043. 603-505-8043. Shoot us a text. Uh we've got a couple actually. Have we? Yeah. In fact, let's uh from me. No, from an actual listener Nah. Yeah. Uh from uh I'm gonna butcher his name, Tariq. T-E-R-I-K. Tariq, yeah. Yeah, we got over the the holidays. He said dear brown brothers. Just want to say I love the podcast and look forward to it each and every week. Uh this this may be our mother writing. I love football, football history, and especially the New England Patriots. So these podcast episodes are right up my alley as I love reliving the Patriots of yesterday on nostalgia. Anyway, keep up the good work, gentlemen. I look forward to more episodes and more stat checks. Sincerely, Tariq. So we need to make Greg work harder. Thanks, Tyreek.",
    "timestamp" : "01:18:01-01:18:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:18:59-01:19:01",
    "speaker" : "Steve",
    "text" : "What did mom say?"
  },
  {
    "timestamp" : "01:19:01-01:19:02",
    "speaker" : "Andy",
    "text" : "I think that was mom."
  },
  {
    "text" : "No, that was Tariq. Mom would be more about I love each of you equally.",
    "timestamp" : "01:19:03-01:19:09",
    "speaker" : "Steve"
  },
  {
    "text" : "I I don't think she should say that. Except for Gregory. Uh Mom did say something. What did she say to us?",
    "speaker" : "Andy",
    "timestamp" : "01:19:09-01:19:14"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:19:16-01:19:24",
    "text" : "I've learned a lot about you. This podcast is inappropriate when you're talking about dick pics. That's about the feedback I've got from mom."
  },
  {
    "text" : "Yeah, yeah, that that that sounds about right. Um Gregory stopped talking about your Willie, I think was uh was up there.",
    "timestamp" : "01:19:24-01:19:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "No more Willie talk. Willy Willie Middlebrook on the uh Broncos.",
    "timestamp" : "01:19:32-01:19:38"
  },
  {
    "text" : "That's true. Uh oh, there's also goddamn, this should be a phone in. You people don't know my beloved Drew Bledsoe.",
    "timestamp" : "01:19:39-01:19:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:19:46-01:19:46",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That's mom.",
    "timestamp" : "01:19:46-01:19:47"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Beautiful. Love you, mom.",
    "timestamp" : "01:19:47-01:19:51"
  },
  {
    "speaker" : "Andy",
    "text" : "Love you, Tariq. Yeah. And everybody else. Who sent us uh Comments or anything. Other than Jesus. Let us know. Jesus? Jesus Christ. And we'll probably read it on the on the podcast because we don't actually get many of these. All right, gentlemen, until next week, we will see you later.",
    "timestamp" : "01:19:52-01:20:24"
  }
]