[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom"
  },
  {
    "speaker" : "Andy",
    "text" : "Welcome back to the Pages Dynasty Podcast. I'm your host, Andy Brown. With me are my both my brothers this week. Steve Brown. How's it going?",
    "timestamp" : "00:23-00:32"
  },
  {
    "timestamp" : "00:32-00:35",
    "speaker" : "Steve",
    "text" : "Good, good. Glad to be back in the saddle."
  },
  {
    "timestamp" : "00:36-00:48",
    "speaker" : "Andy",
    "text" : "Yep. Yeah, I missed last week because we had some uh family emergencies we had to bail, but we're back here and we're back with everybody. Uh Steve Bray, you're doing um Uh puppy prep, right?"
  },
  {
    "timestamp" : "00:48-00:53",
    "text" : "Mm-hmm. Yeah, puppy pickup date. This time, next next episode, we'll have a little dog joining us.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh fuck yeah. That won't be obnoxious at all. Yeah.",
    "timestamp" : "00:53-00:56"
  },
  {
    "timestamp" : "00:58-00:58",
    "speaker" : "Steve",
    "text" : "Welcome, Greg."
  },
  {
    "text" : "The day I have to listen to a fucking dog in the background is the day I quit this podcast.",
    "timestamp" : "01:00-01:05",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:06-01:09",
    "text" : "This is our final episode with Greg. Thanks for joining us.",
    "speaker" : "Steve"
  },
  {
    "text" : "But we Steve and I were talking before you joined Greg and um I think that at this point it's almost like a Pavla's response for the listeners because they when you're here, they know that like this is a game worth watching. Yeah. Especially when they find out that you even watched this entire game. Watched the whole game.",
    "timestamp" : "01:11-01:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Start to finish.",
    "timestamp" : "01:29-01:30"
  },
  {
    "timestamp" : "01:31-01:35",
    "speaker" : "Andy",
    "text" : "So tell us which one it is. What what do we want? What are we talking about tonight?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:35-01:51",
    "text" : "The the folks out there will remember it as the big willy fourth down stop on the goal line and then run down the center of the field in the RCA dump pointing to the heavens. A legendary game in Patriots lore."
  },
  {
    "text" : "Yes, so this is 2003 week 13 as the Patriots will travel to Was the R is it the RCA dome? Yeah. Is it still the RCA dome?",
    "speaker" : "Andy",
    "timestamp" : "01:51-02:02"
  },
  {
    "timestamp" : "02:02-02:03",
    "speaker" : "Steve",
    "text" : "Yeah, it was."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:03-02:05",
    "text" : "Yeah, it was then. I don't know if it still is, though, is it?"
  },
  {
    "text" : "No, it's LucasOil Field now.",
    "timestamp" : "02:06-02:08",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh, that's right. Yeah. It's always a completely different stadium too, right?",
    "speaker" : "Andy",
    "timestamp" : "02:08-02:11"
  },
  {
    "timestamp" : "02:12-02:12",
    "speaker" : "Steve",
    "text" : "I don't know."
  },
  {
    "text" : "Um But yes, the Patriots uh at 9-2 travel to Indianapolis to play the Colts who are also 9-2 for battle for, I think technically second place in the AFC because aren't the Chiefs like 10-1? They were undefeated up until last week. Yes, yeah. But the Colts are tied with the Titans for at 9-2 for in their division. Patriots are Uh a couple games up there over the Miami Dolphins, who are eight and four. Um, and they will be playing each other next week. So A lot on the line for this. Kind of home field advantage through the playoffs, maybe that sort of stuff. And just kind of like the first real Marquee battle between Brady and Manning, right? Because they've played before, but they haven't really been. That was like real early Tom Brady in 2001.",
    "timestamp" : "02:13-03:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "First game of Brady, right?",
    "timestamp" : "03:10-03:11"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:11-03:15",
    "text" : "Yep, his first game and then also the David Patton game like two weeks later."
  },
  {
    "text" : "Yeah, they were both early in that season.",
    "speaker" : "Steve",
    "timestamp" : "03:16-03:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:18-03:18",
    "text" : "Yeah, that's right."
  },
  {
    "timestamp" : "03:19-03:38",
    "text" : "Um I have I want to put a correction out there though, because On the last episode, I said, I don't remember who we play in the playoffs in this year. Watching this game, I remember because this is the year Manning and McNair share MVPs. Correct. And both of them are in the same division. They're both doing awesome this year. Yeah. Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "Peyton Manning this year was like prime Peyton Manning. And what do you do? He did uh 4,200 yards, 29 touchdowns, 10 interceptions. Which, and this is still 2003, so They hadn't even changed the rules yet, which I think we will get to at the later on in this season, to allow um wide receivers free releases and less contact on wide receivers And he's still throwing for 4200 yards and 29 touchdowns. Pretty good. This team is stacked. Yeah, and and for uh comparison's sake, Tom Brady in 2002, the year before this led the league with 29 touchdown passes. So this is like league leading numbers here.",
    "timestamp" : "03:38-04:24",
    "speaker" : "Andy"
  },
  {
    "text" : "It was sort of like the Patriots offense 07, like where he's just like dominate him a little bit, can throw the ball a ton.",
    "timestamp" : "04:25-04:31",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:31-05:32",
    "text" : "Yeah, yeah, yeah. Um, but like Greg said, this is a loaded team. Kind of on both sides of the ball. Uh more so obviously more so on the offense, but there's some names that you'll recognize on the defense too. Uh leading rusher Egrin James ran for 1,200 yards and 11 touchdowns. Good season for a team that's been slinging the ball to 4,000 yards and 29 touchdowns. But the Other end of that connection are obviously Marvin Harrison and Reggie Wayne. Marvin Harrison, uh 1200 yards, 10 touchdowns, and zero witnesses this season. Uh Reggie Wayne, second leading receiver with 838 yards, another seven touchdowns on top of that. So they were scoring in bunches this team. Oh, they do. Oh, they they would end up Pollard and Clark at tight end. Oh, that's right. Yep. Um And also rookie, what's his name? That title. Rookie Dallas Clark."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "05:32-05:33",
    "text" : "Dallas Clark, yeah, I saw that."
  },
  {
    "text" : "Who unfortunately in this game goes down with a real bad Ankle injury, which turned out to be season ending, right? Fractured fibula.",
    "speaker" : "Andy",
    "timestamp" : "05:34-05:43"
  },
  {
    "text" : "It had to be seasoned ending.",
    "speaker" : "Steve",
    "timestamp" : "05:43-05:44"
  },
  {
    "timestamp" : "05:45-06:03",
    "text" : "Yeah. So I don't think he played much after this game. Oh yeah. Um their draft this year was actually pretty good because I got him in the first round. Robert Mathis, who also really good. Yeah, defensive end played really well. And then Kato June as well, the linebacker from Michigan.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "06:03-06:13",
    "speaker" : "Steve",
    "text" : "Oh, Kato. All three would go to at least this like this has got to be early for a prini, right? This is Freeni's like just coming on the scene right now too."
  },
  {
    "text" : "He had 13 sacks in 2002. This is the middle of his prime. So he went 13-11-16-11. So yeah, four straight years of 10 sacks each.",
    "timestamp" : "06:14-06:25",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:25-06:28",
    "text" : "Yeah, and he was drafted the year before in 2002, like you said."
  },
  {
    "timestamp" : "06:28-06:29",
    "text" : "Yeah, so it's his second year.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "06:29-06:30"
  },
  {
    "text" : "Wow.",
    "timestamp" : "06:30-06:31",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "06:32-06:50",
    "speaker" : "Andy",
    "text" : "And that dude is fast. I remember like you know it's like oh yeah, you he was he was fast and Matt Light always had a problem with him But you just forget how fast he actually was. Yeah. Like it was like the f one of the first snaps of the game, and He just blew by Matt Light as if he were just standing still."
  },
  {
    "timestamp" : "06:50-06:54",
    "text" : "It was incredible how quick he was. Looking good too. His jumps were real.",
    "speaker" : "Steve"
  },
  {
    "text" : "And it's like I think the Astro Turf Everybody looked so goddamn fast on the ass. Oh my god. Mike Cloud looked untouchable.",
    "speaker" : "Greg",
    "timestamp" : "06:54-07:03"
  },
  {
    "timestamp" : "07:03-07:08",
    "text" : "Yeah. on this yeah it just looks awesome in general.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Like I understand that it's better to play on like this fake grass now, but The turf with like the bright green popping against like the jerseys and like everyone looks fast and they're about to like and everyone's super clean too because it's just on carpet.",
    "timestamp" : "07:08-07:23"
  },
  {
    "timestamp" : "07:24-07:28",
    "speaker" : "Andy",
    "text" : "So yeah, it looks awesome. Yeah. The color's definitely popping."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "07:28-07:32",
    "text" : "Reggie Bush ruined it for everyone when he tore his ACL. Fucking Reggie Bush."
  },
  {
    "speaker" : "Andy",
    "text" : "So how do the Colts do this year?",
    "timestamp" : "07:33-07:36"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "07:36-07:42",
    "text" : "Well, you forgot one important player. Oh, yeah, I was gonna get to him in a second. Is it the same?"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "07:42-07:43"
  },
  {
    "text" : "Yeah. Yeah. Mr. Perfection. Yeah, all right. Well, all right, let's fuck it. Let's do it. The perfect human being.",
    "speaker" : "Greg",
    "timestamp" : "07:43-07:51"
  },
  {
    "text" : "I'll just throw that out hilariously because I didn't actually realize that's the person we missed.",
    "timestamp" : "07:52-07:56",
    "speaker" : "Steve"
  },
  {
    "text" : "Yes, no, that's who we're talking about. Oh it's him. Yeah. Uh so I was looking him up a little bit and just kind of like some of the Boston Globe articles the week leading into this. And um There's a lot of talk about how one, he's more than more than just a kicker. He's a football player. I think I have a quote here. Oh yeah, here we go. Vanderjacht will always defend himself as a football player, not just a kicker. Quote, I have the full respect of every player in this locker room, he said. And you'll never hear Manning for one call him, quote, just a kicker again. A kicker seems to be a negative about you, like, oh, you're just a kicker. And that's a negative statement he put on you, Vanderjack said. It's ridiculous. I take pride in being able to tackle guys, throw the ball around, and be an athlete. It's disappointing I get labelled like that. It's changing, but it's been a slow process. Sometimes I talk to talk, but I walk the walk. I'm an athlete and everybody in here knows it.",
    "timestamp" : "07:56-08:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "09:00-09:07",
    "speaker" : "Greg",
    "text" : "Well that's even more ironic, right, because Manning said exactly that at the Pro Bowl Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Mike Vanderjack was just a kicker.",
    "timestamp" : "09:07-09:09"
  },
  {
    "timestamp" : "09:09-09:23",
    "text" : "Yeah, he's like when the like Vanderjack was complaining about something, Manny was like, it's a real shame that we got this like Jackass drunken kicker making comments to the media while I'm here at my third Pro Bowl or something like that.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "09:24-09:54",
    "text" : "Yeah, well, so here you go. I don't know if it's the same the same article or not, but it was earlier on. And so it's just talking about how he's uh he's Vanijjack's very outspoken. And so it says, when Vanijak went home to Toronto to do, quote, the score, which I guess is uh oh, a Toronto cable TV show. He said that Manning needs to, quote, show some enthusiasm and that Dungey is, quote, just a mild-mannered guy. Manning responded by calling Vanderjacks, quote, an idiot kicker.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "09:55-09:57",
    "speaker" : "Steve",
    "text" : "I mean, I'm in on that."
  },
  {
    "timestamp" : "10:01-10:16",
    "speaker" : "Andy",
    "text" : "The incident hung over the team in the offseason, but ever since the Colts have been good and fiery, and they take a 9-2 record in today's matchup with the Patriots, who are also 9-2. Nobody in the Coles locker room is apt to say that they're quote idiot liquored up kicker, as Megan described it."
  },
  {
    "text" : "Yeah, that that was actually making the rounds today. I watched that clip today. Really? Yeah, because apparently Mahomes was saying something about not having like protection.",
    "speaker" : "Greg",
    "timestamp" : "10:20-10:28"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "10:28-10:29",
    "text" : "Oh, he was, yeah."
  },
  {
    "text" : "Yeah. So there were people throwing that around. Yes.",
    "timestamp" : "10:29-10:32",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Um So but I'm just gonna he's he's perfect on this season.",
    "timestamp" : "10:33-10:37"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "10:38-10:44",
    "text" : "He does go I I thought you guys important because he missed a field goal sum, which he did not. Four for four and extra points, two for two on field goals."
  },
  {
    "speaker" : "Andy",
    "text" : "Yes. Uh he was also oh for two on tackling Bethel Johnson, though.",
    "timestamp" : "10:45-10:50"
  },
  {
    "text" : "Yeah, but he was perfect on this. F Speaking of which, speaking of which.",
    "speaker" : "Greg",
    "timestamp" : "10:50-10:55"
  },
  {
    "text" : "Ooh, he's got the You have a Bethel Jobs.",
    "timestamp" : "10:56-10:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:59-11:04",
    "text" : "Audio medium, I'm wearing a Bethel Johnson jersey as we did you get that?"
  },
  {
    "timestamp" : "11:04-11:08",
    "speaker" : "Andy",
    "text" : "Did you buy it just for this? Because this it is, it's a B. Johnson. Holy shit."
  },
  {
    "text" : "I just thought it was a moss that you were just pretending it was.",
    "timestamp" : "11:09-11:12",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "11:13-11:30",
    "text" : "Yeah. When I when I went downstairs earlier tonight, Kelly was like, Who's that? And I said, I gotta personalize because I have a big Johnson. And I think she half believed it for a second. Of course she did. She lives with you. Oh like P. Johnson."
  },
  {
    "text" : "So you did just recently buy this though.",
    "speaker" : "Steve",
    "timestamp" : "11:31-11:33"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "11:33-11:34",
    "text" : "No, I've had it."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "11:35-11:35",
    "text" : "How long?"
  },
  {
    "text" : "Uh I don't know. Like two hours.",
    "speaker" : "Greg",
    "timestamp" : "11:36-11:38"
  },
  {
    "timestamp" : "11:39-11:45",
    "speaker" : "Andy",
    "text" : "It's around this time frame. You bought a Bethel. All right, you know what? Good for you."
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, Bethel?",
    "timestamp" : "11:45-11:46"
  },
  {
    "timestamp" : "11:46-11:56",
    "speaker" : "Steve",
    "text" : "I gotta say, like I'm you're right. He does have B. Johnson on his jersey. I just I just checked it on the highlights on pagesdynasty. info. Yep. B. Johnson."
  },
  {
    "text" : "Yeah. I like had this impression of him being like a bust. Ted Johnson.",
    "speaker" : "Greg",
    "timestamp" : "11:56-12:01"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh I think but he's awesome. He was more just like uh He was supposed to be kind of like a a a good wide receiver and not just a kick returner, but he never really did anything other than kick returning, I think.",
    "timestamp" : "12:02-12:14"
  },
  {
    "timestamp" : "12:14-12:15",
    "speaker" : "Steve",
    "text" : "He's had some good receiving games."
  },
  {
    "timestamp" : "12:15-12:16",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "12:16-12:17",
    "speaker" : "Greg",
    "text" : "I think he's really impressed me this year."
  },
  {
    "timestamp" : "12:18-12:20",
    "text" : "Last game was pretty good. This game he was pretty good too.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:20-12:30",
    "text" : "Mm-hmm. Yeah. Um I think it's more because they just haven't had anybody else to put there though. Like you're not going to start him over Dion Briggs."
  },
  {
    "timestamp" : "12:32-12:34",
    "speaker" : "Steve",
    "text" : "when given opportunities."
  },
  {
    "text" : "He's doing okay.",
    "speaker" : "Andy",
    "timestamp" : "12:34-12:35"
  },
  {
    "text" : "Okay, I lied. He had two catches seven yards in this game.",
    "timestamp" : "12:35-12:38",
    "speaker" : "Steve"
  },
  {
    "text" : "Right. I wasn't gonna but he also had like two of the biggest plays of the game.",
    "speaker" : "Greg",
    "timestamp" : "12:38-12:44"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:44-12:52",
    "text" : "Right. So, um let's get into the game, I guess."
  },
  {
    "text" : "Well, one other note on the the cults. There are one, two, three, four Hall of Famers. on this team. Manning Harrison Harrison. Um Freeney. No.",
    "timestamp" : "12:52-13:07",
    "speaker" : "Greg"
  },
  {
    "text" : "Not Reggie Wayne.",
    "speaker" : "Andy",
    "timestamp" : "13:08-13:09"
  },
  {
    "speaker" : "Greg",
    "text" : "No.",
    "timestamp" : "13:10-13:10"
  },
  {
    "speaker" : "Andy",
    "text" : "No, not Reggie Wayne.",
    "timestamp" : "13:10-13:11"
  },
  {
    "timestamp" : "13:12-13:39",
    "speaker" : "Greg",
    "text" : "He was inducted last year. I drew in Jane. I drew in James at Hall of Famer, which I found really surprising. Yeah. He got inducted last year. That's that's like yeah, that's a bit of a show. And I wanted to bring that up. Like I never I never feared Edrian James as a as an opponent. Like Marshall Falk. You're always like, what are we gonna do? Like this guy's a matchup nightmare. He's a weapon. He could turn he could just win this game on his own, but I never got that feeling from Eddie."
  },
  {
    "timestamp" : "13:39-13:42",
    "speaker" : "Steve",
    "text" : "Kevin Fault is exactly how they felt, right, Andy?"
  },
  {
    "timestamp" : "13:42-13:44",
    "text" : "Oh yeah. Yeah. Same thing.",
    "speaker" : "Greg"
  },
  {
    "text" : "But I get what you're saying, Greg. Edrian James is always just like a and okay, he's like a Lawrence Moroni.",
    "timestamp" : "13:44-13:49",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. He just never showed up in the hall. And that means he's spots. He shouldn't be in the Hall of Fame, in my opinion. I'm with you. I agree.",
    "timestamp" : "13:49-13:55",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "13:56-14:00",
    "speaker" : "Andy",
    "text" : "I was a little surprised by that. Because he w because he never scared Patriots fans? Mm-hmm."
  },
  {
    "timestamp" : "14:01-14:07",
    "text" : "Well he's like Yang, we just put up a ton of stats, but he didn't even like put them up in like a unprecedented way without a lot of big wins.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, he never he never really showed up in the playoffs that I remember.",
    "timestamp" : "14:08-14:10",
    "speaker" : "Andy"
  },
  {
    "text" : "Many eventually figured out, but that was way after Edge is gone.",
    "timestamp" : "14:10-14:13",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. But like Harrison, yes, right? He could kill you. You were scared of him. Manning, yes. Tony Dungey is the fourth, by the way. Yes.",
    "speaker" : "Greg",
    "timestamp" : "14:13-14:24"
  },
  {
    "text" : "That's a shame. Tony Dungey, of course.",
    "speaker" : "Steve",
    "timestamp" : "14:24-14:27"
  },
  {
    "speaker" : "Greg",
    "text" : "Did Tony Dungey? Yeah, has it been he has like the same career winning percentage as Belgique.",
    "timestamp" : "14:27-14:33"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. I just didn't think I was thinking coaches at all. Really?",
    "timestamp" : "14:33-14:37"
  },
  {
    "text" : "Mm-hmm.",
    "timestamp" : "14:37-14:38",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "14:38-14:39",
    "speaker" : "Andy",
    "text" : "We're talking about the same Tony Dungey?"
  },
  {
    "text" : "That's correct. 668. Winning percentage compared to Belchek's 678.",
    "timestamp" : "14:40-14:47",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "14:47-15:06",
    "text" : "Wow. All right. Uh yeah, he was five and five against uh the Patriots in his career. Now the Pats actually star it was weird because they started like four and one against them, but then they went one and four after that But they were two and one. The Pages were two and one in the playoffs.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:06-15:08",
    "speaker" : "Steve",
    "text" : "Fuck Tunny Dunji. Let's get into this game."
  },
  {
    "timestamp" : "15:08-15:43",
    "speaker" : "Andy",
    "text" : "Yeah. Well, oh, one other head coach though that that is uh well funny is Jim Caldwell was a QB coach. And I guess I guess yeah, if you're a QB coach for Peyton Manning, that means you will eventually get a head coach job because between him and Adam Gase. Yep. Just the the eyes on both of them. That's true. Yeah. For different reasons. Because I think um I think Jim Caldwell almost has that thousand yard stare. Yeah. You know how like sometimes dogs just stare at a wall for no reason? I'd be like, that's Tony Dun. That's uh Jim Caldwell."
  },
  {
    "text" : "Where you start being like, Ewick? Yeah.",
    "timestamp" : "15:43-15:44",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "15:45-15:50",
    "text" : "Yeah. And Adam's got those basalt eyes just like",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, where he's like, he's awake for sure.",
    "speaker" : "Andy",
    "timestamp" : "15:50-15:52"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "15:53-15:53",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "And he sees flies that are in the room that nobody else sees. Yeah. Yeah. He's trapped. He's smelling colors. Okay. Exactly. You can see sounds. So yeah, Jim Caldwell, uh head coach.",
    "timestamp" : "15:53-16:10"
  },
  {
    "text" : "QB Whisper. Anybody, any any coach of quarterbacks. That if it's a good quarterback is gonna get labeled QB Whisper. It's just how the NFL works.",
    "speaker" : "Greg",
    "timestamp" : "16:10-16:21"
  },
  {
    "speaker" : "Steve",
    "text" : "Buzzword City.",
    "timestamp" : "16:22-16:23"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. All right, so let's talk about this football game. Yeah. Give me uh give me a rundown, Brownie.",
    "timestamp" : "16:24-16:33"
  },
  {
    "speaker" : "Greg",
    "text" : "of how this kind of who's brownie we're never mind Brazy who's Breezy you're Steve Steve let me get this one okay I watched this game I'll have you I'll have you know so this game was famous for the the stop at the end, but the whole game was just wild in itself.",
    "timestamp" : "16:34-16:55"
  },
  {
    "text" : "And yeah, actually, should we give this a uh a watchability score? Sure.",
    "timestamp" : "16:56-17:00",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "17:00-17:03",
    "speaker" : "Steve",
    "text" : "All right. This is a very entertaining. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "So out of out of six Lombardies, what would you give this?",
    "timestamp" : "17:03-17:07"
  },
  {
    "speaker" : "Greg",
    "text" : "I'll give it a five. Yeah. Yeah.",
    "timestamp" : "17:07-17:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "17:09-17:09"
  },
  {
    "timestamp" : "17:09-17:11",
    "speaker" : "Greg",
    "text" : "I'll give it even five."
  },
  {
    "text" : "I'd say so. Yeah, I mean the only reason not six is because it's not a playoff game, I think. Mm-hmm. But not in two teams going at it all the way to the end.",
    "speaker" : "Andy",
    "timestamp" : "17:11-17:22"
  },
  {
    "speaker" : "Greg",
    "text" : "Man Manning Brady Manning Brady factor. Yeah. I mean it's a shootout too. The the final score ends up being 38 to 34 Patriots. Yeah. So it was a points fiesta, and really it could have been a devastating loss for the Patriots.",
    "timestamp" : "17:23-17:41"
  },
  {
    "speaker" : "Andy",
    "text" : "This yeah, uh when I was watching it, the part that surprised me was How many opportunities the Patriots squander to just like stomp on the Colts throat and put this game away for good?",
    "timestamp" : "17:42-17:55"
  },
  {
    "timestamp" : "17:55-18:29",
    "speaker" : "Greg",
    "text" : "Yeah. And it's I I I when I thought of like the Colts comeback game, I was thinking of The AFC championship game they lost, right? I always got these CPS mixed up. Six, I believe. Yeah. And I don't really it's like kind of similar to that game, except the Patriots pull it out in the end. But The Patriots go up 31 to 10 late in the third quarter. Yeah. Give up that lead. Get it back. And then the fourth down stop comes on basically the last play of the game."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Uh but the Colts had also already come this was the season where remember they were playing the Bucs and they were down 35-14 with five minutes left in the game. And they came back and won at like 38-35. And that I watched the fourth quarter of that game.",
    "timestamp" : "18:29-18:46"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "18:46-18:59",
    "text" : "Yeah, me too. Oh, not before this. Generally. I watched it before like two weeks ago. I just like stumbled across it on YouTube. I was like, oh yeah, I remember hearing about this Monday night game. Yeah. It was insanity. Bananas."
  },
  {
    "text" : "Yeah. They they literally came back from What was that? Three touchdowns down with five minutes left.",
    "timestamp" : "19:00-19:04",
    "speaker" : "Andy"
  },
  {
    "text" : "It was twenty-eight to seven. No, that's the other thing is it it was twenty-eight to seven to start the fourth. It was 35-14 with four minutes and 16 seconds left. Yeah. And then they tied it up with still a minute 37 left on the clock. In less than three minutes, they fucking scored 21 points without turnovers. Just like bombs? It was just it was kind of like just clinical too.",
    "timestamp" : "19:06-19:34",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "It was just Peyton Manning, just yeah. Just doing his thing. And it and it just all of a sudden when it clicks, that's what happens. You score three touchdowns in a couple of minutes. Yeah. And uh to Greg's point, they kind of did that again in this game. Because like you were saying, the Patriots went up, was it 31-10?",
    "timestamp" : "19:34-19:53"
  },
  {
    "text" : "Let's not gloss. That's kind of whooped them up. And then Peyton Manning had nothing in the first half. He was not putting it.",
    "timestamp" : "19:53-20:00",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Yeah. So I mean, yeah, the page in the first half, the Manning's first drive, he got strip-sacked on third down.",
    "timestamp" : "20:01-20:06",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "He was like they were confusing him. You could definitely tell that he had no idea what was going on. He was holding on the ball a lot longer than you ever seen Manning do. Yep. And Vrabel just like hunted him down, came all the way around, looped around, just got him blindsided in the back.",
    "timestamp" : "20:06-20:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, that was great. Um the Pagers immediately turned into a Mike Cloud touchdown run.",
    "timestamp" : "20:18-20:24"
  },
  {
    "text" : "Did you see that Pepper Johnson clip of him stoked about that? Yeah, Pepper Johnson. Oh man, he was Height City.",
    "speaker" : "Steve",
    "timestamp" : "20:24-20:32"
  },
  {
    "speaker" : "Andy",
    "text" : "The names in this game, I think, is another reason why this is a five Lombardi game. I'm talking pepper jokes.",
    "timestamp" : "20:32-20:39"
  },
  {
    "timestamp" : "20:39-20:42",
    "text" : "Wait, are you talking about like the obscure names on the Patriots?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "No, just the fact that all these huge names played in this game.",
    "timestamp" : "20:42-20:45"
  },
  {
    "timestamp" : "20:45-21:00",
    "text" : "Okay. Cause there's also a bunch of fucking nobodies. Oh yeah. Oh yeah. Like the t the people that score touchdowns for the Patriots. Mike Cloud. Who the fuck Mike Cloud? Dietrich Ward. Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Dietrich Ward who he played last week.",
    "timestamp" : "21:00-21:04"
  },
  {
    "text" : "Yeah, he had a couple catches there.",
    "timestamp" : "21:04-21:05",
    "speaker" : "Steve"
  },
  {
    "text" : "JJ Stokes is out there on the city.",
    "speaker" : "Andy",
    "timestamp" : "21:05-21:07"
  },
  {
    "speaker" : "Greg",
    "text" : "JJ Stokes is there. JJ fucking Stokes. Yeah. I had no clue that JJ Stokes played for the Patriots.",
    "timestamp" : "21:07-21:13"
  },
  {
    "speaker" : "Steve",
    "text" : "That's what happens when you miss a fucking podcast. We were talking about this last week, Greg. JJ fucking Stokes did? No, last week.",
    "timestamp" : "21:13-21:20"
  },
  {
    "timestamp" : "21:19-21:27",
    "speaker" : "Andy",
    "text" : "From last week, Jesse Stokes and Dietrich Ward were basically starting at wide receiver. JJ Stokes is the man game."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "21:27-21:27",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:30-21:33",
    "text" : "Yeah. And D-Trick Ward did the same in this game, which is fucking."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "21:33-21:35",
    "text" : "I Snapchatted it to you, Greg."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, but I just delete those. Oh yeah, you just don't even actually No, you actually have you have killer Snapchats. Steve. Those ones where you make your face ugly. I screenshot him every time. Their whole album, dude.",
    "timestamp" : "21:35-21:49"
  },
  {
    "timestamp" : "21:49-21:55",
    "speaker" : "Steve",
    "text" : "Dude, they're hilarious. The kickstart when you open a beer and you pretend to revit like a fucking motorcycle. Yeah, those are funny too. Those are sweet."
  },
  {
    "text" : "Yeah. I like it because your girlfriend looks disappointed.",
    "timestamp" : "21:56-21:59",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "22:00-22:07",
    "speaker" : "Steve",
    "text" : "Very good. You can just see it just like slowly leaving her eyes, like just accepting it eventually."
  },
  {
    "text" : "You can just see the love fading.",
    "speaker" : "Andy",
    "timestamp" : "22:07-22:10"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "22:14-22:19",
    "text" : "Speaking of a love fading, the shine went off the Patriots. Like that, Andy?"
  },
  {
    "speaker" : "Andy",
    "text" : "That was pretty good. Um yeah, but like even this this whole first half was just all Patriots, it felt like. Like they put up Uh 10 points in the first quarter. And then there are another touchdown like right as the second quarter starts. And the Colts haven't scored yet. So it's 21, no, 17, nothing. Yep. Colts score, field goal.",
    "timestamp" : "22:19-22:45"
  },
  {
    "timestamp" : "22:46-22:52",
    "speaker" : "Steve",
    "text" : "That field goal almost had a touchdown. Yeah. Did you see that? Yeah. Absolute filthy move from Marvin Harrison."
  },
  {
    "text" : "Yeah. He's pretty fucking good.",
    "speaker" : "Greg",
    "timestamp" : "22:52-22:54"
  },
  {
    "text" : "He was he's taking advantage of Eugene Wilson as a safety. Remember, he's a college cornerback. They drafted, move him to safety as rookie year. And this is his tenth or eleventh game. Yeah, he had tough game in coverage in this game.",
    "speaker" : "Steve",
    "timestamp" : "22:54-23:07"
  },
  {
    "timestamp" : "23:07-23:10",
    "text" : "I thought he was scrappy though. He like made a couple of good plays.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "23:12-23:15",
    "speaker" : "Steve",
    "text" : "I well he got torse of the skydory."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "23:16-23:23",
    "text" : "That's why I think I liked him is because even though he wasn't he's like uh Butler, Malcolm Butler."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "23:23-23:23"
  },
  {
    "text" : "Where he might not be the most talented player, but he you could tell like he was taking it personal if something and he played with anger where like every tackle coming in like hard and being like, okay If I'm gonna fuck up, I'm gonna fuck up hard. Which I I I respect that in a player. That's fair.",
    "speaker" : "Greg",
    "timestamp" : "23:23-23:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Um But I I think we should probably talk about the end of the first half in this game because like this just again is kind of another point of Like this is how exciting this game was because the Colts scored right at the end of the half. There's like Manning threw a touchdown to Pollard uh with 12 seconds left in the game in the half. And that pulls it within 17-10. So you know it's it they close it, so it's cool. They're gonna Colts are gonna get the ball back. Yep. Cloud crowds roaring. Exactly. Yeah, they're they're starting to get some momentum. Yeah. And uh I just want you to hear what actually no, well we'll talk about the play for us. But um so they the the Colts kick it off. I know Bethel Johnson instead of scribbling. It was 12 seconds left, but they just do regular kickoff. And all that happens is um house call. Yeah. Bethel Johnson. See ya fucking later. Bethel Johnson eludes the tackle of noted athlete Mike Vanderjacks. Big Johnson. To take it 91 yards for the touchdown to end the half. Large Johnson. And then one of my one of my favorite um One of my favorite pastimes of the uh NFL is interviewing coaches as they run into the the locker room for halftime. While running.",
    "timestamp" : "23:43-25:10"
  },
  {
    "timestamp" : "25:10-25:12",
    "speaker" : "Announcer",
    "text" : "Thanks, Greg. Coach, obviously you cut it to seven."
  },
  {
    "speaker" : "Tony Dungy",
    "text" : "That big and then a huge reversal momentum. Yeah, that's dumb on my part, kicking the ball deep. Uh we just got to bounce back from it the second half. We're starting to move the ball. Uh we got to get him stopped on defense.",
    "timestamp" : "25:12-25:22"
  },
  {
    "timestamp" : "25:22-25:23",
    "text" : "All right, coach.",
    "speaker" : "Announcer"
  },
  {
    "text" : "I mean he already had a big return earlier too. He had like a 60-something yarder, like a 65 yarder.",
    "timestamp" : "25:25-25:30",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "No, that comes later. Which is even better. Yeah.",
    "timestamp" : "25:30-25:34"
  },
  {
    "timestamp" : "25:34-25:42",
    "speaker" : "Announcer",
    "text" : "Well I d I just like I respect that. Coach obviously you cut it to seven, that big drive, and then a huge reversal momentum. Yeah, that's dumb on my part."
  },
  {
    "text" : "He couldn't wait to to get it out. He was like, that's dumb on my part kicking the ball deep.",
    "timestamp" : "25:43-25:49",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Tony Dungy",
    "text" : "One more time. Yeah, that's dumb on my part kicking the ball deep. Yeah, that's dumb on my part kick In a ball date, why you loving",
    "timestamp" : "25:49-25:56"
  },
  {
    "text" : "Shoot that um all right well there's not this like Tony Dudgey and hearing him be like yeah's dumb on my part.",
    "speaker" : "Andy",
    "timestamp" : "25:56-26:02"
  },
  {
    "timestamp" : "26:02-26:07",
    "speaker" : "Greg",
    "text" : "I'm pretty sure Andy just watches sports not to like root for teams but to root against teams."
  },
  {
    "timestamp" : "26:07-26:10",
    "speaker" : "Andy",
    "text" : "Yeah uh I root against individuals actually."
  },
  {
    "text" : "I could give a I couldn't care less about the Is it any individual that's not of the Patriots? Is that how you classify? Um categorize?",
    "timestamp" : "26:11-26:18",
    "speaker" : "Greg"
  },
  {
    "text" : "Not any, but they all seem to be not on the Patriots.",
    "speaker" : "Andy",
    "timestamp" : "26:19-26:21"
  },
  {
    "speaker" : "Greg",
    "text" : "A large majority, we'll say that. All right. But if see if Doug Pearson had said that same exact quote, he'd have a job right now. Okay. If you just came out and said, you know what? That was dumb on my part. Everybody would have been like, okay, I get it. Yeah, fair enough. We all make mistakes.",
    "timestamp" : "26:22-26:43"
  },
  {
    "timestamp" : "26:43-26:44",
    "text" : "Moving on.",
    "speaker" : "Andy"
  },
  {
    "text" : "That's the true.",
    "timestamp" : "26:44-26:44",
    "speaker" : "Tony Dungy"
  },
  {
    "timestamp" : "26:45-26:56",
    "text" : "Didn't happen though. So yeah, so I mean so now it's 2410 Patriots at halftime instead of 1710 and and like that just took the air out of the place.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:57-27:01",
    "speaker" : "Greg",
    "text" : "Yeah, do you see the Patriots fans in the in the crowd going wild?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:01-27:02",
    "text" : "Like seven of them."
  },
  {
    "speaker" : "Greg",
    "text" : "Is there a better feeling than being an away fan and with like a backbreaking play like that where the whole stadium's like fuck? And you're just like",
    "timestamp" : "27:03-27:11"
  },
  {
    "speaker" : "Andy",
    "text" : "Dropping trout, just moon in the crowd.",
    "timestamp" : "27:15-27:16"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know. Moon is like real intense and everyone's drunk as shit. It's like, and at the end of the game, too. Yeah.",
    "timestamp" : "27:17-27:23"
  },
  {
    "text" : "Sketch.",
    "timestamp" : "27:23-27:24",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, that's sketchy. Dumb fake spike from Rothesburg. He felt on the end of the game at Pittsburgh. They were so mad.",
    "timestamp" : "27:24-27:34"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, that had the added anger of the the Jesse James touchdown they took off the board.",
    "timestamp" : "27:34-27:40"
  },
  {
    "timestamp" : "27:43-27:46",
    "text" : "Yeah, that was that was beautiful too. I can't wait to get to that one.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:47-27:52",
    "speaker" : "Greg",
    "text" : "But it's such a it's such a roller coaster of emotions where you're bummed out, everybody around you is happy."
  },
  {
    "speaker" : "Steve",
    "text" : "And then in 12 seconds, you're ecstatic and everybody else's and you're just like roller coaster, kicks that up, incline, theirs just drops out from underneath them. Oh beautiful.",
    "timestamp" : "27:52-28:04"
  },
  {
    "timestamp" : "28:04-28:10",
    "speaker" : "Greg",
    "text" : "And I mean it's a huge difference, right? Instead of 17, 10 going to the half, it's 24 to 10. Right. It's a whole different game."
  },
  {
    "text" : "Yep. And then the Patriots stop the Colts first drive and then score another touchdown. And so now it's it's 31-10 and you know we're two drives into the into the second half. Warm up the bus. Yep. And then literally the next drive, uh, Manning threw another interception. And this is where like it started to feel for me like how is this so close? Because Yeah, now that was like two plays later. So the the Pages up 30 with nothing and they're they're like harassing Manning and he's thrown his you know his it's his second turnover of the game.",
    "timestamp" : "28:10-28:44",
    "speaker" : "Andy"
  },
  {
    "text" : "And it's getting cloudy out there.",
    "timestamp" : "28:44-28:46",
    "speaker" : "Steve"
  },
  {
    "text" : "He's nervous.",
    "timestamp" : "28:46-28:47",
    "speaker" : "Andy"
  },
  {
    "text" : "He was looking shook. Yeah, he was.",
    "timestamp" : "28:48-28:50",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Multiple touchdown games. Really getting dark cloudy out there, you know?",
    "timestamp" : "28:50-28:54"
  },
  {
    "speaker" : "Andy",
    "text" : "Is there a storm brewing? Because there's a lot of clouds gathering.",
    "timestamp" : "28:56-28:59"
  },
  {
    "timestamp" : "28:59-29:00",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "Hey, hey, you, you, get off of my cloud.",
    "timestamp" : "29:01-29:04",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:06-29:09",
    "speaker" : "Greg",
    "text" : "Good one. I had to look that that's a bermanism."
  },
  {
    "text" : "That is a bermanism. Okay.",
    "speaker" : "Andy",
    "timestamp" : "29:09-29:10"
  },
  {
    "text" : "It's a Rolling Stones song apparently. Yeah.",
    "timestamp" : "29:10-29:12",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh, you don't know the song?",
    "timestamp" : "29:13-29:14",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:14-29:17",
    "speaker" : "Greg",
    "text" : "Well, I do now. I looked up. Good."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh yeah, so the Patriots have first and ten at the Indianapolis thirty. Like already inside field goal range, up 31 to 10. Six minutes left in the third. Yeah. You're like, if yeah, this game's over. They're getting points. We're we're",
    "timestamp" : "29:18-29:34"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "29:35-29:35"
  },
  {
    "timestamp" : "29:35-30:13",
    "text" : "Yeah, a field goal in this game's done. Like any anything. In fact, you could just like run the clock out and run it to the one and and get stopped, and it's fine. But Brady throws an exception two plays later and so like it's like never even happened. Whoops. And then the Colts start rolling Um they're they're at this point they're pulling all the stops because you have to, right? You're down fucking three touchdowns in the third. So they're going for it on like fourth and nine and converting. Um eventually Manning throws uh touchdown to Wayne. And I think that was that the one one of these one of one of these were uh were really good those uh really",
    "speaker" : "Andy"
  },
  {
    "text" : "The the that the the Wayne one was a little toe tap in the corner of the end zone. It was a nice catch.",
    "timestamp" : "30:15-30:20",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "30:21-30:22",
    "speaker" : "Andy",
    "text" : "Oh no, that's not the one I'm thinking of, yeah."
  },
  {
    "timestamp" : "30:22-30:25",
    "speaker" : "Steve",
    "text" : "You're thinking of the drop in the bucket to Marvin Harrison in the back corner?"
  },
  {
    "speaker" : "Andy",
    "text" : "Maybe it was one where it like it looked like it was gonna be a quick slant and then he got to the middle field and took straight off up the seam instead.",
    "timestamp" : "30:25-30:32"
  },
  {
    "speaker" : "Steve",
    "text" : "And Eugene Wilson went the wrong way both times and one Manning just overthrew him, the second one, he made it. It was the exact same route.",
    "timestamp" : "30:36-30:43"
  },
  {
    "timestamp" : "30:44-30:58",
    "speaker" : "Greg",
    "text" : "So yeah, so this is. Manning was so good. He was. He was so fucking good, man. Yep. Cause I you remember this feeling too of what playing against Manning where you'd be like, oh boy. Let's jump 312."
  },
  {
    "timestamp" : "31:03-31:04",
    "speaker" : "Steve",
    "text" : "And then we're going to be able to do that."
  },
  {
    "timestamp" : "31:04-31:11",
    "text" : "Similar to Patrick Mahomes this year or lately. Mahomes is like the same way. We have to score here because we're only up three touchdowns.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:11-31:17",
    "text" : "Brady was the same way though, you know? But I think we down to be like, oh Brady'll figure it out. He'll figure out what they're doing and we'll get it going."
  },
  {
    "text" : "Yeah. Yeah, I suppose that's true. I think Mahomes and Manning have more of like the This could all fall apart really fast. Yeah. Like it could be like two touchdowns in four plays.",
    "timestamp" : "31:18-31:30",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, don't let them score once because once they score, like you've opened the floodgate sort of thing. Whereas Brady was always just like, Brady will He'll never really get down by that much because he'll always find a way to just like claw back and hang in there until the end.",
    "timestamp" : "31:31-31:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:45-31:58",
    "text" : "You know? I mean Brady always got I think Brady does get the Lucky plays a little bit and not lucky plays, but turnovers and like help from the defensive special teams to even in this game, a bunch of bigger turns from Bethel, you know, to build them out as some dumb picks.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I mean this was still early in his career, so he was still throwing those dumb picks, but like when's the last time you remember him doing that recently? Like he doesn't throw those anymore.",
    "timestamp" : "31:59-32:10"
  },
  {
    "timestamp" : "32:11-32:24",
    "text" : "But like I feel like you can never really count Brady out no matter how much even like the Atlanta Super Bowl though the other one that comes to mind is the Bills, you know, where they're up a ton in the fourth quarter and McKelvin fumbles a kickoff return when he could take a knee. Like there's a bunch of other shit around that game.",
    "speaker" : "Steve"
  },
  {
    "text" : "The Broncos or the 49ers one, it was the same, it just didn't break their way. Right. Remember against Kaepernick on that Monday night?",
    "timestamp" : "32:24-32:30",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. That game was ridiculous too. Yeah. Um But yeah, uh, but you know, but this game was the opposite. Brady gets the ball back and immediately throws another pick. Oh, what the fuck? And then Manning. I think it was on the first play, throws another touchdown to Harrison. That's what you're talking about where Eugene gets beat. Yeah. And so that's 14 points in Like four plays. Yeah. Like total, including the pages plays. You're like, ah shit. Um, and now we're in the fourth quarter and it's 3124 instead of 3110. And the crowd is fucking into it. Especially when the Patriots go three and out and Manning again drives them down, scores another touchdown, and it's Tie game?",
    "speaker" : "Andy",
    "timestamp" : "32:30-33:21"
  },
  {
    "text" : "31 31-31. That's another, it's just crazy. Like you go, how how do you lose a 31-10 game with six minutes left in the third? They lost it with 10 minutes left in the fourth. Yeah. Yeah. It's a tie game by this playing time.",
    "timestamp" : "33:22-33:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Tie tie game after two drives in the f in the fourth quarter.",
    "timestamp" : "33:37-33:39"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "33:40-33:40"
  },
  {
    "timestamp" : "33:40-33:56",
    "speaker" : "Andy",
    "text" : "It's uh it's unbelievable. This this Colts team was like that though. Yeah. But then back to Steve's point, like, you know, Manning scores out touchdown and tie it, and the Colts decide, yeah, you know what we're gonna do? We're gonna kick it a Battle Johnson. And he does exactly the same fucking thing and takes it sixty-eight yards. Big Johnson."
  },
  {
    "speaker" : "Steve",
    "text" : "So I I'd mix that up. I thought Did Beth must have had a big return in the first half too. He must have had three big returns. Because I thought this return was that one. Watching the highlights. He must have had three because Mike said he says it the in the half, like that was a dumb mistake because I think Beckley already had a big return like in the first quarter or so. And he knows that he had a big return. That's why it's dumb of him to kick it to him again to give him a second chance in the first half to have another big return. And then he kicks it to him again in the fourth quarter and he has another big return.",
    "timestamp" : "33:56-34:25"
  },
  {
    "timestamp" : "34:25-34:26",
    "speaker" : "Andy",
    "text" : "Yeah, no, I think you're right."
  },
  {
    "timestamp" : "34:26-34:34",
    "speaker" : "Greg",
    "text" : "I think uh I think he did have He had five returns for 192 yards. He averaged almost 40 yards a return"
  },
  {
    "text" : "Yeah, a three big boy God.",
    "timestamp" : "34:35-34:37",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:38-34:41",
    "text" : "Yeah, that's a lot. He's the man. He was awesome.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:41-34:48",
    "text" : "Uh yeah, I don't he didn't really have any returns in the first half. Because the Colts didn't score. So"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "34:48-34:50",
    "text" : "Stop fact-checking Andy. No one cares."
  },
  {
    "timestamp" : "34:51-34:54",
    "text" : "Fact check. That's a lie. That's the only thing remember.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Take off number one. Oh, never mind. No games.",
    "timestamp" : "34:55-34:57"
  },
  {
    "timestamp" : "34:58-35:39",
    "text" : "Uh I told you. Um so yeah, so the Patriots are set up to start at the Colts 32, which is uh, you know, a big day, but this time Brady finds branch for a touchdown. And now We're actually like now that like shit's just like f all over the place. Just all over the place. And actually Um Brady could you could have actually credited him with uh one of the earlier Mike Cloud touchdowns because It was a touchdown, but they ruled it out of bounds and the page didn't challenge it. I think it was a Maybe DJ Ward or JJ Stokes. It was JJ Stokes.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:40-35:41",
    "text" : "I was freaking pissed about that."
  },
  {
    "timestamp" : "35:41-35:45",
    "speaker" : "Greg",
    "text" : "I know, like add him to the list of the Brady touchdown guys."
  },
  {
    "text" : "Yes, that would have been a good thing.",
    "timestamp" : "35:45-35:46",
    "speaker" : "Steve"
  },
  {
    "text" : "That'd be a f that'd be a deep cut on that list, which is a bummer.",
    "timestamp" : "35:46-35:49",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "And he caught one. He definitely it was a clear cat.",
    "timestamp" : "35:50-35:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Why they yeah, how they even ruled that out of bounds in the first place is beyond because the guy was sitting there, the referee was watching all the way through. And there was like no r any reason. But then the the Pagers didn't even challenge it because they had the ball at the one for whatever reason. And uh I think it was like, oh, there was I think it was a pass interference call on the play anyway In the end zone, so they just gave it to him on the ones the page just like, yeah, fuck it, we'll just run it in.",
    "timestamp" : "35:53-36:15"
  },
  {
    "speaker" : "Steve",
    "text" : "And then he almost through pick the next, there's like a tip ball in the next play.",
    "timestamp" : "36:15-36:18"
  },
  {
    "timestamp" : "36:18-36:19",
    "speaker" : "Andy",
    "text" : "Yeah, yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "In between that Mighty Cloud TD run and that definite TD from JJ Stokes, they almost turned it over.",
    "timestamp" : "36:19-36:24"
  },
  {
    "text" : "Yeah, and that and that there could have changed the game too. So a little bit more luck here. Yep. But uh the Patriots, again, you know, so they're they're up again by a touchdown, um, and then they hold the Colts. They stop on fourth and one. Um then what happens, Andy? Actually, no, they didn't. Yeah, and then I don't even want to say it because I feel like I'm League MVP. Yeah, no, uh Dynasty MVP. Kevin Falk makes a rare A rare mistake.",
    "speaker" : "Andy",
    "timestamp" : "36:24-36:58"
  },
  {
    "timestamp" : "36:58-37:00",
    "speaker" : "Steve",
    "text" : "I thought it was just seasoned MVP."
  },
  {
    "speaker" : "Andy",
    "text" : "No, early, early dynasty MVP.",
    "timestamp" : "37:00-37:02"
  },
  {
    "text" : "Oh, I didn't know you were saying he's he's the MVP of the whole early dynasty.",
    "timestamp" : "37:02-37:06",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "37:06-37:06"
  },
  {
    "text" : "That seems rich.",
    "timestamp" : "37:07-37:08",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "37:09-37:10",
    "text" : "Give me give me somebody else.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "37:11-37:16",
    "speaker" : "Greg",
    "text" : "Teddy Bruce as in Rich as in like hilarious. Tom Brady."
  },
  {
    "timestamp" : "37:19-37:23",
    "text" : "Maybe. Maybe. Without Kevin Falk, Tom Brady doesn't put up those numbers.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:23-37:24",
    "text" : "Okay, but he fumbles, right?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. Well yeah, Page is starting at their own eight and he fumbles.",
    "timestamp" : "37:24-37:28"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "37:29-37:29"
  },
  {
    "text" : "So absolutely. The Colts starting at the New England 11 go three and out and settle for field goal though.",
    "speaker" : "Andy",
    "timestamp" : "37:29-37:35"
  },
  {
    "timestamp" : "37:35-37:37",
    "speaker" : "Steve",
    "text" : "And not great, Phil."
  },
  {
    "speaker" : "Andy",
    "text" : "Not great. Not great.",
    "timestamp" : "37:37-37:38"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:38-37:43",
    "text" : "Yeah. The announcement's like, we're definitely going for the touchdown here, right?"
  },
  {
    "timestamp" : "37:46-37:55",
    "text" : "And uh noted athlete, uh Vanderjacks kicks a a field goal to stay perfect on the season. Um I watched that highlight while we're talking.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "37:55-38:02",
    "speaker" : "Steve",
    "text" : "He definitely thought he could tackle Bethel Johnson and then realized about the 30 yard line that Bethel's way too fast."
  },
  {
    "timestamp" : "38:02-38:03",
    "speaker" : "Andy",
    "text" : "Oh yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah he he's running for it but he gets his hips turn so he comes back around a little bit I'll just catch him on the angle.",
    "timestamp" : "38:04-38:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Nope. Nope. Nope. There's no angle that that works out that you're gonna catch him. Uh but yeah, so I mean that was a huge stop by the defense number one because you're still up a touchdown and but you know, you you're starting on a short field. The Colts are starting on your eleven yard line and to hold the Colts to a three and out and make 'em kick a field goal. So now it's 3834. Um and so the page at this point are just like, fuck it, we're just gonna run the clock, right? They're doing whatever they can. Uh actually no, they weren't running the clock. They were like they should have, because there was uh only a few minutes left, right? But they came out throwing it with like five wide.",
    "timestamp" : "38:09-38:46"
  },
  {
    "text" : "Yeah, another suspect decision by Belichick.",
    "speaker" : "Greg",
    "timestamp" : "38:47-38:50"
  },
  {
    "timestamp" : "38:50-38:56",
    "text" : "A little strange. Uh I'd say Charlie Weiss, but yeah, okay. Um and then he throws",
    "speaker" : "Andy"
  },
  {
    "text" : "Brady throws what that would have been the worst pick I've ever seen Brady throw. Hits a guy directly in the hand. Uh a linebacker directly in the chest. Between the numbers, the guy drops it. With nobody with a fighter million yards of him. Yeah, real bad. And you're trying you're holding on to a four-point lead with fucking two minutes left. Like, what the fuck are you doing?",
    "speaker" : "Greg",
    "timestamp" : "38:57-39:17"
  },
  {
    "text" : "And the only reason it's a four-point lead is because your defense held after your last turn turnover when they saw on the 11-yard line.",
    "timestamp" : "39:18-39:25",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "39:25-39:37",
    "speaker" : "Steve",
    "text" : "Yeah, and they cut the they haven't cut a Belcheck here and he looks worried. The most maybe the most worried I've ever seen Belchak on the sideline was this guy here. He's like, oh shit. We're about to give the ball back to Baton Manage."
  },
  {
    "timestamp" : "39:37-39:43",
    "speaker" : "Andy",
    "text" : "It it felt a lot like the uh fourth and two game. Yeah, yeah. Like you just can't give the ball back to Manning."
  },
  {
    "timestamp" : "39:43-39:48",
    "speaker" : "Steve",
    "text" : "Yeah. Um maybe this this maybe maybe yeah, this had something to do with that. I bet it did."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. And you know what? Maybe this has something to do with what they do against the Seahawks, you know?",
    "timestamp" : "39:48-39:54"
  },
  {
    "text" : "Yeah. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "39:54-39:55"
  },
  {
    "timestamp" : "39:55-40:03",
    "speaker" : "Greg",
    "text" : "Where instead of like, okay, let's try and like let them score or whatever, it's like, all right, let's make a stop deal, you know? Yep."
  },
  {
    "timestamp" : "40:03-40:11",
    "speaker" : "Steve",
    "text" : "And like to keep the pressure on because like these are like pretty high pressure like play calls and all that. Just definitely getting down to it. Oh yeah."
  },
  {
    "text" : "Um but uh speaking of Charlie Weiss, I I was thinking about this the other day, kind of as I was watching this and like through these few seasons. And I forgot how kind of exciting I guess the play calling was. Like Charlie Weiss used to call a shit ton of trick plays and like all sorts of like gadgets and just like movement all over the place. He never really knew what's happening. So I was thinking, how would you rank Tom Brady's offensive coordinators? So you've got you've got four. You've got Charlie Weiss, Bill O'Brien, Josh McDaniels, and Byron Leftwich.",
    "timestamp" : "40:12-40:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "40:45-40:48",
    "speaker" : "Steve",
    "text" : "Okay, Byron Left was Byron Left?"
  },
  {
    "text" : "Yeah, yeah, yeah.",
    "speaker" : "Andy",
    "timestamp" : "40:48-40:48"
  },
  {
    "timestamp" : "40:49-40:53",
    "text" : "I could barely say that without I think Byron Left, which is good.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Wait, our offensive coordinator.",
    "timestamp" : "40:54-40:55"
  },
  {
    "timestamp" : "40:56-41:05",
    "text" : "Wait, I thought fucking what's his name was? Who? Eric Bianami. He's the Chiefs offensive coordinator. Oh yeah, okay. Idiot.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "41:05-41:09",
    "speaker" : "Steve",
    "text" : "Wait, wait, wait, wait, wait. I'm still running on Byron left which was the OC of the Patriots?"
  },
  {
    "text" : "Nope. No, but",
    "timestamp" : "41:09-41:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Who cares? Fuck him. Yeah. We've only had three offensive coordinators. Yeah. Yeah.",
    "timestamp" : "41:15-41:21"
  },
  {
    "timestamp" : "41:21-41:25",
    "text" : "McDaniels has been there forever. I mean you have to say McDaniels is the best one, right?",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I'm with Greg. And then obviously Weiss and then Bob at the back.",
    "speaker" : "Steve",
    "timestamp" : "41:26-41:32"
  },
  {
    "timestamp" : "41:32-41:48",
    "speaker" : "Andy",
    "text" : "Yeah, I put I put Bill O'Brien at the bottom. Well, just above Byron Lefwich. Is it any offensive coordinator that's not really Byron Lefich's offense, let's be real. Oh, I think it isn't the fact that they run it directly up the middle on first down."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "41:48-41:54",
    "text" : "It's just every single time. Maybe."
  },
  {
    "text" : "People like Bayern Leftwish though.",
    "speaker" : "Greg",
    "timestamp" : "41:58-42:00"
  },
  {
    "text" : "Yeah, I'm not saying he's a bad coach, but I'm saying at this point it's Brady's offense.",
    "speaker" : "Steve",
    "timestamp" : "42:00-42:04"
  },
  {
    "speaker" : "Greg",
    "text" : "Why? I don't know. Maybe he's a good coach, Andy. Did that ever cross your mind? No.",
    "timestamp" : "42:04-42:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, yeah, but then I I saw his game plans and that quickly left my mind.",
    "timestamp" : "42:09-42:15"
  },
  {
    "speaker" : "Greg",
    "text" : "What game plans? What you a fucking X and O's guy? All right, let's watch the fucking I watch y'all twenty-two's baby. You watch y'all 22s and he's Byron left which Didn't even recognize a cover. Didn't even adjust to the cover too.",
    "timestamp" : "42:16-42:31"
  },
  {
    "speaker" : "Andy",
    "text" : "Fucking idiot.",
    "timestamp" : "42:32-42:33"
  },
  {
    "timestamp" : "42:37-42:42",
    "speaker" : "Steve",
    "text" : "Did you see that video of Mike Vanderjack waving the towel around? Acting it up on the sidelines."
  },
  {
    "text" : "No.",
    "timestamp" : "42:43-42:43",
    "speaker" : "Andy"
  },
  {
    "text" : "Right at this time. Right when they kick it back and they and the Colts get the ball back. Really? After the Patriots just throw it three times. There's a little clip of Mike Van Jack, you know, playing a little cheerleader on the sideline. Fucking cool. With his earrings in. Yeah. Oh yes.",
    "timestamp" : "42:43-42:56",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Those huge fucking studs that he plays football with.",
    "timestamp" : "42:57-42:59"
  },
  {
    "speaker" : "Steve",
    "text" : "He looked like he was about to go to the club. He was gonna drop his shoulder pads off and club real quick. Getting some tight leather. Let's go.",
    "timestamp" : "42:59-43:06"
  },
  {
    "text" : "Yeah, so this, but this is speaking of leather, this is where this is where the the rubber hits the road. Um So Patriots thankfully don't have an interception and have to punt it. But not a great punt again because you know this is Ken Walter.",
    "speaker" : "Andy",
    "timestamp" : "43:07-43:24"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:25-43:27",
    "text" : "Ken Walter, fuck you, is my note."
  },
  {
    "text" : "What do I have? My note is can't pun it out of his own half from the 20. 18 yards. I know how this game ends and I'm still livid. Like I was like my blood pressure was rising at this point. I knew they won this game. I'm still like, you gotta be fucking kidding me. 18 yards at this fucking moment. You can't you're giving uh fucking Peyton Manning, who scored three touchdowns and three drives, uh, the ball with 257 left at the New England 48 is where this drive started. You want to start, Jay?",
    "timestamp" : "43:27-44:02",
    "speaker" : "Andy"
  },
  {
    "text" : "Never make it this easy. That's like fucking Yeah. That that quote from Pete Carroll in the Super Bowl. Yeah. You know what I'm talking about? When the mic up when they're when he says to Russell Wilson, he's like got two minutes left, 50 yards. They never make it this easy. I fucking I love that quote.",
    "timestamp" : "44:03-44:21",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean it's there. I mean I bet they practice it all the time, two minute drill, and they usually make it a lot harder than that.",
    "timestamp" : "44:22-44:26"
  },
  {
    "speaker" : "Greg",
    "text" : "I know, but just the Pete Carroll, I'm the optimist, isn't it? This is gonna be great. It's just it it warms my heart to see his just completely shattered. Yeah.",
    "timestamp" : "44:27-44:36"
  },
  {
    "text" : "To watch him fail when he's that positive.",
    "timestamp" : "44:37-44:39",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, yeah, yeah. I like being a big Everybody knows that guy at work, you know? The one that's just like, come on guys, if we all pull together, we can do this. Like shut me up, eh guys. This sucks, dude. Don't try to cheer me up. It makes me even more mad.",
    "speaker" : "Greg",
    "timestamp" : "44:40-44:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Just just look for the silver lining, guys.",
    "timestamp" : "44:55-44:57"
  },
  {
    "speaker" : "Steve",
    "text" : "See, I'm not look at all the stuff we're learning. I'll be that guy in your life. How about that? Just so you get it outside of work too.",
    "timestamp" : "44:58-45:04"
  },
  {
    "text" : "Yeah, but Steve, I know you don't mean it. I know in your heart of hearts you're a pessimist. No way.",
    "speaker" : "Greg",
    "timestamp" : "45:04-45:10"
  },
  {
    "timestamp" : "45:11-45:15",
    "speaker" : "Steve",
    "text" : "I have fucking an optimistic phrase tattooed on my body."
  },
  {
    "text" : "Yeah, sing it to us. That's a good sing.",
    "timestamp" : "45:15-45:18",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "45:19-45:21",
    "speaker" : "Steve",
    "text" : "Let the bodies hit the floor."
  },
  {
    "speaker" : "Andy",
    "text" : "Let the bodies hit the floor Oh, I didn't see that coming. Nicely done.",
    "timestamp" : "45:24-45:30"
  },
  {
    "speaker" : "Greg",
    "text" : "Some stab your granny music.",
    "timestamp" : "45:31-45:32"
  },
  {
    "timestamp" : "45:33-45:35",
    "text" : "They're fucking right, stab your granny music. Hmm.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "For those listeners at home, if you had to guess a genre of music that Andy likes, how would you think it would be?",
    "timestamp" : "45:35-45:44"
  },
  {
    "timestamp" : "45:47-45:51",
    "text" : "I don't know what you're getting at, Greg. Yeah. Explain yourself.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Delighted referred to as stab your granny music.",
    "timestamp" : "45:51-45:54"
  },
  {
    "text" : "Yeah. Which is what one of my roommates called it when I",
    "speaker" : "Andy",
    "timestamp" : "45:55-45:59"
  },
  {
    "text" : "I learned what I listened to. I still make my playlists called Stabby Creative Music every time I put one together. It's well put.",
    "timestamp" : "46:00-46:09",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Peyton Manning is the uh guy in Scream and the rest of the grannies in the house are the Patriots defense. No.",
    "timestamp" : "46:09-46:16"
  },
  {
    "speaker" : "Andy",
    "text" : "I didn't I didn't follow that. No, that was the bridge too fast.",
    "timestamp" : "46:16-46:19"
  },
  {
    "speaker" : "Steve",
    "text" : "Five yards, Reggie Wayne 13 yards. It's about to be the two-minute warning, hurries them up, runs a draw play, which great idea. They never make nine yards. So they're starting the two-minute warning. Yeah. Second and one from the Patriots 21. Yeah. Need a touchdown to win. Yeah.",
    "timestamp" : "46:22-46:42"
  },
  {
    "timestamp" : "46:43-46:58",
    "speaker" : "Greg",
    "text" : "It's really the timeouts. Box game all over again where it's like You go from trying to come back to like what maybe we should burn more time. You know? Yeah. Yeah. So that those are I love those coaching decisions. Those are tricky."
  },
  {
    "text" : "Oh, wicked hard. Yeah. Do we let him score and try and get the ball back and give us a big thing?",
    "speaker" : "Steve",
    "timestamp" : "46:58-47:02"
  },
  {
    "timestamp" : "47:02-47:08",
    "speaker" : "Greg",
    "text" : "Well you're like, do we just do we just take the score? Yeah. Or do we like, you know, try and burn some clock here?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:09-47:10",
    "text" : "Uh you take the screen."
  },
  {
    "text" : "I feel like you get that a lot in the game. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "47:10-47:12"
  },
  {
    "timestamp" : "47:12-47:40",
    "speaker" : "Andy",
    "text" : "Spoiler, you take the score and then you fucking you squib kick it so that fucking Bethel Johnson doesn't return it. You let Brady for another pick. That's what you do in this situation. It's true. Or or if you're fucking uh Tony Junji, which um you know what what does he have to say about it for himself, I wonder. We have a post-game quote from Is it dumb on my part? Thanks for ruining it, Greg. Thanks, Greg."
  },
  {
    "timestamp" : "47:40-47:42",
    "speaker" : "Tony Dungy",
    "text" : "Coach obviously you cut it to some momentum."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh so yeah he didn't uh he he didn't just go for the score. But I I think To exonerate him, I don't think he had anything to do with this last uh this last little bit. This is all paint manning.",
    "timestamp" : "47:50-48:01"
  },
  {
    "text" : "His he has a ball on the 21 with",
    "timestamp" : "48:02-48:06",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "48:06-48:07",
    "text" : "From a play card.",
    "speaker" : "Andy"
  },
  {
    "text" : "He has a timeout in two minutes to gain 20 yards and score touchdowns. I mean that's like a at this point the way they've been playing the second half, they've been zipping and zapping it all over the field, it's kind of like a fun deal.",
    "timestamp" : "48:08-48:18",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And they drive right down to the one yard line.",
    "timestamp" : "48:18-48:21"
  },
  {
    "timestamp" : "48:21-48:27",
    "speaker" : "Steve",
    "text" : "So they're at nine yards of Marvin Harrison, edge up the middle for seven yards. Yeah. One yard run."
  },
  {
    "timestamp" : "48:27-49:18",
    "text" : "Yeah. So now now it's First single from the New England two-yard line, 40 seconds left. So you got four bangs at this. And uh they kind of, I mean, Manning had some excuses after the game, which we'll get to. But first and goal from New England 2. The Colts run up, uh quick snap, run to the right, and it gets stopped. Um and then they line right back up. Quick snap, run straight up the middle, get stopped again. Then they call a timeout. Third and goal from the one still, 18 seconds left. And at this point, uh after the game, Manning was talking about how it was uh the fault of injuries. Like the injuries is the reason they didn't score here. Uh where is it?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "To be fair, I like his call on the two quick runs. Like you got him on their heels a little bit. You know, you're on the one yard line. It's down there. You just run it real quick and see if you get it in.",
    "timestamp" : "49:18-49:27"
  },
  {
    "speaker" : "Andy",
    "text" : "That's what Brady does. Yeah, you you run to the line and don't let the the defense the defensive line like get set up and get like dug in and you just snap the ball real quick and they did it twice and didn't work. Great, fine. Doesn't work. But um The quote from Manning after game was sometimes we've done things like that in the past when we've just punched in before they the defenders have a chance to get set, Manning said. We got down to the one and I called the timeout thinking we're going over the side and that we're gonna go get into our goal line offense. But when I got over there, we didn't have a goal line offense because the whole team is hurt. We had no fullback and no tight end. That's what it came down to. We had no personnel options. We had to stay with our three-wide offense due to injuries.",
    "timestamp" : "49:27-50:11"
  },
  {
    "timestamp" : "50:13-50:21",
    "speaker" : "Steve",
    "text" : "Even the case. Your fucking play call can't be throw the fade to Moorhead."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, yeah. That might be worse than than throwing a slant with bug in.",
    "timestamp" : "50:22-50:29"
  },
  {
    "speaker" : "Steve",
    "text" : "Morehead and throw, you deserve to lose.",
    "timestamp" : "50:29-50:31"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:33-50:37",
    "text" : "Yeah, not a good decision, but I guess he was the tallest receiver."
  },
  {
    "timestamp" : "50:39-50:59",
    "text" : "But and if you're gonna throw that, you do that on this This quick down, right? You run on first down, you run up like you're gonna snap, and you get these guys going, okay, let's make sure we don't give up this quick run touchdown. And then you fool them by throw if you call a timeout and then you come out with the fade. Like that doesn't work that way, you know? Right.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because they're they're prepped for it. Like that that defensive backup on that on on that corner. knows, you know, it's just me and him. I can uh you can sit there and get ready for and prepare himself for a fate or a slant or whatever.",
    "timestamp" : "50:59-51:14"
  },
  {
    "timestamp" : "51:14-51:22",
    "speaker" : "Steve",
    "text" : "Aaron Moorhead, the rookie. Who ends the season with seven catches for 101 yards? Let's throw him the fade. Yeah, why the fuck down?"
  },
  {
    "text" : "That's my off a t off a timeout Right. Yes, you were injured, and you have to do it. You have Reggie Wayne, Marvin Harrison, Pollard, and Edrian James.",
    "speaker" : "Greg",
    "timestamp" : "51:23-51:35"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:35-51:36",
    "text" : "You can catch your boy."
  },
  {
    "timestamp" : "51:36-51:41",
    "speaker" : "Greg",
    "text" : "That's a great point, Steve. That is a ridiculous call and throw a phase."
  },
  {
    "timestamp" : "51:41-51:45",
    "speaker" : "Andy",
    "text" : "I think it's because he's 6'3, 200 pounds. Still."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, he's tall, just from the fake. Greg, you have said this earlier in this podcast about how that is the dumbest call in the NFL. Yeah. I hate it. Now since you said that I'm so on your boat because Their chance their success is not that good.",
    "timestamp" : "51:46-51:59"
  },
  {
    "speaker" : "Andy",
    "text" : "The only time you ever see a success is uh when you throw it to Rob Gronkowski",
    "timestamp" : "51:59-52:05"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "52:06-52:06",
    "text" : "Yeah."
  },
  {
    "timestamp" : "52:06-52:09",
    "text" : "Because he's just massively bigger than everybody covering him.",
    "speaker" : "Andy"
  },
  {
    "text" : "Linebacker. You know, a receiver on a cornerback?",
    "speaker" : "Steve",
    "timestamp" : "52:09-52:11"
  },
  {
    "timestamp" : "52:11-52:23",
    "speaker" : "Greg",
    "text" : "Yeah, oh yeah. But even then it always looks difficult. Yeah. Like even when Gronk would catch him, it'd be like, whoa, that was a tough catch. Or it's always a circus catch."
  },
  {
    "text" : "You're right. Yeah. I agree. So it's fourth and one, 14 seconds left. Oh, oh, we didn't even mention the fact that um earlier on in this drive, I think, I don't remember exactly when it was, but Willie McGuinness goes down hurt.",
    "timestamp" : "52:23-52:40",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "52:40-52:45",
    "speaker" : "Steve",
    "text" : "Yeah, let's so really make us stop. Does the run."
  },
  {
    "timestamp" : "52:46-53:10",
    "text" : "Yeah. Uh was he well He said he had cramps and Belichick said he had a knee problem. He had a knee issue after the game. They were the the cramps. They get on the same page on that one. Fucking it didn't fucking matter. So but he he recovered in time, um, because this was not part of these four plays, I don't think it was it was earlier in the drive.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I think it might have been right before they called the timeout when they tried to do those first two quick runs. I don't know if he was in there or not.",
    "timestamp" : "53:10-53:16"
  },
  {
    "timestamp" : "53:17-53:28",
    "speaker" : "Andy",
    "text" : "He wasn't, no. Because I wrote down, yeah, they Matt Chatham was in there instead And so I think the first play they ran at Matt Chatham and Brewski made the tackle."
  },
  {
    "text" : "Brewski made both those tackles.",
    "timestamp" : "53:28-53:30",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:30-53:32",
    "text" : "He did. Yeah. On the first and the second down play."
  },
  {
    "text" : "That's what I'm saying. Low-key MVP. Brewski.",
    "timestamp" : "53:33-53:36",
    "speaker" : "Steve"
  },
  {
    "text" : "He's solid.",
    "timestamp" : "53:36-53:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh I did like change I did change that rule. Because those should have been quarterback and runs and even Manning said, you know, in his postgame, we've had a lot of success doing that.",
    "timestamp" : "53:37-53:49"
  },
  {
    "text" : "Yep.",
    "speaker" : "Andy",
    "timestamp" : "53:49-53:50"
  },
  {
    "text" : "Teddy's playing eye tower and making the clutch runs back to pack plays.",
    "speaker" : "Steve",
    "timestamp" : "53:50-53:54"
  },
  {
    "timestamp" : "53:54-54:14",
    "speaker" : "Andy",
    "text" : "Right, yeah. And I like that the um The commentators are talking about how Teddy Bruski was the first small linebacker to have success in the NFL. Yeah. A fucking small Teddy Bruski. Teddy Bruski was 6'1, 247. So he's not tall."
  },
  {
    "timestamp" : "54:15-54:21",
    "speaker" : "Steve",
    "text" : "He's bigger than that. Actually, it's pretty light. He's lighter than I thought he would be"
  },
  {
    "text" : "I mean 247? Yeah.",
    "timestamp" : "54:21-54:23",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That's not light, dude.",
    "timestamp" : "54:23-54:25"
  },
  {
    "timestamp" : "54:25-54:29",
    "speaker" : "Steve",
    "text" : "But like generally guys now are like 6'2, 6'3 in that weight"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. So I mean, but I I guess he was kind of like small uh uh uh compared to the linebackers before that, you know, the Willie McGuinness, if you will. These big fucking the Ted Johnsons of the league, the fucking massive shit stompers. Yeah, fourth and one, 14 seconds left. And the Colts decide. Edgar James up the middle. That's the call to make. And McGuinness had uh, I don't know if I wrote the quote down or if I grabbed it, um, talking about the like how he played that play. Where basically he's like, I know I'm coming in. I I'm just like, I'm selling out on the run, but I don't want Man to know that. So he turned and like turned outside to the wide receiver. So it looked like he was gonna hit him before he came. And then he turned back and and manning like just assumed he was going to be in coverage. And so when William McGuinness came back, he he saw that Manning had like, I don't know, tapped his butt or some sort of like signal to know to to say that he was running the ball. And so that's what keyed off William McGuinness to just come like screaming off the edge. And caught Edward James, what, two, three yards in the backfield? Like it didn't even make it to the pile before he got. Untouched. Oh yeah, completely untouched.",
    "timestamp" : "54:30-55:49"
  },
  {
    "text" : "Feels like it was a breakdown and blocking.",
    "timestamp" : "55:49-55:52",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "55:53-55:54",
    "speaker" : "Andy",
    "text" : "It wasn't good."
  },
  {
    "speaker" : "Greg",
    "text" : "But I don't know enough about football to know whether that's true.",
    "timestamp" : "55:55-55:59"
  },
  {
    "text" : "I watched the all twenty two Greg.",
    "timestamp" : "55:59-56:00",
    "speaker" : "Steve"
  },
  {
    "text" : "Well Penny didn't shift the protection after the fucking motion, so yeah.",
    "speaker" : "Greg",
    "timestamp" : "56:03-56:09"
  },
  {
    "timestamp" : "56:10-56:42",
    "speaker" : "Andy",
    "text" : "I mean if you look closely The tight end on that side crashes down. He's in the three technique, as you can see here, that I've circled. I mean he's not. He's he's actually standing up in the in what looks like he's going to be in coverage, but literally just comes like screaming off the edge, untouched. And I mean he's uncovered on that side. There's no like tight end over there anyway. Um so yeah, it was just like the perfect play call, the perfect execution on defense. And"
  },
  {
    "timestamp" : "56:42-56:48",
    "speaker" : "Greg",
    "text" : "And big Willie, the perfect celebration. A c iconic celebration. Yeah, high stepping."
  },
  {
    "timestamp" : "56:49-56:58",
    "text" : "We just can't really see it because he's on his knees as Willie's running by him with his finger up. And you can you can just think about the manning face on him right there. there. Yes.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "56:58-57:05",
    "text" : "Just and again, this is the second point in this game where if you're a fan, a Patriots fan at this game, you are just",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "57:07-57:07",
    "speaker" : "Andy",
    "text" : "Ecstatic."
  },
  {
    "text" : "The shift of emotions you went from like you're you're like I can't believe we're gonna lose this game to we fucking We fucking and really you want to do the same thing that Willie McGuinness is doing is just fucking just fucking step into the so much energy that you just want to, you know. I love that feeling. Oh, it feels so good. Where you're like, I I just want to move.",
    "speaker" : "Greg",
    "timestamp" : "57:08-57:28"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:32-57:45",
    "text" : "Oh so good. Um let's see. Anything else about this game that stuck out to you boys We want to do best and worst? Uh I can give you some stats first if you want to do that."
  },
  {
    "timestamp" : "57:46-57:48",
    "speaker" : "Greg",
    "text" : "Sure. I have some notes on Marvin Harrison."
  },
  {
    "speaker" : "Andy",
    "text" : "All right. Let me give let me do uh save that for another day, but section here. Um the Peyton Manning's last three home games versus New England. Like he hasn't done very well in New England, but at home against the Patriots coming into this game. Uh in three games, 789 yards, six touchdowns, no interceptions, and a rating of 121. 9. That's fucking ridiculous. He's fucking dome merchant, but still he's the best at it. Um one of my favorite offense stats uh they showed was the Colts offense, their their ranks in 03. They were ranked first in passing, 28th in rushing. And second overall.",
    "timestamp" : "57:49-58:34"
  },
  {
    "text" : "Why would you you know pass the why would you run the ball when you got Peyton Man in the pass it?",
    "timestamp" : "58:34-58:38",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "58:38-59:12",
    "speaker" : "Andy",
    "text" : "But Ed Green James still ran for twelve hundred yards. That's pretty good. Even like that, it didn't matter. Um Let's see, what is this one? Peyton Manning at home with NFL ranks on the season. First in completion percentage, second in yards per attempt, first in yards per game, second in uh QB rating. Like just an absolute animal at home. Um oh, and then they did the uh I I've been enjoying these just looking back at them. The uh the um the polls that they put up."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "59:13-59:14"
  },
  {
    "text" : "And this one was like what it was against the The Cowboys, it was who was the coach of the year this year. And Bill Parcell was first and Belichick was fifth. Yeah. Nailed that one. And this was which of these AFC teams will be playing in Super Bowl 35, 6, 7, 8, 38. Indianapolis, Kansas City, Miami, New England, Tennessee. I think all those teams make the playoffs. So not like a huge fucking deal, but at least they at least they had the team on there.",
    "speaker" : "Andy",
    "timestamp" : "59:14-59:46"
  },
  {
    "timestamp" : "59:48-59:52",
    "speaker" : "Steve",
    "text" : "I think Cincinnati was stoked on that because they've been crap for a while, right?"
  },
  {
    "text" : "Yeah. Um and I believe Cincinnati The week before had just beaten Kansas City for their first loss of the season. So I think Cincinnati's like six and six like right middle of the road but they had beaten Kansas City or like seven and six Corey Dillon. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "59:52-01:00:09"
  },
  {
    "timestamp" : "01:00:10-01:00:11",
    "speaker" : "Greg",
    "text" : "We'll we'll hear about him later."
  },
  {
    "text" : "We sure will. Uh yeah, so that's those are my main stats. Do you guys want to do best and worst?",
    "timestamp" : "01:00:11-01:00:18",
    "speaker" : "Andy"
  },
  {
    "text" : "Mike Vanderjack, 37 of 37 this year. Yeah. On field goal attempts.",
    "timestamp" : "01:00:19-01:00:23",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Cool. We'll get back to him.",
    "timestamp" : "01:00:24-01:00:26"
  },
  {
    "timestamp" : "01:00:26-01:00:31",
    "speaker" : "Greg",
    "text" : "The guy we just shit on the whole fucking podcast had a perfect season kicking the ball. Yeah."
  },
  {
    "timestamp" : "01:00:31-01:00:33",
    "text" : "How do you do tackling kicker turners?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That's his primary job. I think his primary job is kick and field goals. Well, not according to him. Pretty good at it, you know.",
    "timestamp" : "01:00:35-01:00:42"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:42-01:00:55",
    "text" : "Maybe. I have a real best. All right. Um I don't know how long this is recording is right now, but we have gotten this entire fucking time without Andy mentioning the commentators."
  },
  {
    "speaker" : "Greg",
    "text" : "Hmm. They were good. That means they were like stupendous.",
    "timestamp" : "01:00:56-01:01:03"
  },
  {
    "timestamp" : "01:01:03-01:01:12",
    "speaker" : "Steve",
    "text" : "Yeah, they're this is probably maybe the m most quality commentated game we watched. And I have a Nice uh quote."
  },
  {
    "text" : "I I bet we have the same one.",
    "speaker" : "Andy",
    "timestamp" : "01:01:13-01:01:15"
  },
  {
    "speaker" : "Steve",
    "text" : "Okay.",
    "timestamp" : "01:01:15-01:01:15"
  },
  {
    "speaker" : "Andy",
    "text" : "Do you want to say it or do I?",
    "timestamp" : "01:01:16-01:01:18"
  },
  {
    "timestamp" : "01:01:18-01:01:21",
    "speaker" : "Steve",
    "text" : "It was about Bethel Johnson returning Kicks."
  },
  {
    "text" : "Yep.",
    "timestamp" : "01:01:21-01:01:21",
    "speaker" : "Andy"
  },
  {
    "text" : "And this is why I think there's three big returns because he says something about slap me in the face with a skunk three times.",
    "speaker" : "Steve",
    "timestamp" : "01:01:22-01:01:28"
  },
  {
    "timestamp" : "01:01:28-01:01:35",
    "speaker" : "Andy",
    "text" : "You know, Or I wrote a verbatim because it was so good. Okay. Quote, if you slap me in the face with a skunk three times, I'll figure out what it is."
  },
  {
    "text" : "Yes.",
    "timestamp" : "01:01:35-01:01:36",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:01:37-01:01:39",
    "speaker" : "Andy",
    "text" : "Phil Sim said that? Yeah."
  },
  {
    "timestamp" : "01:01:39-01:01:43",
    "text" : "I like Phil Bethel Johnson breaking off big returns in this game.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:01:43-01:01:45",
    "text" : "I mean that's it's about not kicking into Bethel Johnson.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01:46-01:01:46",
    "speaker" : "Steve",
    "text" : "Yes."
  },
  {
    "speaker" : "Andy",
    "text" : "Which I didn't figure out.",
    "timestamp" : "01:01:46-01:01:47"
  },
  {
    "timestamp" : "01:01:48-01:01:48",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:01:49-01:01:53",
    "speaker" : "Andy",
    "text" : "Also, this game got so exciting that Phil Sims literally fell out of his chair."
  },
  {
    "timestamp" : "01:01:53-01:01:54",
    "speaker" : "Steve",
    "text" : "Yes he did."
  },
  {
    "speaker" : "Andy",
    "text" : "At one point.",
    "timestamp" : "01:01:54-01:01:55"
  },
  {
    "timestamp" : "01:01:55-01:01:55",
    "text" : "Yes he did.",
    "speaker" : "Steve"
  },
  {
    "text" : "Like Phil, are you alright? Greg was like, Phil, are you alright? He's like, yeah, this game's just really exciting. Oh, are you talking about me just falling out of my chair? And he's like, and Greg Gubbles like, yeah, I'm just gonna gloss over that, but he's like, yeah, I it's so exciting, I fell out of my chair. Good old Phil. Yeah, all right. Yeah, this this was the NBC's A-team for sure.",
    "speaker" : "Andy",
    "timestamp" : "01:01:56-01:02:16"
  },
  {
    "timestamp" : "01:02:16-01:02:31",
    "text" : "See, I like the Brady quote when the when Diedrich Ward scored a touchdown, they said Yeah, Tom Brady talked to us last night and he said, what a neat guy for us to pick up. Fucking neat, neat guy. Fucking Tom Brady. Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:02:32-01:02:36",
    "speaker" : "Steve",
    "text" : "Still, he's got a relatively productive career more than you would think."
  },
  {
    "timestamp" : "01:02:36-01:02:43",
    "text" : "Yeah, and now Tom Brady's shit faced on a boat throwing the Lombardy trophy from one boat to another. I didn't watch any of that.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Look how far he's matured. Yeah I feel like he kind of peaked and now he's on his way back down again. He's gonna be like a super goober in here.",
    "timestamp" : "01:02:44-01:02:52"
  },
  {
    "timestamp" : "01:02:52-01:03:03",
    "text" : "I know what it is. I saw a cut of the Dante huddling the offensive line and Brady was listening in. So once he was removed from his life, you know, then Paul Maturdy.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:03:04-01:03:08",
    "text" : "Maybe, yeah. Maybe Dante Skarenecia was the uh the reason.",
    "speaker" : "Andy"
  },
  {
    "text" : "He is the common force. Yeah. All right. Uh I got another plus as well. Okay. I believe it was your boy Eugene Wilson who committed a pass interference penalty when he clearly got beat. But if he hadn't, it would have scored a touchdown and it put the Colts on the one or whatever. That was like third quarter or so. And he was just gone. And if he doesn't commit that pass interference, then that's an easy TD. And then the cutscene cold sky in the stand being like, yeah, we're number one. He was just the biggest Indianapolis goober I've ever seen in my life.",
    "speaker" : "Steve",
    "timestamp" : "01:03:08-01:03:47"
  },
  {
    "text" : "Uh well that I was gonna save that, but um that was gonna be my my best, but I will put this guy because uh I was it this guy With the turtleneck? No. Underneath the turtleneck? The jersey? No. The sh the short sleeve turtleneck, obviously, underneath the jersey. Yeah. I I had to capture that. I had to pause it and go back and capture this because this is like this is what I picture an Indianapolis Colts fan to look like.",
    "timestamp" : "01:03:47-01:04:13",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:04:13-01:04:16",
    "text" : "Oh no, it's really too skinny to be from Indianapolis."
  },
  {
    "speaker" : "Andy",
    "text" : "The picture I get of just like, hmm. Yeah.",
    "timestamp" : "01:04:18-01:04:22"
  },
  {
    "timestamp" : "01:04:23-01:04:28",
    "speaker" : "Greg",
    "text" : "He'll he'll pull it out. That's how we know you don't get out of the state much, Andy. Yeah. Yeah, well, that's fine."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:04:29-01:04:31",
    "text" : "I couldn't disagree more."
  },
  {
    "timestamp" : "01:04:32-01:04:33",
    "speaker" : "Andy",
    "text" : "I don't care."
  },
  {
    "timestamp" : "01:04:33-01:04:35",
    "text" : "I've been Indian, okay, buddy.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Cong congrats? How was it? I think it's more impressive than I haven't.",
    "timestamp" : "01:04:36-01:04:41"
  },
  {
    "text" : "Uh and then let's go worse. That it's kind of a two-parter and then You know, uh it's the ads and the you know the what we what we got to see on the extra because this took a lot longer because there was no commercials cut out.",
    "speaker" : "Steve",
    "timestamp" : "01:04:43-01:04:57"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:04:57-01:04:57"
  },
  {
    "timestamp" : "01:04:58-01:05:10",
    "text" : "Some of them were good. There was one about Jared uh as a judge, like A John Batch from Subway was in some legal case, which I thought was, you know, yeesh uh a little awkward for sure.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:05:11-01:05:18",
    "text" : "Yeah. There was a better one though. That I found. All right, here we go. Uh remember when Budweiser commercials were actually funny?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Announcer",
    "text" : "Leon, your reactions following today's devastating loss. Football is a team sport, man. So uh I gotta put the loss squarely on the shoulder. of my supporting cast. Look, man, I've been carrying these guys the whole season, but I can't do it all. I need some help. So your four fumbles weren't a factor in your mind? Not if one of those other guys would have jumped on the ball. Again, Leon can't do everything. There's no I and T. Well ain't no we either.",
    "timestamp" : "01:05:19-01:05:48"
  },
  {
    "speaker" : "Steve",
    "text" : "Again, ironic, it's in the Peyton Manning game too.",
    "timestamp" : "01:05:52-01:05:55"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:55-01:06:02",
    "text" : "Right, exactly. Uh Peyton Manning and Mike Vanderjacked in this. I wonder if uh either one of them."
  },
  {
    "speaker" : "Steve",
    "text" : "I would actually probably still play today. And then the diamond commercials are the same fucking thing too.",
    "timestamp" : "01:06:03-01:06:07"
  },
  {
    "text" : "Oh yeah. Yes, uh all the car commercials exactly the same. Trucks driving two puddles. Yay.",
    "timestamp" : "01:06:08-01:06:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "When are we getting widescreen?",
    "timestamp" : "01:06:14-01:06:16"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know. Yeah. It's gotta be coming soon.",
    "timestamp" : "01:06:17-01:06:19"
  },
  {
    "text" : "We got the first downline, I think, this year.",
    "speaker" : "Steve",
    "timestamp" : "01:06:20-01:06:22"
  },
  {
    "text" : "Yeah. Uh yeah, I think we saw it for like primetime games last year, but it's like official now for all the games this year.",
    "timestamp" : "01:06:24-01:06:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:06:30-01:06:35",
    "text" : "It's in every game, and that's made a huge difference. And widescreen is gonna make a huge difference for me too. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "All right. Me too. Greg. Greg, give me your best and worst.",
    "timestamp" : "01:06:36-01:06:40"
  },
  {
    "timestamp" : "01:06:41-01:06:44",
    "text" : "Can you go first? I don't have anything.",
    "speaker" : "Greg"
  },
  {
    "text" : "Okay.",
    "speaker" : "Andy",
    "timestamp" : "01:06:44-01:06:44"
  },
  {
    "speaker" : "Steve",
    "text" : "I didn't watch the game. I watched the Game of the World.",
    "timestamp" : "01:06:45-01:06:48"
  },
  {
    "text" : "He's been bullshitting us this entire time. Uh let's see. Um Uh there's a good Bill Bellick check quote that they came out with. Um talking to his team before the game because they were getting a little uh high and mighty because they were nine and two. He said to his team, you want to be compared to that 2001 Super Bowl team? How many games did they win after Thanksgiving? Nine. How many of you won? Zero. Fucking typical Babel check raining on their parade and they're fucking nine and two. Um and then at halftime, apparently his quote was, this game will come down to who can protect the best at the end. Which, yeah, that's exactly what happened. Uh let's see who else was good in this. Tom Brady started off hot as hell. He was 11 for 11 uh before he finally missed in the second quarter. Ken Walter already talked about who's garbage. Tony Denji is dumb, which talked about. Uh Peyton Manning, this is the first fumble in the first quarter that he lost in over a year, which I thought was fucking ridiculous. And I think my worst was remembering. about the Colts Peyton Manning no huddle offense where they used to just like not huddle, but Manning would just. like call audibles all the time at the line of scrimmage for like 30 seconds and they put that in Madden and it was the fucking worst Because they'd run no huddle the entire time, but then they would sit there and just like drain the clock down with paint and man just calling audible, audible, audible, audible. And then eventually he'd snap the ball. Omaha! Omaha! Just constantly. Yeah, it was brutal to play against. Games took so long. Um and I've thought this before, I don't think I've said it yet, but Marvin Harrison looks like somebody put the head of a 50-year-old dude on the body of a football player. Like he's looked 50 years old like his entire career.",
    "timestamp" : "01:06:52-01:08:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:08:56-01:08:56",
    "speaker" : "Steve",
    "text" : "That's true."
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know if it's the mustache or what it is, just like his facial features. It isn't like he didn't age either though. Right, yeah, no, but he always looked like he's the same age. Just fifty. Yeah, he never got any older. I thought that too. I bet he probably still looks like that. Yeah. But he probably in 2003 was he like 25 maybe? But he just looks he just looks like like a 50-year-old. He looks like somebody's dad all the time. He's like a stone cold killer. Well, I mean he did have twelve hundred yards, ten touchdowns and zero witnesses this year.",
    "timestamp" : "01:08:56-01:09:31"
  },
  {
    "speaker" : "Steve",
    "text" : "Bag wasn't afraid of him though. Greg.",
    "timestamp" : "01:09:32-01:09:34"
  },
  {
    "text" : "But I I have uh I looked into the Marvin Harrison shooting incident. Ooh.",
    "timestamp" : "01:09:39-01:09:46",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:09:46-01:09:49",
    "text" : "All right. Well we'll do a deep dive next time the cult comes in."
  },
  {
    "speaker" : "Greg",
    "text" : "I have you are afraid either. Just not edge. Well, you know, I mean It depends if he's guilty or not. Well, we'll see. We'll get into the nitty-gritty next time. Yeah, right. There's my my best is from that too. That was so their touchdown. Many to Harrison. That was their sixty-sixth T D pass from uh Manny to Harrison.",
    "timestamp" : "01:09:49-01:10:14"
  },
  {
    "speaker" : "Andy",
    "text" : "That's a lot.",
    "timestamp" : "01:10:14-01:10:14"
  },
  {
    "text" : "Yeah, except when you think about where they finished at the number one combo NFL history a hundred and fourteen times through touchdowns to Harris.",
    "speaker" : "Greg",
    "timestamp" : "01:10:15-01:10:27"
  },
  {
    "text" : "Although Brady and Gronk gotta be catching that.",
    "timestamp" : "01:10:28-01:10:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "They were at 99 at the time of this writing. Okay. February 7th, 2021. So holy shit. Yeah. Like three days ago.",
    "timestamp" : "01:10:31-01:10:40"
  },
  {
    "text" : "So yeah, because that that includes the uh the team number three.",
    "timestamp" : "01:10:40-01:10:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:10:45-01:10:48",
    "text" : "Oh I'll give you the team 49ers",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Montana Rice.",
    "timestamp" : "01:10:50-01:10:51"
  },
  {
    "text" : "Close. Steve Young. Steve Young to Jerry Rice.",
    "speaker" : "Greg",
    "timestamp" : "01:10:53-01:10:57"
  },
  {
    "timestamp" : "01:10:58-01:11:00",
    "text" : "Jerry Stokes.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:00-01:11:16",
    "text" : "92 times. Phillip Rivers to Antonio Gates, 90. Damn. That's a lot. Dan Marino to Mark Clayton 82. Ben Rothesberger to Mr. Big Chest. 98.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:11:16-01:11:19",
    "speaker" : "Andy",
    "text" : "Wow, they didn't even play that long together, did they?"
  },
  {
    "timestamp" : "01:11:20-01:11:22",
    "text" : "Peyton to Reggie Wayne, 76.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:11:22-01:11:23",
    "text" : "Holy shit, he's on there twice.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:23-01:11:31",
    "text" : "Yeah. Breeze to Colston, which is pretty interesting. Colston, wow. Yeah, you don't really think of Colston as like a household name.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "No.",
    "timestamp" : "01:11:31-01:11:31"
  },
  {
    "timestamp" : "01:11:32-01:11:33",
    "speaker" : "Steve",
    "text" : "And then Eric."
  },
  {
    "text" : "He's not top ten.",
    "speaker" : "Greg",
    "timestamp" : "01:11:35-01:11:36"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:38-01:11:43",
    "text" : "Well that's the thing, like Brady has had so many touchdowns, so many different receivers that Yeah."
  },
  {
    "text" : "And you know what else is sort of robbed by that? Uh Gonzalez. Tony Gonzlez had it. Just he was like the Antonio Gates same idea that caught Tommy. But yeah, a bunch of quarterbacks though.",
    "timestamp" : "01:11:43-01:11:54",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. Yeah, it's like uh Larry Fitzgerald. He has a shit ton of touchdowns, but I don't know if he has ten from one quarterback at this point. Ridiculous. Um did you have a worse, Greg? Well as well as games where there wasn't one.",
    "timestamp" : "01:11:54-01:12:13"
  },
  {
    "timestamp" : "01:12:13-01:12:15",
    "text" : "Yeah, there wasn't one.",
    "speaker" : "Greg"
  },
  {
    "text" : "Just Tom Brady interceptions, maybe?",
    "timestamp" : "01:12:15-01:12:17",
    "speaker" : "Andy"
  },
  {
    "text" : "No. But do you wanna you guys wanna briefly talk about the Super Bowl that just passed?",
    "timestamp" : "01:12:17-01:12:24",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:12:25-01:12:34",
    "text" : "Uh I think we could probably do An episode on that, Steve. On Tom Brady winning a Super Bowl, not on the Patriots.",
    "speaker" : "Andy"
  },
  {
    "text" : "It's certainly not an emergency.",
    "speaker" : "Steve",
    "timestamp" : "01:12:34-01:12:36"
  },
  {
    "timestamp" : "01:12:36-01:12:50",
    "text" : "No, I think maybe it uh it could be like a After we finish this season, we talk about the Brady winning a Super Bowl with the Patriots in 2003 and then do an episode of 2020 Tom Brady winning a Super Bowl.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I don't know if I want to subject myself to re-watching all that. I don't know. I didn't watch any of the Cambridge Parade.",
    "timestamp" : "01:12:51-01:12:56"
  },
  {
    "text" : "Did you watch did were you happy that the Patriots won the Super Bowl, Steve? The Patriots? Yeah.",
    "timestamp" : "01:12:56-01:13:02",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:13:02-01:13:08",
    "speaker" : "Steve",
    "text" : "I mean the fucking fogg. Uh yeah, I was rooting for Brady for sure."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Speaking of other podcast-related things though, we're recording this on February 11th, 2021. Uh that is exactly one year from when we launched this podcast. So congratulations, gentlemen. A full year, yes.",
    "timestamp" : "01:13:08-01:13:27"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:13:27-01:13:40",
    "text" : "What the fuck, dude? Why didn't we make a cake? You didn't get your cake? I've been telling you themed podcast birthday cakes. Come on. It's a terrible You know what makes great audio?"
  },
  {
    "speaker" : "Andy",
    "text" : "Listening to three dudes eat fucking cake. Yeah. It's bad never gonna live if you eat dinner halfway through these fucking things.",
    "timestamp" : "01:13:40-01:13:48"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, you know, guys gotta live, Andy. What am I gonna be malnutritioned? Just for the sake of some fucking podcast. I don't think anybody's gonna consider you. I tell you what, malnutrition. Soup. It's hard to eat quietly. If you heard me this episode, I apologize, but you know, it's just one of those foods.",
    "timestamp" : "01:13:48-01:14:06"
  },
  {
    "speaker" : "Andy",
    "text" : "So uh since I love numbers, I'll give you some. For since we launched this, we have had 5,886 downloads of the podcast.",
    "timestamp" : "01:14:06-01:14:16"
  },
  {
    "timestamp" : "01:14:17-01:14:20",
    "speaker" : "Greg",
    "text" : "That's the same amount of men that have touched your penis, right, Andy? Also true."
  },
  {
    "text" : "That's eight, man.",
    "timestamp" : "01:14:22-01:14:23",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, this is annual too. This is over a year.",
    "timestamp" : "01:14:25-01:14:27",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, okay, yeah. Yeah.",
    "timestamp" : "01:14:27-01:14:29",
    "speaker" : "Steve"
  },
  {
    "text" : "So the the numbers track. Yeah. Um Let's see. Do we have I don't know how to use this very how many episodes have we done? Oh boy, we have done a lot of episodes. Guess, Steve. Yeah, give me a guess.",
    "timestamp" : "01:14:29-01:14:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:14:45-01:14:48",
    "text" : "Uh yeah, one week will be 52. I know we've done 50.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:14:54-01:14:57",
    "speaker" : "Andy",
    "text" : "Well we when we launched we launched uh three."
  },
  {
    "timestamp" : "01:14:57-01:15:00",
    "speaker" : "Steve",
    "text" : "Oh right. We we pre-recorded a bunch."
  },
  {
    "text" : "So I think we have actually done one every week except for last week and then over this past Christmas Uh so we have actually released 55 episodes. This will be 56 right now.",
    "speaker" : "Andy",
    "timestamp" : "01:15:02-01:15:15"
  },
  {
    "timestamp" : "01:15:15-01:15:26",
    "text" : "We released 50 56 in in 12 months. That's a surprising amount. I hope they don't expect that forever because it's gonna end some point.",
    "speaker" : "Steve"
  },
  {
    "text" : "I mean that this is very uh uh COVID specific, I think. The the rate at which we're going.",
    "speaker" : "Andy",
    "timestamp" : "01:15:27-01:15:34"
  },
  {
    "text" : "Well I I'm excited to finish this season. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:15:35-01:15:38"
  },
  {
    "speaker" : "Andy",
    "text" : "Next season. This playoffs is going to be awesome. Yeah, this whole thing. Yeah, it's going to be great. Let's see. Oh, okay. Here we go. Downloads per episode. The most popular episode. Well, I don't know if I trust this is week one. 2001.",
    "timestamp" : "01:15:39-01:15:55"
  },
  {
    "speaker" : "Steve",
    "text" : "That's a that's probably the worst episode too.",
    "timestamp" : "01:15:55-01:15:57"
  },
  {
    "timestamp" : "01:15:58-01:16:25",
    "speaker" : "Andy",
    "text" : "Yeah. Um but let's see. Uh outside of the first one, two, three Week four is not popular, but week one, two, three, and five of the first season. And then it's uh Tom Brady Emergency episode. 149 lessons. sense yeah and then the start of 2002 uh the emergency episode of when we picked up cam newton 132"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, so young, so naive.",
    "timestamp" : "01:16:26-01:16:29"
  },
  {
    "text" : "Yep. And then a lot of the uh 2001 playoffs are on here. Uh yeah.",
    "timestamp" : "01:16:29-01:16:35",
    "speaker" : "Andy"
  },
  {
    "text" : "Where does the Lions game, right? Because that was my favorite.",
    "speaker" : "Steve",
    "timestamp" : "01:16:36-01:16:39"
  },
  {
    "timestamp" : "01:16:39-01:17:13",
    "speaker" : "Andy",
    "text" : "Patriots at Lions, 125 downloads. 2020 week 13, right? Yeah. So not bad. Yeah, most of these are getting over a hundred listens at this point. But we did see a bit of a drop, it seems, uh when the season started. Right around Actually, I think it was kind of when people realized maybe the Patriots weren't doing great around November. Things kind of dropped off a bit."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:17:13-01:17:17",
    "text" : "Yeah, well we're fairweather fans too, so I understand that."
  },
  {
    "text" : "Yeah, no, uh I think all Fairweather fans will make a podcast about um watching games from 20 years ago.",
    "speaker" : "Andy",
    "timestamp" : "01:17:17-01:17:24"
  },
  {
    "speaker" : "Greg",
    "text" : "What are you guys gonna do in the off season now that there's no football? You guys got any like hobbies or you know planned activities or interests?",
    "timestamp" : "01:17:25-01:17:33"
  },
  {
    "text" : "Bro, bro, you're you're you're a part of my hobby right now.",
    "timestamp" : "01:17:33-01:17:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay.",
    "timestamp" : "01:17:37-01:17:38"
  },
  {
    "timestamp" : "01:17:39-01:17:46",
    "speaker" : "Steve",
    "text" : "This is it though? They made uh gambling legal in Virginia, so we're not saying no more."
  },
  {
    "timestamp" : "01:17:46-01:17:48",
    "speaker" : "Greg",
    "text" : "You know, gamble on WMBA"
  },
  {
    "text" : "I I put a fifty dollar bet down on the NASCAR shit the other day.",
    "timestamp" : "01:17:48-01:17:54",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:17:55-01:18:00",
    "speaker" : "Greg",
    "text" : "Yikes. As you do. How'd you say $150 bet?"
  },
  {
    "speaker" : "Steve",
    "text" : "It was $50 for Denny Hanlon to complete one lap of the Daytona 500 plus 100.",
    "timestamp" : "01:18:00-01:18:06"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:18:06-01:18:07",
    "text" : "Did he?"
  },
  {
    "text" : "I don't think it's happened yet.",
    "timestamp" : "01:18:07-01:18:09",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So find out next week where uh how Steve lost fifty bucks Daddy Hanlin didn't actually fucking participate in this race, but Steve didn't know it because he doesn't fall on Ask. Uh speaking of next week, what is next week? Ooh.",
    "timestamp" : "01:18:12-01:18:29"
  },
  {
    "timestamp" : "01:18:29-01:18:40",
    "text" : "Well you wanna what what else you got going on here, Andy? Let's Oh well let's get a peek inside. What else are we having going on? Yeah, what do you what else are you doing for hobbies?",
    "speaker" : "Greg"
  },
  {
    "text" : "All right.",
    "speaker" : "Andy",
    "timestamp" : "01:18:40-01:18:41"
  },
  {
    "speaker" : "Greg",
    "text" : "Well uh I know you always got a project going on.",
    "timestamp" : "01:18:41-01:18:44"
  },
  {
    "timestamp" : "01:18:45-01:18:55",
    "text" : "We got some projects. Uh there is I wasn't about to announce it now, but I guess I will. Uh gonna be a revamp of the Patriots Dynasty website. So that's coming down.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:18:55-01:18:57",
    "speaker" : "Greg",
    "text" : "Something non-football related, Andy."
  },
  {
    "timestamp" : "01:18:57-01:19:04",
    "text" : "Non-football related. I I don't do anything right now. I go hiking. Ooh, hiking. It's fucking cold right now, so I don't do that either. I bought boots.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:19:05-01:19:10",
    "text" : "Snowshoes. You could try snowshoeing. I have snowshoes. Mom, mom's getting snowshoes, she said."
  },
  {
    "text" : "If we get a bit more snow, I might go skiing.",
    "speaker" : "Andy",
    "timestamp" : "01:19:12-01:19:15"
  },
  {
    "speaker" : "Greg",
    "text" : "You got any projects around the house going?",
    "timestamp" : "01:19:17-01:19:19"
  },
  {
    "timestamp" : "01:19:20-01:19:26",
    "speaker" : "Andy",
    "text" : "No. No projects around the house at the moment. No What about yourself? You got project in the house?"
  },
  {
    "timestamp" : "01:19:26-01:19:28",
    "speaker" : "Greg",
    "text" : "If you need some advice, just let me know."
  },
  {
    "text" : "With your all all those months of uh experience you have.",
    "speaker" : "Andy",
    "timestamp" : "01:19:29-01:19:34"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:19:35-01:19:52",
    "text" : "I'll come to you. I built a uh bed like a swing bed for the uh uh my porch yeah and uh no idea how I'm gonna put it up Uh no. So it's just sitting in my living room. I was wondering where you were keeping that, because it's stinky."
  },
  {
    "text" : "Like a bed. Yeah. It's a twin-size bed. Like it's a bed frame that you think you're gonna hang from the roof of your porch.",
    "speaker" : "Andy",
    "timestamp" : "01:19:55-01:20:01"
  },
  {
    "text" : "Throw it in the woods, you know, just hang it up there.",
    "speaker" : "Steve",
    "timestamp" : "01:20:03-01:20:05"
  },
  {
    "timestamp" : "01:20:05-01:20:54",
    "text" : "Yeah. If it falls, it falls. Whatever, right? Also, my other hobby. Don't hang it too high. Sporkle. com. Oh gosh. Uh-huh. I don't know what that is. Sporkle is like a like a trivia quiz website. It's actually good for our our listeners. It's There's one on there, like can you name every player that's got a touchdown from Brady? That one's like fun to do. Um, I've been doing uh I named every country in the world the other day. I'm working my way through capitals. Congratulations. Are much more difficult. I would imagine. Right now, my number one country and capital is Djibouti Djibouti. Yeah. Jabuty, Jabuty.",
    "speaker" : "Greg"
  },
  {
    "text" : "Jabuty. Oh yeah, we're in Djibouti.",
    "speaker" : "Steve",
    "timestamp" : "01:20:55-01:20:57"
  },
  {
    "timestamp" : "01:20:57-01:21:19",
    "speaker" : "Greg",
    "text" : "Djibouti, Djibouti. Let me see you shake your djibouti. God damn. Also, I've made a habit of singing around the house, you know, like the Antigua bombing. I just do that, but insert African countries instead. You Uganda Rwanda."
  },
  {
    "text" : "Come on, baby, watch it.",
    "speaker" : "Andy",
    "timestamp" : "01:21:20-01:21:22"
  },
  {
    "speaker" : "Greg",
    "text" : "Shelly hates that.",
    "timestamp" : "01:21:24-01:21:25"
  },
  {
    "timestamp" : "01:21:25-01:21:34",
    "text" : "Uh so I guess uh a project for all of us is annoying our significant others. We're working on perfecting that. That's a lifestyle",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:21:34-01:21:43",
    "speaker" : "Greg",
    "text" : "We're a year into this, like not just this podcast, but COVID. Yeah. Yeah. It's like a it's like a method of survival."
  },
  {
    "text" : "Yeah. I remember going on tape and predicting when it would end.",
    "timestamp" : "01:21:44-01:21:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:21:47-01:21:55",
    "text" : "Okay, let's do this now then. Again? For posterity. Yeah. Okay. All right. So let's say when"
  },
  {
    "text" : "I got it. When will you next go to like a Patriot-sized group of fans?",
    "timestamp" : "01:21:57-01:22:05",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:22:05-01:22:08",
    "speaker" : "Greg",
    "text" : "So we next go to a professional sporting event, concert."
  },
  {
    "speaker" : "Steve",
    "text" : "Okay. That's really the test of when it's back, you know.",
    "timestamp" : "01:22:12-01:22:15"
  },
  {
    "text" : "That's what I've been saying too. That's when I know it's over.",
    "speaker" : "Greg",
    "timestamp" : "01:22:15-01:22:18"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:22:18-01:22:19",
    "text" : "Yeah. Yeah."
  },
  {
    "text" : "Uh so September. I mean you could go to a baseball game this this summer, right?",
    "timestamp" : "01:22:20-01:22:27",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:22:28-01:22:29",
    "text" : "Yeah, but like when will you be back?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, but well Will that have so are we talking about it? When will pro when will pro sports allow capacity fans at games?",
    "timestamp" : "01:22:30-01:22:39"
  },
  {
    "timestamp" : "01:22:39-01:22:55",
    "speaker" : "Andy",
    "text" : "Yeah, okay, that's what I'm saying. But I don't think it'll be at capacity this summer. Right. But I think there's so much money in the NFL that it will be September at the latest. I think you'll have full fans by September. Steve?"
  },
  {
    "text" : "Uh I'm gonna go one year from today.",
    "speaker" : "Steve",
    "timestamp" : "01:22:56-01:23:00"
  },
  {
    "text" : "You sicko. Disgusting second. Yeah, right? He's probably right, Andy. I know. You know",
    "speaker" : "Greg",
    "timestamp" : "01:23:02-01:23:12"
  },
  {
    "timestamp" : "01:23:13-01:23:24",
    "text" : "Yeah. Okay. I'm just following the CDC recommended guidelines, but this is what we're doing. Fauci told me not to expect until 2022. I'm I'm optimistic of anything.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:23:24-01:23:35",
    "speaker" : "Greg",
    "text" : "Yeah. And the other the other piece of information is we know that COVID's not real. So really it's how how much is the government willing to push us until they break us?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:23:35-01:23:37",
    "text" : "Yeah. When will the sheep wake up?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, we're the shirt. We don't need that. What are we, Info Wars?",
    "timestamp" : "01:23:37-01:23:41"
  },
  {
    "speaker" : "Steve",
    "text" : "God damn it. We're banned.",
    "timestamp" : "01:23:41-01:23:45"
  },
  {
    "timestamp" : "01:23:54-01:24:11",
    "speaker" : "Greg",
    "text" : "Yeah Uh see I I like your I like both of your calls of like w I think the NFL it's more likely to start a season to to go right into it than to transition halfway through a year, right? Yeah. Like baseball is not going to just be like halfway through, be like, all right, now we're doing full."
  },
  {
    "text" : "Right.",
    "timestamp" : "01:24:11-01:24:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:24:12-01:24:19",
    "text" : "NFL makes sense. I think maybe NBA's not going to do it because zero is the softest.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:24:20-01:24:20"
  },
  {
    "timestamp" : "01:24:20-01:24:23",
    "speaker" : "Greg",
    "text" : "For most people thinking everyone. Hockey."
  },
  {
    "speaker" : "Andy",
    "text" : "When's that?",
    "timestamp" : "01:24:24-01:24:24"
  },
  {
    "timestamp" : "01:24:25-01:24:26",
    "speaker" : "Greg",
    "text" : "When does that start?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:24:26-01:24:28",
    "text" : "Um October, November."
  },
  {
    "speaker" : "Greg",
    "text" : "End of the year. Yeah, November. I'm saying November. Write it down. The Boston Bruins.",
    "timestamp" : "01:24:28-01:24:33"
  },
  {
    "text" : "So Andy September, you're November, I am February.",
    "speaker" : "Steve",
    "timestamp" : "01:24:33-01:24:37"
  },
  {
    "text" : "Actually w when will uh Biden be out of office? Because that's mine now. This is this is all a Biden conspiracy. Greg sold me. So four years.",
    "timestamp" : "01:24:37-01:24:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:24:49-01:25:00",
    "speaker" : "Steve",
    "text" : "Um he dies in office because it depends on when we storm the cat. In four years he stages a coup, remains in office for We're gonna get removed from IT."
  },
  {
    "timestamp" : "01:25:01-01:25:03",
    "speaker" : "Greg",
    "text" : "Is it gonna be a coup or is it gonna be a coup d'etat?"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh no, a coup d'etat is only from certain uh it has to be a coup in a specific region of France. Otherwise it's just a coupe.",
    "timestamp" : "01:25:05-01:25:13"
  },
  {
    "text" : "That's not true.",
    "speaker" : "Greg",
    "timestamp" : "01:25:13-01:25:14"
  },
  {
    "speaker" : "Andy",
    "text" : "It's like champagne, yeah.",
    "timestamp" : "01:25:15-01:25:16"
  },
  {
    "speaker" : "Greg",
    "text" : "You can only call it champagne from the champagne other countries. Nope. Nope. I'm pretty sure a coup d'etat is like a military one, isn't it?",
    "timestamp" : "01:25:16-01:25:26"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm pretty sure you're just an idiot.",
    "timestamp" : "01:25:27-01:25:28"
  },
  {
    "text" : "Yeah, I'm pretty I'm pretty sure my explanation was a joke that you missed. Why? Because it's a French word. Yes.",
    "timestamp" : "01:25:28-01:25:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Because that's how the that's how the French handle champagne. It can only be called champagne, otherwise it has to be called sparkling wine or whatever the fuck it is.",
    "timestamp" : "01:25:36-01:25:43"
  },
  {
    "text" : "All right. Next week. Whoever comes to the podcast with the best Sporkle score on Brady's touchdowns. You've already taken it, you fucking cheater.",
    "timestamp" : "01:25:43-01:25:54",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Andy, you're gonna come with a zero because you're not gonna be there.",
    "timestamp" : "01:25:54-01:25:57"
  },
  {
    "timestamp" : "01:25:57-01:26:07",
    "text" : "So shit. Can you name Super Bowl winners in a row? Starting in which way? Let's start with 2001.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "No, why are we doing this?",
    "timestamp" : "01:26:07-01:26:08"
  },
  {
    "timestamp" : "01:26:08-01:26:10",
    "speaker" : "Greg",
    "text" : "Oh yeah."
  },
  {
    "text" : "I will save this for next week. Okay. This has gone along a lot. Do you think you could do it though? From 2001 onwards, yes. Yeah. I I couldn't. Well, I think you should go 2020 backwards and see you can go furthest back. Yeah. But we'll do that next week. But then you're gonna study and you're gonna know it. No, nice. Yeah I'm gonna study, I got time for that. If anybody can study it could be you, right. So I'm not worried about it. Well, I already did study.",
    "timestamp" : "01:26:10-01:26:34",
    "speaker" : "Andy"
  },
  {
    "text" : "Greg Greg's like, I didn't watch the game, but I did watch every other Super Bowl going backwards from 2000.",
    "timestamp" : "01:26:34-01:26:39",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, exactly.",
    "timestamp" : "01:26:39-01:26:41"
  },
  {
    "timestamp" : "01:26:41-01:26:51",
    "speaker" : "Greg",
    "text" : "I don't have time to watch the game. I was like, who who did the Steelers beat in big bands first? Did I Hawks I had no idea?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Antoine Randall L scored a touchdown.",
    "timestamp" : "01:26:51-01:26:54"
  },
  {
    "timestamp" : "01:26:54-01:27:01",
    "text" : "From he scored a touchdown? Threw a touchdown. Threw a touchdown. Threw a touchdown to Heinz Ward.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:27:01-01:27:10",
    "speaker" : "Andy",
    "text" : "Yeah. Or maybe it's the other way around. I don't remember. No, you're right. Oh, I was right. Okay. Next week though, on the podcast. Do tricky week week fourteen."
  },
  {
    "timestamp" : "01:27:11-01:27:16",
    "text" : "Trivia week, yes. Trivia week. Do you want me to do you want to put together some trivia for you guys?",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, and here's the thing.",
    "timestamp" : "01:27:16-01:27:16",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Do",
    "timestamp" : "01:27:18-01:27:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Here, let's let's let's do this. Uh here's a trivia question for you just to warm you up.",
    "timestamp" : "01:27:19-01:27:22"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh what is next week? Next week is a Tuesday. Yeah A Wednesday. A Thursday.",
    "timestamp" : "01:27:22-01:27:31"
  },
  {
    "text" : "Are we getting hotter or colder? The game next week in 2003 week 14 is the polar opposite, if you will.",
    "speaker" : "Andy",
    "timestamp" : "01:27:32-01:27:41"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:27:41-01:27:50",
    "text" : "That is your clue. Ice cap game. I know what game it is. I just kept it. Brushki in the snow, throwing snow in the game. Yeah, it is."
  },
  {
    "speaker" : "Tony Dungy",
    "timestamp" : "01:27:51-01:27:53",
    "text" : "What a back week."
  },
  {
    "text" : "Miami Dolphins coming to town to visit the the Now ten and two New England Patriots killing it still have a loss, see?",
    "speaker" : "Andy",
    "timestamp" : "01:27:53-01:28:00"
  },
  {
    "timestamp" : "01:28:00-01:28:09",
    "text" : "I'm telling you Sporkle makes my brain better. Shout outsparkle. com. Can we do ads for Sparkle? Apparently we already are.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Tony Dungy",
    "timestamp" : "01:28:09-01:28:12",
    "text" : "So I mean I don't know why you're asking the question."
  },
  {
    "text" : "But yes. All right. So next week, um Patriots versus the Dolphins in the snow. We all remember this game too. Another game with a name. Game with a name. That's a good call.",
    "timestamp" : "01:28:13-01:28:26",
    "speaker" : "Andy"
  },
  {
    "text" : "I like that too.",
    "speaker" : "Greg",
    "timestamp" : "01:28:26-01:28:27"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:28:27-01:28:30",
    "text" : "If you have any Should we go?"
  },
  {
    "speaker" : "Greg",
    "text" : "We should highlight yeah, we should highlight games with names on like the podcast listings. Okay. So if people want to like walk in the game.",
    "timestamp" : "01:28:30-01:28:38"
  },
  {
    "timestamp" : "01:28:42-01:28:59",
    "speaker" : "Andy",
    "text" : "You boys are fucking around. Looks like I struck a nerve, huh, Andy? If you have any uh marketing tips or sporkle suggestions or um Or if you just want to tell one or all of us to shut the fuck up, you can text the Dynasty Hotline. Anybody remember? Pop quiz."
  },
  {
    "text" : "What's the number? Five five five five.",
    "speaker" : "Greg",
    "timestamp" : "01:28:59-01:29:01"
  },
  {
    "timestamp" : "01:29:01-01:29:17",
    "speaker" : "Andy",
    "text" : "Hey, is Indiana Jones here? No motherfucker, he's not real. Six oh three five oh five five oh five five oh five eight oh four three Fucking Greg, you're brain. 505? Yeah. Yeah."
  },
  {
    "timestamp" : "01:29:17-01:29:18",
    "text" : "It's like 555.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:29:18-01:29:27",
    "speaker" : "Greg",
    "text" : "All right, let's see if I can remember this for next week. All right. What is it? 603. Yep. 505. Yeah. What's the next four?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:29:27-01:29:29",
    "text" : "Come on. The last four is the easiest part."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:29:29-01:29:31",
    "text" : "Yeah. 8-0 for three."
  },
  {
    "speaker" : "Steve",
    "text" : "Troy Brown for three.",
    "timestamp" : "01:29:31-01:29:32"
  },
  {
    "speaker" : "Tony Dungy",
    "text" : "Troy Brown's three.",
    "timestamp" : "01:29:33-01:29:33"
  },
  {
    "speaker" : "Steve",
    "text" : "I get pictures. Troy Brown's fucking sick in a basket. He definitely would do that too. Yeah.",
    "timestamp" : "01:29:34-01:29:37"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. Corner three for sure.",
    "timestamp" : "01:29:37-01:29:39"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:29:40-01:29:45",
    "text" : "I need a mnemonic device. I just gave you one. Troy Brown for three. For the 505 though."
  },
  {
    "timestamp" : "01:29:46-01:29:47",
    "speaker" : "Andy",
    "text" : "SOS. Save our season."
  },
  {
    "timestamp" : "01:29:47-01:29:49",
    "speaker" : "Greg",
    "text" : "Troy Brown for three. SOS. Save our season."
  },
  {
    "timestamp" : "01:29:51-01:29:55",
    "text" : "All right. We've been on this. Me and Z Brown have been board dropping this for weeks.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:29:56-01:29:57",
    "speaker" : "Steve",
    "text" : "It has taken me a long time, let's be real."
  },
  {
    "text" : "603-505-8043. Shoot us a text. I found a good one on the podcast.",
    "timestamp" : "01:29:58-01:30:03",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:30:04-01:30:25",
    "speaker" : "Greg",
    "text" : "Good. Can you can you name the the Patriots statistical leaders of the two thousand tens? No. Cassieards, Russian T top ten in each category. This is gonna be awesome. I just figured out the next three days of my life. Until next week, we will see you later. Sacks. I don't know. Could be anybody."
  },
  {
    "text" : "See you later, you fucking idiot.",
    "timestamp" : "01:30:26-01:30:28",
    "speaker" : "Mom"
  }
]