[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Listen, go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom"
  },
  {
    "text" : "Welcome back to the Petrius Dynasty Podcast. I am your host, Andy Brown. With me are the Brothers Brown, fresh off of a uh I think our experiment into other fan bases was a short one, short-lived. from our uh Browns on Browns podcast earlier.",
    "speaker" : "Andy",
    "timestamp" : "00:22-00:44"
  },
  {
    "timestamp" : "00:45-00:50",
    "text" : "I thought I was I think I stunk up the joint. Yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "00:50-00:53",
    "text" : "No Uh C minus."
  },
  {
    "timestamp" : "00:55-00:58",
    "text" : "Very naughty. I was trying to think of a poop joke.",
    "speaker" : "Mom"
  },
  {
    "text" : "Yeah, we so we didn't end up dropping the Browns off at the pool.",
    "timestamp" : "00:58-01:01",
    "speaker" : "Andy"
  },
  {
    "text" : "Um shall not burn that.",
    "timestamp" : "01:01-01:04",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh so yeah, but I think going from watching all of these Cleveland Brown losses, even though that was just the highlights. The shift from that to the game we're talking about this week. Uh Greg, you want to introduce us to what this game is?",
    "timestamp" : "01:04-01:21"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:21-01:51",
    "text" : "Yeah, can we just play that uh the clash song? I fought the law and the love one. I fought the law and the the love one. I'll see if I can fit that in here in the post. That Describes this game. So which one was it? The single greatest single defensive player game in Patriots history. Okay. Anybody want to argue that?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:54-02:01",
    "text" : "Willie McGuinness did set the league record in sacks in a playoff game once. That's pretty good."
  },
  {
    "speaker" : "Greg",
    "text" : "I I couldn't think of any off the top of my head.",
    "timestamp" : "02:01-02:04"
  },
  {
    "text" : "What year was that, Andy?",
    "speaker" : "Steve",
    "timestamp" : "02:04-02:05"
  },
  {
    "text" : "Uh it'll be a couple years after.",
    "speaker" : "Andy",
    "timestamp" : "02:06-02:07"
  },
  {
    "text" : "Yeah. I remember that.",
    "timestamp" : "02:11-02:12",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I guess the Jag, whatever game that was. But uh Yeah, I would say that I mean, if this isn't number one, it's one and one A, you know?",
    "timestamp" : "02:12-02:22"
  },
  {
    "text" : "This is the two thousand and three AFC conference game. Patriots versus the Colts, Peyton Manning coming to town.",
    "speaker" : "Greg",
    "timestamp" : "02:22-02:31"
  },
  {
    "speaker" : "Andy",
    "text" : "In the snowish slee? Uh it's more like it was slushing. Anybody who's from New England will understand that term. It's It's snow but just barely it's right on the edge of rain and so it hits you and it melts immediately and you just get soaking wet even though it's snowing.",
    "timestamp" : "02:31-02:46"
  },
  {
    "timestamp" : "02:47-02:48",
    "speaker" : "Greg",
    "text" : "Soggy weather."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, from all the all the fans that you saw out there just standing there, just they were soaked. They weren't covered in snow. And it wasn't really accumulating, like it was kind of like that had that like You know, and you get the slush on the sidewalk, it was like that on the field. Yeah. Perfect football weather.",
    "timestamp" : "02:48-03:04"
  },
  {
    "text" : "That's what Virginia winter is. It's how it snows here.",
    "timestamp" : "03:05-03:08",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:09-03:12",
    "text" : "Yeah, so another reason not to go move to Virginia. Sounds great."
  },
  {
    "text" : "You're right. They were probably wishing for snow at that point in that stadium. They were like, how would I have snow right now?",
    "timestamp" : "03:12-03:17",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep.",
    "timestamp" : "03:17-03:18"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, all or nothing. That's what you need. Um Yeah. I mean there's gotta be so much hype going around this game Oh, going into this game, uh because this is like uh even if you're not a Patriots fan or Colts fan, this is like an NFL fan's dream.",
    "timestamp" : "03:18-03:34"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "03:35-03:35"
  },
  {
    "speaker" : "Greg",
    "text" : "It's the best offense versus the best defense in the league. playing about as well as those units can play too.",
    "timestamp" : "03:36-03:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. So I let's talk about the Colts because I think that was the kind of the big storyline. Is that coming into this game, the Colts were as hot as you can be for an offense? So hot right now.",
    "timestamp" : "03:44-03:56"
  },
  {
    "timestamp" : "03:56-03:58",
    "speaker" : "Greg",
    "text" : "So hot right now."
  },
  {
    "timestamp" : "04:00-04:12",
    "text" : "So because I alright, so I don't know if any of you have the stats for this, but I know one of them was that in the Colts' first two playoff games, they had not punted. They hadn't punted once.",
    "speaker" : "Andy"
  },
  {
    "text" : "We'll get to the that's the defining part of this game for me.",
    "timestamp" : "04:12-04:15",
    "speaker" : "Steve"
  },
  {
    "text" : "Well we'll get there. Um but let's talk um what else uh What else was happening with these cults coming into this game?",
    "timestamp" : "04:15-04:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Well if we want to back up a step to put it in historical context of the cults, right? They're pretty bad for a while. Until they drafted Peyton in nineteen ninety-eight.",
    "timestamp" : "04:23-04:35"
  },
  {
    "timestamp" : "04:35-04:35",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. First overall. He's their savior like that. Over Fled Arbaugh. Remember that? Yeah. Overall. Yeah, so he's like coming into his own. This is his fifth season in the NFL. He's He puts up a lot of gaudy numbers. But he but they can't get over the hump of the playoffs. So he's 0-3 in the playoffs prior to getting to this season. Which is good.",
    "timestamp" : "04:35-05:02",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "They called Jets last year or something.",
    "timestamp" : "05:02-05:04"
  },
  {
    "text" : "Yeah, they got the doors blown off 41-0 by the Jets last year. Yeah, yeah, yeah. But I mean the fact that they made three playoffs in You know, five years pretty good. Four years, right? At that point. So then this year rolls around. They go 12 and 4. He's a co-MVP. He's the NFL passing leader. He's like 4,200 yards on the season through the air, which in 2003 is ridiculous.",
    "speaker" : "Greg",
    "timestamp" : "05:05-05:29"
  },
  {
    "text" : "29 touchdowns and only 10 interceptions.",
    "speaker" : "Andy",
    "timestamp" : "05:30-05:32"
  },
  {
    "timestamp" : "05:32-06:09",
    "speaker" : "Greg",
    "text" : "Yeah. They're averaging a shade under 30 points a game, the offense. They're second in points, third in yards in the NFL. Yeah. They get the the fish and or the wild card, because the uh other coin VP that we just beat last week. Right. Steve McNair. So then all they do in that is they Shit stomp the Broncos 41 to 10 in Indianapolis. Uh I got the drive chart in front of me. This is the Colts drive chart. Touchdown, touchdown, touchdown, touchdown, field goal, touchdown, field goal, fumble, downs. That's"
  },
  {
    "timestamp" : "06:12-06:19",
    "text" : "Yeah, wasn't Peyton Manning uh didn't he have like a almost a perfect quarterback uh rating in that it was one of the two. I think it was that one.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. So Peyton Manning stats in that game, 22 of 26, 377 yards, five touchdowns, no picks. Fuck. 158. 3 rating. Perfect rating.",
    "speaker" : "Greg",
    "timestamp" : "06:19-06:28"
  },
  {
    "timestamp" : "06:28-06:28",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "06:28-06:34",
    "text" : "So those last two weren't even Manning. the the fumble down. So every time Ayn is in there. Garbage time. Yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "Touchdown or field goal.",
    "timestamp" : "06:35-06:35",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "06:35-06:46",
    "speaker" : "Greg",
    "text" : "Touchdown. They score they score touchdowns. Yes. Jesus. All right. So then they go to the Chiefs who had a great season as well. Yeah, they were undefeated for like week nine or something."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:46-06:46",
    "text" : "Yeah."
  },
  {
    "timestamp" : "06:47-06:49",
    "text" : "Want to hear their drive chart from that game? Yes, please.",
    "speaker" : "Greg"
  },
  {
    "text" : "Touchdown, touchdown, touchdown.",
    "speaker" : "Steve",
    "timestamp" : "06:49-06:50"
  },
  {
    "timestamp" : "06:50-07:08",
    "text" : "Touchdown, touchdown, touchdown. E End a half field goal touchdown touchdown downs So their score of touchdowns on like 80%. So that was a 38 to 35 or 38-31. In Kansas City.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "07:08-07:18",
    "speaker" : "Andy",
    "text" : "Yeah, because that was yeah, that was a shootout. That's right. Because it was um that was Priest Holmes's Chiefs, too. Correct. Yeah, and they're a bunch more."
  },
  {
    "text" : "Yep. Yeah. And Manning stat line, 22 of 30, 304 yards, three touchdowns, no picks. 138. 7.",
    "timestamp" : "07:22-07:30",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:30-07:31",
    "text" : "Only."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "07:31-07:32",
    "text" : "Quarterback rating."
  },
  {
    "timestamp" : "07:32-07:42",
    "speaker" : "Andy",
    "text" : "Yeah, so coming into this, he is just torching defenses. Yeah, leave leaving dead defenses in his wake."
  },
  {
    "text" : "Yeah, he's got 12 incompletions in two games and eight touchdowns. So it's about as good as Manny gets.",
    "speaker" : "Greg",
    "timestamp" : "07:42-07:51"
  },
  {
    "timestamp" : "07:51-07:53",
    "speaker" : "Andy",
    "text" : "Yeah, you can't you can't really get any better."
  },
  {
    "timestamp" : "07:53-08:07",
    "speaker" : "Greg",
    "text" : "In the playoffs. Yeah. So you got to think Colts fans are going, okay, this is the year. We got over that playoff hump. We are unstoppable. We're a wagon right now. We're going to the Super Bowl. Yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:08-08:13",
    "text" : "Kansas City, that's a tough place to win. Arrowhead. Went into Arrowhead, stomped them."
  },
  {
    "speaker" : "Andy",
    "text" : "And so uh that kind of segues into one of the quotes. that the commentators talked about. I think it was Bernie on the um uh Bonnie on the on the sidelines talking about before the game um Peyton Manning himself was coming in with a lot of",
    "timestamp" : "08:14-08:29"
  },
  {
    "text" : "Um with the Colts trailing New England by 14, Payton Manning was right about one thing and wrong about another. He was right when he called the Patriots, quote, a different animal. He said they're sound on both sides of the ball. We'll have to work for everything. He was wrong when he said If we lose this, it won't be because they confused me. Four interceptions, Greg, speaks for itself.",
    "timestamp" : "08:29-08:49",
    "speaker" : "Announcer"
  },
  {
    "text" : "First four interceptions of the postseason for him.",
    "speaker" : "Greg",
    "timestamp" : "08:49-08:52"
  },
  {
    "timestamp" : "08:52-08:57",
    "speaker" : "Andy",
    "text" : "So if they lose this, it's not going to be because this Pagers defense confused them."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:57-08:58",
    "text" : "Yep."
  },
  {
    "timestamp" : "09:01-09:33",
    "text" : "Which to me as at the time probably a a bigger Peyton Manning hater than I am now. Um wasn't a huge fan of him when he played, but uh he's growing on me now that he's retired. Um I would say that's that that almost sounds a little bit like uh him throwing his kicker under the bus. It's like, well, if we lose, it's not be gonna be because of me, obviously. So it's almost like he was kind of building in some other excuses as to why this team might lose. Maybe defensively, they're gonna give up too many points or whatever.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, which makes sense after the previous week. I mean they gave up 31. Yeah, 38.",
    "timestamp" : "09:33-09:38",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "09:38-09:42",
    "text" : "He's like all of them doing is scoring touchdowns because their defense wasn't great.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "09:42-09:50",
    "speaker" : "Greg",
    "text" : "That's true. Did did you see that stat about the punts too? No. About puntless games. They they they played the game. Oh, yes, yes, yes."
  },
  {
    "speaker" : "Andy",
    "text" : "I think I took a picture of it. Um it was, where do I have it? Um NFL postseason all-time games with zero punts. Colts this year, two games. All other teams, three games out of 391 possible games.",
    "timestamp" : "09:51-10:06"
  },
  {
    "speaker" : "Greg",
    "text" : "That's pretty crazy.",
    "timestamp" : "10:08-10:11"
  },
  {
    "text" : "Yeah. And so you were thinking this was like I think a lot of people going into this would think it was going to be a shootout because that's what it was in Indianapolis when the pages went there earlier in the season. Right.",
    "timestamp" : "10:11-10:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "10:22-10:39",
    "speaker" : "Greg",
    "text" : "Right. Which was like an all-time regular season game. So that's adding to the hype this too of like, okay, they went to Indy. There was a a last minute play to to win the game after a furious like 21 point comeback. So like Throw that in the mix of getting hype about this. Oh, absolutely."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "10:40-10:43",
    "text" : "Yeah. Networks or CBS is like a lot in this matchup."
  },
  {
    "text" : "Yeah, it's a wet dream. You got uh Brady, who's like the the winning quarterback that's young, that like, oh, he's he could be pretty good. Manning, who's like the highly toute, like That's first round pick and a seventh round pick going at it. They're both like really good earlier in their careers. Like that dynamics awesome. Mm-hmm. Yeah. The Belichick Manning dynamic is there. That",
    "speaker" : "Greg",
    "timestamp" : "10:45-11:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, they've been going at it for years at this point since 2000. And Meljack has often, not always, but often got uh Manning's number. Yep. Like Manning doesn't always have great games against him.",
    "timestamp" : "11:09-11:20"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "11:20-11:44",
    "text" : "So I think Manning was up, like one and six. Against Belichick to this point in his career? Something like five. Yeah. This might have been the sixth one. I think so. Yeah, because that was an early narrative, right? Of It wasn't so much Belichick versus Manning or uh Brady Manning. It was Belichick Manning, because Belichick was the defensive mastermind. Can he come up with something to to confuse Peyton."
  },
  {
    "timestamp" : "11:44-11:47",
    "text" : "And Peyton's over here being like, nah, he ain't gonna confuse me.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "If we lose it ain't because I was confused So the four INT said, buddy. Yeah, and then I I would I would say uh you know Peyton Manning Face is a very uh recognizable meme. I would have to say this game was probably its apex. Peak its manning phase peak all time manning phase. Just the from the get-go. From the yeah, his first interception he threw, they cut to him and he did the triple shrug",
    "timestamp" : "11:49-12:18"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "12:18-12:22",
    "text" : "Yeah, it wasn't. There's no less than 15 manning faces in this game. Oh, it's a good thing."
  },
  {
    "timestamp" : "12:23-12:33",
    "speaker" : "Steve",
    "text" : "Some of those ones you see in memes now are are in this game and like it's just full of great manning faces. He was grouchy. He was grouchy."
  },
  {
    "speaker" : "Announcer",
    "timestamp" : "12:33-12:33",
    "text" : "He was."
  },
  {
    "speaker" : "Andy",
    "text" : "Almost a reason to be. He was all grouchy. He looked war-torn.",
    "timestamp" : "12:34-12:39"
  },
  {
    "timestamp" : "12:40-12:44",
    "speaker" : "Greg",
    "text" : "Hey, he fought the law. And the law won."
  },
  {
    "timestamp" : "12:44-12:50",
    "text" : "Yeah, you can it really did. All right, so do we want to kind of get into this game then?",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. Sure.",
    "timestamp" : "12:51-12:51",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "12:52-12:57",
    "speaker" : "Andy",
    "text" : "Because yeah, I mean we we won't go dry by dry, but I think there's a lot of like I have a I had a scope."
  },
  {
    "speaker" : "Steve",
    "text" : "Quarter by quarter.",
    "timestamp" : "12:57-12:58"
  },
  {
    "speaker" : "Andy",
    "text" : "All right. You had a thought, Steve?",
    "timestamp" : "12:58-13:00"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "13:00-13:23",
    "text" : "Yeah, and it c it shows up pretty early in this game too, is The law, remember we had that poster of the law, Malloy, and the lawyer, you know? This is the first year they don't have lawyer, and they swapped him in for Rodney Harrison. Yes. And he balled out in this game. He did. He had an awesome, awesome game. I think it was fumble in the first quarter."
  },
  {
    "text" : "Well, no, he had the interception. So it's the game starts. The Patriots go out and um Like his first drive, I think it's like midfield or something, and they they go for it on fourth and one. It was like at the Colts 40. And it's like a Brady sneak as it always is. Um, but like that almost set the tone of like this is gonna be one of those games where we're just gonna like we're we're not playing it safe, we're gonna pull out all the stops. And it started literally the first drive going for the fourth and one. It was the first series. Yeah. And then uh it ends with Brady throwing one of my favorite of his touchdowns, I think. It's one of those ones that I I always forget about, but when I watch it, I'm like, oh, that is one of the greatest play calls and like execution of it as well. Where it was Brady, he had given out on the wing. And he faked the wide receiver screen to him so the defensive back comes up. And then Gibbons just runs past him. He just like lobs it to him in the end zone wide open.",
    "timestamp" : "13:23-14:23",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Perfect play call.",
    "timestamp" : "14:24-14:24"
  },
  {
    "text" : "Such a great play call.",
    "speaker" : "Andy",
    "timestamp" : "14:25-14:26"
  },
  {
    "timestamp" : "14:26-14:35",
    "speaker" : "Steve",
    "text" : "They're on like the seven, right? That's a perfect Patriots run that play all the time of just get it to wide receiver on, you know, inside the five-yard line team. He can make a miss and he's got a touchdown if he can."
  },
  {
    "timestamp" : "14:35-14:35",
    "text" : "Right.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:36-14:40",
    "text" : "And the dude bit on it so hard because they pump it and heavens was so open.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:40-15:36",
    "text" : "It was such a good play. And I don't think I've ever seen them really run that again that I can remember. That's true. But like that's your first like touchdown play call is that, which is great. Gibbons had four catches on that drive. Yeah. You didn't really do much else after that, but it's all good. It's all right. Uh and then yeah, and then of course like the Colts as they would do kind of almost all game just kind of move straight down the field with relative ease. I don't know about ease. I mean I think the pages made them work for it, but they were still moving the ball successfully. Get down to uh inside the New England like five-yard line. And then on third down, Manning gets confused for the first time of the day. And throws an interception to Rodney Harrison. And I thought if you looked at the play, uh, I think it was throwing to Tony Pollard, the the tight end."
  },
  {
    "text" : "He was.",
    "timestamp" : "15:36-15:36",
    "speaker" : "Steve"
  },
  {
    "text" : "And Marcus Paul, sorry, yeah. Um, and he looked wide open at the beginning, which he may have been, but then all of a sudden Ronnie Harrison kind of like the whole defense Like shifts as the play is happening and like rotates almost. All of a sudden Rodney's just he's just there.",
    "timestamp" : "15:37-15:53",
    "speaker" : "Andy"
  },
  {
    "text" : "It was a bad throw",
    "timestamp" : "15:54-15:55",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "15:55-16:00",
    "speaker" : "Andy",
    "text" : "It was not a good throw. He's thrown off his back, but he's in the middle of the year. He's backpedaling as he's throwing it."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "16:07-16:17",
    "text" : "Yeah. And then we saw our first Pavy Manning face where he goes, he's like, oh, he does his little shrug thing. He's like that was the triple shrug."
  },
  {
    "text" : "Like what? Yeah. You know? Who are you trying to blame there? That was all on you, bud. Like Pollard was wide open from the from the get go and you just missed the read until you found it too late.",
    "speaker" : "Andy",
    "timestamp" : "16:19-16:29"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, anyone interested, uh go to 19 minutes in the YouTube video? I wrote 'em down.",
    "timestamp" : "16:29-16:33"
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, I started I started writing down Manning Faces and then I had to start abbreviating MF, which I thought was funny because motherfucker. And then I just gave up because there were so many. I was like, I can't keep doing this.",
    "timestamp" : "16:34-16:46"
  },
  {
    "timestamp" : "16:46-16:52",
    "text" : "It's just Yeah, I would I wouldn't even like write them down. Just watch the whole thing because you'll you'll get a uh sprinkling of them in there.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "16:52-17:00",
    "text" : "You could you could legit go to the YouTube, which is two hours long and just click randomly in the bar and you'll see one within about a minute and a half.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:00-17:21",
    "text" : "Yeah, oh yeah. Yeah. You'll get there real quick. Won't take you long. Yeah, just just just watch random plays of the Colts on offense and you'll you'll get there. Um so that was basically the first quarter. Um both those drives took quite a lot of time. So Patriots 7 up 7-0 quarter. And I remember I think we move on."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "17:22-17:22",
    "text" : "Huh?"
  },
  {
    "timestamp" : "17:30-18:35",
    "speaker" : "Andy",
    "text" : "And also uh there was another one where they were uh Another stat, 10 touchdowns in the last 13 red zone drives. The Colts offense. Love that. Whoops. Um oh, and also on the the the Colts opened their offensive. play uh like when they got the ball back their first offensive play was a false start and it was the first penalty on offense the whole postseason for them. 117 plays. That was the first one they did. And it was literally the first play of the game for them. So that was nice. Uh all right, so first quarter over 7-0. And so I was thinking about this today where like some of these games, like I remember a lot about them. Or I'll, you know, for a lot of like Boston sports moments, I'll uh, you know, you you remember where you were and that sort of thing. In this game, I didn't remember where I was when I watched or anything like that, but I remembered the feeling that I had when I watched originally when I was watching it again this week."
  },
  {
    "speaker" : "Greg",
    "text" : "What do you mean?",
    "timestamp" : "18:36-18:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Because it was arousal for me. It was that, but also fear in there too. Of like, fear. Are we gonna be able to keep this up because and once we get in the second quarter like this is where it kind of hit like this whole second quarter and the way it all played out like wait wait we we could actually do this if we keep doing this like in the second half Like we can we can pull this off without Brady throwing any more touchdowns.",
    "timestamp" : "18:37-19:05"
  },
  {
    "text" : "Well they they dominated, but they weren't dominating on the scoreboard. I think that's what I'm saying.",
    "speaker" : "Greg",
    "timestamp" : "19:06-19:11"
  },
  {
    "text" : "Yeah. Yeah. And it's because their red zone offense was atrocious. Beneteria goes five for five on field goals. We were just shitting on the double overtime game last week where they went five for five for Carolina.",
    "timestamp" : "19:11-19:22",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "But I could have kicked those. You know what I'm saying? They're all from like within the ten.",
    "timestamp" : "19:23-19:26"
  },
  {
    "text" : "Right. All year they'd had shit red zone offense. And it's like if they had just scored a couple touchdowns there, this game's over and they were just kind of hanging in. And I get I get that fear too, Andy. I remember that.",
    "speaker" : "Steve",
    "timestamp" : "19:26-19:38"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:38-20:00",
    "text" : "Yeah Um but they were doing just enough on like every drive, it felt like. I think because I think they went out they went three and out twice, and they were both in the fourth quarter. So they were kind of still like moving the ball well, the Patriots were. Yeah. A lot of like five wide in the snow, as you do."
  },
  {
    "timestamp" : "20:01-20:03",
    "speaker" : "Steve",
    "text" : "But a lot of Troy Brown in clutch spots."
  },
  {
    "timestamp" : "20:04-20:09",
    "speaker" : "Andy",
    "text" : "Yeah, yeah. A lot of Troy Brown when you absolutely needed him. I think he didn't he convert another fourth down. He did."
  },
  {
    "text" : "He converted fourth in like a third and ten. He was",
    "speaker" : "Steve",
    "timestamp" : "20:09-20:11"
  },
  {
    "timestamp" : "20:11-20:28",
    "speaker" : "Andy",
    "text" : "And also uh on the first drive of the second quarter, the Page is driving again, there he had like two huge catches, and then Brady almost throws an interception. But Troy Brown knocks it out of the defender's hand so they were able to kick a field goal on that first drive."
  },
  {
    "timestamp" : "20:29-20:30",
    "speaker" : "Steve",
    "text" : "By the red zone, you're right."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:30-20:42",
    "text" : "Yeah, and so that was like a huge turning point too. Cause I mean it's it's three points, but it kind of all Like mattered at the end. So So yeah, Pats are up what 10 nothing at this point."
  },
  {
    "speaker" : "Greg",
    "text" : "Right. So after the turnover, they march down, they kick a field goal. It's 10-0 pats.",
    "timestamp" : "20:43-20:48"
  },
  {
    "timestamp" : "20:48-20:49",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Peyton in the start of the second quarter, so like Peyton's getting a little frisky. He's like, oh we gotta do something here.",
    "timestamp" : "20:49-20:56"
  },
  {
    "speaker" : "Steve",
    "text" : "Got a sixty-yard kickoff return. No first",
    "timestamp" : "20:56-20:59"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:01-21:27",
    "text" : "First offensive play. He tries to Yeah, he tries to stick one on the the sh the corner, on the corner out, and Ty Law who's Who's over there? He jumps off his guy. And you guys will remember this play where he starts floating back and he just does the one-hand scoop catch as he's sliding down. Probably the best of his three picks of the game, I would say."
  },
  {
    "timestamp" : "21:27-21:35",
    "text" : "Whenever whenever I hear the name Troy Brown, uh uh Ty Law, that's the play I think of. That's the first play that pops into my mind.",
    "speaker" : "Andy"
  },
  {
    "text" : "This might be his best interception ever.",
    "speaker" : "Steve",
    "timestamp" : "21:36-21:37"
  },
  {
    "timestamp" : "21:38-21:46",
    "speaker" : "Andy",
    "text" : "Yeah. I would agree. His most athletic. I mean, that was a one-handed fall at perfect catch. Amazing catch."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:46-22:06",
    "text" : "Well, it was just indicative of how Tylaw plays. He's he's proactive rather than reactive, right? I think you got a lot of cornerbacks in the league that they're decent players, but they're always just Trying to not get beat. Yeah. Where Ty Law would try and beat you."
  },
  {
    "timestamp" : "22:06-22:06",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Absolutely. You know, he'd be like iron quarterbacks, he'd be trying to jump routes. He'd be He'd be doing all the stuff that's like, I don't know, you just felt like a competitor that was trying to make plays every time he was out there.",
    "timestamp" : "22:06-22:17"
  },
  {
    "speaker" : "Steve",
    "text" : "I agree. Uh Levis does the same thing. Yeah. Gilmore does the same thing. Those two guys also were Who?",
    "timestamp" : "22:18-22:24"
  },
  {
    "text" : "Gilmore.",
    "timestamp" : "22:24-22:25",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:25-22:32",
    "speaker" : "Steve",
    "text" : "Gilmore. Gilmore. They'll like bait quarterbacks into throws and like read them and set them up and just like they are trying to beat you."
  },
  {
    "speaker" : "Andy",
    "text" : "I agree with that. And they it almost feels like they know not just what their responsibility is on the field, but like what the defenders around them need to be doing too. So Like on that play, especially. Like that, like you said, that wasn't the guy Ty Law was covering. But he dropped off of that because he saw Peyton Mannings going deep and Uh the act the commentators actually talk about like how many meetings. Tyla is like, I don't need to be in all these meetings. We have meetings all the goddamn time. And uh like, well, I mean this is this is what you get from those meetings, is that you recognize that",
    "timestamp" : "22:34-23:07"
  },
  {
    "timestamp" : "23:08-23:14",
    "speaker" : "Greg",
    "text" : "If this is the route combination, I'd be really interested to see what Tyla says about that."
  },
  {
    "text" : "Wait, well, do you think he was like, I bet they're feeling it a little bit and they're gonna try and take a deeper shot than the safer underneath stuff?",
    "timestamp" : "23:14-23:20",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "23:20-23:21",
    "speaker" : "Andy",
    "text" : "That's what I'm wondering, yeah."
  },
  {
    "timestamp" : "23:22-23:22",
    "speaker" : "Steve",
    "text" : "Right."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "23:22-23:24",
    "text" : "Or just like reading a quarterback's eyes."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "23:24-23:25"
  },
  {
    "timestamp" : "23:25-23:47",
    "speaker" : "Greg",
    "text" : "And like body language. You know, I feel like he was like a an instinct player, but then you'd think you'd get beat more often trying to do stupid shit. But yeah. I'd love to hear him talk like X's and O's to see what how much of it is like game prep shit versus how much he's just like He's going with the flow of the game and just reacting to what he sees."
  },
  {
    "text" : "All right, hang on. I'm going to go see if we can get Tylaw on the podcast just for you.",
    "speaker" : "Andy",
    "timestamp" : "23:48-23:52"
  },
  {
    "text" : "Dude, Tylaw also rules. Just as a person. He's the best.",
    "timestamp" : "23:52-23:57",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "23:57-24:04",
    "text" : "I'm not gonna lie, I tried to find some of his vodka. I tried really hard to get some of his vodka for this, but I You can't get it anywhere.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "24:05-24:10",
    "speaker" : "Greg",
    "text" : "Dude, I'm recording from a trampoline right now in honor of Tyla's trampoline parks."
  },
  {
    "timestamp" : "24:11-24:13",
    "text" : "That he sold and is no longer a part of.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "But yes. I got some notes on Ty Law though. We'll save that for the end.",
    "timestamp" : "24:13-24:17"
  },
  {
    "timestamp" : "24:17-24:19",
    "text" : "Oh yeah. I think we should.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "24:19-24:21",
    "text" : "About his personal life."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:21-24:31",
    "text" : "I think he's gonna come up a bit more. His career in general. Okay. All right. Um So the pages don't do much with that. Kick a another field goal."
  },
  {
    "text" : "Yeah, hit it down to the seven, kick a field goal. Classic. Just like we did last try.",
    "timestamp" : "24:32-24:36",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "And I think that on some of these field goals, um, the last couple, I think it was. They they actually had some good play calls, but Christian Fourier dropped two touchdowns.",
    "timestamp" : "24:36-24:50"
  },
  {
    "timestamp" : "24:50-24:50",
    "text" : "Yeah, he did.",
    "speaker" : "Steve"
  },
  {
    "text" : "Both hit him like in both hands, catches that he's made in other games. Some and on some like good play calls too. But I think if he had caught either one of those, this game looks very different. This game isn't nearly as close as it was at the end Patriots kind of walk away in a laughter almost.",
    "speaker" : "Andy",
    "timestamp" : "24:51-25:09"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. You're adding what eight points to their lead at halftime.",
    "timestamp" : "25:09-25:14"
  },
  {
    "text" : "Right. Yeah, exactly. And so yeah, so you're up more than two touchdowns. And uh yeah, and I think things might look a little different.",
    "speaker" : "Andy",
    "timestamp" : "25:14-25:23"
  },
  {
    "text" : "How did they get to that uh big 15-nothing halftime lead?",
    "timestamp" : "25:24-25:29",
    "speaker" : "Steve"
  },
  {
    "text" : "Well yeah, because right now it's 13-0, which means uh if my math is correct, we're two points away.",
    "speaker" : "Andy",
    "timestamp" : "25:29-25:35"
  },
  {
    "speaker" : "Steve",
    "text" : "Safety in this game",
    "timestamp" : "25:36-25:37"
  },
  {
    "timestamp" : "25:37-25:39",
    "speaker" : "Andy",
    "text" : "I guess. I don't I don't remember safety."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "25:39-25:57",
    "text" : "Uh Steve, do you do you remember what this is the I mean not obviously the the Tyla picks, everyone, those are the highlights you've all seen, but I remember this very clearly. And it like embodied the buildup and all that that Greg was talking about earlier of they showed that stat of how they had it and punted and like nobody else ever has never punted in the playoffs."
  },
  {
    "text" : "And and apparently all the uh the Indianapolis media was giving the punter a whole bunch of shit about how he's like not earning his paycheck.",
    "timestamp" : "25:57-26:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "The commentators are talking about a lot of money for just holding. Yeah. Just being a holder. Wow, you have paid so much.",
    "timestamp" : "26:05-26:11"
  },
  {
    "timestamp" : "26:12-26:22",
    "speaker" : "Andy",
    "text" : "Also, I I just want to point out. Um That the fact that the name the the punter's name is Hunter Smith and nobody called him Hunter the Punter."
  },
  {
    "text" : "I was just thinking that in my head.",
    "speaker" : "Greg",
    "timestamp" : "26:22-26:24"
  },
  {
    "timestamp" : "26:24-26:38",
    "speaker" : "Andy",
    "text" : "Such a miss. I mean for for like a Phil Sims type of guy too who's like We talked about last week about how fucking work joke work appropriate joke shit he does. That's a Like you're gonna miss the Hunter the Punter joke? Yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "26:38-26:41",
    "text" : "And like they're saying his whole name every time, like it's Troy Brown."
  },
  {
    "timestamp" : "26:42-26:43",
    "speaker" : "Andy",
    "text" : "Hunter Smith."
  },
  {
    "timestamp" : "26:43-26:45",
    "speaker" : "Greg",
    "text" : "As if there's another Hunter on the team."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "26:45-26:46"
  },
  {
    "timestamp" : "26:46-26:57",
    "text" : "It's a very millennial name too, Hunter. Yeah. Oh yeah. Yeah. Yeah. He wears skinny jeans. Oh. For sure. Yeah. Loves dancing on TikTok.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "26:57-27:04",
    "text" : "If our last name was green instead of brown, I'd name my firstborn Hunter. Hunter Green. Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:04-27:05",
    "speaker" : "Steve",
    "text" : "I like that."
  },
  {
    "timestamp" : "27:05-27:06",
    "speaker" : "Andy",
    "text" : "Because that's all he could wear then."
  },
  {
    "timestamp" : "27:06-27:08",
    "text" : "You can you can name your you can name him Nut.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Nut brown?",
    "timestamp" : "27:10-27:11"
  },
  {
    "text" : "Yeah. Hazel? I don't know. No, it doesn't work. Dark? Yeah, light, dark, I don't know.",
    "timestamp" : "27:11-27:20",
    "speaker" : "Steve"
  },
  {
    "text" : "You're a coffee nerd, you know, you'll think of something.",
    "timestamp" : "27:20-27:23",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I'll come up with something. Mocha.",
    "timestamp" : "27:23-27:24"
  },
  {
    "text" : "Feces.",
    "speaker" : "Greg",
    "timestamp" : "27:25-27:25"
  },
  {
    "timestamp" : "27:26-27:55",
    "speaker" : "Andy",
    "text" : "Hot brown. That hot hot brown. First name hot, middle name hot, last name brown. Speaking of hot garbage, the nap on this to hunter the punter was hot garbage. Yeah, oh uh and also speaking of of perfect names for uh that That that punt in general, the long snapper's name, Justin Snow. Justin Snow does he snap the ball two feet over the punter's head."
  },
  {
    "text" : "And it looked like Hunter the Punter was not ready for it. He looked like he was super surprised.",
    "speaker" : "Steve",
    "timestamp" : "27:56-28:01"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:01-28:13",
    "text" : "It goes over his head. The best part was Hunter the Punter is wearing two receiving gloves, still can't catch the ball. Yeah, he gets like uh half a finger on it. Yeah. Yeah."
  },
  {
    "text" : "And then it goes over his head that he's run after it.",
    "timestamp" : "28:13-28:16",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, so he's running after it and I think his his kick on that, because basically what he does is he takes it from like great play. From the ten yard line. Just like Just belts it out the back of the end zone. Just kick it.",
    "speaker" : "Andy",
    "timestamp" : "28:16-28:28"
  },
  {
    "timestamp" : "28:28-28:35",
    "text" : "Very heads up play. It was a hilarious looking. It's kind of it's probably really hard to kick a bouncing football on like a frozen grass that's all in the snow.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "28:36-28:36",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "28:36-28:36",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Hits it first time.",
    "timestamp" : "28:37-28:38"
  },
  {
    "text" : "Top corner, right, Greg? Dude, I I'd say he was the best player in the Colts in the first half. Yeah, you might be right. Dude, he saved him five points.",
    "timestamp" : "28:38-28:46",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "28:47-28:48",
    "speaker" : "Steve",
    "text" : "Yeah, yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "And they got a penalty out of it too, which I thought was hilarious, so they gave him a penalty. Did you see they like zoomed in on Hunter too and he was just like, eh. Yeah",
    "timestamp" : "28:48-28:55"
  },
  {
    "text" : "I did what I did the best I could in this situation.",
    "timestamp" : "28:56-28:58",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "28:58-29:11",
    "text" : "I'm a hunter stand. That guy rules. Doesn't pond for two games, comes in, gets snapped over his head, and then just boots it out the back. Electric playoffs. Yeah. That was amazing. That was like his only appearance."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "29:11-29:12",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "29:12-29:12"
  },
  {
    "timestamp" : "29:13-29:14",
    "speaker" : "Steve",
    "text" : "Another good punt later, I think."
  },
  {
    "text" : "Yeah, I think he punted once more, but so he had like two snaps the entire playoffs. One kick over his head kick to 15 rows deep.",
    "timestamp" : "29:15-29:23",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, one he kicks off 15 and one he kicks 50 yards. Yeah.",
    "timestamp" : "29:24-29:27"
  },
  {
    "timestamp" : "29:27-29:34",
    "speaker" : "Greg",
    "text" : "Yeah. And he'd be like, yeah, I fucking suck it making my money now, aren't I? They just saved you five points in a playoff game."
  },
  {
    "timestamp" : "29:34-29:36",
    "text" : "You know who maybe you should have been bitching at?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:36-29:39",
    "speaker" : "Greg",
    "text" : "Yeah. Fucking Justin Snow. Justin over there."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "29:40-29:40"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "29:41-29:44",
    "text" : "You'd never talk. Oh shit."
  },
  {
    "text" : "That's not gonna last forever and like special teams break down, even though it's not a third of the game, right Greg?",
    "timestamp" : "29:53-29:58",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "29:59-31:22",
    "speaker" : "Andy",
    "text" : "That's right. Third of the game. That's right. Um, and so I mean, I feel like this is uh kind of similar again to the first Colts game uh the Pats played in Indianapolis where Watching this, it felt like there was a lot of opportunity for the Patriots to like just step on the throat of the Colts and just like put this game away. Because you know, you just you just got a safety. on a what should have been a button. So you get two points and they're kicking the ball right back to you. And I think the kickoff return was actually pretty good. So you got the ball like almost midfieldish, I think. Yeah, your own 40, something like that. And three plays in, Bethel Johnson fumbles the ball. Colts recover. Like, well, fuck. Like that. We could have just like put the game away right there. Get any sort of points out of that. And now it's three touchdowns going a half. Um But instead, you've given Indianapolis a ball back with two minutes around midfield. And this is a team that we've seen can score quickly. Like real quick. And um they move it. Yeah. And so they're they they drive inside New England 20. And of course they score a touchdown and uh go into the oh wait. Nope. Uh Rodney pops his head up again."
  },
  {
    "text" : "He had a ball monster game.",
    "speaker" : "Steve",
    "timestamp" : "31:23-31:24"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:25-31:25",
    "text" : "Yeah, and"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:27-31:27",
    "text" : "this game."
  },
  {
    "text" : "This is this is some Harrison on Harrison crime. Marvin Harrison catches the ball over the mid middle and Rodney decleats him. Like I think if if Marvin Harrison had any fillings They were loosened by this hit.",
    "timestamp" : "31:27-31:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:43-31:59",
    "text" : "No, it wasn't like I don't know if it was like that. He got him like kind of low, but he got him right on the ball. Like Harrison was like bracing for the hit. Roddy went even lower when he got the ball and just kind of wasn't like a Stopping were glancing, but his hit was square on the ball."
  },
  {
    "text" : "Hit him square. Ball pops out. Our boy Tyrone Poole, who they mentioned uh used to play for the Colts, which I",
    "timestamp" : "31:59-32:07",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yes.",
    "timestamp" : "32:08-32:08"
  },
  {
    "text" : "Did not remember.",
    "speaker" : "Andy",
    "timestamp" : "32:08-32:09"
  },
  {
    "speaker" : "Steve",
    "text" : "And the Panthers.",
    "timestamp" : "32:10-32:11"
  },
  {
    "text" : "I remember him playing for the Panthers for a while, but I didn't know he played for the Colts. So uh uh found himself on the right side of the coin on this game, including that uh fumble recovery. So the pagers kind of escape a bit of like a what could have been some like a swing in points, a swing in momentum And they realize that and decide to run the clock three runs and kneel to end the half. Or two runs and a kneel. So halftime is 15-0. And this is where I'm thinking, like this defense is is fucking killing it with the turnovers. And if the offense can just do like one more thing, like we we have this game in hand and things feel pretty good. And Peyton for his life.",
    "timestamp" : "32:12-32:58",
    "speaker" : "Andy"
  },
  {
    "text" : "Their drive chart after those drive charts from the playoffs? Because it was what was yeah, it was a first half touchdown.",
    "speaker" : "Greg",
    "timestamp" : "32:59-33:05"
  },
  {
    "speaker" : "Andy",
    "text" : "In the other games were touchdown, touchdown, touchdown, touchdown, end of half, right? Right. Basically. And in this game, what was it?",
    "timestamp" : "33:07-33:14"
  },
  {
    "speaker" : "Greg",
    "text" : "Interception, interception, fumble safety, fumble. God damn. So they haven't had a drive that didn't end in a turnover or points for the other team. Still still haven't punted yet though. They have not punted yet.",
    "timestamp" : "33:15-33:31"
  },
  {
    "timestamp" : "33:31-33:38",
    "text" : "At least that screen's still alive, maybe. Maybe old games. You can have three, the rest of the NFL can have three.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So they literally punt once in this game.",
    "timestamp" : "33:38-33:41"
  },
  {
    "timestamp" : "33:41-34:02",
    "speaker" : "Greg",
    "text" : "Right. So like what you're saying, I mean it's like you're you you dominate this first half. Dominate. But They were a couple plays away from it being a one-score game going into halftime, which is scary in itself, especially how the the The game earlier in the season went when you you blew a twenty one point lead in six minutes. Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:02-34:10",
    "text" : "And the and the Colts are known for this too. Like they They were down two touchdowns to was it the Bucks earlier in this season on Monday night?"
  },
  {
    "text" : "Three touchdowns less than five minutes. They actually mentioned it in this game.",
    "speaker" : "Steve",
    "timestamp" : "34:11-34:14"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:14-34:55",
    "text" : "You're right. Yeah. Three touchdowns with about five minutes left, and they they won that game. So being up 50, nothing at halftime, it's nice, but it doesn't quite feel like enough. Right. Especially when uh Indy starts the second half with first of all a kick return to midfield on the opening kickoff. Then they converted fourth and one. And then this drive was like almost all runs as well. There was no real Peyton Manning in this. And Egrin, there's just like Egrid and James down their throat. And he ends up running it in from like the three. So now it's 1570 and thinking. Ah, god damn it."
  },
  {
    "text" : "Um which is you're a co you were a couple plays away from being a one point game. If they got a touch any of that half. Right.",
    "speaker" : "Greg",
    "timestamp" : "34:55-35:04"
  },
  {
    "timestamp" : "35:04-35:10",
    "text" : "Or if like doesn't like strip that guy of the ball on the interception, they don't get the three points, then you could be down two right now.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "35:10-35:22",
    "speaker" : "Andy",
    "text" : "Yeah. So this game is still very much in the balance. Um And then Patriots again settle for another field goal. Even though they get inside the 15."
  },
  {
    "speaker" : "Steve",
    "text" : "From the nine yard line kick a field goal.",
    "timestamp" : "35:22-35:24"
  },
  {
    "timestamp" : "35:24-35:25",
    "text" : "Yep.",
    "speaker" : "Andy"
  },
  {
    "text" : "Actually, no, we were on the four, took a delay of game, and then kicked it from the nine.",
    "speaker" : "Steve",
    "timestamp" : "35:25-35:28"
  },
  {
    "timestamp" : "35:29-36:13",
    "speaker" : "Andy",
    "text" : "Right, exactly. Uh, but then Indianapolis, they're only three and out, they're only punts of the game. So you're kind of like, okay, we're we're maybe like that first drive may have been a fluke. That's great. Maybe this defense is is ready to to hold again. And then New England just starts running the ball. Like Antoine Smith in this game. I think we set it last game or maybe it was like the last game of the season against the the the Bills Where they they ran it all down the throat and he it looked like he was running like it was 2001 again. Same in this game. I don't know if there's like saving his legs or something. No, it's the it's the shit fields It must be, but yeah, because he doesn't have a lot of. This offensive line played amazing too."
  },
  {
    "text" : "I could have I could have ran for 75 yards in this game for sure.",
    "speaker" : "Greg",
    "timestamp" : "36:14-36:17"
  },
  {
    "text" : "Yeah. And that's that's but that's with being tackled by the first guy to touch you. Yeah. Like the the offensive line, they were even mentioned it somewhere, it might have actually been right around here on some of these big Antoine Smith runs. Where the commentators are talking about how the Patriots offensive linemen were high fiving after the play. Because they had blocked it so well.",
    "speaker" : "Andy",
    "timestamp" : "36:18-36:39"
  },
  {
    "text" : "Yeah, Phil, that was good comment commentary. It was like it's never good when the offensive line's high fiving. Exactly. Yeah, it was funny, wasn't it, Andy? Did you like it? Did it make you giggle? No. Fucking hated it. Yeah, but you didn't",
    "speaker" : "Greg",
    "timestamp" : "36:38-36:55"
  },
  {
    "text" : "We win two runs. We went from our 30 yard line to their 30, just back to back Antoine.",
    "speaker" : "Steve",
    "timestamp" : "36:56-37:02"
  },
  {
    "text" : "Yeah, and it was gaping too. You could have dropped it. Yeah. Tractor trailer through those things. So then they kick another field goal, right?",
    "timestamp" : "37:02-37:11",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "37:11-37:12",
    "text" : "From the three.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "From the three-yard line. Kick a field goal. From the three-yard line, yeah.",
    "timestamp" : "37:12-37:16"
  },
  {
    "text" : "As you do. Just like any of these turn into touchdowns. This game is an absolute blowout.",
    "speaker" : "Steve",
    "timestamp" : "37:16-37:22"
  },
  {
    "timestamp" : "37:23-37:52",
    "speaker" : "Andy",
    "text" : "That's exactly what I'm talking about. But yeah, oh, Antoine Smith, 22 carries, 100 yards even. Nice day on the ground. I was stat checking myself. Yeah, but so so the Patriots, you know, have have answered that touchdown with two long drives but six points. So now we're up 21-7. And Colts get the ball back again. And Greg, you want to walk us through this drive?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "37:52-38:02",
    "text" : "Well yeah, and then you're like two plays. He hasn't thrown his required interception for every quarter of this game yet. True."
  },
  {
    "text" : "It's well done.",
    "speaker" : "Andy",
    "timestamp" : "38:04-38:05"
  },
  {
    "speaker" : "Greg",
    "text" : "And and Peyton gets a little happy for you. You could tell he starts like forcing it at times in this game. A lot of these picks came when he's you could tell it was just like a frustration pick.",
    "timestamp" : "38:05-38:17"
  },
  {
    "timestamp" : "38:17-38:24",
    "speaker" : "Andy",
    "text" : "And he's all he's on the move. He's like, this one especially is getting flushed out of the pocket. He's like rolling out to the side. So he gets he gets sacked the play before."
  },
  {
    "text" : "So second and 17. He's got nothing. There's your down 24 21-7 end of the third quarter. And he's just like tries to flick one out in the flat when there's a guy directly in his face. Overthrows him and then Ty Law again just like following the play, not the guy he was covering, fucking scoops in behind and just Snags it as he rolls out of bounds. Second pick of the game.",
    "speaker" : "Greg",
    "timestamp" : "38:24-38:51"
  },
  {
    "timestamp" : "38:51-39:01",
    "speaker" : "Andy",
    "text" : "I think Peyton was more surprised about this interception than the first one. He thought he had thrown it away safe. Like even if the guy's not going to catch it, he thought he threw it out of bounds. And there's Tyler Law diving to pick it off."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "39:02-39:10",
    "text" : "Good luck blaming that on somebody, Peyton. Like, oh my, that's yeah, that one could not have been more Peyton Manning's fault. 48-minute Manning face if you're at if you're"
  },
  {
    "timestamp" : "39:16-39:24",
    "speaker" : "Greg",
    "text" : "So yeah, so that's a basketball 26-yard line up 21-7. End of the third quarter. Yep. Game's over. Right."
  },
  {
    "timestamp" : "39:24-40:07",
    "text" : "Yeah, and New England uh like as that third half ends and the and the first uh fourth quarter begins, um like New England's drive, and they're inside the Indianapolis five. And this is where Fourier drops yet another one of his what should have been a touchdown. He hits him in the hands and just goes straight through him. Like it wasn't an easy catch, but it's an easy catch for uh an NFL player. It's something he's caught before. Drops it. And then the drive ends with Brady throwing an interception in the end zone. Which is his first interception at home all season.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And just a horrendous time to throw it to him not having a pick a couple of times in this game, but this one wasn't as flawless. Dietrich Ward running the slant. It wasn't his fault, dude.",
    "timestamp" : "40:08-40:18"
  },
  {
    "text" : "Fuck that. Why did he throw the ball? It's 21-7. You're on the five-yard line. It's 30. A field goal buries this game. And he tries to stick one into coverage to de board. What are you doing? I don't give a shit. You don't throw the ball if there's someone within five yards of him, Steve",
    "timestamp" : "40:19-40:39",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "It was not a great throw, but it was also a very, very badly run route. So this is his first seizure warrant. And like it's not like blame him.",
    "timestamp" : "40:39-40:47"
  },
  {
    "speaker" : "Greg",
    "text" : "Like why the play is. He's a neat player, okay? He's neat. He was a neat pickup, so you shut your goddamn mouth.",
    "timestamp" : "40:46-40:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Neat player, Greg Brown.",
    "timestamp" : "41:00-41:01"
  },
  {
    "speaker" : "Greg",
    "text" : "It wasn't me. It was Tom. Yeah. Via Greg Brown via Phil Sims via Tom Brady. So we'll just have you all quoting each other. What a neat pickup that guy has been for us.",
    "timestamp" : "41:04-41:16"
  },
  {
    "timestamp" : "41:16-41:45",
    "speaker" : "Andy",
    "text" : "He's neat. Apparently not that neat. Not neat anymore after. But this is Tom Brady's first interception at home. Since 2002 versus Miami. That's a long fucking time ago. That's like the December before. Long ass time ago. Uh it was his first interception home in the last 330 passes, and his first interception in the playoffs in the last 165 passes."
  },
  {
    "timestamp" : "41:46-41:53",
    "speaker" : "Steve",
    "text" : "You knew he was gonna throw one though when they put up a stat earlier in the game and they said, oh, he's hit 300 passes without throwing an I and T at home."
  },
  {
    "text" : "It's like saying they didn't punt the whole game. Yeah.",
    "timestamp" : "41:54-41:56",
    "speaker" : "Greg"
  },
  {
    "text" : "They haven't punked it for two games. Yep, or Adam and Atari hasn't missed all season.",
    "timestamp" : "41:57-42:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Or Peyton Manning's QB rating is 158. 3. Yeah.",
    "timestamp" : "42:03-42:09"
  },
  {
    "text" : "Uh yeah, so again, had a chance to step on the on the Colts necks and just didn't. Big turnover there.",
    "speaker" : "Andy",
    "timestamp" : "42:12-42:21"
  },
  {
    "text" : "A really bad turnover.",
    "speaker" : "Steve",
    "timestamp" : "42:21-42:22"
  },
  {
    "text" : "Yeah, and then on the next play, so the Colts get the ball to 20. The next play the referees missed the delay of game by like two or three seconds.",
    "timestamp" : "42:22-42:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That was bad. I didn't know you're gonna bitch about that. I watched that and I was gonna be like Well, let me let me predict your next statement. You're gonna bitch at Phil Sims for being like, oh yeah, if there's a one-second difference, the refs aren't gonna call it, right? No. You fucking prove it. You have that written down in your nuts.",
    "timestamp" : "42:32-42:51"
  },
  {
    "text" : "You definitely have. Let's go to the commentator, the anti-commentator section.",
    "speaker" : "Steve",
    "timestamp" : "42:51-42:54"
  },
  {
    "speaker" : "Greg",
    "text" : "I will I will show you the commentator section. The only thing that makes Andy more mad than a a missed call is when the commentator agrees with the missed call.",
    "timestamp" : "42:56-43:06"
  },
  {
    "timestamp" : "43:07-43:13",
    "speaker" : "Andy",
    "text" : "That's the shit on top of shit. Commentator section. Empty. Oh comment. Empty."
  },
  {
    "text" : "Empty. I have something for the comment. You just deleted that.",
    "timestamp" : "43:13-43:16",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't believe that for a second.",
    "timestamp" : "43:16-43:18"
  },
  {
    "timestamp" : "43:19-43:25",
    "text" : "Control Z. Uh what? Oh yeah, I fixed the typo. That was the last thing I've touched.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I have something for the commentator section while we're on it.",
    "timestamp" : "43:25-43:28"
  },
  {
    "text" : "Ooh. Well, hang on. Just to go back to Greg's point, what I was gonna say is Everybody bitching about how the pages and Tom Brady always get all the calls.",
    "speaker" : "Andy",
    "timestamp" : "43:28-43:39"
  },
  {
    "timestamp" : "43:40-43:45",
    "speaker" : "Greg",
    "text" : "Come on, Andy. Is it delay a game on their own 20?"
  },
  {
    "speaker" : "Andy",
    "text" : "That's Yeah, no relevance to this. But no, instead instead they get uh uh like 11-yard gain off of it, first down, moving the ball already. Yeah, fucked. The other the other two drives that they started without it, they didn't score. So how did this drive end up? They didn't score. How did what do you mean? Karma, that's why Steve. Oh Karma for cheating. You never catch the Patriots cheating. So Peyton Manning, the cheater that he is, will pay the price for this.",
    "timestamp" : "43:45-44:15"
  },
  {
    "timestamp" : "44:15-44:38",
    "speaker" : "Greg",
    "text" : "Well, backing up a step, did you see uh Ty Law and Harrison getting a little feisty on the sidelines when uh Brady threw that pick? No. Yeah, they showed it to even before, I think it was actually the drop by Fourier. Those two are on the sidelines, like huffing and puffing, being like, what? Okay, yes, that's what it was. Yeah. I missed that. I thought that was like pretty interesting."
  },
  {
    "text" : "Yeah, it was almost like the defense felt like they they realized that this game was on them to win.",
    "timestamp" : "44:38-44:45",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "44:45-44:46",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:46-44:50",
    "text" : "After that. After that, like end of that series, the end of that drive."
  },
  {
    "timestamp" : "44:50-44:54",
    "text" : "And it and they made they had already made enough plays to win the game.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "44:54-44:56",
    "speaker" : "Andy",
    "text" : "Oh, just in the first half alone."
  },
  {
    "text" : "Yeah. Like any points there. Mm-hmm. You're serious drivers.",
    "timestamp" : "44:56-45:02",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "You can start cruising. Yep.",
    "timestamp" : "45:02-45:03"
  },
  {
    "speaker" : "Steve",
    "text" : "Three score game. Give you the ball at the 31 yard line. And then you turn that into Zero points. Like, what the fuck? Exactly.",
    "timestamp" : "45:04-45:13"
  },
  {
    "timestamp" : "45:13-45:15",
    "text" : "What were you going to say about the commentators, Steve?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "45:15-45:18",
    "text" : "Well, I'll save that for my best. Okay."
  },
  {
    "text" : "All right, this drive might be my favorite uh defensive drive in in Patriots history.",
    "speaker" : "Greg",
    "timestamp" : "45:19-45:25"
  },
  {
    "text" : "Yeah. Uh so you've been teasing a Eugene Wilson game. I told you guys.",
    "speaker" : "Andy",
    "timestamp" : "45:26-45:34"
  },
  {
    "speaker" : "Steve",
    "text" : "This is your Eugene Wilson game.",
    "timestamp" : "45:34-45:35"
  },
  {
    "timestamp" : "45:35-45:44",
    "speaker" : "Greg",
    "text" : "Is this the one? I told you ages ago. So the best part is I didn't know it was coming."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:44-45:56",
    "text" : "Wait, wait, wait. So you're telling me that the reason you bought a Eugene Wilson jersey. . Is from the Thailand game. . Yes."
  },
  {
    "timestamp" : "45:57-46:00",
    "text" : "Well, I already had the O4 Tilad Pro Bowl jersey.",
    "speaker" : "Greg"
  },
  {
    "text" : "So I'm which you are currently wearing for our listeners who can't see you.",
    "speaker" : "Andy",
    "timestamp" : "46:00-46:04"
  },
  {
    "speaker" : "Greg",
    "text" : "Yes. Yeah.",
    "timestamp" : "46:04-46:05"
  },
  {
    "timestamp" : "46:05-46:07",
    "speaker" : "Andy",
    "text" : "That jersey's so sweet. Hello, that jersey."
  },
  {
    "timestamp" : "46:08-46:45",
    "speaker" : "Greg",
    "text" : "But the interest I I I I've been looking for these these plays for uh multiple years, maybe a decade, and they don't exist on YouTube except for embedded in this two hour They will just can't find there's no Eugene Wilson highlight package because no one even knows who Eugene Wilson is. We will we will make that package. We are going to be I distinctly remember like Two huge hits in the snow against Indy, but I had convinced myself by this point, I was like, that must have been next year's AF AFC conference game."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:46-46:53",
    "text" : "Yeah, no, no. Yeah, I confuse those two because I thought there was a Teddy Ibruski play in this game. And it wasn't. It's in the next one."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "46:54-47:12",
    "text" : "Right. Uh but yeah, Brandon Stokely coming over the middle. And I audibly gasp. I did too. It was like he catches it. He's the most defenseless receiver you've ever seen. Almost. Like as soon as he turns his head. You know Brent Stokely too. He looks like a fucking"
  },
  {
    "text" : "Less Volker.",
    "speaker" : "Steve",
    "timestamp" : "47:12-47:13"
  },
  {
    "timestamp" : "47:13-47:21",
    "text" : "He looks like a certified public accountant. He looks like a podcaster is what he looks like. And he just gets absolutely demolished.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "47:22-47:25",
    "speaker" : "Steve",
    "text" : "This is like Australia's idea of your teeth. This is the same thing."
  },
  {
    "timestamp" : "47:26-47:31",
    "speaker" : "Andy",
    "text" : "This is this is one of the but it was like shoulder directly to the the middle of your chest. Yeah."
  },
  {
    "text" : "Yeah, no flag. No, this is perfect. Especially back then. I mean, I think that now it would have been a flag just from the defensive receiver perspective.",
    "timestamp" : "47:31-47:39",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh back then you're an immediate flag in today's NFL. Yeah That one when a head snaps like that, because he got that that whiplash head effect, right? Where he hit him the shoulder directly in the chest, but Stokely's head goes, pshh.",
    "timestamp" : "47:39-47:53",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Which you've been kind of doing all day.",
    "speaker" : "Andy",
    "timestamp" : "47:58-48:02"
  },
  {
    "timestamp" : "48:03-48:14",
    "text" : "He's forcing. He's down. He's like flustered. He's confused. Yeah, he's confused. He's he's making late reads and he's fucking forcing balls and kind of almost took Stoke's head off. Yeah. So he's separated.",
    "speaker" : "Steve"
  },
  {
    "text" : "No less than two plays later. What happens? He's got Marvin Harrison going down the sidelines and he does one of those like try and drop it in the bucket throws. Yep. Or it was Reggie Wayne. And Reggie Wayne does that little like I'm gonna catch it, sees out of the corner of his eye what's going on, and like T-Rex unarms it. Yeah. And then Eugene Wilson just comes in and absolutely topples it. Just buckles him, dude. That one might have been harder than the first one. And I was like and it was midair. Massive hits within three plays and it was just like holy shit.",
    "timestamp" : "48:15-48:53",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "48:53-49:11",
    "speaker" : "Andy",
    "text" : "So for like if we have like new listeners who haven't seen this game, like maybe they became pages fans afterwards or something, uh just think of any launching penalty you've seen in the NFL on defense. It was that minus the flag. To the point where the commentators are even like arguing about whether it should be a flight."
  },
  {
    "speaker" : "Steve",
    "text" : "He used his shoulder. He got him kind of like right on the collarbone area. Yeah. So like the hit location was clean, but he was defenseless. Like he duffs. Yeah. Both of them. Yeah.",
    "timestamp" : "49:15-49:25"
  },
  {
    "text" : "Yeah, and and actually cause like f Sims was arguing, he's like, oh no, that was definitely clean. Like he didn't he didn't use his head, he used his shoulder, his head's like way out of the way. And then uh what's his name? The other guy's like, yeah, but I think they were talking about that it was uh the receiver's defenseless, and he goes, Oh.",
    "timestamp" : "49:25-49:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I think you could only And then they move on to the next play. I think you could hit it one, you couldn't hit him in the head though",
    "timestamp" : "49:42-49:48"
  },
  {
    "speaker" : "Andy",
    "text" : "It was a shoulder directly in the face mask. Yeah, it was it was dead right around. And he launched into it. It was just like But I mean in to to Reggie Wayne's credit, he popped right back up, but Jesus, I don't think I would have. I I would have just been like, just dig me a grave here. I'm not moving. It was. Stogley comes back too because he wasn't it.",
    "timestamp" : "49:50-50:10"
  },
  {
    "text" : "Stokey immediately was like, get me out.",
    "timestamp" : "50:10-50:12",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Stogley needed a break.",
    "timestamp" : "50:12-50:14"
  },
  {
    "timestamp" : "50:14-50:25",
    "speaker" : "Greg",
    "text" : "Like sometimes when you see those ones now though, like the helmet to helmet ones, it's like not cool. These were cool Yeah, I'll say it. These weren't injuries."
  },
  {
    "timestamp" : "50:26-50:34",
    "text" : "It might not be cool to say this, but it was cool to watch. This would be called targeting in uh In college football these days.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Announcer",
    "text" : "Oh yeah.",
    "timestamp" : "50:34-50:35"
  },
  {
    "speaker" : "Andy",
    "text" : "He wouldn't have been able to make the second one because he would have been ejected.",
    "timestamp" : "50:35-50:37"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "50:38-50:43",
    "text" : "Well, like w in his offense, he's playing within the rules of the time. True. Oh yeah, absolutely. He was coached that way and that's the way the game was playing."
  },
  {
    "speaker" : "Greg",
    "text" : "And you're playing the the Marvin Harrison, Reggie Wayne. Paperman Colts. Right. And that's like part of your game plan is to be physical. Right.",
    "timestamp" : "50:44-50:51"
  },
  {
    "text" : "Yep. Is to make them pay for anything, which is what you did ever since like the 2001 Super Bowl where you did it with the game. Yeah, but they've been doing it all game two.",
    "speaker" : "Andy",
    "timestamp" : "50:51-50:58"
  },
  {
    "text" : "They have been very physical.",
    "timestamp" : "50:59-51:00",
    "speaker" : "Steve"
  },
  {
    "text" : "Very physical, yeah. And the Colts receivers have been getting very frustrated.",
    "timestamp" : "51:00-51:04",
    "speaker" : "Andy"
  },
  {
    "text" : "Um very decapitated and very oatmeal brained. Boop.",
    "timestamp" : "51:04-51:12",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Just watch it again. It's awesome. But it is, it's it's literally one of those plays that make you go, oh, yeah when you're watching real time. Like, oh, I didn't see him coming. Because he comes out of nowhere.",
    "timestamp" : "51:12-51:24"
  },
  {
    "speaker" : "Greg",
    "text" : "I did. I audibly gassed. Yeah, I did on both of them. I was like, alarm and say, Lordy. Goodness. Goodness grief. Grief, as dad would say.",
    "timestamp" : "51:25-51:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:37-51:59",
    "text" : "Goodness grief. So after after Eugene's finished decleeting wide receivers, uh Manning gets sacked on third, which pushes him out of field goal range. Um and so now it's fourth and the country mile. Uh and there's no country strong boys co-MVPs in this game. So Peyton Manning on fourth down. Greg, do you want to walk us through this?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:00-52:39",
    "text" : "Yeah, I think this is uh this might be my favorite of the three title interceptions. I was gonna ask you actually. I mean it's fourth down and he's kind of like trying to stick one in there. But and it's like uh He's going to the corner, right? It's like a in seam to out corner for Harrison. And Tyler Law's got his back to Manning. And then the throw's coming like right by his shoulder and he like whips his head around and just like immediately reacts to the ball. I think it was the that's like his true ball skills come into play there. And he just snags it, turns around, starts doing his typical tie-law thing where he runs around for like 30 seconds and gets falling over himself without getting touched."
  },
  {
    "timestamp" : "52:39-52:54",
    "speaker" : "Steve",
    "text" : "Yeah. Did you see in on the replay where it looked like he was passing off Marvin? He was like pointing to this to the safety. Yeah, to the safety. Oh yeah. Turns his head around, sees the balls coming, was like, well, fuck that. There he goes and gets it. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because he knew that the ball was coming that way, but he thought it was gonna be up and over him.",
    "timestamp" : "52:54-52:58"
  },
  {
    "timestamp" : "52:59-53:29",
    "speaker" : "Greg",
    "text" : "Yeah, so he completes his hat-trick, third of the night, fourth for Manning overall. All three pretty nice uh uh interceptions. And the best part is Marvin Harrison has three receptions, 19 yards, and a fumble in this game. The guy who had 94 catches for 1,300 yards and 10 touchdowns in the season has three catches, as many as Ty Law. Yes."
  },
  {
    "timestamp" : "53:29-53:32",
    "text" : "Ooh. Yes. Tyler probably has more yards than that too.",
    "speaker" : "Steve"
  },
  {
    "text" : "Marvin Harrison, uh, three catches, 19 yards. Ty Law, three catches, 26 yards. There you go.",
    "speaker" : "Andy",
    "timestamp" : "53:32-53:41"
  },
  {
    "timestamp" : "53:42-53:43",
    "speaker" : "Steve",
    "text" : "That's awesome."
  },
  {
    "timestamp" : "53:43-53:50",
    "text" : "Troy Walters, who we'll touch on in a minute. Uh three catches, 30 yards. Probably should have had 31 if you wanted this game to continue.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "53:50-53:54",
    "speaker" : "Greg",
    "text" : "But we'll get it. I love better offensive player than Marvin Harrison, notably."
  },
  {
    "text" : "Yeah, I would agree. Uh he's yeah, he's a he's a more favorite uh Peyton Manning target.",
    "timestamp" : "53:54-54:01",
    "speaker" : "Andy"
  },
  {
    "text" : "Same catches, more yards, no fumbles. It's pretty clear.",
    "timestamp" : "54:01-54:05",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "54:05-54:30",
    "text" : "Yeah, I would say so. And I mean so this comes right off the the heels of that brady bad interception. Yeah. Where the Colts start storming down and then you get Eugene Wilson, Huge hit. Eugene Wilson, Huge hit, Tylaw pick. Yeah. And it's just like that is just as a kid who was like, those are my two favorite players on this team was Eugene Wilson and Tylaw. That's right. Like that is heaven. That drive is your Wetry. Heaven."
  },
  {
    "text" : "Mom, Mom, I need a Eugene Wilson jersey too.",
    "timestamp" : "54:31-54:34",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Exactly.",
    "timestamp" : "54:35-54:36"
  },
  {
    "speaker" : "Steve",
    "text" : "I already got the Pro Bowl one, Greg.",
    "timestamp" : "54:36-54:38"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "54:39-54:53",
    "text" : "Well, Santa. Yeah, right. I was like, what do you mean Santa can't get me a Eugene Wilson jersey? Santa's magic. Why doesn't he just fucking make one in his workshop, mom? Yeah. Give one of the goddamn elves to do. Yeah."
  },
  {
    "text" : "Oh Jesus. Yeah. Um, and so yeah, uh the Patriots don't do much kind of on offense the rest of this game. Uh they go three and out after this. But at this point they're almost like starting to try run clock. So there's like running the ball whatever they can. Um with whoever they have left, Antoine Smith, Kevin Falk, doesn't matter. Um Uh the Colts managed to put together a touchdown drive. They're in desperation mode at this point. They're down 21 Still down 21-7. Yeah, it's like not desperation.",
    "speaker" : "Andy",
    "timestamp" : "54:54-55:29"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "55:29-55:29",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Well no, because yeah, there's like five minutes left and Peyton's getting battered. Um and they're running the hurry up like no huddle, just like And Manning's not like doing all his like movement and stuff. He's like getting the the line, snapping the ball as quickly as he can, and just like going for it. So they eventually managed to score a late touchdown, Manning to Pollard. Um wasn't easy and took a lot more time than I think they wanted it to. Because this was Steve to Steve's point was where they started talking about how, oh, remember that game when they were down three touchdowns with five minutes left and they still came back and won it? And so they're trying to do that here and they just can't. Um it was shaky. It was touchy what yeah. So at this point, but now now it's 2114. Yes, yeah, with two and a half minutes left. Yeah. But uh Fourier kind of redeems himself a little bit, I would say, by recovering the onside kick. Caught it clean and This on size kick, it felt very like typical Vanderjacked, who's like, oh, I'm I'm so much smarter than these guys. Watch this. I'm gonna I'm gonna trick them. So they all like huddled And you could tell the Patriots knew it was coming because instead of doing like uh, you know, when you usually see an on-size kick rally, like everybody spreads out within like five yards, but all the way across the field, they were all huddled like inside the uh Inside the hash marks, like everybody except for two deep guys. I think it was Troy Brown and Kevin Falk or someone deep. And then everybody else is just like kind of milling around right in the middle of the field. And what the Colts decided to do was uh Vanderjack just like broke out of the huddle and just kicked it right at the Patriots. And it kicked it right at Fourier, who just caught it and fell to the ground. Like no bounce, no nothing. Just kick it right at him. And the Patriots recover the onside kick.",
    "timestamp" : "55:30-57:18"
  },
  {
    "text" : "Trying to outsmart themselves. I don't know. Yeah, you gotta try shit like that on-size kick.",
    "timestamp" : "57:19-57:23",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, that shit only works in the Browns though.",
    "timestamp" : "57:23-57:26",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, but uh yeah. But like you could tell that they knew it was coming, so just be like, all right, you know what? Fuck this, let's just do the regular onside kick. Like I'm sure they practiced that too.",
    "timestamp" : "57:26-57:36",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "57:37-58:04",
    "speaker" : "Greg",
    "text" : "But I'm with Greg. You gotta try that shit. Have you seen the guy, the the fat, like Spanish looking guy that Is uh he's like all these viral videos of him doing his special onsides kick. No, and he keeps being like, yo, hire me NFL. He's he's this guy that has figured out a way to like He kicks it directly at the ground right in front of him and it takes like a huge hop."
  },
  {
    "timestamp" : "58:04-58:04",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "58:04-58:33",
    "text" : "And enough that he can just keep running forward and like catch the ball. Yeah. 10 yards downfield. So he's got all these videos of him like, he'll kick it, he'll run, he'll open a car door and the ball go into the car door and then he'll close it. And it'd be like, yo, Eagles, sign me. These are all these videos. They're actually like, they got me thinking. All right. Maybe we should sign this guy. Got him this guy for sure. It's not an ad.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "58:33-58:38",
    "speaker" : "Andy",
    "text" : "I love kicker uh kicker trickshot videos. They're the best."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. And if you're talking about an onsides kick It's like the same skill every time, right? If you can figure out like one that works, that's pretty valuable.",
    "timestamp" : "58:38-58:50"
  },
  {
    "timestamp" : "58:50-59:03",
    "speaker" : "Andy",
    "text" : "Yeah. Although I have to imagine You could probably get somebody like a a Gostowski or uh Vinateri to be like, all right, see what this guy's doing in video? How long it'll take you to learn that? A week."
  },
  {
    "speaker" : "Greg",
    "text" : "Which makes me wonder why they haven't done that.",
    "timestamp" : "59:04-59:06"
  },
  {
    "timestamp" : "59:06-59:11",
    "text" : "Maybe they've tried and it doesn't work as well as it looks. I don't know. I don't know. He's pretty sad.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "59:12-59:16",
    "text" : "This guy's hit a half court basketball shot with uh on sides kick here.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "59:16-59:28",
    "speaker" : "Andy",
    "text" : "Damn. All right, I'll have a send in the video. We'll put it in the show notes. Let's get this guy on the fucking Get him on the pod. He looks like a real great interview too."
  },
  {
    "text" : "He does, right?",
    "speaker" : "Greg",
    "timestamp" : "59:30-59:31"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:31-59:32",
    "text" : "He looks like a big pod."
  },
  {
    "timestamp" : "59:35-59:40",
    "speaker" : "Steve",
    "text" : "Well, Colts fucked up, didn't hire him. He was actually probably like a little kid at this point, too."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep, so the Paiges get the ball. Um And New England again just starts running down the Colts' throats trying to waste as much time as possible. Uh no, they don't they throw it, remember? Oh yeah, okay on this drive, yeah, because suspect. A little bit suspect. Yeah, two and a half minutes left.",
    "timestamp" : "59:40-01:00:00"
  },
  {
    "text" : "So you got it on there 44.",
    "timestamp" : "01:00:00-01:00:03",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:00:04-01:00:04",
    "speaker" : "Andy",
    "text" : "Yep."
  },
  {
    "text" : "But the Colts have three timeouts.",
    "speaker" : "Greg",
    "timestamp" : "01:00:06-01:00:07"
  },
  {
    "text" : "Right. So you run it first down, throw it second down, which gets batted down, third down. Great throw to Troy Brown down the seam. Who's lined up against the linebacker, but the linebacker makes an incredible play and just knocks it out of his hands. Oh, it was a drop. Troy did have it. Now that I think that defender made a great play.",
    "speaker" : "Andy",
    "timestamp" : "01:00:08-01:00:28"
  },
  {
    "timestamp" : "01:00:28-01:00:32",
    "speaker" : "Steve",
    "text" : "He didn't have a great play for the situation he was in, but Troy had him beat and he should have had that."
  },
  {
    "text" : "Yeah, not a great throw. Not a great throw?",
    "speaker" : "Andy",
    "timestamp" : "01:00:32-01:00:36"
  },
  {
    "timestamp" : "01:00:37-01:00:55",
    "speaker" : "Steve",
    "text" : "Hold on, Brady. Definitely won Troy Browns. If you want anybody to believe you, you need to be uh there, dude. That was that was That play was on Troy. Even Troy Brown himself would say that was his fault. No. Of course he would say that about everything, even if it wasn't. Exactly. I'm sure he would, but this one wasn't."
  },
  {
    "text" : "I disagree. Andy and you know what? I will I will I will not take Troy Brown slander on this podcast from either of you. Especially on a play like that.",
    "timestamp" : "01:00:59-01:01:09",
    "speaker" : "Andy"
  },
  {
    "text" : "I am just These are the facts. They're libel. It's liable.",
    "timestamp" : "01:01:09-01:01:13",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Write it down. This is slander. Andy, you realize that you're like You're like the people that show up at the fucking Capitol trying to break in and store in the center, right? You're like what I doesn't matter what the truth is. I believe what my brain wants me to believe. And that's the end of the matter. You're absolutely wrong.",
    "timestamp" : "01:01:13-01:01:37"
  },
  {
    "timestamp" : "01:01:38-01:01:50",
    "speaker" : "Steve",
    "text" : "Same thing with anti-masks, Andy. You were just I'm just actually watching the ground. You refuse to hear everything like pro-masks. You're like, nope, that's just fake. No. No. The facts that I have created in my head."
  },
  {
    "timestamp" : "01:01:51-01:02:19",
    "text" : "See, now I would agree with you on this point if the garbage that was being spewed wasn't coming from the two of you. Who have iffy track records in general. Like if this was coming from if Bill Belichak came out and said, you know what, that was on Troy, I'd be like, yeah, all right, fine. If Troy came out and said, you know what, that was on me. I'd be like, you know what, Troy? I believe you. But the two of you, two of you were garbage. Steve Brown started this this podcast being like, oh no, these commentators are great. And now look at you. Yeah, okay. And Greg Brown.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Why are you so difficult? to your worldview upsetting to you? No in your safe space, you snowflake? This is what I'm saying.",
    "timestamp" : "01:02:27-01:02:35"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:02:35-01:02:50",
    "text" : "This is not a challenge anything because it's coming from you two. You soy boy, you fucking cock baby. You lib turd, lib tart. Oh, beep that. Is that okay?"
  },
  {
    "speaker" : "Mom",
    "text" : "Very naughty.",
    "timestamp" : "01:02:51-01:02:52"
  },
  {
    "timestamp" : "01:02:52-01:02:58",
    "speaker" : "Greg",
    "text" : "Sometimes naughty boy. That is being naughty. Are we allowed to say half of words like that?"
  },
  {
    "text" : "I don't think so.",
    "speaker" : "Andy",
    "timestamp" : "01:02:58-01:02:59"
  },
  {
    "speaker" : "Greg",
    "text" : "What about this? Is this okay? No. No. Very naughty. Very naughty indeed. Mom, what do you think?",
    "timestamp" : "01:02:59-01:03:07"
  },
  {
    "speaker" : "Mom",
    "text" : "Just know that's a naughty boy.",
    "timestamp" : "01:03:07-01:03:09"
  },
  {
    "timestamp" : "01:03:10-01:03:19",
    "speaker" : "Greg",
    "text" : "That was hilarious in a uh visual medium, what I just did. But We'll never see the light of day."
  },
  {
    "text" : "So after, I don't remember what we were talking about.",
    "timestamp" : "01:03:20-01:03:23",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, so the Patriots uh Patriots get the ball after after the uh Oh we were talking about Troy Brown dropping that conversion butterfingers Brown over there",
    "speaker" : "Andy",
    "timestamp" : "01:03:24-01:03:35"
  },
  {
    "timestamp" : "01:03:36-01:03:37",
    "speaker" : "Greg",
    "text" : "Blowing the game for the Patriots."
  },
  {
    "text" : "Oh, Patriots go three and out and punt for the second time in the game.",
    "timestamp" : "01:03:37-01:03:41",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:03:41-01:03:45",
    "speaker" : "Greg",
    "text" : "Uh what is Tylaw gotta intercept another one for him, Andy?"
  },
  {
    "timestamp" : "01:03:45-01:04:05",
    "text" : "Is that what's gonna happen? Does he? No, he doesn't. No. So uh that would have been sweet. Yeah, the Colts at this point have the ball back uh at their own 20 with two minutes left, like exactly two minutes left. They go the elusive four and out. Yeah. I believe they don't get any yards. Zero yards, four incompletions. So the Patriots.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:04:05-01:04:10",
    "text" : "He's complaining the whole time about Marcus Pollard being held because he goes in twice on third and fourth.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:04:11-01:04:20",
    "speaker" : "Andy",
    "text" : "But they didn't have to be a good thing. If they got a call, that would have been a soft call. It was contact, but it was 50-50. I'm sure Greg disagrees, but I don't give a fuck."
  },
  {
    "speaker" : "Steve",
    "text" : "They've been letting it go all game",
    "timestamp" : "01:04:20-01:04:21"
  },
  {
    "timestamp" : "01:04:21-01:04:47",
    "speaker" : "Andy",
    "text" : "Yeah. Um uh and then so the pages start at the 20. Uh run it three times. The third time is um a Tom Brady naked bootleg. Gets sniffed out. Tom Brady tries to juke the the one defender that's out there with him. Falls over and almost fumbles the ball away. So the knee is down."
  },
  {
    "timestamp" : "01:04:47-01:04:52",
    "speaker" : "Steve",
    "text" : "I had a huge problem with the the the slant in the end zone, I'm okay with that."
  },
  {
    "timestamp" : "01:04:52-01:04:53",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "The naked boot inside the 20 when you all you need to do is kick a fucking field goal to win this game. With Tom fucking Brady? What are you what are you doing? Why with the call?",
    "timestamp" : "01:04:53-01:05:05"
  },
  {
    "timestamp" : "01:05:05-01:05:10",
    "text" : "I my my problem with it is that Tom Brady doesn't go down like a sack of potatoes as soon as that defender goes out.",
    "speaker" : "Andy"
  },
  {
    "text" : "He does though. Like a sack of potatoes.",
    "speaker" : "Steve",
    "timestamp" : "01:05:11-01:05:15"
  },
  {
    "timestamp" : "01:05:16-01:05:30",
    "text" : "Well no, I mean like without like he should have just like fallen down, slid, taken the the loss, and that's it. But instead he tries to beat the guy. Shouldn't have been in a position. Gets taken down and then the ball gets ripped out. But luckily his knee was down already. Because he's such a bad runner.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:31-01:05:37",
    "speaker" : "Steve",
    "text" : "He was yeah, he was saved by that. That would have been if Peyton gets that ball, he's taking that to the house."
  },
  {
    "timestamp" : "01:05:37-01:05:39",
    "text" : "Right, because it's still a seven-point game.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Five seconds left on his 15-yard line. Doesn't matter if he has timeouts or not. He's gonna take that and score a touchdown and tie this game up.",
    "timestamp" : "01:05:39-01:05:46"
  },
  {
    "timestamp" : "01:05:46-01:06:06",
    "text" : "Yeah. So instead the pages are able to kick a field goal. So now they're up 10 and from the six-yard line. Right. This game's over. Game's over. Um But it ends, I think, in a perfect way because the Colts are driving, trying to, I don't know, put garbage time score up or something. You're not going to give up because it's it's a playoffs and you're still like",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:06:06-01:06:07",
    "text" : "Yeah, never know.",
    "speaker" : "Steve"
  },
  {
    "text" : "Right. You never know. But on fourth down, Manning completes a it's like fourth and ten, and Manning completes a pass to Troy Walters. For like it was like a five-yard completion, Troy Walters has enough room to go get the first down, but instead steps out of bounds a yard short of the line to gain. And so he gains nine yards on fourth and ten and it's turnover and dance. Game over. The perfect way to end this game, yeah. Bonehead. But uh when uh everybody in the stadium thought the game was over, including the people who are like wheeling on the stage to present the AFC Championship trophy. And the Pages still had to run one more play to kneel to actually officially end it, because there was like three seconds left. So everybody ran on the field and they had to like move everybody off. And you could tell Belichick was like pissed because he's the only one that recognized what was going on. He's like dragging people off the field and stuff. But a great way to end the uh This this season, the going undefeated at home. They went 10-0 at home, these New England Patriots. Which is a pretty impressive stat. What else? Uh Adam Binateri tied the uh playoff record for five field goals in a playoff game",
    "speaker" : "Andy",
    "timestamp" : "01:06:08-01:07:27"
  },
  {
    "text" : "Tylaw had three interceptions.",
    "timestamp" : "01:07:28-01:07:29",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:07:29-01:07:39",
    "text" : "Tyler? Uh yeah, tied for second in the NFL with three interceptions in a playoff game. David Gibbon. Somebody else had four who's somebody I didn't recognize."
  },
  {
    "speaker" : "Steve",
    "text" : "David Gibbons continues his NFL streak of playoff games with a touchdown.",
    "timestamp" : "01:07:39-01:07:43"
  },
  {
    "text" : "Does he? Okay.",
    "timestamp" : "01:07:43-01:07:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07:45-01:07:49",
    "text" : "Does he have like a super long streak of playoff games with TDs? Like seven or two.",
    "speaker" : "Steve"
  },
  {
    "text" : "I don't know. Maybe.",
    "timestamp" : "01:07:49-01:07:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Look at this up.",
    "timestamp" : "01:07:50-01:07:51"
  },
  {
    "timestamp" : "01:07:52-01:08:02",
    "speaker" : "Andy",
    "text" : "Christian Fourier continues his uh continues the the Patriots um streak of of dropped passes by New England tight ends."
  },
  {
    "timestamp" : "01:08:03-01:08:06",
    "text" : "Okay. Is that your worst, Andy? Are we doing bests and worse here?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I guess so. No, that's that can't be my worst because I always start off on the positive note, remember?",
    "timestamp" : "01:08:07-01:08:11"
  },
  {
    "speaker" : "Greg",
    "text" : "QBR rating of over 100 points. Yeah, well what did he finish with, Greg? 23 of 47, 237 yards. One touchdown, four picks, four sacks, rating of thirty-five point five.",
    "timestamp" : "01:08:13-01:08:26"
  },
  {
    "timestamp" : "01:08:29-01:08:30",
    "speaker" : "Andy",
    "text" : "Thirty-five point five."
  },
  {
    "speaker" : "Greg",
    "text" : "Um He was bad. He was really bad. Harrison, three catches, nineteen yards.",
    "timestamp" : "01:08:31-01:08:41"
  },
  {
    "speaker" : "Steve",
    "text" : "No one really on the receiving core did good. Uh I think they should have gave it. Pollard did all right, but Edrian James was like they they like had that one drive where he was running pr really well. I think right at the beginning of the second half. And then they just didn't give him the ball again. One of those sloppy, like grinded out kind of games in the playoffs. Like Adrian James was really good and he was definitely getting some space there. Peyton main two smart for his own good though. Wanted to force the ball. Fucking fingers, receives out to dry, throw a bunch of picks.",
    "timestamp" : "01:08:43-01:09:13"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:09:14-01:09:18",
    "text" : "Absolutely. Alright, do you want your best and worst?"
  },
  {
    "timestamp" : "01:09:18-01:09:55",
    "text" : "Well, can we talk about Thai Law? F Oh, you want to talk about Thai? Yeah, give it some. This is the Thai Law honorary episode here. You know. We've never really gone too far into depth about Thai Law. We haven't. So I said let's give him a little historical context. How many pages do we have here before the call in? Because let's understand the stack there. On a cold snowy day in December nineteen eighty-five. No. He's from Alequipa, Alequippa, Pennsylvania. You know who else went to his high school? That sounds familiar.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, I forgot that I used to know this funny stat.",
    "timestamp" : "01:09:55-01:09:58"
  },
  {
    "timestamp" : "01:09:58-01:10:02",
    "speaker" : "Greg",
    "text" : "Multiple people. Is Randy Moss one of them?"
  },
  {
    "text" : "No.",
    "speaker" : "Steve",
    "timestamp" : "01:10:02-01:10:02"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:03-01:10:03",
    "text" : "No."
  },
  {
    "timestamp" : "01:10:03-01:10:56",
    "speaker" : "Greg",
    "text" : "Mike Dicka, Tony Dorset, and Darrell Revis. That's oh Darrell Revis, yes. That's a in Presmarovich, Peep Marovic. Oh yeah. Dad. So he went, yeah, I grew up in Pennsylvania, went to Michigan, was an All-American at Michigan, 23rd overall picked by the Patriots in 1995. He so he played. I mean, he's part of that original throwback team, all the Bledsoe teams. He went to the Super Bowl against the Packers. Yeah. Uh five-time pro bowler, two-time all-pro. He had 53 career interceptions, seven touchdowns. He's in the Patriots Hall of Fame and the Pro Football Hall of Fame as of a couple years ago."
  },
  {
    "timestamp" : "01:10:56-01:10:58",
    "speaker" : "Andy",
    "text" : "Is he in the Jets Hall of Fame?"
  },
  {
    "speaker" : "Greg",
    "text" : "No. Nope.",
    "timestamp" : "01:10:59-01:11:00"
  },
  {
    "speaker" : "Steve",
    "text" : "We should induct Rivas into ours though.",
    "timestamp" : "01:11:02-01:11:04"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:11:04-01:11:19",
    "text" : "Yeah. He so I got a list of quarterbacks that Tylaw intercepted. Okay. Because he guys spanned multiple generations. So he's there's some sick names on here."
  },
  {
    "timestamp" : "01:11:19-01:11:23",
    "text" : "So can we guess how many are on that, Steve? You and me?",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, I only have the notables.",
    "speaker" : "Greg",
    "timestamp" : "01:11:23-01:11:25"
  },
  {
    "timestamp" : "01:11:25-01:11:29",
    "speaker" : "Andy",
    "text" : "Oh, all right. Never mind. All right. Give me the give me the notable names then. Never mind."
  },
  {
    "text" : "All right. First career interception was Jim Kelly. Damn. Good way to start your career. Dan Marino. Of course. Steve Young. Troy Aiteman. Boomer Seizin. Steve McNair, Phil Revers, Peyton, obviously. No killers. And of course, Tom Brady and Drew Bloodsell.",
    "timestamp" : "01:11:29-01:11:52",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:11:53-01:11:57",
    "speaker" : "Andy",
    "text" : "Yes. Oh beautiful."
  },
  {
    "timestamp" : "01:11:58-01:12:08",
    "text" : "Peyton. He loved picking off Peyton. Oh god you. How many did he have? He had a career total of nine interceptions of Peyton Manning.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "He really was his favorite receiver. Five of which were in the playoffs. Oh my God. And how many were returned for touchdowns? At least one. I mean, I can remember. He may have had two off of Peyton for touchdowns.",
    "timestamp" : "01:12:09-01:12:21"
  },
  {
    "timestamp" : "01:12:22-01:12:46",
    "speaker" : "Greg",
    "text" : "Yeah, I don't know. So he actually had he had two when he was on the Chiefs in 06, if you remember that. Oh, that's right. Yeah, it was a wild card game. Yeah. Yeah. He was getting old. He picked him off twice in the playoffs again. They got 25 Peyton has 25 career postseason interceptions. Five of them are from Tylaw."
  },
  {
    "text" : "How many of them are from Patriots, I wonder? just in general because obviously got another one with uh Ronnie Harrison.",
    "timestamp" : "01:12:49-01:12:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:12:57-01:13:01",
    "text" : "Well Greg just said some of those were when you're the Chiefs against Peyton."
  },
  {
    "text" : "That's true too. Yep Still great.",
    "timestamp" : "01:13:02-01:13:05",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh he picked off both the co MVPs this year, right? Because he got McNair in the regular season. Then so he had four picks against the two MVPs in one season. It's not bad. Uh when Belichick was asked about him we said, yeah, I mean a guy that has uh that has a rule named after him is probably pretty good. The tie law rule. Kind of like a result of this game.",
    "timestamp" : "01:13:06-01:13:31",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "This specific game, yeah. Because Bill Polian thought that uh Tyla was getting a little too handsy with his with his babies and decided to uh institute a rural that you couldn't do that anymore because of reality.",
    "timestamp" : "01:13:31-01:13:44"
  },
  {
    "text" : "Right. Just not allowed anymore. Yep.",
    "speaker" : "Greg",
    "timestamp" : "01:13:47-01:13:49"
  },
  {
    "text" : "That's an awesome quote from Belichick.",
    "speaker" : "Steve",
    "timestamp" : "01:13:50-01:13:51"
  },
  {
    "timestamp" : "01:13:52-01:14:33",
    "speaker" : "Greg",
    "text" : "Yeah. It really is. And also like about how he's just like a a cool dude. I gotta watch a bunch of interviews of them and he's just like I don't know he's funny. He's he's like cocky but not He's not a dick about it. Eva cocky. You know? Yeah, he's not wide just like Eva cocky. Yeah, yeah. He he sold Brady, his first home before Brady was the starter. Yep. Because they were both Michigan boys. So he When Brady moved here, he sold him a home and he was like, Yeah. I probably took like a hundred thousand dollar bath on it because of all I gave it to him furnished. But he's like, hey, he's a Michigan boy. What are you gonna do?"
  },
  {
    "timestamp" : "01:14:34-01:14:35",
    "speaker" : "Andy",
    "text" : "That's awesome."
  },
  {
    "text" : "Yeah. He told a good story too about uh after the um The snowball last year against the Raiders. He's he's good buddies with Charles Woodson. Oh right. And him and Charles used to like meet up after every game they play each other. And he said he went looking for him by the bus when uh after that game and Woodza wasn't there. He's like already on the bus. So Tyla went and into the Raiders bus after the snowball. It was like yo, what's it what's up, buddy? And he was like, nah, I ain't about that shit tonight. Not tonight. And he was like, Yeah, it's cause you got your ass whooped. And he's like, and then I ran my ass off that bunch.",
    "timestamp" : "01:14:35-01:15:15",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh beautiful. Yeah, I think um Brian Morey, who we had on the podcast a while ago, the guy from the uh Paget Hall of Fame. Right. He does his Patch from the Past podcast, and I think they had Ty Law on there as well. I believe they have. And it was uh it was a really good interview. I think he actually told that story on it. Yeah it's fantastic.",
    "timestamp" : "01:15:19-01:15:38"
  },
  {
    "timestamp" : "01:15:38-01:15:55",
    "speaker" : "Greg",
    "text" : "Yeah, he's just a legend. Just like a cool guy played with so much swag. Like that's what like jumps out at me is like Yeah. J just oozes confidence while he's playing. And that's why I think he was like my favorite player is like at every part of the game too."
  },
  {
    "speaker" : "Andy",
    "text" : "Like he wasn't afraid. He could tackle with the best of them. He can cover with the best of them. His instincts never seem to fail him. Like he never seems to make a wrong decision.",
    "timestamp" : "01:15:55-01:16:05"
  },
  {
    "text" : "And he's just The way he plays too, you know? Yeah. Trying to biggest moments. Like this game is a huge game. Huge game. He gets the best quarterback. He has three picks. This Super Bowl. He has a pick six. Like",
    "timestamp" : "01:16:06-01:16:20",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:16:20-01:16:20",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Every time you need a tie law to make a play, you made a play. Then like a big play though. Yeah. Yep. Yeah. It's like the Tom Brady gene, right? Yeah. Tom Brady's that same thing is when you need a play. You can trust Brady. He always like exceeds your expectations rather than like letting you down in a big moment. And Tyla was always like that for me too.",
    "timestamp" : "01:16:21-01:16:41"
  },
  {
    "text" : "I agree.",
    "timestamp" : "01:16:41-01:16:42",
    "speaker" : "Andy"
  },
  {
    "text" : "All right. Titanium. I hope not. Your nickname? I saw this like Zoom thing. And like, you know, has your name on there? Like before you log on. It just said T Leazy.",
    "speaker" : "Greg",
    "timestamp" : "01:16:43-01:16:57"
  },
  {
    "timestamp" : "01:16:58-01:17:00",
    "speaker" : "Steve",
    "text" : "Py Laws zoom thing? Yeah. Tea lazy."
  },
  {
    "timestamp" : "01:17:02-01:17:15",
    "speaker" : "Andy",
    "text" : "What tea lease? Tea lazy. Boy. Uh all right. Let's do best and worst. We've been going for quite a while here. Steve, you want to go first?"
  },
  {
    "timestamp" : "01:17:16-01:17:20",
    "text" : "Yeah, should I go negative since or oh do what you want first in this house?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:17:21-01:17:22",
    "text" : "You do what you want."
  },
  {
    "speaker" : "Steve",
    "text" : "You be my commentator one that I said earlier. Oh yeah, yeah. You know, I've been on this crusade about Phil Sims. Sexually harassing Armin Katayan.",
    "timestamp" : "01:17:22-01:17:31"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes.",
    "timestamp" : "01:17:32-01:17:32"
  },
  {
    "text" : "He does it again in this game. I don't know if you caught it.",
    "speaker" : "Steve",
    "timestamp" : "01:17:32-01:17:35"
  },
  {
    "timestamp" : "01:17:35-01:17:36",
    "speaker" : "Andy",
    "text" : "I didn't. I missed it."
  },
  {
    "speaker" : "Steve",
    "text" : "Is there a kickoff? Yeah, he said, I think those coaches got Armin a little fired up. You know? And like in a vacuum doesn't sound that creepy, you know, but he says it like after the kickoff's already happening and he like interjects it right at the end and just all like the feet things you've been talking about. He's like, what do you mean fire it up? Dude, I noticed one too.",
    "timestamp" : "01:17:36-01:17:57"
  },
  {
    "timestamp" : "01:17:57-01:18:07",
    "text" : "Oh, you heard another one about it? Well, I think it was that one. I I can't remember the exact wording, but I remember thinking like the way he said it was so suggestive.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:18:07-01:18:07",
    "speaker" : "Steve",
    "text" : "Yes."
  },
  {
    "text" : "And then Army like didn't respond to it. It was like, what this is weird.",
    "speaker" : "Greg",
    "timestamp" : "01:18:07-01:18:12"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:18:13-01:18:22",
    "text" : "And then they get the ball off. And then you're just like sitting there thinking about did he just like Makes us like sexual. Felt like sexual tension. Yeah."
  },
  {
    "timestamp" : "01:18:24-01:18:26",
    "speaker" : "Andy",
    "text" : "Uh something going on."
  },
  {
    "timestamp" : "01:18:27-01:18:52",
    "text" : "It's nice. And then my best was uh I don't know which of the coaches it was that you saw on the sideline, but uh one of the current coaches, the Steve O'Brien, who gave like Belichick a hug right after as he like picks him up. And they like they all celebrate on the sideline. He's like, I don't know, he must be like 13 maybe in this game. Yep, yep, probably. He's young, maybe even younger.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, probably your guy's age at that time.",
    "timestamp" : "01:18:52-01:18:54"
  },
  {
    "speaker" : "Steve",
    "text" : "There's our future coach.",
    "timestamp" : "01:18:55-01:18:56"
  },
  {
    "speaker" : "Andy",
    "text" : "That's right. Yeah, now he's coaching the satellite game.",
    "timestamp" : "01:18:57-01:18:59"
  },
  {
    "text" : "We watched it.",
    "timestamp" : "01:18:59-01:19:00",
    "speaker" : "Steve"
  },
  {
    "text" : "He's the defensive play caller. It's fantastic. It's really cool. All right. Greg, do you do you even want to do best and worse? I feel like that's the best.",
    "speaker" : "Andy",
    "timestamp" : "01:19:00-01:19:08"
  },
  {
    "speaker" : "Greg",
    "text" : "I just got three bests. Uh wonder third best was Tyla's second interception. I won the overthrow that he scooped. My second best was his first interception, the one-handed one where he's coming back towards his own end zone. And my best was his third interception, that spin around, boop, right in his thing. All right. Game sealer.",
    "timestamp" : "01:19:08-01:19:31"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:19:32-01:19:37",
    "text" : "And was your worst not knowing how to find the Eugene Wilson hits probably?"
  },
  {
    "speaker" : "Greg",
    "text" : "It doesn't exist. It doesn't exist. I do multiple times. Yeah, it will on the website.",
    "timestamp" : "01:19:37-01:19:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:19:44-01:19:44"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, but up to that point didn't. It's true.",
    "timestamp" : "01:19:45-01:19:47"
  },
  {
    "timestamp" : "01:19:47-01:19:49",
    "speaker" : "Andy",
    "text" : "Well, that's why we're here. We're providing a service."
  },
  {
    "timestamp" : "01:19:50-01:19:50",
    "text" : "Exactly.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:19:51-01:19:54",
    "speaker" : "Steve",
    "text" : "We are doing the whole world a favor here."
  },
  {
    "text" : "All right. That was my background for ages. That's why I knew that play existed. It was the second hit where he's like He's crushing Wayne. That was like in that was my background on my computer for like a long ass time.",
    "timestamp" : "01:19:56-01:20:09",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:20:09-01:20:12",
    "speaker" : "Steve",
    "text" : "That's a grill. That's a great."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:20:13-01:20:14",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:20:14-01:20:30",
    "text" : "Hell yeah. All right. My best. Um was Charlie Weiss's halftime show because Armagentan was given permission to sit in on the like the halftime Which is the Patriots halftime locker room.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:20:30-01:20:35",
    "text" : "Which is what made the other comment later creepy too. I was like a little bit. Yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Um but apparently Charlie Weiss at halftime said we have to give them no reason for hope. on offense, which didn't work on offense, but on defense, it absolutely did. I just thought that felt and and it kind of like went back to all the things we were saying. Like they they need to just like step on their neck and Charlie Weiss recognize it. But we have to give them no reason for hope.",
    "timestamp" : "01:20:35-01:20:57"
  },
  {
    "text" : "It's such a great coach quote. They were the the defensive players are so hot and bothered on the sideline because he said that in the locker room they had the chance and they throw the interception. Yeah maybe you pick inside the red zone and you turn that into an interception in the red end zone.",
    "speaker" : "Steve",
    "timestamp" : "01:20:57-01:21:10"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah",
    "timestamp" : "01:21:10-01:21:10"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:21:10-01:21:17",
    "text" : "Like you can't give him any hope. They're giving him hope now. And even like Tom Brady's attempting to fumble it on the naked bootleg would have given him hope."
  },
  {
    "text" : "Yeah, they did for a second until the play got overturned. Yeah. Yeah.",
    "timestamp" : "01:21:17-01:21:20",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:21:21-01:21:22",
    "text" : "Yeah. This game legit should have been a blowout.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I agree. Um and my worst was Dwight Freeney, who you heard his name when they were announcing the rosters and not again.",
    "timestamp" : "01:21:23-01:21:35"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:21:35-01:21:35",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:35-01:21:38",
    "text" : "Compared to like in the last game when they played on the turf."
  },
  {
    "timestamp" : "01:21:38-01:21:39",
    "speaker" : "Greg",
    "text" : "It's gotta be the turf."
  },
  {
    "speaker" : "Andy",
    "text" : "And he was just running past people in the turf. And they were talking about how even before the game, they he was Dwight Freeney was already frustrated because he I think he knew what kind of games it's gonna be because like you said it's gonna be on the sloppy field. Brady gets rid of the ball really quickly, so he's like, I don't have a chance. Like you can't get to a quarterback like that.",
    "timestamp" : "01:21:40-01:21:58"
  },
  {
    "text" : "And we're gonna run the ball at you and make you play run or two in the spot.",
    "timestamp" : "01:21:58-01:22:02",
    "speaker" : "Steve"
  },
  {
    "text" : "Which is exactly what he doesn't want to do. Um and then lastly, I'm gonna put this in the show notes, but I don't know if either of you caught this, but the commentators actually made a um They made a comment about it because they when they cut to like the f the fans, it was like coming back from uh coming back from commercial or something like that, and uh they showed this one dude And uh they're making a comment about like, oh, you should wear that. But this is the picture, guys. I don't know if you caught this.",
    "timestamp" : "01:22:02-01:22:33",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I saw it.",
    "timestamp" : "01:22:33-01:22:34",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:22:34-01:22:47",
    "speaker" : "Andy",
    "text" : "But it's like it's supposed to look like, you know, like a a bear skin or something on your head. But it looks literally like this guy has like skinned his own dog and is wearing that. Like the the look of on this face of this animal that he's wearing."
  },
  {
    "timestamp" : "01:22:47-01:22:58",
    "speaker" : "Steve",
    "text" : "Or it looks like his dog is just like he's like holding his dog like a backpack. Yeah, it could actually be his dog. Yeah, he's like, all right dog, it's time to keep me warm. Get on my back and put your head on top of my head."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:22:58-01:23:23",
    "text" : "But that whole face and everything with the ears and all of it, it just It's just perfect like New England person for this game with the with the shitty weather. It's like, you know what? The housewife's like, you can't wear that on public. You might even get on TV. And then like this dude's on TV and the commentators talking about what he's wearing. It's like, oh, you poor bastard. Love it."
  },
  {
    "speaker" : "Steve",
    "text" : "Did you spot the uh clouds corner banner in the end?",
    "timestamp" : "01:23:23-01:23:27"
  },
  {
    "timestamp" : "01:23:28-01:23:29",
    "text" : "I saw that.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:23:29-01:23:42",
    "text" : "I was like, what the hell dude? Let's get cloud, baby. My clouds fuck, yeah. I thought I loved the banner to him, but come on, let's get a little more creative with that with that name, you know? Cloud9. Something, yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:23:42-01:23:44",
    "speaker" : "Andy",
    "text" : "Anything other than Cloud's Corner."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:23:44-01:23:46",
    "text" : "Let's get Cloud as would have been mine, obviously."
  },
  {
    "text" : "Yeah, we know. Uh all right.",
    "timestamp" : "01:23:47-01:23:50",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:23:51-01:24:05",
    "speaker" : "Greg",
    "text" : "Hey, hey, you you get off of my cloud. Um that was a Chris Brahman. He's a BC guy though, right? That's why I probably liked him because he didn't do anything this year."
  },
  {
    "timestamp" : "01:24:06-01:24:10",
    "speaker" : "Andy",
    "text" : "Uh he had two games where he yeah he ran for a couple touchdowns each game and that was it."
  },
  {
    "timestamp" : "01:24:10-01:24:15",
    "speaker" : "Steve",
    "text" : "I thought he looked really good. Yeah I was getting cloudy"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:24:16-01:24:39",
    "text" : "But that's it for uh for the 2003 AFC Championship game against the Indianapolis Colts. Or what's left of them after this beatdown. So next week, the Patriots will return to the Super Bowl for the second time under Bill Belichick in three years. The makings of a dynasty, according to Phil Sims. So We will see what happens then."
  },
  {
    "speaker" : "Greg",
    "text" : "Where are we going?",
    "timestamp" : "01:24:40-01:24:40"
  },
  {
    "timestamp" : "01:24:40-01:24:46",
    "text" : "Where are we traveling? Next week, the Browns are taking uh this podcast to the Super Bowl.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:24:47-01:24:48",
    "speaker" : "Andy",
    "text" : "Steve."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:24:48-01:24:49",
    "text" : "See what I did there?"
  },
  {
    "timestamp" : "01:24:51-01:25:10",
    "speaker" : "Andy",
    "text" : "We are heading to Reliance Stadium, Gregory. Houston. Hi, Houston. Ugh. Houston sucks. Right. The last time we were in Houston, uh the Patriots were getting Uh a little bit manhandled by the upstart Texans who were not good this season."
  },
  {
    "timestamp" : "01:25:10-01:25:15",
    "text" : "Speaking of getting manhandled Houston, how about that Deshaun Watson stuff going around?",
    "speaker" : "Greg"
  },
  {
    "text" : "Sometimes a naughty boy. Very naughty.",
    "timestamp" : "01:25:15-01:25:19",
    "speaker" : "Mom"
  },
  {
    "timestamp" : "01:25:20-01:25:21",
    "text" : "All right, so we've muted Greg.",
    "speaker" : "Andy"
  },
  {
    "text" : "Very naughty. Very naughty. Very na very naughty.",
    "speaker" : "Mom",
    "timestamp" : "01:25:24-01:25:29"
  },
  {
    "speaker" : "Andy",
    "text" : "No, I've literally muted you. We can't hear what you're saying, Greg.",
    "timestamp" : "01:25:29-01:25:32"
  },
  {
    "speaker" : "Steve",
    "text" : "This is nice.",
    "timestamp" : "01:25:33-01:25:34"
  },
  {
    "timestamp" : "01:25:35-01:25:36",
    "speaker" : "Andy",
    "text" : "It's kind of nice."
  },
  {
    "text" : "I was saying you gotta have your fucking mute finger quick on me.",
    "timestamp" : "01:25:37-01:25:40",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, no shit.",
    "timestamp" : "01:25:40-01:25:41"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:25:41-01:25:42",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, god damn it. All right. Well, on that note, uh, I have some editing to do. And uh while I do that, we will see you later.",
    "timestamp" : "01:25:42-01:25:50"
  }
]