[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom"
  },
  {
    "speaker" : "Andy",
    "text" : "Welcome back to the Trist Dynasty Podcast. We're going to be 2003 week four? Is that right? Week five.",
    "timestamp" : "00:23-00:33"
  },
  {
    "speaker" : "Steve",
    "text" : "No, yeah, five. Yeah.",
    "timestamp" : "00:34-00:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:37-00:44",
    "text" : "We're really good at this. It's okay, we're professionals. 2003 week five."
  },
  {
    "text" : "This is episode 40, right? 40 something?",
    "speaker" : "Steve",
    "timestamp" : "00:46-00:49"
  },
  {
    "timestamp" : "00:49-00:51",
    "speaker" : "Andy",
    "text" : "40 something. Correct."
  },
  {
    "timestamp" : "00:52-00:54",
    "speaker" : "Steve",
    "text" : "So they all just mush together."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh we're killing it so far. We may start this one over because this is bad. No. No, we're definitely not gonna do that. We don't do that. We just one take this shit. We're raw. Fuck it.",
    "timestamp" : "00:56-01:08"
  },
  {
    "text" : "We'll do it live.",
    "timestamp" : "01:08-01:09",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly. Yeah, I don't know how many episodes we have, but we got a lot. Uh if you want to find you can go to patspod. com and you'll see them all there. So that's great. Oh wow.",
    "timestamp" : "01:10-01:20"
  },
  {
    "timestamp" : "01:20-01:24",
    "text" : "I personally like the analytics page of patspod. com.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:24-01:32",
    "speaker" : "Andy",
    "text" : "I bet you do. Bogcast-analytics. That's pretty good. Could use some work, but it's getting there."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:32-01:41",
    "text" : "Well it's just cool to see how many because the answer how many episodes have we done is anyone actually listening to them? And part of me feels like you're just making all this up."
  },
  {
    "timestamp" : "01:42-01:55",
    "text" : "I mean, maybe. We've released 44 episodes, so this is, I think we're four ahead. So 48. We're almost at 50 episodes. I think week seven will be our 50th episode. Maybe we'll have to do something for that. Like not invite Greg.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I thought he just shows up.",
    "timestamp" : "01:57-01:59"
  },
  {
    "timestamp" : "02:00-02:15",
    "speaker" : "Andy",
    "text" : "Yeah, I keep trying to lock him out, but climbs through the window. But this week we've closed the window, so no Greg. Um so she's gonna be me and you, which I think is uh I love my brother, but probably for the best it's"
  },
  {
    "speaker" : "Steve",
    "text" : "week because I feel like we're getting a lot accomplished, which is good because there's a lot to talk about in this game.",
    "timestamp" : "02:15-02:19"
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly. This game doesn't need any sidetracks or deep dives or anything like that. This is just Pure awesome to watch football.",
    "timestamp" : "02:20-02:31"
  },
  {
    "timestamp" : "02:31-02:33",
    "speaker" : "Steve",
    "text" : "Yeah, start with a Lombardi rating."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:34-02:38",
    "text" : "That's what I was just gonna say. I would give this, what are we out of six? I'd give this a solid five."
  },
  {
    "text" : "Yeah. I don't know what five and what what what's what would be a quarter? Because I'd even give it a five and a quarter.",
    "speaker" : "Steve",
    "timestamp" : "02:39-02:45"
  },
  {
    "text" : "Uh an AFC East Championship.",
    "timestamp" : "02:45-02:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That's what it was. Five Lombardies and an AFC East Championship.",
    "timestamp" : "02:48-02:51"
  },
  {
    "speaker" : "Andy",
    "text" : "All right. I mean AFC East Championships are a dime a dozen, so. You can throw a couple in there if you want. Just sprinkle them in.",
    "timestamp" : "02:51-02:57"
  },
  {
    "timestamp" : "02:57-03:01",
    "text" : "Well, I feel like two of them equals a conference, yeah, whatever.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:01-03:13",
    "text" : "There's just so many to choose from. But yeah, this game is a good one. The final score was your New England Patriots 38 and Steve Brown's Tennessee Titans 30."
  },
  {
    "timestamp" : "03:13-03:17",
    "speaker" : "Steve",
    "text" : "It wasn't it was a lot closer than that, though we'll say."
  },
  {
    "text" : "I mean, that was a touchdown away. I'd say it's a yeah.",
    "timestamp" : "03:18-03:21",
    "speaker" : "Andy"
  },
  {
    "text" : "It was definitely a lot closer than it felt a bit closer than that. For sure. Especially in the fourth quarter.",
    "timestamp" : "03:21-03:29",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:29-03:47",
    "text" : "Yeah, but for the fact that this game went to halftime 13-7 Titans, the second half was was bananas. They're actually every single drive except for the kneel down at the end to end the game. Ended in a score in the second half.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "03:48-03:51",
    "text" : "I didn't even think about that. Yeah, you're right. There was not a lot of punting."
  },
  {
    "text" : "There was no punting in the second half. I think there were in the whole game we had one, two, three, four punts. The entire game. And they all came in the second. No. One came in the oh.",
    "timestamp" : "03:52-04:02",
    "speaker" : "Andy"
  },
  {
    "text" : "That's a great measure of how good a game is. Like when I play golf I don't really keep score except for how many balls did I lose. And like when I'm at like 15, I'm like, well, this is a this is not going well. And when you're like 15 punts, you're like, well, this is terrible. But if I lost four balls in a round of golf, I'm like, wow. This is awesome.",
    "timestamp" : "04:03-04:22",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "04:23-04:36",
    "text" : "So yeah, so actually those five punts. I miss one. Um, but I think that's almost the inverse to how many Lombardies we gave it, maybe. The less punts, the more Lombardi's. I bet there's a ratio there.",
    "speaker" : "Andy"
  },
  {
    "text" : "I'll bet you're right.",
    "timestamp" : "04:36-04:38",
    "speaker" : "Steve"
  },
  {
    "text" : "Especially on the Patriots side, because the Patriots punted once.",
    "timestamp" : "04:38-04:43",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. Yeah, it's a fucking shit ass butt.",
    "timestamp" : "04:44-04:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "04:48-04:53",
    "text" : "Yeah. Oh, that's right. Oh, was maybe it wasn't just once. Maybe it was tw twice.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Either way. Not very many punting.",
    "timestamp" : "04:53-04:56"
  },
  {
    "text" : "Oh yeah, no, those twice. I see. Yep. And one of them was a 20-yard punt. You're right. That was not great. Um but yeah this is almost a tale of two halves really. The first half was Um the story of Let's say missed connections if you want to go all Craigslists on me. Uh where the page I saw that look. You don't know about Craigslist misconnections?",
    "timestamp" : "04:56-05:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "05:22-05:26",
    "speaker" : "Steve",
    "text" : "Oh, I know about it, Eddie, but I don't want to go on it with you."
  },
  {
    "text" : "Well that's that's where we're headed with this because this first quarter was um uh a football team looking for a scoring drive. And you know, I saw I saw you crossing the street and You look back and then you kept going and I joinked one off the the upright. Or my all-time uh field goal leader. Who had where is it? Uh made 33 in a row, 33 field goals in a row from under 40 yards. Missed two borderline chip shots. I mean both from under forty in the first half.",
    "timestamp" : "05:26-06:04",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:04-06:09",
    "text" : "At least they'll stop showing that stat though, because they kept Putting that stat up every single time."
  },
  {
    "text" : "And not only that, but they they put it up and uh and then they started showing um like when he came to kick his third field goal, they're like, oh, the last time he missed three field goals was back in like 1996 at Buffalo. I'm like, dude, that's a dick move like who who okay that so then but then of course he hit that field goal and I said I wrote down that he hit it probably out of spite these fucking announcers wait wait I thought the announcers were great Yeah. No, I'm saying I'm I'm just saying that Adam and Terry spited them.",
    "timestamp" : "06:09-06:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "06:39-06:42",
    "speaker" : "Steve",
    "text" : "Yeah, but not the announcements, it's the stack guys, you know?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:43-06:55",
    "text" : "Yeah, uh yeah, it's the the engineers in the booth, right? Throwing those stats just to be a dick in the truck. Uh yeah, let's talk about the commentators. Uh Gus Johnson and Brent Jones."
  },
  {
    "speaker" : "Steve",
    "text" : "I felt like they really added a lot to the enjoyment of this game.",
    "timestamp" : "06:55-06:58"
  },
  {
    "text" : "I mean, this Brent Jones, not Brent Jones, uh Gus Johnson during an exciting anything sporting event is just top-notch. He's he's probably the best at those exciting games.",
    "timestamp" : "06:59-07:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Just say are either of them in the hall of fame for broadcasting? And Dan.",
    "timestamp" : "07:10-07:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Well Gus guess Jaws has done a lot. He's still doing it, isn't he? Didn't Guest Johnson do like one of the Madden games?",
    "timestamp" : "07:17-07:24"
  },
  {
    "speaker" : "Steve",
    "text" : "I have no idea, dude.",
    "timestamp" : "07:25-07:26"
  },
  {
    "timestamp" : "07:28-07:35",
    "text" : "Because I know we got like uh internet famous for a while for his college basketball.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "He's a college basketball announcer. Oh yeah. And he's the one that's like from the parking lot. He's awesome. I don't know. I'm I'm Googling it. Alright, yeah. Fucking stack I took the big thing.",
    "timestamp" : "07:35-07:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Stack off of this bullshit. While you're doing that though, I had a um I think it's probably borderline football, not football. So let me, this seems like the perfect time for that. So let me let me share that with. You and the audience.",
    "timestamp" : "07:45-08:03"
  },
  {
    "text" : "He's just gonna go up and goose the center. And he just he sees the thumb. Hole right inside and you see him just lean forward. Big hole up inside. You don't necessarily call that in the huddle. You just get up there and you say, hey, there's a big opening. I'm gonna goose my center and get right on his tailbone.",
    "speaker" : "Speaker 4",
    "timestamp" : "08:13-08:30"
  },
  {
    "text" : "Uh football not football. Football not football. The hole get right on his tailbone. You see a big hole up there and you goose him and you get on his tailbone.",
    "timestamp" : "08:33-08:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:47-08:59",
    "text" : "So you walk up behind this other guy's butt, you rub his grumble a little bit, just get right up on his tailbone. You see the big hole."
  },
  {
    "timestamp" : "09:04-09:15",
    "speaker" : "Andy",
    "text" : "If if this is your first episode. Uh spoiler alert, anytime the announcers talk about goosing, I'm gonna play it for you. Because there's nothing better than listening to announcers talk about goose in the center."
  },
  {
    "timestamp" : "09:15-09:21",
    "speaker" : "Steve",
    "text" : "I feel like it's uh it's gone the way of the Dodo bird. I never hear any current announcers call it goosing."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:22-09:28",
    "text" : "I bet uh what's his name? Uh the Raiders. Tony Romo? Oh, he might talk about it."
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know. I don't know.",
    "timestamp" : "09:28-09:29"
  },
  {
    "timestamp" : "09:32-09:43",
    "speaker" : "Andy",
    "text" : "No, it was um he's coaching the Raiders now. What's his name? Fucking um Chucky, the used to do Monday Night Football."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, yeah, yeah.",
    "timestamp" : "09:43-09:44"
  },
  {
    "speaker" : "Andy",
    "text" : "God, I'm so bad.",
    "timestamp" : "09:45-09:46"
  },
  {
    "text" : "Johnson is not in the Hall of Fame, but he's also still doing it.",
    "timestamp" : "09:47-09:50",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "See, that's what I'm thinking. Yeah. So when he retires he probably will be. How long has he been doing it? Does it say?",
    "timestamp" : "09:51-09:57"
  },
  {
    "text" : "He's only 53. Play by play the Timberwolves from 96 to 97. That's how we got started. Okay. He did uh NFL for CBS from 98 to 2010.",
    "timestamp" : "09:57-10:09",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "10:09-10:11",
    "text" : "So it's just starting this time, right? That makes sense.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, and he focused sports mostly basketball, college basketball, and college football.",
    "timestamp" : "10:11-10:17",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So what's he doing now? Same stuff.",
    "timestamp" : "10:17-10:23"
  },
  {
    "text" : "Yeah, I think he does like 2017 Fox Sports announced he would be play-by-play for the big 13. I don't know. I don't know how that works.",
    "timestamp" : "10:24-10:34",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Was that the Big Ten, but they've added some teams?",
    "timestamp" : "10:34-10:36"
  },
  {
    "text" : "Is that football stuff? Stupid. Silly.",
    "timestamp" : "10:36-10:41",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "10:42-11:13",
    "speaker" : "Andy",
    "text" : "Uh all right, well that's great. Um I think before we get any further we should Shout this out because this is an all-time not not only is it really exciting, but it's an all-time name game. The names that produce in this game. are um I want to say like uh the the one-hit wonder kind of hall of fame almost"
  },
  {
    "speaker" : "Steve",
    "text" : "Because you would have this, but go on.",
    "timestamp" : "11:13-11:16"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "11:17-11:37",
    "text" : "Uh the the three players that would get my game ball in this game, number one, Dan Clecko. Yeah. Yeah. Hall of Fame Dan Cleco, who I think this was his rookie year, did a whole lot of nothing. Uh so one hit one there, Hall of Fame Dan Clecko. In this game, he had two fullback assists. He was in on the uh the goal line offense."
  },
  {
    "text" : "He played out of his score, yeah.",
    "speaker" : "Speaker 5",
    "timestamp" : "11:37-11:38"
  },
  {
    "timestamp" : "11:39-12:35",
    "speaker" : "Andy",
    "text" : "He had uh tackle for loss. He was playing out of his mind on the the defensive line as a no-sackle. And he also had one kick return for ten yards. Yes. Where he was the op man and they tried a short kick and he caught on the sidelines and actually kind of like. Tight rope the the sideline to get ten yards and setting up a mini Dan Copen. Yeah, exactly. You're setting the setting the stage for Dan Copen. Also had a great game with Bethel Johnson. Speaking of kick returns, he had five kick returns for 188 yards in this game. Yeah, he was and they kept kicking it to him, which was stupid. Like they because the Patriots were putting two guys back. It was him and Patrick Pass. They kicked it to pass once. They kicked it to Klecko once. And the other five times they kicked it to Bethel Johnson. He tore him up, especially we'll we'll talk more about it in the fourth quarter, his 71-yard kick return. And that wasn't the only good one that he had."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "12:35-12:36",
    "text" : "Yeah, all of them were good."
  },
  {
    "speaker" : "Andy",
    "text" : "Right. And then uh last but not least. Uh BC native. I think Dan Clecker, didn't he play at BC as well? He may have. But uh Mike Cloud on the other side of the ball. This was the Mike Cloud game. Seven carries, 73 yards, two touchdowns. Haven't seen him before this because apparently he was suspended for four games, which I looked up.",
    "timestamp" : "12:37-12:58"
  },
  {
    "speaker" : "Steve",
    "text" : "Yep.",
    "timestamp" : "12:59-12:59"
  },
  {
    "text" : "Apparently he was actually drafted by the Chiefs, but obviously the Chiefs backfield was stacked, so he didn't play. But uh in uh late in the 2002 season, so the season before this, he tested positive for Nandrolone use and was suspended for the first four games of this 2003 season. But he later sued Muscle Tech after claiming that one of their over-the-counter supplements, Nitrotech, caused a positive test.",
    "timestamp" : "12:59-13:29",
    "speaker" : "Andy"
  },
  {
    "text" : "So I totally will believe because there's no regulation on that shit.",
    "speaker" : "Steve",
    "timestamp" : "13:29-13:33"
  },
  {
    "text" : "Right. Oh god, yeah. And there was like a quote from one of the um the New York Times about him after this game about how um basically he's like, yeah, look, uh I filed a a lawsuit against them. But uh here it is. But Cloud knows the lawsuit is unlikely to clear his name. Quote, the damage is done, he said. Instead he's just happy to be back on the field with the familiar number on his back. So y he knows that like It's out there and he's gonna be looked at as like some cheater, but he was sick.",
    "timestamp" : "13:33-14:08",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:09-14:27",
    "speaker" : "Steve",
    "text" : "This dude he's I'm kind of pissed he didn't like stick or whatever happened because You can be like, let's get cloud, you know? Come on, everybody, let's get fucking cloud. You know, I kept writing that over and go, let's get fucking cloud career long, baby, 42 yards. Two touchdowns."
  },
  {
    "timestamp" : "14:27-14:31",
    "text" : "Seventy-three carries, seventy uh seven carries, seventy-three yards, two touchdowns.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And bullshit with the one-hit wonders, because he has five touchdowns this year.",
    "timestamp" : "14:32-14:38"
  },
  {
    "timestamp" : "14:39-14:42",
    "speaker" : "Andy",
    "text" : "Yeah, two in this game, uh two in another game, and one more, and that's it."
  },
  {
    "timestamp" : "14:43-14:46",
    "text" : "I'm stoked for taking to get cloud later on this season. Are you kidding me?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "14:46-14:52",
    "speaker" : "Andy",
    "text" : "Oh, hell yeah. Uh no, is it Mike? Uh get off of my cloud. No, was the Burmanism for this."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "14:53-14:56",
    "text" : "Cloud, baby. He came in and hyped them up."
  },
  {
    "text" : "Uh but we're getting ahead of ourselves, I think, in terms of what's happening in this game. Sure. Do we want to just like go through this?",
    "speaker" : "Andy",
    "timestamp" : "14:57-15:07"
  },
  {
    "text" : "I will say this. We played the Titans not too long ago, the end of last year. Good call. And that was like we had Scott on, and we all kind of agree this is the absolute worst game of all time to watch. It was so bad. And this game is the exact opposite. And this game was an awesome game to watch. And honestly, the teams weren't like too too different, but Uh yeah, if you're gonna watch one Titans game, watch this one. But one of my first notes is all that stuff we learned about Steve McNair in that first one. made me love him even more than I already did. About him being country strong and loving taking naps and hating working out and just being a real country boy. I thought that was the best.",
    "timestamp" : "15:08-15:50",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:50-16:15",
    "text" : "Yeah. And he put this team on his back this year. Well they had that game anyway. Yeah. It started like what I think it was four years ago. It was at like Less than 40% or something like that. And this year it was like 79. 8% of the offense went through Steve McNair, which is bananas. Eddie George toast. Oh yeah, complete toast in this."
  },
  {
    "text" : "I mean, I was calling him out in that other Titans game, you know, um, for oh, he had 101 yards, but it took him 31 carries to get there. And this game he had a Pretty similarly terrible stat line.",
    "speaker" : "Steve",
    "timestamp" : "16:16-16:28"
  },
  {
    "text" : "He had 15 carries 35 yards with a long of 12.",
    "speaker" : "Andy",
    "timestamp" : "16:28-16:32"
  },
  {
    "speaker" : "Steve",
    "text" : "This is his last season in Tennessee.",
    "timestamp" : "16:32-16:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and they're even they're even talking about it, the commentators about how a lot of people are saying he's washed. So let's see if he can run on this Patriots defense who In all honesty, like this patriot's defense was held together with super glue and like elastic bands",
    "timestamp" : "16:35-16:52"
  },
  {
    "speaker" : "Steve",
    "text" : "They got a little healthier than like at least no one got hurt this game.",
    "timestamp" : "16:52-16:55"
  },
  {
    "text" : "Well, uh before, like they were they were talking about how Willie McGuinness was out this game, which is why our boy Matt Chatham was starting, because McGinnis had a neck injury. Yep. And played well. Um and who else was starting? Uh Ty Warren was starting, getting the start on the defensive line over. Whoever the hell it was last year that that played like garbage. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "16:56-17:20"
  },
  {
    "speaker" : "Steve",
    "text" : "They just drafts right around here are fucking money.",
    "timestamp" : "17:20-17:24"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:24-17:25",
    "text" : "Top notch. Yeah, because you have to be a little bit more."
  },
  {
    "timestamp" : "17:26-17:30",
    "text" : "They're rookies and stuff, but you know that they're gonna be like really good for a long time.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because you have him, Eugene, and uh Asante Samuel Samuel, yeah. All this year, all this yeah, all make and play in this game. Because Eugene Wilson especially at the beginning of this game, was all over the place. He was playing. They couldn't they couldn't stop talking about how he was um a converted Cornerback playing safety. It's like look how well he breaks on the ball and he's such a good cover guy. It's like well, he was that good. He probably still playing cornerback, but okay.",
    "timestamp" : "17:30-17:56"
  },
  {
    "text" : "Let's put some respect on Eddie George's name. He makes a thousand yards this year.",
    "speaker" : "Steve",
    "timestamp" : "17:56-18:01"
  },
  {
    "text" : "Really?",
    "timestamp" : "18:02-18:02",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:03-18:03",
    "speaker" : "Steve",
    "text" : "Yes."
  },
  {
    "speaker" : "Andy",
    "text" : "Rushing?",
    "timestamp" : "18:04-18:05"
  },
  {
    "speaker" : "Steve",
    "text" : "Three yards per carry, yeah. A thousand thirty-one yards, five touchdowns.",
    "timestamp" : "18:05-18:08"
  },
  {
    "text" : "Shit. Good for him.",
    "speaker" : "Andy",
    "timestamp" : "18:09-18:11"
  },
  {
    "timestamp" : "18:12-18:13",
    "speaker" : "Steve",
    "text" : "He's, I mean."
  },
  {
    "text" : "That surprises me, not gonna lie.",
    "timestamp" : "18:14-18:16",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "1300, 1300, 1300, 1300, 1500, 939, 11 seven sixty five a thousand thirty one Damn. I guess he finished with Dallas. I don't remember that.",
    "timestamp" : "18:16-18:26"
  },
  {
    "timestamp" : "18:26-18:28",
    "text" : "Oh, I do remember that.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:28-18:30",
    "speaker" : "Steve",
    "text" : "He plays eight games there."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:31-18:42",
    "text" : "I want to say that was like during the true blood so era over there too with uh Bill Parcells running that show. 2004. Yeah, something like that. Maybe that's a little early. I'm not sure."
  },
  {
    "text" : "But yeah, he almost broke Eddie George had like a terrible game, but he had one in that first quarter. We almost broke a long run. And Eugene fucking came across the team spot. Got him.",
    "speaker" : "Steve",
    "timestamp" : "18:42-18:54"
  },
  {
    "text" : "Yep. Just barely.",
    "timestamp" : "18:54-18:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, Eugene was all over the especially in that first half.",
    "timestamp" : "18:56-18:59"
  },
  {
    "text" : "He was all over the place. Yeah, should have you should have had a uh a pick on the first drive. Yep. The red zone. Paul hit him right in the face mask, but Um yeah, so just to recap this first quarter, um basically both teams are just driving the field at will. Tennessee drives straight down the field. And then McNair almost throws two back-to-back interceptions. So they settle for field goal. And then our boy Bethel Johnson takes a kick return to the Tennessee 43. like huge return to open the the the start for the the Patriots. They drive inside the Tennessee 10-yard line in like two or three plays and then end up missing a field goal. Adams first of the good night of the day. Tennessee uh drives straight back down again with some help from New England defensive penalties, uh like keeping drives alive and stuff, and they kick another field goal. And this was interesting too. Uh the field goals, the first field goal was kicked by the punter.",
    "speaker" : "Andy",
    "timestamp" : "18:59-20:03"
  },
  {
    "text" : "Yeah. Hentrick.",
    "speaker" : "Steve",
    "timestamp" : "20:04-20:06"
  },
  {
    "text" : "Was it like too long for Gary Anderson? That's what I thought. So I'm like, oh, so maybe he just kicked a bunch. But if you look at the Titans season, he this guy kicked four field goals on the season. And I think it One, maybe two of them came in this game. But yeah, he didn't kick it. He he was two for two between thirty and thirty-nine and two for two between 40 and 49. Oh, and he missed one from 50 plus. As the punter, by the way. And he was doing kickoffs as well, but yeah, Gary Anderson went. Thirty uh twenty-seven to thirty-one. But he was also he was ten of fourteen from forty to forty-nine So who knows? But yeah, they're they they couldn't stop talking about Craig Hendrick who was there.",
    "speaker" : "Andy",
    "timestamp" : "20:06-20:57"
  },
  {
    "timestamp" : "20:58-21:17",
    "speaker" : "Steve",
    "text" : "Yeah, they stopped talking about come on, the commentators were great in this game. No, no, not a bad way. It was great. I also thought a sign of the times, they were like, yeah, the Patriots defense is a lot smaller and faster this year. They got Ty Warren in there, and then they showed his little bio. He's 6'4, 300 pounds."
  },
  {
    "text" : "That's their lighter front, yeah. That's a massive dude nowadays, right? That's yeah, that's an entire uh defensive line.",
    "speaker" : "Andy",
    "timestamp" : "21:21-21:28"
  },
  {
    "timestamp" : "21:30-21:33",
    "speaker" : "Steve",
    "text" : "But uh they're not wrong either, you know? No."
  },
  {
    "text" : "Yeah, he did look smaller than some of the other guys out there. Uh yeah, and the only other thing of note that happened in the first quarter to go back to that was an absolute dime by Tom Brady to our boy Troy Brown for 58 yard touchdown.",
    "timestamp" : "21:33-21:47",
    "speaker" : "Andy"
  },
  {
    "text" : "I have this The way to totally redeem yourself, Troy, no, but I don't remember what he did the play before where he he must have messed something up. Uh I also try to black these moments out of my mind, but yeah.",
    "timestamp" : "21:48-22:01",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh uh he had a false start. That was the other thing I wanted to bring up. Yeah, so the Patriots were trying. I actually wrote this down somewhere. Where is it? Um Page is trying to get the heart count working, but that's three false starts now.",
    "timestamp" : "22:02-22:15",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Tom Brady had a false start.",
    "timestamp" : "22:16-22:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Tom Brady had a false start. You don't have ever seen that before or since. No, he he just pulled out there was him and like the tight end both started going like and everybody else is just sitting there.",
    "timestamp" : "22:18-22:30"
  },
  {
    "text" : "Tight ends are like the quarterback is dropping back without the football because the center didn't even Snap it because Tom Brady's the only one on a different snap count.",
    "speaker" : "Steve",
    "timestamp" : "22:31-22:38"
  },
  {
    "text" : "Yeah, it's like boys, I think you should probably like just try get on the same page. Just on the snap count. Like the rest of it, fine. We'll see where it goes. But if you could be on the same page about the snap count, that would be great.",
    "speaker" : "Andy",
    "timestamp" : "22:39-22:50"
  },
  {
    "text" : "You know that shit drives Belichick bonkers.",
    "timestamp" : "22:50-22:53",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but it kind of reminded me of that um Steelers game, the beginning of the season last year, where The center got the snap count wrong for the Steelers. Oh yeah. And he was the only one that didn't move. You didn't have that video of him just like with a picture of him just sitting there holding the ball and everybody's behind him.",
    "timestamp" : "22:53-23:13"
  },
  {
    "speaker" : "Steve",
    "text" : "I like how this Tom Braid touchdown to Troy is the only highlight on the website. So far. I have a lot.",
    "timestamp" : "23:13-23:21"
  },
  {
    "text" : "They're actually uploading now. I mean, this is the only highlight you truly, truly need. I have eleven of I have eleven more that are gonna be going. Gotcha. Uh but yeah, that's only because uh I went back and Got highlights for every single Tom Brady touchdown. Of this game, yeah. Was a 58 dime.",
    "timestamp" : "23:21-23:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Brady played well.",
    "timestamp" : "23:42-23:44"
  },
  {
    "text" : "He did.",
    "timestamp" : "23:44-23:44",
    "speaker" : "Andy"
  },
  {
    "text" : "Not gr not like awesome. Maybe Steven Near might have played a little better. But Brady didn't need to, you know, because like the team was more balanced and Steve was like the only guy.",
    "timestamp" : "23:45-23:55",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so I think Yeah, uh Steve McNair was 23 of 45, 360 yards, but no touchdowns, one interception, took two sacks. Uh his pass rating was 68. 8. Brady was uh a more subdued 17 of 31 for 219 yards, but he had that one touchdown and no interceptions. He also took three sacks though. And he had a rating of 88. And I thought, especially at the beginning of the game. He was holding on to the ball to the point where I actually wrote down that he looked like Drew Bledsoe up in this bitch. And I was actually I was yelling to him like just Fuck it, throw the ball.",
    "timestamp" : "23:56-24:37"
  },
  {
    "timestamp" : "24:38-24:43",
    "speaker" : "Steve",
    "text" : "It came to bite him on one where he fumbled it and uh offensive linemen recovered it, thankfully."
  },
  {
    "timestamp" : "24:43-25:29",
    "text" : "Yeah, because it was the like the defensive ends were getting pushed past him like they do. But they were they had s he had was holding it so long that they were able to like loop back around and come back at him from behind. And there's a few times they still almost got to him, but he had gotten the ball, like just gotten the ball away. But one time, yeah. Like towards the end of the first half, I think it was, he got absolutely rocked and dropped the ball with the pass recovered. Um but yeah the actually I w the just to touch back on that Brady to Troy Brown touchdown, it looked eerily similar to The touchdown that he throws in overtime to beat the Dolphins in Miami. Probably around this time, maybe. I'm not quite sure exactly when that is. You but you know what I'm talking about?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yes, it is. I mean I still haven't seen this play, so I'm still waiting for it, I think. The overtime when they're on the baseball field and they very similar touchdown.",
    "timestamp" : "25:29-25:40"
  },
  {
    "speaker" : "Andy",
    "text" : "But you you you can pick it, right? Where he like He pushes off the the the um the back of the offensive lineman and like like pushes off the back of him, shifts over, and then tosses deep on it. It looked almost exactly the same as that. It was eerily similar.",
    "timestamp" : "25:41-25:56"
  },
  {
    "text" : "It was way more of a like a real push-off in this game though. Like he like shit like pushed himself back a yard and then give himself the space to fucking huck it.",
    "speaker" : "Steve",
    "timestamp" : "25:56-26:07"
  },
  {
    "timestamp" : "26:07-26:31",
    "speaker" : "Andy",
    "text" : "Yeah. Um so but after all that the Patriots are up seven six in the first quarter. Um and the Titans have just gone three and out because Mac McNair got sacked on third down. And the sacks in this game of McNair, I I want to put air quotes around because basically he would just see somebody coming and fall over Like those are free Russia, he's just like, nah, I'm just not not gonna."
  },
  {
    "timestamp" : "26:31-26:34",
    "speaker" : "Steve",
    "text" : "No. He's too country strong, you know? He's a"
  },
  {
    "timestamp" : "26:35-26:41",
    "speaker" : "Andy",
    "text" : "TV near is a fucking a beast. He's like, you know what? I'm gonna take a nap right here. Hang on real quick."
  },
  {
    "timestamp" : "26:42-26:49",
    "speaker" : "Steve",
    "text" : "Rewatching these Titans games? Makes me not regret my Titans fandom at all. They were the best."
  },
  {
    "text" : "You are a big fan of them.",
    "timestamp" : "26:49-26:51",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:51-27:01",
    "speaker" : "Steve",
    "text" : "But let's be real. The Tom Brady passing effort was only like in complement to the run game because they they sent the end of the game with like 163 yards, right?"
  },
  {
    "timestamp" : "27:01-27:04",
    "text" : "Yeah, it was it was an absolute beatdown in that right.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:04-27:14",
    "speaker" : "Steve",
    "text" : "Titans this year were the number one rushing defense in the NFL They only gave us 1500 yards. So like 10% of their entire rushing yards came in this game."
  },
  {
    "timestamp" : "27:14-27:36",
    "text" : "Yeah. Which is crazy. And I think they had said that the only other loss that they had had was So far in the season up to this point was against the Colts who also ran the ball down their throat. But everybody else couldn't. Yeah, the Pagers went 27 carries. Yeah. 27 carries, 163, 161 and three touchdowns on the ground. Bananas.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:36-27:45",
    "speaker" : "Steve",
    "text" : "They gave up 126 to uh Fred at the Jags, and then again Edrian got him with 116. Damn."
  },
  {
    "timestamp" : "27:45-27:48",
    "text" : "But yeah, nobody on the Patriots actually had over 100 yards.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:48-27:54",
    "speaker" : "Steve",
    "text" : "The Falcons had 25 yards rushing. Next week they play the Saints who have 23 yards rushing."
  },
  {
    "text" : "Yeah, so this is a good defense. Yeah. I mean, and there were some big names on this team too, right? Samari Roll. Keith Bullock. Keith Bullock.",
    "timestamp" : "27:54-28:06",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Who I think the rain, the name they had that uh Rocky curse who I'd c sort of forgotten about.",
    "timestamp" : "28:06-28:13"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And they had Tank, what's his name?",
    "timestamp" : "28:14-28:16"
  },
  {
    "timestamp" : "28:16-28:20",
    "speaker" : "Steve",
    "text" : "Tank Tank Williams is also Tank Williams and Rocky Bone were their two rookies."
  },
  {
    "timestamp" : "28:21-28:23",
    "speaker" : "Andy",
    "text" : "Yep. Yeah, this is a solid team."
  },
  {
    "timestamp" : "28:23-28:27",
    "speaker" : "Steve",
    "text" : "And then they had Derek Mason as the wide receiver. Always loved him."
  },
  {
    "timestamp" : "28:27-28:28",
    "speaker" : "Andy",
    "text" : "Mm-hmm."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:28-28:35",
    "text" : "He was a savage. And Justin Barrens. The Dysons on both sides of the ball."
  },
  {
    "text" : "Was Dyson actually on this team still?",
    "speaker" : "Andy",
    "timestamp" : "28:36-28:38"
  },
  {
    "text" : "Uh he he was definitely on last year because Mason was hurt when we played him last year. I don't I didn't see Kevin Dyson, but Andre Dyson on the the cornerback was playing.",
    "timestamp" : "28:38-28:48",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he was. But yeah, I think the other Hitler Dyson's not here.",
    "timestamp" : "28:48-28:52"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:53-28:57",
    "text" : "Do you hear what their their nickname for Tom Brady, the Titans defense?"
  },
  {
    "timestamp" : "28:58-29:04",
    "speaker" : "Andy",
    "text" : "Uh I vaguely I remember them saying it and thinking, oh that's stupid. What was it? Did you write it down?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:05-29:14",
    "text" : "Oh yeah, I did. The program QB. That's right. Not because he's like a system guy, but because he's like a computer."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "29:14-29:14",
    "speaker" : "Andy"
  },
  {
    "text" : "I guess.",
    "speaker" : "Steve",
    "timestamp" : "29:15-29:15"
  },
  {
    "speaker" : "Andy",
    "text" : "He just does everything exactly right or something. Yeah, he's he's a computer back there. Yeah, I guess.",
    "timestamp" : "29:16-29:20"
  },
  {
    "timestamp" : "29:21-29:26",
    "speaker" : "Steve",
    "text" : "Which I feel like he could come up with a better adjective than Program makes them sound like a system quarterback, you know?"
  },
  {
    "text" : "Maybe that's what they're going for. Maybe it was a backhanded compliment. Like he doesn't do anything well, he just does everything he's supposed to. Pro Yeah, who played well executes Antoine. Uh yeah, I was just about to say that. He looked like the Antoine of old. He was running people over. And a lot of the success, like you said, of this team was because Antoine got going. I mean, he finished with 16 carries for 80 yards and a touchdown. Um but that kind of I I think he may have gotten hurt too because he just kind of like stopped showing up at the game even on short down.",
    "speaker" : "Andy",
    "timestamp" : "29:26-30:04"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "30:05-30:16",
    "text" : "I just think he wasn't getting cloud enough, you know? He wasn't making it cloud, you know? Let's get fucking cloud. I think it's really what it was. They just like tried a different back in there and cloud"
  },
  {
    "speaker" : "Andy",
    "text" : "made the most of his opportunities and was Oh oh you know we need we need um if Mike Cloud played in the AFL and there was a a documentary made on it it could be fourth in cloud.",
    "timestamp" : "30:16-30:27"
  },
  {
    "text" : "Oh yeah it could be Andy you're right",
    "speaker" : "Steve",
    "timestamp" : "30:27-30:30"
  },
  {
    "text" : "You're welcome. Cool. Uh but yes, um I mean 16 for 80 is a pretty good pretty good day for Antoine Smith, especially this season.",
    "timestamp" : "30:30-30:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "30:41-30:48",
    "text" : "Yeah, I wrote a note where I was like, that's probably the longest run of his season. And then like in the second quarter, he runs a bigger one. I was like, oh, well, all right."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, 19 yards. Longest run of the uh of the game.",
    "timestamp" : "30:48-30:52"
  },
  {
    "speaker" : "Steve",
    "text" : "So we had a fourth and one on that, you know, no man zone to open up the second, right?",
    "timestamp" : "30:52-30:58"
  },
  {
    "text" : "Like that first drive of the second quarter.",
    "timestamp" : "30:58-31:00",
    "speaker" : "Speaker 5"
  },
  {
    "text" : "And the commentators, they're like, what do you like here? He's like, I like to play action pass. And I was like, I like to play action pass too. And then you know who else like to play action pass? Bill Belichick.",
    "speaker" : "Steve",
    "timestamp" : "31:01-31:09"
  },
  {
    "timestamp" : "31:09-31:25",
    "speaker" : "Andy",
    "text" : "And you know who else like to play action pass? The Titans. The Titans defense. But hey. It's an all-out blitz. And Brady rolled out to his right. And tried to throw back to the left and just had to eat it and got sacked on fourth and one. It looked like there was just no seven or something."
  },
  {
    "timestamp" : "31:25-31:32",
    "text" : "It looked like it like the it was just covered. I d they didn't show the back end of it, but look like whoever he was trying to get to was blanketed.",
    "speaker" : "Steve"
  },
  {
    "text" : "That's my guess.",
    "timestamp" : "31:32-31:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:32-31:44",
    "text" : "It is kind of like a one-read play. If it's not there, you're kind of effed, you know. It was a bad play. Just all the way around. So yeah, so yeah, this was a good one. It wasn't like you're gonna kick a field goal. It wasn't like the sack was like the worst thing you could do there, you know. I thought it was"
  },
  {
    "text" : "But I think, I mean, they were at the Tennessee 30, so it still would have been what a 47-yard field goal, which I mean Adam and Atari, he usually hits those. But because he missed the first one.",
    "timestamp" : "31:46-31:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I thought it was like the 40-ish.",
    "timestamp" : "31:57-31:59"
  },
  {
    "text" : "No, I I had it as dead like close to the 30, give or take. Um so it would have been like a lot of 40s. But this is Adam Vinatari, bro.",
    "timestamp" : "31:59-32:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "32:10-32:14",
    "text" : "Let's go to the stats. Where would we be without pro football reference on this podcast?"
  },
  {
    "text" : "Oh, we would struggle mightily. Um let's see uh I want to say 29.",
    "timestamp" : "32:16-32:24",
    "speaker" : "Andy"
  },
  {
    "text" : "We're on the 38-yard line",
    "speaker" : "Steve",
    "timestamp" : "32:24-32:27"
  },
  {
    "text" : "I'm ready.",
    "speaker" : "Andy",
    "timestamp" : "32:29-32:30"
  },
  {
    "timestamp" : "32:30-32:31",
    "speaker" : "Steve",
    "text" : "Pass incomplete."
  },
  {
    "timestamp" : "32:31-32:39",
    "speaker" : "Andy",
    "text" : "No, pass complete for nine yards. So they were on the 29-yard line for fourth and two. Fourth and two on the 29-yard line."
  },
  {
    "text" : "Oh yeah, pretty much.",
    "speaker" : "Steve",
    "timestamp" : "32:39-32:40"
  },
  {
    "timestamp" : "32:41-33:03",
    "speaker" : "Andy",
    "text" : "That's a 38-yard field goal, but because he missed the first one, they they went for it here. And so that's almost call that two misses. Um Tennessee does nothing. They go three and out. So then New England drives to the Tennessee 20-yard line, just so Adam and Terry can miss yet another field goal. So they've now been inside Or around the red zone."
  },
  {
    "text" : "Yeah, but let's let's free time. We get it on R30, Antoine for six, Antoine for 14, Antoine for 4, Antoine for 10. Yeah. They gave him the Rock four straight times and they're on the the opposite side of the field in the Titans 46.",
    "speaker" : "Steve",
    "timestamp" : "33:04-33:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. No, it's great. But still no points out of it. So it's still After all this, the Patriots are just like driving up and down the field. Yeah. It's still 7-6 Patriots. And then I actually cut this as a highlight and it's going to go on the website because even though it got called back, it was one, it was bullshit that it got called back. But Troy Brown's punt return touchdown.",
    "timestamp" : "33:20-33:45"
  },
  {
    "timestamp" : "33:45-33:49",
    "text" : "Which the announcers were just like, that's an awful call. What the what are they looking at?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "33:49-33:51",
    "text" : "So if that's what they're called, that's garbage.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I loved it, dude. The best in this game. This is the best announced game. I've seen Maybe Outside of a John Madden game.",
    "timestamp" : "33:52-33:59"
  },
  {
    "text" : "This was a good one. Yeah, I enjoyed I enjoyed the announcers. But yeah, so and that was kind of a a big turning point in the game because that this was after the uh Adam Ad Adam Binateri missed his second field goal. Tennessee went three and out again because Bruce knock down the third down pass. And then Brown gets a point return, catches it on like the 10 the 10 yard line. Makes a couple guys miss and then just basically runs straight down the middle. And the punter's attempt to tackle him, which kind of like waved his arms at him, like he did, just like stuck out his arm. Because if he was trying to be like a barrier, Troy Brabant's like ran straight through it and that was it.",
    "speaker" : "Andy",
    "timestamp" : "34:00-34:41"
  },
  {
    "timestamp" : "34:46-34:52",
    "text" : "Just took a terrible angle and just got a straight up outrun. So at least he like at least he was sort of in the way on this one.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, it was later on in the game, it's not good for him. Such a kicker move. Um But yeah, so instead of it being a touchdown, it gets called back and the Patriots are deep in their own territory. Uh they go three and out, and then they have a 20-yard punt. And at this point, and um there's a lot of like defenders around the punter's feet when he lands, and so he goes down funny, and there's no call on that.",
    "timestamp" : "34:53-35:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I thought it was fine. They got like blocked into him.",
    "timestamp" : "35:22-35:25"
  },
  {
    "timestamp" : "35:25-35:28",
    "speaker" : "Andy",
    "text" : "Yeah, but the the fans didn't agree with you."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:28-35:42",
    "text" : "Like the fans weren't even watching this fucking game. At this point, they went to go punt it to the Patriots. Early early like second quarter, there's a random cheer before the pump. There was."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:42-35:45",
    "text" : "And it happened again like towards the fourth quarter too."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, yeah. We talked about that earlier on some because I was watching this game, waiting for that.",
    "timestamp" : "35:45-35:49"
  },
  {
    "timestamp" : "35:49-36:19",
    "speaker" : "Andy",
    "text" : "Well, we yeah, we talked about it with um Brian Morey of the Patriots Hall of Fame. That's right. And he was talking about it. So yeah, this is that game where uh the Red Sox are playing the Oakland A's in the ALCS, I believe. Uh I think it's DS. Not even. I don't even remember. Uh oh yeah, I think you're right. Um and so the Red Sox had just pulled ahead of the Oakland A's in a game that would they would go on to win and tie the series with them."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, it's not even a fucking Series clinching game.",
    "timestamp" : "36:19-36:23"
  },
  {
    "timestamp" : "36:24-36:27",
    "speaker" : "Andy",
    "text" : "It may have been an elimination game. I'm not sure. I didn't look it up."
  },
  {
    "speaker" : "Steve",
    "text" : "Hey, it was an elimination. They were down because they won that series three tier. So they go to Oakland and they win. To get to advance. And then fucking get their heart broken by Aaron Boone anyway.",
    "timestamp" : "36:27-36:35"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:35-36:38",
    "text" : "So Yeah, so fuck it. Who even cares, right?"
  },
  {
    "timestamp" : "36:38-36:41",
    "text" : "A wasted effort. You should be like cheering the Patriots on. Right?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "36:41-36:42",
    "speaker" : "Andy",
    "text" : "Yeah. I mean you're as the Patriots."
  },
  {
    "speaker" : "Steve",
    "text" : "And why Richard Seymour, I think it was, wasn't it more who was fucking pissed. Yeah. Can't believe we're going to be able to do that. We'll talk about why. I mean, I 100% agree with him.",
    "timestamp" : "36:45-36:55"
  },
  {
    "text" : "Yep. I agree too. Um But yeah, so instead of Patriots being up by another touchdown, uh the Tennessee gets the ball at the New England 44 off of the awful punt. And then McNair hits a beautiful deep ball over Troy Brown with Dan Cleco. Literally in underneath his uh armpit, like his helmet underneath his armpit as he's throwing this football, just like steps into it and takes a hit and uh gets down to the one and then he finishes off the drive himself with a QB sneak touchdown. Too country strong. Country strong indeed. He doesn't even like he didn't run at it, he just kind of like got behind his guy and just kind of like slowly fell into the end zone. No, he was kind of like leaning.",
    "timestamp" : "36:56-37:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I have a massive, massive five head where you just look at each other's heads, heads against each other and just press until one person should up. Imagine doing that with Steven Nair. No one's beating him.",
    "timestamp" : "37:48-37:59"
  },
  {
    "text" : "I teach all my nieces and nephews that game, by the way.",
    "speaker" : "Andy",
    "timestamp" : "37:59-38:02"
  },
  {
    "speaker" : "Steve",
    "text" : "I love that.",
    "timestamp" : "38:02-38:03"
  },
  {
    "speaker" : "Andy",
    "text" : "It's such a good game. Uh they love it too, especially if you pretend to lose.",
    "timestamp" : "38:03-38:09"
  },
  {
    "speaker" : "Steve",
    "text" : "They're not coming at me.",
    "timestamp" : "38:10-38:11"
  },
  {
    "timestamp" : "38:12-38:13",
    "speaker" : "Andy",
    "text" : "They know better."
  },
  {
    "text" : "Look at this fucking thing, Andy.",
    "speaker" : "Steve",
    "timestamp" : "38:13-38:15"
  },
  {
    "text" : "That's like a six head at this point.",
    "speaker" : "Andy",
    "timestamp" : "38:16-38:17"
  },
  {
    "speaker" : "Steve",
    "text" : "I've been thinking about selling billboard space on it.",
    "timestamp" : "38:18-38:20"
  },
  {
    "timestamp" : "38:24-38:32",
    "speaker" : "Andy",
    "text" : "Uh you should get yeah, you can get like get some get some magic markers and just have to write it yourself. Oh girl."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "38:32-38:33",
    "text" : "All right."
  },
  {
    "speaker" : "Andy",
    "text" : "So all right, yeah, let's let's uh let's open that up as a sponsorship opportunity. If somebody wants to sponsor this podcast, uh Steve Brown's forehead is available for that.",
    "timestamp" : "38:34-38:42"
  },
  {
    "text" : "That's silly. No one's gonna be able to see it. This is an audio-on medium, Andy. You keep telling us that.",
    "timestamp" : "38:42-38:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, yeah, it's an audio only medium because it's fucking you and your five head.",
    "timestamp" : "38:48-38:52"
  },
  {
    "speaker" : "Steve",
    "text" : "But whatever. Right. Um then right after that country strong sneak is the Brady pat patty cake patty cake lose the ball.",
    "timestamp" : "38:52-39:06"
  },
  {
    "timestamp" : "39:06-39:10",
    "speaker" : "Andy",
    "text" : "Yeah, drop the football. So they go three and out again."
  },
  {
    "timestamp" : "39:10-39:25",
    "speaker" : "Steve",
    "text" : "Which also Belichick is like he saw enough of that calls a drop light. Because this is where we're getting like a minute left. He's like, nah, fuck that shit. Yeah, yeah. We ain't doing this. The first like you know a minute left or whatever."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it was like first down.",
    "timestamp" : "39:26-39:27"
  },
  {
    "timestamp" : "39:27-39:30",
    "speaker" : "Steve",
    "text" : "Something happened, fumbles it, like, nah, nah, nah."
  },
  {
    "timestamp" : "39:31-39:50",
    "speaker" : "Andy",
    "text" : "Never mind. Uh but it still left enough time for Tennessee to drive to the New England 28. But luckily they didn't have our boy Craig Hentrich in to to attempt the field goal. And it was a little bit too long for Uh Gary Anderson, who at this point is probably like what, 100 years old, maybe?"
  },
  {
    "speaker" : "Steve",
    "text" : "It is ancient. He was the NFL all-time leading scorer already at this point. Yeah.",
    "timestamp" : "39:50-39:56"
  },
  {
    "timestamp" : "39:56-40:06",
    "speaker" : "Andy",
    "text" : "I love how he uh he had the face mask which was just like get this out of the way face mask, which it yeah, but it was a single bar, literally as low as it could go. So it almost looked like a chin strap, it was so low."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:06-40:07",
    "text" : "It's just like a beard, Andy."
  },
  {
    "text" : "Yeah. Except as a",
    "timestamp" : "40:07-40:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Your beard is a combination of Gary Anderson's face mask and Kevin Falk's fucking chest.",
    "timestamp" : "40:10-40:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:17-40:28",
    "text" : "Yes Chin cover. That's exactly right. That's actually what I was going for. So I'm glad somebody finally got it. It's taken years for somebody to understand it, though. I'm glad it was you, Steve."
  },
  {
    "timestamp" : "40:29-40:33",
    "speaker" : "Steve",
    "text" : "Before we get to this field goal miss, I want to call out Derek Mason."
  },
  {
    "text" : "But don't.",
    "timestamp" : "40:33-40:33",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "40:34-40:52",
    "text" : "No. He like right on that play before it when they were inside the 10 or whatever on the 20, or I forget what they were. He's like third and ten and he has an awesome play where he's like catches the ball at the hash marks and fights his way out of bounds and dives to the first down and they don't give it to him. Which is true. And then his fourth down forces them to kick.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't think these refs had a great game.",
    "timestamp" : "40:53-40:55"
  },
  {
    "speaker" : "Steve",
    "text" : "They were great.",
    "timestamp" : "40:55-40:57"
  },
  {
    "timestamp" : "40:57-41:01",
    "text" : "They were they love throwing flags for like nothing going on either.",
    "speaker" : "Andy"
  },
  {
    "text" : "There's some false start though. I don't know. There is There's so many easy ones too.",
    "speaker" : "Steve",
    "timestamp" : "41:01-41:05"
  },
  {
    "speaker" : "Andy",
    "text" : "It's true. It's true. But like there was a bunch of T Tac ones.",
    "timestamp" : "41:05-41:08"
  },
  {
    "text" : "Like all the defensive ones were just like, yeah, I don't know. That missed field goal though, I've never seen this before. Do you see how it hit exactly flush?",
    "timestamp" : "41:08-41:17",
    "speaker" : "Steve"
  },
  {
    "text" : "Hit it square and came straight back. Yeah. I lost sight of the ball for a while. Yeah, I was like, where did it go?",
    "timestamp" : "41:17-41:23",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, where where'd the ball go?",
    "speaker" : "Steve",
    "timestamp" : "41:23-41:25"
  },
  {
    "speaker" : "Andy",
    "text" : "I've never seen Stroke Wall hit a goalpost as flush as that.",
    "timestamp" : "41:25-41:30"
  },
  {
    "timestamp" : "41:30-41:31",
    "speaker" : "Steve",
    "text" : "This always bounces one way or the other."
  },
  {
    "timestamp" : "41:32-41:47",
    "text" : "No, that Gary Anderson's just that good. He's that accurate that he can hit it flush, square on. It's like me kicking penalties in soccer. I can file the goalpost with scary accuracy. Because I'm English.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "41:47-41:49",
    "text" : "13-7 at the half, something like that."
  },
  {
    "text" : "13-7 Titans at the half, yes.",
    "timestamp" : "41:50-41:52",
    "speaker" : "Andy"
  },
  {
    "text" : "But it doesn't feel like that though, because we have two Adam Bayard's missed field goals. They had one as well.",
    "speaker" : "Steve",
    "timestamp" : "41:52-41:57"
  },
  {
    "timestamp" : "41:57-41:57",
    "text" : "Mm-hmm.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Troy Brown, punt return callback.",
    "timestamp" : "41:58-41:59"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:59-42:03",
    "text" : "You know, there's pages had the Brady getting sacked on fourth down."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, they had scoring opportunities.",
    "timestamp" : "42:03-42:05"
  },
  {
    "text" : "Yeah, like I said, missed connections.",
    "speaker" : "Andy",
    "timestamp" : "42:05-42:07"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "42:07-42:07",
    "text" : "Yeah."
  },
  {
    "timestamp" : "42:07-42:11",
    "speaker" : "Andy",
    "text" : "All right. Sure. No Craig Lisagonia. Mm-hmm."
  },
  {
    "speaker" : "Steve",
    "text" : "But that's just uh that's why you look at that score and be like that first half wasn't very entertaining, but it was. It was incredibly entertaining.",
    "timestamp" : "42:11-42:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, there's a lot going on.",
    "timestamp" : "42:18-42:19"
  },
  {
    "text" : "It's just twenty points being scored, it was That's pretty pretty ridiculous.",
    "speaker" : "Steve",
    "timestamp" : "42:19-42:24"
  },
  {
    "text" : "Um and just to kind of throw a teaser out there when McNabb uh McNabb Jesus McNair hit that deep ball. to the one yard line. Uh it was Troy uh Ty Law on coverage and he was came up limping.",
    "speaker" : "Andy",
    "timestamp" : "42:25-42:38"
  },
  {
    "text" : "No, Troy Brown's been living the entire game.",
    "speaker" : "Steve",
    "timestamp" : "42:38-42:40"
  },
  {
    "timestamp" : "42:40-42:42",
    "speaker" : "Andy",
    "text" : "Not Tro Ty Law."
  },
  {
    "speaker" : "Steve",
    "text" : "Law is that's my second note is Law is still limping because he got hurt last no two weeks ago.",
    "timestamp" : "42:43-42:48"
  },
  {
    "text" : "Yeah, because even the announcers knows like they they should probably pick on him. He looks like he's limping. And then but as soon as the play started, it disappeared",
    "timestamp" : "42:48-42:55",
    "speaker" : "Andy"
  },
  {
    "text" : "He's been limping this entire game. It's been actually kind of crazy to watch. Well, we'll get to that.",
    "speaker" : "Steve",
    "timestamp" : "42:55-43:02"
  },
  {
    "timestamp" : "43:02-43:27",
    "speaker" : "Andy",
    "text" : "Mm-hmm. So now we have the second half where literally every drive ends in a score, like we talked about. Um, before that though, I want to point out that right around this time they showed um The Patriots banner? The championship banner? Oh just the one? What are you doing? How weird that is."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, it was it it looked very empty, just having the one only was it one, it was before they had to expand the space to put all the extras.",
    "timestamp" : "43:29-43:36"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:37-43:44",
    "text" : "Right. So it's just like one kind of like fluttering in the breeze by itself up in the Like the the walkway that they have going up."
  },
  {
    "timestamp" : "43:45-43:51",
    "text" : "It's like it would be like going to the Boston Garden and seeing just like one Celtics Championship banner hanging up, you know?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, just all by itself.",
    "timestamp" : "43:51-43:52"
  },
  {
    "timestamp" : "43:52-43:54",
    "speaker" : "Steve",
    "text" : "And that would be such a strange sight nowadays."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:55-43:57",
    "text" : "It was it was very weird to see, yeah."
  },
  {
    "text" : "I love when I go to the caps games. Actually, now they at least have one, but like, I don't know. They just have like the bullets made into the, you know, Eastern Conference finals.",
    "speaker" : "Steve",
    "timestamp" : "43:58-44:11"
  },
  {
    "timestamp" : "44:11-44:28",
    "text" : "It'd be like going to uh Indianapolis, yeah, and then and seeing the uh Just one AMC finalist banner. Oh my god. I can't believe they did that. Can't wait to get to that game. Oh, that's gonna be a good idea. I can relive that memory. I can't wait. There's gonna be a bunch of those.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yes.",
    "timestamp" : "44:28-44:29",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:29-44:35",
    "text" : "Yeah, we've got a lot, we've got, do you remember when we used to watch uh Paige's Losses on this podcast?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "44:35-44:37",
    "text" : "Yeah, well there was one last week."
  },
  {
    "timestamp" : "44:37-44:39",
    "speaker" : "Andy",
    "text" : "Yeah, I I I don't remember."
  },
  {
    "text" : "Isn't I feel like there's one more to come, no?",
    "timestamp" : "44:40-44:43",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Not for a while, Steve. You've got another 21 games before you have to suffer.",
    "timestamp" : "44:43-44:50"
  },
  {
    "speaker" : "Steve",
    "text" : "22 game streak.",
    "timestamp" : "44:54-44:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Twenty-two, I thought.",
    "timestamp" : "44:56-44:57"
  },
  {
    "timestamp" : "44:57-44:58",
    "text" : "Stat check.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "45:00-45:02",
    "speaker" : "Andy",
    "text" : "It's twenty-one straight. They lost the twenty-second."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "45:02-45:04",
    "text" : "Should we call Greg and have him stat check it?"
  },
  {
    "text" : "Do it. Oh boy.",
    "speaker" : "Andy",
    "timestamp" : "45:05-45:10"
  },
  {
    "timestamp" : "45:11-45:14",
    "text" : "He's not gonna pick up. I don't like talking on the phone.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:14-45:17",
    "text" : "Oh, he definitely won't pick up, especially if he knows it's you."
  },
  {
    "timestamp" : "45:17-45:19",
    "text" : "That can block my number, maybe.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "45:19-45:27",
    "speaker" : "Andy",
    "text" : "We can call him from the uh The Dynasty Hotline. I don't know so I don't know if he has that phone number."
  },
  {
    "speaker" : "Steve",
    "text" : "I'll leave him a voicemail.",
    "timestamp" : "45:28-45:30"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "45:30-45:30"
  },
  {
    "text" : "Yeah, just your call has been forwarded to an automatic voice message system.",
    "speaker" : "Steve",
    "timestamp" : "45:31-45:36"
  },
  {
    "text" : "Oh now everyone's gonna have to bleep this part.",
    "timestamp" : "45:38-45:42",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:51-46:07",
    "text" : "Hi, Gregory. Uh this is your doctor. Um we have your test results back. And you're gonna need to call us immediately. You have a big infection from all the semen in your butthole. All right, thank you.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "46:09-46:11",
    "speaker" : "Andy",
    "text" : "How often do you leave him messages like that?"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, dude, do you want to hear this is why?",
    "timestamp" : "46:11-46:14"
  },
  {
    "timestamp" : "46:14-46:17",
    "speaker" : "Andy",
    "text" : "Oh god. Oh, this is a message for Stephen Brown."
  },
  {
    "text" : "This is your doctor speaking. Um I went over the records in the test and it appears you have an infection in your anus from all the sperm that was accumulating there.",
    "timestamp" : "46:18-46:29",
    "speaker" : "Speaker 5"
  },
  {
    "timestamp" : "46:36-46:43",
    "speaker" : "Andy",
    "text" : "Oh, brotherly love. How do you replace a butthole, I wonder? Sounds like an expensive."
  },
  {
    "speaker" : "Steve",
    "text" : "I couldn't remember the ending of it when I was doing it live. Let's be real.",
    "timestamp" : "46:43-46:47"
  },
  {
    "text" : "Brutal. Speaking of buttholes.",
    "speaker" : "Andy",
    "timestamp" : "46:47-46:50"
  },
  {
    "timestamp" : "46:51-46:56",
    "speaker" : "Steve",
    "text" : "But let actually let's check that because I'm at the longest winning streak."
  },
  {
    "timestamp" : "46:56-46:58",
    "speaker" : "Andy",
    "text" : "It's 21 games."
  },
  {
    "text" : "Is it 21? Yeah. Is that including playoffs though?",
    "speaker" : "Steve",
    "timestamp" : "46:58-47:02"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:02-47:03",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "This says the Indianapolis Colts hold the longest regular season winning streak in NFL history.",
    "timestamp" : "47:04-47:10"
  },
  {
    "text" : "But they lost in the playoffs. So that doesn't really count. How many games is that?",
    "speaker" : "Andy",
    "timestamp" : "47:10-47:16"
  },
  {
    "timestamp" : "47:16-47:26",
    "speaker" : "Steve",
    "text" : "Uh 23 regular season wins. Oh yeah. Who the fuck is our regular season wins? What are we? Marty Schottenheimer? Wait, yeah, let's do bullshit."
  },
  {
    "text" : "It's twenty twenty-one total games in a row because they lost in the playoffs.",
    "speaker" : "Andy",
    "timestamp" : "47:26-47:31"
  },
  {
    "timestamp" : "47:31-47:45",
    "text" : "I have entirely postseason games. Patriots are top of that. Just two Patriots win streak. I always feel that some bullshit about how NFL stats are regular season and the postseason split.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "47:46-47:52",
    "speaker" : "Andy",
    "text" : "Yeah, it's stupid. So everybody's like, oh, uh Drew Brees has the most passing yards in NFL history."
  },
  {
    "timestamp" : "47:52-47:59",
    "text" : "I'm like, he's actually like 10,000 behind if not it's harder to be better.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "47:59-48:13",
    "speaker" : "Andy",
    "text" : "Yeah. You know? Oh well in fairness, just i it doesn't count because Tom Brady plays more playoff games than Drew Brady's. Yeah, well, how does that do that though? Exactly. Don't get me started."
  },
  {
    "timestamp" : "48:14-48:16",
    "speaker" : "Steve",
    "text" : "You can't ding the dude on that. It's garbage."
  },
  {
    "speaker" : "Andy",
    "text" : "People just can't use whatever they can use. And to make their guy look better. Bunch of haters. And what we do is we just count all the numbers. Problem solved.",
    "timestamp" : "48:16-48:26"
  },
  {
    "text" : "You know what the the Charlie Weiss used in this game? Was that Fake the handoff, fake the reverse, then throw the screen back to the reverse direction.",
    "speaker" : "Steve",
    "timestamp" : "48:26-48:38"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, speaking of taking too much time in the goddamn pocket. Brady got lit up every time.",
    "timestamp" : "48:38-48:43"
  },
  {
    "text" : "Well they they tried it once on the in the first quarter and it didn't work at all. But like if it hadn't been thrown to if it was like Kevin Falk, which where was he in this game?",
    "timestamp" : "48:43-48:52",
    "speaker" : "Steve"
  },
  {
    "text" : "He was hurt.",
    "speaker" : "Andy",
    "timestamp" : "48:52-48:53"
  },
  {
    "timestamp" : "48:53-48:57",
    "speaker" : "Steve",
    "text" : "No. That's why uh the the fumble last week?"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "48:57-48:57",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, that's right.",
    "speaker" : "Steve",
    "timestamp" : "48:57-48:58"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it just caught his instant touchdown.",
    "timestamp" : "48:59-49:02"
  },
  {
    "speaker" : "Steve",
    "text" : "And we're instead we're throwing to Antoine Smith. Yeah. Mr. Brickhands. Then they they came right back to it and they got a good 15-yard chunk out of it. But yeah. Brady's got blown up on both times.",
    "timestamp" : "49:02-49:13"
  },
  {
    "text" : "Brady paid for it both times because yeah. The the defensive lineman just didn't fall for it whatsoever. Whoever that guy was on the right end there came steaming off and just put his helmet right and buried his chest.",
    "speaker" : "Andy",
    "timestamp" : "49:13-49:26"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:27-49:38",
    "text" : "You know who like sort of popped in this game? And similar to get fucking cloud. Uh Larry Centers."
  },
  {
    "timestamp" : "49:39-49:40",
    "speaker" : "Andy",
    "text" : "I didn't think he popped."
  },
  {
    "text" : "I thought he was it's the most you've seen of him so far, but I think that's only because they're throwing that ball to Larry Senters, you know? I think the second one they did, didn't they? He no, it was Anton. That was it But like I never thought a fullback could catch a ball like that. And then you look at like Larry Sannter's career and it's just insane.",
    "timestamp" : "49:40-49:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Telling you, man. Larry Sanders, he didn't really play as a fullback.",
    "timestamp" : "49:59-50:03"
  },
  {
    "timestamp" : "50:03-50:04",
    "speaker" : "Steve",
    "text" : "But he did like"
  },
  {
    "timestamp" : "50:05-50:10",
    "text" : "He's yeah, he was he was the one out there on the goal line situations, because usually where you put your fullback.",
    "speaker" : "Andy"
  },
  {
    "text" : "No, you can't.",
    "speaker" : "Steve",
    "timestamp" : "50:10-50:10"
  },
  {
    "speaker" : "Andy",
    "text" : "Well they had Dan Clecko.",
    "timestamp" : "50:10-50:11"
  },
  {
    "text" : "I mean obviously Dan Clecko if you have Dan Clecko",
    "timestamp" : "50:12-50:14",
    "speaker" : "Steve"
  },
  {
    "text" : "You don't see fucking defensive lineman coming in for uh Devlin ever. You get Devlin in there and he fucking plows the way. True fullback.",
    "speaker" : "Andy",
    "timestamp" : "50:15-50:25"
  },
  {
    "timestamp" : "50:25-50:27",
    "speaker" : "Steve",
    "text" : "Mike Rabel did that all the time."
  },
  {
    "timestamp" : "50:27-50:31",
    "speaker" : "Andy",
    "text" : "Not when we had an actual fullback he didn't. All right. Rabel's a tight end."
  },
  {
    "text" : "He had more catches or receptions. I mean rushes are receptions.",
    "timestamp" : "50:31-50:36",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Receptions. 827 centers. Yeah. Yeah, he was like he led he he led the NFL. He had like the NFL record of receptions by a running back, I thought.",
    "timestamp" : "50:37-50:49"
  },
  {
    "speaker" : "Steve",
    "text" : "827 and he had 615 carries. So the dude's actually a tight end is what you're saying. I feel that like back then though, you know That's tough to tough to pull off. Nowadays, maybe maybe more so, but this is like a run first era.",
    "timestamp" : "50:50-51:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, who's the uh the the fullback for the 49ers? Use check? Yeah. He he might he might break that record of receptions by a fullback. He's pretty good in space. He he's got some good hands on him.",
    "timestamp" : "51:05-51:19"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:19-51:23",
    "text" : "He had sixty eight hundred yards, twenty-eight touchdowns receiving."
  },
  {
    "text" : "God damn. Yeah. Larry Senters? Yeah. He spent most of his time with the Cardinals, too. He was on the Phoenix Cardinals. The Phoenix Cardinals of all team.",
    "speaker" : "Andy",
    "timestamp" : "51:24-51:34"
  },
  {
    "speaker" : "Steve",
    "text" : "How do you even spell use Czech?",
    "timestamp" : "51:34-51:37"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh you just hit the the keyboard with your face a couple times and Google figure it out.",
    "timestamp" : "51:38-51:43"
  },
  {
    "speaker" : "Steve",
    "text" : "I just put Gal Kyle Zus Zus. Zus kek.",
    "timestamp" : "51:43-51:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Just do 49ers fullback and no Kyle. Not there yet, huh? Yeah, just do 49er fullback. I just put man this whole episode has just been you fucking stat checking shit. This is awful. Well unless I only fucking Greg. J-U-S-Z-C-Z-Y-K. Obviously, Steve. I can't believe you can't spell it with use check.",
    "timestamp" : "51:48-52:12"
  },
  {
    "text" : "Uh he only has a hundred and ninety and eight touchdowns.",
    "speaker" : "Steve",
    "timestamp" : "52:15-52:21"
  },
  {
    "text" : "Yeah, but he also was only drafted in 2013. So there, he's got plenty of time to catch.",
    "timestamp" : "52:22-52:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Nine, ten, eleven, twelve, thirteen, fourteen years. This is his last year.",
    "timestamp" : "52:32-52:37"
  },
  {
    "timestamp" : "52:37-52:51",
    "speaker" : "Andy",
    "text" : "Speaking of fullbacks, though, Patriots first drive in the second half. All Antoine Smith. All fullback, all run plays, finish off with an Antoine one yard touchdown play."
  },
  {
    "timestamp" : "52:51-52:53",
    "speaker" : "Steve",
    "text" : "Well let's actually bring it back to fullbacks because"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:53-52:54",
    "text" : "Dan Clecko."
  },
  {
    "speaker" : "Steve",
    "text" : "Jack only has 32 carries to 190 receptions.",
    "timestamp" : "52:54-52:58"
  },
  {
    "text" : "This is what I'm saying.",
    "speaker" : "Andy",
    "timestamp" : "52:58-52:59"
  },
  {
    "timestamp" : "52:59-53:04",
    "text" : "Larry Sanders has 615 to 827s, closer to one to one.",
    "speaker" : "Steve"
  },
  {
    "text" : "Is it though?",
    "speaker" : "Andy",
    "timestamp" : "53:05-53:06"
  },
  {
    "timestamp" : "53:07-53:10",
    "speaker" : "Steve",
    "text" : "It's closer than 32 to 190."
  },
  {
    "timestamp" : "53:11-53:14",
    "speaker" : "Andy",
    "text" : "I mean, yeah. I don't understand what your point is."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "53:15-53:17",
    "text" : "That Larry Senners was a unicorn."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:18-53:20",
    "text" : "You're a unicorn."
  },
  {
    "timestamp" : "53:20-53:24",
    "speaker" : "Steve",
    "text" : "And I didn't even realize he was on the Patriots before re-watching all these games."
  },
  {
    "timestamp" : "53:24-53:35",
    "speaker" : "Andy",
    "text" : "Oh really? I vaguely remembered that. I don't remember him at all. But I I remember him mostly from his time with the Phoenix Cardinals. That just sounds so stupid, doesn't it? Phoenix Cardinals. Yeah."
  },
  {
    "timestamp" : "53:35-53:39",
    "speaker" : "Steve",
    "text" : "Been the Phoenix Cardinals for four years, 1990 to 93."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:39-53:40",
    "text" : "Yep."
  },
  {
    "text" : "Stupid.",
    "timestamp" : "53:41-53:41",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Just stupid. Uh yeah. Speaking of fullbacks, Dan Klecko with the the new uh stat the fullback assist. Where his block sprung the the touchdown. The first one, Antoine, I think it did. He double-teamed whoever that defensive lineman was. They showed it on replay. They were very excited.",
    "timestamp" : "53:42-54:02"
  },
  {
    "text" : "As you would be, dude. Fat guy on the defense blocking. You gotta appreciate that. And I feel like Tuan deserved that touchdown, you know? He had done so much work up to this point in this game. I agree.",
    "timestamp" : "54:03-54:15",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "54:17-54:19",
    "speaker" : "Andy",
    "text" : "But I feel like that was the last you saw of him too."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "54:20-54:21"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:22-54:33",
    "text" : "Like I I kind of wonder if he got hurt because I think Mike Cloud is featured for the next couple of games. He comes in later that um"
  },
  {
    "timestamp" : "54:35-54:36",
    "text" : "Quarter. Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "54:36-54:37",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "Guess we'll have to tune in to find out.",
    "speaker" : "Steve",
    "timestamp" : "54:37-54:39"
  },
  {
    "timestamp" : "54:40-54:51",
    "text" : "Yeah, I'll figure out next week, but I I think he may have gotten hurt on this. Antoine did. Maybe not on that play, but within the next before the end of the next Bacious drive anyway.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:51-55:09",
    "speaker" : "Steve",
    "text" : "You who definitely got hurt was that tight end on the Titans. Oh my god. They throw a little out a little screen pass, you know, they they fake the run runway, throw it back to the phone. And he gets a good 10-15 yards and then Rodney Harrison comes out of it. It was a pretty clean hit. Caught him with the shoulder."
  },
  {
    "text" : "But holy shit, I think their heads also collided. But it was Rodney Harrison. full steam ahead uh into a large tight end who was also full steam ahead and that tight end got the worst of it and it actually made me write down because Usually when you see that happen, like both guys take a little while to get up, Rodney Harrison popped back up and was jawing the entire like until the next place started.",
    "timestamp" : "55:10-55:38",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "55:38-55:44",
    "text" : "He like hit him and then like immediately went into a roll and then used the roll to pop up. Ridiculous.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "55:44-56:03",
    "text" : "And and then they showed his face. He was like grinning and smiling. And I Like, does anybody truly enjoy hitting people like he does? Does he just seem to back then? He seems joyful about it out there. Yeah. But even then, like back then, can you think of anybody who had the joy of hitting people like he did.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I'm sure there were some dudes back then. Like there was that safety on the 49ers for a long time. Oh, Ronnie Lott? Yeah.",
    "timestamp" : "56:03-56:10",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Didn't he cut off his pinky or something? Wasn't that him?",
    "timestamp" : "56:11-56:13"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:15-56:16",
    "text" : "Let's be real."
  },
  {
    "speaker" : "Andy",
    "text" : "That's true, yeah.",
    "timestamp" : "56:16-56:17"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:17-56:17",
    "text" : "Um"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:18-56:21",
    "text" : "For like Harrison may have been like the last one of that breed though."
  },
  {
    "speaker" : "Steve",
    "text" : "There are a couple plays by Harrison in this where I was like That was a good clean hit. You know, there's there's some plays by him as well where like he actually missed uh Derek Mason on one where he just like He just jumps over it like a fucking like his arms are like flat behind him like an airplane and he's just leading with his head and he just jumps over.",
    "timestamp" : "56:21-56:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:41-56:42",
    "text" : "Like a literal missile."
  },
  {
    "text" : "Yeah, and then the Titans Receiver gets his head down and the commentators like congratulated him for getting his head down.",
    "speaker" : "Steve",
    "timestamp" : "56:42-56:47"
  },
  {
    "text" : "And I was like, not getting it taken off.",
    "speaker" : "Andy",
    "timestamp" : "56:47-56:49"
  },
  {
    "speaker" : "Steve",
    "text" : "Like, what the fuck, you know?",
    "timestamp" : "56:49-56:51"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. But like I know somewhere uh um McNair was uh he he went he was running and he got dragged down for like a couple yard game. It was basically a sack. And right at the end you saw uh Rodney Harrison come in just like crush him right in the back and bounce off.",
    "timestamp" : "56:51-57:09"
  },
  {
    "speaker" : "Steve",
    "text" : "But either way, like I haven't heard a commentator say, oh, that's a good clean hit. Because they weren't even thinking about hits in terms of like clean and dirty. I guess unless it was like absolutely ridiculously dirty, they would call it out, but they weren't thinking of like nug we do nowadays of like, yeah, he led with his like that hit on the tight end was a clean hit. He came in with his shoulder, he didn't leave with his head and yeah, their heads came together a little bit just the way they met at the sideline like that. But He wasn't trying to angle of it. But then later on the game he fucking launches himself like a fucking missile. Yeah.",
    "timestamp" : "57:13-57:47"
  },
  {
    "timestamp" : "57:48-58:08",
    "speaker" : "Andy",
    "text" : "And I think he also he did connect on one of those. Uh I think it I think it was Mason caught the ball. And he was being dragged down by somebody else and No, he got with the shoulder hand too. Yeah, but he's he's still like this in this day and age that probably would have been a defensive receiver penalty."
  },
  {
    "text" : "Oh for sure. That was just more about did Harrison like leave the crown of his helmet? And you know, those are always like the super dirty ones where you're not even looking, you're just fucking launching yourself in with your head. Yep.",
    "timestamp" : "58:08-58:19",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:19-58:31",
    "text" : "No, he didn't really do that, but he he definitely was looking to lay the lumbar pretty much every time. And I think it's because he enjoyed hitting people. Can we get back to how uh let's get fucking cloud?"
  },
  {
    "timestamp" : "58:32-58:54",
    "text" : "Because his running total should have been a little bit higher because his first run for like five yards got called back. It did? I don't remember. Yeah, it was like a hold or something like that. Because having your mic cloud the ball carrier didn't count. And then a second run he busted for 17 yards. I was like, all right, let's go.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:54-58:59",
    "text" : "Yeah, that's right. And uh he finished off that drive with a touchdown."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "58:59-58:59",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "59:00-59:01",
    "text" : "The Mike touchdown.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "59:01-59:03",
    "speaker" : "Steve",
    "text" : "Another full block assist on that one, right?"
  },
  {
    "timestamp" : "59:04-59:05",
    "speaker" : "Andy",
    "text" : "That's correct, yeah, by Diane Clecko."
  },
  {
    "text" : "Yep. That's the end of the third ish.",
    "timestamp" : "59:06-59:08",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "59:08-01:00:08",
    "text" : "Yeah, so so we've had those two short touchdown runs, and in between that was Tennessee hitting a big play and then kicking another field goal. So it's now 21-16 Patriots going into the fourth quarter, which I just like to remind people, it's 21-16 going into the into the fourth quarter. This game ended 38 to 30. So we used to have some points to score. Um and it wouldn't really didn't really take off at the beginning of the of the fourth quarter either because Titans are driving and um get inside the New England 30, but still can't get in the end zone, so they kick yet another field goal. So it's now Uh 2119, so they close in the gap. And then the Patriots, uh Mike Cloud breaks off a huge run. Career long 45 yards, yeah. Was it you think it's a career long?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, I looked it up.",
    "timestamp" : "01:00:08-01:00:09"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm on my cloud. I I was gonna say e even if you didn't, I was gonna go with that because I don't think Mike Cloud's busting off something bigger than forty-five yards.",
    "timestamp" : "01:00:11-01:00:18"
  },
  {
    "timestamp" : "01:00:18-01:00:26",
    "speaker" : "Steve",
    "text" : "It is a great run. It was it was fine. But it wasn't his best run of the day. We'll get there."
  },
  {
    "timestamp" : "01:00:26-01:00:36",
    "speaker" : "Andy",
    "text" : "No, because like he just kind of like ran to the left and then the entire right side of the field just vacated. So he just turned and looked and went, oh okay. And just ran that way for 45 yards."
  },
  {
    "text" : "He also like used his blockers well to get as many yards as he could, you know?",
    "timestamp" : "01:00:36-01:00:40",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:40-01:01:00",
    "text" : "He did. Um, but the pages don't do much after that. They like drove, you know, inside the red zone-ish. Um, and then they tried No What's my favorite? That's what I was gonna say. Yeah. But this was this was a different screen pass than the one you're talking about, like where they fake the handoff."
  },
  {
    "speaker" : "Steve",
    "text" : "Fake the end around and then throw the get everyone flowing one way and then throwing.",
    "timestamp" : "01:01:00-01:01:05"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, this was the this was the the throwback screen which Uh the Chiefs actually use against the Patriots in that AFC Championship game, if you remember. But it's that one where everybody runs to the right side and then Brady turns around, just like chucks it back to the left, basically blind. Um and this was Silary Sanders and he literally would have walked in from 20 yards out.",
    "timestamp" : "01:01:05-01:01:24"
  },
  {
    "text" : "Who the dude has 690 whatever catches.",
    "speaker" : "Steve",
    "timestamp" : "01:01:24-01:01:28"
  },
  {
    "timestamp" : "01:01:28-01:01:45",
    "text" : "He got he got blocked and fell over. He got blocked to the ground, so he had to like pick himself up and so he wasn't in the correct position. They showed it after the fact. And uh so he couldn't quite get to it. But it bounced off his hand. So yeah, it should have been catch. So the pages settle for a field goal.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01:45-01:01:49",
    "text" : "So it's still like not the worst drop of the game either. We'll get to that.",
    "speaker" : "Steve"
  },
  {
    "text" : "But it's it's uh it's a close game still. The pages up by six at this point Um and so but Tennessee's like kind of barely hanging on. Like this is where McNair goes into dragging this team down the field though by his fucking self. Because he's getting the Patriots are getting pressure on pretty much every play. They're they're getting hits on him. He's having to throw the ball away like every other play just to survive. He's running for his life. But um He managed to drag them all the way down the field and then scores himself on a touchdown run, which was great. And this is where Steve, the crowd, cheers. And this is probably what pissed off Richard Seymour.",
    "speaker" : "Andy",
    "timestamp" : "01:01:50-01:02:32"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:02:32-01:02:34",
    "text" : "Let's back it up just a little bit."
  },
  {
    "timestamp" : "01:02:34-01:02:36",
    "speaker" : "Andy",
    "text" : "Back it up for me, baby."
  },
  {
    "speaker" : "Steve",
    "text" : "One play.",
    "timestamp" : "01:02:36-01:02:36"
  },
  {
    "text" : "Back that ass up.",
    "timestamp" : "01:02:37-01:02:38",
    "speaker" : "Andy"
  },
  {
    "text" : "Two plays.",
    "timestamp" : "01:02:38-01:02:39",
    "speaker" : "Steve"
  },
  {
    "text" : "Back that ass up.",
    "speaker" : "Andy",
    "timestamp" : "01:02:39-01:02:40"
  },
  {
    "timestamp" : "01:02:40-01:02:43",
    "text" : "Actually, no, more than that. Let's go a little bit further back.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, oh, oh, back it all the way up.",
    "speaker" : "Andy",
    "timestamp" : "01:02:43-01:02:45"
  },
  {
    "text" : "Because there is the uh there is the Receiver on the Titans, I don't remember this guy, Justin Calico.",
    "speaker" : "Steve",
    "timestamp" : "01:02:46-01:02:52"
  },
  {
    "text" : "Yeah, no idea who he is.",
    "speaker" : "Andy",
    "timestamp" : "01:02:53-01:02:54"
  },
  {
    "speaker" : "Steve",
    "text" : "Neither do I. But he had that one sweet play where he's tiptoeing down the catwalk.",
    "timestamp" : "01:02:54-01:02:59"
  },
  {
    "text" : "Yep. Okay. I didn't catch that in real time, but they actually said that, didn't they?",
    "timestamp" : "01:02:59-01:03:04",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, this is the point where they uh That's brutal. They figured that that mismatch on him and Eugene. Because the dude's pretty tall. He's gotta be six four, six five. And Eugene's like as we all know 5'10 or what ish. Yeah, not a big inbreaking right on the three or four yard line. They have the inbreaking route, and he's just too big for Eugene to get around. He's in a good position, but the guy's just wait and it hits him right in the chest. And he just straight just drops it. So then they have a run play with Stevie. And Matt Chatham comes off the linebacker blitz off the edge and sheds her back and he's just trying to chase down Steve McNair. I'm like, oh, he's got him.",
    "timestamp" : "01:03:04-01:03:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Too country strong.",
    "timestamp" : "01:03:49-01:03:50"
  },
  {
    "text" : "Nick Nair scores on that play. He wasn't country strong. He was country fast. He just outran Chatham. He kind of did but he wasn't close. But he he got the Stevie got the legs.",
    "timestamp" : "01:03:50-01:04:00",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:04:00-01:04:04",
    "speaker" : "Andy",
    "text" : "But then Shadham died for the legs and and Steve McNair just didn't even notice"
  },
  {
    "speaker" : "Steve",
    "text" : "Yep. On the replay, you can kind of you can see pretty clearly that he scores a touchdown. He dives, touches the pylon, but they call him out. Yeah, they call him out with a one, which is the one. And then Buggett Fisher can't find his buzzer to challenge it. Oh, that's right. It was like fourth down, I think. Fourth and goal.",
    "timestamp" : "01:04:04-01:04:23"
  },
  {
    "text" : "So This is the same Jeff Fisher that coached the Rams when the Rams came to us. Yeah, I think it was like Jared Goff's first year, remember when they moved to LA and they had that whole thing. Yeah, that makes sense. They came to us and I'm pretty sure, and we'll get to this at some point, but I'm pretty sure in that game Jeff Fisher also couldn't challenge a play because he couldn't find the red flag in all of his pockets. So he's sitting there like He's got like three guys trying to help him like go through all the pockets in this big puffy jacket to try and find the red flag so he can throw it out on the field.",
    "speaker" : "Andy",
    "timestamp" : "01:04:23-01:05:01"
  },
  {
    "speaker" : "Steve",
    "text" : "Look, everyone shits on Belchak for keeping in a sock, but",
    "timestamp" : "01:05:02-01:05:04"
  },
  {
    "speaker" : "Andy",
    "text" : "But he now he always knows where it is. He's always quick to pull it out and chuck it. So yeah, so Jeff Fisher it might have been fourth down. I don't know, was it? I don't think it was. Oh, maybe it was fourth down. No, I don't think this one was fourth down yet. That was a different play.",
    "timestamp" : "01:05:05-01:05:24"
  },
  {
    "text" : "Either way. Similar country boy strong quarterback sneak. You're not denying Stevie McNair on the goal line from the half-inch yard.",
    "speaker" : "Steve",
    "timestamp" : "01:05:24-01:05:33"
  },
  {
    "text" : "Oh no, I think you're right. I think it was for it down. But yeah, so so Zoomir falls into the end zone again for his second touchdown run of the game. Yeah. And at this point, they decide to go for two to make it. I don't even, I've lost track of the scores right now.",
    "timestamp" : "01:05:33-01:05:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:05:51-01:06:00",
    "text" : "They go up to go up by three. So there's 25-24 after they scored the touchdown. So two-point conversion makes a field goal game."
  },
  {
    "timestamp" : "01:06:00-01:06:04",
    "text" : "Yeah, so it's 27-24. Titans at this point.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, they run that same play that the dude just dropped it.",
    "timestamp" : "01:06:05-01:06:08"
  },
  {
    "text" : "Yeah, yeah, yeah. Except this time he doesn't.",
    "timestamp" : "01:06:08-01:06:11",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:06:11-01:06:11",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:11-01:06:15",
    "text" : "It was actually a harder throw. Like McNair overthrew the guy by like a foot and a half and he went up and got it."
  },
  {
    "text" : "It's a harder catch.",
    "speaker" : "Steve",
    "timestamp" : "01:06:16-01:06:17"
  },
  {
    "timestamp" : "01:06:17-01:06:20",
    "text" : "Over Eugene again, which was tough. So yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "This is where Richard Seymour is rightfully pissed because I don't know if you caught this or not. We were all waiting for that cheer when they scored that when Stevie scores a neat touchdown. Did you hear them shoot the muskets? No, I missed that. Yeah.",
    "timestamp" : "01:06:22-01:06:38"
  },
  {
    "speaker" : "Speaker 5",
    "text" : "Yeah.",
    "timestamp" : "01:06:38-01:06:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:39-01:06:56",
    "text" : "They shot the muskets off. Oh, that's a bad look. No, isn't that terrible? That's a bad look. Like oh Titan Scorpion. Okay, not a good look. I missed that part. Yikes. So yeah, so the the the Red Sox had won."
  },
  {
    "timestamp" : "01:06:57-01:06:57",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:07:00-01:07:00"
  },
  {
    "text" : "That's why they like.",
    "timestamp" : "01:07:01-01:07:02",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:07:02-01:07:08",
    "text" : "But there's like four and a half minutes left in this game, and it's looking like The real ducks are gonna be the only winners on the day."
  },
  {
    "text" : "Yeah. And we've already touched on this earlier when we're doing our",
    "timestamp" : "01:07:08-01:07:14",
    "speaker" : "Speaker 5"
  },
  {
    "text" : "Um one hit wonders of the game. Bethel Johnson takes the ensuing kickoff 71 yards uh outrunning the the punter yet again. He's he's now O-laid two people. This time it's Bethel Johnson instead of Troy Brown. This one does count and the the announcers actually said uh something along the lines of Uh this is it's great to see a long kick return with no flags on it. Because it was happening on both sides of the ball uh for the Titans as well. Like every kick return is getting called back, I felt like. So the Pages start at the Tennessee 30, which is pretty impressive. But they kind of struggled the Patriots offense here. Find themselves in third and 18 after I think another Brady sack probably.",
    "timestamp" : "01:07:15-01:08:00",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:08:01-01:08:06",
    "text" : "He has a run for no gain and then yeah, sack where he's just paddy caking the ball again.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:08:06-01:08:49",
    "text" : "Yeah. See he's Drew Blood sewing. his way backwards down the field. Um and so it started in 18 and Brady just throws a quick Like uh like that quick hitter that he does when he sees that the the defensive back is off the wide receiver. So he just chucks to branch because the receiver's like 10 yards off of him, which on third and 18, that's fine. Except Dion Branch breaks that tackle. And goes for 23, 24 yards, I think, on third and 18. And obviously the Patriots are trying to like just set up an easier field goal for Vinateri to tie the game. But that sets them up like what inside the 10-ish? Like around the 10? Give or take? 10 50 yard line",
    "speaker" : "Andy"
  },
  {
    "text" : "This is the second. I thought the other one was third and eighteen, but there was a second and eighteen in the red zone right before the Antoine Smith first touchdown.",
    "timestamp" : "01:08:50-01:08:58",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh yeah, yeah.",
    "timestamp" : "01:08:58-01:08:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:59-01:09:01",
    "text" : "The Dion branch as well, where he fucking"
  },
  {
    "text" : "Oh that's right, yeah.",
    "timestamp" : "01:09:01-01:09:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Wait, he plays Patty Cake too long, actually, and then still managed to throw the ball.",
    "timestamp" : "01:09:02-01:09:07"
  },
  {
    "text" : "Yeah, that's the one where he almost got caught from behind again.",
    "speaker" : "Andy",
    "timestamp" : "01:09:07-01:09:10"
  },
  {
    "text" : "Yep. So this is a bit of a play. We're just dumping to him and let him make a play. If he doesn't make the play, you kick the field goal. If he does make the play, shit, we're in business.",
    "timestamp" : "01:09:09-01:09:17",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:09:18-01:09:20",
    "speaker" : "Andy",
    "text" : "Right. And he did. He got 23 yards on third and 18."
  },
  {
    "timestamp" : "01:09:20-01:09:22",
    "text" : "And Brech. And now all of a sudden they're like",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Huh?",
    "timestamp" : "01:09:23-01:09:23"
  },
  {
    "speaker" : "Steve",
    "text" : "Branch looked a little hurt as well.",
    "timestamp" : "01:09:24-01:09:25"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:09:25-01:09:33",
    "text" : "He did. He he looked like he was taking a while to get off the the ground every time he got tackled There's a lot of gutty performance. Yeah."
  },
  {
    "timestamp" : "01:09:33-01:09:34",
    "speaker" : "Speaker 5",
    "text" : "This is a great play."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Um so now it's first and ten on the on the fifteen. And uh this I think is probably the the run you were alluding to earlier from my club in his best of the day.",
    "timestamp" : "01:09:34-01:09:44"
  },
  {
    "text" : "This is his best run of his life.",
    "speaker" : "Steve",
    "timestamp" : "01:09:45-01:09:46"
  },
  {
    "text" : "This like when it when he did it, I actually did the the Chris Berman. Whoop! When he made a couple of his cuts.",
    "timestamp" : "01:09:47-01:09:52",
    "speaker" : "Andy"
  },
  {
    "text" : "You make double of them because he broke two guys in.",
    "timestamp" : "01:09:53-01:09:54",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:09:55-01:09:57",
    "speaker" : "Andy",
    "text" : "That's what I did, yeah. It was amazing."
  },
  {
    "text" : "So he's like the defensive end comes crashing in. No one blocks him.",
    "timestamp" : "01:09:57-01:10:01",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:10:01-01:10:02",
    "speaker" : "Andy",
    "text" : "Yep."
  },
  {
    "timestamp" : "01:10:02-01:10:08",
    "text" : "And but like he just a little over pursues, so he gets the handoff and the dude's kind of right in front of him and he cuts left and the guy goes right.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:08-01:10:09",
    "text" : "Left trigger."
  },
  {
    "timestamp" : "01:10:09-01:10:25",
    "speaker" : "Steve",
    "text" : "And so then he's like he's into like the the linebacker area and the safety comes up and he just jukes that dude out of his fucking shoes. Yeah. That thing could have gone for 80. That thing could have gone for 99 yards if they had been on the one yard line because there's just nobody else catching him and he was a pretty fast dude."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:25-01:10:27",
    "text" : "Yeah. And he literally just walked in the end zone."
  },
  {
    "text" : "Yeah, he beat he beat two guys and like you're gone. You break two tackles on a run game, I feel like you're getting a huge gainer. And that would have been to the end zone.",
    "speaker" : "Steve",
    "timestamp" : "01:10:28-01:10:36"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:37-01:10:47",
    "text" : "And it was to the end zone, 15 yards on the very next play from the third and 18. So Pages now kick after kicking extra point up 31-27."
  },
  {
    "text" : "We've got ourselves a ballgame because that shit happens so fast too. It was like positive the Titans score. Positive 70-yard kick return. Yeah. A negative two-yard run, a negative six-yard sack, a positive fucking 25-yard third and eighteen conversion, and then a fucking speed angle breaker.",
    "speaker" : "Steve",
    "timestamp" : "01:10:48-01:11:04"
  },
  {
    "text" : "Well, like I was saying, like we came into this fourth quarter with the score 21-16 Patriots. Yeah. And it ends 38 to 30. Like we're just we're just going back and forth down the field.",
    "timestamp" : "01:11:05-01:11:16",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:17-01:11:19",
    "speaker" : "Steve",
    "text" : "It's your head's spinning a little bit."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And it looked like it was the um the Titans were coming straight back down the field. McNair on one of the first plays hits a big play to get to midfield.",
    "timestamp" : "01:11:19-01:11:30"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:11:31-01:11:33",
    "text" : "And Eric Mason again."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:33-01:12:00",
    "text" : "Yep. And they're trying to kind of get another play in right before the two-minute warrant to give themselves some time. And Steve McNair makes his biggest mistake of the game. Where he tries to throw a quick out to who the fuck cares. Um he just happened to be covered by Ty Law. And I don't know what happens when you fight the law, Steve, but when I I fought the law. Then Law won. That's right."
  },
  {
    "speaker" : "Steve",
    "text" : "The one-legged law won.",
    "timestamp" : "01:12:00-01:12:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Thai law, pick six. From about the fifty yard line and this is when the game was officially over.",
    "timestamp" : "01:12:02-01:12:07"
  },
  {
    "text" : "It's the best because you can see him returning it and then you see him like doing the look behind, you know, as he's running it. It was actually very similar to the uh Super Bowl with the Rams. Same outcut. Law breaks on the inside.",
    "speaker" : "Steve",
    "timestamp" : "01:12:07-01:12:20"
  },
  {
    "timestamp" : "01:12:21-01:12:23",
    "speaker" : "Andy",
    "text" : "He broke so quickly on that too."
  },
  {
    "timestamp" : "01:12:23-01:12:46",
    "speaker" : "Steve",
    "text" : "And like as soon as he sees that he's sort of alone, he starts limping. He limps the last five yards into the end zone. Yeah. And it's like, wait, wait. Are you hurt or are you not? Because that break was explosive and oh my god. Super athletic and everything up to that point. Look like you're fine. And then all of a sudden you're like, okay, I don't need to like make this hurt anymore. I'm just gonna limp these last five yards."
  },
  {
    "speaker" : "Andy",
    "text" : "And he did. He limped his way in the end zone.",
    "timestamp" : "01:12:46-01:12:49"
  },
  {
    "timestamp" : "01:12:49-01:12:54",
    "speaker" : "Steve",
    "text" : "Yeah. I don't know Greg Greg definitely didn't watch this game, but he should because this is an all-time Tylaw."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because that wasn't the only play. He had another one of those been played early in the game. I think in the first quarter maybe. where he broke on another ball like that and just like dove and got his hand in the way. Like this was textbook tie law.",
    "timestamp" : "01:12:55-01:13:08"
  },
  {
    "text" : "But he would like play awesome and then limp around and then play the play awesome and limp around. It was like a An incredibly gutty performance by Ty.",
    "timestamp" : "01:13:08-01:13:17",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:18-01:14:46",
    "text" : "It was, yeah. It was a great, a great uh great performance by a lot of guys in this. Yeah, like you said, a lot of gutty performances happening here. Because I think there was a lot of people who were heart and were like tweaking things and still like there's so many, like I said, there's so many one hit wonder names in this game. And they're playing a really good Titans team who how would the Titans do this year? They made the playoffs, I think, right? Oh, they did, because we'll see them again. Yeah. The Titans will finish 12 and 4. They lost um four games this year, obviously. Two to the Colts and two to the AFC East. This game and then they lose again to the Jets later in the season. So This was uh that was about all she wrote. Uh McNair actually does still brings him back down the field again. Like I say, through for 360 fucking yards. Um And then they also had. Yeah, but then they also did a hook and ladder, which I think was kind of a garbage miss call. Because the guy was supposed to catch it and then lateral it to you know It looked like he was either down or he didn't complete the catch. That's what I think. Yeah, he didn't actually really fully catch the ball. He's kind of like caught it but at like in the process of catching kind of like shot putted it to the guy, but it bounced. Like it hit the ground. So everybody was like, oh this is obviously incomplete. But then this the Titans guy picked it up and r kept running anyway and they didn't"
  },
  {
    "text" : "Blow the play dead so we're like Rodney Harrison because he plays to the whistle.",
    "timestamp" : "01:14:47-01:14:51",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly. I was gonna say the only person who chased that motherfucker down is like oh hell no, I don't even care if there's a whistle. I want to hit somebody and he did and he saved a touchdown. And uh because of that, the Titans had to set up for a field goal. It's 38-30, and there's what, like 40 seconds left, I think, something like that.",
    "timestamp" : "01:14:52-01:15:08"
  },
  {
    "timestamp" : "01:15:08-01:15:24",
    "text" : "I'm gonna give the announcers even more, one last little bit of cred. He made a Red Sox reference to whatever had happened in the Red Sox Oakland athletics game recently. Did he? Yeah, I don't know exactly. Oh we did, yeah. Oh, something about um someone rounding second or something like that.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh that was uh Roberts rounding third because I I if I recall in the the Oakland A's game, he rounded third and they were having a lot of issues with base running in that series because whoever the third base coach was kept like getting the call wrong and like either sending the guy when he shouldn't or holding him when he shouldn't. And so I think he kind of like didn't get the call in long enough uh quick enough. So Roberts like rounded third and didn't go all the way. And kind of like hesitated before going and then got thrown out the plate or something like that.",
    "timestamp" : "01:15:24-01:15:55"
  },
  {
    "timestamp" : "01:15:56-01:16:10",
    "speaker" : "Steve",
    "text" : "Either way. I love the answers because they even did the whole After the fucking musket guy shot their sh fucking load everywhere. He's like, I guess we should welcome baseball. Everyone has been watching the baseball game."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:16:23-01:16:49",
    "text" : "Yeah. Exactly. Yeah, that was great. And then just to end this, uh Christian Fourier recovers the onside kick. And that was all she wrote. Patriots walk away with A game where they had like nobody left and still went toe-to-toe, putting up 38 points on One of and 160 rushing yards on the best rushing defense in the league."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:16:49-01:16:50",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. This was I think one of my favorite Pedro's games we've watched in a long time.",
    "timestamp" : "01:16:51-01:16:57"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:16:58-01:16:58"
  },
  {
    "timestamp" : "01:16:58-01:16:59",
    "text" : "So far.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:16:59-01:17:05",
    "text" : "It's nice that this is how the whole streak starts, because this was uh Is it a game they easily could have lost?",
    "speaker" : "Steve"
  },
  {
    "text" : "Mm-hmm. A few times, but they kept battling back, um, battling through adversity. And there was just a lot of a lot of great plays in this. Lot a lot of highlight plays that you can rewatch. And it was one of those games where I didn't really remember either, you know?",
    "timestamp" : "01:17:05-01:17:21",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:17:21-01:17:21",
    "text" : "Right. Oh yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "I didn't remember much of this at all. Like none none of these plays I'm like, oh, that's right.",
    "timestamp" : "01:17:22-01:17:26"
  },
  {
    "speaker" : "Steve",
    "text" : "But I had no idea who Micah Cloud was until I watched this game over again.",
    "timestamp" : "01:17:26-01:17:30"
  },
  {
    "timestamp" : "01:17:31-01:17:49",
    "speaker" : "Andy",
    "text" : "No. He's where you put all your data. Thanks, Steve. No. Yeah. Cloud, bro. In the mug cloud. You put your data in the cloud. All right. Best and worst, Steve. What do you got?"
  },
  {
    "text" : "A lot of best to pick from uh obviously Troy Brown's sick ass TD, although he didn't do much else.",
    "timestamp" : "01:17:52-01:17:58",
    "speaker" : "Steve"
  },
  {
    "text" : "No.",
    "speaker" : "Andy",
    "timestamp" : "01:17:59-01:18:00"
  },
  {
    "text" : "Mike Cloud's breakout game, Ty Law being super gritty and gutty, Dion Branch, Jarvis Green showing up for the first time. Uh there was one actually. I'm gonna go left field for you. The announcers, I think we should put the announcers as as the number one positive, but this is a you know spin-off of them. They called out Jeff Fisher for every time a player of his gets hurt, he goes on the field.",
    "speaker" : "Steve",
    "timestamp" : "01:18:00-01:18:28"
  },
  {
    "timestamp" : "01:18:28-01:18:29",
    "text" : "That's right, yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:18:29-01:18:37",
    "speaker" : "Steve",
    "text" : "And I was like, that's awesome. And it's is I don't I don't think any other coaches do that. And I haven't seen any coaches really do that."
  },
  {
    "timestamp" : "01:18:37-01:18:39",
    "speaker" : "Andy",
    "text" : "Yeah, that's what they were saying, that he was the only one."
  },
  {
    "timestamp" : "01:18:41-01:18:47",
    "text" : "I understand Jeff Fisher for being the the epitome of mediocracy, you know?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep, that's true.",
    "timestamp" : "01:18:47-01:18:48"
  },
  {
    "timestamp" : "01:18:48-01:18:50",
    "speaker" : "Steve",
    "text" : "You gotta respect that a little bit."
  },
  {
    "timestamp" : "01:18:50-01:18:50",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:18:51-01:19:10",
    "speaker" : "Steve",
    "text" : "And then the worst. Was probably the missed kicks by Venetari Hina. One of them. I mean I can totally understand. And like, yeah, here it is. Yeah, finally broke that streak or whatever. But then he follows it up with that second one. And if you make both of those, this game was probably a little bit different, you know, when they were up."
  },
  {
    "timestamp" : "01:19:11-01:19:11",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:19:11-01:19:21",
    "text" : "Well, 11, it would have been more comfortable. 15 or 18, you know. An absolute blowout if he makes those. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "And they they may have kicked an extra field goal until they're trying to go from fourth down there, too, that they failed.",
    "timestamp" : "01:19:21-01:19:27"
  },
  {
    "speaker" : "Steve",
    "text" : "There's also a uh sneaky other good one. They showed a highlight of the Chiefs game.",
    "timestamp" : "01:19:27-01:19:33"
  },
  {
    "text" : "Yep.",
    "speaker" : "Andy",
    "timestamp" : "01:19:34-01:19:34"
  },
  {
    "timestamp" : "01:19:35-01:19:48",
    "speaker" : "Steve",
    "text" : "With Johnny Morton. Which obviously throwback. And then he does the worm. He sure does. In a fucking amazing worm. And the announcers call it the wave."
  },
  {
    "speaker" : "Andy",
    "text" : "Well well one of them called it the wave. I don't know who it was, but one of them called it the wave, and the other one called it the body wave.",
    "timestamp" : "01:19:50-01:19:56"
  },
  {
    "timestamp" : "01:19:56-01:20:04",
    "text" : "Dude, it looks way more like a wave than a worm. I'm a hundred percent in on the wave. I want to call that the wave going forward. I don't know.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:20:05-01:20:10",
    "speaker" : "Andy",
    "text" : "There's gotta be is for nothing. No. Body wave or not the waving with a body."
  },
  {
    "text" : "Body wave, the human wave. You know, I don't care what you call it. It's not a fucking worm. What kind of worm look the inch worm maybe moves like that, but that thing, you know, it's like, you know, it's different. That's a fucking that's that is a that is a wave. Can you do the worm, Steve Brown? Can you do the body wave? I can't do the body wave either.",
    "speaker" : "Steve",
    "timestamp" : "01:20:10-01:20:29"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:20:30-01:20:42",
    "text" : "See, you strike me as a I've seen you at at uh Stop waving at me. I've seen you at um weddings on the dance floor, and you strike me as the type of guy who could pull off the worm."
  },
  {
    "timestamp" : "01:20:42-01:20:52",
    "speaker" : "Steve",
    "text" : "Well look Andy, the dance moves choose me. I don't choose the dance moves. The wave hasn't chosen me, and I don't think the wave will ever choose me."
  },
  {
    "timestamp" : "01:20:52-01:20:59",
    "text" : "I don't know. I I find that hard to believe. I think the wave will eventually choose you at some point in your life.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I just don't think it will, but what we never know. I'll just have to keep dancing and find out.",
    "timestamp" : "01:20:59-01:21:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, I agree 100% with all of that.",
    "timestamp" : "01:21:04-01:21:07"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. What do you got for best and worse?",
    "timestamp" : "01:21:07-01:21:09"
  },
  {
    "text" : "All right. I got a couple last things we haven't talked about. This is kind of probably best for the Patriots, worst for the Titans. They showed a couple stats in the first quarter where Uh the Titans hadn't allowed a first quarter touchdown in the last 10 games, dating back to a Steelers game the previous season. On a s I think, and it was Tommy Maddox throwing like a 78-yard bomb. Bomb. And they also showed a stat where it had been seven games since New England had scored a first quarter touchdown.",
    "timestamp" : "01:21:09-01:21:43",
    "speaker" : "Andy"
  },
  {
    "text" : "That flash you back to this year.",
    "speaker" : "Steve",
    "timestamp" : "01:21:44-01:21:45"
  },
  {
    "speaker" : "Andy",
    "text" : "Um a little bit.",
    "timestamp" : "01:21:47-01:21:48"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:21:49-01:21:52",
    "text" : "Struggled in uh here in 2020 scoring touchdowns."
  },
  {
    "speaker" : "Andy",
    "text" : "And what happened but what happened though? Uh Tom Brady hits Troy Brown deep for 58 yards, touchdown in the first quarter. So both of those streaks, kaput.",
    "timestamp" : "01:21:52-01:22:01"
  },
  {
    "speaker" : "Steve",
    "text" : "Right at the end, a minute left. Yep.",
    "timestamp" : "01:22:01-01:22:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Hey, still counts, baby.",
    "timestamp" : "01:22:04-01:22:06"
  },
  {
    "timestamp" : "01:22:06-01:22:17",
    "speaker" : "Steve",
    "text" : "Who better to break that than Troy? Yeah. Um I've been watching that highlight over and over again. So it's the only one on your site. I'll have some more for you. It's a great highlight though. I don't need more."
  },
  {
    "timestamp" : "01:22:17-01:22:19",
    "text" : "That throw was perfect.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:22:19-01:22:21",
    "speaker" : "Steve",
    "text" : "Like Brady dropped it right in the bucket."
  },
  {
    "text" : "Yep. Oh, it was perfect.",
    "timestamp" : "01:22:23-01:22:25",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:22:25-01:22:30",
    "speaker" : "Steve",
    "text" : "One of those over your head ones, you know, that you only gonna see as soon as it clears your head."
  },
  {
    "text" : "And it just and it just cleared it perfectly. I think we should give another shout out to Craig Hentrich, the punter who's kicking field goals and kickoffs. I thought the and the dude made the Pro Bowl, so good for him. I didn't know. And I will give you one more shout out for the commentators, just because we love them. They pointed out that Drew Bennett, the receiver of the Titans. Was a QB at UCLA who is now their wide receiver. I put down leading wide receiver, but he wasn't. He was their third receiver behind Mason and McAran's. Uh gritty white wide receiver who used to play quarterback in college? That sounds familiar. Maybe we'll discover one of our own.",
    "timestamp" : "01:22:30-01:23:13",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:23:14-01:23:17",
    "text" : "He is a bigger dude, but yeah, I get what you're saying. Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:23:18-01:23:21",
    "text" : "Similar uh pass. He played at uh UCLA. You see.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I just how do we get Dan Deerdorf all time and not Gus Johnson. These guys, right?",
    "timestamp" : "01:23:23-01:23:28"
  },
  {
    "text" : "Brent Jones.",
    "speaker" : "Andy",
    "timestamp" : "01:23:29-01:23:29"
  },
  {
    "speaker" : "Steve",
    "text" : "They were so good. Yeah, Brent Jones and Gus Johnson, they were awesome.",
    "timestamp" : "01:23:30-01:23:33"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:23:33-01:23:37",
    "text" : "Yep. I uh I enjoyed them. They made the game so much better."
  },
  {
    "text" : "It was already a great game and they made the game a lot better.",
    "timestamp" : "01:23:37-01:23:40",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:23:40-01:23:46",
    "text" : "Yep. And so because of that, I think what we'll do is we'll end it the way we kind of started it. Okay.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Speaker 4",
    "text" : "And when you say seven, and when you say full to everybody, that's just a little goose. He's just gonna go up and goose the center. And he just he sees the the hole right inside. and you see him just lean forward, big hole up inside. You don't necessarily call that in the huddle. You just get up there and you say, hey, there's a big opening. I'm gonna goose my center and get right on his tailbone",
    "timestamp" : "01:23:47-01:24:08"
  },
  {
    "text" : "Wait, wait, wait, wait.",
    "timestamp" : "01:24:09-01:24:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:24:11-01:24:21",
    "text" : "Do you do you hear the other guy laugh as soon as he says the first goose? Because you know that this is going. You know this is going into football, enough football territory."
  },
  {
    "timestamp" : "01:24:21-01:24:26",
    "speaker" : "Andy",
    "text" : "I laugh too. I yeah, I can't help it. Great pairing."
  },
  {
    "speaker" : "Steve",
    "text" : "No, no football or not football has been more clearly not football than them talking about Armin Kateyan's feet.",
    "timestamp" : "01:24:27-01:24:35"
  },
  {
    "text" : "Oh my god, that was brutal. But no, I think Brent Jones, uh if I recall from the 2001 season, Brent Jones was the one who Mike Mello would get most of his quotes from. I love that. Brent Jones. Very, very football, not football quotable.",
    "timestamp" : "01:24:35-01:24:52",
    "speaker" : "Andy"
  },
  {
    "text" : "That's a great thing, I feel. Yeah.",
    "timestamp" : "01:24:53-01:24:55",
    "speaker" : "Steve"
  },
  {
    "text" : "So unless we're able to get the arm of contains feet, and then that's not even football.",
    "timestamp" : "01:24:55-01:24:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:24:59-01:24:59",
    "speaker" : "Steve",
    "text" : "It's just not football."
  },
  {
    "timestamp" : "01:25:00-01:25:35",
    "speaker" : "Andy",
    "text" : "I don't think that was Brent Jones, though. Yeah, exactly. So this was a definitely watchable game. You can find it on the Patriots Dynasty website, patriotynasty. info slash game slash 87. And you'll have uh YouTube, there's um primetime highlights of this game on there and both both halves. What else? Oh, we have our Patriots Dynasty hotline. If you want to call or text us, leave us a voicemail, leave us a text."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:25:35-01:25:46",
    "text" : "Hold on, let's see if I can remember it. 603-505. Troy Brown for three. Oh, for three, right. Troy Brown playing basketball."
  },
  {
    "speaker" : "Andy",
    "text" : "8043, baby. 505, 8043. 603 area code because we represent where that's where you live. Yes.",
    "timestamp" : "01:25:46-01:25:58"
  },
  {
    "timestamp" : "01:25:59-01:26:09",
    "text" : "A lot of people are like, yeah, I'm from the 603. It's a whole state, buddy. Yeah, which part. We got like six years in Virginia. You gotta be a little more specific. Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:26:09-01:26:42",
    "text" : "Well even Massachusetts has like four or five, don't they? Yeah. Are we the only state that only has one? Oh no. Come on, dude. You think North Dakota has multiple. Vermont definitely only has one, I'm sure. I don't even know. Get out of here. Uh so yeah, so if you have any feedback, if you have oh actually if you have anything you want to say about any of these games too, we'll uh if you if you went to these games or any of these upcoming games, you have notes for us, let us know. Or if you want to shit on Greg Baume for not showing up or not watching the games, you can feel free to do that too.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yep. And for that doctor's issue.",
    "timestamp" : "01:26:42-01:26:46"
  },
  {
    "timestamp" : "01:26:46-01:26:50",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, oh yeah. If you if you want to uh give him some some heads up on that."
  },
  {
    "text" : "Uh or if you just want to be like your doctor, maybe you're Andy's doctor and need to call him and tell him something that he needs to",
    "speaker" : "Steve",
    "timestamp" : "01:26:51-01:26:58"
  },
  {
    "text" : "Tested. Or maybe you're Steve Brown and you're just gonna text me that I'm an avocado. Um, but it's up to you. Uh we are listening, we're here. Again, 603, 505, 80 for three. All right. What's next week, Steve Brown? I don't know. Who are we playing? Oh, next week we have the Giants. At a game I think I may have gone to. Really? I'm gonna have to rewatch it to find out, but if this is a game where um Tiki Barber fumbles a lot, then yes.",
    "timestamp" : "01:26:58-01:27:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "We're about to find out.",
    "timestamp" : "01:27:33-01:27:34"
  },
  {
    "timestamp" : "01:27:35-01:27:35",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:27:35-01:27:40",
    "text" : "So join us next week on the Pages Dynasty Podcast, and we will see you then. See",
    "speaker" : "Speaker 5"
  }
]