[
  {
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:23-00:50",
    "text" : "Welcome back to the Patriots Dynasty Podcast. We are making our way through the 2003 season. We're at week six, where the Patriots host the Giants at a pristine Gillette Stadium. Uh and with us this week we have a special guest. Um not just Greg Brown on what sounds like a tin cam, but we also have Our I brethren, I guess, maybe we could wear for it? Uh Dave Brown."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh that I thought you meant like, you know, he has a legitimate journalist job and we have a fake journalist job",
    "timestamp" : "00:51-00:57"
  },
  {
    "text" : "Oh, no, no, no. He's he's much more fresh than we're another brown. Yes, so we have another brown on the podcast for when we do our Spinoff. Uh Browns on Browns. He will be joining us. Probably never. But he's joining us this week. So Dave, thanks for joining us.",
    "speaker" : "Andy",
    "timestamp" : "00:57-01:13"
  },
  {
    "timestamp" : "01:14-01:15",
    "text" : "Thanks for having me. Appreciate it.",
    "speaker" : "Dave Brown"
  },
  {
    "text" : "Let's start with the obvious question here, Dave. You also love Troy Brown, correct?",
    "speaker" : "Steve",
    "timestamp" : "01:16-01:22"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "Uh I can't imagine why anybody wouldn't appreciate Troy Brown.",
    "timestamp" : "01:24-01:28"
  },
  {
    "text" : "Um Good answer.",
    "speaker" : "Andy",
    "timestamp" : "01:28-01:29"
  },
  {
    "text" : "And and I have a and I have a a jersey for former Giants quarterback Dave Brown.",
    "speaker" : "Dave Brown",
    "timestamp" : "01:30-01:35"
  },
  {
    "timestamp" : "01:35-01:39",
    "speaker" : "Andy",
    "text" : "So there was a former Giants quarterback Dave Brown?"
  },
  {
    "timestamp" : "01:39-01:41",
    "speaker" : "Steve",
    "text" : "Yeah, I don't remember him."
  },
  {
    "speaker" : "Dave Brown",
    "text" : "What? Oh my goodness. Well, mid-90s, uh I wanna say so he was probably drafted in ninety-two, which um in the supplemental draft, which was the year the Giants took Strahan in the second round. So or I guess the supplemental draft would would probably be like ninety one. Anyway, he was the starting quarterback after Phil Simm's four bits Uh and he has I think like a 500 career record.",
    "timestamp" : "01:42-02:07"
  },
  {
    "text" : "He looks a lot like a young Vinnie Tessiverde probably from the pictures on Google, just in a Giants uniform.",
    "timestamp" : "02:08-02:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Dave Brown",
    "timestamp" : "02:14-02:22",
    "text" : "Yeah, he looks like like a quarterback, basically the mid nineties quarter. Yeah, yeah, exactly"
  },
  {
    "timestamp" : "02:22-02:30",
    "text" : "Although as I'm going through pictures on Google here, uh one of the articles that has his picture attached is the hundred worst football players of all time.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "That's very harsh. That's impossibly harsh. You can't have you can't just you just can't have played as many games as he did. And hang around the league for as long as he did.",
    "timestamp" : "02:32-02:41"
  },
  {
    "timestamp" : "02:42-02:47",
    "speaker" : "Steve",
    "text" : "Eli man just hold my beer, buddy. I'll show you mediocrity."
  },
  {
    "speaker" : "Dave Brown",
    "text" : "No, he was not as good as Eli Manning. No, no. Eli Eli was fine Dave Brown was just not viable starting quarterback. He let Manning won two Super Bowls. So that's true. You know, let's not get crazy",
    "timestamp" : "02:48-02:59"
  },
  {
    "timestamp" : "03:00-03:26",
    "speaker" : "Andy",
    "text" : "All right, so yeah, so if uh our listeners haven't figured it out, uh Dave Brown here is a Giants fan, but I came across him on Twitter because he was, is, I don't know, um A Patriots beat reporter for the Concord Monitor up here in New Hampshire. So I guess my first question, Dave, is um what the fuck? How does that how did that happen?"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "I'm not sure exactly where to apply um that question, but Oh, so you're asking in what's a very broad question. More state of the facts and then ask that afterwards. But I think what I can t like so a few years ago, twenty sixteen, I um approached the monitor and said, look, I I live in Boston, I driving distance to Foxborough I covered the PATS from 2006 to 2008 and you know I kind of like to pick that up again. Uh I left journalism, went to law school, became a lawyer and Said, hey, you know, in my spare time, I could write a bit about the Patriots, and that's what I chose to do.",
    "timestamp" : "03:27-04:12"
  },
  {
    "speaker" : "Andy",
    "text" : "All right. So how did you become a Patriots writer then? Like oh well or like are you from around here and how did you become a Giants fan?",
    "timestamp" : "04:13-04:24"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "I grew up in Rhode Island where so I was um I am 41. And there's a good number of Giants fans my age from southern New England, for sure.",
    "timestamp" : "04:24-04:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:37-04:37",
    "text" : "Yeah."
  },
  {
    "text" : "Uh there was a time when it was much easier the like the games would get blacked out here sometimes, and so it was easier to just get the Giants games. And uh, you know. So so I grew up in Rhode Island and that's how I became a Giants fan. My dad was from He grew up on the border of uh Rhode Island and Connecticut and much closer in his case, much easier to get the Giants game. So and they and actually when my dad was a kid, the Patriots didn't exist yet. Um You know, it was until nineteen sixty. So yeah. So he became a Giants fan before he was twelve years old. And uh you know, so that's how that kinda got passed down to me and then I I became a journalist. I went to URI for journalism. I went uh went and got a master's degree for Northwestern and then I um I got a full-time job down in North Carolina, which I started I I actually I think interviewed right before this game And then got hired and moved down there at the end of the month, so right before Halloween. I think this game was played like October 5th. And then um by the end of October, I was living in North Carolina and covered my first pro football game for a newspaper down there uh in December of that year. So I then wound up back up in New Bedford at the Standard Times, covering the Patriots from two thousand six to two thousand eight. And um yeah.",
    "speaker" : "Dave Brown",
    "timestamp" : "04:38-06:07"
  },
  {
    "speaker" : "Steve",
    "text" : "So how long you been doing the content?",
    "timestamp" : "06:08-06:09"
  },
  {
    "text" : "So I I did that from two thousand sixteen. Uh kind of uh everything's kind of on pause right now because there's just been a lot going on this year. But um Well yeah.",
    "timestamp" : "06:10-06:20",
    "speaker" : "Dave Brown"
  },
  {
    "text" : "Uh so to so I went to um wait, wait, wait, I got you didn't lose your job when the li the Giants beat the Patriots in the Super Bowl. And they were like, you're clearly cursed.",
    "speaker" : "Steve",
    "timestamp" : "06:20-06:35"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "So let me explain something. It's not the job of a beatwriter. It is not the job of a beatwriter to bring home a championship.",
    "timestamp" : "06:35-06:41"
  },
  {
    "text" : "That is we've got helping the cause, you know? Yeah. Right? A Giants fan in the myths.",
    "speaker" : "Steve",
    "timestamp" : "06:41-06:48"
  },
  {
    "text" : "Uh well I actually picked the Patriots. I I picked the Patriots in Super Bowl 42. Uh I was wrong. A lot of people were. And uh it was a very interesting and bizarre experience watching my favorite team win the Super Bowl against people I know. Like like Oh yeah. When you watch sports on television, you don't you you tend not to think of um the players as individuals. And That changes when you're in the locker room every day and it was in my second year. And um you know, having had conversations with these people and knowing them, you know, not you know, not like best friends or anything, but I'm saying knowing them um And and that hits you in a different way than what you watch on TV. So um so yeah, that was a really interesting experience.",
    "speaker" : "Dave Brown",
    "timestamp" : "06:49-07:42"
  },
  {
    "text" : "So you have met Troy Brown and can confirm with real life experience that he is the absolute man. Well, you know what?",
    "timestamp" : "07:43-07:52",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "07:53-08:17",
    "speaker" : "Dave Brown",
    "text" : "Thanks for coming on, Dave. When when I met Troy Brown, he had never shaved before What? Shaved? Shaved. He never shaved his facial hair. No way. He had like a goatee. I found this fascinating because he had like a goatee like a regularly formed go teeth uh as if as if he had shaved around it, but he never had shaved his face before in his life."
  },
  {
    "text" : "It just grew up.",
    "timestamp" : "08:17-08:18",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "08:20-09:11",
    "speaker" : "Dave Brown",
    "text" : "And I heard that on the radio and I thought that's right, I know, right? And I thought that's crazy and I had a conversation with him about it. And um At first I thought he was going to be very upset, but he wasn't. He was okay. But he did not want to talk about Yeah, he did not want to talk about it. Like he was like, Why is this a big deal? And I was like crazy. I just heard this I heard this thing And it was on the radio and I and I gather people are pr probably uh giving you a hard time about it, but I'm just curious because it sounds preposterous to me. I need to understand. And he uh he walked me through it He had never shaved before. And then I saw him on TV um a year or two ago and I was like, he had no goatee. So at some point between 2006 At 2020, Troy Brown shaved his facial hair for the first time."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "09:11-09:12"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "09:12-09:25",
    "text" : "Took the plunge. That's ridiculous. I found this nice glamour shot of him from the first Super Bowl in 2001. He's got a little mustache and just a little tiny goatee. It looks neatly trimmed."
  },
  {
    "text" : "Right? But it stays like that. That's just how it stays like that until that undetermined point where Troy Brown began shaming his face.",
    "speaker" : "Dave Brown",
    "timestamp" : "09:26-09:36"
  },
  {
    "text" : "Yeah, his uh Patriots coach pitcher. He's got no facial hair at all. Yeah. All right, fine Dave, you can stay as long as you've got more hilarious Troy Brown insight like that.",
    "speaker" : "Steve",
    "timestamp" : "09:36-09:46"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I don't know if you've noticed, but we're a very pro-Troy Brown podcast here. Mm-hmm.",
    "timestamp" : "09:46-09:51"
  },
  {
    "text" : "Again, that makes sense. He's you know, he was drafted in a round of the draft that no longer exists in the eighth round. And uh it turned out to be, you know, one of those like a Julian Edelman type guy who could just do anything you needed when you needed it and do it well.",
    "speaker" : "Dave Brown",
    "timestamp" : "09:51-10:10"
  },
  {
    "text" : "He was the original Julian Edelman in that mold. Yeah. All right, let's get into this game. Let's do it, yeah. Uh Dave, did you want to kind of talk a bit about the how you viewed the Giants at this point back in 2003? Maybe maybe we should start In a Lombardy rating, actually. Oh, that's right. Okay, yeah. So before we before we do that, I'm getting ahead of myself. Um this game ended 17 to 6 Patriots. It I think uh uh at It both felt worse than that and also closer than that, I thought. Um exactly. Yeah, and and Dave, what we do is we give because we watch every one of these games, but we don't expect our listeners to, so we give a a watchability score. Um because we're asshole Patriots fans, we do it out of six Lombardies.",
    "speaker" : "Andy",
    "timestamp" : "10:10-11:09"
  },
  {
    "timestamp" : "11:10-11:16",
    "speaker" : "Steve",
    "text" : "With a half point being an AFC championship and a quarter point being an AFC East Championship."
  },
  {
    "timestamp" : "11:17-11:29",
    "text" : "Right. For this game, I would probably give it Maybe a two? Well generous.",
    "speaker" : "Andy"
  },
  {
    "text" : "I'll give it a half championship.",
    "timestamp" : "11:29-11:32",
    "speaker" : "Steve"
  },
  {
    "text" : "It wasn't as bad as that Titans game, but it was it was like that, but we actually won it. It was sloppy. It was the sloppy game I've seen ever. Probably since we started doing this? Yeah, maybe ever. Yeah, it was it was rainy, the field was a mess. It was a pig sty. So many turnovers, so many penalties, so many drop passes, so many just everything. Miss field goals or what? One, two, three, there's three at least. Three for miss field goals? Three missed field goals all in the first half. Yeah. And then they just stopped going for field goals because fuck it.",
    "speaker" : "Andy",
    "timestamp" : "11:32-12:09"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, because fucking kick. It wasn't even that windy out.",
    "timestamp" : "12:09-12:12"
  },
  {
    "text" : "No. But uh yeah, so I would give it a one and a half.",
    "timestamp" : "12:12-12:16",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "12:16-12:26",
    "speaker" : "Steve",
    "text" : "What about you, Steve? Like I said, an AFC championship, and that's maybe being generous. It's just a just a point. One of the only because we won. Greg?"
  },
  {
    "timestamp" : "12:26-12:28",
    "text" : "Did you watch this one?",
    "speaker" : "Andy"
  },
  {
    "text" : "No, I did not. I don't blame you. From the bits I saw, I mean a it's a crazy weather game. You guys don't like crazy weather games?",
    "timestamp" : "12:29-12:36",
    "speaker" : "Greg"
  },
  {
    "text" : "But this wasn't a good one. Yeah. Sometimes it can be good, but this was like Brady was One for nine with four drops in the first half. Seven yards passing in the first half. It was just Yeah.",
    "timestamp" : "12:38-12:54",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "12:55-13:08",
    "speaker" : "Greg",
    "text" : "Yeah, that's crazy. You don't see that every day. That makes it kind of watchable. I don't like the games where he's like, you know, fifteen or twenty-five for 198. Like that stuff's boring to me. I like when some weird stuff happens."
  },
  {
    "timestamp" : "13:08-13:13",
    "speaker" : "Steve",
    "text" : "Well then rewatch this game, Greg. Come back to watch and be like, wow, that was a really great game to watch. I'm glad I sat."
  },
  {
    "text" : "The Ravens game was an excellent watch.",
    "timestamp" : "13:14-13:16",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. That game was way better than this game. Yeah, this game was not that game.",
    "timestamp" : "13:17-13:21",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Because there was no like execution this game was the problem.",
    "timestamp" : "13:22-13:25"
  },
  {
    "text" : "Yeah. But like just the penalties and the drops and just bad football. Yeah.",
    "timestamp" : "13:28-13:34",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "13:34-13:38",
    "speaker" : "Andy",
    "text" : "What about you, Dave? How did you view this game as a Giants fan?"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "Matt Chatham scored a touchdown in this game. You guys have no appreciation for how great this was.",
    "timestamp" : "13:38-13:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh well we're gonna get to that because that's why it got a two from me because",
    "timestamp" : "13:44-13:48"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "I'm I'm not done. I'm I am just getting one back. All right, let's go. So you've got that you got the defensive touchdown. The Giants turn the ball over twice in their first three offensive snaps. And I'm sitting there like, yep, that's what watching Giant the Giants was like every week at this at this stage of the game with Kiki Barber before um Tom Coughlin came in and really sick Picky Barber. Okay. Like like he this is like his fourth or fifth fumble of the year and what is this, the fourth or fifth game of the year for the Giants The simple game. Okay. That's right. Like everyone changed his style. Yeah. That's right. And and and you know, Coughlin came in, he fixed that. Um, but at this point in the game, that's what it was like. And Watching like one of the things I thought about coming into this game was 2003 is the year that Belichick says they figured out That Tom Brady was not just a good quarterback, that he was really one of the best in the game. Like the this is the year when they start to figure out that he's special. And I was like, man, I really want to see what's going on with like Brady before he wins his second Super Bowl, right? Because at that point in the game, no one expected 2001. He leads the league in touchdown in 2002. What's going on now? And in the first half, he was Awful. It was just terrible. And I was like, I have never seen Brady play like this. Never. Never have I seen it. And bad. And they and they worked it out. They they got better in the second half, but it was a wet gross. He was playing with the glove.",
    "timestamp" : "13:51-15:25"
  },
  {
    "timestamp" : "15:25-15:27",
    "speaker" : "Steve",
    "text" : "Yeah, the both on both ends."
  },
  {
    "speaker" : "Andy",
    "text" : "There's been a lot of Glove Gate in all these years, which I all all 2002 was uh like every time he had a bad game. the announcers would bring up the gloves immediately because nobody ever plays with gloves anymore and yada yada yada.",
    "timestamp" : "15:28-15:41"
  },
  {
    "text" : "Jeremy Shockey was in this game. Jeremy Shockey was Gronk before Gronk? Like like Gronk is sort of like a more like they they rebooted the Jeremy Shockey character and that's Rob Gronkowski. Yeah, they made him a little bit of a Yeah. Jeremy Shocking's a little more dynamic receiver.",
    "speaker" : "Dave Brown",
    "timestamp" : "15:42-16:01"
  },
  {
    "text" : "You know, like he's more of a like a Travis Kelsey You he felt to me like a Travis Kelsey like that.",
    "timestamp" : "16:02-16:08",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "16:09-17:49",
    "speaker" : "Dave Brown",
    "text" : "I mean when Gronk, I mean, I I I'm seeing the exact same thing. The stuff about remember after Super Bowl 46 when Gronk was dancing at that party and people were like, oh, look at this. Right? The guy just walked the game. He's not dancing. Yeah. Jeremy Shockey would that was a Jeremy Shockey story practically. Okay. You had said it was Jeremy Shockey Right now and then like, remember after Super Bowl and Jeremy Shockey was dancing, I'd be like, Oh yeah, of course. You know what I mean? Like like guys who like to have uh the the stories about them you know, it's like prodigious drinkers who like girls and are tight ends who can block and and catch passes. Very similar. So Jeremy Shockey's out there. And for me, you know I know like these are the two football teams that I paid the most attention to in my life and just so much going on that I thought was fascinating Um but if you really want to understand how the 2003 Patriots were so great, I mean this game kind of They just kind of suffocated the Giants. They let the Giants make as many mistakes as they could. I was shocked at how many penalties the Patriots committed, but especially in the first half, it was kind of a disaster. But um I don't know. There was a lot for me to like in this game. Now, this was not like the 2018 AFC Champion AFC Championship in Kansas City. It wasn't bad. No. But you know, it was a pretty good like. I would give it like a three and a half out of six. Okay. Which on the which on the giant scale is a two and a half out of four"
  },
  {
    "text" : "Fair enough. All right. I like that he translates.",
    "speaker" : "Andy",
    "timestamp" : "17:50-17:54"
  },
  {
    "timestamp" : "17:54-18:03",
    "speaker" : "Greg",
    "text" : "I agree. I agree with Dave Sure I did. I watched the prime highlights."
  },
  {
    "timestamp" : "18:05-18:08",
    "speaker" : "Andy",
    "text" : "Yeah. There was primetime highlights of this, I couldn't find any."
  },
  {
    "timestamp" : "18:09-18:11",
    "text" : "There sure was. Oh, all right. Wow.",
    "speaker" : "Greg"
  },
  {
    "text" : "Send me the links I can put on the website. But yeah, um I also I I had a bone to pick with these referees because On top of like how sloppy the game was, like they were just it was the the wrong game to call Tiki Tac penalties, and that's what they were doing the entire game. So even on like the one few times that there was like an actual play that was made, there was like a Troy Brown like long completion right down the middle, like towards the end of the game where Like they converted a third and 18, and there was like this like ticky-tack holding call on it. And there was a couple others like that too. Like every kick return that made it outside the 20 got called back. And every time they ch even the even the announcers who I enjoyed in this game. They were okay. I liked I liked uh Daryl Johnson. Moose.",
    "timestamp" : "18:12-19:04",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "19:04-19:14",
    "speaker" : "Steve",
    "text" : "Wait, wait, wait. Sorry to interrupt you, Andy, but I don't know if you heard me. I just had an epiphany there. What? I you know the Chris Bermanism Amani well-dressed tumor? Yeah."
  },
  {
    "timestamp" : "19:14-19:15",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I was like, how would a tumor be well dressed? Oh my god. And I just figured out it's like Armani, like the suit manufacturer. God 33. And I have been hearing that like Chris Burbanism forever, and I'd never ever fucking got it until now and it's so obvious.",
    "timestamp" : "19:16-19:35"
  },
  {
    "speaker" : "Andy",
    "text" : "Did you know Bad Moon Rising is actually a song?",
    "timestamp" : "19:35-19:37"
  },
  {
    "timestamp" : "19:38-19:39",
    "speaker" : "Steve",
    "text" : "Yeah, I knew that. Okay."
  },
  {
    "timestamp" : "19:40-19:50",
    "speaker" : "Dave Brown",
    "text" : "God I know I was like like was a doom Why would you admit out loud on a recording that you don't understand Chris Berman reference"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh that's you obviously have not listened to this podcast. That is tame for this thing. Oh yeah. Also, none of us have any shame. No, no.",
    "timestamp" : "19:50-20:01"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "How do you how does one become shameless in a podcast about uh early dynasty patriots Football games.",
    "timestamp" : "20:02-20:10"
  },
  {
    "timestamp" : "20:10-20:22",
    "speaker" : "Andy",
    "text" : "You just watch enough of them and it just leaves you. Yeah, it's uh it's uh it's more of a sense of entitlement, I think, more than anything. We can get away with anything. All right, I get that. Yeah, we just make a lot of sense."
  },
  {
    "timestamp" : "20:22-20:24",
    "text" : "Yeah, who cares? Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "But yeah, let's talk about uh Moose Johnson because I think having former fullbacks commentate games is a great idea because you got so much like fullback oriented uh like commentary and insight that was amazing. I felt the two regular guys, eh, take it or leave it.",
    "speaker" : "Andy",
    "timestamp" : "20:25-20:45"
  },
  {
    "text" : "You know who was awesome in this game? I forgot about Goose on the Silas. Tony Saragusa, yeah. Tony Saragusa, he was so fucking good. He wasn't. He was he was so bad he was good. No, he was awesome. He the when he's standing in the end zone had to come out of second half and Everyone's like been talking about how they need to get him a coat and he's like, yeah, I had a coat, but then the the fans here started shitting on me, so I put the coat away and he's a t-shirt.",
    "timestamp" : "20:45-21:13",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:13-21:14",
    "text" : "Calling him soft."
  },
  {
    "timestamp" : "21:15-22:19",
    "speaker" : "Dave Brown",
    "text" : "Oh my god. And then there's a lot of things. This guy needs I hope he I hope he sent a thank you letter to David Chase who created the Sopranos. Because this is around the time when the Sopranos was really popular and so kind of like uh like a fat Italian guy on the sidelines, like really hemming it up. Like he looks like he should be I he was he even in an episode of the Surinos at some point because it's like he's stilling this idea in our heads of like some like a New Jersey tough guy. And on that at one point in this Well, at one point is he gets into an argument with Moose about whether coaches should tell the teams to um you know try to win three out of every four games. Yeah, I'm and I was on T And he's like You should never you he's like you should never acknowledge that losing is possible. And and Moose was carefully walking him through Where where did you all come out on this great debate?"
  },
  {
    "timestamp" : "22:19-22:31",
    "text" : "Team Goose, 100%. You know Bill Belichick doesn't fucking plan to lose. Like, well guys, well we break the quarter the season into quarters. We'll go three and one each quarter and then we'll end up twelve and four. It'll be great.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "No no 'cause the first question is all right coach who we gonna lose to this quarter? Exactly Which game you expect to play?",
    "timestamp" : "22:31-22:37"
  },
  {
    "timestamp" : "22:37-22:41",
    "speaker" : "Greg",
    "text" : "Can you explain can you explain what the argument was?"
  },
  {
    "timestamp" : "22:41-23:01",
    "speaker" : "Steve",
    "text" : "So Moose was saying that he was talking about the Giants and Jim Fossil was a coach at the time. And how they broke the season into quarters and said if we can just go three and one each quarter, you know, we'll we'll do our jobs. So they're they're breaking the game the the season into four game chunks and say, okay, well who we're gonna lose to and who we're gonna be."
  },
  {
    "text" : "I don't know if it was that it was just like it was more of just like, yeah, if if we're going to if we can go three and one each quarter, like we're we're doing our jobs, and if we do our jobs, we'll make the playoffs. And Goose was like, why don't you go?",
    "timestamp" : "23:02-23:15",
    "speaker" : "Andy"
  },
  {
    "text" : "Goose is kind of saying why not beat everyone up? Yeah.",
    "timestamp" : "23:15-23:20",
    "speaker" : "Dave Brown"
  },
  {
    "text" : "Why not plan on on going 4-0 each quarter?",
    "timestamp" : "23:21-23:24",
    "speaker" : "Andy"
  },
  {
    "text" : "And Moose is saying, now both of these guys have won Super Bowls. Right. Uh Moose did it with the with the Cowboys. And Moose is saying, look, when I'm just with the Cowboys, we used to talk about things like that Like win all of your home games and try to split on the road and you're 12 and 4. Or win three out of every four. Win every quarter of the season. I happen to think that neither of these approaches I I don't think either of these people are crazy, but I think that the approach, and I think what what we've seen be successful in Foxboro is Exactly. We're gonna want to know this. We're gonna focus on winning this game. We're gonna do everything we can. And then when the game is over, we're not gonna worry about whether we won or lost it. We're gonna focus on the next one.",
    "timestamp" : "23:24-24:13",
    "speaker" : "Dave Brown"
  },
  {
    "timestamp" : "24:13-24:17",
    "speaker" : "Steve",
    "text" : "Yeah, and we're gonna go one and oh next week. Yeah. I didn't think about that, but yet's a hundred percent right."
  },
  {
    "timestamp" : "24:17-24:29",
    "speaker" : "Andy",
    "text" : "Yep. And that's I think that's the di so actually I thought that was kind of one of the differences between a coach like Bill Belichick and a coach like Jim Fossil."
  },
  {
    "text" : "Before we get into the Jim Fossil bashing, I've got one more note on Goose here. Alright, give me that goose note. Actually, you know what?",
    "timestamp" : "24:29-24:36",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm gonna save it for my best. Okay. Um yeah, so so Dave, how did you feel about Jim Fossil as a head coach?",
    "timestamp" : "24:36-24:43"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "So first of all, whoever put together your show notes, um, these are really great. Like there's so much information here. Wow, someone actually read them? Um They got three Pearl Bowlers in this draft, but um but okay let me focus on uh you're not allowed to say one of their names. Ah, well he was our he was our Matthew Slater.",
    "timestamp" : "24:44-25:21"
  },
  {
    "timestamp" : "25:21-25:24",
    "text" : "Yeah. He had two close block kicks in this game.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, so he was a special teams pro bowler.",
    "timestamp" : "25:24-25:26",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "David Tyree.",
    "timestamp" : "25:26-25:27"
  },
  {
    "timestamp" : "25:27-25:28",
    "text" : "Is that right?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "25:28-25:28",
    "text" : "Yeah."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "25:28-25:29"
  },
  {
    "text" : "Yes. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "25:29-25:30"
  },
  {
    "text" : "Okay, because I I saw that too and I was on like he made the Pro Bowl? Uh so I didn't realize he he made a special TV guy.",
    "timestamp" : "25:30-25:37",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Dave Brown",
    "timestamp" : "25:37-25:44",
    "text" : "He had almost two blocks. And also OC OC Omanura and David Deal. Who was their tackle?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "25:44-25:46",
    "text" : "Yep. Yeah."
  },
  {
    "timestamp" : "25:46-27:23",
    "speaker" : "Dave Brown",
    "text" : "But uh but okay, so the show notes are great. I will say this. I have one bone to pick. The show notes say that Jim Fossil was a mediocre NFL head coach as most Giants coaches are. Now look first one I'm interested to see where we're welcome to remember we're talking about the diamonds here. Well he's just comparing them to what he knows. I'm trying to decide if if Jim Fossil was mediocre. I mean he coached for I think seven or eight years with the Giants, which is a good run. He went to the Super Bowl He had three winning what but three winning seasons, uh, which isn't great. That's pretty mediocre. His record's slightly above five hundred, but coming into like What you have to understand about the Giants is that like coming into this season, you could look at Fossil and Belichick. And genuinely asked the question, if you had to hire a coach right now, who would you hire? And after the year 2000 Most people I think would have said fossil because he was just coming off a run to the Super Bowl where they lost to the Raven. He had a better record than Bill, and Bill has come off like a five and eleven season Uh and then after 2001, Bill wins in the championship. In 2002, the Giants make the playoff So and the Patriots don't. So it's heading into this season, I so I don't I guess what I'm saying is my idea of a mediocre coach in the NFL is a little worse than possible. He accomplished a few things. That's fair. But his whole like his whole career falls apart in this season."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "27:24-27:24"
  },
  {
    "text" : "He's is never the same for him after this And this season is sort of like this game is sort of like a microcosm of that season. Where the Giants played the Giants played one horrible half in almost every game that year. And their season was like they they get they get to four and four. When they beat the Jets in Wiggate. So the Giants lose this game but then win two of their next three and then they lose the entire last half of the season This was their last eight games. Goodbye, Kerry Collins, goodbye Jim Fossil, hello Tom Coughlin, and hello Eli Manning. And Kurt Renner.",
    "timestamp" : "27:25-28:04",
    "speaker" : "Dave Brown"
  },
  {
    "speaker" : "Greg",
    "text" : "All right. Yeah. But but so back in two thousand when they win the super bowl, right? Is that is that uh fossil or is that Sean Baton and John Fox? Because those are his two coordinators. Right. Yeah.",
    "timestamp" : "28:06-28:20"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "Good coordinators, right? Good coordinators. Yeah. But it takes look I mean, Bill Barcel never won a Super Bowl without Bill Belichick.",
    "timestamp" : "28:20-28:31"
  },
  {
    "timestamp" : "28:32-28:32",
    "speaker" : "Andy",
    "text" : "Correct."
  },
  {
    "timestamp" : "28:34-29:44",
    "speaker" : "Dave Brown",
    "text" : "It takes look There is no one or two people that make a championship happen. It really is 53 people. And you know, to be the head coach and to put that team in that position, and by the way, he hired those coordinators. I I can't I can't discredit Jim Fossil. However, you know, did he do a good now one thing that Bill Belichick has done Is that whenever there's turnover, for 20 years he has managed it pretty well. Jim Fossil did not replace as those guys left, Jim Fossil did not do a great job of replacing them. And you know, I I think the Giants kind of ran into a wall with the salary cap being what it is And not really being able to, you know, avoid the mistakes that they were making in this game. And then it just became time for a reboot because If you're if you're a star running back who it was pretty good, if he can't hold on to the football, if he's losing it every single week, you're not going to be suspicious. successful."
  },
  {
    "timestamp" : "29:44-30:08",
    "text" : "Yeah, that's a perfect segue into like the microcosm of that is they gave a big speech, I guess, and all talk about, you know, increasing game toughness and Tiki Barber and the coaching. Oh, I have that. Hang on. And the announcers are like, this is like top of their list, because it's 12 minutes into the, you know, they're into the game at 1231. And I'm you're gonna play it right now, Andy?",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, I'll I'll here. Here's the the actual clip.",
    "speaker" : "Andy",
    "timestamp" : "30:08-30:11"
  },
  {
    "speaker" : "Speaker 7",
    "text" : "I thought this was hilarious. With an interception, but Tiki Barber, when he talked about the team underachieving, one of the things that he felt they lacked was game toughness. And I asked him about that and he said the definition of that is is being able to take advantage of opportunities during the game and capitalizing on mistakes. And the Giants did that. The defense comes out, they overcome the adversity of that opening drive. Now it's the offense's turn. And we'll see if they've increased that game toughness that he wanted to see him have.",
    "timestamp" : "30:11-30:37"
  },
  {
    "timestamp" : "30:37-30:44",
    "speaker" : "Speaker 8",
    "text" : "Tiki lost the football. Matt Shadham takes it in for a touchdown."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:45-30:57",
    "text" : "So yeah, absolutely perfect timing by the commentators to bring that up right then. God, the segue was just beautiful. Beautiful. Like you couldn't have scripted that any better."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. It's almost like he knew Tiki Barber is about to fumble for a scoop in score.",
    "timestamp" : "30:58-31:04"
  },
  {
    "timestamp" : "31:04-31:14",
    "speaker" : "Andy",
    "text" : "Well let's see what the offense can do. Oop, they fumbled in Talk about being mentally playing mentally tough and let's uh yeah now the offense needs to step up and be mentally tough here."
  },
  {
    "timestamp" : "31:14-31:21",
    "speaker" : "Steve",
    "text" : "And to provide even more context, they threw an interception on the first play from scrimmage. Right. Patriots turned into a missed fucking field goal."
  },
  {
    "text" : "Right.",
    "speaker" : "Andy",
    "timestamp" : "31:22-31:22"
  },
  {
    "text" : "So they got the ball back and go, oh no harm, no foul. And then fumble it in. Chad and you know I was doing myself.",
    "timestamp" : "31:22-31:28",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "That was those the two offenses were so inept on their first three series. And um and the Giants just that's what was so dispiriting about the Giants around this time was like You know that the ability is there. You s you watch this game, you watch these horrible conditions. They moved up and down the field no problem. And then what happens? The kicker got hurt a week before. So they've got Some guy they signed off the street, missing everything, and on grass. These aren't easy kicks, but but you know, they're stalling and and They're just not getting the ball in the end zone. Tiki Barber falls down in that awful grass that they ripped out three years later Yeah.",
    "timestamp" : "31:30-32:13"
  },
  {
    "text" : "Um, there's a uh the nuts had a stat. Four drives within our thirty-five yard line and got zero points out of it.",
    "timestamp" : "32:14-32:21",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. There you go.",
    "timestamp" : "32:21-32:22"
  },
  {
    "timestamp" : "32:22-32:42",
    "speaker" : "Andy",
    "text" : "Well, I mean to your point about I think this is the first half. Um they they showed a stat about ball control. The Giants had 40 plays for 190 yards in about 20 minutes of offense or possession. Patriots had 20 plays for 30 yards and under nine minutes. And we're leading 7-3. Yeah, and the Patriots are winning 7-3 going in the half."
  },
  {
    "text" : "The boot. Yeah. Because the Giants missed two. Yeah.",
    "timestamp" : "32:43-32:47",
    "speaker" : "Steve"
  },
  {
    "text" : "Also keep in mind also deserve to give. You deserve to give a after this season.",
    "speaker" : "Greg",
    "timestamp" : "32:47-32:54"
  },
  {
    "text" : "That yeah, that's of course.",
    "speaker" : "Steve",
    "timestamp" : "32:54-32:55"
  },
  {
    "speaker" : "Greg",
    "text" : "You went from the th third the the third ranked defense in terms of points in two thousand and two to twenty-ninth. in two thousand and three. And their offense was worse. They were th thir in the thirtieth in the league. They lose eight straight to finish the season. And this is basically the same roster that you went to the Super Bowl with. So It's hard to blame the players there because clearly they have the talent. So when when you see numbers like that, you kind of have to be like, all right, this is this is a coach, you know? Yeah.",
    "timestamp" : "32:56-33:27"
  },
  {
    "timestamp" : "33:29-34:44",
    "speaker" : "Dave Brown",
    "text" : "Um yeah, uh i whatever was going on it wasn't working anymore. And you have to if you look back The the Giants 2002 season, the end of it was horrible. They had a Let's see, they were up 28-14 on the 49ers at halftime, and I think it was up to 38 to um Sorry, I'm looking at this. It was 38 to 14 in the playoffs with four minutes and twenty-seven seconds left. In the third quarter, okay? Thirty-eight to fourteen is only one point less than twenty-eight three. That's a good thing. Okay, it's a twenty-four point deficit with four and a half minutes left in the third quarter. At San Francisco. And I mean, it was I remember thinking every single time being like All they have to do to win this game is get this first down or make this stop. Yeah. And it just never happened. I had the same feeling in Indianapolis in 2006. Well let's unpack this, Mr. Brown."
  },
  {
    "speaker" : "Steve",
    "text" : "Do you ever wish you were a Patriots fan and not a Giants fan?",
    "timestamp" : "34:45-34:49"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "No. Actually, one of the things one of the things that's been great is that Wow I can observe the Patriots. I think that they're sort of like they're run like a model organization of what the rest of the league should be doing. I can go and be passionate and throw things and you know, be emotionally invested in the Giants and then I can watch the Patriots as sort of like a clinical exercise and be like everything they do is fascinating. It's a good idea. But you never like at least the guys did this, you know?",
    "timestamp" : "34:50-35:19"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:19-35:20",
    "text" : "Like"
  },
  {
    "timestamp" : "35:21-35:47",
    "speaker" : "Dave Brown",
    "text" : "Oh, of course. There are plenty of things that I wish but and that's part of it is that understanding there like when the Giants traded Odell Beckham, I felt good about that. I felt like this is a situation where Um I I felt like Belichick would have done it actually much sooner. Because he did it with Channel Jones. Yeah. Right? I'm gonna I'm gonna trade him rather like the Giants re-signed Or not beckon, which was a little silly."
  },
  {
    "timestamp" : "35:47-35:47",
    "speaker" : "Speaker 8",
    "text" : "Yeah."
  },
  {
    "timestamp" : "35:47-37:01",
    "text" : "Uh they should have traded him and and gotten something in return before they inv they wound up losing some money, um some dead money on that. But it it's the kind of thing where when the Giants do something smart, I recognize it and I say that's something like what the pay that's something the Patriots would do. And when they do something that's just like when they when they get stuck in the draft And they and the guy they want, Brandon Scherf goes to Washington They like panic and take Eric Flowers. And he was a complete disaster. And the Patriots don't do that. They don't just be like, okay, what do we need and who's the best on the board? What the Giants need to do in that situation is what the Patriots would do. The guy I want isn't here. D3. Trade down. Yep. Trade down. You hear that guy? If the thing that you want there, trade down. And Jerry Reese, who was the was the general manager before Gettleman, never once in the time he was there, never once did he trade down. Oh my god. You you all don't know. Like you all don't know how great you have it. Well you're watching. Dr. Alliance fan. We have a we have an idea.",
    "speaker" : "Dave Brown"
  },
  {
    "timestamp" : "37:05-37:12",
    "speaker" : "Andy",
    "text" : "No, you know what it is is is we get to doing this podcast, we get to it's uh like a clinical exercise when we talk to fans of other teams."
  },
  {
    "timestamp" : "37:13-37:13",
    "text" : "Yeah",
    "speaker" : "Steve"
  },
  {
    "text" : "So I hope that therapy says that's the thing. Seattle and Pittsburgh are the only teams other than the Patriots who have won. And tell me if I'm wrong on this. I believe those are the only oh, because no, Seattle didn't win another one. It was just Pittsburgh. Pittsburgh, the Giants, and the Patriots are the only three teams that have won two championships or more in the last 20 years. Does that sound right? Sounds right off the top of my head. Yes. No, well right, because I'm starting the year after but even if you want to grab around, go ahead.",
    "timestamp" : "37:14-37:57",
    "speaker" : "Dave Brown"
  },
  {
    "text" : "Point stance.",
    "timestamp" : "38:00-38:00",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "38:00-38:10",
    "speaker" : "Dave Brown",
    "text" : "And um and I'm starting with two thousand one. But what about the bills? Don't throw me up. I could do another hour and build some pen."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "38:11-38:18",
    "text" : "Giants mistakes? But here's I I did not know that Patton was an ex-giant. Oh yeah. How did I not know that? Yes."
  },
  {
    "speaker" : "Dave Brown",
    "text" : "Did you like this game was 17 years ago?",
    "timestamp" : "38:19-38:21"
  },
  {
    "text" : "Was he like any good when they first had him? And like was there like a West Welker, Miami Dolphins where everybody knew he was good and they let him go anyways? Mm no. It wasn't like that. It was great at Diony. There you go. Down him and Dion Branch, like early Dion Branch and I guess it's probably late stage David Patton are both pretty fucking solid.",
    "timestamp" : "38:21-38:43",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "38:45-39:22",
    "text" : "Um yes, I I don't disagree. The the point I'm trying to make here though is that you have um the Giants will win The Giants of Pittsburgh, they both win like two championships over the next two decades while the Patriots are just dominant. But but in between Super Bowl appearances They have a 412 complete and total meltdown disaster. So they went to the Super Bowl in 2000, and then seven years later, they're back. But the road in between is much different than what you had with the Patriots between their win in 2004 and then the next one in 2014.",
    "speaker" : "Dave Brown"
  },
  {
    "text" : "Right.",
    "speaker" : "Andy",
    "timestamp" : "39:22-39:23"
  },
  {
    "timestamp" : "39:23-39:31",
    "text" : "They never Where you're always feeling like you have a chance to win the Super Bowl. No one else feels that way. Right. No one else feels like that.",
    "speaker" : "Dave Brown"
  },
  {
    "timestamp" : "39:31-39:50",
    "speaker" : "Andy",
    "text" : "No, Lions fans do up until about week two. Yeah. Oh yeah. From what we've learned about. Yeah. Yeah, our uh our uh opinion of that lasts longer through a season than the most fans, I think."
  },
  {
    "speaker" : "Steve",
    "text" : "But the flip side is it's even more devastating as we saw the entire New England region melt down when the Patriots got that four game losing streak recently of like This is the end. Everything's gonna be terrible.",
    "timestamp" : "39:51-40:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, we we have no idea how to handle adversity. Relax. Yeah, no idea how to handle it.",
    "timestamp" : "40:02-40:07"
  },
  {
    "text" : "And suddenly, now now suddenly you guys are having a kind of fun. That you don't normally experience, where the Patriots went out and surprised you By beating the Ravens.",
    "speaker" : "Dave Brown",
    "timestamp" : "40:07-40:21"
  },
  {
    "text" : "Oh, I was I was a believer. I was not surprised. Yeah, okay.",
    "timestamp" : "40:22-40:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "But a lot of people were. A lot of people were surprised and rightfully surprised. And and the Ravens came in and they're supposed to win that game at six and two. It was a weird feeling. You know, I think the guy on that. Yeah, we're definitely gonna win But isn't it I mean there's some there's a little bit of fun to it when it's like when the team proves to you that it's gonna be competitive. When the team comes out and says when the team comes out and shows you You might, you know, you might not have been aboard with where they're going. You might have worried been worried about where they're going. But now you have a little bit of reason. To say, hey, this team can be competitive this year. Yeah. Let's see how things go.",
    "timestamp" : "40:28-41:03"
  },
  {
    "timestamp" : "41:03-41:59",
    "text" : "And that's funny. I I've talked about that too where uh the games where Brady hasn't been the starting quarterback recently, like when he had his four game suspension and then this year. I felt differently going into games that I haven't felt in a while because as long as Brady was there Going into a Pagers game, the expectation was that the Pagers gonna win. And then if they didn't play up to that expectation, you got a little frustrated because even if they did win, it wasn't the win that you expect them to have. But now you don't have that. You're free from that expectation almost. So you can go in and be like, I have no idea what's going to happen if you start Garoppolo week one because I don't know, never seen him play. This could go anyway. And then they win, and you're like, oh, this is a great feeling. I'm surprised by it. So it it's I think that exactly is something that I mean, not to sound like a huge dick, but that's something that Patriots fans haven't been able to experience in a long time. For better or worse.",
    "speaker" : "Andy"
  },
  {
    "text" : "No, it's true. It's 100% true. Yeah.",
    "timestamp" : "41:59-42:02",
    "speaker" : "Dave Brown"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean the losing sucks though. You can do without that. Luckily we have we have a podcast where we're uh at the beginning of a twenty-one game win streak. So a lot of wins ahead of us.",
    "timestamp" : "42:02-42:14"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "42:15-42:17",
    "text" : "Let's get back to this dub yeah."
  },
  {
    "timestamp" : "42:17-42:42",
    "text" : "Yeah, let's do it. Um I I wanted to talk about the fact this was on Fox, because you don't see a lot of those games. Only usually when they play the NFC East, it feels like. It's always like a Giants or Cowboys games when the Fox guys are here. Um, and I forgot how much uh Fox broadcast feels like a commercial for whatever's coming up next. In this case, it was the ALCS game for.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Dude, they would not leave that home.",
    "timestamp" : "42:43-42:44"
  },
  {
    "text" : "Any fucking chance they got. They're like, oh by the way, guess what's coming up? It's like, yeah, we know. You told us 30 seconds ago. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "42:45-42:51"
  },
  {
    "speaker" : "Dave Brown",
    "timestamp" : "42:53-42:56",
    "text" : "For a game that got rained out."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:56-42:56",
    "text" : "Did it?"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "The game that night. So so I uh host uh I co-host a podcast called Entitled Town with uh with my co-host Iron Mike Irons, who you may know from Twitter as at this place or Wait, uh at Ironhead 334. This place Bostonian is is his handle. Um and he was at this game. He was at the Patriots game",
    "timestamp" : "42:58-43:23"
  },
  {
    "timestamp" : "43:23-43:49",
    "speaker" : "Andy",
    "text" : "So I shut it up. Some giants actually. You went giants game? Yeah, I completely forgot. But yes, I was I was sitting in the rain. I went with One of our parents and I got told to sit down because I wouldn't sit down in the game in the stands. The guys behind me told me to sit the fuck down. How old are you? The guys behind me. Yeah, in 2003, I would have been 1819, maybe 20?"
  },
  {
    "timestamp" : "43:49-43:52",
    "speaker" : "Steve",
    "text" : "Ah, you should totally get crammed up as cram hole."
  },
  {
    "timestamp" : "43:52-44:01",
    "speaker" : "Andy",
    "text" : "Yeah. I think it was like me and mom, so I was about to tell some some randos behind me. Just stick up the cram hole with mom sitting next to me."
  },
  {
    "timestamp" : "44:09-44:32",
    "speaker" : "Dave Brown",
    "text" : "Oh. Hiked up to Boston, aided at McDonald's in Dedham, and then raced over to Fenway Got there just in time for them to pull out the tarp and say, sorry guys, not tonight. So brutal He couldn't and he couldn't go. The next day was being a Monday, he could not go. Right."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:32-44:38",
    "text" : "That sucks. Uh it wouldn't really matter because the Red Sox would not win that series. Well, it's a good one."
  },
  {
    "speaker" : "Greg",
    "text" : "Seriously.",
    "timestamp" : "44:39-44:40"
  },
  {
    "timestamp" : "44:40-45:06",
    "text" : "Yep. That's a three, baby. But this they were talking about the the game before, I think it was game three. There was the bullpen altercation, which I don't know if you guys remember. I remember it like when I jogged my own memory, but there was a uh I think it was after the game, there was a fight between A fenway. It was during the game, I believe. Was it? I yeah, I don't remember exactly. It was always a ground screw member.",
    "speaker" : "Andy"
  },
  {
    "text" : "Because the bullpen's the bullpen's emptied. Something started. Oh, I don't remember how the fight started. It was Jeff Nelson.",
    "speaker" : "Dave Brown",
    "timestamp" : "45:07-45:13"
  },
  {
    "timestamp" : "45:14-45:15",
    "speaker" : "Andy",
    "text" : "Nobody seems to know, yeah."
  },
  {
    "timestamp" : "45:16-45:44",
    "text" : "One of the clubhouse workers. Something started in there. And then the bullpen's emptied. And somehow Pedro and Don Zimmer square off. And Pedro like grabs Zimmer. So Zimmer, for whatever reason, he's like 100 years old. Yeah. He's like 100 years old at this point. He goes and charges Pedro. Charge grabs him by the head and throws him on the ground like And it looks up like, what, me?",
    "speaker" : "Dave Brown"
  },
  {
    "timestamp" : "45:44-45:47",
    "speaker" : "Greg",
    "text" : "But man, it was a scene."
  },
  {
    "text" : "That was a wild game. And I remember where I was during I didn't even remember this this particular football game, but that baseball game, I remember where I was when I watched it because it was completely insane.",
    "speaker" : "Dave Brown",
    "timestamp" : "45:47-45:59"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:01-46:24",
    "text" : "Yeah, but like apparently two Yankee relievers beat up a grounds crew member who, according to this New York Times article, the ground crew member Paul Williams went to Beth Israel Deaconis Hospital about eight forty five PM Saturday and r and was released early Sunday morning. He left wearing a neck brace, the Associated Press said. Jesus fuck."
  },
  {
    "speaker" : "Steve",
    "text" : "Fucking Yankees, man.",
    "timestamp" : "46:24-46:25"
  },
  {
    "timestamp" : "46:25-46:32",
    "speaker" : "Andy",
    "text" : "But to thought here you go. The Red Sox accuse Yankees relief pitcher Jeff Nelson and right fielder Kareem Garcia of attacking Williams."
  },
  {
    "timestamp" : "46:33-46:35",
    "speaker" : "Greg",
    "text" : "Kareem Garcia was a thug."
  },
  {
    "text" : "I remember him being a bit a dick.",
    "timestamp" : "46:36-46:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "46:39-46:43",
    "text" : "Yeah. This is the height of the Yankees Red Sox rivalry."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, this was the peak of it, yeah. And Fox was all about promoting it. Yeah, speaking of Actually, oh I have a uh I have uh I have uh a goose clip because he was talking about Um walking around Boston after after that game.",
    "timestamp" : "46:43-47:04"
  },
  {
    "timestamp" : "47:07-47:48",
    "text" : "Yeah. After checking once again with Tony. You know, I was a little hesitant about coming to the stadium today. I was walking in the streets of Boston last night and I saw about 25 fights. I was really impressed by the way the fans have really handled themselves, so I asked the police officer if he was you know concerned about anybody jumping out of the stand, sort of like we saw with the Red Sox game. He says if anybody gets out of hand here, we not only throw them out of the stadium, but we take their season ticket away. and resell it. So I was wondering, I looked up in the center and I said, well, all these people are pretty calm because they don't want to get hit in the pocket. It was pretty neat that he told me that. 25 fights last night, huh? Yeah I saw a taxi driver get beat up. I wanted to jump in, but I was full.",
    "speaker" : "Speaker 5"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:50-47:52",
    "text" : "I wanted to jump in, but I was full."
  },
  {
    "text" : "That was my point on living. Because I didn't understand that. I didn't understand what he said. And he said, I saw a taxi diver get beat up. I wanted to jump in, but I was full. Yeah. Does that mean like he was too busy? Like he was like he was I think he just ate hands were full?",
    "speaker" : "Dave Brown",
    "timestamp" : "47:53-48:11"
  },
  {
    "timestamp" : "48:13-48:14",
    "speaker" : "Andy",
    "text" : "He just eaten dinner."
  },
  {
    "text" : "Oh. Oh my god. That was gonna be my best, AD.",
    "timestamp" : "48:21-48:24",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:24-48:27",
    "text" : "Creative fucking ruin it. Dude. So good."
  },
  {
    "timestamp" : "48:28-48:53",
    "speaker" : "Dave Brown",
    "text" : "No, well listen, this was insane. Because I was like. I'm watching the show and I'm like, did t did Tony Saragusa just say that like he wanted to beat up a taxi driver just because the guy was basically because he was a taxi driver Like he was like he was like, hey, those people over there are kicking some strangers ass and I'm one in, but I'm full. That's weird."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:54-48:57",
    "text" : "That's exactly but I ate too much calamari. So uh fuck it."
  },
  {
    "timestamp" : "48:57-49:00",
    "speaker" : "Dave Brown",
    "text" : "This is Ray Lewis level nonsense is all I'm saying."
  },
  {
    "timestamp" : "49:01-49:07",
    "speaker" : "Andy",
    "text" : "Oh yeah. Oh it's it's complete garbage. Twenty he saw twenty-five fights walking around Boston that night. I don't think he did."
  },
  {
    "text" : "Twenty-five bites. Yeah. By the way, I did want to see a cab driver stab a guy in Tenmore Square after a Red Sox game, but that's That was a whole other thing. Just it was crazy. And it was after a playoff game, but but I don't think it was related to baseball.",
    "speaker" : "Dave Brown",
    "timestamp" : "49:07-49:24"
  },
  {
    "speaker" : "Andy",
    "text" : "Was it a Yankee playoff game?",
    "timestamp" : "49:24-49:26"
  },
  {
    "speaker" : "Dave Brown",
    "timestamp" : "49:27-50:22",
    "text" : "No, it was I think it was oh seven or oh eight. They didn't play the Yankees. It was it was they didn't play the Yankees either of those series. It was just really busy in Kenmore Square and the the cab driver gave us a cab and somebody Started yelling at him about it and then threw out some choice uh racial epithets and the guy like who the guy was Middle Eastern, he uh grabbed a device like a like a uh um just like an ice pick almost type thing. And the other guy called him like some like anti-Muglem type slimmers. And the guy grabs this thing and like stabs the guy with it. And then kicked us out of the cab. And I'm like, what did we do? Just give me a ride. I don't care that you stab someone. I just want to get to I just gotta get home. And uh And uh it's I went for a long walk after that. That's about all I can say."
  },
  {
    "timestamp" : "50:23-50:24",
    "speaker" : "Andy",
    "text" : "So maybe it was 25 fights."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "50:25-50:32",
    "text" : "Yeah, I would much rather get a cab ride home from that dude and be like, hey, you know, how did that how do you feel now? Yeah You feel better?"
  },
  {
    "speaker" : "Andy",
    "text" : "God damn. Well I'd I'd say uh this this game probably felt a lot like the um goose walking around bossing because it felt like a bit of a uh showing the injuries.",
    "timestamp" : "50:34-50:45"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh I really appreciate the Giants were wearing white in this game. Because the field was such a fucking sloppy mess. That like everybody got covered in brown and then you could see the fresh dudes come in and like they're pristine white.",
    "timestamp" : "50:45-51:00"
  },
  {
    "speaker" : "Andy",
    "text" : "And even though commentators are calling them out. Yeah, there was some uh wide receiver for the Giants at the end of the game when there's down two scores, and he took a run they showed the replay, he took a run at Rodney Harrison. So Harrison just like threw him on the ground and the guy tried to kick him in the face and then ever like a after that happened, Rodney was targeting him the entire game. It was the only guy, only wide receiver who was like completely like clean jersey. So the to the point where the commentator's like, why why isn't he dirty? Like he's been playing. I guess he just hasn't done much. Dude, Rodney balled out in this game.",
    "timestamp" : "51:00-51:33"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:33-51:34",
    "text" : "Two interceptions."
  },
  {
    "text" : "Yes. And he had like nine or ten tackles too, I think.",
    "speaker" : "Andy",
    "timestamp" : "51:35-51:38"
  },
  {
    "text" : "Yeah. He was all over. I mean, let's be real, a fucking super sloppy rain mud game. That's where like Rodney Harrison thrives.",
    "speaker" : "Steve",
    "timestamp" : "51:38-51:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. Yeah. This this was de like a slug fest like that is definitely his his MO. Greg, what do you think?",
    "timestamp" : "51:48-51:54"
  },
  {
    "timestamp" : "51:54-52:06",
    "speaker" : "Greg",
    "text" : "Uh I think Tyrone Poole had a good game, personally. Also Roman Pfeiffer, 19 tackles. Tyrone Poole had a strip on that fumble. Andy had a pick."
  },
  {
    "text" : "Yep.",
    "timestamp" : "52:06-52:06",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Chris Chris Berman said he uh Tyrone Poole, he always plays well in the rain.",
    "timestamp" : "52:07-52:13"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh. That's not bad. Yeah, there was a there was a sequence where they kept dumping it off a tiki just like short and Pfeiffer was racking him. It was like Tiki, you gotta talk to Kerry Collins and be like, stop. Oh my god. Yeah.",
    "timestamp" : "52:15-52:30"
  },
  {
    "timestamp" : "52:30-52:39",
    "speaker" : "Andy",
    "text" : "I wrote it down. I'm like, he's Kerry Collins is gonna get Tiki sent to the hospital with these passes over the middle. Because they're just like he's leading them into linebackers."
  },
  {
    "speaker" : "Dave Brown",
    "text" : "Th there were times when there were issues between like it was a feud between Barber And Strahan over their respective contracts for a while. Yeah. There were a handful of things going on between those two, like over the years. And I also remember that like I think Tiki left before 2007 and I don't think anybody liked him after. And I'm sitting there well like it took a while. Like there were a lot of damaged relationships after Tiki Barber left. And I'm sitting there watching this game and I'm like, I don't think Kerry Collins likes it.",
    "timestamp" : "52:40-53:19"
  },
  {
    "timestamp" : "53:19-53:27",
    "speaker" : "Steve",
    "text" : "I don't think so either. Trying to get him killed. I mean, Tiki Barber had the dirtiest jersey of everybody. Oh my god, yeah."
  },
  {
    "timestamp" : "53:27-53:46",
    "text" : "And that that said though, it's hard to make good throws when you're under constant pressure. And the the the defensive front that the Patriots had is just insane. And watching Richard Seymour in this game, he just completely changes the dynamic on every play.",
    "speaker" : "Dave Brown"
  },
  {
    "text" : "And having said that, like this defense was absolutely decimated with injuries, too. Like you're starting Matt Chatham. Right. Uh, because guys like Willie McGuinness aren't there, who was an absolute monster at this point. Like this is still, I think, peak Willie McGuinness era. Uh Bruski went down for a while. Ty Law went out halfway through the game because he's been playing on a bad angle for three, four weeks now. And like the offense was",
    "timestamp" : "53:47-54:13",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Garbage because they have nobody because this the field was so fucking sloppy and Ty had that ankle injury, so they were like, mm-hmm. And they put in uh Antoine Harris, prior to Raleigh, North Carolina. He had a couple of great plays. He had one where he like bent Shocky in half where Shockey didn't see him. He got him like right above the hip and just boardioned him. And then that last interception to see uh the to Eugene Wilson, it went right right right through Antoine Harris's I watched that and I was like, oh, that that interception's not Carrie Collins' fault. Then they showed the replay and I was like, oh, that was a Patriots player who loved the catch and went together. That's definitely Carrie Collins. Who the fuck is he throwing it to?",
    "timestamp" : "54:13-54:59"
  },
  {
    "timestamp" : "54:59-55:15",
    "speaker" : "Andy",
    "text" : "Yeah, Dave, how do you feel about Kerry Collins? Because I I thought he played okay, but when he misses a throw, he fucking misses a throw. He if it's by the sidelines he misses. Yeah, it's like it's six rows deep if he misses it. It's like Jesus Christ. It's not even a good thing."
  },
  {
    "timestamp" : "55:15-56:29",
    "text" : "So here's what I'll say. Here's what I'll say about Kerry Collins is that you have to understand after Phil Sims, we went through this like Like Dave Brown, who I mentioned, he was supposed to be the next guy that didn't work out. I play with like Kent Graham. Uh there's Danny Cannell. Like these are all names you guys may have heard, but they're not guys that you want as your as your quarterback. And it was a long kind of time in the wilderness, and all of a sudden Kerry Collins, who had been, I believe, the first overall pick Uh one of those like ninety-five or whatever. The year that the Panthers came into the league, they they picked Kerry Collins first. So high highly touted prospect, he's supposed to kind of be a big deal. He had develops uh a bit of a drinking problem while in Carolina, things don't go well, and he winds up um in kind of like a backup role with the Saints, gets his act together and the Giants kind of pick him up cheap. And all of a sudden, here's a guide. I think they said it in the I think they said it in the broadcast. At the time there were only three Giants quarterbacks. Who would throw in for 15,000 yards? And one of them is Carrie Collins.",
    "speaker" : "Dave Brown"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "56:29-56:29",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "56:30-56:57",
    "speaker" : "Dave Brown",
    "text" : "And and like he was a very stable, sturdy guy. Uh got the team to a Super Bowl, and I'll tell you what, that 2000 season was so much fun. And it wasn't the Super Bowl, but in the NFC Championship, they I think they won 42 to nothing or 41 to nothing. And it was just like over before halftime. And Collins was amazing. Look, he threw for three hundred something yards in this game, but also four interceptions."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, let's take a break because there is also that like early drive where He's throwing on the run on third and goal, and Tiki Barber absolutely blows right by the jam and is alone in the end zone. And all he's gonna do is he can just air it out, loft it out, doesn't matter really where he throws it, except where he threw it behind. And just was that the play when Barber fell? Yeah, yeah, but Barber fell because he was trying to get back to the ball because he cause he threw it like five yards behind him.",
    "timestamp" : "56:57-57:27"
  },
  {
    "timestamp" : "57:28-57:31",
    "speaker" : "Andy",
    "text" : "Yeah, that was a rough, rough play."
  },
  {
    "timestamp" : "57:32-59:16",
    "speaker" : "Dave Brown",
    "text" : "I tr I I didn't pay attention then to the replay because I saw a barber felt but I just thought it was not Barbara. Oh Barbara was um wide the fuck open. Okay, interesting. So I'll just say this. Look, Carrie Collins was in like you know, going through all of these guys who just clearly were not the guy. And and remember, quarterbacks weren't They were important back then, but it it wasn't a passing league. So there were other things you could do, and you could have a game manager, but Kerry Collins was Something more than a game manager. He could make plays, and we just hadn't had a guy like that since Phil Sims. And so it at the very least felt like, and this I think is the this is the criteria for me. Does your team have a quarterback that where you where he doesn't need to be Patrick Mahomes, he doesn't need to be Tom Brady. But he's he'd the kind of guy that you feel like, yes, we could win a Super Bowl with him. Could he be Eli Manning level? And I felt like that with Kerry Collins. I felt like he could be Eli Manning level. He got them to a Super Bowl and they had to play against the greatest defense. Anyone's ever had a deal. What the 2000 Ravens though were a pretty good defense. Like they're they're in they're in that conversation uh about who's among the best. And that's what we're talking about. Like you have to go deal with the Ravens. That's a tough draw. If if they'd had to go against um you know, that Raiders team from two thousand two. Maybe they do a little better. So"
  },
  {
    "speaker" : "Andy",
    "text" : "It was easy to figure out their play calls.",
    "timestamp" : "59:19-59:21"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "But seriously. That's uh John Gruden is the only man who has ever defeated himself in a Super Bowl.",
    "timestamp" : "59:22-59:28"
  },
  {
    "speaker" : "Steve",
    "text" : "Alright, yeah. Let's hear since you're so old school, Giants and everything. What about Jeff Fiegels?",
    "timestamp" : "59:28-59:36"
  },
  {
    "text" : "Yeah, who had been an Eagles punter and started with the Patriots? I didn't know the Patriots.",
    "speaker" : "Dave Brown",
    "timestamp" : "59:37-59:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:42-59:44",
    "text" : "No, me neither. Drafted by the Patriots."
  },
  {
    "speaker" : "Steve",
    "text" : "He had attempted the field goal, right? Didn't he kick they're talking about how he kicked a field goal last week or something like that?",
    "timestamp" : "59:45-59:49"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "He had attempted a field goal the week before because Matt Bryant got hurt. Right. And um",
    "timestamp" : "59:51-59:56"
  },
  {
    "speaker" : "Andy",
    "text" : "And they picked somebody up and he got hurt. And then now they had some rando off the street kicking in this game.",
    "timestamp" : "59:56-01:00:02"
  },
  {
    "speaker" : "Dave Brown",
    "timestamp" : "01:00:02-01:00:03",
    "text" : "There you go."
  },
  {
    "timestamp" : "01:00:03-01:00:06",
    "speaker" : "Andy",
    "text" : "Who I didn't even write down his name because he wasn't worth it. Conway."
  },
  {
    "text" : "This is only ever field ghost.",
    "speaker" : "Steve",
    "timestamp" : "01:00:06-01:00:07"
  },
  {
    "text" : "So I I couldn't even tell you. Didn't matter to me.",
    "timestamp" : "01:00:09-01:00:14",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:00:15-01:00:21",
    "speaker" : "Steve",
    "text" : "Yeah, he's over one in his life. Nice. It's under twenty-nine yards too. This is a chippy"
  },
  {
    "timestamp" : "01:00:21-01:00:25",
    "speaker" : "Andy",
    "text" : "Yeah, I I I've seen Wes Walker hit uh 29-year field goals."
  },
  {
    "text" : "Yep. He's also 0 for 8 passing in his career.",
    "timestamp" : "01:00:25-01:00:29",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh that's a tough look.",
    "timestamp" : "01:00:31-01:00:32",
    "speaker" : "Andy"
  },
  {
    "text" : "It's a lot of bad snaps, it sounds like.",
    "timestamp" : "01:00:33-01:00:35",
    "speaker" : "Dave Brown"
  },
  {
    "timestamp" : "01:00:36-01:00:37",
    "text" : "It could be actually, yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:00:37-01:00:47",
    "text" : "But let's say he bounced it out with an absolutely amazing name. Fiegels, especially When he's on Philadelphia, I mean, come on. What a matchup.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "That's how I remember him.",
    "timestamp" : "01:00:49-01:00:50"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:50-01:00:50",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:00:51-01:00:52",
    "text" : "F Eagles.",
    "speaker" : "Dave Brown"
  },
  {
    "text" : "Four in Arizona, five in Seattle, and then six to finish the Giants.",
    "speaker" : "Steve",
    "timestamp" : "01:00:56-01:01:02"
  },
  {
    "text" : "Steve, Steve, this is a Patriots podcast.",
    "timestamp" : "01:01:03-01:01:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:01:05-01:01:08",
    "text" : "He's on two for New England as well. We drafted him."
  },
  {
    "text" : "Oh my god. This is more punter talk than I was expecting.",
    "timestamp" : "01:01:09-01:01:14",
    "speaker" : "Dave Brown"
  },
  {
    "timestamp" : "01:01:14-01:01:41",
    "speaker" : "Andy",
    "text" : "Longest. Yeah, no, we we talk a lot about punters randomly for some reason. That's fine. Uh we're not gonna talk about what's his face in this one though, because he's been pretty bad all season. So I'm not even gonna say his name. Who, Greg? No. Although speaking of bad um special teams players, Lonnie Paxton in this game got called for a false start on the fake punt that the Patriots tried."
  },
  {
    "text" : "Oh yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:01:41-01:01:42"
  },
  {
    "text" : "Uh how how do you get called for a fake punt when you're the guy snapping the football? Isn't that just the start of the play?",
    "speaker" : "Andy",
    "timestamp" : "01:01:43-01:01:49"
  },
  {
    "text" : "Yeah, I didn't get that either. And also like I hadn't seen a fake punt yet watching all of these games.",
    "timestamp" : "01:01:49-01:01:54",
    "speaker" : "Steve"
  },
  {
    "text" : "They they've tried a few times, but they keep getting penalties called on them or timeout called.",
    "timestamp" : "01:01:55-01:01:58",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "I think if you bob your head.",
    "timestamp" : "01:01:59-01:02:00"
  },
  {
    "timestamp" : "01:02:01-01:02:03",
    "speaker" : "Andy",
    "text" : "It must have been something like that."
  },
  {
    "timestamp" : "01:02:03-01:02:06",
    "text" : "So if you if you move something other than the ball.",
    "speaker" : "Dave Brown"
  },
  {
    "speaker" : "Andy",
    "text" : "He may have like double clutch the football too.",
    "timestamp" : "01:02:06-01:02:08"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "Yeah. If you move without moving the football, I think that's where your false start comes in.",
    "timestamp" : "01:02:09-01:02:13"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but that like as a as a As a like his job is literally just to be the long snapper. You would think that's kind of all he practices is snapping a football all day. So the fact that he's the one getting called. For the false star is a is a tough look.",
    "timestamp" : "01:02:13-01:02:30"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "Okay, Andy. How many of these how many snaps do you think Lonnie Paxton did in his career?",
    "timestamp" : "01:02:30-01:02:37"
  },
  {
    "text" : "Oh wow. I mean, how many field goals does Adam Vinateri have on the Patriots?",
    "timestamp" : "01:02:38-01:02:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Dave Brown",
    "timestamp" : "01:02:42-01:02:51",
    "text" : "And how many penalties? Like, you know, if he's 99% perfect. Then you know one in every hundred, this is gonna happen."
  },
  {
    "text" : "99% ain't perfect, Dave. Just gonna throw that out there.",
    "timestamp" : "01:02:51-01:02:54",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Dave Brown",
    "timestamp" : "01:02:54-01:03:03",
    "text" : "That's what I'm saying. If he's if he's one percent short of perfect, this is your one per If it had been an ongoing problem, I don't think he would have been as long as you want."
  },
  {
    "timestamp" : "01:03:03-01:03:10",
    "text" : "That's true. Is it this year or next year where they have the huge long snapper problems? I think it's next year. Or maybe he gets hurt in this.",
    "speaker" : "Steve"
  },
  {
    "text" : "I thought that was 01, wasn't it? No, no, no. Maybe. Yeah, there's one Super Bowl. Maybe.",
    "speaker" : "Andy",
    "timestamp" : "01:03:10-01:03:19"
  },
  {
    "speaker" : "Steve",
    "text" : "So Lonnie Paxson must get hurt and the guy they bring in has like a crazy roller cluster of a season. Snapping the so there's more to come in the long snapping for sure.",
    "timestamp" : "01:03:19-01:03:29"
  },
  {
    "speaker" : "Andy",
    "text" : "Um which doesn't help because advantagei. has now, after missing his first field goal in this game, which was a 42-yarder in shitty conditions, but still, uh, is now has now missed four of his last five field goals, which When you think of Adam and Atari, you don't think of missing four out of the last five ever being a stat.",
    "timestamp" : "01:03:30-01:03:50"
  },
  {
    "text" : "Yeah. It's a tough stretcher. This is probably the worst stretch you he maybe of his I mean, besides the Colts, but maybe of his Patriots career.",
    "speaker" : "Steve",
    "timestamp" : "01:03:50-01:03:57"
  },
  {
    "timestamp" : "01:03:57-01:04:30",
    "speaker" : "Andy",
    "text" : "I would I would I would assume so without Uh on the other hand though, I I will say that I'm gonna bring it up again because my brothers gave me a lot of shit at the end of last season talking about how I thought Kevin Falk was The unheralded MVP of the 2002 season. I think he's still probably unheralded MVP of this season because as soon as he came into this game in the second half, He was the spark plug again. He was the spark, yeah. And he's the one that lit this offense on fire. And as soon as he came in, they started driving up and down the field."
  },
  {
    "timestamp" : "01:04:30-01:04:41",
    "speaker" : "Steve",
    "text" : "There's another game, I forget which one, but he was also a spark plug where like they got they had nothing going. They turned to him. He's like the new it used to be Troy Brown was that Spark plug and now they find another one in Kevin Falk."
  },
  {
    "timestamp" : "01:04:42-01:05:03",
    "text" : "Yeah, exactly. And he's like I think that speed okay. So so I think falk speed and rushing to the outside, it changes the way the the giants have to defend them And that opened things up for the offense because now they couldn't cheat, um, stay home for a little bit because Mike Cloud just isn't as fast as Falk.",
    "speaker" : "Dave Brown"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:04-01:05:17",
    "text" : "It's true. Um but Mike Cloud uh the week before this game had himself a game, he had like what seven carries with 75 yards and two touchdowns or something. That looked like the next coming. Right. And this is all because Antoine Smith is hurt."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:05:18-01:05:19",
    "text" : "And Cloud gets another one."
  },
  {
    "speaker" : "Dave Brown",
    "text" : "It's all situational. Yeah. It's all situational because uh Cloud was in the right place. He was the right person for that job the week before. Yep. And in this game where where the Giants had just, I mean, that was Giants had this was two exceptional defensive lines. This game was all about these defensive lines.",
    "timestamp" : "01:05:19-01:05:39"
  },
  {
    "speaker" : "Speaker 8",
    "timestamp" : "01:05:39-01:05:39",
    "text" : "Yeah."
  },
  {
    "text" : "And they the Patriots needed that guy to come out to those outside rushes and kind of stretch that defense a little bit and make them, you know, um you know, settle them down a bit so that they couldn't They couldn't it it actually reminds me a little bit of what happened with Kansas City in the 2018 title game because when when they ran Sony down the Chiefs throats for the first drive",
    "speaker" : "Dave Brown",
    "timestamp" : "01:05:40-01:06:04"
  },
  {
    "timestamp" : "01:06:04-01:06:04",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:06:04-01:06:27",
    "speaker" : "Dave Brown",
    "text" : "The Chiefs now had to to to back off a little bit and they couldn't just go after Brady kind of, you know um Yeah, couldn't just pin their ears to full throttle. Right, right, exactly. And so that's what was going on here in the second half of the Giants, I think. Although I will say, Michael Strahan had two sacks in a game and he was awesome Michael Van was two."
  },
  {
    "timestamp" : "01:06:27-01:06:32",
    "speaker" : "Andy",
    "text" : "This is peak Michael Stray. He finished this season with eighteen and a half sacks, which you just like don't even think."
  },
  {
    "timestamp" : "01:06:35-01:07:12",
    "speaker" : "Dave Brown",
    "text" : "But but that's his second best season because he set a record a couple years earlier when he took when um Brett Favre kind of took that cheap sack. Yeah, yeah, yeah. But but this year he comes back with 18 and a half and he's like 33 years old. Okay? And he was on blood bled so Yes. Yeah. Drafted the same year as Buddhist. And he was the most so if you look if you stack up um Pro Football Reference uh tracks value under that um A Z uh stat, if you look at the draft stat. Strahan had the most value of any player in that rate."
  },
  {
    "speaker" : "Steve",
    "text" : "Let's let's play off the Stray Han love here on this peace podcast.",
    "timestamp" : "01:07:13-01:07:16"
  },
  {
    "speaker" : "Dave Brown",
    "timestamp" : "01:07:16-01:07:35",
    "text" : "Well wait, and let me just say this. His teeth are very far. That's true, but the Patriots passed on him twice because they had the number one overall pick, but they also had the first pick in the second round. Giants got them, I think, three or four picks after that"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:07:35-01:07:44",
    "text" : "Yeah, but who do the Patriots pick in those picks? Because they had some great draft. Tom Brady. Their second round pick was pretty good. Yeah."
  },
  {
    "timestamp" : "01:07:45-01:07:48",
    "speaker" : "Dave Brown",
    "text" : "Um I think it was an o I think they picked it offensive line though."
  },
  {
    "text" : "Something like that. Matt Light maybe. In ninety two.",
    "timestamp" : "01:07:48-01:07:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, all right. Um speaking of K Fault, this was his career high in rushing yards. I don't know if you saw that. Oh yeah, how many do you have? It was less than ninety-six or something like that? Eighty-seven. Eighty-seven. It says career high. Edge to that point. And he might have another one, but I Google it. He does not have a hundred-yard rushing game in his career. Damn. Yeah. So take that MVP team and shove it up your ass, Andy.",
    "timestamp" : "01:07:53-01:08:23"
  },
  {
    "timestamp" : "01:08:23-01:08:29",
    "text" : "So, well, all right, except he finished with 87 rushing yards. Brady finished with 91 passing yards.",
    "speaker" : "Andy"
  },
  {
    "text" : "So wow.",
    "timestamp" : "01:08:30-01:08:30",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:08:31-01:08:46",
    "text" : "So geez, Brady didn't break 100 yards passing in this game. Uh well actually no he did they had 112 but with if you count on the sacks they finished with 91 total passing. Gotcha. So uh yeah, so Kevin Falk was played, by the way. Oh, Chris Slade.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "Chris Slade was their second pick. Nice. Their second round pick. And Strahan went 40th overall.",
    "timestamp" : "01:08:46-01:08:52"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:57-01:09:04",
    "text" : "Yep. You gotta trade down and uh take as many chances as you can, right? Do you see how the Patriots are trying to get Bethel Johnson involved?"
  },
  {
    "text" : "Oh my god, yeah. Yeah, he was their new like. Uh yes, Dion Branch is hurt in this game, as is Daniel Graham and Antoine Smith. on offense. So the pages are rolling out Bethel Johnson and uh Patton and of course Troy Brown. And Mike Cloud seemed to be their only running back in the first half, and then they sprinkled in some Larry Senters until Kevin Falls.",
    "speaker" : "Andy",
    "timestamp" : "01:09:05-01:09:31"
  },
  {
    "speaker" : "Steve",
    "text" : "Bethel Johnson has awful hands. He he wasn't great. He is I mean he was great if he got the ball in his hands, but he couldn't fucking catch it.",
    "timestamp" : "01:09:31-01:09:40"
  },
  {
    "timestamp" : "01:09:40-01:09:42",
    "speaker" : "Andy",
    "text" : "He's been a great kick returner this year though."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:09:42-01:10:09",
    "text" : "Yeah, no, well they saw his flashes on kick returns. They're like, wow, he's fucking super fast and shifty. We'll just find ways to get the ball in his hands. But like he it's like Cordell Patterson. Yeah, he couldn't catch for shit either. I I think Bethel Johnson can run better routes than Pat uh Patterson, but yes. Just like you maybe get the ball to him and he's just gonna drop it. But on kick, I mean Cordell Patterson just tied the NFL record for kick return touchdowns the other day."
  },
  {
    "text" : "Was it a tie? Yeah, I know it is it was his second place. One of the two. Which is pretty impressive. That's not bad. Who else was in this game? Oh, Wayne Lucier was in this game? He's a lineman for the offensive lineman for the Giants. He is from New Hampshire and they talked Probably a bit too much about how he's a Patriots fan and he has uh the old school Pat Patriot logo tattooed on his shoulder. I love that. Yeah. Uh that's a tough look when you're on the Giants playing the Patriots. Yeah. Talking about how he had to had to band it bandage it up. Alright.",
    "timestamp" : "01:10:10-01:10:53",
    "speaker" : "Andy"
  },
  {
    "text" : "Let's do uh let's do our best and worse.",
    "timestamp" : "01:10:54-01:10:56",
    "speaker" : "Steve"
  },
  {
    "text" : "Okay. Uh Dave, so Uh back when we were younger around the dinner table we'd have to give our best and worst of the day. So we now do that on the podcast where we just pick our best and worst thing from the game. Uh Steve, do you want to go first? I get a couple, so you can go first actually. Alright. Actually, Dave, do you want to go first?",
    "speaker" : "Andy",
    "timestamp" : "01:10:57-01:11:17"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:11:18-01:11:18",
    "speaker" : "Dave Brown"
  },
  {
    "text" : "I know we kind of sprung this on you.",
    "timestamp" : "01:11:18-01:11:20",
    "speaker" : "Andy"
  },
  {
    "text" : "I wanna I want to see what you guys do. Oh no. Greg had to come back. I want to see how this goes.",
    "timestamp" : "01:11:20-01:11:26",
    "speaker" : "Dave Brown"
  },
  {
    "timestamp" : "01:11:26-01:11:55",
    "speaker" : "Andy",
    "text" : "Okay. Alright, okay. Let's do Greg's because he he had he had to he had to run. Reg's best of the game is Jim Fasle saying when it rains it pours about their turnovers, which is It's raining out. Yeah, I get it. It's clever wordplay, but uh All right. And his worst is that Kerry Collins threw 59 times in this game and managed to rack up an entire seven points."
  },
  {
    "timestamp" : "01:11:55-01:11:56",
    "speaker" : "Steve",
    "text" : "That is."
  },
  {
    "text" : "And it wasn't like they were down big either. You know what's even better? Uh they didn't even score seven points, they scored six. That's true. One in the first quarter, one in the fourth quarter. Oh and outside there it was nothing. Whoof. Yeah. And he had the touchdown at Digi just fucking totally that he missed. Um Let's see. I got a couple of bests here. One of my bests was in one of the game breaks. They went to the Cowboys-Eagles game, and the Eagles attempted a surprise-on-size kick. Which the Cowboys, uh, I don't even know who he was. I couldn't remember the name. Some some Williams maybe. Uh, caught the ball. uh in full in stride and returned it for an untouched uh kickoff return touchdown.",
    "speaker" : "Andy",
    "timestamp" : "01:11:58-01:12:44"
  },
  {
    "speaker" : "Steve",
    "text" : "It was the open against the Eagles?",
    "timestamp" : "01:12:45-01:12:46"
  },
  {
    "timestamp" : "01:12:47-01:12:48",
    "text" : "Against Eagles, yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Apparently to the Cowboys they did.",
    "speaker" : "Steve",
    "timestamp" : "01:12:49-01:12:52"
  },
  {
    "timestamp" : "01:12:52-01:12:58",
    "speaker" : "Andy",
    "text" : "It was one of the game breaks during the game where yeah they're the Eagles did a surprise on size kick. I it maybe just even been to start the game, yeah."
  },
  {
    "speaker" : "Dave Brown",
    "timestamp" : "01:12:58-01:13:29",
    "text" : "And uh the Cowboys did that The Giants did that to the Eagles just a year or two before this in a pla I think it was in I think it was in uh two thousand. 'Cause they beat the Eagles in the playoffs that ye and and this was during the rake they beat the Eagles three times I think that year. And Jason Seahorn was out on a hands team and the Eagles was late in the game. They had to do an onside kick that the Giants were expecting And they just kicked a line drive to Jason Seahorn and he ran it in."
  },
  {
    "speaker" : "Steve",
    "text" : "Apparently the announcer is saying that the Eagles had done this the last time they played the Cowboys and it had worked. It was the first kick of the game. Yeah. Caught it on the bounce. Yeah. And just See you later. At a full sprint and just like untouched.",
    "timestamp" : "01:13:29-01:13:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep.",
    "timestamp" : "01:13:53-01:13:53"
  },
  {
    "text" : "Yeah. What's the worst that could happen? I don't know. You can go down seven fucking nothing with like two seconds into the game. Yeah. So that was that was one of my up there for one of the quickest scores in NFL history. Think about that. Probably close, yeah. Because he caught that pretty much full sprint. Just grabbed it off the opening kick and is in in there for like 40 yards later.",
    "timestamp" : "01:13:53-01:14:16",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. I mean the only Yeah, the only quicker score I can think of is when during the butt fumble game when the Jets return that kickoff. And the ball popped out and uh Edelman caught it and just like walked it in for a touchdown. That was probably quicker from like kickoff to score, but it wasn't the beginning of the game.",
    "speaker" : "Andy",
    "timestamp" : "01:14:17-01:14:35"
  },
  {
    "timestamp" : "01:14:35-01:14:37",
    "text" : "So right, right. I mean I guess that probably might have happened.",
    "speaker" : "Steve"
  },
  {
    "text" : "But yeah. That was a quick one. Um let's see. Oh, I also like touched on this before. I really enjoyed all the fullback talk by Moose Johnson. Who apparently I looked up Moose Johnson and he is he was so good as a fullback. that he's the reason uh there is like a fullback position in the hall of fame now. Right. They basically created it for it to get him in. And now there's fullbacks in in the Hall of Fame because of him. So that's not bad.",
    "timestamp" : "01:14:37-01:15:09",
    "speaker" : "Andy"
  },
  {
    "text" : "I mean, I'm assuming Moose isn't his actual name.",
    "timestamp" : "01:15:09-01:15:12",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:15:13-01:16:25",
    "speaker" : "Andy",
    "text" : "No, his name is Daryl, but they call him Moose just because of how big he was. Yeah, that makes more sense. Yeah. Let's see, my worst. I think my worst would be Tiki Barber. Because he like from that first fumble. He looked like he was a basket case. Like mentally. You could see every time they showed a close-up of his face and stuff, he just looked like he didn't want to be on that football field, which you don't ever really see in a football player anymore. And it just kind of like there was a whole lot of like little pieces like that that may be why this team fell apart because it it almost felt like Jim Fossil was losing the the locker room. Like they kept Talking about like these little things here and there, like uh Visant Visante Shankko was tossed from practice this week. They didn't explain why, but they're like, oh yeah, this sort of stuff has been happening with the Giants. And like kind of. talking around the issues that the Giants were having in the locker room without actually really addressing any of them. And so just the whole, you know, Tiki talking all week about playing mentally tough and then immediately giving up the fumble kind of like"
  },
  {
    "speaker" : "Steve",
    "text" : "Not a great look. Um I mean it was great to watch though.",
    "timestamp" : "01:16:26-01:16:29"
  },
  {
    "timestamp" : "01:16:29-01:16:46",
    "text" : "Yeah. I also I don't remember what this clip is because I didn't Markets don't play it as well. Yeah, so it I just have uh it's checkers and chess compared to Jim Fasle. Jim Fossil. Um I mean not this. So let's find out what this is.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Speaker 5",
    "timestamp" : "01:16:47-01:16:50",
    "text" : "Will Corolla went over for a chat with Jim Fossil."
  },
  {
    "speaker" : "Speaker 8",
    "text" : "New York tried to challenge the ruling on the field from the prior play. However, the ball was smacked before the bus.",
    "timestamp" : "01:16:50-01:16:58"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:17:00-01:17:07",
    "text" : "That's right. So um so the Patriots completed a long pass down the sideline to Patton."
  },
  {
    "speaker" : "Dave Brown",
    "text" : "Which was a sick grab.",
    "timestamp" : "01:17:08-01:17:09"
  },
  {
    "timestamp" : "01:17:09-01:17:11",
    "speaker" : "Andy",
    "text" : "It was and it it would have stood if it was a big thing."
  },
  {
    "text" : "That would have been a bad challenge.",
    "speaker" : "Dave Brown",
    "timestamp" : "01:17:11-01:17:13"
  },
  {
    "text" : "It would have been. But the fact that he that Jim Fossil tried to challenge it two plays later because the Patriots ran up and Brady ran a QB sneak so that they couldn't. Is like that's the exact those are like those small little things that Bill Belichick teaches his team. That like other coaches don't think about. That's true. You don't too see too many QB sneaks when they try to run the quick play. It's just get up there, get a playoff so that they can't challenge it if it's close. We don't we don't care If it's correct the correct call or not. Like we're not actually gonna find out. We're just gonna like put the pressure on them to do that. Right, right. And like everybody everybody does it now, but like Belichick was the one that could be.",
    "timestamp" : "01:17:14-01:17:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Also, did you hear in that ref's explanation? This is back when they had the buzzers. Correct, yeah. Instead of the flags.",
    "timestamp" : "01:17:54-01:18:01"
  },
  {
    "timestamp" : "01:18:01-01:18:01",
    "text" : "Oh wow.",
    "speaker" : "Dave Brown"
  },
  {
    "timestamp" : "01:18:01-01:18:02",
    "speaker" : "Steve",
    "text" : "Yeah. Yeah."
  },
  {
    "speaker" : "Dave Brown",
    "text" : "I I think they have both. This is what Belchick does, is that he thinks these things through because he knows they're going to happen in the game. And so many times we see the league catch up later. The big one that comes to mind for me is deferring on the kickoff.",
    "timestamp" : "01:18:03-01:18:20"
  },
  {
    "text" : "Yep. Yeah, that's a big one.",
    "timestamp" : "01:18:20-01:18:22",
    "speaker" : "Greg"
  },
  {
    "text" : "No one else did that. No one else was doing that regularly when that when they changed the the coin toss rule. And Bill started immediately deferring. And now deferring is standard. Yeah.",
    "timestamp" : "01:18:22-01:18:36",
    "speaker" : "Dave Brown"
  },
  {
    "text" : "Yeah. That's a good point. Don't do it.",
    "speaker" : "Steve",
    "timestamp" : "01:18:36-01:18:37"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "And now running up to the line, running up to the line to snap the ball. So the other team can't review is standard as is trying to get a timeout in to prevent the the offense from doing that Yep. Um there's a little bit of gamesmanship now.",
    "timestamp" : "01:18:38-01:18:54"
  },
  {
    "text" : "Or even in this game you saw it too, where uh towards the end of the half, um like out of a break, the the Giants would come out to to run a play. And they would line up and then uh Belichick would immediately call a timeout and make them have to change what play they're doing and also be able to prepare their defense specifically for this like w all the different things that could happen in this this situation.",
    "speaker" : "Andy",
    "timestamp" : "01:18:54-01:19:16"
  },
  {
    "timestamp" : "01:19:16-01:19:25",
    "text" : "Well I'm Greg, I'm glad Greg isn't here to shit on Belichick because he was texting me this week about How he should have declined some offsides penalty during the Ravens game.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:19:25-01:19:52",
    "text" : "Yeah, Greg's Greg's too much of a fence sitter for me. This is a dynasty podcast. All right, I'll give you my bests and worsts. All right, well, I got one more. Um God. It's just the worst, and it was uh the the Fox broadcast when they were trying to show the um the starting lineups at the beginning. The the Patriots one with all the the backs and receivers was empty. It had Michael Cloud in there and a picture Troy Brown, but no names"
  },
  {
    "timestamp" : "01:19:56-01:20:04",
    "text" : "One where like the the fucking they tried to like drop down the timeouts or whatever and it just like glitches over and over and over and over again is like getting that weird noise.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Dave Brown",
    "timestamp" : "01:20:05-01:20:09",
    "text" : "Or just buzzed. And then went away. It was so bizarre."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:20:09-01:20:13",
    "text" : "It was very strange. Yeah, it was it was a rough outing for the the Fox team."
  },
  {
    "speaker" : "Steve",
    "text" : "So what do you got, Steve? Two best, two worsts. Which ones do you want? How do you want them? You want two worsts and then two best. So you you tell me, I'll deliver them. Give me best first and then worse. Uh this is Matt Chatham's best game. Correct. Fumble recovery for a touchdown. He had a good p sack. He had a sack and a tackle for a loss. He was kind of all over the backside of the backfield. I thought he played super well and like, you know, he's getting that spot start and he showed up. Yep. And uh we talked to Matt about that. And showed him all his stuff and nice to see that like and we I know this game was coming up you know from that interview we did with him and it was cool to like see it actually in play even if it was a terrible game to actually watch.",
    "timestamp" : "01:20:14-01:21:01"
  },
  {
    "timestamp" : "01:21:02-01:21:02",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:21:03-01:21:09",
    "text" : "And then my real best was uh my other best we'll call it."
  },
  {
    "text" : "Good save.",
    "timestamp" : "01:21:09-01:21:10",
    "speaker" : "Andy"
  },
  {
    "text" : "Was uh the muscle must have been a Caroline blue in the stands at halftime, you know? Because they couldn't catch a fucking ball in the first goddamn half. And all of a sudden they come out in the second half and they're like, well that that dumb broad who's been drinking all day, Paulin. You got Gotta start catching them too. I don't know, because Cam Newton wasn't in this game, so I don't know if that's that's I'm dropping fucking balls all all game.",
    "speaker" : "Steve",
    "timestamp" : "01:21:10-01:21:34"
  },
  {
    "text" : "Which is like how you're bringing back Cam Newton erotica. Yeah. Yeah, three weeks later. Six weeks later. Jesus Christ. Good for you. Uh what even worse?",
    "speaker" : "Andy",
    "timestamp" : "01:21:34-01:21:45"
  },
  {
    "speaker" : "Steve",
    "text" : "Th there was a play where Brie was in the in the red zone. And had a crossing route on third down to uh what's his name the fullback and just fucking Larry just like he like Didn't even try to get out of the way.",
    "timestamp" : "01:21:45-01:21:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Nope. Hit him square in the shit.",
    "timestamp" : "01:21:59-01:22:00"
  },
  {
    "timestamp" : "01:22:01-01:22:07",
    "speaker" : "Steve",
    "text" : "It's like he wasn't expecting the ball to come be thrown right at him. You know, he's like, oh shit, a ball, you know? Come on, buddy."
  },
  {
    "speaker" : "Andy",
    "text" : "Get your head on the swivel a little bit. And then and then the commentators talked about how even he couldn't catch a ball and he was dropping him. Yeah. Because at that point, Brady, I think, was still one for nine with four drops. Oh, it was brutal. It was a tough look, yeah.",
    "timestamp" : "01:22:07-01:22:22"
  },
  {
    "text" : "And then there is like a a triple sack where Collins got like wrecked. Oh yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:22:22-01:22:29"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:22:30-01:22:32",
    "text" : "Cleco caught him in the head."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:22:32-01:22:44",
    "text" : "Yeah. And it wasn't like a super dirty hit. Um but I don't know if you noticed this. The commentators reference a hit in the preseason by Bill Romanowski."
  },
  {
    "text" : "Oh, I heard about that, yeah.",
    "timestamp" : "01:22:44-01:22:46",
    "speaker" : "Andy"
  },
  {
    "text" : "And I I actually I Googled it right when we started this. Podcast. I don't know if you saw my face. It's ridiculous. Really? Yeah. Bill Romanowski breaks Kelly Collins' jaw. It's on YouTube. It's five seconds long. Oh god. It is an abs and to think this is the fucking preseason is insane. Well that's Bill Rom Bill Romanowski was a fucking psychopath, so that doesn't really surprise me. So it took his head off, broke his jaw in two places. Holy shit. Yeah. In the fucking preseason. In the preseason. It was actually kind of the same spot right on the chin. But like Romanowski got him like full head of steam, clean. Where fucking Cleco just like it was like a bang bang sort of play.",
    "speaker" : "Steve",
    "timestamp" : "01:22:46-01:23:28"
  },
  {
    "text" : "Well just to go off that, uh I had a note from that play too. Um and it was that Kerry Collins looks like a failed stand-up comedian with his helmet off. Because he was like moderately attractive, but like completely disheveled. Yeah, that like looked like he'd been on the road for six weeks and like you hadn't shaved or or showered very well for a while and just looked completely burnt out, like dead behind the eyes, sort of look.",
    "speaker" : "Andy",
    "timestamp" : "01:23:29-01:23:56"
  },
  {
    "speaker" : "Steve",
    "text" : "Well it I bet he could give you a tight five. So I could definitely understand that. Yeah.",
    "timestamp" : "01:23:56-01:24:04"
  },
  {
    "timestamp" : "01:24:05-01:24:13",
    "text" : "He kind of look he's one of those guys like Jim Brewer who always looks like he's high. Yes. Right. He had a very Jim Brewer-esque look.",
    "speaker" : "Dave Brown"
  },
  {
    "text" : "I think that's probably who I pictured in my mind when I saw when I wrote that down. Oh, so you think Jim Brewer has failed? I got it.",
    "speaker" : "Andy",
    "timestamp" : "01:24:13-01:24:19"
  },
  {
    "text" : "Yeah, that's that's curious. Well Carrie Collins fly he's not Chris Rock, but I think that Kerry Collins and Jim Brewer are pretty much in the same boat uh in terms of career success.",
    "timestamp" : "01:24:19-01:24:33",
    "speaker" : "Dave Brown"
  },
  {
    "speaker" : "Andy",
    "text" : "So what you're saying is Kerr Collins is the Jim Brewer of quarterbacks? Sure. Let's do it. I'm in for this. Uh all right, you got a best and worse, Dave?",
    "timestamp" : "01:24:32-01:24:45"
  },
  {
    "timestamp" : "01:24:46-01:25:04",
    "speaker" : "Dave Brown",
    "text" : "Okay. I I mean I don't normally I would just not copy somebody, but And and not be redundant, but I I don't want to lose sight of how bad T G Barber was in the game. And he deserves to get like a double whammy at least on worst"
  },
  {
    "timestamp" : "01:25:04-01:25:05",
    "speaker" : "Andy",
    "text" : "I would agree with that."
  },
  {
    "speaker" : "Dave Brown",
    "timestamp" : "01:25:05-01:25:57",
    "text" : "Because look, I mean you you set it up perfectly with the clip about how Tiki Barber's out there saying how tough they have to be. And he's the first guy with the ball on the ground. And you know what I mean? In the worst situation, gives a seven, and that is just a complete disaster. He's a sh trying to protect the ball. for the rest of the game and just not playing like himself. And and you know, thankfully Tom Coughlin got him back on track. But, you know, he wasn't even there by by 2007. Like Tiki Barber is one of those guys who like I don't know. Just just a real what it's a real frustrating start to have on your team. And this game went a long way in showing why. Because you can see the guy is super talented, but man There's just some things that happen that it it just drives me nuts as a fan."
  },
  {
    "speaker" : "Andy",
    "text" : "So almost like some parallels to like a Terry Glenn on the Patriots, I would feel. Sure.",
    "timestamp" : "01:25:57-01:26:02"
  },
  {
    "timestamp" : "01:26:03-01:26:07",
    "speaker" : "Dave Brown",
    "text" : "Maybe. I I I wasn't as involved when Glenn was here."
  },
  {
    "timestamp" : "01:26:07-01:26:17",
    "speaker" : "Andy",
    "text" : "So that's He was similar, like super talented, but just a basket case and couldn't keep himself on the field just because he couldn't get out of his own head, basically."
  },
  {
    "timestamp" : "01:26:17-01:26:30",
    "speaker" : "Steve",
    "text" : "So for all of our listeners who are like, who the fuck is Jim Brewer? Like me? Really? Damn, I'm terrible with names. He's the guy from uh Half Baked. The white guy."
  },
  {
    "speaker" : "Andy",
    "text" : "There you go.",
    "timestamp" : "01:26:30-01:26:31"
  },
  {
    "text" : "But my God, the fucking spitting image. Yeah. Him and Kerry Collins had shots. Oh my. They could be introduced.",
    "timestamp" : "01:26:31-01:26:39",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "They're definitely related somehow. Take that 23andMe and figure out how far back that goes because that connects. Imagine it was the same person. He's moonlighting as a as a stoner comic on the on the weekends, the weekdays.",
    "timestamp" : "01:26:40-01:26:57"
  },
  {
    "speaker" : "Steve",
    "text" : "Hanging out with Dej Chappelle on fucking Monday through Friday and then going out and throwing",
    "timestamp" : "01:26:58-01:27:02"
  },
  {
    "text" : "Four picks on fifty-nine passes and four picks. No big deal. So is that your best or worst, Dave? I assume that was your worst, right?",
    "timestamp" : "01:27:02-01:27:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:27:11-01:27:33",
    "speaker" : "Dave Brown",
    "text" : "That's my worst. Tiki Barber worst. So the best Mark Bavaro. Because when you when you talk about Jeremy Shockey, you inevitably talk about the national broadcast, you inevitably talk about Mark Brevaro, because he was like the greatest giant tight end before Shockey. And really still is in the minds of Giants fans. He's a man. Okay."
  },
  {
    "speaker" : "Andy",
    "text" : "And in in the mind of Bill Belichick too, for that matter. Evie loves him.",
    "timestamp" : "01:27:33-01:27:37"
  },
  {
    "text" : "Yes. Yeah. Yes. And the thing about Guevaro is that like he's a real hands in the dirt, like tough guy who's super classy. And they cut to him on the sideline, and he's talking with Sergusa and he's like He's like, hey, you know, I I hear you uh you hang out and you you coach and you you uh you help out. He's like I'm just glad that Belichick is gracious enough to let me do it And I was like, yes, Mark Guevaro, you are awesome.",
    "timestamp" : "01:27:37-01:28:03",
    "speaker" : "Dave Brown"
  },
  {
    "text" : "I'll work anywhere for a free t-shirt. Like, fuck yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:28:07-01:28:10"
  },
  {
    "timestamp" : "01:28:10-01:28:17",
    "speaker" : "Dave Brown",
    "text" : "Yeah. He's like, I'm here for t-shirts and I'm gl and I'm glad that I get the privilege of getting a t-shirt to help these people out."
  },
  {
    "speaker" : "Andy",
    "text" : "That was awesome.",
    "timestamp" : "01:28:18-01:28:18"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "He was a that was a great moment for me. Uh Mark Defar on the sidelines and plus The the Patriots love him too. Who didn't everybody this is the thing. Everybody loves Martin Bavaro. There's nobody's nuts. Like I have a I grew up as uh a fan, uh my one of my best friends growing up Loved Washington. I don't know why he grew up here, probably because of Joe Gibbs era that won three Super Bowl. He had an autographed picture of Mark Bavaro on his wall in his bedroom. Everybody loves Mark Bavaro.",
    "timestamp" : "01:28:18-01:28:44"
  },
  {
    "timestamp" : "01:28:45-01:28:53",
    "speaker" : "Steve",
    "text" : "Just that guy, yeah So here's my point though, Shockey is not that sort of tight end, you know? Because he's so polarizing and I hate Shockey."
  },
  {
    "text" : "So maybe Mark Bavaro is the original Gronk. Yes.",
    "timestamp" : "01:28:53-01:28:56",
    "speaker" : "Andy"
  },
  {
    "text" : "Everybody loves Gronk. No, no, no, no, no, no. You don't think everybody loves Gronk? Everybody loves Gronk. Gronk's like happy. Yeah, that's true. But Gronk's like a happier version of Shockey. And the reason Shockey isn't Kelsey is because he can block.",
    "speaker" : "Dave Brown",
    "timestamp" : "01:28:56-01:29:10"
  },
  {
    "speaker" : "Steve",
    "text" : "Kelsey and Shockey are very similar because like I fucking hate Kelsey too.",
    "timestamp" : "01:29:11-01:29:14"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "Yeah, because he's a yeah, he's a bit of a dude. Shockey is an asset in the run game, the guy can block. Much like rough. I'm just saying, Grunk is terrible at it, but if you start with Shocky and then you want to and then you improve everything Yeah, you make him taller, faster, and stronger.",
    "timestamp" : "01:29:15-01:29:37"
  },
  {
    "text" : "And more like crush more natty lights.",
    "speaker" : "Andy",
    "timestamp" : "01:29:37-01:29:41"
  },
  {
    "text" : "And like remove the douche from him.",
    "speaker" : "Steve",
    "timestamp" : "01:29:41-01:29:44"
  },
  {
    "text" : "Well, I I think there's still there's still a a douche vain and gronk.",
    "speaker" : "Andy",
    "timestamp" : "01:29:44-01:29:48"
  },
  {
    "timestamp" : "01:29:49-01:29:52",
    "speaker" : "Steve",
    "text" : "Yeah, but like the lovable douche part, not the canoe part."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:29:52-01:29:57",
    "text" : "Yeah, he he's more like that asshole golden retriever that's shitting on the rug, but it's still funny, so it's cool."
  },
  {
    "timestamp" : "01:29:57-01:29:57",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:29:57-01:30:01",
    "text" : "Yeah. Yeah. It's just a dog being a dog. What are you gonna be mad at, you know?"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "Listen, Mark Bavar was great. That's the point. Agreed.",
    "timestamp" : "01:30:02-01:30:06"
  },
  {
    "speaker" : "Andy",
    "text" : "It's a great best. I can get behind that. Even I can get behind that. Yeah. All right. Well, I think that wraps it up for uh week six of the 2003 season. Uh oh, don't forget we still have a hotline Steve, you remember the hotline number?",
    "timestamp" : "01:30:06-01:30:26"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:30:26-01:30:33",
    "text" : "Uh 603-505 Troy Brown for three."
  },
  {
    "speaker" : "Andy",
    "text" : "Nice. 505-804-3 Area code 603, baby. So you can text or call that and leave us a voicemail or leave us a text. And if you do that, we may or may not be in the podcast. And they're gonna be like, you have one phone call, Steve. I don't remember any numbers, but I know this number. I know the I know our Dynasty podcast hotline. Oh fuck. If you have any feedback for for me and Steve or for Dave, for any of the Browns really, let us know. And we will uh and we will share it with the appropriate brown. Uh except for Greg because he keeps leaving us. Fuck that guy. But Dave, thank you very much for coming on. This has been great. It's been awesome to have a a giant's perspective. Um and I think you bring it up. Yeah, we'll we'll find you for the first one, but uh I I think the podcast is actually gonna end with the NFC Championship.",
    "timestamp" : "01:30:33-01:31:34"
  },
  {
    "speaker" : "Dave Brown",
    "text" : "I'm excited. I'm excited because I was at both of those games and I'd love to talk about them. So we may have to do it. Either or both, I don't care. But um But don't uh don't lose my number when you get to the right, no promises.",
    "timestamp" : "01:31:36-01:31:51"
  },
  {
    "text" : "If we do get there though, you will be the first to know. Big bet All right. Uh what do we have next week, Steve Brown? I have no idea, dude. Awesome. You never do. I love that about you.",
    "timestamp" : "01:31:51-01:32:02",
    "speaker" : "Andy"
  },
  {
    "text" : "You tell me the guy puts against the Fucking ridiculous shinos. Show notes that nobody reads except one person every guest appearance reads.",
    "timestamp" : "01:32:02-01:32:09",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:32:10-01:32:28",
    "text" : "I'll take it. Uh fu Next week, uh, oh by the way, next week, episode 50. That will be our 50th episode. No shit. So thanks to my brown brothers for actually um not only doing the six that I asked. Uh but also another 40.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "By Brown Brothers, you need me because like Greg's not even on right now.",
    "timestamp" : "01:32:29-01:32:31"
  },
  {
    "timestamp" : "01:32:32-01:32:36",
    "text" : "Yeah. All right. So to you, Steve, a heartfelt thank you for for being here for welcome, man.",
    "speaker" : "Andy"
  },
  {
    "text" : "You did get me a free hat, so I'm in on that.",
    "timestamp" : "01:32:36-01:32:38",
    "speaker" : "Steve"
  },
  {
    "text" : "That's true, yeah. I did.",
    "speaker" : "Andy",
    "timestamp" : "01:32:38-01:32:40"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:32:42-01:32:45",
    "text" : "I'll do anything for a free t-shirt. I'm like Mark Navarro, baby."
  },
  {
    "timestamp" : "01:32:46-01:32:52",
    "text" : "I agree. All right, next week. Uh the patrons travel to Miami. Oh ooh.",
    "speaker" : "Andy"
  },
  {
    "text" : "That's a that's a hard place for us to win, as we know.",
    "speaker" : "Steve",
    "timestamp" : "01:32:52-01:32:54"
  },
  {
    "speaker" : "Andy",
    "text" : "It is. So let's see if this is what happens.",
    "timestamp" : "01:32:54-01:32:57"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:32:58-01:33:02",
    "text" : "Next week on the stomp everybody for like the next whatever. It's the best. I love this."
  },
  {
    "text" : "Thanks for ruining my outro, Steve. I appreciate it. That's awesome. Yeah, we'll show you stepping all over it.",
    "speaker" : "Andy",
    "timestamp" : "01:33:03-01:33:08"
  },
  {
    "text" : "Well, you can listen to more Bickering between the Brown Brothers and a recap of the Patriots Dolphins game next week on the Patriots Dynasty Podcast. See you later. Me later",
    "speaker" : "Dave Brown",
    "timestamp" : "01:33:09-01:33:20"
  }
]