[
  {
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother."
  },
  {
    "text" : "Welcome back to the Pages Dynasty Podcast. We are 2003 week seven in Miami at Miami. A place of Patriots just don't ever win. But this is 2003, and we know they don't lose, so something has to break. With me today, I'm Andy Brown. With me today, my brother Steve and Greg. How you boys doing?",
    "speaker" : "Andy",
    "timestamp" : "00:23-00:46"
  },
  {
    "speaker" : "Greg",
    "text" : "Hola. I'm doing fantastic.",
    "timestamp" : "00:47-00:51"
  },
  {
    "timestamp" : "00:51-00:53",
    "speaker" : "Andy",
    "text" : "Cool. You sound amazing."
  },
  {
    "text" : "Thanks, Andy. You sound like shit.",
    "speaker" : "Greg",
    "timestamp" : "00:54-00:56"
  },
  {
    "timestamp" : "00:57-02:00",
    "speaker" : "Andy",
    "text" : "Cool. So um uh this isn't gonna come out until a little bit later, but we're actually recording this the week after Thanksgiving. And we didn't really we didn't get to like spend any time together this this this year. Um I know you you two boys actually had plans that that fell through because Of all the stuff that's a lot of people. So we all we all spent some time alone, I guess, for Thanksgiving this year. Apart, maybe, is probably a better word. Um, so I was trying to figure out ways of Somebody kind of bring us together in order to you know have a have a Thanksgiving thing of our of our own. uh as a podcast. A podcast thanksgiving. Yeah, so I've been racking my brain trying to figure out the best way to to have Uh Thanksgiving delivered to you. So that's what's happening right now is you should be getting Thanksgiving delivered to you specifically."
  },
  {
    "text" : "What is things giving mean to you?",
    "timestamp" : "02:01-02:03",
    "speaker" : "Steve"
  },
  {
    "text" : "I don't see anything.",
    "speaker" : "Greg",
    "timestamp" : "02:03-02:05"
  },
  {
    "timestamp" : "02:05-02:15",
    "speaker" : "Steve",
    "text" : "I have I got Lauren standing right at right so i yeah so in in true Kelly fashion she wait you thought Kelly was gonna walk through that door, Andy?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I was stalling for as long as I could.",
    "timestamp" : "02:15-02:17"
  },
  {
    "speaker" : "Steve",
    "text" : "I was like, why line it? Yeah. So that's my Thanksgiving.",
    "timestamp" : "02:19-02:22"
  },
  {
    "speaker" : "Andy",
    "text" : "So the timer, yeah, so so you you can uh take it but don't don't open it quite. We'll we'll wait for Greg to get his. Um so I was trying to figure out a way to deliver Thanksgiving dinner to you. What a guy. It was it was hard to do. But I did figure something out. How are you organizing this?",
    "timestamp" : "02:23-02:44"
  },
  {
    "speaker" : "Greg",
    "text" : "Because I think Kelly's on the phone.",
    "timestamp" : "02:44-02:46"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:47-02:52",
    "text" : "Yeah, you Well, then he just texts you and say, go give this a seed. Yes."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:53-02:56",
    "text" : "That's exactly what happened. Go downstairs and just get it from the pillar."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "02:58-03:01",
    "text" : "This is some sort of surprise or something?"
  },
  {
    "text" : "Yes. Where's Lauren? She's she's there too. She's right there.",
    "timestamp" : "03:01-03:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I already got it.",
    "timestamp" : "03:07-03:08"
  },
  {
    "timestamp" : "03:09-03:32",
    "text" : "So So happy Thanksgiving boys. So because this is an audio, yeah, an audio medium, what I have hit had delivered is Brock's turkey dinner candy corn. It is candy corn with the flavors of from the bag, and I quote, green beans, roasted turkey, cranberry sauce, ginger-glazed carrot, sweet potato pie, and stuffing",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "03:33-03:37",
    "speaker" : "Steve",
    "text" : "Andy, this is actually perfect. It's a week after Thanksgiving officially, right?"
  },
  {
    "timestamp" : "03:39-03:40",
    "text" : "Exactly, because it's Thursday.",
    "speaker" : "Andy"
  },
  {
    "text" : "I was just telling Arn that I've had turkey for every single meal except for two.",
    "timestamp" : "03:40-03:43",
    "speaker" : "Steve"
  },
  {
    "text" : "Except for two.",
    "speaker" : "Andy",
    "timestamp" : "03:45-03:46"
  },
  {
    "text" : "Yeah, I had like I had a steak dinner one night and some teriyaki chicken and every other meal since then has been turkey sandwiches, turkey soup, turkey wraps.",
    "speaker" : "Steve",
    "timestamp" : "03:46-03:56"
  },
  {
    "speaker" : "Andy",
    "text" : "So this is turkey candy corn and these are there's seems to be three distinct colors. I sure tastes like turkey. So okay, so there's like a brownish one. So I'm gonna try to smell so gross.",
    "timestamp" : "03:57-04:14"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "04:14-04:16",
    "text" : "The brown one's the turkey."
  },
  {
    "text" : "First ingredient is sugar. That's a good sign.",
    "timestamp" : "04:18-04:21",
    "speaker" : "Greg"
  },
  {
    "text" : "Yep, the brown one's definitely darker. Corn syrup, which is also sugar. I think it I think it's turkey and maybe gravy. There's a brown one.",
    "speaker" : "Andy",
    "timestamp" : "04:21-04:28"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "04:29-04:32",
    "text" : "What if I don't really love green beans? Do I still eat it?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:32-04:34",
    "text" : "Yeah, uh you gotta try each one of them."
  },
  {
    "timestamp" : "04:35-04:38",
    "speaker" : "Steve",
    "text" : "There's sweet potato pie. One might be sweet potato pie."
  },
  {
    "timestamp" : "04:38-04:39",
    "speaker" : "Andy",
    "text" : "The white ones gross."
  },
  {
    "speaker" : "Greg",
    "text" : "The turkey's gross.",
    "timestamp" : "04:40-04:41"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "04:44-04:54",
    "text" : "Whoa. Oh. Horrendous. Oh, the green beans gross like sugary Green beans, but ugh."
  },
  {
    "timestamp" : "04:56-04:58",
    "text" : "Holy shit. That green one's terrible.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Who thought this was a good idea?",
    "timestamp" : "04:59-05:01"
  },
  {
    "speaker" : "Andy",
    "text" : "You can actually legitimately buy these at Walgreens.",
    "timestamp" : "05:01-05:04"
  },
  {
    "text" : "You know what might be okay? The cranberry. Let's try cranberry that goes like sweet crazy. Cranberry's decent.",
    "speaker" : "Steve",
    "timestamp" : "05:04-05:08"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. I had the cranberry, not bad.",
    "timestamp" : "05:08-05:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:11-05:13",
    "text" : "Oh yeah, I eat the cranberry one again."
  },
  {
    "timestamp" : "05:14-05:23",
    "text" : "All right now cranberry is used Yeah I'll use second cranberry one which is brown and white and brown and like black or gray",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "The the the darker one I think is uh gravy. In here?",
    "timestamp" : "05:24-05:27"
  },
  {
    "speaker" : "Greg",
    "text" : "It you know what they definitely did is maybe stuffings They took the ones from Halloween that didn't sell, reprocessed them, threw in some disgusting flavors and then repackaged them.",
    "timestamp" : "05:28-05:39"
  },
  {
    "text" : "That is true. Yeah, they just bought the candy corn back from CBS. Melted it.",
    "timestamp" : "05:39-05:44",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, the dark one the dark one's supposed to be stuffing. Ugh. Why do I keep eating it? I'll try stopping too.",
    "speaker" : "Andy",
    "timestamp" : "05:44-05:51"
  },
  {
    "text" : "Oh stopping's Wait, wait, wait, wait. Wait. What about eat a turkey too? Tricky and stopping because I don't think regular stuffing on its own is disgusting. That's really I don't eat there and sit there and eat stuffing",
    "speaker" : "Steve",
    "timestamp" : "05:52-06:06"
  },
  {
    "timestamp" : "06:07-06:12",
    "text" : "I used to do that when I was a kid. I used to just make the stuffing, the stovetop, and just eat it by itself.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "06:13-06:31",
    "speaker" : "Steve",
    "text" : "That was why Thanksgiving apart from you fools is the best because I got a 15 pound turkey and I ate the whole fucking thing for a week. As many turkey sandwiches as I want. None of that Greg's been in here and half the fucking turkey's gone. Turkey soup? As much turkey soup as I want. And I put a ton of turkey in it, so it's like extra turkey, turkey soup. Oh, it's so good."
  },
  {
    "timestamp" : "06:31-06:34",
    "speaker" : "Greg",
    "text" : "Turkey soup's gross. It's just a waste of turkey."
  },
  {
    "timestamp" : "06:34-06:40",
    "speaker" : "Steve",
    "text" : "No way. That's what I always thought, but I had so much turkey. I would rather a turkey sandwich than a turkey soup. But the turkey soup, excellent."
  },
  {
    "text" : "What about turkey?",
    "speaker" : "Greg",
    "timestamp" : "06:40-06:41"
  },
  {
    "speaker" : "Andy",
    "text" : "And then you can just throw it on toast or something or in the sandwich.",
    "timestamp" : "06:47-06:50"
  },
  {
    "text" : "The turkey sandwiches are the best.",
    "speaker" : "Steve",
    "timestamp" : "06:51-06:53"
  },
  {
    "speaker" : "Greg",
    "text" : "Steve, tell me the truth. Did you have sex with your turkey? No, no.",
    "timestamp" : "06:53-06:58"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:58-07:04",
    "text" : "I mean obviously the thought crosses your mind every time you un unwrap a turkey, you'd be like, you can definitely sit your fit your dick in that."
  },
  {
    "text" : "You d you definitely slap it though, right?",
    "timestamp" : "07:04-07:05",
    "speaker" : "Andy"
  },
  {
    "text" : "Like you slap it. Well, yeah. Yeah, we should have asked is whether you had did he make love to it or did he fuck it? Because I mean we knew he had sex with it.",
    "speaker" : "Greg",
    "timestamp" : "07:05-07:15"
  },
  {
    "speaker" : "Steve",
    "text" : "I can't I can't be anyway as candy coins. They fucking rose. Yeah, they're pretty bad.",
    "timestamp" : "07:16-07:20"
  },
  {
    "speaker" : "Andy",
    "text" : "So happy Thanksgiving boys. I'm glad we got to share a meal together.",
    "timestamp" : "07:21-07:24"
  },
  {
    "text" : "Thanks, Andy.",
    "speaker" : "Steve",
    "timestamp" : "07:24-07:25"
  },
  {
    "timestamp" : "07:25-07:26",
    "speaker" : "Andy",
    "text" : "Yeah, delish."
  },
  {
    "speaker" : "Steve",
    "text" : "I I'm not gonna lie, Andy, I thought you were gonna do some sort of Special episode thing, right? Isn't this a a big episode for us?",
    "timestamp" : "07:27-07:34"
  },
  {
    "timestamp" : "07:34-07:37",
    "speaker" : "Andy",
    "text" : "Oh, I suppose it is. Yeah, I think this is episode fifty"
  },
  {
    "speaker" : "Steve",
    "text" : "Well I'm glad one of us is paying attention.",
    "timestamp" : "07:38-07:40"
  },
  {
    "text" : "Yeah. Well I was too excited about the candy corn and I thought about that when I was putting together the the show notes, you know.",
    "timestamp" : "07:40-07:46",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:46-07:50",
    "speaker" : "Steve",
    "text" : "I was you know I was like wow this is my fiftieth show notes I've put together"
  },
  {
    "speaker" : "Andy",
    "text" : "Were they any better than the rest of them?",
    "timestamp" : "07:50-07:51"
  },
  {
    "timestamp" : "07:53-07:57",
    "speaker" : "Steve",
    "text" : "My show notes are always well researched and thorough, Andy. You know that more than anybody."
  },
  {
    "timestamp" : "07:57-08:00",
    "speaker" : "Andy",
    "text" : "There show notes. Craig's got a page."
  },
  {
    "speaker" : "Greg",
    "text" : "Ooh, back and front. Yeah.",
    "timestamp" : "08:01-08:03"
  },
  {
    "timestamp" : "08:04-08:05",
    "text" : "Handwritten still?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I like I like handwriting it better.",
    "timestamp" : "08:05-08:08"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:09-08:10",
    "text" : "I got a big old Google Doc."
  },
  {
    "speaker" : "Andy",
    "text" : "Did you did you miss my Johnny Damon the back and front? Joke. Remember that Johnny Damon hurt himself talking about like his his hip or something. He's like, it's the back and the front. I don't remember that. I think it was Johnny Damon. All right. So let's talk about some football. I thought uh what we could add into these since people might just be dropping in for certain games, especially a game like this when it's kind of one of the the more famous ones, one of the popular ones. is we could kind of give a seasoned snapshot of where things are right now with the Patriots. It's a good a good call. Just to give some context to like what we're about to talk about. So the 2003 Patriots right now are what are they? They are four and two, which I think surprised a lot of people at this point in the season because They started off 0-1 by getting their their doors kicked in by the Buffalo Bills in Buffalo 31-0. Uh people listening to this probably remember that game because Brady threw an interception to who was it? The fat man. Sam Adams. Was it Sam Adams? Yeah, because I was like, damn, that's the name of our beer. I also wanted to drink during watching that game. But then the Patriots rebounded by beating the Eagles and the Jets. But during all of this, they started losing players at quite the clip, especially on defense. And that we'll actually probably get into that dirt for this game, but like everybody's been injured.",
    "timestamp" : "08:11-09:46"
  },
  {
    "text" : "But like the defense was playing well and the offense was awful. The offense doesn't look good for a while. That Giants game right before this especially was bad. Yeah.",
    "timestamp" : "09:47-09:55",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "09:56-10:41",
    "speaker" : "Andy",
    "text" : "So they beat the passes. Exactly. They be the Eagles and the Jets. Then they lost to the Redskins. And for those who know about this time frame, that would be their last loss for the rest of the season. And halfway through the next season, well, they're going their regular setting win streak. Spoiler art indeed. Uh and so after losing the Redskins, they beat the Titans, who actually were a good team at this point, but I think we're also struggling with injuries. And the Giants last week in a horrendously sloppy game that they may not have deserved to win, but they won anyway. Uh and so now we are headed to Miami where the Patriots are all-time 0-13 in Miami in September and October."
  },
  {
    "speaker" : "Steve",
    "text" : "That's gotta be that stadium, right? Not like all Because they've been playing since like the 60s or something, right? Like a long time.",
    "timestamp" : "10:41-10:48"
  },
  {
    "speaker" : "Andy",
    "text" : "That means 13 seasons before this, so it give or take.",
    "timestamp" : "10:49-10:53"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "10:53-10:56",
    "text" : "Really? So they'd never ever ever won in Miami before"
  },
  {
    "timestamp" : "10:57-10:58",
    "speaker" : "Andy",
    "text" : "In September on October."
  },
  {
    "timestamp" : "10:59-11:00",
    "speaker" : "Steve",
    "text" : "Oh right. Duh."
  },
  {
    "speaker" : "Andy",
    "text" : "So yeah, so it's yeah, it probably is all time because No, because they could have won it. If they have a late if they have a late season game, that doesn't count. So um but they they uh well I guess but they were talking about how the Miami like the heat and the humidity is harder to deal with for northern teams later in the season because they're used to the cold at that point.",
    "timestamp" : "11:00-11:20"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but let's be real. I mean that's what is in their heads like the Bills, it's in the Bills heads they can't win at Foxboro.",
    "timestamp" : "11:20-11:25"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "11:25-11:32",
    "text" : "Yeah, right. I think that's I think it's a load of shit. What is the heat and humidity thing?"
  },
  {
    "text" : "Like it can be like a psychological thing too. Like Yeah, I think it's psychological. I mean like the cur the curse of the bambino is the same shit, you know? Yeah.",
    "speaker" : "Steve",
    "timestamp" : "11:32-11:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "11:41-11:46",
    "text" : "It might be a bit of all of it as well. I mean playing in the heat probably isn't a great thing to do."
  },
  {
    "text" : "And the Dolphins would always wear white, forcing the Patriots to wear those dark, dark blues.",
    "speaker" : "Steve",
    "timestamp" : "11:46-11:50"
  },
  {
    "timestamp" : "11:50-12:10",
    "speaker" : "Andy",
    "text" : "Yeah, and the dolphin sideline is in the shade, whereas the visiting sideline is not. It's in the sun. So, you know, mind games. And didn't last oh To the last season, Belichick covered the AC events so that it wouldn't get super cold at halftime. So lots of things going on."
  },
  {
    "speaker" : "Greg",
    "text" : "Best coach ever. Genius.",
    "timestamp" : "12:10-12:14"
  },
  {
    "timestamp" : "12:14-12:22",
    "speaker" : "Steve",
    "text" : "Dave Wands that blast in the AC. I don't know if I agree with that, Greg. Best mustache ever, maybe."
  },
  {
    "timestamp" : "12:22-12:56",
    "speaker" : "Andy",
    "text" : "You know what? You say what you will, Greg, but uh we will get to a point in this where I will bring up the genius of Bill Ballard check. But just to kind of set the the the the scene for this game, the Patriots have so few linebackers left that they are now playing a 4-3 instead of a 3-4 because they have more healthy defensive linemen than they do healthy linebackers. So they can really only field three healthy linebackers, so they're playing a 4-3 now. They've just switched halfway through the season."
  },
  {
    "speaker" : "Steve",
    "text" : "I'm interested to see what they play the rest of the year when they get people healthy back too.",
    "timestamp" : "12:56-13:00"
  },
  {
    "text" : "Yeah, we'll have to keep an eye on that, I think. Um but going back to those injuries, like Everybody's out. Uh Colvin has been lost for the season with a broken hip, I think we talked about.",
    "speaker" : "Andy",
    "timestamp" : "13:00-13:10"
  },
  {
    "timestamp" : "13:11-13:11",
    "text" : "Yeah, something like that.",
    "speaker" : "Steve"
  },
  {
    "text" : "Ted Johnson's down, Vrabel's down. Uh so they're starting Matt Chatham at linebacker along with Bruski, who's been in and out. Yeah. Mitt McGuinness is out on the defensive line with Ted Washington as well, who they brought into stuff the middle.",
    "timestamp" : "13:11-13:26",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "13:26-13:28",
    "text" : "Who broke his leg or something like that?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And then Gerard Cherry and Ty Law are also out for this game. Ty Law was a last minute scratch. He tried to give it a go and it wasn't happening. But he's been dealing with an ankle injury like Since what, week two or three? It's a Jets game, I think.",
    "timestamp" : "13:28-13:42"
  },
  {
    "speaker" : "Steve",
    "text" : "It was a Jets game, yeah. I got like rolled up on.",
    "timestamp" : "13:42-13:44"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:44-13:58",
    "text" : "Um, and they have two, well, I guess we can call it generously two healthy running backs. Kevin Falk and um Mike Cloud. The one-hit wonder Mike Cloud."
  },
  {
    "text" : "Even add all that, they cut Lori Malloy in week one too, so it's like they're down to starting safety that. Yep. And that's under release. Yeah, trading camp and stuff, you know.",
    "speaker" : "Steve",
    "timestamp" : "13:58-14:06"
  },
  {
    "timestamp" : "14:07-14:21",
    "speaker" : "Andy",
    "text" : "And Antoine Smith is hurt, uh, even though he wasn't looking great when he wasn't. And they cut Larry Senners, who we decided a few weeks ago was the all-time leading fullback uh in receiving yards."
  },
  {
    "speaker" : "Steve",
    "text" : "I also saw him make a dirty play though, which made me not like Larry Center, so I was glad they cut him. I don't know why they cut him though. Dirty dirty? Yeah, he had like a a way late shot. It was like away from the play. It was pretty dirty. They called him a personal foul on it.",
    "timestamp" : "14:21-14:34"
  },
  {
    "timestamp" : "14:34-14:36",
    "speaker" : "Andy",
    "text" : "That sounds familiar, yeah. Like last"
  },
  {
    "speaker" : "Steve",
    "text" : "Wait, a running back or fullback is catching a ton of passes? How is that a thing?",
    "timestamp" : "14:38-14:41"
  },
  {
    "timestamp" : "14:42-15:21",
    "speaker" : "Andy",
    "text" : "Right, right. So not only do we have a Matt Chatham sighting in this game, uh Greg, I think you'll be happy to know, and also Kelly will be happy to know, you'll have to tell her, um, that there was also a Tully Bantacane sighting. Yeah, see that. He's a rookie this year, right? Yeah, I think so. That's how I think he might have been on the practice squad they were talking about. Yeah, they said legit depth game But yeah, they they were actually the commentators were TBC. That's right. Commentators talking about how the Patriots are starting three rookies on defense, which you just don't see"
  },
  {
    "timestamp" : "15:21-15:29",
    "text" : "Fun fact, they filled uh Larry Senners' spot with Tully Bandicane. So they waived Larry Senners and promoted PBC.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "15:29-15:37",
    "speaker" : "Andy",
    "text" : "Oh, there you go. It doesn't say why. Uh they probably just needed the the linebacker."
  },
  {
    "timestamp" : "15:38-15:45",
    "speaker" : "Greg",
    "text" : "And Ellie Bannekane, he's a grand seventh rounder. Yeah, a grand total of one tackle this year."
  },
  {
    "speaker" : "Andy",
    "text" : "Nice. In this game? I think it may have been.",
    "timestamp" : "15:45-15:49"
  },
  {
    "speaker" : "Greg",
    "text" : "Nope. This year.",
    "timestamp" : "15:49-15:50"
  },
  {
    "speaker" : "Andy",
    "text" : "But was that tackle in this game?",
    "timestamp" : "15:51-15:53"
  },
  {
    "text" : "Next year. I don't know. Next year, uh grand total of two tackles. And then in 2006?",
    "timestamp" : "15:53-16:01",
    "speaker" : "Greg"
  },
  {
    "text" : "No, not 2006. 2009. He was good at some point. He had a bunch of sacks one year. Yeah, one year he led the team in sacks. Yeah.",
    "timestamp" : "16:02-16:10",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "16:12-16:18",
    "speaker" : "Greg",
    "text" : "And then uh but Oh, I'm looking at I'm looking at the wrong statue. He had 11 tackles this year. Yeah. Okay"
  },
  {
    "text" : "More notable seventh rounder from this.",
    "timestamp" : "16:19-16:20",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "16:21-16:22",
    "text" : "How does it get the playoff stats?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Is uh David Gibbons, my boy.",
    "timestamp" : "16:23-16:26"
  },
  {
    "timestamp" : "16:27-16:43",
    "speaker" : "Andy",
    "text" : "Yes. Who will start to come on in this game? Um to the point where he was returning kicks in the second half. Oh, we'll get there. But we will. All right, so kick it off for me, Steve Brown. How did this game uh how did this game start? Actually, before we do that, do we want to give it our watchability?"
  },
  {
    "text" : "Six and a half point dogs. Patriots are?",
    "timestamp" : "16:44-16:46",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "16:46-17:03",
    "text" : "Yeah, they were six and a half point. Yeah, that makes sense. They've never won in Miami this early in the year. And the Dolphins are four and one coming into this. They lost their first game, and this defense was smothering. on the the dolphin side. They hadn't allowed more than 10 points since that week one loss to Houston.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. And Houston was like a expansion franchise or A couple years in the league at that point, right? Yeah, yeah. It was it was a big surprise that they lost to Houston.",
    "timestamp" : "17:03-17:12"
  },
  {
    "timestamp" : "17:12-17:12",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Like the Texans were really those of David Carr. They couldn't protect him years. So the fact they lost to them. When they had like highly touted was big. Yeah. And they went on absolute tear, especially the defense. I get the dog. I get the line. Might even this might even be a little low. Seven and a half.",
    "timestamp" : "17:12-17:28"
  },
  {
    "timestamp" : "17:29-17:37",
    "text" : "So yeah, but and so and you know, like you say, the Pages had not been playing well. Uh Ricky Williams had run all over this team in the past.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, that game last year that they should have won and didn't.",
    "timestamp" : "17:37-17:40",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "17:40-17:58",
    "speaker" : "Andy",
    "text" : "Yeah, and there was some stat that they showed that I didn't get a screen grab of, but it was something like Ricky Williams against like non-AFCE's teams ran for like 93 yards per game. And against AFC East teams, he ran for like 137. He averaged 137 yards a game."
  },
  {
    "text" : "Yeah, it is may touch down feelings AFC East as he did against the rest of the league or some shit like that.",
    "speaker" : "Steve",
    "timestamp" : "17:58-18:02"
  },
  {
    "text" : "Yeah, it was ridiculous. So he just loves playing against",
    "timestamp" : "18:03-18:06",
    "speaker" : "Andy"
  },
  {
    "text" : "So this this game that you had on uh on the PatriotsDynasty. info website was different than all the other ones we'd watched in two very, very meaningful ways.",
    "speaker" : "Steve",
    "timestamp" : "18:06-18:17"
  },
  {
    "timestamp" : "18:17-18:20",
    "speaker" : "Andy",
    "text" : "Okay. I know what one of them is. I don't know what the other one is."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. First one is this is the first one we've watched where whoever taped it included the commercials. Right. Well fifty no, it hasn't been fifty games, but it's been close to that. All of them have been like cut out the commercial breaks, and you just, you know, so when we watched them there two and a half hours or so, and this one was a full four. But also had commercials from 2003 which were somewhat ironically funny and sometimes actually funny.",
    "timestamp" : "18:20-18:47"
  },
  {
    "timestamp" : "18:47-18:50",
    "speaker" : "Andy",
    "text" : "Some of them were great. Do you wanna do you wanna just jump into that now?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, let's let's touch on there and I'll save my my other one that blew my mind later.",
    "timestamp" : "18:51-18:55"
  },
  {
    "text" : "All right.",
    "timestamp" : "18:55-18:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:56-19:09",
    "speaker" : "Steve",
    "text" : "So I'm in marketing and uh I've always enjoyed like video production. I actually took video in high school if you remember. And the reason I did it, I feel like I said this on the podcast before is I saw a Bud Light commercial that I thought was hilarious and said I could do that too."
  },
  {
    "text" : "What was the commercial? Do you remember?",
    "timestamp" : "19:09-19:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "19:11-19:35",
    "speaker" : "Steve",
    "text" : "Yeah, oh yeah. It was a uh dude standing on a balcony. And he's like, watch this. And he's like, he makes a bird call, and this fucking hop flies in with two beers and gives them to him. And the lady girl next to him is like, wow, it's amazing. He's like, where'd you get him? He's like, you know? Never really thought of that. And then there's like a cutscene cutscene of like a hawk dive bombing a sideway cafe with like people hiding under tables and like he's back."
  },
  {
    "text" : "That's pretty good. I actually wrote down that like this uh back in 2003 was where beer commercials still used to be funny. Like that.",
    "timestamp" : "19:36-19:45",
    "speaker" : "Andy"
  },
  {
    "text" : "Yes. And there was another Bud Light one in this one. Yeah. Where the dude's standing on a shoreline with a girl and he chugs a Bud Light and he Writes a message in the bottle. He's like, yeah, I've I put a bunch of messages in the bottle and every time I drink a bulite, see who's out there.",
    "timestamp" : "19:45-19:58",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "19:59-20:02",
    "speaker" : "Andy",
    "text" : "Yeah, I just put my name and address in it and just see if uh see if they ever come back."
  },
  {
    "text" : "And then it cutscenes to a guy on like a deserted island and being like another one. He's got like a whole pile of mud lights. He's like, fuck you, Brad.",
    "speaker" : "Steve",
    "timestamp" : "20:03-20:11"
  },
  {
    "text" : "From 123 Gordon Way. It's awesome. Oh man. Yeah, but like that was of the uh yeah, prime funny like Budweiser and Bud Light and Miller Light. Why aren't they funny anymore?",
    "speaker" : "Andy",
    "timestamp" : "20:12-20:28"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "20:28-20:29",
    "text" : "It's a good question."
  },
  {
    "timestamp" : "20:30-20:32",
    "speaker" : "Greg",
    "text" : "I don't know. You're in marketing, Steve."
  },
  {
    "timestamp" : "20:32-20:35",
    "speaker" : "Steve",
    "text" : "Deg you need to hire me, I guess. I'll make them funny."
  },
  {
    "text" : "They don't even they're not trying to be funny anymore, though. Feels like.",
    "speaker" : "Greg",
    "timestamp" : "20:35-20:38"
  },
  {
    "timestamp" : "20:39-20:51",
    "text" : "No, it's stupid. They should be do like the they should hire you like far side funny is the perfect bud why or bud beer commercial whole humor, you know? They one panel takes a quick joke and then move it on.",
    "speaker" : "Steve"
  },
  {
    "text" : "They're all like socially active commercials now, which are the fucking worst.",
    "speaker" : "Greg",
    "timestamp" : "20:51-20:57"
  },
  {
    "speaker" : "Steve",
    "text" : "You don't like that, Greg? How surprising.",
    "timestamp" : "20:57-20:59"
  },
  {
    "text" : "Oh my god. There's nothing that makes me more ad mad than a corporate company. Trying to fake be like social and moral to me. Like, yeah.",
    "speaker" : "Greg",
    "timestamp" : "20:59-21:10"
  },
  {
    "speaker" : "Steve",
    "text" : "What about the Nanny State FDA? Does that get you more mad than that, Greg?",
    "timestamp" : "21:11-21:14"
  },
  {
    "text" : "Yeah, they're pretty horrendous too. Dude, they f They demanded that they come into our facility and do an in-person audit when you could just do it virtually. When they're supposed to be protecting public safety and they make us all gather in this one tiny room so they can do their fucking bullshit on it. Such bullshit.",
    "timestamp" : "21:15-21:35",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "21:35-21:40",
    "text" : "Well think about it. The beer commercials are all doing those bullshit corporate pandering things because the FDA is making them."
  },
  {
    "timestamp" : "21:40-21:46",
    "speaker" : "Greg",
    "text" : "Yeah. Remember remember the football the office linebacker?"
  },
  {
    "text" : "Yes, Terry Terry.",
    "timestamp" : "21:47-21:48",
    "speaker" : "Steve"
  },
  {
    "text" : "Watch those again.",
    "speaker" : "Greg",
    "timestamp" : "21:48-21:50"
  },
  {
    "text" : "Oh, they're ridiculous. I've seen them not too much.",
    "speaker" : "Steve",
    "timestamp" : "21:50-21:51"
  },
  {
    "speaker" : "Greg",
    "text" : "They're wicked, wicked funny.",
    "timestamp" : "21:51-21:53"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "21:53-21:54",
    "text" : "Oh yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "There was one that was like for the PJ tour as well where uh there was two golfers in a in an elevator and one hit like the the button for 70 and the other one hits one for 69 and the next so the other guy the first guy goes back and hits 68 and there's like keep going down",
    "timestamp" : "21:54-22:09"
  },
  {
    "timestamp" : "22:09-22:26",
    "speaker" : "Steve",
    "text" : "I couldn't identify those golfers though. I I mean they must have been active golfers at the time, but I don't know who they were. I couldn't tell you. There was a uh an NBA NBA Live 2004. Yeah. Oh, there was some great technology. What the cover that was? It kind of blew me for a loop. Starberry."
  },
  {
    "timestamp" : "22:27-22:49",
    "speaker" : "Andy",
    "text" : "Yeah. Fal Marbury. Love it. Yeah. There was uh there was a lot of tech. There was um apparently texting images was cutting-edge technology in 2003. They had a lot of commercial about like, oh, you look, you're there when because you can text a picture to somebody. Um and this was also the heyday of the Nextel walkie-talkies, which I fucking hated."
  },
  {
    "timestamp" : "22:49-23:13",
    "text" : "Dude, I love those. Why are those why are those not that? Oh why are those? Those need to come back. The Next Cell Direct Connect. Beep beep. I hate that. What? You want them to come back? That's how business gets done, dude. It's not. Fuck I make a phone. So many trashy conversations. Oh yeah. Fuck that.",
    "speaker" : "Steve"
  },
  {
    "text" : "And that OGPS was uh I think brand spanking new. Definitely a lot of car cards. Featuring the new Honda Cord. in 2003 and it was like they were teaching people how to use it.",
    "timestamp" : "23:14-23:25",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "23:25-23:39",
    "speaker" : "Steve",
    "text" : "The AOL 9. 0 browser. I think it was a browser. AL 9. 0 optimized. Yeah. And it was like What does that even mean? What was AOL? I had this question. I think it's a it's a I think it's a browser, right? Kind of, yeah, kind of."
  },
  {
    "text" : "It was like a browser, but it was a gateway. It's like the internet. So like you just would never leave the like the AOL interface, like your mail was there and everything. And like Yeah. So instead of going to web pages, like the web pages would come to AOL and you could go like the AOL keyword NFL schedule and and view it there. It's like a browser.",
    "speaker" : "Andy",
    "timestamp" : "23:39-23:59"
  },
  {
    "speaker" : "Steve",
    "text" : "Sanitized version. It's crazy that that shit's gone. Ben gone. I also saw a baseball one. We got obvious sport. Football, baseball, basketball, Raphael Palmero pushing Viagra on TV commercial.",
    "timestamp" : "24:00-24:14"
  },
  {
    "timestamp" : "24:14-24:15",
    "text" : "The blue diamond, baby.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "He's like, I make a lot of plays on the diamond.",
    "timestamp" : "24:16-24:19"
  },
  {
    "timestamp" : "24:21-24:39",
    "speaker" : "Andy",
    "text" : "The one that I thought fell the flattest was the What Would Jared do commercials. Oh. From Subway. It's like, well, I'll tell you what he would do, what he probably was doing at this point. You're not gonna lie. It's not something you want to be putting your uh name behind. That's tough."
  },
  {
    "timestamp" : "24:39-24:49",
    "text" : "What did he do? He got accused and convicted of some sort of child pornography or exposure or molestation. I don't know exactly what the charges were.",
    "speaker" : "Steve"
  },
  {
    "text" : "Something with a kid. Not great. Andy, can you go into a little bit more explicit detail? No, but I will give you a question.",
    "timestamp" : "24:50-24:57",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:00-25:06",
    "text" : "If you would like to Google it on your work computer, feel free. Or do actually Google it on Kelly's work computers. Probably better idea. Yeah."
  },
  {
    "text" : "I have the I have the best one where it was actually a combo.",
    "speaker" : "Steve",
    "timestamp" : "25:07-25:10"
  },
  {
    "speaker" : "Andy",
    "text" : "All right.",
    "timestamp" : "25:10-25:11"
  },
  {
    "text" : "So there was an ad where it was, I thought it was a pretty good ad where it was like cars driving around and stuff. with like all the body panels removed so you can see like all the structure inside it and it's like you know be safe and look cool like there's no windscreen and everything so everyone's hair is blowing the air I was like you know that's a cool ad commercial and then like make it safe then I said make it beautiful And it was those Saturns from like the original Saturns that are like super boxy and just the Saturn ion. Yeah. Yeah.",
    "timestamp" : "25:12-25:38",
    "speaker" : "Steve"
  },
  {
    "text" : "Fuck.",
    "speaker" : "Andy",
    "timestamp" : "25:39-25:39"
  },
  {
    "speaker" : "Steve",
    "text" : "And then there's another commercial for the all-new Acura TL. And this body style TL was awesome. It was like the best car ever. And it still looks good even to this day. And then actor comes along and is like, look at this sweet car that lasted the test of time. The car still looks good.",
    "timestamp" : "25:40-25:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Um all right. Well, speaking of Making it beautiful. I wouldn't say this first half would- Did you tell the score? We have not told the score. Would you like to tell it, Greg?",
    "timestamp" : "26:00-26:13"
  },
  {
    "speaker" : "Greg",
    "text" : "This is an overtime victory by a score of 19 to 13. Sure, give them the the the play they'll remember. Yeah, uh uh if you're listening to this and you came for just as well you are. If you're listening, you remember this game. It's the the 80 yard bomb to troy brown in overtime walk off yeah like everybody remembers that play you're did you know",
    "timestamp" : "26:14-26:40"
  },
  {
    "speaker" : "Andy",
    "text" : "This is Tom Brady's only ever playoff touchdown. Or playoff touchdown uh overtime touchdown. I did not know.",
    "timestamp" : "26:40-26:48"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:48-27:19",
    "text" : "I actually have a quiz on this. This is one of my notes. So as far as I could tell, this is his fourth longest touchdown pass. The other three, um, I'll give you clues. For the other three. Well, you'll you'll know the first one, right? I know, yeah, the 99-yard touchdown of Welker. Okay. So number three, um How should I do this one? It was a Thanksgiving Day touchdown."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, I know what it is. It was uh a wheel route to",
    "timestamp" : "27:20-27:23"
  },
  {
    "timestamp" : "27:24-27:25",
    "speaker" : "Greg",
    "text" : "Yeah chamberine."
  },
  {
    "text" : "Chamberine.",
    "speaker" : "Andy",
    "timestamp" : "27:25-27:26"
  },
  {
    "text" : "80 83 yard touchdown that kicked off that the butt fumble.",
    "speaker" : "Greg",
    "timestamp" : "27:27-27:31"
  },
  {
    "text" : "The butt fumble was the play after, and then the fumble recovery by Edelman was the play after that. That was uh one of the two times the Patriots ever scored three touchdowns in under a minute of game time.",
    "speaker" : "Andy",
    "timestamp" : "27:31-27:44"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "27:44-27:45",
    "text" : "Yes."
  },
  {
    "speaker" : "Steve",
    "text" : "Can't wait to do that. game.",
    "timestamp" : "27:45-27:47"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "27:47-27:49",
    "text" : "83 yards. I didn't realize that one was that long."
  },
  {
    "timestamp" : "27:49-27:49",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "text" : "Um the second one we have covered it on this podcast. It's from 2001. And my other clue I'll give you is it was in a dome.",
    "timestamp" : "27:50-28:00",
    "speaker" : "Greg"
  },
  {
    "text" : "It's Colts game.",
    "timestamp" : "28:00-28:01",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, the Pat the Patton game. Patton, 91 yards, and Pat. That was Patton's throw, catch, run game, right? Exactly.",
    "speaker" : "Greg",
    "timestamp" : "28:01-28:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. Sure was.",
    "timestamp" : "28:09-28:10"
  },
  {
    "speaker" : "Greg",
    "text" : "And then number one obviously was ninety-nine yards in two thousand eleven to Welker.",
    "timestamp" : "28:11-28:16"
  },
  {
    "text" : "You know where you can find all these? Neatly organized.",
    "timestamp" : "28:17-28:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Where Andy?",
    "timestamp" : "28:21-28:22"
  },
  {
    "speaker" : "Andy",
    "text" : "PatriotsDynasty. info slash Tom Brady touchdown passes.",
    "timestamp" : "28:23-28:28"
  },
  {
    "text" : "Or or yeah, that's a good place to go. If you want an alternative viewing method, don't you're gonna beep this out, aren't you? What I found was when Brady turned 40, they did uh his 40 longest touchdown passes. This was in 2017, which is just crazy in itself that that was three years ago he turned 40. And they they posted a video of his 40 longest, kind of like you know, that video where it has all his touchdown to each receiver. It's just similar to that. I watched that whole thing. It was pretty sweet. Tons of Gronk, tons of moss, tons of branch. Oh yeah. Sam Aiken was on there twice. Yeah.",
    "timestamp" : "28:29-29:10",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "29:10-29:25",
    "text" : "I I think I remember what didn't he like didn't he moss some uh It was a uh Dolphins defender, I think. I think so. Went up over him and lost him and then the defender fell over him. Crazy catch. Dobson was on there. Yep.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:26-30:08",
    "text" : "I guess the stuff that makes me that makes me hate uh Nikhil Harry even more. Because I hated Dobson and I saw him do that and I was like, that's already better than anything Harry's done. Oh god. So and then I looked, so I started checking like post 2017 to see if there was any long ones in the last couple years. And I was like, it can't be any. Last year, 2019, they had a pretty long one in week one, if you remember that. After week one, his Brady's longest touchdown pass was 38 yards. to a land in Roberts.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh my goodness.",
    "timestamp" : "30:08-30:10"
  },
  {
    "text" : "Wonder Roberts catch a 40 yard TD. I guess Miami, week 17. Because he's playing, remember he was playing fullback for a little bit.",
    "timestamp" : "30:12-30:22",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, yeah. But I remember a 48-yard touchdown pass of the fullback. Yeah, 38. I'm looking it up on the website. It's on the probably the highlights on the site, right?",
    "timestamp" : "30:22-30:31"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. They're all on there. Yeah, if you click on the Tom Brady thing at the top and then all-time three touchdowns. That's a good point. I was even going to the to the uh nope and then if you do game search you know if you do touchdowns by season it'll be the first one 2019 And it's uh it's quite a it's quite a touchdown. It's a great catch by Lynn's doing that.",
    "timestamp" : "30:31-30:52"
  },
  {
    "speaker" : "Greg",
    "text" : "He's spinning and another quiz for later too.",
    "timestamp" : "30:52-30:55"
  },
  {
    "text" : "So strap in. Well here's one for you. Uh like you said, the the butt fumble game was one of the two times they scored three touchdowns in under a minute. Do you remember the other time they did it?",
    "timestamp" : "30:55-31:09",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, we've asked Sis on this before. Uh it wasn't was it the Lions or something like that?",
    "timestamp" : "31:09-31:16",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "You're in the right division.",
    "timestamp" : "31:16-31:17"
  },
  {
    "speaker" : "Steve",
    "text" : "Cardinal. I forget what it was.",
    "timestamp" : "31:17-31:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:19-31:35",
    "text" : "It was some random game. Chicago Bears in the snow. Oh yeah. No, not in the snow. It was actually at home. But yeah, they scored three touchdowns. Because there was some turn. In the snow though. No, it was a different game. They scored, they scored some good touchdowns on that one too."
  },
  {
    "speaker" : "Greg",
    "text" : "But yeah, because that was on the forty list. I've never seen I I had no recollection of that game. I was like, I don't remember a snow game against the Bears. And uh the score was like 35-0. I was like, Jesus Christ. Yeah. We'd we have a habit of kicking the living shit out of teams in the snow, I guess. Yeah. Oh yeah. The Titans, the Cardinals.",
    "timestamp" : "31:35-31:57"
  },
  {
    "timestamp" : "31:57-31:58",
    "speaker" : "Andy",
    "text" : "Yeah, the bears."
  },
  {
    "timestamp" : "31:58-32:01",
    "speaker" : "Greg",
    "text" : "Oh my days."
  },
  {
    "text" : "See what you did there. All right. Well, we haven't actually talked about this game, which is what people can't. So uh in terms of watchability score I'd probably give it somewhere in the middle. I'd probably like a three out of six Lombardies just because the first uh two two and a half quarters are borderline unwatchable. There are Let's see. Punt, punt, interception, punt, fumble, field goal, punt, fumble, dolphins, touchdown, fumble, field goal, field goal. That's how those drives ended.",
    "timestamp" : "32:03-32:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I feel I I think you're spoiled, Andy. Yeah. You have to you have to grade these on a curve of 2003. Like we're not watching the Chiefs. You know, we're not gonna be a million points in these games. You gotta expect drives to be a big thing.",
    "timestamp" : "32:41-32:58"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "32:58-33:02",
    "text" : "But it was yeah, but it was just the way the turnover turnovers were."
  },
  {
    "text" : "It was just like sloppy. I know what it is, Greg. It's because like a Dan Deerdorf was on it and he was classic Dan Deerdorf Patriots at Miami and just even I thought it was too much.",
    "timestamp" : "33:02-33:14",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "33:15-33:21",
    "text" : "I actually did watch like bits and pieces of it and I was like, ooh Deirdorf, I'll give you heat blows."
  },
  {
    "timestamp" : "33:22-33:25",
    "speaker" : "Steve",
    "text" : "Give it a fucking rest, Deirdorf. Like good god."
  },
  {
    "timestamp" : "33:25-33:26",
    "speaker" : "Greg",
    "text" : "He is the worst."
  },
  {
    "text" : "My notes. One of the first notes I wrote down in my my game notes. Oh no, it's Dan Deerdorf. Oh no. Yeah.",
    "timestamp" : "33:26-33:34",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:34-33:36",
    "speaker" : "Greg",
    "text" : "Oh heavens."
  },
  {
    "timestamp" : "33:37-33:49",
    "text" : "But I I also have a new pet peeve that you'll be glad to hear. And it's not necessarily like I j I realize it in this game, but I've isn't that recent more recently that you haven't been able to get rid of",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh I'm looking at that. I had the same one. Yeah.",
    "timestamp" : "33:49-33:53"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:58-34:33",
    "text" : "I know. That was my problem. I don't I I need a bidet, I think is what I I knew. It's like it's like trying to clean up mud in a rug with paper towels. It's just not working. Oh my god. Um but yeah, my new pet peeve is Every time a receiver catches a football, the commentator calls them wide open, even when they're not. And there's one because I've realized it recently because I've been watching. the YouTube highlights of the games that I don't watch on Sunday. And why don't you watch who would have you don't watch the Patriots anymore? Not no other games."
  },
  {
    "text" : "Oh, okay.",
    "speaker" : "Greg",
    "timestamp" : "34:33-34:34"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:34-34:34",
    "text" : "Okay."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "34:37-34:42",
    "text" : "I was about to fucking bust your chops about being a fair weather fan."
  },
  {
    "timestamp" : "34:42-34:45",
    "speaker" : "Andy",
    "text" : "On Mondays I'll go and like watch the highlights of the other games I didn't see."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "34:46-34:46",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "34:46-35:04",
    "speaker" : "Andy",
    "text" : "And there's there's one commentator on there, and I you only realize it because every time like all they show is the completed passes and things like that. And he calls every single completion to a wide open receiver. And uh Dick Enberg was doing that in this game. I'm like, that's what it is. I don't like you for that."
  },
  {
    "speaker" : "Steve",
    "text" : "So I had to think about Dick Edinburgh. I had this thought as I was watching this game. I was like, imagine if Pro Football Reference used the Dick Edinburgh callouts to assign stats. And how that would like seriously skew some guys' stats and other guys' stats, and then you'd be like, oh, they both numbers end in three. That's why he's getting confused.",
    "timestamp" : "35:05-35:28"
  },
  {
    "text" : "Dick Engberg is the king of getting people wrong.",
    "timestamp" : "35:28-35:32",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:32-35:34",
    "speaker" : "Steve",
    "text" : "Just flat out wrong, too."
  },
  {
    "timestamp" : "35:34-35:42",
    "speaker" : "Andy",
    "text" : "Like he on multiple occasions was calling Dion Branch. Uh Kevin Falk because they both end in three."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:43-35:45",
    "text" : "Instantly. Kevin Falk's receptions double."
  },
  {
    "text" : "Yeah. And Dion Branch doesn't have any.",
    "timestamp" : "35:45-35:49",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:49-35:56",
    "speaker" : "Steve",
    "text" : "Yeah, Dion Branch loses his Super Bowl MVP Yeah. When he had 11 catches and gave it to all the Kevin Falk."
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly. Oh my God.",
    "timestamp" : "35:56-35:58"
  },
  {
    "speaker" : "Steve",
    "text" : "It wasn't solid like seven times that I noticed. It was it was consistent enough to be like legitimately annoying once or twice, like yeah, whatever.",
    "timestamp" : "36:00-36:07"
  },
  {
    "text" : "I believe the first time we had Dan Deerdorf game on here. I pulled up a few of those clips and you guys gave me a rash of shit. You're like, oh well, whatever. Like I can't believe they got a name wrong. Whatever. It's no big deal. I knew you'd be around. We're just shitting on you, Andy. Yeah. I knew you'd be aware.",
    "timestamp" : "36:07-36:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "We're just taking the opposite of whatever position you were gonna have. We're gonna take the opposite. Don't you haven't you figured out how those words are?",
    "timestamp" : "36:24-36:29"
  },
  {
    "speaker" : "Greg",
    "text" : "I knew you'd come around. Stop being a contrarian, Andy. Look it up.",
    "timestamp" : "36:29-36:32"
  },
  {
    "text" : "You could say whatever you want, but I knew you'd come around. Oh no, I always fucking hated Deirdore ever since when that game of Troy got hurt, that overtime Kansas City game.",
    "timestamp" : "36:33-36:42",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "36:42-36:43",
    "speaker" : "Andy",
    "text" : "Yep."
  },
  {
    "speaker" : "Steve",
    "text" : "It was last year. And he was having a career, it was probably his best game ever. And then he got hurt in the third quarter. And over time, they were like, oh, and Troy Brown's back out there. I was like, and it was like, oh, nope. Got his name fucking wrong again. Somebody completely different. Yeah. Nope, that's Kevin Falk. Don't go get me. Oh, nope. That's fucking. Mike Frabel.",
    "timestamp" : "36:43-37:04"
  },
  {
    "speaker" : "Andy",
    "text" : "We'll end in zero. But if we want to stay on the hate train, I can give you some Hate for the referees, because these guys just well there's a few things. What yeah, let's hear it So the first one was uh they decided not to blow any plays dead. Oh my god. They didn't blow plays dead? Yeah. God geez. So it resulted in two fumbles that shouldn't have been fumbles, one for each team. And now a cheap shot, late hit to the helmet to helmet. That's how people get hurt. On Sammy Knight, taking a cheap shot on Kevin Falk. Got away with it because the player didn't get blown dead. Some bullshit. Should have blown it dead. God. And you can be contrarian all the fuck you want, Greg Brown. But the guy couldn't even figure out how to do a coin toss in uh the coin uh the coin toss. We'll get we'll get to that. We'll get fucking right with it. Yeah, yeah. Yeah, you're not gonna be uh Contrario no.",
    "timestamp" : "37:05-38:05"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "38:05-38:43",
    "text" : "Alright, something we can all agree on. I heard a ridiculous uh football or not football. Okay. It's his job to explode all over Chris. It's close to nine minutes left in the second, so it's pretty early. It's I I it's his job to explode all over Chris. I can't remember the exact play. It's right after Brady's sneak fumble. And then I think maybe Chris Chambers coming across the middle gets hit by a safety."
  },
  {
    "text" : "Probably Rodney Harrison, maybe. Maybe. He was all over and still that's That's borderline. That's uh exploded on.",
    "speaker" : "Andy",
    "timestamp" : "38:43-38:51"
  },
  {
    "speaker" : "Steve",
    "text" : "Do you remember? Not exploded on. Or and certainly not all over him.",
    "timestamp" : "38:52-38:57"
  },
  {
    "text" : "Why did he get exploded into him?",
    "speaker" : "Greg",
    "timestamp" : "39:02-39:04"
  },
  {
    "text" : "Yeah, he kind of like got like it was like a bang bang play right in the middle, you know, come across the middle, you're gonna get hit sort of thing back in those days.",
    "speaker" : "Steve",
    "timestamp" : "39:04-39:11"
  },
  {
    "timestamp" : "39:10-39:14",
    "speaker" : "Greg",
    "text" : "Yeah, exploded adjacent, maybe in the shower."
  },
  {
    "text" : "Oh Christ. Let's get into the play by play because I just gave up like the Brady sneak fumble and all that.",
    "timestamp" : "39:18-39:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, speaking of exploding, uh the the rookies for this Pagers defense exploded early. uh where Greg's boy Eugene Wilson got his is this his first ever interception or does he have one earlier? I don't know. He's he had one earlier. Did he? He may have had one. This was the jersey. Yeah, yeah, yeah. This was a combo of Eugene Wilson and Asante Samuel.",
    "timestamp" : "39:26-39:53"
  },
  {
    "timestamp" : "39:53-39:54",
    "speaker" : "Steve",
    "text" : "That was a nice play."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Asante Samuel got his hand in there, knocked the ball up, and Eugene came over, picked it off. And on top of that There was a flag thrown. Everybody's like, oh, it's obviously defensive pass interference. It actually wasn't. It was called on the wide receiver for grabbing Eugene Wilson's face mask on the way down. So the Patriots got an extra 15 on top of the interception. Which the Patriots did nothing with, and they ended up punting from the Miami 40.",
    "timestamp" : "39:54-40:19"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:19-40:28",
    "text" : "Good. They ran back-to-back draw plays on like second and third down. A lot of draw plays did not work in this game. I feel like I saw that last week."
  },
  {
    "timestamp" : "40:28-41:13",
    "speaker" : "Andy",
    "text" : "Not a bad play con. Yeah. Yeah. Um so yeah, Patriots get one first down and punt from like literally the Miami 40, which is is tough to watch. Miami start moving the ball. They kind of did okay moving the ball at times. But then this is the first fumble that what occurred because the refs didn't stop a play when it should have been stopped. Uh Chambers, you know, his forward momentum stopped, but he's like reaching for a first down and he pulls the ball back in, you know, plays basically over it, gets knocked out, and the pages pick it up. Probably shouldn't have been a fumble, but that's how it's called in the fields. The pages get the ball. Started at the Miami 25, get inside the 10-yard line, and then they try to run on third down. Yet another QB draw. Yeah."
  },
  {
    "text" : "There's a lot of like long Q and it was like third and four or five, too. It was only third and ones. No.",
    "speaker" : "Steve",
    "timestamp" : "41:13-41:19"
  },
  {
    "speaker" : "Andy",
    "text" : "And Brady gets like two yards because that's what he gets on a QB draw. And so I have to settle for a field goal.",
    "timestamp" : "41:19-41:25"
  },
  {
    "speaker" : "Steve",
    "text" : "The O looks like it's garbage against the Giants. It looked like garbage the game before. The offense has not looked very good at all. They just got two gifts from the Dolphins. You've never won. You look at that gift horse in the mouth, you'd be like, you know what? Three points, please. Yeah. It's like here's 14. Nah, three. Three will do. What were you gonna say, G?",
    "timestamp" : "41:25-41:49"
  },
  {
    "timestamp" : "41:49-42:02",
    "text" : "I have some notes on uh Brady's QB sneaking numbers while we're on the topic. Because obviously we know that Brady is like ultra successful at QB sneaks.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "42:02-42:03",
    "text" : "Yes.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "But he like didn't do that well this game, right?",
    "timestamp" : "42:03-42:06"
  },
  {
    "text" : "Uh he had he had a definitely like a he one of those like third and sixth QB sneaks worked.",
    "timestamp" : "42:07-42:13",
    "speaker" : "Steve"
  },
  {
    "text" : "Wasn't probably it wasn't the next one either.",
    "timestamp" : "42:14-42:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "So these by one for three on them.",
    "timestamp" : "42:17-42:19"
  },
  {
    "timestamp" : "42:19-42:28",
    "text" : "These numbers I have are third or fourth and two or less. Conversion rates.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "42:28-42:28"
  },
  {
    "text" : "So since 2001, Brady has 157 sneaks. Wow. So he's averaging one every two games. Which is 85 more than the person in second place, Drew Bruce.",
    "speaker" : "Greg",
    "timestamp" : "42:29-42:43"
  },
  {
    "timestamp" : "42:45-42:46",
    "speaker" : "Andy",
    "text" : "Wow, that's a lot."
  },
  {
    "speaker" : "Greg",
    "text" : "Um I don't know how they calculated this. It was like a nerdy stats website, but um it's like 140 cumulative EPA, which is expected points added. So they had some equation for it, adds a touchdown a year is just on those successful. Just on a successful keeping draft around. Yeah, yeah. Yeah. So then I found a New York Times article in 2015.",
    "timestamp" : "42:47-43:13"
  },
  {
    "text" : "So it's not as recent in numbers, but they went only five years ago.",
    "timestamp" : "43:14-43:17",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. This is like how successful he actually was on those. Yeah. So at that point in time, he was he had done a hundred and fifteen sneaks and he was he had converted a hundred and five of them.",
    "timestamp" : "43:17-43:32",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Good lord.",
    "timestamp" : "43:32-43:33"
  },
  {
    "text" : "So he was running 91. 3% conversion rate.",
    "timestamp" : "43:34-43:38",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Is that all sneaks or just two yards or less?",
    "timestamp" : "43:38-43:41"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "43:41-44:16",
    "text" : "Just two yards or less. Yeah. There was a seven year stretch where he went 60 of 61 and he had 37 straight converted sneaks. Which is in the article, Josh McDaniels was quoted as saying he has tremendous leg strength. Which it seems I I don't know. I I thought it was worth writing down because it just seems Football kind of. I don't know. Brady, tremendous leg strength. I don't know. I think he's just kind of like savvy, you know? Yeah. And tall."
  },
  {
    "text" : "Well he always calls it when he can, but I get I get it. I mean he's soft, he's pliable, he can fit in cracks.",
    "timestamp" : "44:17-44:22",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "44:22-44:26",
    "text" : "Yeah. But tremendous leg strength isn't what I think of."
  },
  {
    "timestamp" : "44:26-44:31",
    "speaker" : "Steve",
    "text" : "Well how do you get how do you get those cracks? You need the leg strength to like s you know make yourself soften and lengthen to get in the between."
  },
  {
    "timestamp" : "44:32-44:36",
    "speaker" : "Andy",
    "text" : "Right. That's why he's so successful because you don't think he's got the leg strength for it. But he does."
  },
  {
    "text" : "He surprises you. And that in the most New York Times thing ever. Oh boy. I'll quote this. It said, Brady is as unstoppable as a crash of rhinos. Which is of course what a group of rhinos is called a crash of rhinos. Huh? I Googled it. And then I went further down the rabbit hole and started looking up. Fu funny names of groups of animals.",
    "timestamp" : "44:36-45:06",
    "speaker" : "Greg"
  },
  {
    "text" : "I knew I knew that wouldn't be it.",
    "timestamp" : "45:07-45:09",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:09-45:38",
    "speaker" : "Greg",
    "text" : "Or my favorites here. Um A smack of jellyfish. Okay. A caravan of camels Yeah. Build that wall. Um a pandemonium of parrots. That's brilliant. That makes a lot of sense. Yeah. And then my personal favorite, a prickle of porcupines."
  },
  {
    "timestamp" : "45:42-45:47",
    "speaker" : "Steve",
    "text" : "Whoever like who get to come up with that, but that dude is sitting there feeling real fucking proud of himself."
  },
  {
    "speaker" : "Andy",
    "text" : "That dude is high as shit. Prickle of porcupine. So guess what we're gonna call a group of porcupines? Yeah.",
    "timestamp" : "45:48-45:54"
  },
  {
    "timestamp" : "45:58-46:06",
    "text" : "So yeah, that's all I got on QB sneaks. Except for I did want to ask the question, do you think it's an oxymoron calling it a sneak? Is it really sneaky?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "46:06-46:17",
    "speaker" : "Steve",
    "text" : "Yes, because it takes the defense on a I don't know where because that's the only reason Tom Brady is so successful, because he knows exactly where the defense is lined up that this is going to be successful before he snaps the ball."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "46:17-46:34",
    "text" : "I don't know. Usually when when Cam Newton puts his foot back there, you just know it's gonna be a QV sneak. But yeah, you see that? Yeah. And then it was and then immediately runs a running play. Oops. I thought of you when I watched that, Andy."
  },
  {
    "timestamp" : "46:34-47:06",
    "speaker" : "Andy",
    "text" : "Good. Thanks. Fucking commentators. I can do their job. Speaking of uh Brady QB sneaks, he tried another one in this. Uh but he fumbled it because it was like third and five. They started their own five and they got like the 20. Uh not not even. like the 15 and Brady fumbles on a QB sneak where you know he goosed the center, goosed him, and uh took off. And somehow, I don't know like if the exchange was bad or what, but he just kind of like dropped the football."
  },
  {
    "text" : "Yeah, like a crate of eggs. You'd hold it like you cradle in a crate of eggs. It wasn't even like he didn't have a tuck to nothing.",
    "speaker" : "Steve",
    "timestamp" : "47:08-47:14"
  },
  {
    "timestamp" : "47:14-48:08",
    "speaker" : "Andy",
    "text" : "Yeah, it was it was a strange one. Um and I don't even know how Miami recovered it. It must have been like a fight for it in the pile because it looked like the center fell directly on it. But for sure. Miami came out with it. Started the New England 16. And I think it was like one or two plays later, Fiedler, Fiedler. Fiedler on the roof. It was a touchdown to Chris Chambers. Jewish quarterback hall of fame, right? Exploded all over him. Yep. For a touchdown. Yeah. And then on the ensuing drive, uh Pasket one first down, and then uh Kevin Falk coughs it up on yet the second. uh currents of a play that should have been whistled dead and wasn't. And Falk is just like being held there hopelessly because he's little. And then somebody comes in and strips the ball and they didn't blow it dead, so mine recovers again."
  },
  {
    "timestamp" : "48:09-48:33",
    "text" : "You say I was surprised by that fumble because Kevin Falk was wearing those arm, those elbow pads, they look like tires. So you think like an extra grip inside his elbow would help keep the ball in there because those things were legit off-road ATV tires. They were same tread pattern, everything. His outfit, the best. The gigantic chin pad, the fucking rubber tire elbow pads, I loved it.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "And the face massage just has like four extra bars for no reason. We can't actually see him in there. Like I think that's Kevin.",
    "timestamp" : "48:33-48:41"
  },
  {
    "text" : "Well you literally could put everything in that only offense in the Giants game, in this game up to the point, it's all fault. Running, receiving, that's all they can get. MVP. The more you now you say that Andy and I watch these games, you're right. He's he's a absolutely not playing very well.",
    "timestamp" : "48:41-49:01",
    "speaker" : "Steve"
  },
  {
    "text" : "Can you be an MVP if if it if the unit sucks? Yeah. It's like having an MVP on a basketball team that doesn't make the playoffs. It's like impossible.",
    "timestamp" : "49:01-49:10",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "49:11-49:15",
    "speaker" : "Andy",
    "text" : "Greg Brown, I was we were both voted MVP of our uh high school soccer team."
  },
  {
    "text" : "Yeah, but we weren't MVP of the league or anything. You know, we're I'm not saying MVP.",
    "timestamp" : "49:15-49:19",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "49:19-49:20",
    "speaker" : "Andy",
    "text" : "I'm saying team MVP."
  },
  {
    "text" : "Yeah, he's offensive MVP. Okay, team MVP or offensive?",
    "timestamp" : "49:20-49:24",
    "speaker" : "Greg"
  },
  {
    "text" : "Offensive MVP he's the best player offense, without a doubt. This whole season. And I think too.",
    "speaker" : "Steve",
    "timestamp" : "49:24-49:31"
  },
  {
    "timestamp" : "49:31-49:47",
    "speaker" : "Greg",
    "text" : "I'm not giving an MVP. Like, cause especially when you like you look at players' stats on these uh notes write-ups and you're like, oh, 600 yards on the year. What a sh what a shit bum. You know? It's like the same stats Kevin Falk has. Huh?"
  },
  {
    "text" : "Yeah, but at the same time, like if I actually watched those games, I would be able to talk about the MVP, uh the team MVP on the the Dolphins for the 2002 season, but I'm not. I'm watching the Patriots game. Yeah, so why are you shitting on them?",
    "speaker" : "Andy",
    "timestamp" : "49:47-50:00"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "50:00-50:09",
    "text" : "Well, we win the Super Bowl this year, Greg. So we have to have a team MVP. And you get to vote every week and you can change your vote up until the Super Bowl. And right now, my vote is for Kevin Falk."
  },
  {
    "timestamp" : "50:09-50:10",
    "text" : "Mine's for Eugene Wilson.",
    "speaker" : "Greg"
  },
  {
    "text" : "Eugene Wilson Fine. No, Eugene Wilson is in a he's not even the best defender. Richard Seymour is the best defender. Mine's for Matt Chatham. He had a touchdown last week. Timor is an absolute beast and he's a beast in this game.",
    "speaker" : "Steve",
    "timestamp" : "50:10-50:26"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:27-50:28",
    "text" : "He was a beast in this game."
  },
  {
    "text" : "He was an ab he's all he's It was kind of like that changing of the guard from uh JT, Jason Taylor, to Seymour. Because they're both sort of like that taller, thinner Defensive end, the athletic end. Also super athletic. And uh Seymour was outplaying him in this game.",
    "speaker" : "Steve",
    "timestamp" : "50:28-50:46"
  },
  {
    "speaker" : "Greg",
    "text" : "Isn't Seymour like a He played more than a few years. He's not defensive end, yeah. Yeah. I think they're different players. No, he's playing Seymour was kind of like a Seymour's like a clogged the middle guy.",
    "timestamp" : "50:47-50:59"
  },
  {
    "text" : "No, he was kind of a bit of both. He could do both, and I think he did do both at times, depending on.",
    "timestamp" : "50:59-51:04",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:09-51:19",
    "text" : "No, he he did mostly line up on the inside, yeah. I'm pretty sure he didn't have like he was not a sack guy, right? So he's not a Jason Taylor. I think he is, like Bill says.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "51:19-51:21",
    "speaker" : "Andy",
    "text" : "I yeah, I understand that."
  },
  {
    "text" : "I mean looks similar, but yeah, a lot of people look similar.",
    "timestamp" : "51:21-51:26",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "But he played better.",
    "timestamp" : "51:26-51:27"
  },
  {
    "text" : "Let's look it up. All right. His most sacks in a year were eight",
    "timestamp" : "51:27-51:32",
    "speaker" : "Greg"
  },
  {
    "text" : "Fucking right. From the interior lineman, that's not bad.",
    "timestamp" : "51:32-51:35",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:35-51:43",
    "speaker" : "Greg",
    "text" : "That's pretty good. That's what I'm saying. But he's a big interior. He's closer to Vince Wilfork than he is Chandler Jones."
  },
  {
    "text" : "No.",
    "timestamp" : "51:43-51:44",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "51:44-51:45"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:46-51:49",
    "text" : "No, not in not in body type and style of play at all."
  },
  {
    "text" : "Yeah, but like what they're the purpose they're serving on the team.",
    "speaker" : "Greg",
    "timestamp" : "51:49-51:53"
  },
  {
    "text" : "Oh, no, so if you have a sliding scandal of Vince Wilfork to Chandler Jones, he's smack in the middle. That's fair. He can do both.",
    "speaker" : "Andy",
    "timestamp" : "51:54-52:03"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, and he's built more like Chandler John's, but he can play like he can eat up blockers like Wolf Orkand that Chandler Jones could have.",
    "timestamp" : "52:03-52:09"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, but what do they ask him to do? I'm saying what do they ask him to do? Not where does he like look like him play like I'm saying what what is his function on the team Bill Belichick Mr. Football Genius asking me to say he's like a big body that used to like take up like he He's not like an athletic guy coming off the edge like causing havoc like that. All right. Steve care to comment?",
    "timestamp" : "52:10-52:34"
  },
  {
    "text" : "They're both 6'6. Jason Taylor is 244.",
    "speaker" : "Steve",
    "timestamp" : "52:34-52:37"
  },
  {
    "text" : "Alright, we want to go down this fucking path.",
    "speaker" : "Greg",
    "timestamp" : "52:39-52:42"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "52:42-52:56",
    "text" : "Not really. And see more six six three seventeen. He's a fatter Jason Taylor. And Vince Wilford, you gotta you gotta any guesses on him? I understand what they look like."
  },
  {
    "timestamp" : "52:56-52:58",
    "speaker" : "Greg",
    "text" : "You want to talk about the numbers"
  },
  {
    "text" : "325. You want to talk about the number of sacks? He's like, if you take the boat, he's got the weight of Vince Goldfork and the height of Jason Taylor. You want to talk about the number of sacks, Steve? No, I don't want to talk about the number of sacks. Richard Seymour, 57 and a half. Jason. Sacks aren't important, Greg. Everyone knows. Everyone knows this is about knockdowns. Sacks is a stupid sack. Everyone knows that. Well Andy, you know what? This is a great time for you to uh bust out your Bill Belcheck genius point to prove Greg wrong.",
    "speaker" : "Steve",
    "timestamp" : "52:58-53:30"
  },
  {
    "speaker" : "Greg",
    "text" : "Let's hear it, Andy.",
    "timestamp" : "53:30-53:31"
  },
  {
    "text" : "So There was, let me find it. Um, so there was uh a lot of talk about let me just share my screen here um so you can all hear the audio oh a lot of talk about um the main point of emphasis for the patriots this week",
    "timestamp" : "53:32-53:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Speaker 5",
    "text" : "Down to Bonnie Bernstein we got.",
    "timestamp" : "53:53-53:54"
  },
  {
    "timestamp" : "53:54-53:55",
    "text" : "This happened in the fourth quarter.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "53:55-54:15",
    "text" : "The Patriots one of their main points of emphasis on defense, red zone defense. Teddy Bruski said the last time we were down here in Miami, the Dolphins scored Three touchdowns on third down inside the 20. He says it was a huge topic of discussion for us, a major point of emphasis, and then we spent a lot of time on red zone defense this week.",
    "speaker" : "Speaker 6"
  },
  {
    "text" : "Ooh, now what are the stats, Andy? What was the red zone offense for the Dolphins? They got one touchdown. Yep. And what two for four on field goals? Yeah.",
    "timestamp" : "54:17-54:31",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:31-54:36",
    "text" : "And how are they on third down? Three for nine, maybe, I think, at one point."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, not great. That's defense.",
    "timestamp" : "54:36-54:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:38-56:02",
    "text" : "They started one for seven on third down. And then the game came down too? A third down in the red zone, Patriots held, and then we'll get there. Special teams. Yes. Also, the before this game, Bel check, and this is the Boston Globe article headline. Belichick uses horror film to scare Patriots straight. Who wrote it? I don't give a fuck who wrote it because they don't deserve credit for that. But from the article, which is why yesterday the coach assembled a team for a screening of quote mistakes in Miami 2001 to 2002, a compil compilation of costly errors they've committed in their last two road games against. A team that already had enough of a home field advantage. So he is going in there and he is showing you you beat yourself. And when you beat yourself, you do it on third downs and you let them stay on the field and you do it in your own red zone so they convert touchdowns instead of field goals. And what did this game come down to, Greg? Carry to comment? Miss Field goal. Yeah. Where where was that field goal from? 80-yard bomb. Wrong. You're not playing the game correctly. Two missed field goals. You're not playing the game correctly. Go fuck yourself."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:02-56:13",
    "text" : "There was that being said, there was four turnovers, nine minutes left in the second. That's insane. Like they bullet there was two on each side. Solving turnover twice, Patson turned over twice."
  },
  {
    "text" : "Yeah, this was definitely a defensive struggle. Right after that campfall figured out why I get angry about it. Okay. It's because I'm jaded from like my college soccer coach. Like I bet it it's not fun playing for Belichick. Oh, definitely not. Like when someone comes to you and says, here's all the terrible mistakes you've made in the past, go out there and don't make mistakes. Like that doesn't make you play confident or have fun or like play the game you love. That makes you go out there and like play sort of like, all right, don't fuck don't don't fuck up, don't fuck up. And it works. Like it worked for my college soccer coach the same way and it just works clearly worked for Belichick, but as a player, I don't think it's very fun to play for those types of teams. Or those types of coaches.",
    "timestamp" : "56:13-57:04",
    "speaker" : "Greg"
  },
  {
    "text" : "I mean, you might not, but I'm sure some people might enjoy that.",
    "speaker" : "Steve",
    "timestamp" : "57:05-57:09"
  },
  {
    "timestamp" : "57:09-57:12",
    "speaker" : "Greg",
    "text" : "Well, they enjoy winning. Everybody enjoys winning."
  },
  {
    "timestamp" : "57:12-57:14",
    "speaker" : "Steve",
    "text" : "But maybe some people enjoy playing that way as well, though."
  },
  {
    "timestamp" : "57:15-58:14",
    "speaker" : "Andy",
    "text" : "I don't think it's uh here's all the things you do wrong, don't fuck up. I think it's here's like it's not anybody else. So like here from that same article. Um It's quoting Christian Fourier. He says, if you're losing a lot, you start saying, oh, it's this, it's that, Fourier said. Well, no, if you just kind of take a second step away from situation, you realize it's not anything but yourself. It's you not executing. It's you dropping the ball. It's you not picking up the read. It always comes down to one thing, execution. And then to on top of that, Belichick focuses on a certain spot where Like this is something that's going to come up in this game. This is the execution that we need to be ready for. And as long as you do your job. We're gonna be in good position. You're not you're not trying to to make people feel like shit about the things they've done wrong. It's just like the lesson is if you do your job, if you execute what we tell you is the thing that needs to be executed we we're gonna have a better chance of winning this game."
  },
  {
    "speaker" : "Greg",
    "text" : "I just don't think it's fun to play in those site those sorts of teams though. Well I think don't don't try and play well. Don't play well Just do bare minimum and don't fuck it up.",
    "timestamp" : "58:14-58:25"
  },
  {
    "speaker" : "Steve",
    "text" : "Like that's what that is. Maybe if you were better at soccer, then you could be admitted that style. No. And what I think where I think Belichick is great is that he identifies those situations Through his like knowledge of football, and it's like he knew it out this Miami game was gonna come down to red zone efficiency, right? Through all his whatever the fuck he figured it out. And like there's so many executions you have to make in a football game. Every single play has a million decisions to make, sort of thing. It's like you might not be great at all of those, but like these are the most critical ones that we're gonna practice all fucking week because We need to win. And when you get to the red zone, you're like, fuck, I fucked up a bunch of plays already. They're already here. But this is like what we talked about all week. This is where I need to step it up and like do my job right. Perfect every time.",
    "timestamp" : "58:25-59:13"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, and and that's what they used to do at my college soccer tea. We used to we used to practice fucking corner kicks and free kicks. for hours and it fucking sucked. It was wicked boring and no one had fun. I'm not arguing that it's not an effective way to coach. I'm arguing That it fucking sucks.",
    "timestamp" : "59:14-59:32"
  },
  {
    "timestamp" : "59:32-59:39",
    "speaker" : "Steve",
    "text" : "So you want to go play for Bruce Arians. That's fine. I'm sure Brady at some point was like, you know what? Greg is right."
  },
  {
    "text" : "I want to play for fucking Reed, you know? Yeah. Andy Reed. He's the one that's like creative genius that like comes up with cool plays. Let's go get him. Let's attack him. He's probably not as good as like a coach's Belichick is. But from a player's standpoint, if if if Belichick wasn't winning, that shit tanks quick.",
    "timestamp" : "59:41-01:00:01",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:00:01-01:00:03",
    "speaker" : "Steve",
    "text" : "It just happened to Matt Patricia."
  },
  {
    "text" : "Yeah, yeah, it's similar to Matt Patricia's a great example of Billow Bay. That shit flies when you're winning, but it once you start losing, whoo",
    "timestamp" : "01:00:03-01:00:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "But that being said, I will say this, like everyone thinks that Belichick got that way after he wins these next few Super Bowls. Right. But he wasn't. He's always like that.",
    "timestamp" : "01:00:11-01:00:20"
  },
  {
    "timestamp" : "01:00:20-01:00:31",
    "speaker" : "Greg",
    "text" : "Right. I was saying that he he he became the greatest coach ever because he won those three Super Bowls early, that he had like unlimited leash."
  },
  {
    "text" : "to you know they'll just be like yeah we're trusting the process because I think he's in a good situation too with Robert Kraft who's willing to give him that lease Yeah.",
    "timestamp" : "01:00:31-01:00:42",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:00:42-01:00:50",
    "text" : "I don't think you get that from Jerry Jones. We're rewatching every single fucking game from 2001 to episode 50.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "But who who knows? Maybe Patricia is just as smart of a football coach and he goes into games going, we gotta practice red zone shit like that. But you so it just doesn't quite come off and then think snowball and next thing you know, he's like a cloud, he's getting clowned on the internet when he's just as smart of a coach as Velchek is. You don't know, right?",
    "timestamp" : "01:00:51-01:01:11"
  },
  {
    "timestamp" : "01:01:12-01:01:21",
    "speaker" : "Andy",
    "text" : "I don't yeah, I don't think it's just being smart coach. I'm sure there's a shit ton of those. Yeah, especially like players coach, right? Belly. Especially coordinators. I think he is."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:01:22-01:01:24",
    "text" : "I don't think he is. I'm with you."
  },
  {
    "text" : "To a certain extent, I think. Probably more so than these other guys who have gone off and not been successful, like uh an Eric Mangini or uh what's the name map patricia i i think he ha he has a system that he's brought with him and if you bind to the system he's gonna put you in a position to succeed Regardless of where, like if you are the most skilled at that position, you know, Mike Vrabel probably wasn't the most skilled outside linebacker, but he made some massive plays because he was in a system that fit what he could do well. And so I think on top of that, he also is from everybody who's left the team talked about how straight of a shooter he is, he'll tell you exactly where you stand. And it's not going to shoot a coat of he's not going to be a dick about it either. You know, he's just going to tell you like. how things are.",
    "speaker" : "Andy",
    "timestamp" : "01:01:24-01:02:18"
  },
  {
    "timestamp" : "01:02:19-01:02:28",
    "text" : "Yeah, but that's not a player's coach. A player's coach is like Rex Ryan where you're like, this guy, this guy like is awesome. Greg, you would love Rex Ryan. I do love it.",
    "speaker" : "Greg"
  },
  {
    "text" : "He's a media's coach.",
    "speaker" : "Andy",
    "timestamp" : "01:02:29-01:02:30"
  },
  {
    "speaker" : "Greg",
    "text" : "You love playing for Rex Ryan, too. Dude, I when I watched the Hard Knocks Rex Ryan, I was completely in love with Rex Ryan. I would play for that fucking guy any day of the week.",
    "timestamp" : "01:02:30-01:02:40"
  },
  {
    "text" : "Pete Carroll's a corny bitch, but we'll get back to this fucking game. Jesus. Alright.",
    "timestamp" : "01:02:43-01:02:49",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:02:50-01:04:23",
    "text" : "So yeah, so we've talked about the uh the fumblish first quarter and a half. Um the set the second folk f the falk fumble results in um Miami driving inside New England five-yard line. And what happens? Red zone defense shows up. You know, the one the thing they've been preparing for all week. And uh Miami has to settle for a field goal. And so we're at uh 10-3 dolphins at the moment. Pace get the ball back with uh I think just under two minutes left in the half. They drive down to Miami 40 and then they get a roughing the passer call on third down. So they actually drive like inside the Miami 20-yard line, 10-yard line. And Brady throws a touchdown, but it gets called back for offensive pass interference on the tackle eligible at 68. I don't remember who it was. Tom Ashworth, maybe? Yeah. Which you don't really see. Uh they tried to explain it, but of course, because this is Dan Deerdorf, he he he couldn't. Um so the replay didn't show you what happened. So I'm not exactly sure why it got called, who it was actually called on, or anything like that, but So they didn't get to actually score the touchdown. They had to settle for a field goal. And um Dave Wonstadt was Still, I I don't know if he knew and was just like misspoke or if he uh Thought the Patriots scored a touchdown, but this was his half-time.",
    "speaker" : "Andy"
  },
  {
    "text" : "The touchdown right there comes off of a uh questionable late hit on Brady.",
    "speaker" : "Speaker 7",
    "timestamp" : "01:04:29-01:04:33"
  },
  {
    "timestamp" : "01:04:33-01:04:34",
    "speaker" : "Speaker 6",
    "text" : "Great, thanks coach."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:35-01:05:38",
    "text" : "They they it was a field goal. So that that that touchdown right there that came off a late hit, a questionable late hit on Brady, it wasn't a touchdown. We did go into the half with six points, so that makes sense. 10-6, yeah. But yeah, he he was a little salty about the uh the late hit which it was probably borderline but a lot of these borderline and then especially for that era it was definitely soft yeah um But to uh a couple things. One, uh, let's add to the hatred. I don't know if you caught it there, but in that uh you could hear I think it was just one fan, but they had what sounded like a Vuvuzela. Oh yeah, I heard that. That was terrible. Throughout the game, and I wrote down that I'm going to ram that Vuvuzela down that fan's throat. Yeah, it continues in the second half. And it wasn't as much, but it was still like the first half, it was real noticeable and it was every time. Ugh So 10-6 at the half Dolphins. But pass get the ball. Wait, wait."
  },
  {
    "timestamp" : "01:05:38-01:06:40",
    "text" : "Come on, guns blazing. Before we go in half two, I watched the halftime show. Oh yes. Have some notes. And this is the first halftime show I'd seen all this whole time. Give it to me. Uh there was an amazing play from Randy Moss getting a huge deep ball, but it was like three guys around him because it's freaking Randy Moss. So he's as he's getting tackled, he throws it over his head to another receiver running by him. Dude catches it and goes. Like the A running back score. Ross Smith to end the half. Yeah. And like when it happened at halftime, they're like, this just happened. They haven't even made the extra point yet. We don't decide to review. We don't even know if it counts. Yeah. Yeah. So psyched. And then uh Rett Favre must have been sucking the terrible again, throwing a bunch of interceptions, and they made mention of his sixth-pick game with three pick sixes. Which I was like, what? Google. It was in the playoffs last year. Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "Against the rest.",
    "timestamp" : "01:06:40-01:06:40",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "45-17.",
    "timestamp" : "01:06:41-01:06:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:42-01:07:01",
    "text" : "Brett Far three six INTs. But that Rams defense was like out of control. Wasn't that wasn't that 2001? Because that's how the Rams got to the Super Bowl. January 2002. So yeah, must have been that 2001. 2001 see. The Rams? Good defense? Yeah, that's why."
  },
  {
    "timestamp" : "01:07:01-01:07:16",
    "text" : "He threw in in nine minutes, eleven seconds left in the first. Um 812 left in the third when it was 31 ten, so 38-10. Then seven fifty left in the fourth. So went to 45 to 10.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:07:17-01:07:18",
    "speaker" : "Greg",
    "text" : "Gun gunslinging."
  },
  {
    "speaker" : "Steve",
    "text" : "He did their lid touchdown with eight-yard pass with Five minutes and forty-six seconds down 45-10. That's right.",
    "timestamp" : "01:07:19-01:07:26"
  },
  {
    "timestamp" : "01:07:26-01:07:27",
    "speaker" : "Andy",
    "text" : "To which team?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:07:27-01:07:40",
    "text" : "To his own team. Okay. Just for just for a change. Uh the other one which I didn't look up was well actually Terry Glent had three touchdowns in the first half for the Cowboys."
  },
  {
    "timestamp" : "01:07:40-01:07:41",
    "speaker" : "Speaker 5",
    "text" : "Damn."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. A three touchdown half?",
    "timestamp" : "01:07:41-01:07:43"
  },
  {
    "timestamp" : "01:07:43-01:07:54",
    "speaker" : "Andy",
    "text" : "That's huge. Well remember he Terry Glenn did not have more than one touchdown in a game playing for the Patriots. Yeah, I forgot that. Yeah."
  },
  {
    "text" : "And then they made a joke about uh Tim Couch crying after the game They're like, he's not gonna cry after this game as well, right? Something like that. And like he clearly it been in the headlines of Tim Crouch crying after the game already, and then he came out and played awful again for the Browns, and they're like, he's not gonna cry. And Brett Farbes over here throwing six fucking picks in a divisional game of three pick sixes. He ain't crying. No.",
    "timestamp" : "01:07:55-01:08:23",
    "speaker" : "Steve"
  },
  {
    "text" : "He's having a good old time. He's just playing like he's in his backyard. Yeah. Just gunslinger out there.",
    "speaker" : "Andy",
    "timestamp" : "01:08:24-01:08:31"
  },
  {
    "text" : "Real comfortable pick six.",
    "timestamp" : "01:08:32-01:08:34",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh god. All right. Is that your halftime show? Yeah.",
    "timestamp" : "01:08:36-01:08:41",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:08:41-01:08:44",
    "speaker" : "Steve",
    "text" : "I have more on them, but post-game."
  },
  {
    "timestamp" : "01:08:44-01:08:44",
    "speaker" : "Andy",
    "text" : "Okay."
  },
  {
    "speaker" : "Steve",
    "text" : "We'll get to that then.",
    "timestamp" : "01:08:44-01:08:45"
  },
  {
    "text" : "All right, third quarter. Patriots come out. Guns blazing. Go three and out, and then uh Ken Walter kicks a 21-yard punt. 21-yard punt to the 50. Yeah. So Miami starts inside New England half. Fuck me. It's around the 50. Drive inside New England 20 again. And what happens? Uh red zone defense shows up. Patriots hold and uh dolphins have to settle for field goals. So now up 13-6. And now Brady decides to do Brady shit. And this is like This is almost where you started taking it for granted, I felt like. Like right around here, halfway through this 2003 season of The Patriots don't get blown out. Like other than the week one where like literally everything went war wrong and but the Patriots still like trying to score at the end. Like this team doesn't give up. So they they haven't done anything. They've Fumbled it away twice, including Brady on a QB sneak. They have like less than 100 yards passing, I want to say Brady had it to half. It was not good. And it it the whole thing was just bad. Uh and then the Patriots decide that um enough is enough. And so Brady drives them straight down the field. And hits Givens for with an absolute laser across the middle.",
    "speaker" : "Andy",
    "timestamp" : "01:08:46-01:10:07"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:10:07-01:10:24",
    "text" : "Right before that was, I think it was a play before on third down where he's like legit getting sacked and dragged down and like his feet are already out and the dude is like Got his arm around his waist and like the guys underneath his buttons that pulled him down. Pulled him alignment. Soon Zims it to Troy."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh Dion branch, I believe, but yes. G Oh, you're right. On the infield dirt, yep. To convert like a third and long, like a third and ten or twelve or something. Awesome. Keep your drive alive. And then Brittany on the next third day on third and ten hits a laser to Givens across the middle who I in this game, Givens showed me a lot. I think this was like when Givens kind of had his coming out party too, because he could take a hit and he was like a big wide receiver.",
    "timestamp" : "01:10:24-01:10:51"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:10:51-01:11:23",
    "text" : "Gibbons and Eugene Wilson both showed out in this game for sure. They said they were starting three rookies on defense because Asante Samuel was starting, uh Eugene was starting, and I don't know who the third one was. Time Warren. Week six offensive line. Week six we're starting those. And those guys are all like household names now, but like Givens was a seventh round pick, you know? Eugene Wilson was like fourth round, right? Like these guys are way untested. Mm-hmm. That draft class was the only reason we won this Super Bowl and the next one."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it was impressive. And like just David Givens being able to Catch the ball and hold on to it. And he because he took it. Because catch it in the first place. Pretty fucking bulleted that.",
    "timestamp" : "01:11:24-01:11:33"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:11:33-01:11:41",
    "text" : "That thing was a rifle. Yeah. Absolutely. Just that immediate pop right after it and still Tucked it in. It's awesome. Yep."
  },
  {
    "timestamp" : "01:11:41-01:11:43",
    "text" : "Yeah, use it to bounce into the end zone.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:43-01:11:47",
    "text" : "Tell me you have a you have that uh highlight on Patriots Dynasty info, right?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:11:47-01:12:03",
    "speaker" : "Andy",
    "text" : "Absolutely. Slash game slash 89 is gonna rewatch it right now, actually. It's a hell of a touchdown. From the uh the infield dirt, which uh they were talking about this. The reason, and I've already said this, I I hate like just buy your own stadium. Come on. It's Florida."
  },
  {
    "timestamp" : "01:12:03-01:12:13",
    "speaker" : "Greg",
    "text" : "Oh, you mean we can't we can't play on grass to play in a fucking billionaire NFL league? Right. We're playing on fucking dirt."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:12:13-01:12:13",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "But you know why?",
    "timestamp" : "01:12:13-01:12:14"
  },
  {
    "text" : "Is because the Marlins were still playing because they're in the World Series. Yes. And this will come into play later, but the Marlins being in the World Series is why the Dolphins lost this game.",
    "speaker" : "Andy",
    "timestamp" : "01:12:15-01:12:26"
  },
  {
    "speaker" : "Greg",
    "text" : "You know who is the MVP of that World Series?",
    "timestamp" : "01:12:27-01:12:30"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh Jay Feeble? Coltrane?",
    "timestamp" : "01:12:31-01:12:33"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:12:34-01:12:36",
    "text" : "Jeff Josh Beckett."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that's right. It was that one. With uh him and Mike Lowell on that team?",
    "timestamp" : "01:12:36-01:12:41"
  },
  {
    "timestamp" : "01:12:42-01:12:53",
    "speaker" : "Greg",
    "text" : "Uh yeah, Mike Lowell, Dantra, Willis D-Train, Luis Castillo, Miguel Cabrera, Ugir Bina. Uh-huh. Oh yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Remember him. Yeah. And then they took the team and basically dismantled it directly after this, right? Yeah. Oh yeah. So it's the Red Sox. Yeah, because the Red Sox traded for Josh Beckett, but they basically said If you want Josh Beckett, you have to take Mike Lowell. And then Mike Lowell absolutely shredded afterwards the year after.",
    "timestamp" : "01:12:54-01:13:14"
  },
  {
    "text" : "Did you ever hear what happened to Ugi Urbina?",
    "timestamp" : "01:13:15-01:13:17",
    "speaker" : "Greg"
  },
  {
    "text" : "No",
    "timestamp" : "01:13:18-01:13:18",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "He I was just looking this up actually, so I have his Wikipedia open. Um He in 2005, Urbina was arrested in Venezuela on a charge of attempted murder for an incident that occurred where Urbina attacked five farm workers on his property. whom he had accused of stealing a gun, wielding a machete, and attempting to pour gasoline on them.",
    "timestamp" : "01:13:19-01:13:45"
  },
  {
    "speaker" : "Andy",
    "text" : "I remember this",
    "timestamp" : "01:13:46-01:13:47"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:13:47-01:13:52",
    "text" : "Urbino is convicted of attempted murder and sentenced to 14 years and seven months in prison."
  },
  {
    "timestamp" : "01:13:52-01:13:57",
    "speaker" : "Andy",
    "text" : "Holy shit. I don't remember that at all. Yeah, I remember him going crazy."
  },
  {
    "speaker" : "Steve",
    "text" : "But hey, David Gives, third touchdown catch, week six of his career. He's number nine on the Patriots all-time list or Tom Brady all-time list.",
    "timestamp" : "01:13:58-01:14:07"
  },
  {
    "text" : "She's gonna stroke off to him, Steve.",
    "timestamp" : "01:14:08-01:14:10",
    "speaker" : "Greg"
  },
  {
    "text" : "He's only one behind Hernandez and Watson.",
    "timestamp" : "01:14:10-01:14:13",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Says the guy with a Eugene Wilson jersey. Yeah, right",
    "timestamp" : "01:14:13-01:14:16"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, did you see that catch? I'm gonna go I'm gonna go fucking look it up right now and rewatch it.",
    "timestamp" : "01:14:19-01:14:23"
  },
  {
    "speaker" : "Steve",
    "text" : "I just did.",
    "timestamp" : "01:14:24-01:14:25"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh god.",
    "timestamp" : "01:14:25-01:14:26"
  },
  {
    "speaker" : "Steve",
    "text" : "Sick I didn't watch all his other ones because I want to experience those, you know, in live.",
    "timestamp" : "01:14:29-01:14:32"
  },
  {
    "text" : "David Gibbons has less touchdowns from Tom Brady than Aaron Hernandez does.",
    "timestamp" : "01:14:33-01:14:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, well Hernandez is a ton. Wicked fast. He has 20.",
    "timestamp" : "01:14:38-01:14:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:14:42-01:14:44",
    "text" : "Givens a James White has more touchdowns from Brady."
  },
  {
    "timestamp" : "01:14:44-01:14:50",
    "text" : "He has more than Patton, Troy Brown, Danny Amendola, Chris Hogan, Fourier, Kevin Falk, Mike Frabel. Dorset, Gaffney.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:14:53-01:15:10",
    "text" : "Also, I I looked up the Tim Couch thing. The reason he was crying is because basically the Cleveland fans were booing him. while he was down on the field with a concussion. That is a fuck. So fucked up. That's in Philadelphia shit right there.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Aren't there Browns next?",
    "timestamp" : "01:15:11-01:15:12"
  },
  {
    "timestamp" : "01:15:13-01:15:33",
    "text" : "Uh I don't know. I almost cried reading this. He's working his ass off and they can have their opinions, but to boom me while I'm hurt is fucked up. Like that is fucked up. Especially concussions, knowing what we know now. Right, exactly. Yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "He was probably giving that that thing with a conclusion. Yeah, no, it was not it was not nice with Kin Tim Couch. They were like shitting on Tim Couch. Like I said, like he was like playing awful in this game too. To be fair, this is like you probably had a concussion in this game. Yeah.",
    "timestamp" : "01:15:34-01:15:49",
    "speaker" : "Steve"
  },
  {
    "text" : "What are you gonna laugh about it, dumb bitch?",
    "timestamp" : "01:15:51-01:15:53",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:15:54-01:16:38",
    "text" : "I'm in the office show clips of uh of Deion Sanders slandering Drew Bledsoe. He's like uh he's holding a football. He's like, hey, whoever's sitting there, he's like, hey, hit me in the back, hit me in the back. And the guy like taps in the back and he draws a football. He's like, I'm Drew Bledsoe. Cool. Yeah, Deion Sanders. Deion Sanders trying to be funny. Yeah. Okay. So that's what they do. Yeah, that's what they all do. They still do it though. They still like that. Like none of that has changed. They'd still probably laugh at Tim Couch for crying if he did it today. Like if Baker Mayfield got booed because he was suffering a concussion. They'd make a joke about it. Yeah. W. E. I would, for sure. Very sure. Alright. So speaking of um shit shows, second quarter.",
    "speaker" : "Andy"
  },
  {
    "text" : "It's 13-13 at that point, though. So yes, the pages tied it up with that touchdown. Even though they blew all of their early turnovers, they tied the game. Why? Red zone defense. Actually, I think a big part of it was at least that it didn't get out of hand was they played awesome on rookie in the second half.",
    "timestamp" : "01:16:38-01:16:56",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:16:56-01:17:19",
    "speaker" : "Andy",
    "text" : "Yeah, so that that is a huge thing. This, because you know, I think he had 50 something yards in the first half. 51. The guy's on his way to 100 yards again, whatever. And then I think at some point I want to say it was like a right around the beginning of the fourth quarter. Um they showed a stat where The first half, yeah, Ricky Williams had 51 rushing yards. In the second half, negative one."
  },
  {
    "timestamp" : "01:17:19-01:17:48",
    "text" : "Yeah, he had seven carries, negative one yards, eight carries, zero yards. And I think it was because they were playing that four three a little bit, too. That's why I'm interested to see if they stick with it. Because the strength of the defensive, like if you look at it now, like Ty Warren and Richard Seymour and um Who's the third guy? Jarvis Green was also young there. And they're all playing pretty good. And you're like, well, actually looking now, it's a pretty stacked D-line. They didn't know it, but this game sort of forced them into it. And I think, I don't know, but they might stick to that 4-3.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, we'll we'll definitely find out. And I think just by necessity's sake too, I don't know how many of these linebackers will come back, you know. And and once it's implemented, like it's tough to go back and it's working. But yeah, and Ricky Williams finished 27 carries, 94 yards, because I think basically the defense started wearing Yeah, he had some good runs later. Because it was hot. They didn't have any substitutions, etc. , etc.",
    "timestamp" : "01:17:49-01:18:14",
    "speaker" : "Andy"
  },
  {
    "text" : "So um He had that one crazy run on The drive where they go from their 10 all the way into our red zone. Right. Right in this fourth quarter here?",
    "speaker" : "Steve",
    "timestamp" : "01:18:14-01:18:25"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep.",
    "timestamp" : "01:18:25-01:18:26"
  },
  {
    "speaker" : "Steve",
    "text" : "And he was like he was definitely down after five yards on third and nine. They call like a Ricky Ricky Williams run play. He ended on shit. It was right before they gave the whole eight yards, eight carries, zero yards stat. And I was like, well, thanks for jinxing it.",
    "timestamp" : "01:18:26-01:18:40"
  },
  {
    "text" : "Right.",
    "speaker" : "Andy",
    "timestamp" : "01:18:39-01:18:39"
  },
  {
    "text" : "And he's down after five yards, and he plays an awesome play to put his hand in the dirt and keep his knee barely barely off.",
    "timestamp" : "01:18:41-01:18:48",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:18:48-01:19:08",
    "text" : "Yeah. Camera angle wasn't quite good either. So yeah, so basically the fourth quarter is just uh mostly New England and Miami trading three and outs. Yeah. Um punting back and forth with each other until towards the end, I think there's like three minutes left in the game. No, I Miami start converting third downs finally."
  },
  {
    "text" : "I wrote this down because it's actually way more insane than that. It it it was eleven minutes and three seconds left in the fourth quarter. It's a tie game. Miami has at their own ten-yard line. And they rattled off an 18 play, 73 yard, nine minute drive.",
    "timestamp" : "01:19:08-01:19:25",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:19:26-01:19:27",
    "speaker" : "Steve",
    "text" : "Yes, this is that drive."
  },
  {
    "text" : "That ended",
    "timestamp" : "01:19:31-01:19:32",
    "speaker" : "Greg"
  },
  {
    "text" : "With zero points. Right. So they drove to New England's 17-yard line. Yeah. There's I think they ran down to the two-minute warning, right? Yeah, it's two-minute warning. Yeah. Two and awarding.",
    "timestamp" : "01:19:32-01:19:43",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:19:43-01:20:09",
    "speaker" : "Steve",
    "text" : "They were on like a run. They were on a run. And I will actually give uh Diodor credit for this because they're on a run in the on that drive and they get to the red zone and they get five yards on first down. On Ricky Williams run, because he's finally sort of figured it out, and then they fall start and they go back to second and ten. And Dior's like dum dum dum dum dum and all again. But he's actually got a point that totally killed their whole drive right there. It did. And they had to settle for the field goal after that."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. And so they're kicking literally a 35-yard field goal from The dirt. The infield dirt. Second base. Not even like it's like shortstop. Shortstop. Yep.",
    "timestamp" : "01:20:09-01:20:19"
  },
  {
    "timestamp" : "01:20:19-01:20:24",
    "speaker" : "Greg",
    "text" : "And uh pro play pro player stadium, more like amateur player stadium."
  },
  {
    "speaker" : "Andy",
    "text" : "And so, Steve Brown, you want to do the honors for your boy?",
    "timestamp" : "01:20:27-01:20:30"
  },
  {
    "timestamp" : "01:20:31-01:20:46",
    "speaker" : "Steve",
    "text" : "Yeah, Richard Seymour. All 6'6 of him, Greg, because he's super tall, not like Vince Wilfork, uh that blocks the kick. Gets his big mitts on it. We've already got down how many kicks he has lost, and he doesn't have as many as Julius Peppers. Maybe that's a good comp. Is that a better comp for you, Greg?"
  },
  {
    "timestamp" : "01:20:47-01:20:51",
    "speaker" : "Greg",
    "text" : "Yes, that's a very good comp, actually. Julius Peppers is a better comp. Yeah."
  },
  {
    "timestamp" : "01:20:51-01:20:55",
    "speaker" : "Steve",
    "text" : "Um gets a big old lich on it because he plays out of his gourd this whole game."
  },
  {
    "timestamp" : "01:20:56-01:21:06",
    "speaker" : "Greg",
    "text" : "And he just pushed him like along the dirt too. Yeah. On the dirt, you can just see the guys like feet like moving back like a cartoon."
  },
  {
    "text" : "So they get like a good like probably two or three yard push back into it.",
    "timestamp" : "01:21:08-01:21:12",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Which definitely has to do with the dirt. Yeah. Oh yeah. And they asked see more about it after the game. Is that like about the dirt and everything? And he just says, go Marlins.",
    "timestamp" : "01:21:12-01:21:23"
  },
  {
    "text" : "Oh, that's awesome. That's amazing. What a f that that's badass. Yeah. That's a mic drop moment right there.",
    "timestamp" : "01:21:27-01:21:33",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:21:33-01:21:39",
    "speaker" : "Steve",
    "text" : "Well the thing is crazy. Maybe they don't win this game if the Marlins don't advance to the World Series. That's what I'm saying."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:21:39-01:21:39",
    "text" : "That's right."
  },
  {
    "speaker" : "Steve",
    "text" : "Because that field goal maybe doesn't get blocked.",
    "timestamp" : "01:21:40-01:21:41"
  },
  {
    "text" : "Yeah, fuck the Yankees. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:21:42-01:21:43"
  },
  {
    "text" : "That's right. Yeah. Marlins pulled it out too. So bring it uh, but that whole drive, um It was 18 plays, nine minutes. Uh also the Patriots used their three timeouts on it. Yeah. On that drive. So they now have the ball. Or maybe two out of the three. Something like that, yeah. So so they're now Uh two minutes and they're you know just trying to I think they it seemed like they're just trying to get a field goal range. First play, Brady hits Branch for 20 yards. Um, so they're at about midfield, just inside midfield, and uh then all of a sudden they go super conservative and just try to start like running the ball with no timeouts left. And they end up going backwards. Like Kevin Falk gets taken down for like a five-yard loss or something, trying to do an out.",
    "timestamp" : "01:21:44-01:22:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:22:31-01:22:45",
    "text" : "It was the old Pages play that took him out, uh, the old defensive back. Buckley. Oh, uh Buckley. Yeah, he had a he had like a they muffed a pump that Buckley picked up as well for them, and he had a stop on this player. Just blew the corner and got the water."
  },
  {
    "timestamp" : "01:22:45-01:22:48",
    "speaker" : "Andy",
    "text" : "So was this pitch before Buckley was on the Patriots or after?"
  },
  {
    "speaker" : "Steve",
    "text" : "After. I think it's after. We had Buckley last year. That's what I thought.",
    "timestamp" : "01:22:48-01:22:52"
  },
  {
    "text" : "Yeah, because he was part of that Super Bowl team, right?",
    "speaker" : "Andy",
    "timestamp" : "01:22:52-01:22:53"
  },
  {
    "text" : "This is the Terrence Buckley or revenge game.",
    "speaker" : "Steve",
    "timestamp" : "01:22:54-01:22:55"
  },
  {
    "timestamp" : "01:22:56-01:23:13",
    "speaker" : "Andy",
    "text" : "So I wrote, yeah, I wrote uh my notes for Terrell, Terrell Buckley was at two brutal. So yeah, so but the Patriots like literally like not trying to go for a touchdown. It wasn't like crosswords. That was for you. I knew you'd like that. Uh more hate, and I was uh flexing my words."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:23:13-01:23:35",
    "text" : "That was uh that was really conservative though. And I that's another thing that drives me crazy about Belichick is Sometimes late in games, uh, it happens all the time where you're like, what the fuck is going on? It just doesn't make sense. Or you're like, you're huddling. Where there's a minute left and you're on it's like first down, you're like on this the edge of field goal range."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:23:36-01:23:49",
    "text" : "You know where else you were saying that. All you need is all you need is five yards. You know what else you were saying? I know, but why not hurry up? Call the right play. You know what else you're saying that, Greg? Was the fucking Seattle Super Bowl when you're saying, why isn't he taking a timeout? Yep."
  },
  {
    "timestamp" : "01:23:49-01:24:00",
    "speaker" : "Greg",
    "text" : "Yeah, exactly. And I still don't know why. Like it were, it worked out because of a crazy play, but There's so many times where you're that's a good example, Steve."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:24:00-01:24:05",
    "text" : "I'm just like if they had a timeout, they wouldn't have called that play. Mm-hmm."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I don't know.",
    "timestamp" : "01:24:06-01:24:07"
  },
  {
    "text" : "I don't know.",
    "speaker" : "Andy",
    "timestamp" : "01:24:07-01:24:07"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:24:08-01:24:11",
    "text" : "Was it Garrel to get a point? Garrel's expecting him to call that timeout."
  },
  {
    "timestamp" : "01:24:12-01:24:24",
    "text" : "Yeah, wasn't it that he saw that like The Seattle uh sideline was like discombobulated. She was like, they know what they're gonna do. I'm not calling it. I'm not gonna let them fix this. I guess what happened? I'm not gonna bail them out.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:24:24-01:24:34",
    "speaker" : "Greg",
    "text" : "Yeah, but for every one of those is one like this. Sure, but where they don't they huddle, they take their time. What about fourth? And they're like in field goal range and then they're"
  },
  {
    "timestamp" : "01:24:34-01:24:50",
    "speaker" : "Steve",
    "text" : "I'll that being here and where I wrote my note, give it a fucking rest, Deirdorf. Jesus fucking Christ. Because He you beleaguer a point like this, Greg. Good God. He brought that up at least five fucking he brought it up in overtime."
  },
  {
    "timestamp" : "01:24:50-01:24:52",
    "speaker" : "Andy",
    "text" : "He was on it for a good ten minutes."
  },
  {
    "timestamp" : "01:24:52-01:24:56",
    "speaker" : "Steve",
    "text" : "He brought it up in overtime. It was ridiculous. Let's get to the coin flip."
  },
  {
    "timestamp" : "01:24:56-01:24:58",
    "speaker" : "Greg",
    "text" : "Especially because I stand with Dan."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh Lord.",
    "timestamp" : "01:25:00-01:25:01"
  },
  {
    "speaker" : "Greg",
    "text" : "I know how to piss you off anything. Greg's off the podcast.",
    "timestamp" : "01:25:02-01:25:06"
  },
  {
    "speaker" : "Andy",
    "text" : "So it's been nice having you on here. I don't know if you know this is your this is your last episode. I'm getting you a shirt for Christmas that says I stand with Dan. I'm not coming to Christmas. Just in case.",
    "timestamp" : "01:25:06-01:25:21"
  },
  {
    "timestamp" : "01:25:25-01:25:27",
    "text" : "Andy, thanks for being such a big fan.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:25:29-01:25:49",
    "text" : "Alright, that'd be pretty cool. I wonder if he's on cameo. That'd be funny. He's not. Bob Sosi is though. And he donates all his money to uh to charity. Good for him. All right, so yeah, so the Patriots basically try to get in field goal range and don't, and then like basically don't have a timeout, so they just like can't run a play and Belichick's pissed.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:25:49-01:25:58",
    "text" : "'cause they can't go feel it. It went from 150 135 on the Miami 45 to ending on the Miami 50.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:25:58-01:26:23",
    "text" : "Yeah. As time ticked off and they couldn't get a last play call or anything. stupid um so to over time we go uh so they do they have the coin toss and i have the audio for the coin toss which i think we need to play Just because this was written about the day after, which I'll here is the audio of what I've done. Why? A coin toss? What could be controversial."
  },
  {
    "speaker" : "Speaker 5",
    "text" : "That was 100 wrongs. You're wrong.",
    "timestamp" : "01:26:38-01:26:43"
  },
  {
    "timestamp" : "01:26:47-01:27:08",
    "text" : "So Brady's pointing at the Dolphins players saying, damn it, you you know it. Yeah. And then somebody else in the background, I believe it was, I believe it was Izo. was uh say his fucking heads which is why you probably shouldn't have a live mic at this point but you can see from the dolphins player's body language the Patriots are right",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:27:08-01:27:25",
    "text" : "Yeah. Cause he's not like, nah, bullshit. He's just like, you know, like, yeah. I'll get in the middle of it. Like for you guys. And then they referenced the um other coin flip controversy. Yeah, I couldn't figure out what that was.",
    "speaker" : "Steve"
  },
  {
    "text" : "I vaguely remember, but I couldn't I couldn't find it in Google.",
    "timestamp" : "01:27:25-01:27:28",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:27:28-01:27:50",
    "text" : "I remember what it was. 99 Thanksgiving Day game. 98, but you're close, guys. I don't know if you can Bring it up. I found a YouTube video of it. Because I don't really remember this. I just remember the vague. Oh, I remember I Googled Jerome Betts. Thanksgiving. All right, Jerome Bret's coin toss."
  },
  {
    "text" : "Using fourth quarter timing rules. Each team receives two timeouts. The first team to score wins the game. We'll have a toss to determine who receives, who will call it from Pittsburgh. Number thirty-six, heads, tails, tails, heads. Collie plays in the air. Heads is the call. He said heads is it tails? Oh I believe he said tails. He did.",
    "timestamp" : "01:27:50-01:28:15",
    "speaker" : "Speaker 8"
  },
  {
    "timestamp" : "01:28:16-01:28:25",
    "speaker" : "Speaker 5",
    "text" : "You want to take the ball? Look at Jerome Metz, he's turned what's going on? Are you changing? You changing the heck? Which way? Which way you grab"
  },
  {
    "timestamp" : "01:28:28-01:29:10",
    "speaker" : "Greg",
    "text" : "God damn. That one's even worse. No, that one's no, that one they they've looked into that. And what he did is he said, Tails. So the they're supposed to take the first call. You can't change your call. So when he said started saying heads Yeah. The the ref had to take that. And they like uh Detroit radio like slowed down the audio and like had brought in an audio expert. And they say you could clearly tell that he said heads. And then there was also like someone had a mic on like a coach that picked up him saying to Cower I st I started saying heads, but I changed the tails like halfway through saying it."
  },
  {
    "speaker" : "Andy",
    "text" : "So Venice is being a preck there, obviously. But that's now why they make you call it before they even do the flip.",
    "timestamp" : "01:29:10-01:29:17"
  },
  {
    "speaker" : "Steve",
    "text" : "Because ref was fucking wrong, was a bitch about it, refused to like say it. And you can tell.",
    "timestamp" : "01:29:18-01:29:24"
  },
  {
    "timestamp" : "01:29:25-01:29:29",
    "speaker" : "Greg",
    "text" : "But he's in a weird spot though, right? Because what does he do? He can't just be like"
  },
  {
    "timestamp" : "01:29:29-01:29:31",
    "speaker" : "Steve",
    "text" : "Well you know what the problem is? I don't know."
  },
  {
    "text" : "Let's flip it again. I don't you know, like that's what my immediate reaction would be, is like, uh I might have fucked that up. I don't know. Let's flip again. But then you're gonna piss off all the Dolph Miami and then they're gonna start going fucking crazy.",
    "timestamp" : "01:29:31-01:29:44",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:29:44-01:29:55",
    "speaker" : "Steve",
    "text" : "So here's the thing. The problem is They don't use a fucking quarter with heads and tails. This is the NFL commemorative coin. This side is heads and this side is tails."
  },
  {
    "text" : "The football is heads and the NFL logo is Everyone looks at it the other way around fucking the heads of a quarter.",
    "timestamp" : "01:29:56-01:30:01",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "It's heads. It has a head on it.",
    "timestamp" : "01:30:01-01:30:03"
  },
  {
    "timestamp" : "01:30:03-01:30:09",
    "text" : "You're a hundred percent right, Steve. You're getting too cute with a fucking coin toss. Just do heads and tails.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:30:09-01:30:12",
    "text" : "Thank you. Even make a bigger quarter if it's hard to flip, you bitch."
  },
  {
    "speaker" : "Andy",
    "text" : "Well, we've talked about this already. We shouldn't even be doing a coin flip. We should be doing uh like a what do we decide? Uh the exit. A sumo wrestling? No, no, it was a coach. Yeah, your heaviest coach is uh you do a sumo wrestling. Whoever pushes the other person back to the other teams 45.",
    "timestamp" : "01:30:12-01:30:30"
  },
  {
    "text" : "I think we also said that it might be the ugliest coach or the dumbest coach, and then Eli Manning would get a huge contract to be a coach.",
    "timestamp" : "01:30:30-01:30:36",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Speaker 5",
    "text" : "It was something about Eli Manning.",
    "timestamp" : "01:30:37-01:30:38"
  },
  {
    "speaker" : "Greg",
    "text" : "He simultaneously gets hired by every team in the NFL.",
    "timestamp" : "01:30:41-01:30:44"
  },
  {
    "timestamp" : "01:30:46-01:30:50",
    "text" : "No, take our money, Eli. You have the dumbest face of all time.",
    "speaker" : "Speaker 5"
  },
  {
    "timestamp" : "01:30:50-01:31:20",
    "text" : "You can never have a Oh my goodness. So yes, after uh Miami quote unquote you know air quotes wins the coin toss, uh there's another uh controversial play where Fiedler quote unquote air quotes hits the deep shot to some no-name guy who apparently got paid a shit ton of money and has seven catches on the season. Nice catch. It was a good catch. Good catch. But he stepped out of Browns once. Yeah. Maybe twice. Definitely twice.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Um and of course it's on the fucking infield, so you can't see anything. Yeah. The stupid fucking infield on a football field. Yeah.",
    "timestamp" : "01:31:20-01:31:28"
  },
  {
    "speaker" : "Andy",
    "text" : "Also, also, they didn't paint the lines of the fucking gravel. They didn't paint them on though this game either because World Series, they didn't want to have the lines showing up for the for the baseball game, so they were chalk lines instead. No. Yeah. Wow. Even worse. Yeah. So so maybe he stepped on the truck. We don't know. You can see the truck get kicked up. Yeah. And uh it's not something Belichick could have challenged because he probably would have because it's Belichick and that's what he does. But because it's overtime, all reviews come from the booth, and the Dolphins ran up and just ran a quick play. And the booth didn't get to it in time, so the play stood.",
    "timestamp" : "01:31:28-01:32:10"
  },
  {
    "speaker" : "Steve",
    "text" : "Even worse, that quick play was like a 10-yard uh Ricky Williams run.",
    "timestamp" : "01:32:10-01:32:14"
  },
  {
    "text" : "Uh yeah, and I believe there was uh actually a penalty for Patriots having too many men on the field on that play too. On top of all of it, which they declined because they got a 10-yard run out of it Um so again, just like in the fourth quarter, Miami drives straight to New England 17.",
    "timestamp" : "01:32:15-01:32:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And then the Ricky Williams went run for 10, run for 13. So they went past a 31. So they get the ball. Incomplete. 31-yard passage shouldn't have counted. 10-yard quick snap to Ricky Williams. 13-yard run for Ricky Williams. They're sitting first and 10 on the Patriots 33. And Belichick's like timeout. It's like basketball. Like no, no, no.",
    "timestamp" : "01:32:33-01:32:52"
  },
  {
    "text" : "Exactly. Slow the roll. And uh but then but then what comes up the the main point of emphasis for the week was what was it, Steve?",
    "speaker" : "Andy",
    "timestamp" : "01:32:53-01:33:01"
  },
  {
    "speaker" : "Steve",
    "text" : "Well here's the thing. Also, bad coaching and in it maybe even like coaching within the rules of the game of the time where a field goal wins it and I think the overtime rules have changed this they go one yard Ricky Williams run two yard Ricky Williams run kick the field goal on third down I think nowadays no one's kicking that field goal and third down and going so conservative, like let me just stuff Ricky Williams in the middle and we'll kick the field goal and get out of here because The other team gets a chance, right? There's so much more incentive to get the touchdown there to be a little more aggressive. I didn't realize they kicked it on third down.",
    "timestamp" : "01:33:01-01:33:33"
  },
  {
    "speaker" : "Greg",
    "text" : "They used to do that because the",
    "timestamp" : "01:33:34-01:33:36"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:33:36-01:33:39",
    "text" : "Justin case is a bad snap or a bad hold. You can just eat it."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:33:39-01:33:39"
  },
  {
    "timestamp" : "01:33:39-01:33:45",
    "speaker" : "Steve",
    "text" : "Dan Deerdorf was all about it, Indy. How'd you miss that? He was like, what a great call, kicking it on third down. Oh, I fucking tuned him out by this point."
  },
  {
    "speaker" : "Andy",
    "text" : "You kidding me? Four hours of Dan Deerdorf? Killing you. Yeah. Uh so yeah, so uh they line up for basically the exact same field goal as before. Off the dirt, same end of the field. Yep, from uh the shortstop. And this was uh this one was not blocked, but it was push wide right.",
    "timestamp" : "01:33:45-01:34:09"
  },
  {
    "timestamp" : "01:34:10-01:34:11",
    "speaker" : "Greg",
    "text" : "Was it even push?"
  },
  {
    "speaker" : "Steve",
    "text" : "It was bad, it wasn't even that close.",
    "timestamp" : "01:34:11-01:34:13"
  },
  {
    "text" : "Was it it look I only saw the primetime highlights it looked like it was high One of those ones that goes over the whole it wasn't even close.",
    "speaker" : "Greg",
    "timestamp" : "01:34:13-01:34:23"
  },
  {
    "text" : "No, no, it was like when it came off his foot, it looked like it was straight down the middle, but then it just like kept drifting, kept drifting.",
    "speaker" : "Andy",
    "timestamp" : "01:34:24-01:34:29"
  },
  {
    "timestamp" : "01:34:29-01:34:35",
    "text" : "He did it pretty straight, but he definitely just pushed it. He just started it way right and it just pushed it.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "And was it because he was on the dirt? Was it because he was on the dirt? Uh Dan Deardoff was all about, oh well, he missed his first one, so that just gets in his head. So",
    "timestamp" : "01:34:35-01:34:44"
  },
  {
    "timestamp" : "01:34:44-01:34:52",
    "text" : "Well I actually thought that because I mean I I didn't I saw just the highlights and it looked like uh after the game.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:34:52-01:34:56",
    "speaker" : "Steve",
    "text" : "Okay, let's save this for after the game. For the post-game show."
  },
  {
    "text" : "Okay. Sure. Because they get into it. So uh then you know we we kind of know how this game ends. I'm like, all right, here it comes. Here comes Brady's touchdown. New England drives to midfield and Brady gets tripsacked on third down by Jason Taylor. And the Patriots punt.",
    "speaker" : "Andy",
    "timestamp" : "01:34:57-01:35:12"
  },
  {
    "text" : "Because that could have been a disaster play. Yeah, yeah.",
    "timestamp" : "01:35:23-01:35:26",
    "speaker" : "Steve"
  },
  {
    "text" : "This is my other trivia. Who has the most sacks of Brady, or let's just say the Patriots, since 2001.",
    "timestamp" : "01:35:26-01:35:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I told one of Bill's fans and he's like, you mean no show showable?",
    "timestamp" : "01:35:42-01:35:46"
  },
  {
    "speaker" : "Greg",
    "text" : "That's right. Aaron Schobel.",
    "timestamp" : "01:35:46-01:35:48"
  },
  {
    "timestamp" : "01:35:48-01:35:51",
    "speaker" : "Steve",
    "text" : "Is he tops? Aaron Schoble, 14."
  },
  {
    "speaker" : "Greg",
    "text" : "Jason Taylor, 12 and a half.",
    "timestamp" : "01:35:52-01:35:54"
  },
  {
    "speaker" : "Steve",
    "text" : "White Franey's gotta be up there.",
    "timestamp" : "01:35:54-01:35:56"
  },
  {
    "timestamp" : "01:35:56-01:35:56",
    "speaker" : "Greg",
    "text" : "No."
  },
  {
    "speaker" : "Steve",
    "text" : "Really? Greyhead is on the list. Maybe.",
    "timestamp" : "01:35:56-01:36:00"
  },
  {
    "text" : "So there's three more within the division. One of them played on Pittsburgh as well. Pittsburgh in Miami.",
    "timestamp" : "01:36:00-01:36:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:36:11-01:36:13",
    "text" : "Oh uh Joey Porter?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yep. One is a more recent Miami player that has a lot of Jason Taylor in him.",
    "timestamp" : "01:36:14-01:36:19"
  },
  {
    "text" : "Oh, I know who he is, but I can't think of his name. The edge rusher who played for like a long time.",
    "timestamp" : "01:36:19-01:36:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:36:25-01:36:26",
    "text" : "Cameron Wake."
  },
  {
    "speaker" : "Andy",
    "text" : "That's a week.",
    "timestamp" : "01:36:26-01:36:27"
  },
  {
    "text" : "Sean Ellis is actually third with 12.",
    "timestamp" : "01:36:29-01:36:31",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:36:31-01:36:32",
    "text" : "Really um."
  },
  {
    "text" : "And then the first non-divisional player is Von Miller with seven and a half.",
    "timestamp" : "01:36:32-01:36:37",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:36:38-01:36:39",
    "speaker" : "Andy",
    "text" : "That's that makes sense."
  },
  {
    "timestamp" : "01:36:40-01:36:47",
    "speaker" : "Steve",
    "text" : "Where are the the Colts guys? So I feel like the Colts were like Dwight Freeni was as game plan as much as all those guys, if not more, right?"
  },
  {
    "timestamp" : "01:36:48-01:36:56",
    "speaker" : "Greg",
    "text" : "It's just divisional. You get two chances a year, right? Right, exactly. Where's White Free on the list though? I don't know. I only wrote down those ones."
  },
  {
    "timestamp" : "01:36:57-01:36:59",
    "speaker" : "Steve",
    "text" : "Oh right, because you're handwriting your notes so you don't really."
  },
  {
    "timestamp" : "01:37:00-01:37:01",
    "text" : "I think we talked about it a while ago.",
    "speaker" : "Andy"
  },
  {
    "text" : "Cool, cool. You got it. All right. Back in the day. So Taylor gets a near sack and near strip fumble, and Brady gets it back.",
    "speaker" : "Steve",
    "timestamp" : "01:37:01-01:37:10"
  },
  {
    "timestamp" : "01:37:11-01:37:28",
    "text" : "So the Pats punt uh Miami drives to midfield, give or take. And then we have Teddy Bruski doing his best junior Seo impression, who junior Seo the Miami Dolphin in 2003, which I completely forgot about that phase of his career. Yeah, so did I. Completely forgot he was a dolphin.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:37:28-01:37:35",
    "text" : "Yeah, this is his first season in Miami. Yep. I don't know how long he was there, but changing the culture. Of that defense.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Um, but yeah, so he's so Bruski does his best.",
    "timestamp" : "01:37:35-01:37:38"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:37:38-01:37:42",
    "text" : "Uh hey, he won't be another shot at a Super Bowl."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:37:42-01:37:51",
    "text" : "When he signed with Miami? Woof. Stop Greg. He was three years in Miami, four years in New England."
  },
  {
    "timestamp" : "01:37:53-01:37:56",
    "text" : "Nope, leave that one in. That one in. That one in.",
    "speaker" : "Speaker 5"
  },
  {
    "text" : "So yes, he does his best junior say our impression of like running up like right between center guard and like hopping there before the snap and get it and like timing it just right. comes in untouched on Fiedler who uh Fiedler his roof uh away from feed fiedles his way away from uh From the sack, rolls out to his right and chucks a bomb into double coverage and gets picked off by Tyrone Pohl. Steve's boy, uh Deerdorf loved it.",
    "timestamp" : "01:37:57-01:38:29",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:38:29-01:39:13",
    "speaker" : "Steve",
    "text" : "Loved it. Before we get too far off Seao. Basically a punt. Yeah, go ahead. Yeah, because we'll talk about that. I will touch on that because that was also terrible. But 2003, he signs the Dolphins for three years and then does four years of the pass, where he actually plays more games to the Dolphins, has more sacks to the Dolphins, has more tackles with the Dolphins. Yep. Do you think Sayao I mean, if he'd signed with the Patriots in 2003, think about that. Yeah. That would have been because he played the charges up until that point. Where so Rodney Harrison and Sayo left From the Chargers in that same offseason, we got Harrison, Golfins got Sayo."
  },
  {
    "text" : "Right. What happens if we got in Seo? That would have been basically the same except saying that.",
    "timestamp" : "01:39:13-01:39:18",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:39:18-01:39:23",
    "speaker" : "Steve",
    "text" : "Yeah, actually, actually, do you think we'll we'll be better getting I mean Rodney's been showing up big too."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Rodney's setting the tone for this defense.",
    "timestamp" : "01:39:23-01:39:26"
  },
  {
    "timestamp" : "01:39:26-01:39:34",
    "text" : "And I think the Chargers sucked that here too, 2003, right? They have to. I mean, those are the two like the Drew Brees must be gone too.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:39:34-01:39:50",
    "text" : "No, I think he's still there. I think Breeze is still there this year. And LT is still lighting it up. Yeah, Lt was definitely there. But I think the yeah boy on Dan Deerdorf. Fuck about the Chargers. Hate on him."
  },
  {
    "timestamp" : "01:39:50-01:40:06",
    "text" : "He was he had a bit hard on the playout. Jay Fiedler. Has uh well they'd have been talking about his running ability all all game and he has like one five-yard breakdown that Dan Deuter fucking loved. Play break. That won't show up on the stat sheet.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:40:07-01:40:13",
    "text" : "Yeah. It'll show up as a five-yard run, but it was so much more than that. Didn't throw an incompletion."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but he has he has that one you know just man-to-man defense and you get five yards out of it, cool on third and five or some shit too. So it didn't even fucking matter.",
    "timestamp" : "01:40:13-01:40:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:40:23-01:40:25",
    "text" : "It was, it was like second and five. Yeah."
  },
  {
    "timestamp" : "01:40:25-01:41:10",
    "text" : "And sadly got five yards. Vieler actually makes a decent play where he's sort of getting sacked and like gets out of it, gets on the run out the out the out the tackle box, kind of all alone. Maybe could have gotten the first down, but instead just zings it down to the 20-yard line, red zone-ish, just taking a shot, but he's on the run and he's Jay Feeler. He doesn't have a big arm, so way short. Easy interception from Tyrone Poole. And like Deodorce's reaction is like, wow, what a great play. That's the same as a chunt. That's a great decision. They're gonna bunt it anyways on fourth down. You might you might get the pass interference. That would be cool. It's like Or you might have got the first down and kept the drive going and winning overtime.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:41:10-01:41:14",
    "text" : "So my notes for Jay Fiedler, uh, I have nothing to say about him good or bad.",
    "speaker" : "Andy"
  },
  {
    "text" : "He's yes. He's fine. And they even gave him the backhanded compliment of he's a game manager. And then he made like one good throw. He found a mismatch on the tight end on Rodney Harrison, Randy McMichael, who actually was really good in this game. Yeah. And he's like, well, does that look like a game manager to you? And it's like, well, yeah, he found the one mismatch in the fourth quarter. It took him all game. He found it up and he's explaining it. Good work.",
    "timestamp" : "01:41:14-01:41:36",
    "speaker" : "Steve"
  },
  {
    "text" : "I believe the quote was, there's something to say for a guy who won't lose you the game.",
    "speaker" : "Andy",
    "timestamp" : "01:41:37-01:41:41"
  },
  {
    "text" : "Yeah. Ultimate back end is right.",
    "speaker" : "Steve",
    "timestamp" : "01:41:42-01:41:45"
  },
  {
    "speaker" : "Greg",
    "text" : "It's a Beljack guy. No. Oh wait, I just do your job.",
    "timestamp" : "01:41:46-01:41:53"
  },
  {
    "speaker" : "Steve",
    "text" : "No, Belcheck is not gonna give a backhanded compliment.",
    "timestamp" : "01:41:53-01:41:56"
  },
  {
    "text" : "Just don't lose the game.",
    "speaker" : "Greg",
    "timestamp" : "01:41:56-01:41:57"
  },
  {
    "speaker" : "Steve",
    "text" : "Well that dressing that dress means he was a whole lot less fat. I see what you're saying.",
    "timestamp" : "01:41:57-01:42:03"
  },
  {
    "timestamp" : "01:42:04-01:42:05",
    "text" : "Thank you.",
    "speaker" : "Greg"
  },
  {
    "text" : "Uh I'm not gonna say Jay Fiedler is a Belichick guy. Just because he's a good one.",
    "timestamp" : "01:42:05-01:42:11",
    "speaker" : "Andy"
  },
  {
    "text" : "No, no, no. I'm saying I know you compare you to the body. I think Belichick would like Feedler. I think you're talking about Dan Deerdorf's like you're not gonna lose the game to Bill Belichick. Fiedler and Belichick, they probably could have been okay.",
    "speaker" : "Steve",
    "timestamp" : "01:42:12-01:42:25"
  },
  {
    "timestamp" : "01:42:26-01:42:28",
    "speaker" : "Greg",
    "text" : "Yeah. A game manager. Yeah."
  },
  {
    "text" : "So we have an campaign. Don't fuck up. Sippy fucks up. As good as my note is as good as a punt, get fucked, Deirdorf. Told you.",
    "timestamp" : "01:42:28-01:42:38",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "But there's one more play left in this game.",
    "timestamp" : "01:42:38-01:42:40"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:42:40-01:42:40",
    "text" : "One yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Wants to do the honors.",
    "timestamp" : "01:42:40-01:42:41"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:42:42-01:42:46",
    "text" : "That's the real part is like get fucked your door. Because Tom Brady is probably thinking the same thing. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Well, this was I mean, I don't even think we have to describe it. I think everybody remembers this. Brady drops back. And I think this point the dolphins are kind of gassed. But there was a quote from Uh Zach Thomas about this after the game. Thomas said that he sensed the defense let down after Lindo Mari's field goal attempt was blocked in the fourth quarter and he missed one in overtime. Quote, if it's an easy field goal, guys think you're going to make it, and then you don't, and then you're rattled already, Thomas said. You can't let stuff like that happen. I'm not blaming anything on the field goal. I'm saying we, the defense, can't let that happen",
    "timestamp" : "01:42:47-01:43:25"
  },
  {
    "timestamp" : "01:43:25-01:43:49",
    "speaker" : "Steve",
    "text" : "That's fair. I mean I can I get where he's coming from. Like everyone's done their job. They got to the easy chippy field goal. They're kicking on third down. Like that's like a sign like it's in the bag, sort of thing. Even if like What's worse it can happen? Like a bad snap will we have we have another down for that? And like then oh shit get back out there, but still. I always like Zach Thomas. So that's a good to take accountability for it. W They should have got back up is what he's saying. But that's the thing."
  },
  {
    "timestamp" : "01:43:49-01:43:55",
    "text" : "I'm not blaming on the on the field goal. He is though. He's like after the field goal, we just kind of gave up because we thought it was over.",
    "speaker" : "Andy"
  },
  {
    "text" : "That's fair.",
    "timestamp" : "01:43:56-01:43:56",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:43:56-01:43:58",
    "text" : "Well he thought it was over, yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:43:58-01:44:15",
    "text" : "Yeah, but it wasn't. Yeah. Imagine him in uh Atlanta in that Super Bowl. And he definitely would have fucking gave up. You know who didn't give up? Hightower. Uh yeah, that that pass is sick because like Troy Brown was like his third or fourth read for sure. You can see it in the highlight."
  },
  {
    "text" : "I mean think about when's the last time you've seen Troy Brown running a deep route like that.",
    "speaker" : "Andy",
    "timestamp" : "01:44:16-01:44:20"
  },
  {
    "timestamp" : "01:44:20-01:44:53",
    "text" : "Yeah, that's not his style. That's gonna be Troy Brown's longest touchdown, I would think. Pump fakes once, looks left, looks down, and gives point Troy a little point like go, and then just bombs it. Troy high steps out of the tackle from the safety, splits the fucking safety cornerback. And Troy is not fast. It's like not his thing. Love it. And they show the replay and the coverage. Troy just fast on punt returns. That's the best part. Troy outran his dude and he's returning punts. And he's fucking covering kicks. And he's fucking playing special teams, you know?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:44:53-01:44:53"
  },
  {
    "text" : "He'll play defense if you need him to. And then come fourth quarter, five minutes left in OT. There's already been ten minutes in the Miami Heat all game. Troy Brown is out there fucking running go-roots, balls for the wall every time when the Miami defense is not. Correct.",
    "timestamp" : "01:44:53-01:45:09",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Love it. That throw is ridiculous from Brady, though. That's the other part. On a bad shoulder. He's like going to his left too. So he's like he's on the dirt. He like takes a snap at second base. Starts doing the fucking infield shift. And he's like on that border and he just like kind of across his body. I mean he's not allowed to rush on him, but he just homs it up there. That ball's in the air for at least sixty yards, right?",
    "timestamp" : "01:45:09-01:45:37"
  },
  {
    "text" : "Yeah, he doesn't really step into it either. He throws it from the 15. No, closer to the 10. And Brown catches it on the 30 of the Dolphin. 70 yards in the air.",
    "timestamp" : "01:45:37-01:45:48",
    "speaker" : "Steve"
  },
  {
    "text" : "And in his hip pocket, like completely in stride.",
    "speaker" : "Greg",
    "timestamp" : "01:45:49-01:45:52"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:45:53-01:45:53",
    "speaker" : "Steve"
  },
  {
    "text" : "To a guy that's like not, I mean, he had separation too. So the other part was like just not a burner, you know.",
    "timestamp" : "01:45:54-01:46:00",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "No, Brady's pumping though like neutralizes the rush because when he pumps, the entire left side of the line jumps up to try and block it. And now they stop rushing, reset it. So I can roll a little left and just unquirk the bomb. Yep. We need Cam to start doing that.",
    "timestamp" : "01:46:00-01:46:14"
  },
  {
    "speaker" : "Andy",
    "text" : "And then I don't know if you guys caught this, but I put it on the the website just because it's such a good highlight. This is Bill Belichick's reaction to the win.",
    "timestamp" : "01:46:15-01:46:25"
  },
  {
    "timestamp" : "01:46:26-01:46:31",
    "text" : "Always responsible. It's making sure the headset doesn't come crashing down on somebody's head because he just throws it like a million feet in the air.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:46:32-01:46:44",
    "speaker" : "Andy",
    "text" : "Yeah, but just like he's getting into the scrum as well. Yeah, just pure unadulterated. Stoked. Like looks like a small child getting out of school like last day of school."
  },
  {
    "speaker" : "Steve",
    "text" : "Like throwing shit in the air and just running outside in the snow day. Yes. You know, it's kind of like it's kind of like Bruski on that pick six Snow Day thing. It's very similar actually.",
    "timestamp" : "01:46:44-01:46:56"
  },
  {
    "timestamp" : "01:46:56-01:47:00",
    "speaker" : "Andy",
    "text" : "Guess who that's against? Dolphins. These Miami Dolphins."
  },
  {
    "speaker" : "Steve",
    "text" : "Love that.",
    "timestamp" : "01:47:01-01:47:02"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:47:02-01:47:16",
    "text" : "So yeah, that was all she wrote. Patriots walk off with a touchdown. 1913, New England Patriots breaking the 0-13 streak. This also brings Bill Belichick."
  },
  {
    "text" : "Chris Berman said, the streak is over. And he said, hey buddy, it's just beginning.",
    "speaker" : "Greg",
    "timestamp" : "01:47:16-01:47:21"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh one streak that did continue is Bill Belchak's overtime win streak is now up to seven after this. He had won six straight before. Who had the longest? I wondered that and I couldn't figure it out by Googling. I don't know. It's a good question.",
    "timestamp" : "01:47:24-01:47:38"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:47:38-01:47:43",
    "text" : "Longest overtime win streak. Stat check? I don't know. I I tried to Google it, I couldn't figure it out."
  },
  {
    "text" : "Well, I was talking to the stat guy, but He's not glued. Um we're two hours into this.",
    "speaker" : "Andy",
    "timestamp" : "01:47:43-01:47:50"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:47:50-01:47:59",
    "text" : "Let's do some best and worst. Wait. I have let me get the post game. Let me get the post game because I have I have things to talk about this and I'll make it quick."
  },
  {
    "text" : "Give me some.",
    "timestamp" : "01:47:58-01:47:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "First was they go they cut to Bonnie Bernstein to interview Brady and he just walks off. Yeah. And goes and like Jason Taylor and then they run all the credits and shit. So I was like, that can't be the end of it. I hope like if I watch all these commercials, I can at least see you the whole way through. So they do, they bring it back and they play his interview and it's classic Brady, you know. Wow, great. You know, coach talked about it. Hi mom, hi dad. Nothing crazy in there. Then they cut to the studio and this is my last thing. Dan Marino is in there. Because he's part of the halftime show at that point. Well, you know, he missed that field goal because he's on the dirt and sometimes in your kicker and you put that plant foot and it slides. And Deion Sanders is like, man, it's his home field. Stop making excuses. Like a weird, awkward pause at the end and then they like go to the next highlight. Yeah. Which it's holy shit. It is your home field, like Have you not been kicking on that in the first five weeks? Do you not kick on that every year? You've been there for a while. It's not like it's new. You've kicked from that spot all the time. You can practice from there if you want. Yeah, practice in the dirt. Yeah. Go to the beach. Kick some field goals on the beach. I love fucking Marino being super homer and then Deion Sanders is shitting. Yeah.",
    "timestamp" : "01:47:59-01:49:11"
  },
  {
    "speaker" : "Andy",
    "text" : "It's like this podcast, me and Greg. Yeah. Awkward styles is included, Reggie.",
    "timestamp" : "01:49:11-01:49:18"
  },
  {
    "text" : "Yep.",
    "speaker" : "Greg",
    "timestamp" : "01:49:18-01:49:19"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:49:20-01:49:23",
    "text" : "All right. Greg, give us your best and worst."
  },
  {
    "speaker" : "Greg",
    "text" : "best was Troy Brown's overall game. One eight for one thirty in a tutty. Damn. Worst is the fucking infield. Just it's just so bush league to have a fucking baseball diamond in the middle of your NFL. football stadium. It's just preposterous.",
    "timestamp" : "01:49:24-01:49:46"
  },
  {
    "text" : "I agree. I've agreed from the beginning. Finally come around to my way of seeing things. No, it's great. It's iconic.",
    "speaker" : "Andy",
    "timestamp" : "01:49:46-01:49:54"
  },
  {
    "timestamp" : "01:49:56-01:50:04",
    "speaker" : "Steve",
    "text" : "There was four stadiums that had NFL like an NFL MLB share at that point. Garbage."
  },
  {
    "speaker" : "Andy",
    "text" : "Fucking garbage.",
    "timestamp" : "01:50:05-01:50:07"
  },
  {
    "timestamp" : "01:50:08-01:50:10",
    "text" : "I guess Oakland's not even existence.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:50:11-01:50:16",
    "text" : "Nope. Alright, Steve, best and worst. Let me go last. All right, fine.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh god. That means this is gonna be like 20 minutes. Turn the lights off when you go. Oh man.",
    "timestamp" : "01:50:17-01:50:29"
  },
  {
    "speaker" : "Andy",
    "text" : "Um let's see. Do I have a best? Oh, I do have a best. Where is it? Um Surprisingly, my best is uh a referee clip. It's by the reverse.",
    "timestamp" : "01:50:30-01:50:43"
  },
  {
    "timestamp" : "01:50:45-01:50:50",
    "text" : "There's no foul on the plate. There's pushing and chubbing. That is not a foul. Timeout.",
    "speaker" : "Speaker 5"
  },
  {
    "timestamp" : "01:50:53-01:51:22",
    "speaker" : "Greg",
    "text" : "Pushing and shovel on a plane. I think they should do that more often. That's where refs need to just be like, even with the the coin toss thing, come out after the game and be like, hey, listen. Like I do a million of those things. You know, give me a break. It's week seven, guys. Like, fuck off. Like, I have some humor about it. That's why everyone loves Tony Romo. Right. Because he just kind of like sees like He makes you be like, yeah, this is stupid."
  },
  {
    "speaker" : "Andy",
    "text" : "What are we doing? You know? Exactly. It's funny. Well we got it. And there's also another one. I think it was actually an overtime. Um where the There was uh an illegal substitution penalty on the Dolphins. Uh and it was uh the player came on after the play had started And then you can see they they cut to Dave Wandstadt, like putting up two fingers. Say you that that makes eleven players. Like it wasn't an extra guy",
    "timestamp" : "01:51:22-01:51:48"
  },
  {
    "text" : "And and the ref like corrects him on the mic. He's like in the middle. He's like, and the 11th He's like, even though the 11 player came on, he came on after the play started. Like talking about the biggest thing.",
    "speaker" : "Steve",
    "timestamp" : "01:51:48-01:52:02"
  },
  {
    "timestamp" : "01:52:03-01:52:04",
    "text" : "He was like super sassy about it.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:52:07-01:52:20",
    "speaker" : "Steve",
    "text" : "Although I have a worst piggyback off your best because after the it was pushing and shoving, Dan Dudor's like, well, I guess you gotta throw a punch to get a flag. After some clearly like unnecessary ropness bullshit."
  },
  {
    "timestamp" : "01:52:20-01:53:03",
    "speaker" : "Andy",
    "text" : "Yeah. Fucking god damn it. All right, so one of my worst is this uh candy corn. This was a good idea to make. Terrible. I just ate another one and it was a mistake. Um but my real worst was the graphic that they showed. Probably around halftime I think, coming back from halftime. And it was uh how many stone crabs were eaten by Dan Deodorf and Dick Enberg. Because apparently that's what they got fed for lunch at halftime. Because they're in Miami and stone grabs. And apparently in 2002, Dan Diedorf ate 25 of them, where Dick Enberg only ate seven. But today the rules were reversed. Deirdorf only had nine and Dick Enbert had 16."
  },
  {
    "text" : "Why do we know the crab counts?",
    "speaker" : "Steve",
    "timestamp" : "01:53:03-01:53:05"
  },
  {
    "text" : "And that led into a whole thing where they threw it down to Bonnie Bernstein Bernstein and she was like Why didn't I get any guys? And then they had like another five minutes of I don't do well in the heat. So what I'm trying to say is my worst is Dan Dorf.",
    "speaker" : "Andy",
    "timestamp" : "01:53:05-01:53:20"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:53:20-01:53:23",
    "text" : "He was really bad in this game. This is the worst game of his I've seen."
  },
  {
    "timestamp" : "01:53:24-01:53:59",
    "speaker" : "Andy",
    "text" : "Oh, one last uh worst was Jay Fiedler on the season. In his last four games. Uh week two, threw for 100. They're like, oh, he he's been a game manager. And this is how they proved it. In week two, he threw for 190 yards in a touchdown, and they won. Week three, 154 yards in a touchdown, where they won. Week five, 167 yards, no touchdowns, and they won. And week six, the week before, this 147 yards, no touchdowns in a win. So that's two touchdowns in four weeks for the game manager."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:53:59-01:54:08",
    "text" : "Yeah, the SPSBN article is questioning whether they should put in uh Greasy. Over Feedler. I mean, yeah. I mean a game."
  },
  {
    "timestamp" : "01:54:09-01:55:07",
    "speaker" : "Steve",
    "text" : "You're four and two twelve or the other. All right, I'll do mine. Okay. Uh just to pile in the stadium for a second. I guess they still had artificial turf on the warning track. Yeah. So like I don't think it was in play. Maybe it was on like Maybe a corner of it, but like too close to one sideline. You're you're now going from regular grass to artificial grass. So there was three play types on that stadium. Right. Woof. Uh and this is probably gonna come up later at some point because I remember being pissed off about this just in general, but the force out rule. Remember like the refs had to judge if that receiver would have come down bounds if they didn't get pushed by the defender. And so sometimes like, yeah, he probably would have came down with the ball, you know, speed probably would have touched, I guess. And sometimes like, no, he got, you know, he was gonna go out of bounds anyways. And it's like an impossible call to make. And eventually they're like, nah, fuck it. Like Right."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:55:07-01:55:13",
    "text" : "Except for this one where it was blatantly obvious he wouldn't have come down. Yeah. But I except Dan Dierdorf swore that he would have."
  },
  {
    "text" : "I just know that that's gonna that dumb rule is gonna rear its head at some point and I'm gonna be pissed about it. I have like a place like Troy Brown has a sweet stiff arm in the first quarter, which was sweet. But my real best best, and I mentioned this way earlier, and we'll bring it back up now. I can't believe you didn't notice this, Andy. This was the first game with the yellow first down line. Every game we've watched to this point has had no here's the yellow line on the screen for the first down.",
    "speaker" : "Steve",
    "timestamp" : "01:55:13-01:55:42"
  },
  {
    "text" : "Really?",
    "timestamp" : "01:55:42-01:55:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:55:43-01:56:34",
    "text" : "Yes. Because that shit of like, did he get there? Did he not? Like how close is he? Like that gives you so much information and you don't even realize it. And it's because I've been watching like both NFL and regular at the same time, you know? So like you see like half the games you watch will have the first down on it and half you don't And then every close gate close one you're like questionable. And the only reason I noticed it was on like the first red zone possession for the Dolphins, they forgot to update it. So like when they went to snap the ball, it was behind them. And I was like I mean first down line big for watching football games and you know what I'm excited for is like however far back those uh NFL replays go. It's every Dan Deerdorf game. You can just watch the snap, the snap, the snap, the snap."
  },
  {
    "timestamp" : "01:56:34-01:56:39",
    "speaker" : "Andy",
    "text" : "That starts in 2009. God."
  },
  {
    "timestamp" : "01:56:40-01:56:45",
    "speaker" : "Steve",
    "text" : "Well hopefully none of them have more commercials because like one game of commercials was plenty."
  },
  {
    "timestamp" : "01:56:45-01:57:11",
    "speaker" : "Andy",
    "text" : "Yeah, I can't promise that. It's hit or miss at this point. But we'll see. So next week, Patriots. Is it a home game or an away game? It's home versus the Browns. I think we all know how it turns out, but we don't know how. Join us next week. on a post-Thanksgiving uh episode of the Pager Sciencey Podcast. See you later. See you later."
  }
]