[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom"
  },
  {
    "timestamp" : "00:22-00:38",
    "speaker" : "Andy",
    "text" : "Welcome back to Pages Dynasty Podcast. We are in the last week of the 2003 regular season. Patriots hosting the Buffalo Bills. And I, your host, Andy Brown, am hosting both my brothers today. Steve, how's it going?"
  },
  {
    "text" : "Good. We're almost on one full year of quarantine.",
    "timestamp" : "00:39-00:42",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh almost exactly, yes. Yeah. Because today is the 11th of March and I think it happened on the 13th.",
    "timestamp" : "00:42-00:49",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "00:50-00:53",
    "speaker" : "Greg",
    "text" : "Well, how do you how do you put a date on it?"
  },
  {
    "speaker" : "Steve",
    "text" : "Well we we predicting we're on record predicting when it would end, right? Yes. Not too far from one year ago and nobody guessed a year.",
    "timestamp" : "00:53-01:05"
  },
  {
    "timestamp" : "01:05-01:30",
    "text" : "Correct. Uh yeah, I think I was the closest and I said September of last year. And me and Greg definitely laughed at you. you yeah yeah all of you and Milo was on at that point too and he he laughed the hardest. Yes. Yeah. Um so I win I guess. No, no business. I just lost less than you guys say. Also with us is Greg Brown. Nice to see you, Greg.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It's great to see you too, Andy. How you doing, bud? Good. Revenge game.",
    "timestamp" : "01:30-01:35"
  },
  {
    "text" : "This is what I'm talking about. We were talking last week with uh our buddy Tarek, who we had on, uh, about how If you were to write this as like a TV show or a movie, people would say this ending is too predictable. Like if this were Friday Night Lights. Yeah. And that team w lost 31-0 to open the season and had like all the stuff go on. And then the last game of the season they played the same team and they won 31-0. It would be like Well you gotta mix that up a bit. That's that's too obvious. It's too Hollywood.",
    "speaker" : "Andy",
    "timestamp" : "01:35-02:10"
  },
  {
    "text" : "That's why this season is somewhat forgettable. Because you just like, oh that's the season we start with the Bills, you know? Then you kind of like throw everything else out there.",
    "timestamp" : "02:10-02:19",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:19-02:20",
    "text" : "That's true. Yeah."
  },
  {
    "text" : "The other big news was the lawyer Molloy trade, but that's also part of week one, you know? Yeah, the cutting of him.",
    "timestamp" : "02:21-02:26",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:26-02:37",
    "text" : "Yep. And the Rodney Harrison replacement. Who I mean I love I love Lloyd Malloy, but it was the correct decision."
  },
  {
    "timestamp" : "02:37-02:39",
    "text" : "Yeah, Rodney balled out.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "He was amazing. Do you have a favorite game? Favorite game from the forgettable O3 season. I don't think it was that forgettable. No, I remember it uh more than I expected to in this.",
    "timestamp" : "02:39-02:54"
  },
  {
    "timestamp" : "02:55-03:00",
    "speaker" : "Steve",
    "text" : "Yeah, but like I didn't really put that Broncos game to the Super Bowl season, yeah?"
  },
  {
    "text" : "True, true",
    "timestamp" : "03:00-03:02",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, there was a lot of games I didn't realize were this year.",
    "speaker" : "Steve",
    "timestamp" : "03:03-03:05"
  },
  {
    "timestamp" : "03:05-03:05",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "Yeah. I thought that would be like next year or something like that, or way later in the dynasty.",
    "timestamp" : "03:05-03:09",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:09-03:13",
    "text" : "Or even the uh the the Dolphins overtime game.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "03:14-03:16",
    "speaker" : "Steve",
    "text" : "Yeah, with the Troy Brown bomb."
  },
  {
    "text" : "Yep.",
    "timestamp" : "03:16-03:17",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "03:18-03:22",
    "speaker" : "Greg",
    "text" : "Colts game. Colts game, right. Willie McGinnis just"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:24-03:31",
    "text" : "Yeah, this has been this has been a hell of a hell of a season. I have a new ranking uh format."
  },
  {
    "timestamp" : "03:32-03:43",
    "speaker" : "Greg",
    "text" : "Since I don't watch the games. Okay. Yeah. So instead of giving however many trophies. Yep. I'm putting them into classifications."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, all right.",
    "timestamp" : "03:43-03:44"
  },
  {
    "timestamp" : "03:44-03:53",
    "speaker" : "Greg",
    "text" : "Do you want to hear my classifications here? I do, I do. Okay. The first and highest classification is called the title game."
  },
  {
    "timestamp" : "03:53-03:54",
    "speaker" : "Steve",
    "text" : "Okay."
  },
  {
    "timestamp" : "03:54-04:01",
    "speaker" : "Greg",
    "text" : "So the criteria being can you describe the game in four words or less? Yes."
  },
  {
    "text" : "So for instance, without the last game you watched, Steven. How would you describe the last game we watched last week?",
    "speaker" : "Andy",
    "timestamp" : "04:01-04:07"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah.",
    "timestamp" : "04:07-04:08"
  },
  {
    "speaker" : "Andy",
    "text" : "I love you, Susie, game. The kissing Susie Colbert, yeah.",
    "timestamp" : "04:09-04:13"
  },
  {
    "speaker" : "Greg",
    "text" : "But you don't remember the game from Correct. You know, like that's what I think is a distinction of so there that actually kind of leads me to my second point. So the next categorization is what I'm calling the thumbnail game. So can you if you put a picture as the thumbnail for like the podcast, could you immediately recognize what game we're talking about just from a still shot?",
    "timestamp" : "04:14-04:39"
  },
  {
    "speaker" : "Andy",
    "text" : "Like the Dolphins game.",
    "timestamp" : "04:40-04:42"
  },
  {
    "timestamp" : "04:43-05:16",
    "text" : "Dolphins game. The intentional safety game. Willie McGuinness game. That's a thumbnail game with him like running down the field pointing up. Yep. Um the next classification, hidden gems, where it's like a great game that's been lost to the sands of time, where it's there's no like one defining play or it's not like a Super Bowl or a You know, you can't just be like, oh yeah, uh Rams Rams second Super Bowl or I would put Panthers Super Bowl. Those are title games.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "2001 um against the Chargers in that Brady's first comeback.",
    "timestamp" : "05:16-05:22"
  },
  {
    "speaker" : "Greg",
    "text" : "That's actually one of the games I hadn't seen.",
    "timestamp" : "05:22-05:24"
  },
  {
    "text" : "Yeah, yeah, yeah.",
    "timestamp" : "05:24-05:25",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, the Chiefs game from last year. That was the gem. That was a great one. Absolutely. Um and then the next classification is business as usual. Nothing remarkable, but so like every Jets game? Yeah, pretty much the majority of the game.",
    "timestamp" : "05:26-05:40",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "05:41-05:43",
    "speaker" : "Steve",
    "text" : "A lot of the Bills games get like that real."
  },
  {
    "speaker" : "Greg",
    "text" : "And then slog fest. That's the last where it's like every Browns game. Yeah. A lot of the losses.",
    "timestamp" : "05:45-05:52"
  },
  {
    "speaker" : "Steve",
    "text" : "Is that five categories or six crack?",
    "timestamp" : "05:53-05:55"
  },
  {
    "timestamp" : "05:56-05:57",
    "text" : "That's five.",
    "speaker" : "Greg"
  },
  {
    "text" : "I feel like with one more and then just put like all losses.",
    "speaker" : "Steve",
    "timestamp" : "05:57-06:02"
  },
  {
    "timestamp" : "06:02-06:03",
    "speaker" : "Andy",
    "text" : "Yeah, one more is losses."
  },
  {
    "speaker" : "Steve",
    "text" : "Losses.",
    "timestamp" : "06:04-06:04"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "06:05-06:05",
    "speaker" : "Andy"
  },
  {
    "text" : "So we can just assign a Lombardi to each different one of those.",
    "speaker" : "Steve",
    "timestamp" : "06:05-06:09"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:10-06:12",
    "text" : "I kind of like this classification now."
  },
  {
    "text" : "Oh yeah.",
    "speaker" : "Steve",
    "timestamp" : "06:12-06:12"
  },
  {
    "timestamp" : "06:13-06:14",
    "speaker" : "Andy",
    "text" : "I think we could use that."
  },
  {
    "text" : "Title game is six Lombardies. Yeah and a thumbnail game is five Lombardies.",
    "speaker" : "Steve",
    "timestamp" : "06:14-06:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it fits. I love it. That's nice. Yeah.",
    "timestamp" : "06:18-06:22"
  },
  {
    "text" : "Which begs the question, what is this game?",
    "timestamp" : "06:24-06:26",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "06:26-06:27",
    "speaker" : "Andy",
    "text" : "I was just gonna ask you that."
  },
  {
    "text" : "How would you I know? It's a tough one to pick because it's not really a thumbnail game. You can't you can't really just take a still shot and be like, yeah, yeah. I mean, maybe like a a picture of it being week seventeen thirty one nothing.",
    "timestamp" : "06:27-06:41",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "That's gonna just gonna clue you, but you can take a picture of the scoreboard. Yeah.",
    "timestamp" : "06:41-06:44"
  },
  {
    "text" : "Mm-hmm It's not really business as usual, because this like stands out as like, oh yeah, that was a pretty unique game and Patriots lawyer.",
    "speaker" : "Greg",
    "timestamp" : "06:44-06:53"
  },
  {
    "text" : "But it's also not really a hidden gem either. Because everybody knows it. Like again, the yeah, the two ends. So the first thirty it's almost a title game. It's almost a title game. Because you could say 31-0.",
    "speaker" : "Andy",
    "timestamp" : "06:53-07:05"
  },
  {
    "text" : "Yeah. Well, if you combine it with the first, with week one Then it's a title game. Because if you like roll all the highlights together, right? It was like, oh yeah, the loss sucked freaking back, and then we won. It was a pretty unique game where the Patriots need to be in the first half. They shit stomped the Bills. Worse than the Bills shit stomped us.",
    "speaker" : "Steve",
    "timestamp" : "07:05-07:25"
  },
  {
    "speaker" : "Andy",
    "text" : "I feel like there needs to be one more classification classification below loss, which is what the week one was. Where it's just like a shit stopping.",
    "timestamp" : "07:26-07:37"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "07:37-07:50",
    "text" : "See see that I almost would classify as a thumbnail game. You think so? Like you can show me a picture of Sam Adams returning an interception in Buffalo, and I'll go, I know exactly what game that is."
  },
  {
    "speaker" : "Andy",
    "text" : "You know, that's probably true because there aren't many blowouts in this dynasty. Cause this I think we decided this that the week one was the worst one, right?",
    "timestamp" : "07:50-08:04"
  },
  {
    "speaker" : "Greg",
    "text" : "I think so, right? That was their worst worst loss in the dynasty history. Yeah, I think so. Yeah. It would make sense.",
    "timestamp" : "08:04-08:11"
  },
  {
    "timestamp" : "08:12-08:44",
    "speaker" : "Andy",
    "text" : "So yeah, minus 31 was the worst. Um there's only been four games where they've lost by more than 25. And one was in 2000. That was uh Brady's first game where he threw three passes. And then 2008 to the Dolphins. Yeah. And then the Chiefs to open twenty uh twenty fourteen. Not to open it, but when they got blown out. Oh, that was uh Ron to Cincinnati. Yeah. Yeah. That's a bad one. So that's a name game too. Yeah."
  },
  {
    "timestamp" : "08:44-09:03",
    "text" : "All right. I'm gonna give this one the name game. I'm gonna lump it in with the other. Although it was part hidden gem too. Or at least the first half. I don't know about a hidden gem. This is I think it's kind of in it's overshadowed by big one loss too, because it can't quite thumbnail it like Greg said. But there is some highlight plays in this game for sure.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh yeah. Yeah. I managed to pull a chalk full.",
    "speaker" : "Andy",
    "timestamp" : "09:03-09:06"
  },
  {
    "timestamp" : "09:06-09:08",
    "speaker" : "Steve",
    "text" : "Yeah, and David Gibbons all over it."
  },
  {
    "timestamp" : "09:09-09:19",
    "speaker" : "Andy",
    "text" : "Yeah, this is definitely a David Gibbons game, this one. David Gibbons and Teddy Bruski. Probably game balls on each side of the side of the ball? Would you agree?"
  },
  {
    "timestamp" : "09:20-09:22",
    "speaker" : "Greg",
    "text" : "Yeah, briskyism. Tom Brady"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:23-09:26",
    "text" : "Brady played well, but he didn't have to do much actually."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "09:27-09:33",
    "text" : "I mean he threw four touchdown passes, no picks. He was AFC player of the week, offensive player of the week."
  },
  {
    "text" : "Yeah, he threw four touchdown passes on like 200 yards though. It wasn't like he was slinging all over the place.",
    "timestamp" : "09:33-09:38",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "09:39-09:45",
    "text" : "Yeah, but this is 2003. That is like 600 yards in the modern NFL.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true. Also, he ran for Uh twenty something yards, twenty two yards.",
    "timestamp" : "09:45-09:52"
  },
  {
    "timestamp" : "09:52-09:58",
    "text" : "Twenty-three yards. Five carries, twenty-three yards. It's better numbers than Antoine Smith's put up all year.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "09:58-10:00",
    "speaker" : "Steve",
    "text" : "It's not true. You just got 100 yards last week."
  },
  {
    "timestamp" : "10:02-10:05",
    "text" : "Which was the first hundred yard rusher they had on the season.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "10:05-10:06",
    "speaker" : "Steve"
  },
  {
    "text" : "But you want to guess, uh so 23 yards. On five carries. You want to guess where that ranks in um Tom Brady rushing games?",
    "speaker" : "Andy",
    "timestamp" : "10:06-10:15"
  },
  {
    "timestamp" : "10:15-10:18",
    "speaker" : "Greg",
    "text" : "It's gotta be Tom. First. Second."
  },
  {
    "speaker" : "Andy",
    "text" : "No.",
    "timestamp" : "10:18-10:18"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:18-10:19",
    "text" : "Third. Fourth."
  },
  {
    "timestamp" : "10:20-10:21",
    "speaker" : "Andy",
    "text" : "No. Fifth."
  },
  {
    "timestamp" : "10:21-10:23",
    "speaker" : "Greg",
    "text" : "Fifth? Fifth."
  },
  {
    "text" : "His uh most will be two thousand six. He will rush for thirty-one yards against the Jaguars. Um prolific. That's a title game. On ten carries 3. 1 yards a carry. The next one 2011 at Philadelphia. Five carries, 28 yards. And then the other two games are ones we've already seen, apparently. 2002 against the Packers. He rushed for 26 yards And then 2002 against the Jets. He rushed for 24 yards.",
    "timestamp" : "10:24-11:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "11:08-11:17",
    "speaker" : "Steve",
    "text" : "They were calling a lot more like Tom Brady would just get it and be able to run, like when the linebacker wasn't there. And sometimes they'd call sneaks on like third and six and stuff like that. that too. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "He would do it way more aggressively than and this was like my favorite thing that they got away from. I don't know if this was just like a Charlie Weiss thing or whatever, but they would And it would kind of happen a lot in the the no huddle where you'd see them go five wide receiver and Bray would just get up under center, and because the the defense was so spread out, he just runs straight up the middle. and get five, six, ten, eleven yards.",
    "timestamp" : "11:17-11:44"
  },
  {
    "timestamp" : "11:45-11:46",
    "speaker" : "Steve",
    "text" : "Probably just didn't want him getting hurt."
  },
  {
    "text" : "Yeah, I mean I guess.",
    "timestamp" : "11:47-11:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Because he almost blew his knee out in this game, which I did not remember at all",
    "timestamp" : "11:48-11:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, thanks to uh his best buddy Lloyd Malloy.",
    "timestamp" : "11:52-11:55"
  },
  {
    "timestamp" : "11:55-12:02",
    "speaker" : "Steve",
    "text" : "That shit was. Nah, it was it was shades of Bernard Pollard hit, honestly. Exactly, yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:02-12:11",
    "text" : "Except it was often played. Except wasn't trying to do it. Yeah, I don't remember this at all. But that was a it was a terrible look."
  },
  {
    "timestamp" : "12:12-12:49",
    "speaker" : "Greg",
    "text" : "Someone fell on his leg dick. Did you hear that? What? Because it was Dick Enberg, right? Oh. And as he was throwing it, like Theodorf was like, boy, did Brady have someone fall on his leg dick? For some reason, he put like leg dick, like it sounded like one word. I was like, oh. What the hell are you talking about, Dan? That's what he does. It's uh old Freudian slipped because fucking driftwood Brady. Third leg."
  },
  {
    "text" : "That's why his knee didn't buckle because his fucking dick was supporting it.",
    "speaker" : "Steve",
    "timestamp" : "12:50-12:54"
  },
  {
    "timestamp" : "12:55-12:56",
    "text" : "He's got that tripod.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "12:57-13:12",
    "text" : "Well did you hear what they were saying after? Where he's like is I think it was Diodorf was like, All I could say is I hope Tom Brady has some loose ligaments. Which is foreshadowing. Great commentary by Dan."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh speaking of, since we're since this is the uh commentation section of the podcast, I will have you know I'm wearing the gift that my brothers I I was gonna say generously got me, but I don't know if generous is the right word.",
    "timestamp" : "13:13-13:27"
  },
  {
    "speaker" : "Steve",
    "text" : "It was a Christmas present. We were sort of obligated.",
    "timestamp" : "13:27-13:29"
  },
  {
    "timestamp" : "13:30-13:41",
    "speaker" : "Andy",
    "text" : "Yes, there's a uh a podcast-related Christmas present that I got this year that I haven't had a chance to wear yet, but it is a Number 72 Arizona Cardinals jersey. Uh-huh."
  },
  {
    "speaker" : "Steve",
    "text" : "Yes.",
    "timestamp" : "13:41-13:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:41-13:47",
    "text" : "Uh with the last name Deerdorf on the back. Uh no Hall of Fame patches on it. I don't know if that's a thing."
  },
  {
    "timestamp" : "13:48-13:58",
    "speaker" : "Greg",
    "text" : "Stitched. We didn't spare a dime. Yeah, no, this is the thing, because I knew Andy was the only the best for our Our brother, our pal."
  },
  {
    "timestamp" : "13:59-14:03",
    "speaker" : "Andy",
    "text" : "I've been waiting for a Deerdorf Game to break this out because it didn't feel right otherwise."
  },
  {
    "text" : "Hmm.",
    "speaker" : "Greg",
    "timestamp" : "14:03-14:04"
  },
  {
    "timestamp" : "14:04-14:06",
    "speaker" : "Andy",
    "text" : "But here I am rocking the deer dwarf."
  },
  {
    "timestamp" : "14:06-14:08",
    "speaker" : "Greg",
    "text" : "You look great in it, might I add."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:08-14:08",
    "text" : "I'm good in red."
  },
  {
    "text" : "Yeah. Well, it just suits you. You're just your general aura.",
    "speaker" : "Greg",
    "timestamp" : "14:08-14:12"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes. I will say uh this this feels like it was built for this uh the sizing is probably Dan Diadorf size. So I like I like that I get to wear it as a dress. So I'm wearing this and nothing else. Just for you boys. So thank you.",
    "timestamp" : "14:12-14:28"
  },
  {
    "text" : "Dude, imagine imagine go into like a Patriots game with a Diodorf jersey on. You couldn't pay me enough.",
    "timestamp" : "14:28-14:36",
    "speaker" : "Greg"
  },
  {
    "text" : "Or even like Cardinals game.",
    "speaker" : "Steve",
    "timestamp" : "14:36-14:38"
  },
  {
    "speaker" : "Greg",
    "text" : "Well couldn't it'd like be explainable, but if you show up to a Patriots gamer and they're like, yeah, I'm just a huge fan of the commentators. Of all commentators, too, we damn fucking deer to her. Because there's no one that's like alive as a fan of Dudorf the player anymore. Yeah.",
    "timestamp" : "14:38-14:57"
  },
  {
    "speaker" : "Andy",
    "text" : "No.",
    "timestamp" : "14:57-14:57"
  },
  {
    "timestamp" : "14:57-15:05",
    "speaker" : "Greg",
    "text" : "No one's a fan of him as a commentator either. Yeah, exactly. People hated him more as a commentator. So it'd be so confusing for like everyone at the stadium."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:05-15:12",
    "text" : "It yeah, it really would. Although to be fair, I I don't think I'll ever wear this out in public, so this is the public as it's getting right now."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "15:13-15:15",
    "text" : "Well maybe we'll make like a bet or something"
  },
  {
    "timestamp" : "15:15-15:16",
    "text" : "Okay.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:17-15:19",
    "text" : "Predict the end of the pandemic.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Maybe maybe we'll give it away.",
    "timestamp" : "15:19-15:21"
  },
  {
    "speaker" : "Greg",
    "text" : "Don't you dare. You wouldn't do that to us.",
    "timestamp" : "15:22-15:26"
  },
  {
    "text" : "Uh I don't know if it was uh if it was him or Dick Enberg, but they kept calling Teddy Bruskey Ted Bruskey. Like that's Edwski. That's that's bullshit. Ted Bruski. And they said that uh Ted Brewski, he plays the sacks and he has some sacks. Like these What do you mean has some sacks?",
    "speaker" : "Andy",
    "timestamp" : "15:27-15:47"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "15:48-15:49",
    "text" : "He got a sack in this game."
  },
  {
    "text" : "Oh I'm an idiot. No, you know who's the idiot? Whoever the fuck said that. Dan dear to him. They uh the two of them combined. It's not just Dan Div. I I can't put all the blame on him, but him and Dick Emberg together, they are like the personification of like every shitty commentator point of view or every like Just awful like hot take. Or not even hot take. They're just like this stupid shit. Like they were pissy like basically the entire second half that Brady was still in the game. Because like, oh well, you know, you don't want to yeah, he j he almost got hurt. It was the beginning of the fourth quarter. No, it was in the third quarter. No, it was the fourth quarter. No, because Brady was throwing And Dan Dudor threw a shit feel. I can't believe it. They're out here throwing it with Tom Brady when they've got the game wrapped up and they're already gonna make the playoffs.",
    "speaker" : "Andy",
    "timestamp" : "15:50-16:45"
  },
  {
    "speaker" : "Steve",
    "text" : "No, I get it that it was a it was a terrible take. Especially when Brady never comes out.",
    "timestamp" : "16:45-16:51"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "16:51-17:13",
    "text" : "I think it's also it Andy's got a point that he just like once he finds a point That he feels strongly about he just repeats it over and over and over again. We said it. We get it. Let's move on. Yeah, but how do you actually feel about it, Dan? Like, oh fuck And then every play is like validation of oh well you almost you got hit on that one. What if we got hurt? It's like okay."
  },
  {
    "timestamp" : "17:13-17:29",
    "speaker" : "Andy",
    "text" : "All right, let's just Comment did the game here. I can't believe the Bills brought in a backup first before the pay the Bills have been on fucking vacation mode this entire game. Like the fact that Bledsoe even played in this surprised me. Poor Drew Bledzo."
  },
  {
    "text" : "But he did predict loose ligaments being the direction Tom Brady would go in his office.",
    "timestamp" : "17:29-17:34",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:34-17:38",
    "text" : "And I actually have another plus, Greg. A broken clock is right once."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "17:39-18:11",
    "text" : "Well it's it's like twice a day actually, and because he had another great point. Depends on depends on if you're in uh military time. They were talking they're uh saying uh David Patton. Is kind of coming on similar to uh Gibbons right now. So Gibbons has a sick game, a couple touchdowns, and like a real sweet. Head fake to get in the end zone on Lawyer. And the toe tap. Yeah, the toe tap touchdown too. He was balling out in this game and they were saying, oh, he's coming on because he's a seventh round pick or whatever. Just like Dion. was 2001."
  },
  {
    "text" : "Yeah. No, he said it he said it with uh it was patent in 2001 where patent came out at the end of the year. But I don't think Patton came on at the end of the season though.",
    "timestamp" : "18:11-18:22",
    "speaker" : "Andy"
  },
  {
    "text" : "Like he definitely turned it up late that year. He has the touchdown catch in the AFC championship game and Super Bowl and he had like Wasn't it like week five where he had uh",
    "timestamp" : "18:22-18:32",
    "speaker" : "Steve"
  },
  {
    "text" : "A pass, catch, and a run for a touchdown? Like he was on kind of all year.",
    "speaker" : "Andy",
    "timestamp" : "18:33-18:38"
  },
  {
    "text" : "That's true. Also another point for uh Diodorf here I wrote down this quote. He throws compliments around like manhole covers like that. That's good.",
    "timestamp" : "18:39-18:51",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "18:51-18:52",
    "text" : "That is pretty good."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "18:52-19:01",
    "text" : "You know how you know heavy manhole covers are Andy? Yeah. Yeah. You don't just go throwing those around, do you? Well you don't. It paints the table."
  },
  {
    "timestamp" : "19:02-19:12",
    "speaker" : "Steve",
    "text" : "I will say though, they um they pulled in the Bills radio announcer guy. Yes. I was gonna say can we just keep it here?"
  },
  {
    "text" : "That's how you know it was a blowout there. They're like, oh well, look what we've got here. Let's listen in on him for a little bit. Okay. I'm in for that. Um, but it uh I I have a counterpoint to your your your pluses. Ooh, counter gowner. Yeah, so I'm just going to debate teen here. I'm just gonna let this talk for me.",
    "timestamp" : "19:12-19:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Announcer",
    "text" : "Understandably a lot of long faces on the bill sideline. Greg, how tough of a task is it as a coach to go into the locker room now and tell your guys how important it is to try to go out on a positive note? Well they're pros, you know. We've got to go out and try to get off the field better on defense. They spread us out a little bit, didn't make any plays. We didn't capitalize on the one turnover we did get. Our guys will come out. We'll be a little bit more wide open here in the second half and we've got to finish it strong. Coach, thank you. Quality man Greg Williams you've got to empathize.",
    "timestamp" : "19:32-19:59"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm sorry.",
    "timestamp" : "20:04-20:05"
  },
  {
    "text" : "Quality man, Greg Williams, you've got to empathize. Quality man, Greg quality man, Greg Williams, you've got to empathize.",
    "speaker" : "Announcer",
    "timestamp" : "20:10-20:16"
  },
  {
    "timestamp" : "20:16-20:20",
    "text" : "Do you though? I will I ref I refuse to empathize.",
    "speaker" : "Greg"
  },
  {
    "text" : "With Greg Williams. He's the worst, dude. The worst And they kept talking him up about how uh like all the players like, oh, I can't believe how great he's like stuck with us through this whole season, even though we suck. What the fuck choices he have? Like it's he sucks like you suck because of him, like he's the coach.",
    "speaker" : "Andy",
    "timestamp" : "20:20-20:39"
  },
  {
    "text" : "And he's got two G's in his name. He's sullying the Greg. Oh my god. I guess three Gs.",
    "timestamp" : "20:41-20:46",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, he's he's awful.",
    "timestamp" : "20:48-20:49",
    "speaker" : "Andy"
  },
  {
    "text" : "So do we want to let's talk about the uh the the the potential complications of this game? Yes what the Patriots are playing for because this is week 17.",
    "timestamp" : "20:49-20:59",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, this is uh the last week. There's a bunch of stuff on the line. I took a uh screenshot of the uh the graphic that they had up because sick Two teams, yeah, two teams in the AFC were undefeated at home this season. Uh the Chiefs, 12-3, who have uh they started off undefeated. They went like 9-0. But have struggled down the stretch here. And uh I believe this game is on a Saturday. And so the um Chiefs are hosting the Bears the day after. who are seven and eight. And the Patriots again uh are a game up but if the Patriots lost this game They will and the Chiefs won. There would be tie for a record, but I think the Chiefs would have a tiebreaker somewhere down the road on I'm an opponent. Something like that. Yeah. Or like conference whatever's. So.",
    "speaker" : "Andy",
    "timestamp" : "20:59-22:00"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "22:02-22:12",
    "text" : "So yeah, and and the Chiefs do end up winning that game. So this is basically the battle for the one seed. Yeah. And and the That's probably part of the reason Brady was in there for as long as he was."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "22:12-22:58",
    "text" : "Right, just to make sure, which, you know, is what Belichick said at halftime too, is what they said. And also both teams really good at home. But the Chiefs, like the Patriots, obviously both teams undefeated. The Patriots were averaging like 20 to 10 wins. Um like 20 points, four, ten points against the Chiefs, on the other hand, averaging 34, almost 35 points a game at home. Um when allowing only 17. So that I mean that's Like for the Chiefs, it's kind of a big deal to want to win at home or want to play at home. So you're also denying the Chiefs that um No, that's what I'm looking for."
  },
  {
    "speaker" : "Greg",
    "text" : "Advantage.",
    "timestamp" : "22:58-22:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "22:59-22:59"
  },
  {
    "text" : "Yeah. Home field advantage. Arrowhead's no joke either. That's true, yeah. Yeah, especially at this point. Yeah, and priest homes, peace.",
    "timestamp" : "23:00-23:08",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "23:08-23:16",
    "speaker" : "Andy",
    "text" : "Yeah. So were there any other um Was there anything else on the line, Greg, like around the league for this week?"
  },
  {
    "text" : "Yeah, do you want I mean I have so this is obviously week 17, so there's a lot of maybe we get we we touch on it after we talk about the game. All right, yeah. Yeah. Because there's a lot of like results-based stuff.",
    "speaker" : "Greg",
    "timestamp" : "23:17-23:30"
  },
  {
    "text" : "That's what I figured, yeah. Okay. Um, so uh in terms of if you want to watch this game, I would say Watch the first half.",
    "timestamp" : "23:30-23:40",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "23:40-23:41",
    "text" : "Yeah, yeah. First half."
  },
  {
    "text" : "And then watch kind of like the end of the hey you can watch the fourth quarter too.",
    "speaker" : "Andy",
    "timestamp" : "23:42-23:45"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "23:45-24:01",
    "text" : "Watch the first, not even the fourth quarter. Watch the first half and then the last couple minutes to watch that int that we all know, the game's healing one. Yeah. Um that I think is you could that could be your thumbnail, Greg. There you go. I don't know if people are gonna have to. Yeah."
  },
  {
    "text" : "Yeah. I didn't remember it was an interception until Oh really?",
    "timestamp" : "24:01-24:04",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "24:04-24:07",
    "text" : "I remember the interception. I thought it was Teddy Bruski."
  },
  {
    "speaker" : "Greg",
    "text" : "I thought it was a fourth down play. I remember like a s a goal line stop at the end of the year at the end of the game.",
    "timestamp" : "24:07-24:11"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:12-24:14",
    "text" : "No, yeah, I I thought they put their Starters back in."
  },
  {
    "text" : "I thought they put their starters back in too, Andy.",
    "speaker" : "Steve",
    "timestamp" : "24:15-24:17"
  },
  {
    "text" : "Yeah. But they didn't. No. Which was even better when because it was Larry Izzo with the inner Izzo. To keep the 31-0.",
    "timestamp" : "24:17-24:25",
    "speaker" : "Andy"
  },
  {
    "text" : "He was playing two like he was one guy versus two. He had the guy in the flat and the guy deep and he like bunks the guy in the flat, goes deep, makes interception.",
    "timestamp" : "24:25-24:33",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "24:34-24:34",
    "speaker" : "Andy"
  },
  {
    "text" : "And then I thought it was Teddy because like Teddy flips the fuck out. And is like on the field and they have like this crazy hugging party in the midfield. It was awesome. Yeah.",
    "timestamp" : "24:34-24:45",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, with the entire defense and Troy Brown there. Dude, they are so fucking stoked. So yeah, it was a it was a fucking hell of a party at the end of it. Um yeah, I think the the first quarter is basically the Patriots offense. Did whatever the hell they wanted.",
    "speaker" : "Andy",
    "timestamp" : "24:45-25:00"
  },
  {
    "timestamp" : "25:00-25:06",
    "speaker" : "Greg",
    "text" : "Um the defense against the the number two ranked defense in the NFL."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:07-25:07",
    "text" : "Were they?"
  },
  {
    "timestamp" : "25:08-25:17",
    "speaker" : "Greg",
    "text" : "So Buffalo had a tough year. Yeah, they had they had a tough year. Oh they were that's right. In terms of yardage, they were the number two defense in the NFL. And they were number five."
  },
  {
    "timestamp" : "25:20-25:30",
    "speaker" : "Steve",
    "text" : "Yeah, no, their defense is sick. They have playmakers everywhere. They're all five defense. Their receivers are good, their running backs are good, Drew Bledsoe is good."
  },
  {
    "speaker" : "Andy",
    "text" : "It also felt like and I I don't know I it may have been Dan Diedor too that pointed this out that it seemed like the defense wasn't trying the Bills defense wasn't running at 100% effort either. On the Bethel Johnson touchdown where I don't remember. Nate Clemens, my boy. Yeah, you have his jersey, right? Kind of half-assed it. And got stiff armed in the chest and just like didn't even really try to make the tackle.",
    "timestamp" : "25:30-25:56"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "25:56-26:01",
    "text" : "Bethel is is this is like peak Bethel because he's been playing awesome these last couple weeks too."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:01-26:06",
    "text" : "He's had a kick-ass year. I'm hyped on Bethel Ren out that Jersey looks so much better."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:06-26:11",
    "text" : "I don't know how he didn't stick because yeah, he's been playing great. He"
  },
  {
    "text" : "And not just, I mean, okay, so I got uh I got a good comparison. Ooh, uh Cordell Patterson.",
    "speaker" : "Greg",
    "timestamp" : "26:11-26:20"
  },
  {
    "text" : "Hmm. No, Bethel's like shiftier.",
    "speaker" : "Steve",
    "timestamp" : "26:21-26:23"
  },
  {
    "timestamp" : "26:23-26:36",
    "text" : "No, I just mean from like a game impact, right? He's not like he's not you're not giving him like 10 10 targets a game or anything, but like every time he gets the ball, he seems to do something that's like, okay, that's okay. That's a big plan.",
    "speaker" : "Greg"
  },
  {
    "text" : "And his his biggest contribution is on kickoffs, kickoff turns. And even in this game, I think Bethel Johnson's biggest contribution was kickoff coverage.",
    "timestamp" : "26:36-26:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:45-26:46",
    "speaker" : "Steve",
    "text" : "Yes."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:46-26:53",
    "text" : "Because uh Antonio Brown, the other Antonio Brown. the Bills Antonio Brown was there a kickoff, I looked it up."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "26:53-26:54",
    "text" : "I was like, what? No."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:54-27:24",
    "text" : "Well yes, no, it's not the same one. We we were we went over this week one, I think. It's the Antonio Brown that uh you draft by accident in fantasy. Check yourself. Uh but Yeah, so he was a bit of a burner in this, and Bethel Johnson ran him down on kickoffs that probably would have been touchdowns otherwise. uh like ran this guy down from behind when nobody else could catch him like from the other side of the field on one of them."
  },
  {
    "speaker" : "Greg",
    "text" : "So Bethel Johnson, yeah, I'm big on him in this.",
    "timestamp" : "27:24-27:27"
  },
  {
    "timestamp" : "27:27-27:27",
    "speaker" : "Andy",
    "text" : "Mm-hmm."
  },
  {
    "speaker" : "Greg",
    "text" : "And and like that's the kind of players you like that make the most of their opportunities. Yeah.",
    "timestamp" : "27:27-27:32"
  },
  {
    "text" : "And so I'm kind of so but uh I think it was a couple weeks ago, maybe in the Jags game, they said that he didn't play because something to do with his preparation for the game wasn't up to snuff. Like it wasn't. The pages weren't happy with it, so they just like benched him for a game. So there may have been something else going on there, but every time he's on the field he does something. It makes it he makes a difference.",
    "speaker" : "Andy",
    "timestamp" : "27:32-27:54"
  },
  {
    "timestamp" : "27:55-28:01",
    "speaker" : "Steve",
    "text" : "Yeah, he like wasn't prepared, so he didn't even dress. Yeah. Prepare well enough for the week or some some show you that."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:01-28:05",
    "text" : "Yeah. Similar to Reuben Brown in this game."
  },
  {
    "timestamp" : "28:05-28:22",
    "speaker" : "Greg",
    "text" : "He gave him the old fucking uh Malcolm Butler treatment. Yeah, we're not gonna give you a real reason. We're just gonna sit one of our better players yeah and in a in a super bowl for no reason Bill Belichick, your hero, your god."
  },
  {
    "timestamp" : "28:23-28:26",
    "speaker" : "Steve",
    "text" : "I mean there's gotta be something there. I can't believe that never came up."
  },
  {
    "timestamp" : "28:26-28:33",
    "speaker" : "Andy",
    "text" : "I know Well, when we have either of them on the podcast, we will talk about it. Butler. He's a free agent."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "28:34-28:34"
  },
  {
    "timestamp" : "28:34-29:58",
    "text" : "He is, yeah. He just got released. So we shall see. Um yeah, but there was um something about in this game, Ruben Brown didn't travel with the team. The Bills like uh Pro Bowl lineman, I don't know, it was left tackle maybe. Uh he was a guard. Yeah, it was a guard. Oh but Uh but yeah he I guess he had some altercations on the field and on the sidelines in the game before this. against the Dolphins in a game where Drew Bledsoe was sacked six times. And I guess they said he was frustrated with the way the offense was was performing. Um and so he didn't practice all week and didn't travel with the team. And this was another thing that that um your boy Dan Deerdorf was like. Beleagering. Yeah, he he was he was upset about this. Uh about the fact that Ruben gets to stay home and still gets a paycheck, but all his teammates are are here battling it out. Which I think um if you look at the score is probably uh a questionable statement. But um Yeah, he he he uh was on that train for probably most of the second quarter, I would say.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:58-30:08",
    "text" : "About how bad this offensive line looked. Are your nipples hard underneath your deirdorf jersey? Rock solid. Underneath your deirdorf jersey.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Ruben Brown, uh Uh four-time second team all pro. Yeah. Always the bridesmaid, never the bride. Well, that's because he doesn't show up for his team. Is that the most Bill stat ever? Four time. Second team all pro.",
    "timestamp" : "30:09-30:26"
  },
  {
    "timestamp" : "30:28-30:33",
    "speaker" : "Andy",
    "text" : "Well, they have been four times second place at FL fits."
  },
  {
    "text" : "I'm more of a Cuban guy myself, you know, a Cubano. A cubano.",
    "speaker" : "Greg",
    "timestamp" : "30:38-30:42"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. I also I did find it strange that Patriots go 14 and 2, set a franchise record for wins. Uh go on a win the Super Bowl and have two Pro Bowlers.",
    "timestamp" : "30:42-30:52"
  },
  {
    "speaker" : "Greg",
    "text" : "That's what well I mean I'm wearing one of them's jersey. Tylaw, baby.",
    "timestamp" : "30:54-30:59"
  },
  {
    "speaker" : "Steve",
    "text" : "Is that from is that the jersey from this year?",
    "timestamp" : "30:59-31:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "31:02-31:02"
  },
  {
    "text" : "That's the jersey from this year. That's why I wore it today. Oh no shit.",
    "timestamp" : "31:02-31:07",
    "speaker" : "Steve"
  },
  {
    "text" : "So who was the other one?",
    "timestamp" : "31:08-31:08",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:09-31:11",
    "speaker" : "Steve",
    "text" : "Ty Law Pro Bowl jersey."
  },
  {
    "timestamp" : "31:12-31:14",
    "speaker" : "Andy",
    "text" : "Uh the other one's Seymour, right?"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "31:14-31:14"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:15-31:19",
    "text" : "Damn. So no offensive player. Oh yeah, that makes sense. This offense has been Harrison."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "31:19-31:24",
    "text" : "I think you could have made a case for Harrison. Stuck out as like dominant."
  },
  {
    "speaker" : "Andy",
    "text" : "Bruce Kyle should have made it.",
    "timestamp" : "31:24-31:25"
  },
  {
    "timestamp" : "31:25-31:32",
    "text" : "He had to be a little bit of a defense probably should have had more than two being how dominant they were cause they ran absolute crushing team.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "31:32-31:40",
    "text" : "Yeah. Yeah yeah. And Wikipedia. B com is saying that William McGuinness is a pro baller too. Maybe he got in as a alternate.",
    "speaker" : "Greg"
  },
  {
    "text" : "Could be. Doesn't matter. It's not like I can't even play it, right? Actually, no, this was this was when the Pro Bowl was after the Super Bowl, isn't it?",
    "speaker" : "Andy",
    "timestamp" : "31:41-31:48"
  },
  {
    "speaker" : "Greg",
    "text" : "That's right. No, Tyla did play in this game.",
    "timestamp" : "31:48-31:50"
  },
  {
    "timestamp" : "31:50-31:51",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "31:51-31:53",
    "text" : "I bet he did.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Um the uh Teddy uh not Teddy uh Mike Vrabel had an interception early in the first quarter. Bill's first drive, I think. Uh and that was that was this defense 28th interception on the season. 28 interceptions is a lot. It was actually it moved them into first. Um in the NFL. I don't know if that's stuck. But it was also the most by Page's defense since 1964 Hmm. Which is a long fucking time. Also, in 1964, I'm surprised you could get 28 interceptions because I don't think teams threw more than like three times a game back then.",
    "timestamp" : "31:53-32:32",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "32:33-32:35",
    "speaker" : "Greg",
    "text" : "Yeah, well that's why because I kept throwing so many goddamn interceptions."
  },
  {
    "text" : "Because they're so bad at it. But this team is also only allowing nine points per game at home.",
    "timestamp" : "32:36-32:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Pretty good. And I mean this first half was fucking crazy domination. Like watch they get the kickoff, go down, nine plays, sixty yards, touchdown. Next drive. Bloodsoe throws an interception, touchdown again, 14-0 before you can even like the air and get sat down.",
    "timestamp" : "32:43-33:01"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Yeah, exactly. And but like they've been waiting for this all yeah, it's the best the offense have looked in forever. In many games, and they were just Against the number two defense.",
    "timestamp" : "33:01-33:11"
  },
  {
    "timestamp" : "33:12-33:39",
    "text" : "Yeah, because they came out just saying, you know what, fuck it, five wide, uh, no huddle. We're just gonna just hammer it right down your throat and it worked for two drives and then they just got up uh twenty eight nothing like twenty eight nothing at halftime yeah it was twenty one nothing after like right at the end right at the beginning of the second quarter because they Their last drive of the first quarter finished in the second like right at the beginning. Brady threw a touchdown to Troy Brown. Um",
    "speaker" : "Andy"
  },
  {
    "text" : "And so Bledsoe like still hasn't thrown a completed pass at this point. Yeah, he had. The Bills looked horrendous.",
    "timestamp" : "33:40-33:47",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "33:47-33:51",
    "text" : "Yeah, they they couldn't block anybody uh on that offensive line, like Steve was saying.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:52-33:59",
    "speaker" : "Greg",
    "text" : "Here's a question for you guys: did you guys feel bad for Brady? Watching this bad for Brady? Uh blood cells, sorry. Yes. Oh yes, I did."
  },
  {
    "text" : "Because he had no time. He was just throwing hot every time. There was a free rusher every single time.",
    "timestamp" : "34:00-34:04",
    "speaker" : "Steve"
  },
  {
    "text" : "Straight up flashbacks, dude Yeah, he was like just like, oh God, he's it's not really his fault, but he's not making it any better.",
    "speaker" : "Greg",
    "timestamp" : "34:05-34:12"
  },
  {
    "speaker" : "Andy",
    "text" : "Because because yeah, there was one drive where I think the the bills drop back to pass three times and every single time Bloodzoe got hit because there was a free rusher. But he was also like There was no hot routes. There was no like quick dump outs to the the running back or anything like that. And then they punted and Brady got the ball. And literally the first play is a free rusher. And Brady just dumps it off to like the tight end in the flat. And they get like four or five yards out of it. And like that, that right there is why they kept Brady and not not Bledzo. But yeah, Bledzo. I'd say he had maybe a second and a half to make a make a decision in this. It was a free rusher almost every single play.",
    "timestamp" : "34:13-34:53"
  },
  {
    "text" : "They just blitzed the blitz percentage just went through the roof because they just blitzed every play. It felt like it, yeah.",
    "timestamp" : "34:53-34:59",
    "speaker" : "Steve"
  },
  {
    "text" : "Well, I don't even think they did. I think they just brought rushers from different places.",
    "speaker" : "Andy",
    "timestamp" : "34:59-35:03"
  },
  {
    "speaker" : "Steve",
    "text" : "It was usually like a four-man rush, but it was in safeties and corners and linebackers and just like every",
    "timestamp" : "35:03-35:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Even into garbage time when the when because the Bills brought in um the fuck was his name? Travis Brown or something. Travis Brown, yeah. One of the Brown brothers. uh from uh the northern northern arizona lumberjacks represent northern arizona huh the lumberjacks baby chop that wood",
    "timestamp" : "35:09-35:29"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, he's a Phoenix boy. He's a coyote. Um fucking howling at the moon.",
    "timestamp" : "35:29-35:35"
  },
  {
    "timestamp" : "35:35-36:22",
    "speaker" : "Andy",
    "text" : "He was you he was kind of like your very uh like Madden created backup quarterback because he came in and he like looked like a a a dollar store version of Drew Bledsoe. similar builds but like his helmet didn't quite fit right and his face mask was too big because it looked like they give him him you know they're like the the old school tight ends helmets from these days. There's like a little bit bigger and the face mask is huge and it goes like down to their chests. You know those ones? Like the ones that Christian Fourier wears. Yeah. And this guy was wearing that. And he just like They just like hung him out to dry. He got lit up in this game too. That was the uh Harrison definitely concussed him. Was it?"
  },
  {
    "timestamp" : "36:22-36:30",
    "speaker" : "Steve",
    "text" : "Oh yes, it was yes, yes. He was walking out the head me had to come out and he was clear concussed and he came back. Oh no, wasn't that the tight end?"
  },
  {
    "text" : "Yeah, yeah. Yeah, yeah, it was a tight end who because but you you mistook them because they look exactly the same because they wear the same fucking helmet. Yeah, the dumb is just like now it's like a beard. Yeah, it's one of those ridiculous ones",
    "timestamp" : "36:30-36:43",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:44-36:53",
    "speaker" : "Greg",
    "text" : "A lot of Browns on in this game, huh? Fuck yeah. Travis Brown, Antonio Brown, Ruben Brown, Troy Brown. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Craig Brown, Annie Brown, Steve Brown, Dan Deirdor. Oh. No. Yeah. Uh who else? Well, there's a couple Travises. We're going Travis Brown. We got Travis Henry, who was literally the only bright spot in this game for the Bills. Who beared none of the burden for the game.",
    "timestamp" : "36:53-37:14"
  },
  {
    "timestamp" : "37:15-37:16",
    "speaker" : "Greg",
    "text" : "Ooh, let's play this game. Yeah."
  },
  {
    "text" : "What game are you playing?",
    "timestamp" : "37:17-37:18",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "You know, where like you go from like last names to first names.",
    "timestamp" : "37:18-37:21"
  },
  {
    "timestamp" : "37:21-37:28",
    "speaker" : "Andy",
    "text" : "All right. So Travis Henry. Henry Ruggs the third. Henry Winkler."
  },
  {
    "timestamp" : "37:33-37:35",
    "speaker" : "Greg",
    "text" : "Rugs and Bugs"
  },
  {
    "speaker" : "Andy",
    "text" : "But yeah, Travis Henry actually ended his game with over 100 yards, didn't he? Rushing. Believe he did. Stat Trek?",
    "timestamp" : "37:36-37:43"
  },
  {
    "timestamp" : "37:43-37:45",
    "speaker" : "Greg",
    "text" : "I don't know. I didn't watch the second half."
  },
  {
    "timestamp" : "37:45-37:54",
    "speaker" : "Andy",
    "text" : "Travis Henry before you didn't have a few. I was confusing him with Travis Brown, who threw for 100 yards."
  },
  {
    "timestamp" : "37:54-37:56",
    "speaker" : "Greg",
    "text" : "Which is more than Bledsoe threw for."
  },
  {
    "text" : "Bledsoe, 12 of 29, 83 yards, one interception, three sacks.",
    "speaker" : "Andy",
    "timestamp" : "37:56-38:02"
  },
  {
    "speaker" : "Greg",
    "text" : "It's not great.",
    "timestamp" : "38:04-38:05"
  },
  {
    "timestamp" : "38:05-38:15",
    "text" : "Not great. It a rating of 34. 7. Damon Heward had a higher rating than that. Damon Heward was 0 for 1.",
    "speaker" : "Andy"
  },
  {
    "text" : "It had a better rating. And negative one rushing yards. Yeah. Pretty good.",
    "speaker" : "Greg",
    "timestamp" : "38:19-38:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:23-38:26",
    "text" : "Yeah. So well that's because he had a kneel down."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "38:27-38:35",
    "text" : "Was that tight end on the bills? The same one that Brady roomed with at Michigan and was like super close with?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, it was.",
    "timestamp" : "38:35-38:36"
  },
  {
    "text" : "Remersma.",
    "speaker" : "Steve",
    "timestamp" : "38:36-38:37"
  },
  {
    "timestamp" : "38:38-38:42",
    "speaker" : "Andy",
    "text" : "No, uh Mark Mark Campbell."
  },
  {
    "speaker" : "Steve",
    "text" : "That's is that the same dude? Yes.",
    "timestamp" : "38:42-38:44"
  },
  {
    "text" : "Yeah, because they they mentioned it briefly.",
    "timestamp" : "38:44-38:46",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "38:46-38:48",
    "text" : "You know, when you ever read like a Brady bio or whatever.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, no, that was the same one. I think and he was the one that got kind of concuss in this too. He was super concuss. Yeah, he was taking shots because they kept like this Travis Brown character kept like floating the ball down the middle to that like tight end seam route. Yeah. Which Rodney Harrison just feasted on. Every time he caught the ball, the guy just got lit up. He went back a couple times. Not great. But yeah, Travis Henry was like the only person still trying at the end of the game too. It's like the third quarter. They're just like handing it off to him and not blocking for him. So he's breaking like four or five tackles and getting like a loss of two yards.",
    "speaker" : "Andy",
    "timestamp" : "38:49-39:25"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "39:25-39:31",
    "text" : "Soon to be replaced by the Bills first round pick this year, who redshirted the entire year."
  },
  {
    "text" : "Yeah, that's because he had that crazy leg injury in college, right?",
    "timestamp" : "39:34-39:37",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "39:38-39:41",
    "text" : "Yeah, Miami. He has it right before he gets drafted.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, it was in like the I don't know if it was a national championship, but it was in the bowl game, right? Yeah.",
    "timestamp" : "39:41-39:47"
  },
  {
    "timestamp" : "39:47-40:03",
    "speaker" : "Steve",
    "text" : "It was a Rosebell against Texas. That was the grossest shit ever. Yeah. Where did they draft him? First round. Jesus. He was their first round pick. That's so big. Like and they had a high pick. They weren't like awesome last year either. They didn't make the last either."
  },
  {
    "text" : "No, they did not.",
    "timestamp" : "40:03-40:04",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Running backs were like way more valued back then.",
    "timestamp" : "40:06-40:08"
  },
  {
    "text" : "I mean this is true.",
    "timestamp" : "40:09-40:10",
    "speaker" : "Andy"
  },
  {
    "text" : "But still, the dude had a like a gross ass knee injury in his last game at college. And",
    "timestamp" : "40:11-40:16",
    "speaker" : "Steve"
  },
  {
    "text" : "Do you want to talk about the uh uh around the league, our new segment? Yeah, that's a good spot for it. All right So this is the first edition of the newest segment that I will probably forget about next time. We're calling it Around the League. With Greg Brown, okay.",
    "speaker" : "Greg",
    "timestamp" : "40:19-40:41"
  },
  {
    "speaker" : "Steve",
    "text" : "You know and you can call this wrong one.",
    "timestamp" : "40:42-40:45"
  },
  {
    "timestamp" : "40:50-41:30",
    "speaker" : "Greg",
    "text" : "That's the one. Yeah. So let's take a little gander. Let's take a walk around the NFC, the AFC, see what else is going on. The realm of the Patriots. Not only that, but some records were set this year. So yeah. Um Jamal Lewis. Would uh complete his 2,000 yard season this week. Oh yeah. Finishing the year with 2,066 yards, which At the time was second all time."
  },
  {
    "timestamp" : "41:31-41:33",
    "text" : "To Barry Sanders, maybe?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "41:33-42:04",
    "text" : "No. Andrew, do you have a guess? Eric Dickerson? Eric Dickerson. Ha! Look at me Still holds the record. Lewis is Lewis has been uh there's a new second. Can you name that? Uh Adrian Peterson or Adrian Peterson, 2012. So yeah, he had a fucking monster year. He had like he absolutely feasted on Cleveland. He had like 295 yards in like one week and then like 180 the next week.",
    "speaker" : "Greg"
  },
  {
    "text" : "I have a uh I have a I think we may have touched it on this back when the we played the Browns, but uh the fun fact that we had for the Browns game that one was uh in week two, Browns linebacker Andra Davis telephoned Ravens running back Jamal Lewis before the game and stated he wanted Lewis to carry the ball at least 30 times in their upcoming matchup. Quote, if that happens, it's going to be a career day, Lewis replied. Lewis then erupted to 295 rushing yards, breaking the record previous held by Corey Dillon in 2000 as the Browns fell 33-13 So the browser fenders literally called up Jamal Lewis, like, I fucking dare you to run 30 times. It's like, okay. And runs for 300. Yeah.",
    "timestamp" : "42:04-42:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "42:45-43:05",
    "text" : "And then did it again in week 16. Like, yeah, they go fuck 80. So I mean the like Steve was saying, the running backs are way more valued. So also in this year, Priest Holmes set the what was at the time the record for most touchdowns in a season. Oh yes. 27 touchdowns.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:06-43:08",
    "text" : "Which was broken by LT eventually."
  },
  {
    "timestamp" : "43:09-44:00",
    "speaker" : "Greg",
    "text" : "Like 30 something, which is ridiculous. Yeah, so interestingly it was 2005, Sean Alexander broke it, and then 2006, Alice Wright broke that. So I remember that like three out of four years, the record was set. So LT had 31 touchdowns. That's the record as it stands now in 2006. Yep. So um a little around the league playoff Um updates. Give me the playoff picture. The playoff picture. So the um the AFC is the patent first. The uh Chiefs in second. Yep. Colts in third. They win the AFC South with like uh the same record as the Titans. Right. But they won it head to head, I think."
  },
  {
    "text" : "And they're both wicked good too, right? They're both like three or four lost teams.",
    "speaker" : "Steve",
    "timestamp" : "44:00-44:04"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "44:04-44:36",
    "text" : "I think there are four lost teams, yeah. Yeah so then Baltimore wins based on defense in Jamal Lewis. They win their division, the AFC North. So they actually have a worse record than the Titans, but uh so you'll get Baltimore and Tennessee wildcard game, and then the Chiefs or the the Colts will play Denver. Okay. So those are the two and the Chiefs Pats have buys. So remember that."
  },
  {
    "text" : "Colts Denver game.",
    "timestamp" : "44:37-44:39",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "44:39-44:40",
    "text" : "I don't remember that either."
  },
  {
    "speaker" : "Andy",
    "text" : "No, I think I do.",
    "timestamp" : "44:41-44:42"
  },
  {
    "text" : "It's a pretty yeah, we'll get to that maybe once we once that game like we get closer to the Patriots 'cause obviously we know that we play the Titans and the Colts this year. So the Chiefs after having this amazing year. are basically one and done. Yeah, fall apart right at the end. Which is interesting. Yeah. Mm-hmm. Um the NFC So the NFC finishes with Philadelphia as the one seed, St. Louis as the two seed. That makes sense. Panthers as the three seed. Oh Green Bay as the four seed, which I'll get to in a minute. Seattle and Dallas as wild cards. Okay. So I don't know if you remember how the Packers got into the playoffs this year by winning that division. So it was between them and Minnesota going into the last week of the year.",
    "speaker" : "Greg",
    "timestamp" : "44:43-45:35"
  },
  {
    "text" : "Okay.",
    "speaker" : "Steve",
    "timestamp" : "45:36-45:36"
  },
  {
    "text" : "So Minnesota, this is the uh Culpepper, Randy Moss team. So it was a fucking sick team. With um Who is our other wide receiver? Chris Carter. All he does is catch touchdowns. Yes.",
    "timestamp" : "45:36-45:49",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "He had his like 1,000th catch or something on a highlight the other day and it was catching a touchdown.",
    "timestamp" : "45:50-45:55"
  },
  {
    "text" : "Of course. All he does is catch touchdowns.",
    "speaker" : "Andy",
    "timestamp" : "45:56-45:58"
  },
  {
    "text" : "So last week, Minnesota had like blown the doors off Kansas City. It was like 45 20 or something like that. So that was a big win. That was actually a big game for the Pats. Um moss is like in peak moss form. He had like seven catches, a buck 11, two touchdowns in that game. So now into week 17, all they need is like It's one of those situations where like they either need to win or Seattle wins or tie. You know, it's like one of those things where like four things have to go against them for them to not make the playoffs.",
    "timestamp" : "45:59-46:31",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "46:31-46:31"
  },
  {
    "text" : "And they're playing the three and twelve Cardinals. After just beating 12 those cardinals. After just beating the 12 and two Chiefs. So there they go into uh Arizona, they're fucking kicking their ass. 17 to 6 with less than two minutes left. It's 17 to 6. What? And then some Deerdorf magic happens? Josh McCown magic. Oh no. This is the Josh McCown led Cardinals.",
    "timestamp" : "46:31-47:02",
    "speaker" : "Greg"
  },
  {
    "text" : "What? Is this like his rookie year too?",
    "speaker" : "Steve",
    "timestamp" : "47:03-47:05"
  },
  {
    "timestamp" : "47:05-47:11",
    "speaker" : "Greg",
    "text" : "It's actually his like second or third year in the league, but he played till 2019, which is fucking crazy."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "47:11-47:11"
  },
  {
    "timestamp" : "47:12-47:12",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "text" : "So holy shit.",
    "speaker" : "Andy",
    "timestamp" : "47:12-47:14"
  },
  {
    "timestamp" : "47:14-48:10",
    "speaker" : "Greg",
    "text" : "McCown leads them down. They score a touchdown. I think they convert like a fourth and ten on that drive. They uh get an onside kick. Nice. Recover that. They start driving. They're like down within like the 10-yard line of Minnesota. They it's second down. They have they have one timeout. They get sacked. Call the timeout. The next play, they get sacked. A sack fumble. Oh my god. So it's now Fourth and goal from the 24 with like an like an expired play. It's the last play of the game. They can't clock it and then nothing. And some fucking way how Josh McCown pulls this bullshit out of his ass. And it's like, it was very similar to the um The Super Bowl with the Steelers with the touchdown on the corner against Cardinals."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:10-48:11",
    "text" : "Yeah, yeah. Oh yeah."
  },
  {
    "timestamp" : "48:12-48:48",
    "speaker" : "Greg",
    "text" : "Same idea of play where he's just like launches it into the back corner of the end zone and this kind of like toe taps it. And that's the last play of the game. The Cardinals win 18-17. The Vikings are out of the playoffs. The Packers are in. Season done. Wow. It's one of the most ridiculous games I've ever seen. To lose your season against a fucking 3-12 team like that. Josh McCown and a 3 and 12 team. Wasting a Culpepper Randy Moss team. Like there's just so many layers of heartbreak for Vikings fans there. Like I can't even imagine."
  },
  {
    "timestamp" : "48:48-48:50",
    "text" : "Yep. Oh my god, this catch.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:51-49:03",
    "text" : "How did you get it? And this was actually before they had the rule of push out. So he only he gets one foot down and then the defender. So it's non-reviewable. Yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "Or no, it's reviewed, but they the the review is that he had like maintained control. He would have come down in bounds if God damn. All right, well yeah, we'll we'll post that in the in the show notes. So if anybody wants to watch it, they can.",
    "speaker" : "Andy",
    "timestamp" : "49:03-49:17"
  },
  {
    "timestamp" : "49:17-49:30",
    "speaker" : "Greg",
    "text" : "I didn't see it, but I think this is another one where if you find the right commentator, it's hilarious. Probably would be. Where the guy's like, oh no."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:30-50:02",
    "text" : "Vikings. Right, because we talked about the other day. Uh The the ending to the the Saints game, yeah. How could you do that? Where they scored the lateral touchdown and then uh missed the extra point to tie it to go to overtime. And I think that kept the Saints out of the playoffs, didn't it? Uh the Saints did not make the playoffs. Yeah, they did not. They finished, but they finished eight and eight. So they had a chance if they had won that. Yeah. Sounds like they would have. Brutal."
  },
  {
    "speaker" : "Greg",
    "text" : "Fourth and twenty-four. And of course you guys are gonna hate this, but like uh Brett Favre was watching from I think it was Chicago after beating the Bears, being like, oh shucks, guys, we did it Fucking dick. Yeah, you guys would have hated it. What if I am hating it?",
    "timestamp" : "50:03-50:21"
  },
  {
    "text" : "Uh all right, so we got some uh some excitement happening in the NFC, which didn't really happen in the AFC, at least not uh last day. And it was kind of like it was just the seeding more than anything. Right. Because the Ravens were two games up on the Bengals. Patriots were four games up on the Dolphins. We finished ten and six but missed the playoffs.",
    "speaker" : "Andy",
    "timestamp" : "50:23-50:43"
  },
  {
    "timestamp" : "50:43-50:46",
    "speaker" : "Greg",
    "text" : "Yeah, they missed around a tiebreaker with the Broncos."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. So if they had beaten the Patriots once this season, they wouldn't made the playoffs.",
    "timestamp" : "50:46-50:52"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "50:52-50:52",
    "text" : "Mm-hmm."
  },
  {
    "timestamp" : "50:55-51:32",
    "text" : "AFC East Men. It's tough when you got the Patriots in that. That's true. Damn. All right. So we got the the Panthers at the three seed and the Patriots at the one seed. And the the commentation this were also talking about how hard it was for the one seed. To win or to even get to the Super Bowl because I think I took a screenshot of it. Only three of the top-seeded AFC playoff teams have made it to the Super Bowl in the last 10 seasons. And the only team to win was the 1998 Broncos. Only one seed to win from the AFC. So the one seed isn't really known for",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Well that's because it's always fucking Peyton Manning and he blows in the playoffs.",
    "timestamp" : "51:33-51:37"
  },
  {
    "timestamp" : "51:40-51:46",
    "speaker" : "Andy",
    "text" : "Well, this is still early Peyton, so maybe not. I mean I think I think I think it's bitterly for that, but the point still stands."
  },
  {
    "text" : "If that number is skewed, it's because of Peyton Nanning, goddammit.",
    "speaker" : "Greg",
    "timestamp" : "51:47-51:51"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:51-53:01",
    "text" : "I mean it's it's skewed because of Tom Brady, or it will be. Um but yeah, uh some other numbers for in the page's favor though for this is that um Single season since 1970, only three teams have won 12 consecutive regular season games. Before the Patriots did it, uh just in this game here. Um, all three of them won the Super Bowl. They were obviously the 1972 Dolphins, the 1985 Bears, and the 1998 Broncos. So good company to have to win those games. But two of those teams. So let's see 85 Bears. Well, 72 Dolphins obviously undefeated. 85 Bears, I think, went 15 and 1 and beat the shit out of everybody except the one team they lost to that year. Do you know? Um the Miami Dolphins. The Miami Dolphins. The only team to beat the eighty five Bears, keeping them from having a perfect season. And I think the 98 Broncos were a bit of a shitstormer too, weren't they? A wagon. Yeah, because that was L Way like end of his career, and then they had. Terrell Davis. Terrell Davis, yeah."
  },
  {
    "text" : "That's Pete Terrell Davis, where he had those four years where he was just like on another planet.",
    "speaker" : "Greg",
    "timestamp" : "53:01-53:06"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, exactly. And uh and this was the time when the Uh the Broncos were like kind of skirting the salary cap by paying money outside of it, wasn't that this era? So they had some stacked teams.",
    "timestamp" : "53:06-53:22"
  },
  {
    "text" : "Oh yeah. Um How are they doing that? Not to get too into the weeds here, but you can actually find it on your teamads. com. I was gonna say, are there other teams in the NFL cheating or possibly bending the rules because I will throw a hissy fit on national television if that's the goddamn truth.",
    "timestamp" : "53:22-53:40",
    "speaker" : "Greg"
  },
  {
    "text" : "I want you to cry like uh that's the game yeah we let's Congress do it about this",
    "timestamp" : "53:40-53:46",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, yeah.",
    "timestamp" : "53:45-53:46"
  },
  {
    "timestamp" : "53:46-54:16",
    "text" : "Where's Alan Spectre? God damn it. There you go. Uh it's called salary cap gate, according to your teamcheats. com. Salary cap gate. That's the most boring gate ever. Yeah. Well th I think they name everything something gate. Yeah. 'Cause as is tradition. Uh but the summary is, according to his website, on September seventeenth, two thousand four, the league announced that for the second time in three years the Denver Broncos were fined. nearly a million dollars and would once again lose their third round draft pick because of salary cap violations between ninety six and ninety-eight.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:16-54:18",
    "speaker" : "Greg",
    "text" : "Luxury tax, essentially."
  },
  {
    "text" : "Oakland Raiders owner Al Davis contended the Broncos circumvention of the salary cap to help them win the Super Bowl in the ninety seven and ninety-eight seasons. In the years where they didn't follow the cap rules, the Broncos top player, quarterback John Elliott, was paid around 5. 4% of the legal cap space, which was 1. 2% less than the next closest team. Even more telling, Elways cap charges in the Broncos 9798. Super Bowl seasons were just 2. 1 and 2. 6 million, respectively, which is pretty fucking small. By comparison, Miami Dolphins quarterback Dan Marino. Whoops, where'd that go? Uh, who would be the most logical comparison had cap charges of 4. 3 and 7. 6 million. So like a fraction of that. Implications that LE took a relatively low cap hit but received outside the cap funds to compensate for that. God damn.",
    "speaker" : "Andy",
    "timestamp" : "54:18-55:05"
  },
  {
    "timestamp" : "55:05-55:21",
    "text" : "See, that's what I'm saying. Like it's you can only rile up the public if it's not boring. Yeah. Well, oh here you go. 4. 62 million percent over the cat captain. So here you go. Here's the pay. I just tuned out. Here's the fail.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Tune the fuck out.",
    "timestamp" : "55:21-55:22"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:23-55:27",
    "text" : "Tell me they were videotaping practice and I'll get hype."
  },
  {
    "text" : "Okay. Uh the Broncos explanation for the infraction goes something like this. Owner Pat Bolin was trying to build a new stadium for the Broncos and was short on cash. So he asked Elway and running back Terrell Davis to forfeit some of their paycheck now, and in return, he would pay them back plus interest after the season. Just cash. She's giving them checks. Yeah, fuck it outside, you know? Just just give 'em uh just give them a cut and be like, yeah, let's see. As soon as you retire, we'll give you a cushy fucking job as GM and let you draft a bunch of shitty quarterbacks that will never replace you. In the Ring of Honor in uh in Denver.",
    "speaker" : "Andy",
    "timestamp" : "55:27-56:00"
  },
  {
    "text" : "Make all the calls to the franchise. It'll be fine.",
    "timestamp" : "56:01-56:03",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. So awesome.",
    "timestamp" : "56:03-56:07"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "56:08-56:21",
    "text" : "Steve, can we designate you our salary cap guy? I feel you'd be good at that. Yeah, you're a numbers guy, right? You're a numbers cruncher. Can you be our like salary cap question answerer?"
  },
  {
    "timestamp" : "56:21-56:23",
    "speaker" : "Andy",
    "text" : "Yeah, can you get some excel spreadsheets going, please?"
  },
  {
    "text" : "No. I can be a gift suggester guy though.",
    "timestamp" : "56:24-56:30",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "56:30-56:32",
    "text" : "Gif suggest or gif or gifts."
  },
  {
    "text" : "Show me how to rip gifts like you do for your website.",
    "timestamp" : "56:32-56:35",
    "speaker" : "Steve"
  },
  {
    "text" : "I have to rip any gifts.",
    "timestamp" : "56:35-56:36",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "56:37-56:46",
    "speaker" : "Andy",
    "text" : "Okay. What are they? What are you suggesting? Yeah. By all means, I'll be leg dick guy."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:46-56:53",
    "text" : "This is Tom Brady, right after he he like nearly tears his ligament talking to Damian Heward."
  },
  {
    "timestamp" : "56:53-56:54",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "56:55-56:59",
    "text" : "Yeah. So this is sort of like how it started, right?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "56:59-57:02",
    "speaker" : "Greg",
    "text" : "Because they're down there, I mean you get some audio here?"
  },
  {
    "timestamp" : "57:02-57:04",
    "speaker" : "Steve",
    "text" : "There's no audio needed."
  },
  {
    "speaker" : "Greg",
    "text" : "Well, I mean this is an audio, it's a podcast. Yeah, sorry.",
    "timestamp" : "57:05-57:10"
  },
  {
    "text" : "Greg, you you pla you play Tom Brady, I'll play Damon Hewitt.",
    "timestamp" : "57:10-57:13",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Hey Tom, yo dude, did you see that shit? Yo Tom. Yo, he was so close to my knee, dude.",
    "timestamp" : "57:15-57:24"
  },
  {
    "text" : "How's your uh pliability? He's just fucking he's not even talking to Damon Hewitt.",
    "timestamp" : "57:24-57:30",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Get fucked Tom, do you like my face mask?",
    "timestamp" : "57:30-57:32"
  },
  {
    "text" : "I got it from the tight ends. They really liked it.",
    "speaker" : "Andy",
    "timestamp" : "57:34-57:37"
  },
  {
    "speaker" : "Greg",
    "text" : "What kind of name is Heward anyway?",
    "timestamp" : "57:38-57:39"
  },
  {
    "timestamp" : "57:39-57:42",
    "speaker" : "Andy",
    "text" : "They speak highly of it. What kind of name is Damon?"
  },
  {
    "text" : "It's the name of the devil. Can we get some audio on one of these, Stevie?",
    "speaker" : "Greg",
    "timestamp" : "57:45-57:48"
  },
  {
    "text" : "I have some audio, but they're uh Yeah, the highlights on the website I don't have audio, but I I have one on the code.",
    "timestamp" : "57:51-57:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Tom Brady is uh Steve, you know this is a podcast, yes? So the people that are listening cannot see what you see.",
    "timestamp" : "57:58-58:07"
  },
  {
    "timestamp" : "58:08-58:13",
    "speaker" : "Andy",
    "text" : "All right. I I've got one that's um that's pretty great."
  },
  {
    "timestamp" : "58:13-58:30",
    "text" : "So uh can you go to if you can line up when Louis Malay hits Brady, I just want to hear Leg Dick. Because I'm not crazy in that he didn't go, yeah, someone fell on his leg, Dick. He said leg dick.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Debating that though. I think that we all agree that Dan Diodorf says the dumbest shit of all time.",
    "timestamp" : "58:33-58:36"
  },
  {
    "text" : "Old Leg Dick Diodorf. I mean, do you know?",
    "speaker" : "Greg",
    "timestamp" : "58:37-58:40"
  },
  {
    "speaker" : "Steve",
    "text" : "Make any creepy comments about Leg Dick Diodorf, dude.",
    "timestamp" : "58:41-58:45"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "58:46-58:59",
    "text" : "That's almost as good as WD33, Andy. Oh, right. What was that from? That's uh Falk. Oh that's right, because he he just keeps the keeps the He's the Grease monkey. Yeah. The human lubricant."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh do we know when about that the time that was? Um This is gonna be bad radio, but it's the second quarter.",
    "timestamp" : "59:01-59:09"
  },
  {
    "speaker" : "Steve",
    "text" : "So it'll be just like, I don't know, maybe a couple minutes before 47.",
    "timestamp" : "59:11-59:14"
  },
  {
    "speaker" : "Greg",
    "text" : "Well well while while he looks for it, uh Steve, do you think that was a dirty play?",
    "timestamp" : "59:14-59:19"
  },
  {
    "text" : "No, it did look it look he got kind of blocked in the back and like shoved down more. Whereas the Bernard Polla game, he was already on the ground and then made like an extra lunge or lawyer was sort of like pushed down.",
    "timestamp" : "59:20-59:31",
    "speaker" : "Steve"
  },
  {
    "text" : "If it was a player other than Lawyer Malloy, I have the feeling you would say it's dirty.",
    "timestamp" : "59:31-59:37",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "59:37-59:51",
    "text" : "I don't think so because the week 17 blow up already down and then he made the lunge where lawyers like It's just like a dude getting rolled up like blocking or like you know you're blocking and someone gets rolled up behind you. It was a similar sort of play where it wasn't like lawyer was going for his knee."
  },
  {
    "text" : "I just feel like in the NFL, all those plays are kind of like that.",
    "timestamp" : "59:52-59:56",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "59:56-01:00:04",
    "text" : "Mm-mm. The Bernard Paul here was different because he definitely made like an effort to he's already on the ground and then like then lunged at him.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I agree with that.",
    "timestamp" : "01:00:04-01:00:05"
  },
  {
    "speaker" : "Greg",
    "text" : "I think you guys are just you're viewing these through rose-colored glasses and that you like Lloyd Malloy and you don't want you don't want him to hate. the Patriots, but he does.",
    "timestamp" : "01:00:06-01:00:17"
  },
  {
    "speaker" : "Steve",
    "text" : "Well dude, he there's clear evidence that he was really good friends.",
    "timestamp" : "01:00:17-01:00:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Well yeah, yeah, he yeah he sold Tom Brady his house.",
    "timestamp" : "01:00:20-01:00:23"
  },
  {
    "text" : "Yeah Oh well in that case you could never do a dirty hit Andy. He's not even go out there and try to fucking tear Tom Brady's knee off. And that's also not who he was, where Bernard Pollard has a bit of a who he was.",
    "timestamp" : "01:00:24-01:00:35",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "What do you know? Bernard Pollard has a uh a tracker. What if Harris what if Harrison did that? Oh, that would probably do on the edge.",
    "timestamp" : "01:00:35-01:00:44"
  },
  {
    "timestamp" : "01:00:46-01:00:50",
    "speaker" : "Andy",
    "text" : "Yeah, for sure. We just say it was spirited. All right, I think I found it here."
  },
  {
    "timestamp" : "01:00:51-01:01:36",
    "text" : "Barely into the second quarter. Talk about it. His arm's gonna fall off before this thing's over. To help out. So there's a sack for Buffalo. Well they're hoping that the play action here but a field position. Brady. Join forgivens. Incomplete. And boy did Tom Brady have somebody fall on his leg, Dick, and he is hurt. And boy did Tom Brady have somebody fall on his leg, Dick, and he Incomplete. And boy did Tom Brady have somebody fall on his leg dick and he is hurt. He is and boy did Tom Brady have somebody fall on his leg dick and he is hurt",
    "speaker" : "Announcer"
  },
  {
    "speaker" : "Greg",
    "text" : "You don't feel ball in your leg dick. So I'm like Dick Brady.",
    "timestamp" : "01:01:37-01:01:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh shit.",
    "timestamp" : "01:01:51-01:01:53"
  },
  {
    "timestamp" : "01:01:53-01:02:12",
    "speaker" : "Greg",
    "text" : "Oh, I tell ya. You never want to see it, a man tripping on his leg deck. Oh no. Oh God. That's awesome. I was right though. Yeah. I'm like Dick Brady."
  },
  {
    "speaker" : "Andy",
    "text" : "All right, but I and I also think you're right. Like this is where he says talks about the ligaments too. Yeah, oh yeah, yeah. Yeah, it's a great idea.",
    "timestamp" : "01:02:13-01:02:18"
  },
  {
    "timestamp" : "01:02:19-01:02:32",
    "speaker" : "Steve",
    "text" : "They showed that replay over and over again. It was like Oh yeah. They show the wide right replay. They show Drew Bledsoe getting his lung caved in replay. They were just like, hey, let's hit all the lowlights."
  },
  {
    "text" : "Oh, this is really awkward. Coming from the far side. Might have been Malloy, his good friend. It is lawyer Malloy. And oh look at the left knee and ankle of Tom Brady. Oh boy. That is when a quarterback is at his most vulnerable. Standing there with your legs straight out and that that hurt. You can almost see the bend, it's remarkable that But uh the only thing I can say is I hope Tom Brady has loose ligaments.",
    "timestamp" : "01:02:38-01:03:08",
    "speaker" : "Announcer"
  },
  {
    "text" : "I love Deodorf. I don't care what anyone says.",
    "speaker" : "Greg",
    "timestamp" : "01:03:09-01:03:12"
  },
  {
    "timestamp" : "01:03:14-01:03:19",
    "speaker" : "Andy",
    "text" : "He's such an idiot. I'm I'm on AD. He's so bad. Dan Deerdorf MD."
  },
  {
    "speaker" : "Greg",
    "text" : "But he's like, it's you know when movies get so bad they're good? You know, there's uh this the the thing I hate are movies that are like somewhere in between. Like Either be so bad you're entertaining.",
    "timestamp" : "01:03:19-01:03:31"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:03:32-01:03:37",
    "text" : "Yeah, but like if you watch like a ton of movies that are so bad they're good, you know, like those are good ones in a while."
  },
  {
    "text" : "That's a good point.",
    "timestamp" : "01:03:37-01:03:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "You don't have to get too much of them. That's true.",
    "timestamp" : "01:03:38-01:03:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:39-01:03:51",
    "text" : "Yeah. I think that's that's my issue with him. He's so corny all the goddamn time. Yeah. And he roosted him. He plays the sacks and he has some sacks. His arm's gonna fall off. He's throwing it so much."
  },
  {
    "timestamp" : "01:03:51-01:03:53",
    "speaker" : "Greg",
    "text" : "Like that's just dumb."
  },
  {
    "text" : "Right. And also how many times did Tom Brady throw it? Like 25 times in the first half? Yeah. Yeah. He threw it 21 times uh 32 times this game. Arm's gonna fall off. Jesus. All right, you want to do best and worse? Yeah, I got some best and worsts. Alright. Given to me, Steven.",
    "timestamp" : "01:03:53-01:04:13",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh there was a stat where someone had thrown five touchdowns in a game when when Brady was on fire in the first half and like, oh one's gonna throw five touchdowns in the game and like tie the record. And then doesn't he then later throw five touchdowns and a half?",
    "speaker" : "Steve",
    "timestamp" : "01:04:14-01:04:31"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:31-01:05:02",
    "text" : "He does. So No, no, he'll get there. Yeah. Do you remember who it was that uh whose record it was with five touchdowns and a half in a game? Steve Grogan in nineteen seventy nine versus Jets. And they were like, Tom Brady was two years old. Oh my god, can you imagine? Yeah, that's how time works, bro. Like what what did you expect? Come out of the womb hocking footballs? Like I I don't I don't understand what you're do what you're getting at there. Well they're getting it that's an old record, Andy."
  },
  {
    "speaker" : "Greg",
    "text" : "Do you not agree? I don't think that's where they were going with it though. I'm I'm standing in, dear. I can see that. I'm gonna stand I'm fighting the good fight for my boy Dan.",
    "timestamp" : "01:05:02-01:05:14"
  },
  {
    "text" : "So all right, great. If you had to pick one to spend uh an eternity on uh an island, just the two of you. Would it be your choices are Dan Diodorf or Bill Belichick? Oh.",
    "timestamp" : "01:05:14-01:05:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean you guys first. Steve for sure.",
    "timestamp" : "01:05:33-01:05:38"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, we have him all the time.",
    "timestamp" : "01:05:39-01:05:40"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:05:40-01:06:07",
    "text" : "Yeah, he gives great foot rubs. Yeah. I don't know. That's a good question. Belichick's probably wicked boring, dude. I mean I bet he's it's like would you rather be bored or like wicked annoyed? Yeah. It's a really good one. I guess bored. Maybe if you like broke Belichick down enough you could get him to open up. I bet he would, yeah. I uh you know he's like boring on on purpose, I feel like."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And and every time you hear like uh when he's mic'd up and stuff, he's always like tr telling jokes and shit. But they're like not great the jokes. Like, oh, did I tell you about that one when I was coaching the Browns back in the 80s? Yeah. All the players like, yeah, about this guy. Like, yeah, isn't that funny Yeah, coach.",
    "timestamp" : "01:06:08-01:06:24"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, when all you care about is football, you're just not gonna be like a well-rounded, like good fun person to hang out with. No, no, no.",
    "timestamp" : "01:06:24-01:06:31"
  },
  {
    "timestamp" : "01:06:34-01:06:36",
    "text" : "Can I do my uh other bests?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:06:37-01:06:38",
    "speaker" : "Greg",
    "text" : "Yeah, you sure can."
  },
  {
    "speaker" : "Steve",
    "text" : "Um one, I looked up the radio announcers. From remember they had the Bills guy on?",
    "timestamp" : "01:06:39-01:06:46"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah.",
    "timestamp" : "01:06:46-01:06:47"
  },
  {
    "text" : "They said he was the longest serving radio announcer in NFL history. The Bills guy who'd been doing it since the Bills were created as a franchise.",
    "timestamp" : "01:06:47-01:06:56",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:06:56-01:07:02",
    "speaker" : "Andy",
    "text" : "Yeah, but didn't they say he missed he missed it for seven years because like The radio station went under or something?"
  },
  {
    "timestamp" : "01:07:04-01:07:34",
    "speaker" : "Steve",
    "text" : "They said he was the in second place was Gil Santos. Oh no shit. So I looked up who had a longer career, like who will who who Gil fucking crushes him. Really? Oh yeah. So was Gil in first place? That schmo was like 1957 to 2002. Oh, whatever. Who's the longest? Oh, I didn't look that up."
  },
  {
    "text" : "Probably uh the guy from the Cubs, right? He was there forever.",
    "speaker" : "Greg",
    "timestamp" : "01:07:34-01:07:38"
  },
  {
    "text" : "Well, I'm thinking it was just football because that guy started when the Bills started. Yeah. And Gill must not have been too far behind either, right? Even the Patriots started.",
    "timestamp" : "01:07:38-01:07:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Well he played for the Patriots when the Patriots started.",
    "timestamp" : "01:07:49-01:07:50"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:07:57-01:07:58"
  },
  {
    "timestamp" : "01:07:58-01:08:11",
    "text" : "Yeah. All right. And then my best best is this next gift. I'm going to share screen again. Oh good. Yep. No audio. Okay. Can you can you give us a this this is such a throwback gift play by playing?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:08:11-01:08:14",
    "speaker" : "Andy",
    "text" : "Steve can't you should be able to share your audio too."
  },
  {
    "speaker" : "Steve",
    "text" : "There's no audio though, it's just Mike Frabel Okay. Is Mike Rabel in his he must have had a baller game wearing the shark tooth hat, which you're wearing right now, Greg.",
    "timestamp" : "01:08:14-01:08:24"
  },
  {
    "text" : "Uh-huh.",
    "timestamp" : "01:08:24-01:08:24",
    "speaker" : "Greg"
  },
  {
    "text" : "Just looking super young. And then it pulls up his little stat line of how long it's been in the year, seven years, Ohio State, age 28. And you're just sitting here chilling on the sideline as a peaches on nothing.",
    "speaker" : "Steve",
    "timestamp" : "01:08:25-01:08:40"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:08:40-01:08:46",
    "text" : "Little did we know he would guarantee he would cut off his penis if the Tennessee Titans would win a Super Bowl."
  },
  {
    "text" : "How far we've come Oh man, football's different these days. I don't I can't put my thumb on it. But oh man Uh all right, Gregory, you want to do your best and worse?",
    "speaker" : "Andy",
    "timestamp" : "01:08:46-01:09:04"
  },
  {
    "timestamp" : "01:09:04-01:09:13",
    "speaker" : "Greg",
    "text" : "Yes, I do. Okay. So my best was a Sam Gash sighting. Yes."
  },
  {
    "timestamp" : "01:09:13-01:09:15",
    "speaker" : "Andy",
    "text" : "Best name for a fullback?"
  },
  {
    "text" : "Yeah. Uh no, I look up his Wikipedia. He's got a cousin named Thad Gash. Thad Alvin Gash Jr. Which is such a kick-ass name.",
    "timestamp" : "01:09:15-01:09:29",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:09:29-01:09:36",
    "text" : "To be honest, like I usually shit on the juniors, like name of your kid after yourself, but if your name is Thad Gash You goddamn write your name and you can't."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:09:37-01:10:08",
    "text" : "Yeah, that gives you rolls. Played in the NFL too, apparently. Oh damn. Um pullback? Had to be. I have no idea. Another interesting note about Sam Gash, I mean, obviously, you know, old school Pats fans will know he played for the past for years. He um he made a Pro Bowl. He didn't make a Pro Bowl with the Pats, but he did make a Pro Bowl, and he was the first ever back in NFL history to make the Pro Bowl without a single rushing attempt in the regular season."
  },
  {
    "timestamp" : "01:10:09-01:10:10",
    "speaker" : "Andy",
    "text" : "Holy shit."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:10:10-01:10:10"
  },
  {
    "speaker" : "Andy",
    "text" : "No way. That's impressive. He's just that good of a road grader, huh?",
    "timestamp" : "01:10:10-01:10:15"
  },
  {
    "timestamp" : "01:10:15-01:10:22",
    "speaker" : "Greg",
    "text" : "Yeah, I guess so. I think he might have caught I think he was more like a passing option at times. Because he caught a pass in this game."
  },
  {
    "text" : "He did. I mean it didn't it's like it didn't look particularly natural. Yeah. Please know Mark Edwards, if you will. Yeah, for for somebody who's supposed to open up holes. Like that's perfect.",
    "timestamp" : "01:10:22-01:10:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. Um my worst is gonna be um Probably Lawyer Malloy's mood directly after this game. Like I can't imagine what was going through his head where the turnaround from week one where He thinks he's going on to like a Super Bowl contender. They beat the pass 31-0. The whole city's behind them. They got bled, so they got a stacked ass team. They're 2-0. They're like Dude, this was such a good decision to go to Buffalo.",
    "timestamp" : "01:10:37-01:11:08"
  },
  {
    "timestamp" : "01:11:08-01:11:13",
    "speaker" : "Andy",
    "text" : "I'm gonna fucking sti I'm gonna shove this down Belichick's throat too. And in the wrong thing."
  },
  {
    "speaker" : "Greg",
    "text" : "They're out of the playoffs. He just fucking hurt his buddy Tom Brady. Yeah. And they fucking are trash.",
    "timestamp" : "01:11:14-01:11:22"
  },
  {
    "text" : "Also, uh on the Patriots first drive, it was Loy Malloy who's called for defensive pass interference in the end zone, which set up the first touchdown.",
    "speaker" : "Andy",
    "timestamp" : "01:11:22-01:11:31"
  },
  {
    "speaker" : "Greg",
    "text" : "And like he was the the closest player to Givens when Givens scored his touchdown too. So not even a great game from Lawyer. Yeah, I mean I I I still love Lawyer Malloy and I'll always love Lawyer Malloy. Absolutely. Part of the law firm, but just it you you gotta feel for him for His dreams being shattered at this point. Yeah, that's brutal.",
    "timestamp" : "01:11:31-01:11:55"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:56-01:12:07",
    "text" : "Yeah, because I mean, and he I guess he kind of had uh a say in the decision at the beginning of the season. But like he was also being asked to like take a yeah, yeah."
  },
  {
    "timestamp" : "01:12:07-01:12:14",
    "speaker" : "Greg",
    "text" : "So I understand that. I got no problem with decision he made, you know. No. He's he's a he's a pro. He needs to look out for his family. I get that."
  },
  {
    "text" : "Oh yeah, absolutely.",
    "timestamp" : "01:12:15-01:12:16",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:12:16-01:12:35",
    "text" : "So it sucks. It does suck. Yeah. That's what I'm saying. It's all about setting expectations in life. Where if you expect to be bad, you'll never be disappointed. But if you Set that bar too high. You know, you're asking for the hurt.",
    "speaker" : "Greg"
  },
  {
    "text" : "And there's something with like a dumpster and a trash can or something like that, Greg. You have an analogy for this.",
    "timestamp" : "01:12:35-01:12:41",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:12:42-01:12:42",
    "text" : "What?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:12:43-01:12:48",
    "text" : "If like you expect uh a dumpster and you get a trash can, you'd be like, oh, all right.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:12:51-01:12:53",
    "text" : "I think we talked about it in the pod before."
  },
  {
    "timestamp" : "01:12:54-01:12:59",
    "speaker" : "Andy",
    "text" : "I haven't heard that. I don't remember that at all. Yeah. I like the setting expectations. That's good."
  },
  {
    "text" : "That's Greg's approach with his wife, with Kelly.",
    "speaker" : "Steve",
    "timestamp" : "01:12:59-01:13:01"
  },
  {
    "text" : "Yeah. Yeah, that's yeah, exactly. Setting expectations is it's it's a real part of life that we need to get better at, you know? I agree.",
    "speaker" : "Greg",
    "timestamp" : "01:13:07-01:13:15"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. Both at at work and and in your personal life. Mm-hmm. Yeah. And you want to set them as low as possible is the key, I think.",
    "timestamp" : "01:13:15-01:13:23"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, we're all we're all mediocre. The three of us are like definition of mediocre.",
    "timestamp" : "01:13:23-01:13:29"
  },
  {
    "timestamp" : "01:13:29-01:13:39",
    "text" : "Oh yeah. And the soon three white guys with a podcast. Like that's that if you look up mediocre in the in the dictionary, it's it's three white men with uh a podcast.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:13:39-01:13:43",
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. We're we're actually a cliche, we're a meme. Yeah."
  },
  {
    "timestamp" : "01:13:43-01:13:43",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "This podcast that we're doing now.",
    "timestamp" : "01:13:44-01:13:45"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. What do you what do you call uh a group of white males? You call them a a podcast.",
    "timestamp" : "01:13:45-01:13:51"
  },
  {
    "speaker" : "Greg",
    "text" : "Yelling into the abyss. Exactly. Yelling into the universe.",
    "timestamp" : "01:13:52-01:13:56"
  },
  {
    "text" : "Uh well, all right, that took a turn. I wasn't expecting.",
    "speaker" : "Andy",
    "timestamp" : "01:13:58-01:14:02"
  },
  {
    "speaker" : "Greg",
    "text" : "You know we're all gonna die one day. You guys have to get that?",
    "timestamp" : "01:14:02-01:14:05"
  },
  {
    "timestamp" : "01:14:06-01:14:08",
    "speaker" : "Andy",
    "text" : "Yeah, but you know what'll live on forever This is the first one."
  },
  {
    "timestamp" : "01:14:14-01:14:31",
    "speaker" : "Greg",
    "text" : "Dude, that leg dick fucking comment that That's in the annals of time. Yeah. Oh God. There's somebody in like 2060 when the Pats are terrible. They're gonna be like, I wonder how it was when Brady was playing. And they're be like, damn, this Dan Diedor sounds like a dickhead."
  },
  {
    "speaker" : "Andy",
    "text" : "I wonder where he's buried. I'm gonna go piss on his grave. Too far? Too far. Yeah. I'll take that back. Alright, I'll do my best and worst to recover from that. My best, I got a couple. Um first one is Tully Bandicane's first sack of his career.",
    "timestamp" : "01:14:34-01:14:52"
  },
  {
    "text" : "Oh yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:14:52-01:14:52"
  },
  {
    "timestamp" : "01:14:53-01:15:16",
    "text" : "Oh. TBC. Where he just kind of wrapped up Drew Bledsoe and then like didn't tackle him because Bledsoe had like a flip. Tell you Banta Cain and also um Gerard Cherry had a nice blitz off the edge and he caught what was the name Travis Brown? Completely unaware. And I think may have concussed him too. That was It was a brutal hit.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:15:16-01:15:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:15:17-01:15:52",
    "text" : "Um, so Tully, uh, who hopefully we'll have on to discuss credit cards would be good. Um Also, Tom Brady did not throw an interception at home in this season. All 12 of his interceptions came on the road. And the Patriots now have home field advantage all the way through the playoffs. So that might work out. Uh and then my last best, uh well, yeah. They they talked about David Gibbons. And did you boys realize that he was a running back at Notre Dame who converted to wide receiver? I had no idea."
  },
  {
    "text" : "No, I remember like being his staff where like he had like twenty catches his senior year, something crazy.",
    "speaker" : "Greg",
    "timestamp" : "01:15:52-01:15:59"
  },
  {
    "text" : "I don't know. That's uh that's what the commentator said that he was uh a running back at Notre Dame and then he converted to wide receiver and the pages draft him as a as a wide out. He looks like that. If that's the case, he is yeah, he's a natural wide receiver. He's like, but he's also like built like a big wide receiver too.",
    "timestamp" : "01:16:04-01:16:18",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Like that's not that's not a running back build. I wrote this down watching this game. He is what we all wish Nikhil Harry could be. Or Malcolm Mitchell.",
    "timestamp" : "01:16:18-01:16:30"
  },
  {
    "timestamp" : "01:16:30-01:16:54",
    "text" : "Well Malcolm Mitchell like was he he was, but like that's that's the prototype that I think Belichick was looking for was that David Givens and then the Malcolm Mitchell and probably even Aaron Dobson. The big bodied wide receiver, Aaron Dropson. Call him what you will. Kembrell Dropkins. That one doesn't quite work, but I like it. But speak speaking of misses.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:16:54-01:17:06",
    "speaker" : "Steve",
    "text" : "They're bullshit, Andy. In uh 2000, he had 24 rushing attempts, 25 catches. And then a senior he had 33 catches, six rushes."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:17:06-01:17:11",
    "text" : "Yeah. So yeah, so he started as a running back, converted in college to a wide out."
  },
  {
    "timestamp" : "01:17:12-01:17:15",
    "text" : "But like 1999 he had 14 catches and 13 rushes.",
    "speaker" : "Steve"
  },
  {
    "text" : "So he was kind of both. Suck on that.",
    "timestamp" : "01:17:15-01:17:17",
    "speaker" : "Andy"
  },
  {
    "text" : "First period or carries.",
    "speaker" : "Steve",
    "timestamp" : "01:17:17-01:17:19"
  },
  {
    "text" : "And no catches. So he's basically James White. Cool. You showed me.",
    "timestamp" : "01:17:20-01:17:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "My worst other than a lot of things. We're getting a little spicy on the pod here tonight.",
    "timestamp" : "01:17:24-01:17:29"
  },
  {
    "text" : "Well he did have seven rushing touchdowns, three.",
    "speaker" : "Steve",
    "timestamp" : "01:17:29-01:17:31"
  },
  {
    "text" : "Do you guys want to talk about it? Is there something there's something going on between you guys that you want to talk about?",
    "speaker" : "Greg",
    "timestamp" : "01:17:31-01:17:37"
  },
  {
    "text" : "Yeah, I'm just I'm just sincerely jealous that he has a dog and I don't. So I'm taking it out of him on the podcast. It was pretty great. Yeah, go fuck yourself.",
    "timestamp" : "01:17:37-01:17:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, dude. Those those videos that you send every day that are all the same, they're sick.",
    "timestamp" : "01:17:47-01:17:52"
  },
  {
    "text" : "I love them. I'm living vicariously. Yeah, they're not for you.",
    "timestamp" : "01:17:52-01:17:57",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:17:58-01:18:04",
    "text" : "Yeah well many just know every time you send one there's someone out there that hates it Steve.",
    "speaker" : "Greg"
  },
  {
    "text" : "Well no that's not no Greg. If I was posting the Facebook, that would be true. But I put it in our group chat for our family, so I know it's not somebody who hates it. It's specifically me.",
    "speaker" : "Steve",
    "timestamp" : "01:18:05-01:18:15"
  },
  {
    "text" : "So Greg, uh is is there something you want to get on? Is there something between you and Steve?",
    "speaker" : "Andy",
    "timestamp" : "01:18:16-01:18:20"
  },
  {
    "timestamp" : "01:18:20-01:18:37",
    "speaker" : "Greg",
    "text" : "what's going on there's always been something there's always been something yeah pick from the fucking list first of all he's a big dumb asshole okay he's a pea brained fucking Uncouth piece of shit. So we'll start there. Uncouth. Okay."
  },
  {
    "timestamp" : "01:18:38-01:18:40",
    "speaker" : "Steve",
    "text" : "As the pot calls the kettle flat."
  },
  {
    "speaker" : "Greg",
    "text" : "I was trying to think of that word that you use about like people that are bad at technology. What is it? Oh um No, no, it's uh Mennonite, isn't that a religion? I think it is. A Luddite. A Luddite, that's what it is. Yeah. I actually heard ever since you explained that word to me, I'm hearing it everywhere. You know how that happens sometimes? Yep. It's a great word. Yeah.",
    "timestamp" : "01:18:40-01:19:04"
  },
  {
    "text" : "I I hate technology. What do you mean",
    "timestamp" : "01:19:07-01:19:10",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:19:10-01:19:12",
    "speaker" : "Greg",
    "text" : "I don't know. It's just a sweet word, dude."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, okay.",
    "timestamp" : "01:19:13-01:19:14"
  },
  {
    "speaker" : "Andy",
    "text" : "Cool. But yeah, speaking of misses, my worst, Adam Vinateri has missed nine field goals this season. That's the most he's ever missed.",
    "timestamp" : "01:19:14-01:19:23"
  },
  {
    "text" : "24 yarders.",
    "timestamp" : "01:19:24-01:19:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes.",
    "timestamp" : "01:19:25-01:19:26"
  },
  {
    "text" : "Yeah, missed a chip shot. And then went and got them another field goal anyways.",
    "speaker" : "Steve",
    "timestamp" : "01:19:26-01:19:32"
  },
  {
    "text" : "Yeah. Yeah, because it was 28 out there.",
    "speaker" : "Andy",
    "timestamp" : "01:19:32-01:19:34"
  },
  {
    "speaker" : "Greg",
    "text" : "Were they playing for the 31, do you think? Yes, I definitely think Belichick would do that. No, because I think if they were, they would have left the defensive starters.",
    "timestamp" : "01:19:38-01:19:46"
  },
  {
    "timestamp" : "01:19:51-01:19:56",
    "text" : "But you could argue that. Let's just kick it to a goal. Yeah, I don't think so.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:19:56-01:20:00",
    "speaker" : "Greg",
    "text" : "I I think that's always a question with Belichick, right? Does he do things out of spite?"
  },
  {
    "text" : "Definitely does.",
    "speaker" : "Steve",
    "timestamp" : "01:20:01-01:20:01"
  },
  {
    "timestamp" : "01:20:02-01:20:08",
    "text" : "Where like play calling seems to say it, but I mean he would never admit it a million years. But the fuck you touchdowns of 07.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yep.",
    "timestamp" : "01:20:08-01:20:09"
  },
  {
    "timestamp" : "01:20:09-01:20:12",
    "text" : "Yep. We're definitely like there's some spite in there.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:20:12-01:20:33",
    "text" : "Oh yeah, running up the score just in every game in 07 was I think getting it 31-0 was also a fuck you because As soon as Vinatari misses that, you see on his face, he's like, what the fuck? And then they go and get the because when he's lining it up, I was like Oh, here is the 31-nothing and he misses it. I was like, oh, we kick another field goal. And the next field goal they kick was also 24 yards."
  },
  {
    "text" : "Yeah. And he almost hooked that one too.",
    "timestamp" : "01:20:33-01:20:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "So pissed.",
    "timestamp" : "01:20:35-01:20:37"
  },
  {
    "text" : "But no, I I I don't think in this case it was. I think it was just Belichick being Belichick, oh, this lead isn't big enough. Because it's it's Drew Bledsoe. I mean, obviously, I don't think there was ever a chance, but it's like 28 to 3 being down being up 28 to 3 in the third quarter of a a Super Bowl, you know? Like it's the lead's just not big enough to guarantee that you're gonna win. So you're gonna keep trying to add some points.",
    "speaker" : "Andy",
    "timestamp" : "01:20:38-01:21:06"
  },
  {
    "text" : "All right. I think you're wrong. But I also negative.",
    "speaker" : "Steve",
    "timestamp" : "01:21:06-01:21:13"
  },
  {
    "speaker" : "Andy",
    "text" : "Explain to me this.",
    "timestamp" : "01:21:13-01:21:13"
  },
  {
    "speaker" : "Steve",
    "text" : "You guys just moved on after I gave my best. I didn't get to do my worst.",
    "timestamp" : "01:21:14-01:21:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:17-01:21:52",
    "text" : "Explain to me this before you do your worst. Yeah, let's get through this argument here. If Belichick Was that concerned about winning 31-0? Why did he pull his defense before the last couple of drives? Good point. Steve, care to comment? But his backups let the other team drive straight down the field to the one yard. Yeah. But then they gave up a bunch of big plays that Put the uh the put the Bills on the one yard line. First and goal from the one with seventeen seconds left. For the whole team. And Travis Henry was already rushed for a hundred yards."
  },
  {
    "speaker" : "Steve",
    "text" : "He's he's uh he's building uh trust in his team and depth in his squad before the play.",
    "timestamp" : "01:21:52-01:21:57"
  },
  {
    "timestamp" : "01:21:57-01:22:03",
    "speaker" : "Andy",
    "text" : "I agree. But that's not what you do when you want to spin yeah when you want to win thirty-one nothing exactly."
  },
  {
    "speaker" : "Steve",
    "text" : "I'm just saying they got conservative in the red zone because they just want to kick the field goal and make it 31 nothing as opposed to 35. He didn't Garrett shirt give a shit. They were still slinging it.",
    "timestamp" : "01:22:03-01:22:12"
  },
  {
    "timestamp" : "01:22:12-01:22:16",
    "speaker" : "Andy",
    "text" : "Brady missed a couple of end zone throws when they were settled in for those."
  },
  {
    "speaker" : "Steve",
    "text" : "And my worst is actually a point in your column because listen to the Bills penetration into the Patriots. Oh yeah. What? New England 26? Yeah. New England fifteen. New England 17. New England 22. New England one yard line and a total of zero points.",
    "timestamp" : "01:22:16-01:22:38"
  },
  {
    "text" : "Zero points, yeah. They got in the red zone like five times.",
    "speaker" : "Andy",
    "timestamp" : "01:22:38-01:22:41"
  },
  {
    "text" : "They were inside the red zone all the time and just",
    "speaker" : "Steve",
    "timestamp" : "01:22:42-01:22:44"
  },
  {
    "timestamp" : "01:22:45-01:23:14",
    "text" : "And zero points. You're right back up. And then sack and then miss on fourth down because they're uh their kicker. was uh because you know how they show that like that line like the the cool graph that they did like overlaid on the the field when the field goal will come out. Yeah. It's like, oh, for so from 10 to 20, he's 92%. And then from 20 to 30, he's 100%. And then from 30 to 40, 50%. Can't kick a field goal over over 30 yards.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That's not good for the NFL. Oh. Oh it's Greg Williams coach team though, so you know he's honorable man or whatever the fuck it is. Yeah, so that was uh gotta have empathy for Greg Williams in this case.",
    "timestamp" : "01:23:15-01:23:30"
  },
  {
    "timestamp" : "01:23:31-01:23:47",
    "text" : "Yeah, well I don't know if this is a best or a worst, but this was Greg Williams' last Game as the head coach of the Buffalo. Oh, he did get fired. Good. He did. This was it. This is his what this is how he went out, which felt fitting. So I guess that's a best. Worst for him, but the best for us.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:23:47-01:23:52",
    "speaker" : "Steve",
    "text" : "I actually, in researching that, found an error in profootballreference. com. Did you?"
  },
  {
    "text" : "No, you didn't.",
    "speaker" : "Greg",
    "timestamp" : "01:23:52-01:23:53"
  },
  {
    "text" : "Yes, I did.",
    "timestamp" : "01:23:53-01:23:53",
    "speaker" : "Steve"
  },
  {
    "text" : "Refuse to believe that I'm almost numbered.",
    "timestamp" : "01:23:54-01:23:57",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "That was a Ryan Lindell 40 yard field goal no good. And if you remember, Andy, the they got a penalty on that. Then they tried the fourth down. There's another one.",
    "timestamp" : "01:23:57-01:24:07"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he missed he missed a few. He missed a 45 yarder and then they hit the penalty and went up for a fourth, and then he missed a four-yard later. Yep. In the quarter. We knew that it's if there's one thing I can guarantee, it's that you're wrong, not pro-football reference. com. Okay.",
    "timestamp" : "01:24:08-01:24:28"
  },
  {
    "timestamp" : "01:24:31-01:24:33",
    "speaker" : "Steve",
    "text" : "This is why we have you to stat check our shit, Red."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, and you know how I stat check?",
    "timestamp" : "01:24:34-01:24:36"
  },
  {
    "speaker" : "Steve",
    "text" : "Pro football reference every fucking time. I'm just stat checking the stats, okay?",
    "timestamp" : "01:24:37-01:24:42"
  },
  {
    "timestamp" : "01:24:43-01:24:49",
    "speaker" : "Andy",
    "text" : "How's that working out? So Steve, did you say you had a worst? Or was that it? Was that take?"
  },
  {
    "speaker" : "Steve",
    "text" : "As a Bill Stan, watching this game, watching them get inside the red zone all those times and come up with zero points has to be the absolute worst.",
    "timestamp" : "01:24:50-01:24:56"
  },
  {
    "text" : "Yeah, it can't be good.",
    "timestamp" : "01:24:57-01:24:58",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:24:58-01:25:12",
    "text" : "Because like I I thought that we whooped the Bills harder than they whooped us the first week. And that might be true in the first half. But like the Bills had chances to put points on the boards and just. Just didn't."
  },
  {
    "speaker" : "Andy",
    "text" : "It was so bad.",
    "timestamp" : "01:25:13-01:25:14"
  },
  {
    "text" : "But maybe getting, but let's say it's beating yourself. It's not like being beat, you know?",
    "timestamp" : "01:25:14-01:25:19",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:25:19-01:26:00",
    "text" : "Yep. Oh, so here's one last thing that I had. They showed a stat of Tom Brady, his numbers from 2001 when he was Super Bowl MVP, and his numbers from 2003. So 01, completion percentage uh just about 64%, 18 touchdowns, 12 interceptions. 2003, uh about 60% completion percentage, 19 touchdowns, 12 interceptions. So, there's some similarities there. I wonder if that will carry over any more of these similarities into the playoffs and maybe into the Super Bowl. I think we'll have to find out next week. Bye week. What's next week? Bye week."
  },
  {
    "speaker" : "Greg",
    "text" : "I suppose it is, isn't it? Tuesday. Thursday. Wednesday? Who are we playing next week? We're playing nobody. It's a bye week. Sit on our couch and watch the wild card. See the annual New England Patriots bye week. That's true.",
    "timestamp" : "01:26:00-01:26:18"
  },
  {
    "text" : "All right.",
    "timestamp" : "01:26:19-01:26:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:26:21-01:26:50",
    "text" : "Well we we and then I don't think that'll make very good radio so we must play the winner of either the Colts. No, we can't play the Colts because they're the four. We could play Denver, who's the six, if they upset the Colts in Indianapolis, or we could play the winner of Baltimore versus Tennessee, which is being played in Tennessee. So Tennessee's pretty heavy favorites because they were 12 and 4 tied pre-AFC South League."
  },
  {
    "text" : "They were favored by one in this game. Really? Yeah, according to according to uh Steve's least favorite website, Pro Football Reference. So that might be wrong.",
    "timestamp" : "01:26:51-01:26:58",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:27:01-01:27:02",
    "speaker" : "Steve",
    "text" : "It's a little announcement. Okay."
  },
  {
    "timestamp" : "01:27:04-01:27:10",
    "speaker" : "Andy",
    "text" : "But yeah, I mean, I think the Ravens were a good team this year. I read the 2000s."
  },
  {
    "timestamp" : "01:27:10-01:27:18",
    "speaker" : "Greg",
    "text" : "Their quarterback play is hilarious. The Ravens? Oh yeah. Yeah, yeah. Do you want to hear their three quarterbacks that threw passes this year?"
  },
  {
    "timestamp" : "01:27:18-01:27:19",
    "speaker" : "Andy",
    "text" : "I'm looking at them."
  },
  {
    "timestamp" : "01:27:19-01:27:28",
    "text" : "Kyle Bowler was number one. Anthony Wright and Chris Redman. Wow. Uh I remember Chris Redmond.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I don't remember Anthony Wright.",
    "speaker" : "Steve",
    "timestamp" : "01:27:28-01:27:30"
  },
  {
    "timestamp" : "01:27:31-01:27:37",
    "text" : "No, I've never heard of Anthony Wright. Never. I guess he wasn't. No. You remember Kyle Bowler, yeah?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:27:37-01:27:44",
    "text" : "How could you not? Kyle Bowler maker. All right. Anthony right, more like Anthony Wrong.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Let's just go right to the playoffs. Yes.",
    "timestamp" : "01:27:47-01:27:50"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:27:50-01:28:02",
    "text" : "This team's good, the Jamal Lewis, 2,000-yard rusher. Yep. Ray Lewis, Ed Reed, Top Ten Defense, Adelius Thomas, Peter Bolloware, Chris McAllister."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:28:04-01:28:08",
    "text" : "Uh the defense was ranked third in yards against and six in points against."
  },
  {
    "timestamp" : "01:28:09-01:28:13",
    "text" : "Yeah, but they're facing And they had like eight pro bowlers compared to the Pats who had two.",
    "speaker" : "Greg"
  },
  {
    "text" : "They're face they're facing country strong pro MVP. This is true, yeah. Co-M VP.",
    "timestamp" : "01:28:13-01:28:19",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:28:19-01:28:38",
    "speaker" : "Andy",
    "text" : "Also Jeff Fisher, noted uh mustache, incredible head coach, who would definitely not get blown out by the Patriots in 2006. Speaking of Tom Brady's six touchdowns. So yeah, so next week we will find out who we're playing. Do we want to spoil it now or no? We're gonna hold off."
  },
  {
    "text" : "I think everyone remembers.",
    "timestamp" : "01:28:38-01:28:39",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:28:40-01:28:41",
    "speaker" : "Andy",
    "text" : "Suspense."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, it's not like a ooh, I wonder what could happen. Let me just Google it real quick.",
    "timestamp" : "01:28:41-01:28:44"
  },
  {
    "timestamp" : "01:28:44-01:28:57",
    "text" : "Well let's also add like uh season awards here. The MVP co there's co-MVPs of the NFL this year. Caden Manning. And Steve McNair. And Steve McNair.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:28:57-01:28:59",
    "text" : "Country Strong. Yes. Country Strong."
  },
  {
    "timestamp" : "01:28:59-01:29:00",
    "text" : "Steve McNair.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:29:01-01:29:04",
    "text" : "The Nap or Extraordinaire. Napra Extraordinaire, yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "My boy. Aaron McNair. So I think I think the the worst doesn't cue you into who we're playing next week, then you're listening to the wrong podcast and you're going to be able to do that.",
    "timestamp" : "01:29:06-01:29:13"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:29:14-01:29:40",
    "text" : "I think the worst thing for the Patriots would would be to have to play both of those. Those players, right? Yeah. That that would be like the hardest road possible to the the Super Bowl. So so hopefully that doesn't happen and the pages will have an easy road to the The big game, and we'll see what happens next week on the Patriots Dynasty Podcast. Oh, also if you have any feedback you want to do, you want to text us? Um, what's the number? I know Steve is remembered. Greg, do you remember?"
  },
  {
    "timestamp" : "01:29:43-01:29:44",
    "text" : "Um 505.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:29:45-01:29:46",
    "text" : "You want to give me an error code?",
    "speaker" : "Andy"
  },
  {
    "text" : "8043. Yes. Yeah. 603-505-8043.",
    "timestamp" : "01:29:46-01:29:50",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, so text the Dynasty hotline. Yo.",
    "speaker" : "Andy",
    "timestamp" : "01:29:50-01:29:53"
  },
  {
    "text" : "If you if you have if this is those memory vitamins have been taken are doing great.",
    "speaker" : "Greg",
    "timestamp" : "01:29:53-01:29:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Is that just you stop smoking weed? No. That wasn't a no. Uh all right, yeah. So next week on the Pages Dynasty podcast, we will see you later. See you later.",
    "timestamp" : "01:30:00-01:30:18"
  }
]