[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom"
  },
  {
    "speaker" : "Andy",
    "text" : "Welcome back to another Patriots Dynasty podcast. I'm your host, Andy Brown. With me are the Brothers Brown. Steve Brown, how's it going?",
    "timestamp" : "00:22-00:32"
  },
  {
    "text" : "Great. Great to be back in the playoffs.",
    "speaker" : "Steve",
    "timestamp" : "00:33-00:35"
  },
  {
    "timestamp" : "00:35-00:48",
    "text" : "Damn right, yeah. Back in the playoffs. Yeah, it's been so long since we've done a playoff episode. A whole season, sorry. And also Greg Brown from Vacation Land, USA.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "00:49-01:12",
    "text" : "Live from South Carolina. Yeah. Pork country. Some Somerton. Went down to my uh local piggly wiggly, picked up some, you know, pork butts. Some fried giblets. Some pig skins. Yeah. Yeah. They legit had a five-pound bag of pork skin."
  },
  {
    "timestamp" : "01:14-01:22",
    "speaker" : "Andy",
    "text" : "That's a lot of pork skin. How many do you think is one is is five pounds of pork skin? Is that just one big old pig?"
  },
  {
    "timestamp" : "01:24-01:28",
    "text" : "The thing was probably the size of my torso, the whole bag itself.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:28-01:34",
    "speaker" : "Steve",
    "text" : "Oh my god. I think a pig hat probably has more than five pounds of skin. I mean they're heavy."
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know.",
    "timestamp" : "01:35-01:35"
  },
  {
    "text" : "Depends how fat, right? Stat check.",
    "timestamp" : "01:35-01:38",
    "speaker" : "Greg"
  },
  {
    "text" : "I don't know. I don't know if we do that sort of stat check here. I don't know what to type in. Speaking of pig skin. Uh we're here to talk about some football. I like that. That's really good. Yeah. Yeah. Not warm weather football, though. This is uh about as cold as it gets. This is the divisional round playoffs. 2003 AFC divisional round Patriots hosting the Tennessee Titans and co-MVP Steve McNair. Country strong. Steve McNair. Air McNair. Air McNair, Nat McNair. So what did you think of the well actually let's uh let's talk about the weather.",
    "timestamp" : "01:40-02:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "02:20-02:22",
    "text" : "That's the the Alright."
  },
  {
    "speaker" : "Steve",
    "text" : "I just sort of forgotten about this game because the next game really overshadows it. And you said to me it was the coldest game in Paige's history.",
    "timestamp" : "02:23-02:31"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "02:31-02:46",
    "text" : "It's debatable. Yeah. Yeah. It's one of like It's one of the coldest games ever. There's like a few games that are all within like a degree or two, so I guess it depends on what your calibration on your thermometer is."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:46-03:07",
    "text" : "Right now. Which um if you're going by the guy in the stands, who I think is probably one of the best props I've seen at a football game, he had one of those um Like you know, the the white thermometer, like the circular ones with the red arrow, but the arrow had broken off and was just sitting at the bottom of it. Which is perfect. So it looks like it's saying negative 60, but it's just like it fell off. It's so cold."
  },
  {
    "timestamp" : "03:07-03:15",
    "speaker" : "Steve",
    "text" : "That was too. But it didn't seem that cold though. No one seemed to be like hating life up there. I don't know."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:19-03:27",
    "text" : "I mean there there were some drop passes I think due to s cold fingers, but I think the people it affected most were our commentators."
  },
  {
    "speaker" : "Greg",
    "text" : "Well let's talk about the let's before we jump. Andy couldn't fucking wait to talk about let's give him the historical context here. This game at kickoff is two degrees Fahrenheit. Fahrenheit. Not Celsius. Two degrees Fahrenheit. Fahrenheit. The negative 11 with windshield. Yeah. So this is like I've been to a couple super cold games.",
    "timestamp" : "03:28-03:56"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "03:56-03:57"
  },
  {
    "text" : "Like I went to Patriots Broncos in 2013, that one where we came back on Manny. Oh yeah. I was so fucking cold during that game. So I looked it up. I'm like, it's gotta be like pretty comparable. It was 22 In that case. And I'm like, I feel like a bitch. Oh my God. Yeah. So then I went to 2017 New Year's Eve, Pat's Jets. It was a pretty forgettable game, but it was 13 degrees Fahrenheit. And I remember I went into that game thinking there's no way I'm gonna end up like I did at that Broncos game. And I was like, I was like, I was just like a ball of jacket and sweater. I literally had like 15 layers on. I was like, ain't no way I'm getting cold. And it worked.",
    "timestamp" : "03:57-04:44",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "04:44-04:45",
    "speaker" : "Andy",
    "text" : "All right. All right."
  },
  {
    "speaker" : "Greg",
    "text" : "But still, if you're a football player, you can't do that. So you're playing in two degrees is like is unbearable.",
    "timestamp" : "04:45-04:52"
  },
  {
    "timestamp" : "04:53-05:20",
    "text" : "Yeah. And and you could kind of see it too. Like There weren't a lot of like like the in the running game, there weren't a lot of like big tackles. It would just kind of like grab the guy and kind of push him to the ground. There was no like Heavy hitting in this, I didn't think. Except for Rodney Harrison, because he's he's an absolute psychopath. But other than that, it the game felt like it was going a little bit more slow motion. Just because the the I don't know.",
    "speaker" : "Andy"
  },
  {
    "text" : "I think it was just more the style of the Titans and the Patriots. It was a tight game. It was like real close contested, you know. Yeah. Run the ball a lot.",
    "timestamp" : "05:20-05:29",
    "speaker" : "Steve"
  },
  {
    "text" : "Did you ever play football in the cold, Andy?",
    "timestamp" : "05:29-05:31",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:33-05:35",
    "text" : "Yeah. It sucked."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "05:36-05:41",
    "text" : "It sucks. Yeah. I was gonna say, I played soccer in the cold and it blows. I can't even imagine. What it feels like to play football."
  },
  {
    "timestamp" : "05:42-06:10",
    "text" : "It's awful because your hands go first. And so if you're a a skills player, you're fucked. Like you're gonna drop everything because you just you can't move your fingers anymore. And then any like contact with open skin it has that like stabbing feeling you know like all the the tiny little um needles and stuff just like shoot straight out from wherever you got hit and it's just it's awful.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "06:10-06:12",
    "speaker" : "Steve",
    "text" : "Sounds just like you're like a little bitch though."
  },
  {
    "text" : "I mean yeah that's why that's why I switched over to soccer.",
    "speaker" : "Andy",
    "timestamp" : "06:12-06:15"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "06:15-06:15"
  },
  {
    "text" : "And found other ways to injure myself instead.",
    "timestamp" : "06:18-06:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Fuck this.",
    "timestamp" : "06:20-06:21"
  },
  {
    "text" : "Yeah. So I I don't have as many concussions, but my knees are garbage.",
    "timestamp" : "06:21-06:25",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "06:25-06:32",
    "speaker" : "Steve",
    "text" : "I don't know. I I was just saying I was expecting it to be like the ice bowl. We all seen that highlight. And the other it didn't seem like that cold."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh well they put up a s uh a graphic called coldest games in NFL history. The ice ball was negative 13. And I'm assuming I'm assuming these numbers are are are not with windshield. But negative 13 is fucking cold. And then there was an 81 AFC championship game was negative nine. San Diego at Cincinnati. I don't know. I don't know anything about this game. Ungod a limb and say San Diego did not win that. Being from Southern California coming to play. Negative nine. And then the 93 AFC divisional playoff game, Raiders at Buffalo, was zero degrees. So those are, I think, the three colder games than this.",
    "timestamp" : "06:33-07:15"
  },
  {
    "text" : "What's the temperature? There isn't one.",
    "timestamp" : "07:15-07:17",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Nope. You don't want to know. So every time, every time, I mean, we've told the story about me failing out of Penn State. Um, so every time I get in the car and my car thermometer says it's zero degrees, I always text my wife and say, what does the temperature today and my time at Penn State have in common? No degrees. She didn't even think of funny the first time, so I'm glad people were laughing.",
    "timestamp" : "07:18-07:43"
  },
  {
    "text" : "Pretty good. That's pretty good. Oh yeah, I've been doing that for ages. Yeah, no degrees. It really is the wind chill though. Not to get all nerdy on you, but the wind chill is because that that that",
    "timestamp" : "07:44-07:58",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "07:59-08:03",
    "speaker" : "Steve",
    "text" : "It didn't look that cold because it wasn't that windy. I don't know. I think they were thinking it was gonna be windier."
  },
  {
    "timestamp" : "08:04-08:26",
    "text" : "I think it was they said it was windier either earlier in the day or the day before. Like when they were practicing. I think it was the day before when they were practicing, because they were talking about Brady throwing it in the wind and not being affected, but that would have made it much, much worse. Yeah, because the wind takes the cold and puts it places you can't protect. You know? Like it gets up underneath your jacket and up in up in your up in your your bits.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "08:26-08:36",
    "text" : "And it also like gives you like the some when like the wind stops. You get that like, oh, this is what it could be, which is slightly more bearable."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:36-08:42",
    "text" : "And then it kicks up again and you're like, motherfucker. Oh, just getting used to that. Yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:42-08:50",
    "text" : "Yeah. It's so true. Or you just like step around a building or something and it cuts off for a second. Yeah. This is heaven."
  },
  {
    "speaker" : "Andy",
    "text" : "But it like uh you get the shots because it's so cold, the shots of literally everybody standing around those massive like jet engine heaters. Oh yeah. Like trying to be the the guy closest to it. Those things are great. Although not a lot of um Sweating like uh steam off the head shots as I would have wanted.",
    "timestamp" : "08:52-09:10"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "09:10-09:17",
    "text" : "Yeah, but the breadth was actually incredible in this game. Like their breath. You want to do that thing where they're like the two lines are lined up. Yeah."
  },
  {
    "text" : "And you you can see it from like, yeah, like from the the regular camera view, like the studio camera view. That's cool.",
    "speaker" : "Andy",
    "timestamp" : "09:18-09:23"
  },
  {
    "text" : "Yeah, you just need Steve Sable. In the background. Yes. Giving you something. Like some orchestral music. Yeah. Yeah.",
    "timestamp" : "09:23-09:32",
    "speaker" : "Greg"
  },
  {
    "text" : "So true. Battle of the trenches. But um yeah, I think the other thing that was noticeable because of the weather was the kicking in this game. It looked like they were kicking lead balloons out there. Yes. Like every kickoff I think landed probably around the 20. Like it it came out looking good and then just died. Like that ball just just died. Uh and also the field goal attempts. Um I think On the day, the both field goal kick was what? One for two? One for three?",
    "timestamp" : "09:32-10:06",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "One for three. One block, though.",
    "timestamp" : "10:06-10:08"
  },
  {
    "timestamp" : "10:09-10:11",
    "speaker" : "Andy",
    "text" : "Right, it was one blocked. So not not a great deal."
  },
  {
    "timestamp" : "10:12-10:26",
    "text" : "Gary Anderson, right? Yeah. Mr. Facebar. Yeah. Yeah. And so Gary Anderson who kicked a game-winning field goal the week before to get to get the Titans here.",
    "speaker" : "Greg"
  },
  {
    "text" : "I was gonna ask, yeah, do we wanna talk about how Tennessee got here because they had a Um like this wasn't their first playoff game. Did you have correct?",
    "timestamp" : "10:26-10:37",
    "speaker" : "Andy"
  },
  {
    "text" : "They won their wild card. I have I have a bunch of notes on the the other games from this week. Okay. Yeah, I think not the wild card games. Because the other those other games are fucking insanity, but they are.",
    "speaker" : "Greg",
    "timestamp" : "10:37-10:49"
  },
  {
    "timestamp" : "10:49-10:52",
    "speaker" : "Andy",
    "text" : "But let's touch on the Titans. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. To get here. Yeah. So they beat the Ravens last week in Baltimore. I think they were actually at a better record than the Ravens going in, but the Colts had won the division. So they had to travel. Yeah. They had to travel to Baltimore.",
    "timestamp" : "10:52-11:06"
  },
  {
    "text" : "Co MVP.",
    "timestamp" : "11:06-11:07",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "11:07-11:15",
    "speaker" : "Greg",
    "text" : "And that was the Ray Lewis, Jamal Lewis. that squad. So they're built on defense and running."
  },
  {
    "text" : "Can you name the quarterback for the Ravens in that game?",
    "timestamp" : "11:15-11:18",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh dude, I I I I read it like a couple weeks ago. It's no No, someone like Jackson or Anthony Wright. Anthony Wright.",
    "timestamp" : "11:18-11:29"
  },
  {
    "text" : "I couldn't even tell you what number it was. I can't picture him at all.",
    "timestamp" : "11:30-11:33",
    "speaker" : "Andy"
  },
  {
    "text" : "Neither.",
    "timestamp" : "11:33-11:33",
    "speaker" : "Greg"
  },
  {
    "text" : "He looked like he had a good game. 20 for 37, 214, a touch. Yeah, two interceptions. Not great. Never mind.",
    "timestamp" : "11:35-11:42",
    "speaker" : "Andy"
  },
  {
    "text" : "But it looked like an AFC North, like Battle. Oh yeah, yeah.",
    "timestamp" : "11:42-11:46",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "11:47-11:51",
    "text" : "Titans won twenty to seventeen. This looks like a bit of a slug fest.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "11:51-12:15",
    "speaker" : "Greg",
    "text" : "On an Anderson field goal. And it I think that the Ravens had like a defensive touchdown from Ed Reed. You know, like it was one of those games. Actually Will Dempsey. One important play that happened was Ed Reed did get a pick in that game and Eddie George separated his shoulder trying to tackle Eddie. Is that how it happened?"
  },
  {
    "timestamp" : "12:15-12:24",
    "text" : "Because they talked about the separated shoulder. And Eddie, yeah, he's playing in this cold with a They said his shoulder was in a sling and he was playing because he separated last week. Uh-huh.",
    "speaker" : "Andy"
  },
  {
    "text" : "In the court. Tackling Ed Reed. Well like and running with the mention that.",
    "speaker" : "Greg",
    "timestamp" : "12:25-12:31"
  },
  {
    "text" : "I believe the comment they said running with violence is how they talked about um Eddie George running.",
    "speaker" : "Andy",
    "timestamp" : "12:31-12:38"
  },
  {
    "speaker" : "Greg",
    "text" : "Which yeah, he had like a ridiculous stiff arm on uh Ray Lewis too. Did he? One of those ones where he kind of catches him off bounce and like kind of picked him up and threw him. It was badass.",
    "timestamp" : "12:38-12:48"
  },
  {
    "timestamp" : "12:49-12:55",
    "speaker" : "Andy",
    "text" : "Those are the best. Yeah. That's like uh what is the name for the Titans now? Does that all the time."
  },
  {
    "speaker" : "Steve",
    "text" : "Derrick Henry for sure.",
    "timestamp" : "12:56-12:57"
  },
  {
    "timestamp" : "12:57-14:38",
    "text" : "Yeah. Yeah. Grown ass man. Um, but yeah, Eddie George, just to touch on him, they they showed a couple of stats which I thought were kind of um indicative of of who he was as a running back. He was one of two players in the NFL to rush for 10,000 yards without missing a start. The only other guy was Jim Brown. So that's pretty good company. He ranked first in like since running backs among running backs since 1996. He was first in starts, first in rushes, second in yards, third in touchdowns. So he had uh 2,700 rushes for just over 10,000 yards, which I think works out to be less than four yards a carry. So he is just an absolute grinder. 10,000 yards on 3. 6 yards per carry. And in this game in the first half, he was averaging 2. 3. Wow. Like he was he just grinds that shit out over and over again. Yeah. Yeah. And that's what they were saying. Like Uh I think it was Phil Sims in this game was talking about how like he's the perfect playoff running back because that's what he'll do is he'll get you three yards every time. He's not gonna get you more, he's not gonna break anything big, but He's never gonna put you behind the chains and like you don't have to go catching up because he's lost a bunch of yards. So and I think in that game against the uh Ravens. Looks like as a team, Tennessee ran for 165 yards on the ground. So they just ran it down. Oh yeah. Eddie George and the other guy, Chris Brown.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Chris Brown, shout out Mom's favorite player, yeah.",
    "timestamp" : "14:38-14:40"
  },
  {
    "timestamp" : "14:41-14:44",
    "text" : "Shout out mom and also the um abusive singer.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh.",
    "timestamp" : "14:44-14:44"
  },
  {
    "text" : "Chris Brown battered it battered his way into the end zone in the previous game for a touchdown. Um but neither of those guys had a hundred yards in the last game they still ran for. Like almost 200, so",
    "timestamp" : "14:47-15:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:03-15:06",
    "speaker" : "Greg",
    "text" : "A typical And you got Aaron McNair who is also a pounder."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:07-15:08",
    "text" : "Yeah. Country strong."
  },
  {
    "text" : "Country strong boy.",
    "speaker" : "Steve",
    "timestamp" : "15:09-15:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:10-15:10",
    "text" : "He is."
  },
  {
    "text" : "He ain't easy to tackle, that's for sure.",
    "timestamp" : "15:11-15:12",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "15:13-15:18",
    "speaker" : "Steve",
    "text" : "They kept showing highlights for that double overtime Rams game though. During this."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, I got notes on that, dude. It's fucking insanity.",
    "timestamp" : "15:18-15:21"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "15:22-15:22",
    "text" : "Yeah."
  },
  {
    "text" : "You want to talk about it now? No, let's hold off on that until we we can touch on this game first. Okay. Let's get through this and then uh and then we'll talk about the rest of the league. Because yeah, I mean it's it's a little out of control. Um yeah, so first half was kind of where a Lombardi score? Oh well Greg has his new rating system, but I think it sounds like he actually washed it.",
    "timestamp" : "15:25-15:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "15:50-15:58",
    "text" : "Yeah, we determined it was the same thing. Because there are six different tiers. There were. Well, where are they, Greg?"
  },
  {
    "timestamp" : "15:58-16:01",
    "text" : "It was a name game was the top.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, title game, thumbnail game. Right. Uh hidden gems, business as usual, and slog fest. And then losses. And then we're like, we should put a sixth in there.",
    "timestamp" : "16:01-16:13"
  },
  {
    "text" : "Which is losses. So where would you put this one, Greg?",
    "timestamp" : "16:13-16:18",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know. I think there's um Business as usual. I don't know if like anything really jumped out at me. I don't know. I don't think it was a hidden gem. It's certainly not a thumbnail game. I mean the cold adds a cool factor and it was a tight game, but I would put this as kind of like in the hidden gem range.",
    "speaker" : "Greg",
    "timestamp" : "16:18-16:35"
  },
  {
    "text" : "I would put this as a three.",
    "speaker" : "Andy",
    "timestamp" : "16:35-16:36"
  },
  {
    "text" : "It was an exciting game.",
    "timestamp" : "16:37-16:38",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "16:38-16:53",
    "speaker" : "Andy",
    "text" : "Yeah. I like because it was close all the way through. You're playing the co-MVP. Yeah, it was exciting. And yeah, and I think the Titans came to play and they were both just like, this was also a bit of a slug fest. They were both giving each other. right and left hooks all the way through."
  },
  {
    "speaker" : "Steve",
    "text" : "Those one of those fucking just eye shot games this week. And I always love the Titans. I always had a soft spot for them.",
    "timestamp" : "16:54-16:59"
  },
  {
    "speaker" : "Andy",
    "text" : "You did. You fucking traitor. I can drop that logo.",
    "timestamp" : "17:00-17:04"
  },
  {
    "speaker" : "Steve",
    "text" : "So easy.",
    "timestamp" : "17:04-17:05"
  },
  {
    "text" : "It's not, it's got flames.",
    "timestamp" : "17:06-17:07",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Flames are easy. And I remember dad calling Eddie George the man with Two first names, which I thought was hilarious.",
    "timestamp" : "17:07-17:13"
  },
  {
    "timestamp" : "17:13-17:24",
    "speaker" : "Greg",
    "text" : "I'd never yeah. And speaking of which, Derek Henry. What the fuck? Jeff George. Yeah. So do we know they're not the same person?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "17:25-17:26",
    "text" : "Sydia?"
  },
  {
    "timestamp" : "17:26-17:30",
    "speaker" : "Greg",
    "text" : "Do we know they're not the same person? Derek Henry and Eddie George? We don't."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "17:30-17:45",
    "text" : "I you know what I th I thought this as I saw this game and they showed some close-ups of Rodney Harrison as well and I said both those guys they look the same now Oh as it did when they were like in 2003. Rodney Harrison looks the exact same now as he did. Has not aged at all. And Eddie George, same way."
  },
  {
    "timestamp" : "17:46-17:48",
    "speaker" : "Greg",
    "text" : "Didn't we talk about Eddie George being good looking?"
  },
  {
    "timestamp" : "17:48-17:49",
    "text" : "Yes, we did.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I think so.",
    "timestamp" : "17:49-17:50"
  },
  {
    "timestamp" : "17:51-17:52",
    "speaker" : "Andy",
    "text" : "We did, yeah."
  },
  {
    "timestamp" : "17:52-18:02",
    "speaker" : "Greg",
    "text" : "Yeah, I'm a big I'm a big Eddie George is a good looking guy. Yeah, I guess. I wasn't I wasn't at first Andy's racist."
  },
  {
    "timestamp" : "18:02-18:10",
    "speaker" : "Andy",
    "text" : "No, I wasn't at first because his uh his little like headshot went like during the game like an alien. It made him look like an alien."
  },
  {
    "speaker" : "Greg",
    "text" : "Why, because he doesn't fit into your like uh your normal cisgender white male face.",
    "timestamp" : "18:10-18:16"
  },
  {
    "text" : "The top of his head was twice the size of the bottom of his head. It was not a good angle for his picture.",
    "timestamp" : "18:17-18:23",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, real. He's a beautiful man.",
    "speaker" : "Greg",
    "timestamp" : "18:24-18:25"
  },
  {
    "text" : "Then you had me Google him and uh yeah, he looks great in a suit.",
    "timestamp" : "18:26-18:29",
    "speaker" : "Andy"
  },
  {
    "text" : "So is Harrison. I think Harrison's pleasing to look at.",
    "speaker" : "Greg",
    "timestamp" : "18:29-18:32"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:32-18:33",
    "text" : "He's very handsome."
  },
  {
    "timestamp" : "18:33-18:35",
    "text" : "Yep. Now he like dresses nice too.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "18:36-18:38",
    "speaker" : "Andy",
    "text" : "He's one of Aaron's favorites, actually."
  },
  {
    "speaker" : "Greg",
    "text" : "He's one of my wife's favorites. Yeah. Yeah. I think he I think both of them are better than Garoppolo. Garoppolo doesn't do it for me. I agree. I think he seems too like, I don't know, too state coiffed. Yeah, or like it almost feels like what a good person a good looking person should look like rather than like okay that guy actually has like a charisma in his face. It's like it's like a stock photo.",
    "timestamp" : "18:38-19:07"
  },
  {
    "text" : "Yes.",
    "timestamp" : "19:07-19:07",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "19:11-19:17",
    "text" : "That sounds racist, Greg. Just because he's Italian?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Is that why? I almost just said, is he Italian? And then I was like, that's a stupid. Is Jimmy Garoppolo Italian?",
    "timestamp" : "19:18-19:26"
  },
  {
    "text" : "You already did that with uh Mahomes. Oh Ruffia.",
    "timestamp" : "19:26-19:31",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "That one is I'll admit.",
    "timestamp" : "19:33-19:35"
  },
  {
    "speaker" : "Andy",
    "text" : "I had no idea. Oh geez. Very naughty. Very naughty. Yeah, so I think um so we lay it on a three for this, like uh three long bodies out of six. I give it a yeah.",
    "timestamp" : "19:35-19:49"
  },
  {
    "speaker" : "Greg",
    "text" : "I give it a four I'm giving it uh business as usual.",
    "timestamp" : "19:49-19:53"
  },
  {
    "text" : "No, I'm giving it a hidden gem",
    "speaker" : "Steve",
    "timestamp" : "19:53-19:55"
  },
  {
    "speaker" : "Andy",
    "text" : "All right.",
    "timestamp" : "19:56-19:56"
  },
  {
    "text" : "Okay.",
    "timestamp" : "19:57-19:57",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "19:57-19:58",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:00-20:16",
    "text" : "All right. And there wasn't a whole lot of scoring to talk about, which I think is probably why it's not a more memorable game. Because the the one play that I actually remembered from this is Tom Brady's touchdown pass to breakout star Bethel Johnson."
  },
  {
    "text" : "Our guy, Bethlehem, the playmaker.",
    "timestamp" : "20:17-20:20",
    "speaker" : "Greg"
  },
  {
    "text" : "Fucking killing it.",
    "timestamp" : "20:21-20:21",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "20:22-20:24",
    "speaker" : "Greg",
    "text" : "His speed made that happen."
  },
  {
    "text" : "So we got deep behind between the the safeties. And Brady hit him for a 41-yard touchdown on the Patriots' first drive of the game. Yeah.",
    "timestamp" : "20:24-20:34",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "20:35-20:35",
    "text" : "The game."
  },
  {
    "speaker" : "Andy",
    "text" : "And it was short.",
    "timestamp" : "20:35-20:36"
  },
  {
    "text" : "I remember I missed this play. You did? Uh-huh. I remember turning on the game and it was already 7-0 and I was like, what the shit dude? And then there was like no scoring after that and I was like, God damn it.",
    "speaker" : "Greg",
    "timestamp" : "20:36-20:48"
  },
  {
    "timestamp" : "20:50-21:07",
    "text" : "So there's going to Yeah, but uh this was also right off the back of uh my MVP's probably play of the game, uh Kevin Falk. on third down converting a a tough third down. WD33. WD33, that's right. Well you need to make t-shirts of that or something.",
    "speaker" : "Andy"
  },
  {
    "text" : "The Grease Monkey. Yeah. Yeah the grease monkey monkey. Oh boy. The human lubricant. Yeah. I I'm telling you, Andy, that was genius that you I think it is a great idea.",
    "timestamp" : "21:07-21:25",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "21:26-21:32",
    "text" : "All right, so you what we'll we'll we'll make some t-shirts. We'll we'll put them in the pawn shop. Those t-shirts you got.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:33-21:35",
    "text" : "That sounds like another thing we say we're gonna do that we don't do.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "21:36-21:40",
    "text" : "Yeah, well this is now the third time I think I've said it, so I'm actually gonna do it this time. I wrote it down this time.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah we say we're gonna do Andy does it all. Anyways, let's be real.",
    "timestamp" : "21:40-21:43",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:44-21:49",
    "text" : "Yeah, this is true. This is this is like the only thing this this podcast on the website, literally the only things I follow through with in my entire life."
  },
  {
    "text" : "That is very true too. That's why when we started this thing, I was like, okay, I'll agree to do it because it's six episodes talks. Yeah. It's like Andy'll give up soon enough.",
    "timestamp" : "21:50-22:02",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "22:02-22:25",
    "text" : "Uh you can probably blame COVID for that, because yeah, I mean, what are you gonna do? That's true. So yeah, so uh back to the game, the scoring. Um we got the Bethel Johnson touchdown and then Tennessee, I thought, kind of drove the ball up and down the field, but just couldn't score at the end. I was surprised at how well they moved the ball."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "22:25-22:25",
    "speaker" : "Mom"
  },
  {
    "text" : "But I probably shouldn't have been because like at the beginning of the game, the commentators were talking about Jeff Fisher, about his offensive game plan, and his his response was, we've nailed it. We've got it. Yeah. That's hilarious. We've got this. We're gonna put up a shit ton of points. And they they scored 14 just for the record.",
    "speaker" : "Andy",
    "timestamp" : "22:26-22:44"
  },
  {
    "text" : "This was the the fifth ranked offense in the NFL.",
    "speaker" : "Greg",
    "timestamp" : "22:45-22:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and um so McNair is but it was it was all Steve McNair. I mean we've actually talked about these these Titans at the beginning of this season, which I had forgotten that this is the second time they've seen each other. Um, but even back then they were talking about like this entire offense just runs through Steve McNair and um He's actually had to grow as a passer because usually he would kind of if he got into trouble, he'd tuck it and run. And he'd like run for three yards, but now he decides to chuck it up into coverage and sometimes the guy comes down with it for twenty-five yards instead of the three yards that he normally gets. Um but Having said that, Steve McNair did lead the league in a quarterback rating with 100. 4, which is pretty good for 2003 anyway.",
    "timestamp" : "22:49-23:37"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "23:37-23:42",
    "text" : "Can we talk about him being co-MVP with Peyton? Because this is like the only time this has ever happened, right?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:42-23:50",
    "text" : "I was gonna ask that. Um yeah, I don't know about MV. I don't pay attention to other sports because fuck 'em."
  },
  {
    "timestamp" : "23:51-23:55",
    "speaker" : "Greg",
    "text" : "No, that's not true. I won co-MVP of my high school soccer team."
  },
  {
    "speaker" : "Andy",
    "text" : "That's right. And I haven't let you forget it. Yeah.",
    "timestamp" : "23:56-23:59"
  },
  {
    "timestamp" : "24:01-24:05",
    "speaker" : "Greg",
    "text" : "And he was MVP, so he thinks he's some bugging big way."
  },
  {
    "speaker" : "Steve",
    "text" : "Steven, is this the only one Steven Mirror won to? Because Peyton was another one.",
    "timestamp" : "24:09-24:14"
  },
  {
    "text" : "Great question. Look it up now. So I don't think this is. So I'm I'm on Wikipedia now. The AP NFL Most Valuable Player Award, I'm assuming is what we're looking for here. So this is 2003, Peyton Manning, Steve McNair. It has not been shared since.",
    "speaker" : "Andy",
    "timestamp" : "24:14-24:35"
  },
  {
    "text" : "I don't think it's ever been shared in any other sport I can think of.",
    "timestamp" : "24:35-24:38",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "24:38-24:42",
    "speaker" : "Greg",
    "text" : "So they just they just it must be a voting system and they tied."
  },
  {
    "timestamp" : "24:43-24:56",
    "speaker" : "Andy",
    "text" : "So I I love how how confident Steve is when I'm literally on this page and I said it hasn't happened since then. And I I word it that way because it has happened before in the NFL. What? 1997."
  },
  {
    "text" : "97?",
    "timestamp" : "24:57-24:57",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "24:58-25:03",
    "text" : "Wait, let's guess. Let's guess. NFL MVP or is this like NFL MVP?",
    "speaker" : "Greg"
  },
  {
    "text" : "O NFL MVP.",
    "timestamp" : "25:04-25:04",
    "speaker" : "Steve"
  },
  {
    "text" : "97. Uh uh Marco Nell? No Steve Young and Brett Favre.",
    "speaker" : "Greg",
    "timestamp" : "25:05-25:13"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:13-25:18",
    "text" : "Brett Favre was one of them, correct. Okay. Um Lway? No."
  },
  {
    "text" : "That's a good guess. Oh. What position? Just just running back.",
    "speaker" : "Greg",
    "timestamp" : "25:19-25:25"
  },
  {
    "text" : "I mean what other position are you gonna get? I don't think there's ever been let's see.",
    "speaker" : "Andy",
    "timestamp" : "25:25-25:29"
  },
  {
    "text" : "The last 97. Running back? Sean Alexander? Terrell Davis. Oh T D. No, not T D. Shorter. Shorter is in height. Barry Sanders? Yep. Shorter. There you go. Barry Sanders.",
    "speaker" : "Greg",
    "timestamp" : "25:29-25:43"
  },
  {
    "text" : "Barry Sanders split it with Brett Favre. I'm assuming Barry Sanders and I seven. That may have been the That's a good trivia. That's not bad, right?",
    "speaker" : "Andy",
    "timestamp" : "25:43-25:52"
  },
  {
    "text" : "Yeah. Yeah.",
    "timestamp" : "25:52-25:54",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Um the last time Somebody other than a quarterback or running back won the NFL MVP was 1986. He was a defensive player. Any guesses?",
    "timestamp" : "25:54-26:12"
  },
  {
    "text" : "I wasn't even born yet, dude. I don't know, one of those 86 Bears guys.",
    "speaker" : "Greg",
    "timestamp" : "26:12-26:17"
  },
  {
    "text" : "LT. Nicely done. And then two years before that? That's a three years before that, 1982, Mark Mosley, the a place kicker. Sometimes one MVP 1982. Right? The only place kick could ever win it. That's fucking ridiculous. Okay. It's ridiculous. Sure.",
    "timestamp" : "26:18-26:40",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:40-26:43",
    "speaker" : "Greg",
    "text" : "Hey remember when Mantai Teo had a fake girlfriend? Remember that?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:44-26:47",
    "text" : "Yeah. I don't know why that just came up now."
  },
  {
    "text" : "I was just thinking of like Heis Heisman Heisman winners that are like candidates that uh were non-offensive. And I was like, oh, Mantaiteo. Remember that shit? I do. Poor guy. He's gonna be remembered forever for having a fake girlfriend.",
    "timestamp" : "26:47-27:02",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, he played a little bit in the NFL. He played for the Dolphins. Yes.",
    "speaker" : "Steve",
    "timestamp" : "27:02-27:05"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "27:06-27:08",
    "text" : "Yeah, but it what do you remember of him fake girlfriend?"
  },
  {
    "speaker" : "Steve",
    "text" : "Exactly that, yeah. Yeah. Cat getting catfished.",
    "timestamp" : "27:09-27:12"
  },
  {
    "timestamp" : "27:13-27:15",
    "speaker" : "Greg",
    "text" : "Yeah. Right? He got catfished. He got got."
  },
  {
    "speaker" : "Steve",
    "text" : "He was the cutting edge of the catfishing wave.",
    "timestamp" : "27:17-27:19"
  },
  {
    "timestamp" : "27:19-27:22",
    "speaker" : "Greg",
    "text" : "Yeah, oh yeah. Everyone else like, what the fuck?"
  },
  {
    "text" : "He can do this shit.",
    "speaker" : "Steve",
    "timestamp" : "27:22-27:22"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "27:23-27:32",
    "text" : "And then a million. MTV had just come out with that show, catfish. We're all like, whoa, this is like a uh And wait this is real epidemic of catfishing."
  },
  {
    "text" : "You don't have to say who you are on the internet?",
    "timestamp" : "27:33-27:34",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "27:35-27:35",
    "speaker" : "Greg"
  },
  {
    "text" : "God, and people fall for that?",
    "timestamp" : "27:36-27:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "27:38-27:41",
    "text" : "Uh it's age sex location. And Remember that?"
  },
  {
    "text" : "ASL, baby.",
    "timestamp" : "27:41-27:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "ASL.",
    "timestamp" : "27:42-27:43"
  },
  {
    "text" : "I remember back in the AOL chatroom days, me and Mike Mello used to um We used to buy a case of surge and we used to get on the the chat rooms, the lesbian chat rooms and pretend to be lesbians.",
    "timestamp" : "27:43-27:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:56-28:06",
    "text" : "You guys are such bad boys. Super bad boys ISL maybe. Dude. You guys are crazy. Crazy.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:07-28:08",
    "text" : "A whole case absurd?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "28:09-28:14",
    "text" : "No, dude. Lesbians, they're so much different than us. It's gonna be sick."
  },
  {
    "speaker" : "Andy",
    "text" : "To be fair, this was middle school, but yes, it was crazy. Nobody knows who you are on the internet. I I guarantee there was no lesbians in that room.",
    "timestamp" : "28:15-28:23"
  },
  {
    "text" : "Yeah, there's a bunch of others surged up within 13 euro talking to each other.",
    "timestamp" : "28:23-28:29",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "28:30-28:39",
    "text" : "I just got told off by Kelly. I was making fun of Andy, not uh lesbian people. I said lesbian people are normal. Andy was the weird one."
  },
  {
    "text" : "Yes. Oh a hundred percent weird.",
    "timestamp" : "28:39-28:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:42-28:46",
    "text" : "Don't worry, we can just isolate that one sound clip, Greg, and play it over and over again."
  },
  {
    "text" : "Definitely me. Oh boy. I don't know how to transition from that one. I was trying, but I couldn't get there.",
    "timestamp" : "28:48-28:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "29:00-29:02",
    "text" : "What's the score at halftime?"
  },
  {
    "timestamp" : "29:02-29:04",
    "speaker" : "Andy",
    "text" : "14-7 Patriots."
  },
  {
    "timestamp" : "29:04-29:14",
    "speaker" : "Greg",
    "text" : "14-7 Patriots. And 17-40. Bethel Johnson has a big touchdown. They come right back. The Titans storm back and get a touchdown of their own. Which you definitely see a lot."
  },
  {
    "speaker" : "Andy",
    "text" : "Adam field goal on the next drive because and this is his tenth missed field goal of this season. Which I mean that's a lot. No Gustavsky. That's a lot. You don't see Goskowski missing ten field goals in a season, do you? I think I think last time you started missing that many you got cut. Or got shut excuse me, shut down with an injury.",
    "timestamp" : "29:14-29:37"
  },
  {
    "speaker" : "Steve",
    "text" : "Next play though, Rodney Harrison interception.",
    "timestamp" : "29:37-29:40"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:40-29:43",
    "text" : "Yeah, yeah, they the uh the Titans did the patented Patriots."
  },
  {
    "timestamp" : "29:43-29:44",
    "text" : "That's true.",
    "speaker" : "Steve"
  },
  {
    "text" : "As soon as you get a turnover, you you take the deep shot and Rodney Harris was not falling for it.",
    "speaker" : "Andy",
    "timestamp" : "29:44-29:48"
  },
  {
    "speaker" : "Steve",
    "text" : "They did that in the second half where they attempted double pass two. Yep. And Willie sniffed it out. Immediately and the tight end caught it by the tight end.",
    "timestamp" : "29:48-29:57"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, let's talk about that real quick because that was a um It was a pass, it was what looked like a throwback pass. Like you saw it was kind of like um the Brady to Edelman to Amandola pass, but on the other side of the field. That's what it was supposed to be. Except they threw it to Frank Wajek for the first one, and he was like looking like he was he was taking steps back as if he was gonna throw the ball. Was Frank Wajek a Like a quarterback in high school or something? Like you don't often have your tight ends be the guy in the world.",
    "timestamp" : "30:00-30:33"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "30:34-30:39",
    "text" : "He threw the he threw the uh mo the oh the miracle music city miracle, remember?"
  },
  {
    "text" : "That's true. That's true.",
    "timestamp" : "30:39-30:40",
    "speaker" : "Andy"
  },
  {
    "text" : "That was a good throw. No, we threw it absolutely perfectly.",
    "speaker" : "Greg",
    "timestamp" : "30:42-30:45"
  },
  {
    "timestamp" : "30:45-30:51",
    "text" : "What do you mean badly? He threw it forward in a in a backwards lateral pass. That was bad. That literally could not have been more perfect passing.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "30:52-30:53",
    "speaker" : "Steve",
    "text" : "Sideline to sideline."
  },
  {
    "speaker" : "Andy",
    "text" : "I mean, for a tight end, it was a good throw.",
    "timestamp" : "30:58-30:59"
  },
  {
    "text" : "Like across his shoulder. That throw was like one of the best throws in NFL history, I would say. Whoa, easy too.",
    "timestamp" : "31:00-31:07",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:07-31:18",
    "text" : "Wow. It was I thought special teams didn't matter. You were not recorded fucking last episode. Shoot not Belchecks and how much special teams is bullshit. Don't call this best thrown NFL history"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "31:19-31:31",
    "text" : "Oh happened on special tea. Steve, when when you're right, you're right. When you're right. I'll give you that one. I'm just saying considering the circumstances and who who is throwing it."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:32-31:36",
    "text" : "Oh wow. Brutal. Yeah."
  },
  {
    "timestamp" : "31:37-31:45",
    "speaker" : "Steve",
    "text" : "But um every time the the Pats like turned it over, this game was close enough. He just made a couple mistakes and the Titans would take a shot and Pass defense have come up huge."
  },
  {
    "timestamp" : "31:46-32:18",
    "text" : "Yeah, yeah, yeah. That was kind of the game. That was kind of the game, yeah, because the only other drive the Patriots offense put together was right at the end of the first quarter. With again, your boy Bethel Johnson coming on strong at the end of the season. He uh it was like third and long, third and thirteen or something like that. Caught a quick pass over the middle, got hemmed in and turned around and started reversing field running back the other way. Tom Brady threw an absolute monster block. To spring 'em for the thirteen yards.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "32:19-32:22",
    "speaker" : "Steve",
    "text" : "Dude, you should definitely uh put this as a highlight on the website."
  },
  {
    "text" : "It's gonna be on there.",
    "timestamp" : "32:22-32:23",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "32:24-32:27",
    "speaker" : "Steve",
    "text" : "Sweet block from Brady, like a nice clean cut block."
  },
  {
    "text" : "Yeah. It was like uh He's had a couple of those. There was one recently, like his last season on the Patriots, when they're against the Bills, remember, and he ran downfield and blocked. Whoever their top cornerback was. Yeah. Yeah. True Davies White.",
    "timestamp" : "32:27-32:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "32:42-32:43"
  },
  {
    "text" : "And it was that similar like, you know Like just throw himself at the guy's knees, sort of thing.",
    "timestamp" : "32:43-32:48",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "32:48-32:48",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "text" : "Like quarterbacks do. But in this one, he got him full on. I don't know who it was. But it was a it was a big guy and he went.",
    "speaker" : "Andy",
    "timestamp" : "32:48-32:55"
  },
  {
    "text" : "You know who else does that?",
    "timestamp" : "32:55-32:56",
    "speaker" : "Greg"
  },
  {
    "text" : "Who else is that?",
    "speaker" : "Andy",
    "timestamp" : "32:56-32:57"
  },
  {
    "timestamp" : "32:58-33:15",
    "text" : "Brett Favre. Brett Favre did shit like that. He's just having fun. But you don't like Bret Favre because, you know You don't like guys that just have fun out there and play football and are gunslingers. But now Tom Brady does it and you're like, oh my God, did you see that block? It was so sick.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:16-33:20",
    "text" : "Is is this like a I don't know where we're headed with this."
  },
  {
    "text" : "Just I'm saying be consistent. You either like the guys that do stupid shit because they're football players and they have fun out there or you don't like them.",
    "speaker" : "Greg",
    "timestamp" : "33:21-33:32"
  },
  {
    "text" : "I think it's remarkable because Brady doesn't really do a lot of that shit. Right. He only does it when it's absolutely necessary. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "33:32-33:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:40-33:53",
    "text" : "Whereas I think now it's only when it's was it was it this game? Uh or was it maybe last week where um they showed a highlight of Brett Favre running 20 yards downfield to throw that block? For no fucking reason?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that was so sick. What do you mean no reason? It was awesome.",
    "timestamp" : "33:53-33:56"
  },
  {
    "timestamp" : "33:57-34:08",
    "text" : "It didn't do anything. He just wanted to show that he's a football player. I run downfield and block my friends.",
    "speaker" : "Andy"
  },
  {
    "text" : "Dude, he just loves football and he was just so excited to complete that pass. He was like, I just gotta run. And hit and hit somebody. And you know what? His teammates probably love that shit. And they got hyped up when it happened. Um, they definitely did. Yeah.",
    "timestamp" : "34:08-34:24",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "But I I don't I just think that Brady doesn't do that very often. He would do all that shit all the time. So it's notable when Brady does it. I wouldn't want Brady doing it all the time because he's gonna get fucking beat up.",
    "timestamp" : "34:24-34:33"
  },
  {
    "timestamp" : "34:33-34:36",
    "speaker" : "Andy",
    "text" : "Yeah, he's gonna get addicted to painkillers. Like I don't know, dude."
  },
  {
    "timestamp" : "34:36-34:45",
    "speaker" : "Greg",
    "text" : "He's got those long fucking tendons. He's very pliable, I know. But that's true. Drinks a lot of water, he'll be fine."
  },
  {
    "timestamp" : "34:46-34:51",
    "text" : "Not drink a lot of water in this game because um the car. You can't get concussions when you got headache.",
    "speaker" : "Andy"
  },
  {
    "text" : "That's right. When you when you're hydrated.",
    "timestamp" : "34:51-34:53",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "34:53-35:03",
    "speaker" : "Andy",
    "text" : "That's right. Yeah, you you drip drink a lot of water. You don't even get uh sunburns if you don't have water. That's right. But you couldn't drink any water in this game because the commentators are talking about how their water froze. in the booth."
  },
  {
    "timestamp" : "35:03-35:07",
    "speaker" : "Greg",
    "text" : "Okay, here we go. Let's hear it, Andy. No, I had no notes on the commentators."
  },
  {
    "timestamp" : "35:07-35:07",
    "speaker" : "Steve",
    "text" : "I thought they're fine."
  },
  {
    "text" : "Oh notes on the commentators?",
    "timestamp" : "35:07-35:09",
    "speaker" : "Andy"
  },
  {
    "text" : "I uh I was hoping for some creepy Armin Kateyan shit again, but yeah let's see So yeah, nothing.",
    "timestamp" : "35:09-35:15",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "It was just typical Phil Sims like uh just like corny bullshit stuff. Like this what we talked about, like the stuff that bothers me is like those those like lazy Like yeah, just like the the corny shit. Like the they're talking about, oh, if they played football at the North Pole, this is probably what it would be like. Come on, man. Like you can do better than that. You're professional. Like take some I don't know. And then talking about Jeff Fisher. Jeff Fisher is the epitome of us against them. Like literally not. Like the entire Patriots have built a dynasty on that, but you're Jeff Fisher of all fucking people?",
    "timestamp" : "35:15-35:54"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't know. Is that a thing he says in the locker room a lot?",
    "timestamp" : "35:55-35:58"
  },
  {
    "text" : "Well hey Greg, you want the whole contest? Because I know you didn't watch it, Greg Then obviously there's more context what Andy's saying here. They said we interviewed Belchek and he was just like, you know, I got the guys ready to play, they're gonna go out there and play. And then they interviewed Fisher and he's like, I'm a rah-rah guy. I I find a lot of speeches, I'll find anything to like find disrespect in like Use that to motivate and like get a rah-rah speech.",
    "speaker" : "Steve",
    "timestamp" : "35:58-36:19"
  },
  {
    "text" : "Andy, comments? Corny bullshit.",
    "speaker" : "Andy",
    "timestamp" : "36:20-36:23"
  },
  {
    "timestamp" : "36:23-36:28",
    "speaker" : "Steve",
    "text" : "All of it. Apparently that's corny bullshit. That's sort of insight about the difference between the two coaches and the way they motivate their teams."
  },
  {
    "speaker" : "Andy",
    "text" : "Well in that case I was I was directing it at Jeff Fisher, but yes. Jeff Fisher's corny bullshit too. Uh well yeah they're talking about how uh like at the end of the game uh the the titans were wasting their timeouts because they couldn't figure out how to the play clock clock worked. So they're wasting their timeouts at the end there. And there was one play where it wasn't a timeout, it was just like an injury stoppage. So they stopped the clock and came back. And both of you can go fuck yourself. Well, how dare they get this one wrong? Uh no, but but they they they start talking about how like, oh well you just wanted to be a timeout, so you go stand behind the heater. I turned it off because I'm a fucking tough guy. I'm like fuck you. Stupid. Like all these people actually pay to be they're like this is your fucking job. Stop bitching about how cold it is.",
    "timestamp" : "36:29-37:17"
  },
  {
    "timestamp" : "37:18-37:18",
    "speaker" : "Steve",
    "text" : "All right."
  },
  {
    "speaker" : "Greg",
    "text" : "You know what it is, Andy? What is it? It's workplace humor. You know what I'm saying? Where you like say jokes that you don't want to take risks so you can't offend anyone. So you just take you just say the generic joke and you don't even know if like what people know about things or So you're just like, hey, how about the fucking weather, huh? And you just make like the most generic joke you can make. Mondays, am I right? That shit sucks, dude. I I for them. They have to like appeal to a broad audience. So they have to tell jokes that are like that. I don't think they do. I know that because I say jokes like that at work. And when I say them, when they come out of my mouth, I'm like, I want to shoot myself for saying this. But it's like it's just part of the gig.",
    "timestamp" : "37:19-38:02"
  },
  {
    "text" : "It's not though because I work too and I don't say that.",
    "timestamp" : "38:02-38:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I say the Yeah, and that's why no one likes you Andy and you never get promoted is because you don't do the stupid jokes. Raw. You're super offensive. Everybody loves it. I got kudos for you. And he's like, dude, my dick is so small in this weather. I mean, you know.",
    "timestamp" : "38:05-38:26"
  },
  {
    "timestamp" : "38:27-38:29",
    "text" : "Sometimes you gotta say what you gotta say.",
    "speaker" : "Andy"
  },
  {
    "text" : "That's the thing, right? Doesn't it sucks when bitch trip up inside you? Yeah. No, but I got an innie. It's so cold out. You know, you can't make that joke on air.",
    "timestamp" : "38:30-38:40",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "38:40-38:49",
    "speaker" : "Andy",
    "text" : "No, but that zero degrees one that fucking kills. But that's corny humor too."
  },
  {
    "timestamp" : "38:49-38:51",
    "speaker" : "Greg",
    "text" : "It's it's sells it."
  },
  {
    "timestamp" : "38:53-39:19",
    "speaker" : "Steve",
    "text" : "Deep cut pro commentator. Very end of the game, they're taking a knee. And he's like, What do you think? They hand it off and have the guy stand there and get tackled, and then he fumbles it. And he's like, oh come on, man. And they were talking about the miracle of the Metal Lands when the Eagles did that to the Giants. They handed it off and they didn't need to. He fumbles it, picks it up, scoops, and scores, and they win. Who was it? Because Phil Sims is a big Giants guy. It wasn't that Herman Edwards?"
  },
  {
    "speaker" : "Greg",
    "text" : "It was Herman Edwards that was the Eagles guy that picked it up and returned for a touchdown, yeah.",
    "timestamp" : "39:19-39:24"
  },
  {
    "timestamp" : "39:24-40:13",
    "text" : "Yeah. Yes, it was. Cornerback Herman Edwards. Exactly. 1917. Yeah. Uh speaking of fumbles, I think the guy who had the worst game for the Patriots in this was uh Daniel Graham. Oh, that's not even close. And he's I understand. I remember now being like super frustrated with him because when he gets it right, like he's unstoppable. He's an absolute monster. He's this huge dude. He's like He's like the same size and like physicality as Gronk. And he seems like he has like the the maneuverability and the and the same athleticism as him, but he just like can't put it together. Dropped a couple of dropped a couple of balls. Yeah. One that would have been like setting up a touchdown. And I think that that one may have been when they missed the field goal, when Adam missed his field goal.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Pretty sure.",
    "timestamp" : "40:13-40:14"
  },
  {
    "speaker" : "Andy",
    "text" : "Um So that sucked. And then he also they they they're like, okay, well you're not going to catch the ball down the field. So they ran a screen to him. He caught it, got one yard. Got stood up and then uh fumbled the ball there too, which the Titans recovered. And that was when was that? That was halfway through the third. That's right before they tried that that double pass that Yeah, and this is this is like a couple plays later after Tennessee had scored the tying touchdown. So it's it's tie game 14 right now. Patriots like start moving the ball a little bit and then Graham fumbles, Titans recover. And luckily the Titans. Yeah, he's the anti-Kevin Falk.",
    "timestamp" : "40:14-40:58"
  },
  {
    "timestamp" : "40:58-41:10",
    "speaker" : "Greg",
    "text" : "Yeah, there is something about players where you get like an immediate eye test of whether they are that guy or not. Like Nikhil Harry is not that guy. He's a Daniel Graham category."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. I can see that.",
    "timestamp" : "41:10-41:12"
  },
  {
    "timestamp" : "41:13-41:15",
    "text" : "James White is a Kevin Falk category.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Kevin Falk, yeah.",
    "timestamp" : "41:15-41:16"
  },
  {
    "text" : "Edelman. Even uh what's his the kid the rookie from NC State? JJ Taylor No the uh wide receiver.",
    "timestamp" : "41:16-41:25",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "41:25-41:27",
    "speaker" : "Andy",
    "text" : "Um I want to say Bird, but it's the other one."
  },
  {
    "text" : "Um Myers Myers Myers, yeah Myers He he has the Kevin Falk like fall forward.",
    "timestamp" : "41:27-41:33",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "41:34-41:34"
  },
  {
    "speaker" : "Greg",
    "text" : "Get get the get the yards, know where the stick is.",
    "timestamp" : "41:34-41:37"
  },
  {
    "text" : "Get four yards when you need four. Yeah.",
    "timestamp" : "41:37-41:39",
    "speaker" : "Andy"
  },
  {
    "text" : "That's like a distinct characteristic of a player of like a yes or no do they have that? I'm saying yes on JJ.",
    "timestamp" : "41:39-41:45",
    "speaker" : "Greg"
  },
  {
    "text" : "He's had like four players in his career.",
    "speaker" : "Steve",
    "timestamp" : "41:46-41:48"
  },
  {
    "text" : "How do you know that? Yeah. Fine, I'm gonna say yes on Gunnar Olshevsky then.",
    "timestamp" : "41:48-41:57",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, that's how we're playing. I would sign off on that, yes. Wellchevsky's got those shifty moves that you saw from Edelman. That's actually a great comp, Andy.",
    "speaker" : "Steve",
    "timestamp" : "41:57-42:06"
  },
  {
    "timestamp" : "42:06-42:14",
    "speaker" : "Andy",
    "text" : "I think so. Unlike yours. You'll see. Maybe, yeah. I'm not saying you're wrong. I'm just saying we have no idea."
  },
  {
    "timestamp" : "42:17-42:32",
    "text" : "The worst is like when you like a guy that doesn't have that gene and you're rooting for him. And like every time you're like, ooh, he's getting a screen, he's gonna get yards, and then he gets like stood up and you're like, God damn it. You just want to be proven right, but yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "42:34-42:36",
    "text" : "Holding your guy, you're just like, God damn.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "42:37-42:39",
    "speaker" : "Greg",
    "text" : "Yeah, yeah, holding on fucking number 15."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:39-42:56",
    "text" : "You're like, fucking yeah, damn it, Sony Michelle. Like just I'm just Michelle. One broken tackle, bro. Sony Michelle. I've been standing at you since the beginning and you just ah come on. Prove me right. Uh I still think he's got it. He looked good. He looked good this past season."
  },
  {
    "speaker" : "Steve",
    "text" : "If he can catch the ball, he'll be awesome. Yeah.",
    "timestamp" : "42:56-42:59"
  },
  {
    "timestamp" : "43:00-43:14",
    "speaker" : "Andy",
    "text" : "Speaking of catching the ball, though, we're going to jump kind of towards the end of the game because not much happened in the third quarter. Um somebody who went from having like a great game to a terrible game, Drew Bennett."
  },
  {
    "speaker" : "Steve",
    "text" : "From the hero to go. Yeah.",
    "timestamp" : "43:15-43:17"
  },
  {
    "timestamp" : "43:17-43:41",
    "speaker" : "Andy",
    "text" : "Because he made catches. The the Titans have they're on their last drive. I think they're yeah, they're in their two-minute drill. Um and they're driving down the field. They get to about an England 35. When it's gets to the two-minute warning and uh down a field goal, because Adam finally Ooh, that was probably the closest field goal of seeing him kick."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, that's a pretty close one.",
    "timestamp" : "43:41-43:42"
  },
  {
    "text" : "That one died halfway and and just barely sailed over the the left corner.",
    "timestamp" : "43:42-43:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Snuck it in there.",
    "timestamp" : "43:46-43:46"
  },
  {
    "text" : "Yeah, hooked it in. It would have been a great soccer goal, basically, kind of hook it in that top corner, sort of thing. Um, but on this drive, Drew Bennett makes two outstanding catches on the sideline. Both I think get reviewed, both get upheld because He just keeps control, gets both managed to tap both feet down. One of them was in double coverage, the ball that shouldn't have even been thrown to him. But because the Titans, I don't know, they just seem to make they didn't make a lot of warning Yeah, they didn't make a lot of mistakes, but they made them at the worst possible times.",
    "timestamp" : "43:47-44:26",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "44:27-44:29",
    "text" : "It was two minutes warning, they're on R thirty-three.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "44:30-44:30",
    "speaker" : "Andy"
  },
  {
    "text" : "And we're up three.",
    "timestamp" : "44:31-44:32",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:32-44:32",
    "text" : "Yeah. Ye"
  },
  {
    "text" : "And they're they're sitting pretty.",
    "timestamp" : "44:32-44:34",
    "speaker" : "Steve"
  },
  {
    "text" : "And then it goes intentional grounding, which I hate to call, but it was the right.",
    "speaker" : "Andy",
    "timestamp" : "44:34-44:40"
  },
  {
    "speaker" : "Steve",
    "text" : "It was. The Patriots have just decided to bring big blitz every time. They're just like I actually had he got like hurt and he was hobbled like the play before.",
    "timestamp" : "44:40-44:47"
  },
  {
    "text" : "Yeah, because he ran for a bunch of yards. And then so they had the grounding and then a holding and then like a couple of non-plays. So it's third and 23. And Bennett makes an amazing catch on the sideline, but it's still fourth and twelve. Um, so the Titans are still like, so they they still they basically started at 35 and now they're Further back than that and because they have what's the name? Gary Anderson kicking. Mr. Facebar himself. Getting up there in age, so he's not gonna be able to boot these long kicks in the cold. Because we've seen even Adam Vinateri. Uh he hit he missed from 44 and then hit from 46, but that 46 one barely snuck over. And this is about that range for an old guy. So like fuck, we're gonna go for fourth and 12. Going for it.",
    "speaker" : "Andy",
    "timestamp" : "44:47-45:39"
  },
  {
    "timestamp" : "45:39-45:40",
    "speaker" : "Greg",
    "text" : "Okay."
  },
  {
    "speaker" : "Andy",
    "text" : "And again, pages bring the blitz. McNair hucks it up like that's cause that's what he does now. And uh hits Drew Bennett Right in the hands. Like it was one of those things where Drew Bennett was like running past the defender and the ball hung up. So he stopped and everybody ran past him. And so he jumped up to catch it. Hit him in both hands and sprung straight out and then he got hit by three, maybe four pages defenders. So didn't have a chance to catch the rebound. And that was basically the game. But from going from having those two amazing catches to dropping what was essentially an easier version of those catches, like in the middle of field.",
    "timestamp" : "45:40-46:19"
  },
  {
    "timestamp" : "46:20-46:21",
    "text" : "It was it was a gimme, yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "Kind of uncontested, really. And just like hit him in both hands and he dropped it. That was a tough look.",
    "timestamp" : "46:21-46:27",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That's my nightmare.",
    "timestamp" : "46:27-46:29"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Oh god, yeah.",
    "timestamp" : "46:29-46:31"
  },
  {
    "timestamp" : "46:31-46:38",
    "speaker" : "Greg",
    "text" : "Because nobody remembers the other two days. And like catching a football is probably like a yeah, I mean you don't think about it, right?"
  },
  {
    "timestamp" : "46:38-46:40",
    "speaker" : "Andy",
    "text" : "No. I bet unless you do it."
  },
  {
    "speaker" : "Greg",
    "text" : "It's a muscle memory thing. So like that's gonna be so hard to like mentally get over.",
    "timestamp" : "46:42-46:47"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "46:47-46:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "46:49-47:06",
    "text" : "I know I know obviously I can make this catch. Why did I not make it there? Is it because I'm a beta and I can't handle pressure? Right. Is it because it was cold or am I making excuses because it was cold? You know, like I I wonder what the mental gymnastics that he goes through having to like work through that."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah they showed us a shot of uh Steve McNair like giving him a like a pep talk on the sideline like right after it.",
    "timestamp" : "47:06-47:11"
  },
  {
    "text" : "Oh really? That's good leadership. That's good. That's great leadership. Yeah. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "47:12-47:16"
  },
  {
    "text" : "It's exactly what needs to happen. That's that's a tough way to go out though.",
    "speaker" : "Andy",
    "timestamp" : "47:16-47:20"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "47:20-47:20"
  },
  {
    "timestamp" : "47:21-47:21",
    "speaker" : "Steve",
    "text" : "Because he had it."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:21-47:23",
    "text" : "And all it was there's over."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "47:23-47:29",
    "text" : "There'd been like a first goal from the 20-yard line With like, I don't know, a minute left."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:29-47:59",
    "text" : "Yeah. Within field goal range now and you could take the lead. Um so yeah, so the pages take over with about a minute and a half left and because the Titans had screwed up the clock so bad I think they had to call They called a timeout uh early in the third, I think, um, because they kept like running up against the the play clock. And so they had total delay games too. They had they had three total delay games. I think one was probably on purpose because of the punter."
  },
  {
    "text" : "That's because the Pats were messing with the radios. like they did it when Pittsburgh was here.",
    "speaker" : "Greg",
    "timestamp" : "47:59-48:03"
  },
  {
    "timestamp" : "48:03-48:55",
    "speaker" : "Andy",
    "text" : "Oh probably. No, they were they were messing with the play clocks now, I would guess. Cheater, cheaters. That's what Tennessee fans would say. But yeah, they just couldn't get the playoff in time. So they had to burn a timeout there. And then they burnt another one on like on defense, I think, because the Patriots were driving when they held them to a field goal. Uh and then so they only had the one timeout left, so they they could only stop the clock once. So the pages ran it and then started to take a knee. But In true, like I guess Brady Belichick fashion, the first time Brady goes to take a knee, he he steps back, he's gonna take a knee, but doesn't to run a couple extra seconds off the clock. So the Titans do like the the kind of like step forward and then realize the play's not over and then they actually rush him and then he takes the knee. But they hit him anyway because like, you know, I probably would too. Fuck you."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah, you gotta hit him.",
    "timestamp" : "48:55-48:56"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:56-49:01",
    "text" : "Yeah, if you're not gonna go down, I'm gonna make sure you make sure you do. Um that starts a rock."
  },
  {
    "text" : "They cut to him and he was livid. Because the only person had steam coming up his head in the whole game was Ronnie Harrison.",
    "speaker" : "Steve",
    "timestamp" : "49:02-49:07"
  },
  {
    "speaker" : "Andy",
    "text" : "Even Teddy Brucekeep were where they were bouncing up and down the sidelines. They were hot. And so Skirmish Breaks Out, which worked in the Page of Advantage because that kept the clock going during the whole thing. And so It actually killed a decent amount of time, but then so they took another knee. This time Brady actually takes it for real, like in one motion. Um and so there's now I think they and they like let the clock run down to three seconds left, but it's fourth down. So what do you do? And I think this for me is another Like just small example of Bill Belichick thinking of every single situation and probably had this dialed up. Well, what do you do? Because like you said, you don't want Andy. You don't want to hand it off. You don't you don't you can't take a knee because it's fourth down. Yeah. So it's uh meeting is sub. So what do you think?",
    "timestamp" : "49:07-50:02"
  },
  {
    "text" : "30 seconds left.",
    "timestamp" : "50:03-50:03",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, you you can't you can't fumble it because you you can't give the ball back. So what's the safest play? And so the pages come up, Brady Snaps the ball, runs backwards, and just throws it as far as he can. And they they send, I think it was David Gibbons down the sideline. And Brady overthrows him by about 20 yards. I think it probably should have been. It wasn't quite that. It was a little closer than he probably wanted it to be. But just so it wouldn't be grounding, so you wouldn't have the penalty. And that runs out the last three seconds of the game. And I can see by Greg's face he doesn't agree with me. So first of all, fuck you. Second of all, why?",
    "timestamp" : "50:03-50:38"
  },
  {
    "speaker" : "Greg",
    "text" : "First of all, it's fucking common sense. Any coach in the NFL would have done that. What do you think? People are gonna punt there? You think Phil literally, you could I you could do one of ten things. You could do, okay, I snap it and fucking walk backwards for three seconds. You could do a punt where they don't actually punt it. They just snap it and he stands there for three seconds. Teams do that shit all the time, dude.",
    "timestamp" : "50:39-50:58"
  },
  {
    "speaker" : "Andy",
    "text" : "But the play has to end. So what happens if your punter fumbles it? Like that's the what they they took the Okay, tell them to take a knee.",
    "timestamp" : "50:58-51:06"
  },
  {
    "timestamp" : "51:06-51:15",
    "speaker" : "Steve",
    "text" : "Yep. What if you get an intentional grounding? You've seen it before. You've seen a fair amount of football games end on just the air ball out of bounds where the guy running down the sideline."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. I think it's a little bit more than a little bit. Did he get out of the pocket? Did he get Brady out of the pocket? Yeah. Oh, well, that's why they sent the guy down the sideline because they didn't. Oh, 'cause I've seen coaches direct the quarterback to immediately sprint out of the pocket and then throw it away. So they make sure they don't get intentional grounding. But you it's funny Belichick didn't think of that. Oh He didn't need to.",
    "timestamp" : "51:15-51:36"
  },
  {
    "timestamp" : "51:36-51:38",
    "text" : "Tom Brady ran for two first downs this game.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "51:38-51:39",
    "speaker" : "Greg",
    "text" : "Yeah, he had Tom Brady."
  },
  {
    "timestamp" : "51:47-51:52",
    "speaker" : "Andy",
    "text" : "That's why they sent the wide receiver down there. And you throw it in that general direction, problem solved."
  },
  {
    "timestamp" : "51:53-51:56",
    "speaker" : "Greg",
    "text" : "Wait, if it's if it's intentional grounding"
  },
  {
    "timestamp" : "51:57-51:59",
    "speaker" : "Andy",
    "text" : "A receiver has to be in the area. No receiver."
  },
  {
    "timestamp" : "51:59-52:05",
    "speaker" : "Greg",
    "text" : "I know, but I know, but it's a loss of down play. Does the the other team gets a play then, yeah I don't know."
  },
  {
    "text" : "I think you're right, because didn't the Ravens do something like that a few years ago where it was a uh They did something like that. It was supposed to be like a punt and uh they did like a delay a game or something on like on the punt and that ran the clock because they're on offense. Um and so it ran the last five seconds off, and that was the end of the game. And so I think they've actually since closed that loophole.",
    "timestamp" : "52:11-52:35",
    "speaker" : "Andy"
  },
  {
    "text" : "Sounds like a loophole, right?",
    "speaker" : "Greg",
    "timestamp" : "52:35-52:36"
  },
  {
    "timestamp" : "52:36-52:41",
    "speaker" : "Andy",
    "text" : "Yeah. So if Balchuk doesn't figure it out, fucking uh what's his name? Well"
  },
  {
    "speaker" : "Greg",
    "text" : "So the Pats win on uh on a Belichick genius play. 2017-14?",
    "timestamp" : "52:41-52:47"
  },
  {
    "speaker" : "Andy",
    "text" : "17-14.",
    "timestamp" : "52:47-52:48"
  },
  {
    "timestamp" : "52:48-53:01",
    "text" : "Oh14. And we're on to the AFC conference game. 13 wins in a row? Thirteen wins in a row. Are we thirteen? Thirteen wins in a row.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "53:01-53:02",
    "speaker" : "Andy",
    "text" : "That's a lot."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, it's a wagon.",
    "timestamp" : "53:03-53:05"
  },
  {
    "timestamp" : "53:05-53:11",
    "speaker" : "Andy",
    "text" : "Yeah. And they've only got one blowout in that, which was H17."
  },
  {
    "speaker" : "Greg",
    "text" : "He just held the fifth ranked offense to fourteen points.",
    "timestamp" : "53:11-53:16"
  },
  {
    "timestamp" : "53:16-53:26",
    "speaker" : "Andy",
    "text" : "Mm-hmm. And not in their records either. Yeah. Let's see, they had uh 284 total yards, which is not bad. Page had uh two."
  },
  {
    "speaker" : "Greg",
    "text" : "Not very many.",
    "timestamp" : "53:27-53:28"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:28-53:32",
    "text" : "No. McNair played well, I think, still."
  },
  {
    "speaker" : "Greg",
    "text" : "Well this is a good uh jumping point to the other games to put it into some context of what what Yeah.",
    "timestamp" : "53:32-53:39"
  },
  {
    "timestamp" : "53:40-53:42",
    "text" : "Yeah, because they they they kept it.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "53:42-53:44",
    "text" : "As good as the Patriots are."
  },
  {
    "timestamp" : "53:45-53:49",
    "speaker" : "Andy",
    "text" : "Yeah. Talk to me. The cults. No, I was talking about the colours."
  },
  {
    "timestamp" : "53:52-54:14",
    "text" : "In all this three other divisional games going on, they're all ridiculous. All of them. So the Colt the Colts, so as good as the Pats have been defensively, the Colts have been like even more impressive offensively in the playoffs. They are an absolute offensive wagon. Yeah. They steamrolling teams. They haven't punted in two games. Yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "This is like General Sherman running through the street. Just just raising things up.",
    "speaker" : "Andy",
    "timestamp" : "54:14-54:20"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, because I remember their first punt.",
    "timestamp" : "54:20-54:22"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "54:22-54:31",
    "text" : "Yeah, so they beat the Broncos, beat the breaks off them 41 to 10, 479 total yards, no punts."
  },
  {
    "speaker" : "Andy",
    "text" : "Didn't Manning have a perfect uh passer rating?",
    "timestamp" : "54:31-54:34"
  },
  {
    "text" : "Perfect passer rating, five touchdowns, no picks. This this week against the Chiefs, they go into Arrowhead and beat the Chiefs 38-31. 434 total yards, no punch. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "54:34-54:48"
  },
  {
    "text" : "Yeah, that game must have been very entertaining.",
    "speaker" : "Steve",
    "timestamp" : "54:49-54:51"
  },
  {
    "speaker" : "Greg",
    "text" : "I watched the highlights and the calls were just fucking unstoppable. Like they they just get every time the Chiefs score a touchdown, they get like they got a Dante Hall kickoff return for a touchdown, like okay, we're back in this. And then Manning would just be like eight plays, 75 yards, touchdown. Like every single fucking time. Well this is unstoppable.",
    "timestamp" : "54:51-55:12"
  },
  {
    "text" : "Didn't we talk about this? Is the season that um the Colts came back against was it Tampa or Chicago or someone? And they scored like thirty points in the fourth quarter, something stupid like that.",
    "timestamp" : "55:13-55:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:24-55:27",
    "text" : "Dude, they came out they came back against the Pats, almost beat the Pats."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah, yeah.",
    "timestamp" : "55:27-55:28"
  },
  {
    "timestamp" : "55:28-55:37",
    "speaker" : "Greg",
    "text" : "Did Peyton Manning and the Two games has thrown eight touchdowns, no picks, 680 yards, and only 12 incompletions."
  },
  {
    "timestamp" : "55:38-55:41",
    "speaker" : "Andy",
    "text" : "So wait, he has almost as many touchdowns as incompletions."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:41-55:50",
    "text" : "Yep, and his teams have scored 79 points. Wow. So he's coming into New England and he's a co-MVP."
  },
  {
    "timestamp" : "55:50-55:50",
    "speaker" : "Andy",
    "text" : "Right."
  },
  {
    "text" : "With with the guy you just beat. Right. So there, you know, this is literally like the what is it? The irresistible force versus the immoval object. Right. Is what's about to happen next week in New England. So that's one of the AFC, the the playoff games. If you go to the NFC, the Eagles beat the Packers. 20 to 17 in overtime. This is the fourth and twenty-six. Oh my god. Freddie Mitchell. Yes.",
    "speaker" : "Greg",
    "timestamp" : "55:50-56:21"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:21-56:24",
    "text" : "So it's Freddie Mitchell's the one that caught the fourth and twenty-six?"
  },
  {
    "text" : "Oh yeah, dude. I did not know that. Yes.",
    "speaker" : "Greg",
    "timestamp" : "56:25-56:29"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:29-56:30",
    "text" : "God damn. Okay."
  },
  {
    "text" : "That's basically like his only calling card. Is that the same thing?",
    "speaker" : "Greg",
    "timestamp" : "56:30-56:33"
  },
  {
    "timestamp" : "56:33-56:34",
    "text" : "Yeah, like that's his highlight.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. Yes. He he made a name out of that one player.",
    "timestamp" : "56:34-56:37",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh yeah, he milked that one good. Yeah.",
    "timestamp" : "56:38-56:40",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:40-57:10",
    "text" : "So it was they were down three. The Eagles were down three at home. It's a minute 12 left, and it was fourth and 26. And they convert it to Freddie Mitchell. They tie it, go to overtime, and then you guys will love this, but Brett Favre throws an absolutely horrendous overtime interception. Like he like He like punts it to Brian Dawkins who returns it to like the the Packers 40 yard line. They kick a field goal game over. Packers season done.",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh I remember that because remember uh Like NFL 2K came out around this time. Remember those games for the Dreamcast? Yeah. Yeah. And they used to do like the situations. And this was one that they put in the game. And it was like the hardest one to do because it was fourth and twenty-sixth. And you're playing with the fucking eagles. And I had such a hard time completing that task. Not an easy one to do.",
    "speaker" : "Andy",
    "timestamp" : "57:10-57:35"
  },
  {
    "timestamp" : "57:35-57:40",
    "text" : "Yeah, so this is the Eagles third straight trip to the NFC title game. Yep.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "They would make four.",
    "timestamp" : "57:40-57:41"
  },
  {
    "text" : "Um and then meeting them there will be the Carolina Panthers who beat the Rams. Oh my god.",
    "timestamp" : "57:44-57:50",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "57:51-57:54",
    "speaker" : "Andy",
    "text" : "This was one you kept showing the highlights of because this game had already happened."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, this game was I watched like uh uh the the condensed game. Yeah it was it was absolute insanity. Yeah So this this is the tail end of the Rams greatest show on turf. So it's actually not Kurt Warner anymore. This is Mark Bulger. But they still yeah, they still got uh Mike Martz, they got Bruce, Tori Holt led the Led the NFL in receiving yards. They still have Marshall Fawkes. So this is still very much the greatest show on turf. Yeah. Um, favorites at home. Yeah. Against Jake Delome. uh Mushin Muhammad and Steve Smith.",
    "timestamp" : "57:54-58:38"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:38-58:44",
    "text" : "And who was their running back to who because it was a rookie running back because the other guy got hurt because it was Steven Davis, but he got hurt."
  },
  {
    "speaker" : "Greg",
    "text" : "Steven Davis and then Deshaun Foster. Yeah. Guy from UCLA. Yeah. So the regular like the most of the game was pretty cagey. There's like a shit ton of field goals, a lot of missed opportunities. But basically it gets to two and a half minutes left in the fourth quarter. The Rams have kicked five field goals. So they're down 11 with 239 left.",
    "timestamp" : "58:45-59:12"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh my god.",
    "timestamp" : "59:13-59:13"
  },
  {
    "speaker" : "Greg",
    "text" : "They storm down, they uh score a touchdown, kick uh get the two X the X the two-point conversion. Kick an on-size kick. Jeff Wilkins recovers his own onside kick.",
    "timestamp" : "59:14-59:27"
  },
  {
    "timestamp" : "59:27-59:28",
    "speaker" : "Andy",
    "text" : "Hell yeah, Jeff Wilkins."
  },
  {
    "text" : "After kicking five.",
    "timestamp" : "59:29-59:30",
    "speaker" : "Greg"
  },
  {
    "text" : "Field goals already in this game.",
    "timestamp" : "59:30-59:31",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, yeah. Kicks file field goals, recovers his own onset kick. Um yeah, she kicked four up to that point, not to the spoiler.",
    "timestamp" : "59:32-59:40",
    "speaker" : "Greg"
  },
  {
    "text" : "But okay.",
    "timestamp" : "59:40-59:41",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "59:41-01:00:27",
    "text" : "So then they um They march down with like they have like it's the two-minute warning, they're on like the 30-yard line. And Mike Marks, for some reason, plays for overtime. They have like the number one uh offense in the NFL and he's like no they like run it three times just scores a touchdown kick a field goal they like burn a minute and a half off the clock on purpose didn't make any sense So they uh kick the field goal, tie the game, go to overtime, and both teams have like get it into the opponent's territory twice. Uh Jeff Wilkins, after going five for five in regulation, misses a 54-yard field goal.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:00:27-01:00:30",
    "speaker" : "Andy",
    "text" : "I mean that's a long short but still Yeah. Come on, man."
  },
  {
    "timestamp" : "01:00:31-01:00:46",
    "speaker" : "Greg",
    "text" : "Uh the the the Panthers march down to like that 33 yard line. Yeah. Kick a field goal. It's good. They had to delay a game. Oh back it up five yards, kick the second one, miss it."
  },
  {
    "text" : "John Casey, who I think we'll see later.",
    "speaker" : "Andy",
    "timestamp" : "01:00:47-01:00:49"
  },
  {
    "timestamp" : "01:00:49-01:02:05",
    "text" : "John Casey, who had he went three for three. Up and he missed one to when they're up 11 too. Oh he hit the upright when they're up 11. Oh that would have made a 14. Um so then the the Rams get the ball back and they're driving. They're like in Panthers territory late first overtime. They throw a pass. It gets picked off by Manny, who like tears it away from Tory Holt. So they pick it off at their own 39. So they were like almost in field goal territory. And then the very first play of second overtime. Like a a deep slant to um or post rod to Steve Smith and he just house call. So Jason Seahorn just gets torched, the last remaining white defensive back, ends his career on that play, chasing Steve Smith 69 yards down the field. And the Panthers walk off. They end a 13-game home winning streak for the Rams. The Rams are done. This like no-one team with Jake Delome starting a quarterback makes the NFC conference game.",
    "speaker" : "Greg"
  },
  {
    "text" : "End of the dynasty, you would say, for the the I think that's the end of the greatest show on turf.",
    "speaker" : "Andy",
    "timestamp" : "01:02:05-01:02:11"
  },
  {
    "text" : "Yeah. Yeah. I don't think they were ever the same. Just an absolute crazy game. Like it could have been one on like six different plays that didn't go there.",
    "speaker" : "Greg",
    "timestamp" : "01:02:11-01:02:22"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:02:22-01:02:23"
  },
  {
    "speaker" : "Steve",
    "text" : "And it just And on the first overtime no one scored, like they played a whole overtime with no scores. Yeah.",
    "timestamp" : "01:02:23-01:02:28"
  },
  {
    "timestamp" : "01:02:30-01:02:30",
    "speaker" : "Greg",
    "text" : "Yep."
  },
  {
    "speaker" : "Andy",
    "text" : "And then literally the the the first play of second overtime.",
    "timestamp" : "01:02:31-01:02:34"
  },
  {
    "text" : "Yeah. And it wasn't even like a cagey like defensive like Yeah, no one scored because like the defense were playing the defenses were playing terrible. They just like got lucky on these like missed field goals or like interceptions. Like it was just insanity.",
    "timestamp" : "01:02:34-01:02:49",
    "speaker" : "Greg"
  },
  {
    "text" : "Absolutely brutal.",
    "speaker" : "Andy",
    "timestamp" : "01:02:50-01:02:51"
  },
  {
    "timestamp" : "01:02:51-01:03:31",
    "speaker" : "Greg",
    "text" : "Yeah. And and I I'll see if I can find a screenshot of Mike Marz's face when when they missed that field goal after the penalty. Where he just did this like he did like a little kid in a thing where he like puts his hands over his mouth and was like, oh my god. It was it was just like It it's just like a childlike reaction of like, I'm so excited But he was getting a ton of criticism after the game, especially because he he didn't try and go for it. Yeah. He played to the under regulation."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:31-01:03:32",
    "text" : "Yeah, with the best offense in the NFL."
  },
  {
    "text" : "Yeah. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:03:33-01:03:33"
  },
  {
    "speaker" : "Andy",
    "text" : "Typical Mike Marts.",
    "timestamp" : "01:03:35-01:03:37"
  },
  {
    "text" : "More like Mike Fartz.",
    "timestamp" : "01:03:38-01:03:40",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh shit.",
    "timestamp" : "01:03:40-01:03:41"
  },
  {
    "timestamp" : "01:03:41-01:03:43",
    "speaker" : "Greg",
    "text" : "Mike Fartz and his fans."
  },
  {
    "timestamp" : "01:03:45-01:03:47",
    "speaker" : "Andy",
    "text" : "Best of worst, yeah, Steve. What do you got?"
  },
  {
    "text" : "Um, I'm just gonna start with the best of the best. Troy Brown fourth and three conversion.",
    "timestamp" : "01:03:48-01:03:54",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:03:55-01:03:57",
    "speaker" : "Andy",
    "text" : "Yeah, Troy Brown for three."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Oh. Oh, I ran on the fourth and four, three. The off on fourth down.",
    "timestamp" : "01:03:57-01:04:04"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:04-01:04:44",
    "text" : "Got it. Trey Brown clutch. And he didn't he didn't really have like any Other game. I think it was his second, but yeah. He had like one other that was like a screenplay that didn't go anywhere. But I mean that that was kind of This offense too. Like they showed the the stat of like uh the past distribution. And there's a one, two, three, four, five, six, seven, eight guys on this list. Fourier leads it with three catches. Johnson, Bethel Johnson has two catches. Everybody else has one. Dietrich Ward is in there getting the nice. Dietrich Ward, yeah. Kevin Fall, Givens, Brown, Larry Senters, Dion Branch. One catch."
  },
  {
    "text" : "I had another sneaky best.",
    "timestamp" : "01:04:44-01:04:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "All right.",
    "timestamp" : "01:04:46-01:04:46"
  },
  {
    "timestamp" : "01:04:46-01:04:50",
    "text" : "Uh Tank Williams has his whole name on his jersey.",
    "speaker" : "Steve"
  },
  {
    "text" : "That's pretty good. I mean Sashix Tank has be very if my name was Tank Anything, you Damn well better be sure that name.",
    "speaker" : "Andy",
    "timestamp" : "01:04:51-01:05:02"
  },
  {
    "speaker" : "Steve",
    "text" : "Do you think they had like two T Williams on the team? And they're like, well, we have two T Williams. We'll just put like Tank's name's only four letters long anyways. Stat check. That's my guess. Tennessee.",
    "timestamp" : "01:05:02-01:05:13"
  },
  {
    "timestamp" : "01:05:13-01:05:24",
    "text" : "Nice. I think he is the only one. I'm looking at the roster right now. And this is one on offense. Albert Hanzer, shout out.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:05:24-01:05:29",
    "speaker" : "Andy",
    "text" : "Shout out Albert Hanzer. When you're still trying, yeah. Who knew? Yeah, second year. I see no other."
  },
  {
    "timestamp" : "01:05:30-01:05:45",
    "text" : "The worst was the Pick six for Teddy Bruski, that was false start. Oh, that was wrong. It was a quick like uh throw on a hot throw from McNabb was catch it and throw it Yeah. Bruce had it, but they you couldn't even hear the fall starter so loud.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:05:45-01:06:12",
    "speaker" : "Andy",
    "text" : "Bruzge had it and with nobody near him, just like yards of green in front of him. Would have been a big sixth step. And I think that Ended up with uh yeah that that was the the tying touchdown too that the Titans were going to score. Yeah on that he freaking So huge swing 14 point swing yeah yeah Tough. Uh Greg, best and worst. What you got?"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay. Uh the worst I'm gonna say the over-under.",
    "timestamp" : "01:06:12-01:06:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Always looking for the negatives first. Such a pessimist.",
    "timestamp" : "01:06:22-01:06:25"
  },
  {
    "text" : "The over under on this game was a 34. Like imagine that in the modern NFL. They not know what this is.",
    "timestamp" : "01:06:26-01:06:35",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:06:36-01:06:36",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:06:37-01:06:41",
    "speaker" : "Greg",
    "text" : "No shit. Imagine hitting the under uh 34 over on the water."
  },
  {
    "text" : "It was",
    "speaker" : "Andy",
    "timestamp" : "01:06:41-01:06:41"
  },
  {
    "text" : "So that's the one.",
    "timestamp" : "01:06:44-01:06:45",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Granted, both these teams are like pass first teams, which is like kind of the new thing in the NFL at this point. Like the Pages came out in five wide pretty much the whole game. Past D was just so good back then though. Yeah, that's true. I mean Brady threw it 41 times.",
    "timestamp" : "01:06:45-01:07:01"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, that's crazy.",
    "timestamp" : "01:07:03-01:07:03"
  },
  {
    "timestamp" : "01:07:04-01:07:05",
    "text" : "That's a lot of times though.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07:05-01:07:08",
    "speaker" : "Steve",
    "text" : "Yeah. Yeah, because they had no run game, dude"
  },
  {
    "speaker" : "Andy",
    "text" : "It's true.",
    "timestamp" : "01:07:07-01:07:08"
  },
  {
    "text" : "I mean Antoine had a couple good carries, but that's it.",
    "timestamp" : "01:07:08-01:07:10",
    "speaker" : "Steve"
  },
  {
    "text" : "Antoine ran well, I thought. Uh the Patriots had 27 carries for 90.",
    "speaker" : "Andy",
    "timestamp" : "01:07:10-01:07:14"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:07:15-01:07:19",
    "text" : "Antoine did he did run well. Yeah, he was doing pretty good. Then he got hurt on that play."
  },
  {
    "text" : "He did.",
    "speaker" : "Andy",
    "timestamp" : "01:07:19-01:07:19"
  },
  {
    "timestamp" : "01:07:20-01:07:21",
    "speaker" : "Steve",
    "text" : "One more carry and that was it."
  },
  {
    "timestamp" : "01:07:21-01:07:25",
    "speaker" : "Andy",
    "text" : "16 carries, 69 yards, touchdown, longest of 17."
  },
  {
    "text" : "Not bad. All right. So for my best, I'm doing a preemptive uh best. Okay. for next week because just giving one best to Tylaw for next week is not nearly enough He needs at least two bests. Maybe a preemptive Tyla best for AFC conference game. I can't fucking wait to rewatch this game because I fucking love Tyla. It's true. This is definitely his best game.",
    "timestamp" : "01:07:25-01:08:00",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:02-01:08:04",
    "text" : "One of the all-time games of any cornerback."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:08:04-01:08:34",
    "text" : "Yeah. All right, my best. Uh see we in this house we do best first is um Tom Brady. Still has not thrown an interception at home. And he threw another touchdown, so I think he's eight touchdowns, zero interceptions at home, which is crazy considering he's thrown 12 interceptions on the season. So good for him. So every single exception has come on the road. All 12 of them. But he's unflappable at home."
  },
  {
    "timestamp" : "01:08:34-01:08:35",
    "speaker" : "Greg",
    "text" : "Yeah. Unflappable."
  },
  {
    "speaker" : "Andy",
    "text" : "So luckily they'll they're playing at home next week.",
    "timestamp" : "01:08:36-01:08:38"
  },
  {
    "speaker" : "Greg",
    "text" : "Unfappable.",
    "timestamp" : "01:08:39-01:08:40"
  },
  {
    "timestamp" : "01:08:40-01:08:46",
    "speaker" : "Andy",
    "text" : "Unfappable. I don't think he's unfappable. Well, unfappable. He's a good looking man. Um"
  },
  {
    "text" : "Do you care to ex explain that to mom who's listening?",
    "timestamp" : "01:08:47-01:08:50",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mom",
    "text" : "No, we'll we'll just say uh sometimes a naughty boy.",
    "timestamp" : "01:08:50-01:08:54"
  },
  {
    "timestamp" : "01:08:58-01:09:10",
    "speaker" : "Andy",
    "text" : "What is it? Very naughty. I apologize, Mom. I'm sorry. Trust me, Mom. You don't want to know. Do not Google that. My worst."
  },
  {
    "speaker" : "Steve",
    "text" : "Hold on. I have a great mom story. I remember going up to mom and being like, hey mom, what's a wanker? She's like someone who masturbates a lot and I'll never say that again.",
    "timestamp" : "01:09:11-01:09:23"
  },
  {
    "text" : "Oh I I did something similar, but it was um oh what's the word um The one who fucks animals. What's what's that word that the English use all the time? Bugger? Bugger. Bugger, yeah. I asked Dad what bugger is. Like, why do you call everybody bugger? What does that mean? Like, well technically it means uh Uh somebody who who has sex with animals, so don't say it. That's it. Yeah, that was it. Oh Don't tell me. Oh, okay. That takes on a different meaning than the way you use it. My worst in this game was I I think the the way that the commentating team built up Craig Hentrick, the Titans Punters. knuckle ball punt that he does. He does it sometimes, but it's impossible to catch. And so they were waiting for him to waiting for him to do it. And then he finally did it and uh it was a a net punt of 14 yards. So it went a whole 14 yard it it knuckled because it when he kicked it, yeah, he just kicked it and it didn't it didn't rotate, so just like hung in the air And the Patriots is like they they didn't return it, but it hit and it bounced 15 yards backward towards them. So it was a net pun of 14 yards.",
    "speaker" : "Andy",
    "timestamp" : "01:09:27-01:10:51"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Knuckle ball.",
    "timestamp" : "01:10:51-01:10:53"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:10:53-01:11:01",
    "text" : "I thought it was a good punt, but the punt itself was great, but the just kind of cool to see a punt like a knuckleball just dropping, like it wasn't spinning necessarily."
  },
  {
    "timestamp" : "01:11:01-01:11:07",
    "speaker" : "Andy",
    "text" : "But the whole the whole buildup of it, like oh he's gonna do his getting to a knuckle, and then he does it and it's like it it's it's a funny."
  },
  {
    "text" : "I thought it was good, it's just bounced funky, you know, he just got a bad bounce.",
    "timestamp" : "01:11:07-01:11:10",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:11:10-01:11:13",
    "text" : "Yeah, it's it's I mean ask Tim Wakefield. That's what happens. It's all about the weather when it's not.",
    "speaker" : "Andy"
  },
  {
    "text" : "I have another worst, Andy. Oh good. When you told Greg, in this house we do best first.",
    "timestamp" : "01:11:14-01:11:19",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:11:19-01:11:21",
    "text" : "Yeah. Damn right.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:23-01:11:28",
    "text" : "You're the most negative person in the world. You hate everything and everybody.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:28-01:11:43",
    "text" : "Except for the Patriots. So when it comes to the Patriots, we do best first In this house we're positive. Get fucked. Get fucked. Well, on that note, what's next week, Greg?"
  },
  {
    "timestamp" : "01:11:44-01:12:05",
    "speaker" : "Greg",
    "text" : "Next week, the immovable object versus the unresistible force, unstoppable force. Yeah, nailed it. The the Peyton Manning, Marvin Harrison, Edger and James, Reggie Wayne. Colts come to New England. This game must have been so fucking hyped."
  },
  {
    "text" : "Oh yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:12:05-01:12:05"
  },
  {
    "text" : "It was just like this is just such a fucking cool matchup because they're like completely different teams. Yeah. And both like the best units in the NFL at their own.",
    "speaker" : "Greg",
    "timestamp" : "01:12:06-01:12:15"
  },
  {
    "speaker" : "Andy",
    "text" : "The best offense versus the best defense. The game that they play in the regular season was an absolute classic. Absolute classic.",
    "timestamp" : "01:12:15-01:12:22"
  },
  {
    "speaker" : "Greg",
    "text" : "And now we get to do it again in New England. There's snow in the forecast. Let's go.",
    "timestamp" : "01:12:23-01:12:30"
  },
  {
    "timestamp" : "01:12:32-01:12:37",
    "text" : "Dude, I'm hyped. Who was favored in this game, do you think? Colts. Pop quiz.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:12:40-01:12:41",
    "speaker" : "Greg",
    "text" : "Pats by three."
  },
  {
    "timestamp" : "01:12:42-01:12:45",
    "speaker" : "Andy",
    "text" : "Pats by three and a half. Oh. Surprising."
  },
  {
    "speaker" : "Greg",
    "text" : "Yep. So toss up, but give pass three for home field advantage. Three and a half because it's snowing.",
    "timestamp" : "01:12:45-01:12:52"
  },
  {
    "speaker" : "Andy",
    "text" : "50% chance of snow, 100% chance of uh a good football game. So uh if you have any comments, um if if you're our mother and you want to talk about things that are very naughty. Um You can uh text uh the Dynasty Hotline. Steve Brown, what's the number?",
    "timestamp" : "01:12:52-01:13:10"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh 505. No.",
    "timestamp" : "01:13:10-01:13:14"
  },
  {
    "timestamp" : "01:13:15-01:13:18",
    "speaker" : "Andy",
    "text" : "603. 603 505."
  },
  {
    "text" : "Troy Brown 43. 8043.",
    "speaker" : "Steve",
    "timestamp" : "01:13:19-01:13:22"
  },
  {
    "text" : "Because if anybody's going to convert fourth and three, who's it going to be?",
    "timestamp" : "01:13:23-01:13:27",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "It's got to be Troy brown.",
    "timestamp" : "01:13:27-01:13:28"
  },
  {
    "timestamp" : "01:13:28-01:13:38",
    "speaker" : "Andy",
    "text" : "Gotta be Troy Brown. Troy Brown. 603-505-8043. Tell us your best Patriots story. Tell us your best Mama Brown story."
  },
  {
    "timestamp" : "01:13:38-01:13:40",
    "text" : "Tell us your best Piggly Wiggly story.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Tell us your best wanker story.",
    "timestamp" : "01:13:40-01:13:42"
  },
  {
    "text" : "Yeah, yeah. Where was it? What did you watch?",
    "speaker" : "Greg",
    "timestamp" : "01:13:42-01:13:53"
  },
  {
    "speaker" : "Mom",
    "text" : "Sometimes a naughty boy.",
    "timestamp" : "01:13:53-01:13:55"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:57-01:14:04",
    "text" : "Oh, and on that note, uh we will until next week. We will uh see you later."
  }
]