[
  {
    "speaker" : "Mom",
    "timestamp" : "00:00-00:17",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother."
  },
  {
    "speaker" : "Andy",
    "text" : "Welcome back to the Pagers Dynasty Podcast. We're here 2003 week 14 closing on the end of the regular season. And uh we haven't seen a loss in a long time, boys. That's right. It's been kind of nice. How many in a row is this? This is they come into this game with eight consecutive wins. Last time we saw a loss was week four in Washington. So we're one third of the way through, right? Is 23? I believe it's 21 or 23. I can't remember. We'll call it a third, roughly a third. We're cruising through, yeah. Um, but this is yet another game that our listeners will remember at least one play from And maybe only one play. I only remembered the one play, but we'll get to that. I agree. But we have the Miami Dolphins visiting Gillette Stadium. Uh and also Mother Nature visiting Gillette Stadium because the commentators in this game could not get over the fact that New England had received 28 inches of snow. It was a fair bit. Pretty good dump. That's a good dump. But this I think is an all-time Crowd shot game. Oh yeah, that's why it's the people literally just dug themselves it. Like you couldn't see the seat, so they just like dug a seat in the two feet of snow and just sat on that. And it was fucking amazing. Just like watching the people try to get to their seats and just like sliding down all the the snowbanks and stuff, just trying to like find somewhere to plop themselves.",
    "timestamp" : "00:23-02:02"
  },
  {
    "timestamp" : "02:04-02:12",
    "speaker" : "Greg",
    "text" : "I always wondered that about big snowstorms. How do you it's gotta be a logistical nightmare to shovel those with the seats and everything?"
  },
  {
    "speaker" : "Steve",
    "text" : "Well I think what happened is it dumped the snow right before during the day. Right. Because they were saying like we didn't even get that much in Boston. We got like a foot and then we get there and it's two feet. So it snowed snowed a shitload more south.",
    "timestamp" : "02:12-02:23"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "02:23-02:24"
  },
  {
    "speaker" : "Steve",
    "text" : "Imagine Route 1 doing all that shit too.",
    "timestamp" : "02:24-02:26"
  },
  {
    "speaker" : "Andy",
    "text" : "I feel like I've heard stories of people who went to this game and they said, you know, normally getting home takes two hours. This one it took like four and a half. Just because of how much.",
    "timestamp" : "02:27-02:38"
  },
  {
    "timestamp" : "02:39-02:41",
    "speaker" : "Steve",
    "text" : "It didn't snow during the game as much though."
  },
  {
    "text" : "No, there wasn't there wasn't a lot of snow happening during like it was happening at the beginning of the game, but it tapered off. pretty quick. Which honestly like right after the storm can actually be kind of nice. Oh yeah, it's always so quiet. Yeah. I love the way that the snow just like muffles all the sounds. It's beautiful. But let's see what was the weather. They showed the weather at the beginning. It was 28 degrees. Wind chill was 17. Winds of 15 to 30 miles an hour. Yeah, End's game was long as shit.",
    "timestamp" : "02:41-03:08",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "It was two hours on that YouTube. Let's give it a let's give it a Lombardi watchability score.",
    "timestamp" : "03:08-03:13"
  },
  {
    "timestamp" : "03:13-03:21",
    "text" : "Ooh, all right. Well first of all, I want to know, Greg, did you watch the entire game or did you do highlights? Highlights. Alright, yeah. I don't I don't blame it.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "03:21-03:31",
    "speaker" : "Greg",
    "text" : "I mean it's final score is 12 to nothing. I watch the few plays that probably are good to watch, but I don't see the rest."
  },
  {
    "timestamp" : "03:31-03:44",
    "speaker" : "Andy",
    "text" : "I like a defensive battle. Um even having said this, I think you could skip uh First three quarters. First half."
  },
  {
    "timestamp" : "03:44-03:52",
    "speaker" : "Steve",
    "text" : "You know what I wish I could do? Just skip all the offensive plays and just watch the defense snap to snap to snap. Because like when the pass does on, it was pretty impressive."
  },
  {
    "speaker" : "Andy",
    "text" : "Yes. Yeah, this was I actually wrote down that this was the I've never seen a Patriots defense as amped up as in this game. Like sort of every tackle was like an absolute monster hit. And then as soon as the guy, the tackler got up, he like everybody was jumping on him, like slapping his helmet, and just like everybody was just Amp to the nines. It was ridiculous. They're coming off the Colts game there. That's true. And also this if they win this game, they clinch AFC East as well. So it's a hat and t-shirt game.",
    "timestamp" : "03:53-04:34"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "04:34-04:51",
    "text" : "But the defense is so like dominant too though. Like this game, the Dallas game, the the even like the indie game they held Peyton Manning really good. So like they're playing out of their minds. It looks similar to The Patriots defense last year in 19 at the first half of the season first. They couldn't do shit against them."
  },
  {
    "text" : "Yeah. Yeah. I mean, this is their second shutout of the year.",
    "speaker" : "Andy",
    "timestamp" : "04:52-04:56"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "04:56-05:03",
    "text" : "Is that right? They had a stat in this game. They crossed 50 possessions with no TDs at home. Yeah."
  },
  {
    "timestamp" : "05:06-06:14",
    "speaker" : "Andy",
    "text" : "Well they showed it was 48 uh when Miami lined up at their own four-yard line. Uh right before the the infamous play. But let's see. They've had two shutouts so far, this one and then the the Cowboys. Both 12-0, strangely enough. I think there might be another one at the end of the season. Uh they held the Giants they held the Giants to six points and they held the Browns to three points. Which feels like ages ago. So one, two, three, four, five games have given up a total of nine points. Those bananas. And these are all against like good teams too. They showed a stat about Uh did I take a screenshot of that one? There's something about like the Patriots versus teams with oh yeah. Patriots versus teams with winning records this year. Uh 6-0. They beat Philadelphia 31-10, beat Tennessee. That was a good game, the 38-31. Beat Miami in overtime. So actually now there's 7-0 because they beat Miami again. Beat Denver, beat Dallas, beat Indy."
  },
  {
    "text" : "Well the Damer game is the intentional safety game too. Right.",
    "timestamp" : "06:15-06:17",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep.",
    "timestamp" : "06:18-06:18"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:18-06:20",
    "text" : "The indie game is the fourth down stop."
  },
  {
    "timestamp" : "06:21-06:26",
    "speaker" : "Andy",
    "text" : "Yeah. Tennessee game they won 38-30. That was with uh wasn't that Ty Law at the end to seal it?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yep.",
    "timestamp" : "06:26-06:27"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:27-06:30",
    "text" : "Where he limped his way in the end zone after after picking it off."
  },
  {
    "text" : "Was the Dolphins game the overtime bomb Detroit Brown? Yep.",
    "speaker" : "Steve",
    "timestamp" : "06:30-06:33"
  },
  {
    "text" : "So none of these are the only blowout really was Philadelphia, 31-10 coming off of the 31-nothing drubbing week one. Yes.",
    "speaker" : "Andy",
    "timestamp" : "06:33-06:41"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "06:41-06:41"
  },
  {
    "text" : "So so but there Brady's been playing his best against these winning teams as well. Um reverse those six teams. He's averaging 259 yards per game. He's throwing 11 touchdowns, only three interceptions, which is pretty good because he's actually thrown a handful of interceptions this season, like double digits, but only three against the good teams. His password rating is 95 and a half. So that's pretty good. Dolphins on the other hand, not so good. Um, at least not in the weather. There was a whole bunch of things about Miami teams playing in the weather and I think those are my favorite games when Miami comes to New England in December. Because they're always just woefully unprepared for some reason.",
    "timestamp" : "06:41-07:22",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, everybody looked cold except for Junior Seao.",
    "timestamp" : "07:23-07:25",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "07:26-08:05",
    "text" : "Yes. He did not look cold at all, but everyone looked freezing. But in the globe, I think it was the the day before the game. They had a little uh chart of all the games. Um of the Dolphins having played in Foxboro 10 times after December 1st. And of those 10 games, they have won only three of them. So not not great. And also um Miami since 97 playing games under 50 degrees, which apparently is cold for a Miami team. They are 3 and 10. Uh lost five straight and their turnover difference, negative 21.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "08:05-08:06",
    "text" : "That's tough."
  },
  {
    "text" : "And 13 games.",
    "timestamp" : "08:06-08:06",
    "speaker" : "Andy"
  },
  {
    "text" : "Butterfingers in the cold.",
    "timestamp" : "08:07-08:08",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "08:08-08:10",
    "speaker" : "Andy",
    "text" : "That's a lot. Yeah, they're just"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "08:10-08:17",
    "text" : "Well, it's probably has something to do with uh the underinflated footballs in New England. Yeah. You know."
  },
  {
    "text" : "Yeah, yeah, yeah. They do save those for the cold games. That's true. You don't want that competitive advent edge until it really counts.",
    "timestamp" : "08:17-08:25",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "08:26-08:32",
    "text" : "Just like me saving my um my underinflated tires this morning. for for the winter.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, this is appropriate for uh the the current climate these days. It's very true. Shout out Texas. Yeah.",
    "timestamp" : "08:32-08:41",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "08:41-08:48",
    "speaker" : "Andy",
    "text" : "Texas getting more snow than us up here in New England right now. Yeah, it feels very apropos, doesn't it?"
  },
  {
    "speaker" : "Greg",
    "text" : "There's a lot of internet chatter about people being better or worse than other people because of their tolerance for difficult weather. Which which There's nothing better, you know? Oh yeah.",
    "timestamp" : "08:48-09:01"
  },
  {
    "text" : "One of my favorite internet arguments. I mean, that's probably the basic arrogance over tolerance of weather is the best. I mean I do that with you guys now because you've both grown soft having moved to the south. Oh my god, it's it's thirty degrees. Let's let's Let's batten the hatches.",
    "timestamp" : "09:02-09:18",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "09:19-09:20",
    "speaker" : "Greg",
    "text" : "It's all relative, Andy."
  },
  {
    "text" : "T-shirt weather, baby.",
    "timestamp" : "09:21-09:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "09:22-09:22",
    "text" : "Mm-hmm.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:23-09:27",
    "text" : "You're right. It's all weather, but. That's not gonna stop me from giving you shit about it, right?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "09:28-09:31",
    "text" : "Yeah, but you know it makes you a bitch."
  },
  {
    "text" : "Well, the warm weather's made you a bitch, I think, is what you meant to say. Dude",
    "speaker" : "Andy",
    "timestamp" : "09:32-09:36"
  },
  {
    "text" : "Cold rain, there's nothing worse.",
    "timestamp" : "09:37-09:39",
    "speaker" : "Greg"
  },
  {
    "text" : "No, cold rain is the worst. Yeah. But it's gotta be like just above freezing, like 35.",
    "timestamp" : "09:39-09:45",
    "speaker" : "Andy"
  },
  {
    "text" : "I feel like the Dolphins think that snow is the worst though because they did not like this game.",
    "timestamp" : "09:45-09:51",
    "speaker" : "Steve"
  },
  {
    "text" : "They did not. Actually, I wanted to bring up the the drive chart in this game. Oh, we didn't actually give it a lombardi.",
    "speaker" : "Andy",
    "timestamp" : "09:50-09:56"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Um You know, I'd probably give it higher than you would think, so you go first.",
    "timestamp" : "09:58-10:04"
  },
  {
    "text" : "Uh I would give it a three and a half. You could probably convince me to give it a four just because of the the memorable play. And the and the",
    "timestamp" : "10:04-10:17",
    "speaker" : "Andy"
  },
  {
    "text" : "The snow and the I was going two and a half, Greg guy.",
    "speaker" : "Steve",
    "timestamp" : "10:18-10:21"
  },
  {
    "speaker" : "Andy",
    "text" : "I was going two Super Bowls and Lombardi and a champion.",
    "timestamp" : "10:21-10:23"
  },
  {
    "speaker" : "Greg",
    "text" : "Well nothing game.",
    "timestamp" : "10:24-10:25"
  },
  {
    "timestamp" : "10:25-10:39",
    "text" : "Yeah, it was not super hard. I like defensive Shutouts like this. This is much change. So sad watching Antoine Smith just not That was the game plan though.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Run his ass up the middle until he fucking in ugly games, but that doesn't mean it's not ugly, you know? 27 for 60 yards. He averaged 2. 2 yards a carry.",
    "timestamp" : "10:39-10:49"
  },
  {
    "timestamp" : "10:49-10:51",
    "speaker" : "Steve",
    "text" : "And yeah, how did Ricky Williams do that?"
  },
  {
    "timestamp" : "10:54-10:58",
    "speaker" : "Greg",
    "text" : "I mean Ricky didn't do much better, but he did do better."
  },
  {
    "text" : "Uh Miami had 134 total yards of offense in this game.",
    "timestamp" : "10:58-11:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "11:03-11:03",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "11:03-11:06",
    "text" : "Like I said, just give me the pages defensive plays."
  },
  {
    "timestamp" : "11:06-11:09",
    "speaker" : "Steve",
    "text" : "I love it because They were dominated by the biggest thing. That's what I mean."
  },
  {
    "text" : "Yeah, so just yeah, just fast forward through the the pay as soon as the pages get the ball, just fast forward through that shit. And then wait till the defense comes on. Because here are I'm just gonna real quick give you the drive chart of the Dolphins on the day. Um give you the the yards that they gained and then the end result. So five yards, punt, five yards, punt, six yards, punt, 30 yards, punt, minus three yards, punt, two yards, punt, 25 yard It's punt. Minus one yards punt. And then we're in the third quarter, by the way. So this is one of their third drive of the third quarter. They actually got moving 41 yards. And then they fumbled it. And then minus one yard punt, seven yard punt, zero yards interception return for touchdown, nine yards punt, zero yards interception, minus one yard safety to end it.",
    "speaker" : "Andy",
    "timestamp" : "11:09-11:59"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "12:00-12:04",
    "text" : "That's a good Cherry on the other."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:12-12:17",
    "text" : "Oh yeah, like Ty Law himself had, I think, three dropped interceptions before he finally got one at the end."
  },
  {
    "timestamp" : "12:18-12:27",
    "speaker" : "Steve",
    "text" : "Yeah. Andy, you should do a supercut of all the missed interceptions leading up to that that Teddy one because everyone remembers it for that one Teddy interception. This could have been an absolute blow."
  },
  {
    "timestamp" : "12:27-12:29",
    "speaker" : "Andy",
    "text" : "Willie McGuinness almost had a diving interception."
  },
  {
    "speaker" : "Steve",
    "text" : "Like there was it was like a little out curl of the tight end, I think, right? Kind of in the flat and he just awesome play. And that was the fourth Miss Internet. I put a note. Fourth near INT by Willie. Yep. Feedler, three for three, an INT on nearly every drive. So this is like the fourth golf's drive, and he almost throws a pick on all of them.",
    "timestamp" : "12:32-12:49"
  },
  {
    "text" : "Yeah. And I think uh Asante Samuel took one between the what number was he? I don't even remember. Two and two. Yeah. He took a football between the twos that he couldn't catch.",
    "timestamp" : "12:49-12:59",
    "speaker" : "Andy"
  },
  {
    "text" : "There was one that Hit a defender in the hands, bounced up in the air, and the Dolphins guy caught it for like a 34-yard game.",
    "timestamp" : "12:59-13:05",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I love those. That yeah, that was the 30 yards of their 41-yard drive. That was the only drive they had, and it was because of that.",
    "timestamp" : "13:06-13:11"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, and I think that's one of the like the uh Only times they move the ball and we even had a pick at that point. So like we had so many chances, then they finally fucking somebody catches one of these and it's their player.",
    "timestamp" : "13:11-13:23"
  },
  {
    "timestamp" : "13:23-13:23",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "They're still hanging in there, still hanging in there.",
    "timestamp" : "13:23-13:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Um But yeah, this it was basically nothing until that third quarter. Patriots have put up a field goal. What Matt Turk. A lot of Matt Turk. Also, also a lot of Brooks Barnard. Barnard? Barnard? Bernard. The Barnyard animal. The barnyard, yeah. uh a street free agent up until this week, but they got so sick of Ken Walter, like, you know what? Fuck it. Cutting them. We're gonna find a guy off the street because you can't be doing any worse. And he didn't. But this guy's first fucking game comes in and only has to punt 10 times in a snowstorm.",
    "timestamp" : "13:26-14:06"
  },
  {
    "speaker" : "Steve",
    "text" : "No big deal. With a crazy wind. Yeah, my game ball goes to this guy. He played out of his mind.",
    "timestamp" : "14:06-14:13"
  },
  {
    "timestamp" : "14:13-14:24",
    "text" : "Not every punt was great, but but his first punt when he had his first punt, I don't even it was like a mediocre punt. But he got a standing O when he did it, because he wasn't Ken Walter.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:25-14:27",
    "speaker" : "Greg",
    "text" : "Dude, this is his only game."
  },
  {
    "speaker" : "Andy",
    "text" : "Ever.",
    "timestamp" : "14:27-14:27"
  },
  {
    "text" : "His career.",
    "timestamp" : "14:27-14:28",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "14:28-14:29",
    "speaker" : "Andy",
    "text" : "Career."
  },
  {
    "text" : "Yeah. Oh shit.",
    "speaker" : "Greg",
    "timestamp" : "14:29-14:30"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:31-14:33",
    "text" : "Wait, so plus next week."
  },
  {
    "text" : "I don't know. What happens with Brooks because he's all fired out, yeah.",
    "timestamp" : "14:33-14:36",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "14:37-14:37",
    "speaker" : "Greg",
    "text" : "It was all right."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, looked him up on uh on LinkedIn. He was involved in LinkedIn. Yeah, he's a VP at Dallas. He's uh like a he used to work at uh Under Armour doing sports marketing. And did you connect with him? Well, I'm gonna once we release this, I'm gonna send it to him on LinkedIn. Like, hey buddy, we talked about you.",
    "timestamp" : "14:37-14:55"
  },
  {
    "speaker" : "Andy",
    "text" : "More appropriate. Uh are you gonna are you gonna do that from Kelly's account? Because I think that's what we do on this podcast.",
    "timestamp" : "14:55-15:00"
  },
  {
    "timestamp" : "15:03-15:08",
    "speaker" : "Greg",
    "text" : "Barnard, the Barnard dog. Yeah."
  },
  {
    "text" : "That was a great thing.",
    "speaker" : "Steve",
    "timestamp" : "15:08-15:10"
  },
  {
    "text" : "So his first punt he got a standing O and the second punt uh bounced the end zone and he immediately got booed. Fucking tough crowd.",
    "timestamp" : "15:11-15:19",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:19-15:26",
    "speaker" : "Steve",
    "text" : "But he also made that Teddy an INT on some level because he punted and got him out of the five-yard line. It was obviously fun."
  },
  {
    "text" : "Yeah, yeah. Um, but uh some of the ripples of Ken Walter being gone is that Damon Heward's now holding for field goals. So uh it didn't look great. Uh Adams only he kicked one field goal but it went over the goalpost. I've never seen something so close by the way that went directly over the goal post. Yeah. Which technically apparently is good as long as the ball stays inside the outside of the goal line.",
    "timestamp" : "15:27-15:57",
    "speaker" : "Andy"
  },
  {
    "text" : "Which are like good luck telling me. How do you not have goal line technology for that?",
    "timestamp" : "15:57-16:01",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean it's two thousand I mean two thousand three I don't even have white oh now. Yeah, now just seems like fucking lasers up.",
    "timestamp" : "16:01-16:10"
  },
  {
    "text" : "If it breaks, it seems like some of the all those problems are really easy to solve. Yeah. Like the you know, QB sneaks at the one or the close to first down. Like They have it in soccer and tennis.",
    "timestamp" : "16:10-16:22",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:22-16:35",
    "text" : "Yeah. We have the technology to do it. Yeah, where's the VAR? But I mean, also, how long did it take them to put cameras on the the pylons that Belichick wanted? They finally got that this yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "16:35-16:37",
    "text" : "This smells like a conspiracy."
  },
  {
    "timestamp" : "16:37-16:47",
    "text" : "It is. I agree, Greg. It's because Tom Brady is so good at QB sneaks, like, you know what? No, we don't want to give him that advantage. Because he will know and he will practice. And so we don't we don't need that.",
    "speaker" : "Andy"
  },
  {
    "text" : "Either that or it'll cost the owners like an extra ten K a year to do it. And they're like, nope.",
    "speaker" : "Greg",
    "timestamp" : "16:48-16:52"
  },
  {
    "text" : "Exactly it, Greg.",
    "timestamp" : "16:53-16:53",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Nope. Not doing it. That's actually if the players want to pay for it, that's fine. Yeah. Yeah. Yeah. We'll bring it up. the next collective bargaining. Exactly.",
    "timestamp" : "16:53-17:03"
  },
  {
    "timestamp" : "17:04-17:37",
    "speaker" : "Andy",
    "text" : "Oh man. Yeah, so if we can if anybody out here uh anybody listening knows Brooks Barnard. All right. But yeah, if anybody can get us uh a hookup, we'll we'll have him on and we'll we'll talk some football. Because I mean how cool is it to be like a street free agent come in and like be the punter for this game and that's like that's it. That's it. Like I would pay money for that. Like I I'm not gonna say I can outpunt Brooks Barnard, but I could probably outpunt Ken Walter. I'm not a good punter. No."
  },
  {
    "text" : "I mean no You're not any type of punter. Ken Walter was punting at 20 yards. You've never punted at any Shame.",
    "speaker" : "Greg",
    "timestamp" : "17:38-17:45"
  },
  {
    "text" : "That's a hard note. Oh, how could it be? Well, yeah, well we'll ask we'll ask Brooks when he comes on. Yeah, okay. Yeah, we'll ask him. We'll get an expert on. He'll settle this. Yep, exactly. Also on that kind of punt field goal team, something that will come up later, Lonnie Paxton gets hurt in this game.",
    "timestamp" : "17:47-18:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:07-18:43",
    "text" : "Yes. I've been sort of keeping my eye on this all year. Um because I I can't I still can't find that story about the dude he gets put in service here. I found it. You dead? Yep. I'll just keep it on the back burner until it comes up. And he gets injured After Brooks Barnard, pretty decent punt to their 44. He commits a holding penalty, look pretty clear, and gets injured on the play. And then Brooks has to punt again from the back of his own end zone. And it's a 20-yard swing. You know, Brooks that should be better. I agree.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "18:43-18:44",
    "speaker" : "Andy",
    "text" : "I agree."
  },
  {
    "speaker" : "Steve",
    "text" : "But this is also, I don't know if you caught this, the reason that Tom Brady has a punt. His first punt.",
    "timestamp" : "18:44-18:51"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:51-19:21",
    "text" : "He has multiple. Did he have number eight paunted? He did. He punted in the fourth quarter. It actually set up the Uh the safety because he punted down to the one-yard line. Yeah. Downed by Dani, much maligned Daniel Graham, who I think dropped Another three or four passes in this game? Yeah, bad hands, yeah. Like on screens, like just hitting them right in the hand and just skipping right out. I thought it was givens, no Uh the announcist said it was Graham, but it may have been Gibbs. It was given because he was a wide receiver."
  },
  {
    "speaker" : "Steve",
    "text" : "I mean he was one Yeah, yeah, yeah",
    "timestamp" : "19:21-19:23"
  },
  {
    "text" : "But great, great uh punt team. Actually a pretty good punt. Yeah, I snapted it to you, Greg. Come on. We did? Greg. Yeah.",
    "timestamp" : "19:24-19:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:35-19:37",
    "text" : "I'll watch it now. Oh yeah, send it to a bunch of people."
  },
  {
    "text" : "Uh but speaking of injuries, no Troy Brown in this. He was inactive again. So Kevin Falk was playing the Troy Brown role, I think, of Just kind of being that smartest guy on the field sort of thing. You know? Early early dynasty MVP, Kevin Floyd. All right.",
    "speaker" : "Andy",
    "timestamp" : "19:38-19:58"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:58-20:07",
    "text" : "All right. Let's let's let's actually dig in this because I get why you're saying this. Um, but I have a counterpoint. Not that I don't like Kevin Fault or maybe even disagree with your stance."
  },
  {
    "timestamp" : "20:07-20:39",
    "text" : "Would you would you like me to present my argument and you can counter it? I already know your argument. You've been talking about it for weeks. No, but in this in this one, like he is doing the Troy Brown stuff. Like he didn't put up big numbers. He has a fumble too. Because he got knocked the fuck out on a dirty hit. But yeah, that's fine. But he got knocked out. Which actually, okay. Um That's that's a good little segue. Uh oh. Remember us? Yeah. Oh yeah. It's that time of the podcast where I'm gonna start talking about the uh the announcers. The announcers, yes.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Dude, they were they were good.",
    "timestamp" : "20:40-20:41"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh they were okay except for this.",
    "timestamp" : "20:43-20:46"
  },
  {
    "timestamp" : "20:46-20:57",
    "speaker" : "Announcer",
    "text" : "Falk is up and off the field. The good news is he's up and off. The bad news is Kevin Falk thinks he's Marshall Falk. Falk is up. That's awesome. That is awesome."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "20:57-21:02",
    "text" : "Yeah, come on Andrew. In 2003, maybe. Yeah, that's aw that was awesome. That's good commentating."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:02-21:44",
    "text" : "Yeah. I don't think so. I don't think that's these days. Oh why? Because it's problematic. So? I think it's funny. I don't know. That's rough. We didn't even know what CTE was. Dude, he was he was lying on the field stiff as a boar with his arms like stuck out like this. Yeah, it happens all the time. It was a bad one. He got his bell rung. Uh well according to the Boston Globe, um the injury report, Patriots running back Kevin Falk, when knocked out, did not return. Yeah, when knocked out of what is fucking I don't know. Crane. Front frontal lobe. Yeah."
  },
  {
    "timestamp" : "21:46-21:50",
    "text" : "But like those were the highlights on SportsCenter, those big hits like that, though, you know?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true.",
    "timestamp" : "21:50-21:51"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "21:51-22:06",
    "text" : "It's a different thing. Just the fact that he was like he was laying there with his arms like stuck. But it's still objectively funny. Okay, because they're cousins and they have the same last name. Yeah. And Marshall Falk's a big name at the time too. He's not like thrown back to Marshall Falk."
  },
  {
    "text" : "Don't talk about my Kevin Falk like that.",
    "timestamp" : "22:09-22:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:11-22:34",
    "speaker" : "Steve",
    "text" : "All right, so here's my counterpoint, which don't get me wrong, love Kevin Falk. But he never has like big plays. He's very dependable in, you know, short term and like Less than 15 yard plays, couple screens that go along, but he never has any like big play. He never rips off long runs. He never like, you know, take catches a wheel route, takes the house. Counter to your counterpoint."
  },
  {
    "text" : "Neither does Julian Elleman.",
    "timestamp" : "22:34-22:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "22:36-22:37",
    "text" : "No, Julian Edelman has big plays."
  },
  {
    "text" : "Julian Edelman is the engine that keeps drives going. He doesn't have big plays. He had the biggest play for the Patriots this year. Which one?",
    "speaker" : "Andy",
    "timestamp" : "22:38-22:46"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "22:47-22:55",
    "text" : "The one against Seattle. Remember that one? That crazy catch? That was the Patriots longest play from scrimmage all year. Jesus Christ."
  },
  {
    "timestamp" : "22:55-23:51",
    "speaker" : "Andy",
    "text" : "But I don't think that's a good thing. That's like saying Kevin Falk is your leading rusher on the year. Like that's that's not what you want, you know? That's a fair point. Yeah. But I th I think Kevin Falk, because I mean there's always that one guy. First it's Troy Brown, then it's Kevin Falk, and then uh I'd say you could probably throw James White in that Uh maybe even a Deion Lewis back in the day. But there's always that one guy when you need that that conversion or you just need a couple yards, like the drives have been stalling, and you're not getting anywhere. The one guy that's going to jumpstart things and always be dependable. And he'll get you the first down. He's not going to be flashy about it. That's the Dion branches of the world of the the rainy mosses. But to get that first down, or even um Wes Walker, same idea. Those guys that just kind of keep things moving. Yeah. Keep drives alive so that Brady can then go take shots at. It's a WD-40. I love it."
  },
  {
    "text" : "I'm not disagreeing, but I don't know if that's WD33. WD33. We just made up a sick nickname. After a player has retired. Yeah. Damn it, dude. Nah, fuck it. We're making t-shirts.",
    "speaker" : "Greg",
    "timestamp" : "23:52-24:04"
  },
  {
    "timestamp" : "24:05-24:06",
    "speaker" : "Steve",
    "text" : "Retired like 10 years ago, dude."
  },
  {
    "speaker" : "Greg",
    "text" : "WD33.",
    "timestamp" : "24:07-24:08"
  },
  {
    "timestamp" : "24:09-24:19",
    "speaker" : "Andy",
    "text" : "That's sick. That's sick. All right. We'll save that for the next player who fits that role. Maybe it'll be uh Gunnar Olzewski or someone, you know."
  },
  {
    "timestamp" : "24:20-24:20",
    "text" : "Yeah",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Um but yeah so uh but Troy Bra uh Kevin Fogg in his game, he he was returning punts sometimes. It was him and Tyrone Poole. And I think he was like the hands guy and Tyrone Pool was like supposed to be the returner guy. So one punt that was about to go in the end zone. Uh Kevin Fall came over and like pretended to block the gunner so the gunner paid attention to him so the ball could roll into the end zone. Great heads-up play. And then you also recover Tyrone. You're gonna give announcers credit for calling that out.",
    "timestamp" : "24:22-24:54"
  },
  {
    "timestamp" : "24:54-24:56",
    "speaker" : "Steve",
    "text" : "Yeah. Most announcers didn't miss that. Amy, come on."
  },
  {
    "speaker" : "Andy",
    "text" : "You gotta be gotta be fair. Yeah. But then they also fucking make that joke that was made in the wasn't that a Snickers commercial? The guy gets a concussion, it's a football player.",
    "timestamp" : "24:56-25:10"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "25:10-25:21",
    "text" : "It's like good Why are you shitting on them for not for like it's on commercials? Of course they're gonna make those jokes then, Andy. Why is that a bad thing? It's a bad thing now. Yeah, but we're canceled culture now."
  },
  {
    "text" : "Greg has said all sorts of bad things in this podcast. Are you gonna judge him now for it? Yeah, he's not famous enough for that.",
    "speaker" : "Andy",
    "timestamp" : "25:21-25:26"
  },
  {
    "timestamp" : "25:27-25:29",
    "speaker" : "Greg",
    "text" : "And I did it knowingly."
  },
  {
    "speaker" : "Andy",
    "text" : "That's the difference. Yeah. Uh but yeah the uh at the end of this game Dietrich Ward was returning punts, which that's tough. Dietrich. Dietrich Ward.",
    "timestamp" : "25:30-25:41"
  },
  {
    "speaker" : "Greg",
    "text" : "Well Kevin also really neat pickup. It's neat. It's just so neat we could get that guy. Yeah. Even JJ Stokes. I'm forever going to associate Dedrick Ward with the word neat. From here on out. Because my exposure is gonna be like these three games he's involved in and not one quote.",
    "timestamp" : "25:42-26:02"
  },
  {
    "timestamp" : "26:02-26:15",
    "text" : "Yeah. I mean that's all the games he's really involved in, too. Yeah, I don't think he plays much more. It's incredible, man. The fact that these people are trying now Drick Ward and JJ Stokes committing a million penalties. Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "26:16-26:21",
    "text" : "And still make the Super Bowl. Yeah, like this this offense was not great.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:22-26:26",
    "speaker" : "Steve",
    "text" : "Oh yeah, and Antoine Smith is back there as your lead back. Yeah. With nothing in the tank."
  },
  {
    "text" : "Who was apparently last week was inactive for the game. Well that's because you're on the turf. Right, yeah, yeah. But you you go from an actor to being the starter. Like that's yeah, it's typical Patriots shit, isn't it?",
    "timestamp" : "26:26-26:39",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Getting 30 carries.",
    "timestamp" : "26:40-26:41"
  },
  {
    "timestamp" : "26:41-26:59",
    "speaker" : "Steve",
    "text" : "And you look at the offense and be like, hey, if we just could have like a Corey Dillon type back in there, we'd be so good. It's true. It's so true because like the one thing they're missing is like an awesome run game because there's a bunch of highlights from Clinton Portis going into Yeah, so the the game break for this was going back to the"
  },
  {
    "text" : "Broncos Chiefs game because Chiefs are in first place. They're a game ahead of the Patriots, but they're playing a division game. uh against the Broncos and it's Priest Holmes versus what's his face? Clinton Portis.",
    "speaker" : "Andy",
    "timestamp" : "27:00-27:13"
  },
  {
    "timestamp" : "27:13-27:16",
    "text" : "He was really good in that Denver game we played earlier this year.",
    "speaker" : "Steve"
  },
  {
    "text" : "So they start off the game uh trading touchdowns. So they both had two touchdowns each. But Clinton Port has ended up winning this battle of the running backs for going 22 for 22 carries, 218 yards, five touchdowns. To beat the the Chiefs, which put New England in first place in the AFC.",
    "timestamp" : "27:16-27:38",
    "speaker" : "Andy"
  },
  {
    "text" : "Those Dutch ons were so sick too. Why didn't he put Just open field move on the safety. That was the sickest one. One he just like accelerated the goal to the pylon. No one could touch him. And the other one is just flat out speed.",
    "timestamp" : "27:38-27:50",
    "speaker" : "Steve"
  },
  {
    "text" : "Like all his touchdowns were from like 30, 40 yards out. Like it didn't really have any short ones, I don't think. It's so sweet, I don't know. Yeah.",
    "timestamp" : "27:51-27:59",
    "speaker" : "Andy"
  },
  {
    "text" : "Was it sunny there?",
    "speaker" : "Greg",
    "timestamp" : "28:00-28:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah.",
    "timestamp" : "28:02-28:03"
  },
  {
    "speaker" : "Greg",
    "text" : "You love a game break that has a different like weather. Yep.",
    "timestamp" : "28:04-28:09"
  },
  {
    "speaker" : "Andy",
    "text" : "You know, like a different time of day. Like if you watch it and it's like getting towards like the like the the the nighttime games in New England and they cut to like a San Diego game or something or San Francisco. It's like, oh look, it's noon.",
    "timestamp" : "28:09-28:22"
  },
  {
    "text" : "Yeah. And then it cuts back and like everyone's just wearing slop because the field in Gillette sucks at this point. Which did you catch this? The field is heated.",
    "timestamp" : "28:22-28:32",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "28:32-28:48",
    "speaker" : "Andy",
    "text" : "Yeah, I didn't see it. Yeah, the heated field they they heat it to 55 degrees like you would with pool. Yeah. That's fucking I want a heated fucking field in my yard. That's amazing. Can I heat my driveway? Yes, yes, yes. Yes, I can. Fuck I bet that's"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "28:48-29:11",
    "text" : "expensive floor of your bathroom too that's pretty common yeah I was gonna Kelly's dad did the whole house there you go the whole house has heated floors yeah that's the whole entire thing it's ridiculous that's a lot Yeah, they just ran like the runs like this small tubing in these grooves and it's just the entire floor. They were up there in like the middle of December putting it in."
  },
  {
    "text" : "Holy shit.",
    "timestamp" : "29:11-29:11",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It's like this brittle tubing.",
    "timestamp" : "29:12-29:13"
  },
  {
    "timestamp" : "29:13-29:17",
    "speaker" : "Andy",
    "text" : "Yeah, yeah. Yeah, great to put it up. Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "29:17-29:29",
    "text" : "Lori was like getting blisters on her hands and it's just like, whoosh, whoosh, mush, mush. Well, she just digs her fingers in these grooves. Oh poor woman. God damn, Mr. Mooney."
  },
  {
    "text" : "Oh boy. Speaking of whipping, Dolphins got whipped. Uh yeah.",
    "timestamp" : "29:31-29:39",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So I wrote down you didn't like that one, Andy?",
    "timestamp" : "29:40-29:42"
  },
  {
    "text" : "Come on.",
    "timestamp" : "29:42-29:43",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I wrote down that um the only player Who was staying warm today was Jay Fiedler because the defense was bringing the heat on him the entire fucking game. But he was also uh four for ten for 15 yards in the first half.",
    "timestamp" : "29:43-29:59"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "30:00-30:05",
    "text" : "He just couldn't throw the ball into the wind at all and they knew it and they were breaking on every single slant or just"
  },
  {
    "speaker" : "Greg",
    "text" : "Nobody was open. Jake Feedler, not known for his arm strength.",
    "timestamp" : "30:06-30:09"
  },
  {
    "timestamp" : "30:10-30:21",
    "text" : "Yeah, and it was bad. Yeah, the whole thing was bad. But last week they apparently like they came in on a high because last week they the Dolphins beat the shit out of the Cowboys.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "30:21-30:21"
  },
  {
    "timestamp" : "30:21-30:35",
    "text" : "41 to 4 in a row, they said. They had five turnovers, five sacks. Like the I think it was a defensive thing. So it's k I think these AFC E's teams are all defense heavy uh game manager offenses.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "You know, it's back when they were all good too. These games were big games.",
    "timestamp" : "30:35-30:39"
  },
  {
    "timestamp" : "30:39-31:36",
    "speaker" : "Andy",
    "text" : "Yeah, because I mean the Bills, same sort of thing. They had that That defense that we saw in week one that absolutely smoked the Patriots. The Jets always have good defenses. I feel like that all falls apart for all three of them after this season. Pretty close. I think the dolphins may have one more. They'll start falling off pretty soon for all of them. But speaking of falling off, Ricky Williams We've talked about this because of he did his own contract and he I think he had the most rushing yards he led the league last year with like 1700 or something like that. He's already over a thousand yards a season, but they're all like he's fallen off. Okay. He looked fine. They just went almost. Three consecutive hundred yards games coming into this. Um and it would get broken here, but like I think the reason they were saying he had fallen off was because he went from averaging something like I think they they may have shown it Let me see if I took a screenshot of that."
  },
  {
    "text" : "It's because he likes smoking weed. They're trying to blackbalm conspiracy again.",
    "speaker" : "Greg",
    "timestamp" : "31:36-31:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:42-31:57",
    "text" : "But I think uh Yeah, I didn't, but it was something like he was averaging last season he averaged like 5. 7 yards a carry on the season. And this year he's averaging like under four. It's like three and a half. So it's taking them a whole lot more."
  },
  {
    "timestamp" : "31:58-32:09",
    "text" : "It's part Dave wants that's fault. There's like a third and three, and they they pass a feeler into the wind, and it's like Dude can't throw it more than three yards. Why are you not running him? Even the commentators are calling him out.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "32:09-32:38",
    "speaker" : "Andy",
    "text" : "Which if you remember the end of the season last season. He was backed up in it. He was winning and he had already rushed for 170 something yards with Ricky Williams. He decided to throw it three times out of his own fucking end zone. Yes. Let the Patriots uh get to overtime. Yeah. So not really known for his uh more known for his mustache than his play calling book. Yeah, I would say so. Um So that's not great. Uh but you know who was great in this game?"
  },
  {
    "text" : "Teddy Bursky.",
    "speaker" : "Greg",
    "timestamp" : "32:39-32:40"
  },
  {
    "timestamp" : "32:41-32:44",
    "speaker" : "Andy",
    "text" : "I was gonna say Rodney Harrison. Oh yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "32:44-32:44",
    "text" : "Harrison."
  },
  {
    "timestamp" : "32:44-33:01",
    "speaker" : "Andy",
    "text" : "Teddy Bruske Teddy Bruskey had a great play. Yeah, I would say Harrison and Vrabel were The top two. Brabel apparently had the flu all week, hadn't practiced, came to this game, and absolutely was just like the most disruptive force on that defensive line."
  },
  {
    "timestamp" : "33:01-33:04",
    "text" : "This is his best game of his career, I would think.",
    "speaker" : "Steve"
  },
  {
    "text" : "To this point, probably.",
    "timestamp" : "33:04-33:05",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:06-33:17",
    "speaker" : "Steve",
    "text" : "First time you see him and it's like that's a variable you know. Yeah. The games you'd watched him and he hadn't been nearly as good as you remember. You know he's gonna get there, obviously, but This is the first game where he just looks like a real problem for the tackles."
  },
  {
    "timestamp" : "33:17-33:41",
    "speaker" : "Andy",
    "text" : "Yeah, him and um Richard Seymour running stunts all day and just yeah, Richard had been doing that all last two years at this point. Yeah. I just like because you know, when you think of Richard Seymour, you think of him just being like this big, tall, long dude batting down passes, running down quarterbacks. But every time they tried to run at him, they try to put two offensive linemen on him and push him, and he just didn't move."
  },
  {
    "timestamp" : "33:41-33:42",
    "speaker" : "Steve",
    "text" : "Yeah. It was hysterical."
  },
  {
    "timestamp" : "33:42-33:50",
    "speaker" : "Andy",
    "text" : "You think of that with Ted Washington. You're like, okay, yeah, you try to move him, that doesn't happen because he's like you know, weighs as much as the three of us combined. Mount Washington."
  },
  {
    "timestamp" : "33:50-33:52",
    "text" : "Yeah. Washington Monument.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "33:53-33:54",
    "speaker" : "Andy",
    "text" : "That's right."
  },
  {
    "speaker" : "Greg",
    "text" : "I I don't have a Richard Seymour butts.",
    "timestamp" : "33:55-33:58"
  },
  {
    "speaker" : "Andy",
    "text" : "But Seymour was actually also playing fullback in this game due to an injury to Dan Clecko. And they just decide, you know what, fuck it. Fullback's not worth paying, so we'll just plug in Richard Seymour. Didn't look like a fullback. say but Rodney Harrison the uh commentators said that we're gonna give Rodney an honorary neck roll and a number of the 50s because he's playing like a fucking linebacker yeah",
    "timestamp" : "34:01-34:28"
  },
  {
    "text" : "And the best part was his timing on the snap. However, he figured out the snap count and his timing, he would just come spray. It's like you're watching arena football where he's just running towards the line of scrimmage.",
    "speaker" : "Steve",
    "timestamp" : "34:29-34:39"
  },
  {
    "text" : "You have that one guy in motion. Yeah, it's true. And he timed it perfectly every time. And there was, I think there was one play where he did that and he timed it, but he got picked up by the running back, but the running back was running a screen. And as soon as the running back didn't block Rodney Harrison the way that he Rodney thought he should, Rodney's like, ah, something's up. And just grab the guy. And just followed him, let him catch the ball, like didn't knock it down, let him catch the ball, and then just ragdoll him to the ground for like a two-yard loss. It was an amazing play. It was pretty sweet. Uh, but Rodney actually the week before this game actually had some words with Randy McMichael. The is he a tight end? Um apparently After the last game they played, the the pages when they won in overtime, uh, McMichael called Rodney Harrison dirty. And apparently this week, uh I found an article in the Sun Sentinel that said, in their ongoing and seemingly endless clash of rewards, New England Patriots Safety, Rodney Harrison. Had an idea last week for Dolphins tied in Randy McMichael. Quote, I think he just needs to basically shut up and play football.",
    "speaker" : "Andy",
    "timestamp" : "34:39-35:52"
  },
  {
    "speaker" : "Greg",
    "text" : "What do you think he would have said if he really said what he wanted to? Yeah.",
    "timestamp" : "35:54-35:58"
  },
  {
    "text" : "This fucking asshole.",
    "speaker" : "Andy",
    "timestamp" : "35:59-36:00"
  },
  {
    "speaker" : "Mom",
    "text" : "What did he say to his friends?",
    "timestamp" : "36:00-36:01"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "36:01-36:01"
  },
  {
    "speaker" : "Andy",
    "text" : "What did he say to McMichael? Because I'm pretty sure they were they were chatting all game. I didn't really notice it.",
    "timestamp" : "36:02-36:07"
  },
  {
    "text" : "I don't know.",
    "speaker" : "Steve",
    "timestamp" : "36:07-36:07"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:08-36:08",
    "text" : "I don't blame him."
  },
  {
    "speaker" : "Greg",
    "text" : "I don't blame him either of them. No, yeah. If I was playing against uh Harrison, I'd be fucking telling me he was dirty too.",
    "timestamp" : "36:09-36:17"
  },
  {
    "timestamp" : "36:17-36:18",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "You know, because he is.",
    "timestamp" : "36:18-36:20",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. All right, so here we go. This is uh sorry. While Harrison and McMichael say they have no dislike for each other, their recent conversations through the media have made that difficult to understand. After McMichael caught eight passes in the Dolphins' 19-13 overtime loss to the Patriots on October 19th, he called Harrison, quote, a dirty player. For emphasis, he added, quote, he's a garbage player. Ooh. McMichael's comments were prompted by Harrison calling him overrated and delivering a forearm to the back of the head. Harrison's response. Quote, when he makes a catch, he gets up and does his little dance. So when we get a chance, we're gonna make him pay. We're gonna try and rip his head off. Dude, the boy's a beefin'. McMichael said he and Harrison chatted a little during Sunday's game, like this game we're talking about, but nothing nasty. He said they complimented each other. At one point, after McMichael dropped a pass, Harrison delivered a friendly pat on his backside. Quote, Anytime somebody calls you out, it's sort of disrespecting you, Harrison said. I told Randy during the game, just play football. You're a good player. Just go play football.",
    "timestamp" : "36:20-37:22"
  },
  {
    "timestamp" : "37:23-37:31",
    "text" : "Yeah, I mean, I feel like when people talk shit to each other like that, it it's they're both the same type of person.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "37:31-37:31",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "37:31-37:37",
    "text" : "So there's that kind of like underlying thing of like, yeah, I'm being a prick, but that's kind of the point."
  },
  {
    "text" : "Yeah. Exactly.",
    "speaker" : "Andy",
    "timestamp" : "37:37-37:37"
  },
  {
    "timestamp" : "37:37-37:46",
    "text" : "And they're like, I they can see a little bit of of each other and each other to know that like yeah this isn't real hatred we'd probably like each other if we're on the same team. Game recognized game.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah we're exactly we're we're we're playing the game that needs to be played here Uh but I think McMichael may have also been uh kind of conciliatory because of the game that he had. Because let's see, uh Randy McMichael, five targets, zero catches, zero yards. And uh on the one drive that the the Dolphins actually had, they got to the Patriots 10-yard line. And I think it was third down. McMichael missed his assignment, which was Rodney Harrison coming in on the blitz. And Rodney Harrison. stripsacked Jay Fiedler, which Paige recovered, and that was like their only scoring chance. So he's like McMichael was talking about how he's the one that kind of fucked up this game. It wasn't quite his fault they didn't score. Huh? We should call him Randy Mustard.",
    "timestamp" : "37:46-38:35"
  },
  {
    "timestamp" : "38:38-38:41",
    "speaker" : "Steve",
    "text" : "There's that Richard Seymour like 20-yard sack."
  },
  {
    "timestamp" : "38:41-39:19",
    "speaker" : "Andy",
    "text" : "Oh yeah, well yeah, they got like into field goal range at one point, and then it went uh I think I wrote this down. uh oh yeah it was the beginning of the fourth it was the first drive of the fourth they start at their own 40 and then on the last play of the third quarter they hit a deep ball to I don't even fucking care uh which put them at the New England 33 to start the fourth quarter. And then immediately from that, Vrabel got a strip sack, which the Dolphins recovered. So it's third and 20. And then from there, Seymour got another sack. And now it's fourth and thirty-three from back on their own side of the field. It was like their own like 40 something."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "39:19-39:39",
    "text" : "That's so they had to put you strip sack and get the ball back for your offense. Your offense doesn't do shit with it. Yep. Brooks Barnott has a punt with 30 seconds left into the wind. If only you guys had even run the ball twice, then he would have punted with the wind at his back. But nope, he's got a punt from the last play in the quarter into the win. They get the ball, hit a big pass, or right back to where they were, and then it's just like nah."
  },
  {
    "speaker" : "Andy",
    "text" : "And at this point, it's still 3-0 because it's third quarter. And the Pages have managed three whole points in this game. And yet it still felt like the game was out of reach because this defense was just so dominating. And that's what they did. Like, you know what? Fuck it. Fourth quarter. This is our game. So we're gonna sack him twice and put him fourth and thirty-three.",
    "timestamp" : "39:39-39:56"
  },
  {
    "speaker" : "Steve",
    "text" : "The fuck out of our you missed one play on there. It was a near interception from Ty Law. So it went near interception strip sack, actual sack for 13 yards.",
    "timestamp" : "39:56-40:05"
  },
  {
    "timestamp" : "40:06-40:14",
    "speaker" : "Andy",
    "text" : "Yeah, not great. Yeah. But then I think that was like immediately after that was the play that uh Faulk got knocked out and Falk of the Mind."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:14-40:24",
    "text" : "They remember Tyrone Pool missed because they punted With the win, I guess. And Tyro Pool missed the punt, bounced at his feet, and Kevin Falk recovered recovered it. And then the next day he gets knocked out. Yeah."
  },
  {
    "timestamp" : "40:24-40:29",
    "text" : "Oh, is it a dirty hit, Andy? Uh who delivered it?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "40:30-40:41",
    "speaker" : "Andy",
    "text" : "One of the safeties, I think, yeah. It was kind of like he got Wrapped up from behind by Junior Seo, so his legs, and then just got like his head taken off like helmet to help."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:42-40:53",
    "text" : "It was clean. He left with a shoulder. It was just bad timing because Junior Lunged, barely got his ankles and like wrapped his both his ankles up at once and Kevin Fall just started falling at that moment right as he got hit."
  },
  {
    "text" : "So he was like his body was like Yeah, I don't I I don't think it was dirty, but it was a brutal hit. It was a big hit. Like you knew as soon as he got hit that like he was he was out before he hit the ground.",
    "timestamp" : "40:53-41:03",
    "speaker" : "Andy"
  },
  {
    "text" : "Brock Marion.",
    "speaker" : "Greg",
    "timestamp" : "41:03-41:04"
  },
  {
    "timestamp" : "41:05-41:06",
    "speaker" : "Andy",
    "text" : "Yes, I think also"
  },
  {
    "timestamp" : "41:07-41:13",
    "speaker" : "Greg",
    "text" : "I just looked through their uh roster and I was like, who on this list would I pick to do a dirty hit?"
  },
  {
    "text" : "I think it may have been Brock Mayor. I think it was. Headhunting. Typical Brock. Speaking of headhunting though, one of the dolphins players, this is actually gonna be my best, but this is a perfect segue. His helmet exploded. Oh yeah, I saw that. In the middle of the game. Yeah. So I took I have a couple pictures that I'll post in the show notes. But like holy shit. Like it's like it's not just a piece chipped off.",
    "speaker" : "Andy",
    "timestamp" : "41:13-41:42"
  },
  {
    "text" : "Like cracked into directly down the center into two like equal sides of the helmet.",
    "speaker" : "Greg",
    "timestamp" : "41:42-41:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Like you know how they have the like the the stripe along the the middle of the helmet? Like it cracked all the way along that was in two pieces.",
    "timestamp" : "41:47-41:53"
  },
  {
    "speaker" : "Greg",
    "text" : "Was it cutting the cold? Is that did they talk about it on the broadcast?",
    "timestamp" : "41:53-41:56"
  },
  {
    "timestamp" : "41:56-42:06",
    "speaker" : "Andy",
    "text" : "No, they didn't. All they really said about it was, uh, hey, you know the guy who broke the most helmets? Mike Singletary. Yes. Okay."
  },
  {
    "text" : "Shaquille O'Neal.",
    "timestamp" : "42:07-42:08",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "42:08-42:09",
    "text" : "That's kind of crazy.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. I mean, well, Drew Bledsoe had his helmet dented. That's fine. I don't remember that. And the the hit that sheared uh against the Jets? Oh, right, right. His face apparently was was twisted and dented because it was",
    "speaker" : "Andy",
    "timestamp" : "42:13-42:26"
  },
  {
    "timestamp" : "42:28-42:38",
    "speaker" : "Greg",
    "text" : "A far we've come, you know. Yep. Making fun of Kevin Falk for concussions, helmet splitting on the field. Now you can't even touch them."
  },
  {
    "timestamp" : "42:38-42:40",
    "speaker" : "Andy",
    "text" : "12 hole points being scored."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Back when football was football.",
    "timestamp" : "42:40-42:42"
  },
  {
    "speaker" : "Andy",
    "text" : "Old school football. But we haven't actually touched on the the iconic play of this. Teddy with one D. Teddy with one D. Teddy with one T D. This is off the the barnyard uh dog punt puts the ball like dribble the ball out of bounds at the five. Not bad. And the next play, as the announcers are talking about how this is the perfect time to get Ricky Williams going, just pound it out of the end zone and just give it to your workers. That's why you pay him all this money. Uh Jay Fiedler drops back and throws a pick six to Teddy Brewski. The first play. Immediately. First play. Yeah.",
    "timestamp" : "42:42-43:28"
  },
  {
    "text" : "As he's saying this, which again is a ridiculous catch, though.",
    "timestamp" : "43:28-43:31",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I I've forgotten how good of an interception it was, but this was one of the most athletic plays I've seen a linebacker make.",
    "speaker" : "Andy",
    "timestamp" : "43:31-43:38"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "43:38-43:53",
    "text" : "Or just like a pure hands play where it's like he was like five yards away from this quarterback who was like trying to zip it into tight coverage. Yeah. And it just no bobble, nothing. Nope. Yeah. Just snagged it. Yeah. But even if like fully outstretched too. Yeah."
  },
  {
    "text" : "It looked like Chatham was there to block that down too. Like he threw that in. That was a bad. There was like the guy covering the receiver was close. Two linebackers right there.",
    "timestamp" : "43:54-44:02",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I mean all his throws of this game were like that though. Like none of them were good. But this I mean I don't think this was what play he expected that was gonna get intercepted.",
    "timestamp" : "44:02-44:12"
  },
  {
    "speaker" : "Steve",
    "text" : "I just he just doesn't know the concept of looking anybody off. I think that might be true. He just looks around soon as and then they figure it out long soon enough.",
    "timestamp" : "44:13-44:22"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "44:22-44:22"
  },
  {
    "text" : "You can watch Teddy in the replay, he just hides behind a blocker real quick and like watches healer and then just Yeah, just slowly drifts that way as soon as the throw comes, but like",
    "speaker" : "Steve",
    "timestamp" : "44:23-44:30"
  },
  {
    "text" : "Fully outstretched, just absolutely snags it. And then walks in the end zone. A plus as well. Oh the yeah, dropping to his knees and like sliding on his knees. Drags his feet. Yeah. Oh it's beautiful. Yeah, it's iconic.",
    "timestamp" : "44:30-44:43",
    "speaker" : "Andy"
  },
  {
    "text" : "Maybe. I don't know. I feel like they you have a poster of like him just like on his knees with his things in the air and then like it's like a n like all black bat border. It's like it's like platoon, right?",
    "speaker" : "Steve",
    "timestamp" : "44:46-44:57"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:57-45:18",
    "text" : "You see everyone throwing snow and shit in the air. Yeah there there's a I another iconic picture of him throwing snow up like by the the s the stands um and like everybody else throwing snow too. But that uh even just the throwing the snow to the timing of the song too as if it were like fireworks was absolutely amazing."
  },
  {
    "speaker" : "Steve",
    "text" : "Snow on PA guy With that fucking hey song? Oh yeah, fucking nil.",
    "timestamp" : "45:21-45:26"
  },
  {
    "text" : "That was gonna be my best best because like what a fucking song to play Except that's Gary Glitter, so he's been canceled, so you can't play that anymore. Why?",
    "speaker" : "Andy",
    "timestamp" : "45:27-45:35"
  },
  {
    "text" : "What happened to Gary Glitter?",
    "timestamp" : "45:35-45:36",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "45:36-45:45",
    "text" : "Uh he's a kid. I didn't know that wasn't Gary Glitter. Who is Gary Glitter? He's the guy that wrote that song. He's the he's a pop artist. I think he's a kitty diddler.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:48-45:50",
    "speaker" : "Greg",
    "text" : "Oh I dude Lost Prophets, remember those guys?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:50-45:53",
    "text" : "Oh yeah. Well they were into that sort of thing."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "45:53-45:55",
    "text" : "Yeah, the lead singer, huge diddler."
  },
  {
    "timestamp" : "45:55-45:56",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Now I can't listen to them anymore. I mean I didn't really listen to it.",
    "speaker" : "Greg",
    "timestamp" : "45:56-45:58"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:59-46:03",
    "text" : "Just do it on headphones. Just don't tell people. Just do it on headphones."
  },
  {
    "text" : "Yeah, separate the music from the artist. No, I was wrong about that photo you have, Greg. It is the one you were talking about, Andy, of him throwing the snow in the air in front of the fans.",
    "speaker" : "Steve",
    "timestamp" : "46:04-46:12"
  },
  {
    "timestamp" : "46:12-46:13",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "It's a great one. It signed on eBay, $150. All right.",
    "timestamp" : "46:13-46:18"
  },
  {
    "speaker" : "Greg",
    "text" : "Steady with 1D. Yep. Where did you go to school?",
    "timestamp" : "46:19-46:24"
  },
  {
    "text" : "Arizona. Arizona.",
    "timestamp" : "46:24-46:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Nice.",
    "timestamp" : "46:26-46:26"
  },
  {
    "timestamp" : "46:26-46:41",
    "speaker" : "Andy",
    "text" : "Because he's going back to be like a coaching consultant now. I think. Yeah, I think. You guys remember remember Lisa that we had on? Simpsons? Yeah. Oh. Uh yeah, sure. She's for she went to Arizona. So she's a big teddy brewski."
  },
  {
    "speaker" : "Greg",
    "text" : "fan brushki remember that shirt i got you andy i still have it mudweiser looking one yeah yeah bruske king of linebackers i still have it I remember I was probably like around this time, maybe like fourteen. I was that was like the first time I was like, dude, I just got the dopest. Christmas present for my brother. It's got beer on it. He's gonna fucking love me so much after this.",
    "timestamp" : "46:41-47:08"
  },
  {
    "timestamp" : "47:08-47:13",
    "speaker" : "Andy",
    "text" : "That was a great one That was top notch. What happened, Greg?"
  },
  {
    "timestamp" : "47:13-47:21",
    "speaker" : "Greg",
    "text" : "I've I I went I remember seeing it at the mall in one of those stands. And remember they used to put those things in the middle of the aisle. And I was like, dude, that sure is sweet."
  },
  {
    "timestamp" : "47:22-47:24",
    "speaker" : "Andy",
    "text" : "Went back later and bought it for you."
  },
  {
    "speaker" : "Greg",
    "text" : "And I was so hyped.",
    "timestamp" : "47:24-47:25"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, I haven't even been able to uh unveil my Christmas gift this year you guys got me, which is probably on that level. It's funnier, but maybe not something I'll wear as on.",
    "timestamp" : "47:26-47:36"
  },
  {
    "text" : "Yeah, how are we not making you wear that for every episode of Because he hasn't been on yet?",
    "speaker" : "Steve",
    "timestamp" : "47:36-47:40"
  },
  {
    "text" : "That's true. We're teasing it, but yeah. It'll happen. We'll even post a picture of it.",
    "speaker" : "Andy",
    "timestamp" : "47:40-47:44"
  },
  {
    "timestamp" : "47:45-47:47",
    "speaker" : "Steve",
    "text" : "You'll have to wear it a bunch, so that's good, I guess."
  },
  {
    "text" : "Yeah, unfortunately. Yes.",
    "speaker" : "Andy",
    "timestamp" : "47:47-47:48"
  },
  {
    "timestamp" : "47:49-47:57",
    "text" : "Um did you know Teddy was uh accomplished saxophonist? I did. I don't remember I think we that came up in one of the announcers said it.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "47:58-47:59",
    "speaker" : "Andy",
    "text" : "Lisa Simpson? Yeah."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "47:59-48:00"
  },
  {
    "timestamp" : "48:01-48:02",
    "speaker" : "Andy",
    "text" : "Like these is that's correct."
  },
  {
    "speaker" : "Steve",
    "text" : "So I'm not gonna lie, I thought that that was the only score in the game. I thought it was 10-0. Because unlike Greg, I don't watch I don't look at the score before I watch it. And I have a note right here and I was like, man, too bad we didn't score again. There would have been even more snow. Because like that was like such an organic, like Cool thing and like that was really cool. And then like I was like, yeah, it's cool, but like next time we score, it'll be even better.",
    "timestamp" : "48:03-48:25"
  },
  {
    "text" : "Yep, because everybody's ready for it. And then they close it out with the safety too? Yeah. Oh yeah. Which like an absolute garbage time safety. Probably the the only garbage time safety I've ever seen. Because Miami's th this is after Tom Brady punts it down to the one. Uh Miami starts at their own one and is now fourth and eight. And like, well we kind of have to go for it. We're down ten-nothing. There's less than two minutes left. And uh and it was uh Vrabel again, wasn't it? Yeah who got the pressure. Jarvis Green. Well well Vrabel basically pushed him into Jarvis Green, who was standing there with his arms wide open.",
    "timestamp" : "48:25-49:02",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "49:02-49:04",
    "text" : "And even the play before, he almost had a strip sack.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "49:05-49:15",
    "speaker" : "Andy",
    "text" : "Yes, he did. Got his hand on the ball, causing the incompletion. He was just backways. He was unblockable in this game. It was amazing. All right. You want to do best and worse?"
  },
  {
    "text" : "I think we we touched on most of the good plays.",
    "timestamp" : "49:15-49:17",
    "speaker" : "Steve"
  },
  {
    "text" : "I have one question before we do that because we've seen a lot of iconic moments. in these games, um, but they all seem to be defensive moments. And one of the the last remaining arguments I'm hearing now about Tom Brady not being the best, and they're like scraping the bottom of the barrel now. Oh yeah is any left. Tom Brady is not the greatest because he doesn't have an iconic moment. What? Yeah. Because Joe Montana, the argument was Joe Montana has the catch to Dwight Clark. Good point. I don't know what Peyton Man has.",
    "timestamp" : "49:17-50:00",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, I mean, I don't think it's a good point.",
    "timestamp" : "50:00-50:02"
  },
  {
    "text" : "Aaron Rodgers has a couple of like Hail Marys you remember.",
    "speaker" : "Andy",
    "timestamp" : "50:02-50:05"
  },
  {
    "speaker" : "Steve",
    "text" : "Tom Mary has the comeback from twenty.",
    "timestamp" : "50:05-50:07"
  },
  {
    "text" : "Yeah, but there's no like one play that you remember Tom Brady.",
    "speaker" : "Andy",
    "timestamp" : "50:09-50:12"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "50:12-50:15",
    "text" : "I would say the spike in the snowball, but I'm partial to that game."
  },
  {
    "timestamp" : "50:16-50:19",
    "text" : "No, it's the uh the the spike in the Rams game. Where he fucking spikes it and catches it.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "50:19-50:21",
    "text" : "Yeah, but that's not a play. That's just like a moment.",
    "speaker" : "Greg"
  },
  {
    "text" : "It's a player quarter.",
    "speaker" : "Steve",
    "timestamp" : "50:22-50:23"
  },
  {
    "timestamp" : "50:23-50:24",
    "speaker" : "Greg",
    "text" : "He didn't even make a play, though. That's a play."
  },
  {
    "speaker" : "Steve",
    "text" : "That's a Well, like that also showed that Tom Brady is super cool as a cucumber as a second-in-year player in like the biggest moments. Like that was when And even John Madden's commentation of that made it better. He's like, oh, what Tom Brady did just gave me chills.",
    "timestamp" : "50:25-50:37"
  },
  {
    "timestamp" : "50:38-50:54",
    "speaker" : "Andy",
    "text" : "Oh, I've got one. All right. It just came to me. Uh Tom Brady's touchdown pass. Against the Saints when they shouldn't have even been in it. And you had Zolak's, you know, where's the beef? Show ponies, all that garbage."
  },
  {
    "timestamp" : "50:54-50:55",
    "speaker" : "Greg",
    "text" : "Show ponies."
  },
  {
    "text" : "Yeah, whatever the hell it was. That was a pretty good one. That's pretty iconic, I think.",
    "timestamp" : "50:55-51:00",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "51:00-51:00",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:01-51:02",
    "text" : "There's a million iconic places."
  },
  {
    "speaker" : "Steve",
    "text" : "Like you can get fucked with that argument.",
    "timestamp" : "51:02-51:04"
  },
  {
    "text" : "Well, that's the thing, though. Like Tom Brady Has so many. Which one do you choose?",
    "speaker" : "Andy",
    "timestamp" : "51:04-51:10"
  },
  {
    "timestamp" : "51:10-51:32",
    "speaker" : "Greg",
    "text" : "Well no, I think that's the beauty of Tom Brady is that it's not about him being like a a player that can do things that other people can't. He's a player that everybody could do what he does. But no one does it every single time and when the pressure's on and just comes through. Like he's not he's not even that talented, but he's still he still fucking wins every time."
  },
  {
    "timestamp" : "51:32-52:10",
    "speaker" : "Andy",
    "text" : "Yeah. But his yeah, his fundamentals are so much better than anybody else's ever. His decision making, his footwork is just like pocket presence, his accuracy. his timing, like just all of those pieces. And the fact that he he does it exactly the same regardless of the situation. Like it doesn't matter if he's down 28 to 3 in the Super Bowl. He's still doing the exact same fucking thing over and over again. And the fact that he can do it on such a high level for so long, I think, is what makes it really And also the fact that he doesn't like put himself in the situations where he needs to be the hero either."
  },
  {
    "timestamp" : "52:10-52:13",
    "speaker" : "Steve",
    "text" : "So you're saying Belichick's a bad coach? Are you on Team Gregment?"
  },
  {
    "text" : "No. Oh my god.",
    "timestamp" : "52:14-52:19",
    "speaker" : "Greg"
  },
  {
    "text" : "Wow, let's hear this.",
    "speaker" : "Steve",
    "timestamp" : "52:19-52:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Hang on, hang on. Let me let me figure this is uh we are at What what time of the meeting are we? Oh fuck, I can't find it.",
    "timestamp" : "52:20-52:26"
  },
  {
    "speaker" : "Steve",
    "text" : "6 p. 2021. Go on, Greg.",
    "timestamp" : "52:27-52:30"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm listening. I'm gonna cut this.",
    "timestamp" : "52:30-52:32"
  },
  {
    "timestamp" : "52:33-53:11",
    "speaker" : "Greg",
    "text" : "Well, all of this, you've hearing a lot of talk now that Brady won the Super Bowl, that they're like, oh If the if the Patriots had just gone out and like got some weapons for Brady, maybe he would have stayed. They tried. They went and got Demarius Thomas. They got they got Antonio Brown. You know, George getting hurt. They got Josh Gordon. They got a ton of people. They just didn't work out. Yeah. The fact that's not Belichick's fault. All the people they got. Like every single one of them didn't work out is just like Yeah, they they I thought they made more of an effort that year than they had like any previous years."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. But I feel like they've been doing it for a couple years too, you know?",
    "timestamp" : "53:11-53:16"
  },
  {
    "timestamp" : "53:16-53:16",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "53:17-53:21",
    "speaker" : "Andy",
    "text" : "Like they had been just kind of like selling out a bit. Like they drafted Nikhil Harris the first"
  },
  {
    "timestamp" : "53:21-53:23",
    "speaker" : "Greg",
    "text" : "Yeah, they drafted that. Wide receiver day that year too."
  },
  {
    "timestamp" : "53:23-53:23",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "And the year before you fucking talk to me about them not trying to surround him with weapons. Exactly.",
    "speaker" : "Greg",
    "timestamp" : "53:23-53:27"
  },
  {
    "timestamp" : "53:27-53:31",
    "speaker" : "Andy",
    "text" : "And the year before they drafted um Sony Michelle too, right?"
  },
  {
    "timestamp" : "53:31-53:31",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:32-53:36",
    "text" : "So like offensive pieces to to for him to build around. So yeah."
  },
  {
    "text" : "Sometimes it doesn't work out. That's just the that's how football works. You know, Antonio Brown is gonna molest his fucking trainer. Yep. Yeah. It's nothing much you can do there.",
    "timestamp" : "53:36-53:47",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Although nothing's changed, but like all that heats off of them all of a sudden for some reason. Yeah. Time heals all wounds, Andy.",
    "timestamp" : "53:48-53:54"
  },
  {
    "speaker" : "Steve",
    "text" : "But he's also not gonna like give stupid contracts out either, like the Carson Wentz one that, you know, he has one good year, gets hurt, and they're like, you know what, here's a new contract that pays you shitloads of money.",
    "timestamp" : "53:55-54:06"
  },
  {
    "text" : "Yeah, 30 million, 34 million this year. He's not gonna be on the team.",
    "speaker" : "Andy",
    "timestamp" : "54:09-54:14"
  },
  {
    "timestamp" : "54:20-54:20",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "But they have to pay like $34 million this year. It's the biggest dead cap hit ever in the history of the league.",
    "timestamp" : "54:21-54:25",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:26-54:28",
    "text" : "Oh, the Eagles are fucked up. They're both fucked up.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "And this is all after building a statue of their backup quarterback who they also shipped out in front of the stadium. Dude, those people have tattoos of that guy. Well, I mean if you win the Super Bowl, I get that. But like building the statue seems a little premature. Especially when he's still on the team.",
    "timestamp" : "54:28-54:43"
  },
  {
    "speaker" : "Steve",
    "text" : "Like, are you fucking kidding me? Anybody can do it. Nobody does it as consistently as Tom.",
    "timestamp" : "54:43-54:49"
  },
  {
    "text" : "That's true. It's true.",
    "timestamp" : "54:49-54:51",
    "speaker" : "Greg"
  },
  {
    "text" : "All right, best of words. Let's go.",
    "timestamp" : "54:51-54:52",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "54:54-54:57",
    "speaker" : "Greg",
    "text" : "Wait, before we do it, can we do trivia? Remember, we talked about it. Oh yeah, trivia."
  },
  {
    "text" : "Oh, yeah, yeah. Okay. Yes.",
    "speaker" : "Steve",
    "timestamp" : "54:57-54:58"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm not I'm not gonna go overboard here, but I just have I'm gonna try and pull one trivia question a week. I love it. In the context of the dynasty.",
    "timestamp" : "54:58-55:06"
  },
  {
    "text" : "Okay.",
    "speaker" : "Steve",
    "timestamp" : "55:07-55:07"
  },
  {
    "timestamp" : "55:07-55:08",
    "speaker" : "Greg",
    "text" : "Okay."
  },
  {
    "speaker" : "Steve",
    "text" : "Okay.",
    "timestamp" : "55:08-55:08"
  },
  {
    "timestamp" : "55:08-55:23",
    "text" : "All right. So since 2001, there have been seven players on the Patriots. That have caught a hundred passes but are not wide receivers.",
    "speaker" : "Greg"
  },
  {
    "text" : "A hundred passes total or an season?",
    "timestamp" : "55:24-55:27",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:27-55:40",
    "text" : "Rob Gronkowski. Yep, Rob Gronkowski is number one with 521 receptions. Aaron Hernandez. Aaron Hernandez is number five."
  },
  {
    "text" : "Oh shit, he's on there.",
    "timestamp" : "55:41-55:42",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:42-55:42",
    "text" : "How many are there?"
  },
  {
    "speaker" : "Steve",
    "text" : "Okay. Um James White.",
    "timestamp" : "55:45-55:47"
  },
  {
    "text" : "James White is number three. Kevin Falk? Kevin Falk is number two. Number two. See? That's what I'm saying. How many did he have? He had 431 catches.",
    "timestamp" : "55:48-56:00",
    "speaker" : "Greg"
  },
  {
    "text" : "Damn. That was a running.",
    "timestamp" : "56:00-56:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, that's actually 1999 to 2001.",
    "timestamp" : "56:02-56:04"
  },
  {
    "text" : "Yeah, it's fine. Close enough. I'll give it to him. Uh so we're missing Vareen. Vareen.",
    "timestamp" : "56:04-56:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:11-56:24",
    "speaker" : "Greg",
    "text" : "Ooh, nice. 107. He's number seven. Ben Watson? Nope. Oh yeah. Yeah, yeah. Ben Watson. 184. He was fourth. So that's six. We got one more. Yeah, in sixth place."
  },
  {
    "speaker" : "Steve",
    "text" : "Non-receiver. It's not going to be the fullback. Larry Senis. Um has to be a running back or a time frame.",
    "timestamp" : "56:24-56:34"
  },
  {
    "speaker" : "Greg",
    "text" : "I'll give you his time frame.",
    "timestamp" : "56:34-56:35"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "56:36-56:36"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "56:37-56:47",
    "text" : "2002 through 2006. So he's on this roster. Now it's Daniel Graham. Really? Mm-hmm. 120 catches."
  },
  {
    "speaker" : "Steve",
    "text" : "He has more than what did Watson have?",
    "timestamp" : "56:48-56:50"
  },
  {
    "speaker" : "Greg",
    "text" : "Watson had 184. Okay. Dude, Hernandez had 175 in three seasons.",
    "timestamp" : "56:50-56:56"
  },
  {
    "text" : "That's bananas.",
    "timestamp" : "56:56-56:58",
    "speaker" : "Andy"
  },
  {
    "text" : "He could have been so good. That was my takeaway from that list is goddamn it hernandez",
    "speaker" : "Greg",
    "timestamp" : "56:59-57:03"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that offense would have given people problems for fucking.",
    "timestamp" : "57:06-57:08"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "57:12-57:13",
    "speaker" : "Steve"
  },
  {
    "text" : "And it would because it was one of those like unsolvable offenses because Right. You could run out two tight ends and just run a fucking power run theme. And as soon as they ship on more defensive linemen or linebackers, you just fucking spread it out. Same fucking guys. Brutal. Well could have been. We're complaining that they only won six super.",
    "speaker" : "Andy",
    "timestamp" : "57:13-57:35"
  },
  {
    "timestamp" : "57:35-57:38",
    "text" : "That might be that might be the overall dynasty worst. No.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "57:39-57:44",
    "text" : "Aaron Hernandez? I think it's everybody's dynasty worst, yeah. What else are you gonna do?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That is my worst take of all time, is that Hernandez will end up with a better career than Gronk, and it's getting worse. Every year it gets worse. It's still going.",
    "timestamp" : "57:44-57:54"
  },
  {
    "text" : "Talk about scraping the bottom of the barrel. You didn't even have the wood yet.",
    "speaker" : "Steve",
    "timestamp" : "57:55-57:57"
  },
  {
    "speaker" : "Andy",
    "text" : "You got a lot. Holy shit. Yeah, that's that's a that's a tough look. Yes. I I like that you're still owning up to it though. Uh-huh. Yeah, they mean you're humble by, you know. The Max Kalaman of the Brown family. I like it. All right, so let's do best of worst. That was great, Greg. Yeah, keep keep those coming. I like that.",
    "timestamp" : "57:57-58:18"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "58:19-58:23",
    "text" : "Greg, you can go first on best of worst. Since great cribia question, and you didn't watch the game."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "58:23-58:34",
    "text" : "Okay, my best Tyla. I made this promise a while ago, but anytime Tyler has an interception into NFL game, he will be named the best of the game."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:34-58:44",
    "text" : "He almost had a couple other like dope diving ones like cutting back on it. He was hurt too, right? He was playing through injury. He pulled a hammy on the on the second almost interception, yeah. Yep."
  },
  {
    "speaker" : "Greg",
    "text" : "Um my worst is H P printers I had about an hour and a half fucking battle royale with my printer before getting on this call.",
    "timestamp" : "58:45-59:01"
  },
  {
    "speaker" : "Steve",
    "text" : "Dragus trying to print his notes for the call because he print the notes he needs to print about and have in front of him for this call.",
    "timestamp" : "59:01-59:08"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "59:08-59:11",
    "text" : "Why does it say paper jam? When there's no paper jammed."
  },
  {
    "text" : "Oh beautiful. All right, you go Andy. I got a couple. All right. Um Let's see, I'm just trying to figure out what my best and worst are here. Um what do we have? Oh, my best was the Graphic that they showed probably halfway through the game. The game fact was the title of it. It was seats filled with fans, 45,000. Seats filled with snow, 17,000.",
    "timestamp" : "59:14-59:42",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "59:43-59:47",
    "text" : "Huh. Wait, so they couldn't get people in the 17,000?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "59:47-59:54",
    "text" : "I think that's just how many people showed up. Yeah, but those people didn't even show up. A lot of people just like looked outside and said it's fucking two feet of snow. I'm all set.",
    "speaker" : "Andy"
  },
  {
    "text" : "I still don't understand how they do that. They just do it by manual power, right?",
    "speaker" : "Greg",
    "timestamp" : "59:54-59:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Well you've yeah, you've never seen it on like the highlights where they basically have well nowadays They figure out where they like the yeah, they put the chutes in, everybody just like shovels the snow into the chutes. But yeah, there's no Yeah.",
    "timestamp" : "01:00:00-01:00:10"
  },
  {
    "timestamp" : "01:00:10-01:00:19",
    "text" : "But just think about like shoveling in like small crevices is a pain in the ass. What they use their hands?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know. They just like follow it. I'll it just shug shots of the stands and like any NPC to this gigantic snow mound on it.",
    "timestamp" : "01:00:19-01:00:26"
  },
  {
    "text" : "Yeah, that's see that's what I would expect to see.",
    "timestamp" : "01:00:26-01:00:28",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:29-01:00:37",
    "text" : "That's what it was because there's a shit the opening shot of the whole like YouTube is this dude sitting on top and Pulling his kid up to the top of his kid. Yeah, I just dragged his ass up."
  },
  {
    "text" : "That's awesome.",
    "speaker" : "Greg",
    "timestamp" : "01:00:37-01:00:38"
  },
  {
    "text" : "Oh yeah. Hell yeah. Dad's pulling you on top of the snowbank and you can get a better view because you're higher.",
    "timestamp" : "01:00:38-01:00:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:00:45-01:00:47",
    "text" : "It's a great memory. Right?"
  },
  {
    "text" : "Yeah, fucking right.",
    "timestamp" : "01:00:47-01:00:48",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I bet uh remember when like uh Buffalo was doing like get a free ticket? If you come and help us shovel the stadium.",
    "timestamp" : "01:00:48-01:00:54"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, that's right.",
    "timestamp" : "01:00:54-01:00:56"
  },
  {
    "text" : "Yeah, that was a couple years ago. That's a great look. That's a great look. Yeah, I love that.",
    "timestamp" : "01:00:57-01:01:02",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "That was sort of my best too. That was probably my my number. The fans here were A<unk>.",
    "timestamp" : "01:01:03-01:01:08"
  },
  {
    "text" : "Oh yes. Yeah. The guys that showed the people that showed up in this game were We're like the hardcore. Like they were here for a good time.",
    "timestamp" : "01:01:09-01:01:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "There was a different sign that said, today's special is frozen fish. This is like the very end of the game.",
    "timestamp" : "01:01:17-01:01:24"
  },
  {
    "timestamp" : "01:01:24-01:01:29",
    "text" : "Yeah, that's that's early 2000s humor there. Yeah. Squeeze the cheese.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know if you want the very last like clip of the YouTube video. Yes. Is the dude with this dolphins construction hat just getting a fucking load of snow dumped on him by the way?",
    "timestamp" : "01:01:30-01:01:40"
  },
  {
    "timestamp" : "01:01:41-01:02:05",
    "speaker" : "Andy",
    "text" : "Somebody hit him with like a massive fucking salt and bag of heads just like Poof and like the whole snowbulbs like exploded across him. And he just like he had like one of those like rubber masks on too. But you could tell like the whole just the way he was, you're so dejected, be like, I can't believe I fucking flew up from Florida for this. I had to sit in this fucking snow and we fucking lost twelve nothing and I'm getting pelting with snowballs. Yeah, dude."
  },
  {
    "text" : "For as good as as much fun as the Patriots fans had with that because we won and because they're serving beer because it was so fucking cold, just sitting on snow. That novice guy was having the absolute worst fucking time.",
    "timestamp" : "01:02:05-01:02:16",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah Um, but for my worst, I will say this was the 18th game in a row where the Patriots have failed to score an opening drive touchdown.",
    "timestamp" : "01:02:16-01:02:27",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I feel like I feel like you're saying that because we score one next week, but all right.",
    "timestamp" : "01:02:27-01:02:30"
  },
  {
    "timestamp" : "01:02:30-01:02:45",
    "speaker" : "Andy",
    "text" : "No, I don't know. Oh the Patriots haven't had an opening drive touchdown in the last 17 games, and then they didn't score with this game either. So it's up to 18 now, which isn't great. But they also never lose if they're winning at halftime."
  },
  {
    "speaker" : "Steve",
    "text" : "Yes, winning games, winning ugly.",
    "timestamp" : "01:02:45-01:02:47"
  },
  {
    "timestamp" : "01:02:48-01:02:52",
    "text" : "Patriots are never they're never like a fast starting team, I feel. They're second-half team mostly.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:53-01:02:56",
    "speaker" : "Steve",
    "text" : "Uh all right. I will throw one extra on the fans. Honest straight sellout."
  },
  {
    "timestamp" : "01:02:57-01:03:02",
    "text" : "Yes, this was the 100th straight sellout since the crafts bought the team. Not too bad.",
    "speaker" : "Andy"
  },
  {
    "text" : "It was sort of uh the field goal kicking from Venateri.",
    "timestamp" : "01:03:03-01:03:06",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "It was sketchy.",
    "timestamp" : "01:03:07-01:03:08"
  },
  {
    "speaker" : "Steve",
    "text" : "You put that one right on it. The extra extra point after Teddy's touchdown was a point it through. Yeah.",
    "timestamp" : "01:03:08-01:03:14"
  },
  {
    "speaker" : "Andy",
    "text" : "Almost almost a double doink. Like it hit one and came back across and just went behind the other.",
    "timestamp" : "01:03:14-01:03:19"
  },
  {
    "text" : "It was a 54 yarder with the win in your back at the end of the half that he missed to.",
    "speaker" : "Steve",
    "timestamp" : "01:03:19-01:03:24"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:24-01:03:44",
    "text" : "Barely though. He did not miss out by much. But yeah, I'm curious if the the holding situation on it these are all pre-Paxon getting hurt. Yeah, no, but the the holder was no longer Ken Walter. Well, David Heward. So they hadn't had a lot of time to to get acquainted, if you will."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:03:45-01:03:49",
    "text" : "Let's not throw around Baseless allegations here, Andy. Okay."
  },
  {
    "text" : "Uh I'm just repeating what the commentator said, so you can take it out.",
    "speaker" : "Andy",
    "timestamp" : "01:03:49-01:03:51"
  },
  {
    "timestamp" : "01:03:52-01:04:04",
    "text" : "You don't come after Damon without some hard proof. Tom Davis had a great line. Uh Asante Samuels missed interception. He's like, I hope it didn't hurt him, because it hit him right in the fucking hand slash chest.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:05-01:04:05",
    "text" : "Yeah, it did."
  },
  {
    "text" : "That was pretty good. Uh but you know who? You know, I know you gave it to Ty Law, but I'm gonna give it to Eugene Wilson.",
    "timestamp" : "01:04:08-01:04:15",
    "speaker" : "Steve"
  },
  {
    "text" : "Hey. Ooh. Eugene.",
    "speaker" : "Greg",
    "timestamp" : "01:04:15-01:04:17"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:04:19-01:04:28",
    "text" : "There was that third and one where Ricky Williams bursts through the line, it's one on one, him and Eugene. That's with the same move that Portis put on. Yes. Shoe shoestrings him and holds him. There Ray call."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he did. He was like last man, last defender. One-on-one with Ricky Williams and just catches enough of his feet.",
    "timestamp" : "01:04:29-01:04:34"
  },
  {
    "timestamp" : "01:04:34-01:04:55",
    "speaker" : "Steve",
    "text" : "He had a like a big hit where he laid Lumber early in the game. And they were talking about how he went to Illinois. And I think that he was at Illinois when the Patriots had the Millic Miracle on Lake Champlain game. Oh you might because that was their stadium. We were playing their last year."
  },
  {
    "text" : "Yeah, it was 2002, yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:04:55-01:04:56"
  },
  {
    "timestamp" : "01:04:57-01:05:13",
    "speaker" : "Steve",
    "text" : "Against the rookie year, so it was his senior year, so he probably was at that fucking game. Oh fuck, he may have been. Watching the Patriots come back on the earlier on the if you're a senior or whatever, about to get NFL drafted on the football team, you're at the Patriots game there. That's interesting. I bet yeah, I wonder if he was."
  },
  {
    "timestamp" : "01:05:14-01:05:17",
    "text" : "That's funny. Not bad. What's your worst?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:18-01:05:21",
    "speaker" : "Steve",
    "text" : "Fuel goal kicking. Start with the worst, you know? Let's finish nice."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:22-01:05:47",
    "text" : "All right, a couple of last things. Um The poll that they put up for this game, because they seem to do that every game now. Which of the following players should be the AFC's starting Pro Bowl quarterback? I'm gonna give you a list here. um one of these things not like the others. Tom Brady, Peyton Manning, Steve McNair, Trent Green, John Kitna. Kitna played on Stan Balls, right? Couldn't get done."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:05:48-01:05:52",
    "text" : "John Kitten asked. What do you mean? Kitten is a legend."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. This is when the Bengal's first started getting good too. They had been shit for wicked long, I think.",
    "timestamp" : "01:05:52-01:05:57"
  },
  {
    "speaker" : "Andy",
    "text" : "Bengal's legend John Kitna? Yeah, Kitna's awesome. Uh whole Kitna caboodle.",
    "timestamp" : "01:05:57-01:06:03"
  },
  {
    "speaker" : "Steve",
    "text" : "You know, Kitna, Trent Green, they're the same. That wasn't obvious as obvious to me.",
    "timestamp" : "01:06:03-01:06:07"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. No, this is Trent Green Chiefs era. This is he's Yeah, he's handing the ball off to priest homes. Yeah, but he's still putting up gaudy numbers because of it.",
    "timestamp" : "01:06:07-01:06:15"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:06:15-01:06:16",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:06:16-01:07:20",
    "speaker" : "Andy",
    "text" : "And lastly, this doesn't really have to do with the with the podcast, except that it's uh both of you are involved in it but Facebook today gave me those like oh you know on this day thing and you were both involved for some reason Uh and I just want to know if you remember what either of these are about because you both posted on my Facebook Greg from 13 years ago. Um February 18th, 2008. Yo Andy, you're probably gonna poop on for this, but I lost my cell phone this weekend. I need your number so I can call you about tomorrow. And don't tell mom or Ellie. Okay. And then Steve's this I I don't know what it is, so maybe you can shine some light on it. Twelve years ago, February 18, 2009, so one year after to the day, one of my roommates does, as to the reason why your guess is as good as mine. But you know I got a better arm than you and Greg. He might be the soccer princess, but you're his prince."
  },
  {
    "timestamp" : "01:07:22-01:07:36",
    "speaker" : "Steve",
    "text" : "Well the last part remains true, but I don't remember the arm part. Don't either. Have you guys scrubbed your Facebook yet? No. No. Let me know what that means."
  },
  {
    "timestamp" : "01:07:37-01:07:44",
    "text" : "You know, like every time someone gets drafted, they always comb their yeah. Greg, we've got Twitter that gets you in trouble.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:07:47-01:07:48",
    "speaker" : "Andy",
    "text" : "How bad was it?"
  },
  {
    "text" : "Yeah, there's a bunch of weed stuff, but nothing really problematic.",
    "timestamp" : "01:07:48-01:07:52",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:07:52-01:07:52",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "At this point. Dude, I would just openly like be like, yo, let's smoke a blunt this weekend, John. It's a public forum. What was I doing? Yeah I did that no less than like like fifteen times.",
    "timestamp" : "01:07:52-01:08:07",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:08:08-01:08:12",
    "text" : "What are the impressions you you put out there? Clearly blood was one of them.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:08:13-01:08:13",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:14-01:08:14",
    "text" : "Yeah."
  },
  {
    "text" : "What else? Like weed, smoke, yeah, like anything, like any bad word I could think of.",
    "speaker" : "Greg",
    "timestamp" : "01:08:14-01:08:21"
  },
  {
    "speaker" : "Steve",
    "text" : "Do jibba?",
    "timestamp" : "01:08:21-01:08:22"
  },
  {
    "timestamp" : "01:08:22-01:08:26",
    "speaker" : "Greg",
    "text" : "No, but that's probably uh probably should yeah."
  },
  {
    "timestamp" : "01:08:26-01:08:32",
    "speaker" : "Andy",
    "text" : "Oh boy. All right. Well, what the hell's next week?"
  },
  {
    "text" : "Tuesday.",
    "speaker" : "Greg",
    "timestamp" : "01:08:33-01:08:34"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:08:34-01:08:43",
    "text" : "Wednesday. Next week? I mean there will be those days next week, correct. Friday. Well, that's tomorrow. Uh oh tomorrow."
  },
  {
    "text" : "What do you guys doing this weekend?",
    "speaker" : "Greg",
    "timestamp" : "01:08:44-01:08:45"
  },
  {
    "text" : "The same thing I do every weekend.",
    "speaker" : "Andy",
    "timestamp" : "01:08:47-01:08:48"
  },
  {
    "timestamp" : "01:08:49-01:08:51",
    "text" : "Which is Masturbate furiously.",
    "speaker" : "Greg"
  },
  {
    "text" : "Over the world, yes.",
    "speaker" : "Andy",
    "timestamp" : "01:08:51-01:08:52"
  },
  {
    "timestamp" : "01:08:53-01:09:18",
    "speaker" : "Greg",
    "text" : "Ooh, that was a deep cut. I know. Smoke a blunt, dude, with jaw. I found one where I was messaging John on Facebook and I posted something. I was like, yo. You ever gonna come back and like clean up that pizza you threw my wall and fix my smoke detector?"
  },
  {
    "text" : "Which is a valid question.",
    "speaker" : "Steve",
    "timestamp" : "01:09:21-01:09:23"
  },
  {
    "speaker" : "Greg",
    "text" : "And he goes, that wasn't me.",
    "timestamp" : "01:09:23-01:09:25"
  },
  {
    "timestamp" : "01:09:32-01:09:42",
    "text" : "All right, next week is back to Gillette again. Uh back to back home games. So I'm welcoming in the four and nine Jacksonville Jaguars.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:09:42-01:09:45",
    "speaker" : "Greg",
    "text" : "Scare. Can we skip this one? I do not remember."
  },
  {
    "text" : "I don't remember this at all either. You can skip it. That's kind of what I was expecting.",
    "timestamp" : "01:09:45-01:09:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:09:51-01:09:53",
    "text" : "What's the next good one?"
  },
  {
    "text" : "Super Bowl Greg.",
    "timestamp" : "01:09:53-01:09:54",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:09:55-01:09:57",
    "speaker" : "Greg",
    "text" : "I can't wait for these playoffs."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, the next good one is probably the last game of the season.",
    "timestamp" : "01:09:58-01:10:00"
  },
  {
    "text" : "Because the Patriots have just won the AFC East. They did. As we speak it into existence right now.",
    "speaker" : "Greg",
    "timestamp" : "01:10:00-01:10:07"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:07-01:10:26",
    "text" : "Yep. And they are first in the AFC because Kansas City lost. So both teams are now 11-2. And the patrons have a better number conference record or something like that. Because one of their losses was to the NFC. To the Redskins."
  },
  {
    "text" : "To the Redskins of all teams. So now we're just talking positioning these last couple games here, right?",
    "timestamp" : "01:10:26-01:10:31",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:10:31-01:10:38",
    "text" : "You win out and you're in first, you have home field advantage all the way through. But they've clinched clinched the division already.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "With six games to go?",
    "timestamp" : "01:10:38-01:10:41"
  },
  {
    "timestamp" : "01:10:41-01:10:43",
    "speaker" : "Andy",
    "text" : "Is that right? Four games."
  },
  {
    "text" : "Oh no, okay. Three games and then free play. Okay. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:10:43-01:10:46"
  },
  {
    "text" : "So.",
    "speaker" : "Andy",
    "timestamp" : "01:10:47-01:10:47"
  },
  {
    "timestamp" : "01:10:48-01:10:50",
    "text" : "Alright, I'll see you guys in the playoffs.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:10:53-01:10:55",
    "speaker" : "Andy",
    "text" : "Maybe the Super Bowl. Maybe the Super Bowl."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:10:55-01:11:14",
    "text" : "No, are you kidding me? I'm not the Super Bowl's not even the one I'm most excited for. Oh boy, I have an idea, but okay, this is like my favorite fucking single game performance by any player ever. Oh boy, is this your Eugene thing? He's actually integral in it too, but no."
  },
  {
    "speaker" : "Steve",
    "text" : "Okay. I know what he's talking about. Yeah.",
    "timestamp" : "01:11:14-01:11:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. Okay.",
    "timestamp" : "01:11:16-01:11:18"
  },
  {
    "timestamp" : "01:11:18-01:11:18",
    "speaker" : "Steve",
    "text" : "Yes."
  },
  {
    "text" : "Yes. See you now. All right. Well until then, if you have any feedback for us, if you uh want to hear more of Greg's trivia or drug stories, or you want Steven to actually put the puppy on the episode next week. You can text us. Text us the hotline.",
    "timestamp" : "01:11:19-01:11:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:40-01:11:53",
    "text" : "I wanted to shout out mom Because that's where I get my hatred of all technology from. That's all I was thinking while I was like fucking cussing out this printer. I was like, this is this is mom.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Very well, I mean, my When I used to do like IT support, my every time I go for an interview, they'd be like, oh, so why are you good at this? I'm like, well, let me tell you about my mother. I'll tell you this story. One day I came home from college and uh I walked in and she was yelling at the printer. Not at me about the printer, but at the printer. Eventually it turned to me. Yes. So she was yelling at the printer. So I walked over and said, Hey mom, what's going on? What's uh what's up with the printer? And she turns, looks at me, says this goddamn fucking printer won't print. I'm like, okay, what's what's going on? She's like, I don't fucking know, won't fucking print. So I walk over, look at the printer, and I hit the on button. And it turns on and starts to print. And so to thank me, she turns to me and says, Why the fuck does a printer have an on button? It storms away. My favorite was this was me like I walked to the door coming home from college and that was my welcome home.",
    "timestamp" : "01:11:53-01:12:50"
  },
  {
    "timestamp" : "01:12:51-01:13:21",
    "speaker" : "Greg",
    "text" : "My favorite was like I heard her like cussing in the other room and I'm I walk over and she's like It was when iTunes first came out and she's like, I can't get this fucking song to play. And I walk over. I'm like, all right, I mean I've done iTunes before, and I like just double-click a song and it starts playing. She goes What'd you do? I was like, I double-clicked it. She's like, you gotta click it twice. I was like, what? After like you clicked once, what was your next troubleshooting thing to do? Yell at it. Yeah"
  },
  {
    "speaker" : "Andy",
    "text" : "So yeah, so I tell that story and I never didn't get the job because of it. So because of mom's anger towards technology.",
    "timestamp" : "01:13:21-01:13:27"
  },
  {
    "timestamp" : "01:13:28-01:13:53",
    "speaker" : "Greg",
    "text" : "And she now she always now she's good at it. She finds quarantine. She's She does. Yeah. Yeah. Instead of getting frustrated, she tries to like actually figure it out, which I need to learn that. I I just get so mad at like the people that design it where I'm like, why the f are you trying to like make me go through this labyrinth of like bullshit just to get your thing to work?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:13:54-01:13:55",
    "text" : "Yes. Made easy for you."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. And instead of getting mad, I should just be like, okay, let's just solve this problem, Gregory.",
    "timestamp" : "01:13:56-01:14:00"
  },
  {
    "text" : "It'll be easier for you and less stressful if you just I'm gonna mail you my percussive maintenance tool. What's that? A baseball bat. Works every time. Sometimes all you gotta do is threaten it. Like you see this right here? And then it starts printing. Problem solved. I have a tendency to like rough it up a little.",
    "speaker" : "Andy",
    "timestamp" : "01:14:00-01:14:22"
  },
  {
    "text" : "Just like sometimes that's all I punch the buttons and be like, and yeah, you like that, you piece of shit, you dirty girl.",
    "timestamp" : "01:14:23-01:14:30",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:14:32-01:14:40",
    "speaker" : "Andy",
    "text" : "Uh yes, so if you have any printer stories or or you need any tech support, uh you can text us, Dynasty Hotline, what's the number?"
  },
  {
    "timestamp" : "01:14:40-01:14:42",
    "speaker" : "Greg",
    "text" : "Oh, let me get it. Let me get it. All right, all right."
  },
  {
    "speaker" : "Andy",
    "text" : "603.",
    "timestamp" : "01:14:42-01:14:43"
  },
  {
    "text" : "Yeah. That's the hard part. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:14:43-01:14:46"
  },
  {
    "speaker" : "Steve",
    "text" : "Out of our season.",
    "timestamp" : "01:14:47-01:14:48"
  },
  {
    "timestamp" : "01:14:49-01:15:01",
    "text" : "Oh, SOS. Yeah. 505. Yeah. That's why Z 505 seems such a weird beginning. And then it's Troy Brown for three. 8013. Four or three.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yes.",
    "timestamp" : "01:15:02-01:15:03",
    "speaker" : "Announcer"
  },
  {
    "text" : "We got there. You want to do that the whole thing? We got there By the way, update on my Sporkle endeavors. Oh boy. I recently completed all the capital cities of Africa.",
    "timestamp" : "01:15:04-01:15:18",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:15:18-01:15:18",
    "text" : "Okay.",
    "speaker" : "Andy"
  },
  {
    "text" : "Go ahead, ask me one. Uh Zimbabwe. Zimbabwe is Harare. Okay. But the thing is, I've never Algiers. I've never actually heard them pronounced, so all the pronunciations are just in my head. Which is kind of fun. Like Ugatago Which I have no idea if that's correct, but I know how to spell it. Guatemala. Guatemala is actually not in Africa. That's true. But it's Guatemala City. Ethiopia. Ethiopia is Addisababa.",
    "speaker" : "Greg",
    "timestamp" : "01:15:19-01:15:55"
  },
  {
    "timestamp" : "01:15:55-01:15:57",
    "text" : "What about uh Djibouti?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Djibouti is Djibouti. Djibouti Jibouti Shakin Djibouti Shakin Djibouti That should be a song Djibouti Djibouti Jibouti Jabouti Imagine like United States of America United States of America yeah I think all capital cities should just be the name of the country. Yeah. Make this whole thing a lot easier. This cruise would be so much easier. Ugadu's my favorite. Ugadu has a great name.",
    "timestamp" : "01:15:58-01:16:24"
  },
  {
    "text" : "Which country is that?",
    "timestamp" : "01:16:25-01:16:25",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:16:26-01:16:28",
    "speaker" : "Greg",
    "text" : "That is Burkina Faso."
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "01:16:29-01:16:29"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:16:30-01:16:31",
    "text" : "Or Chad."
  },
  {
    "speaker" : "Andy",
    "text" : "Burkina Faso. Yeah. Pronunciations are not my own. Yeah, we're really good at this. In Jamena So if you know how to pronounce any of these, you can text us 603-505-8043.",
    "timestamp" : "01:16:31-01:16:48"
  },
  {
    "speaker" : "Greg",
    "text" : "Leave us a voicemail with the correct pronunciation of African. No, text us the correct pronunciation.",
    "timestamp" : "01:16:49-01:16:55"
  },
  {
    "speaker" : "Andy",
    "text" : "All right. And until next week, we will see you later.",
    "timestamp" : "01:16:59-01:17:02"
  },
  {
    "timestamp" : "01:17:03-01:17:04",
    "speaker" : "Greg",
    "text" : "See you later. See you later."
  }
]