[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "speaker" : "Mom",
    "timestamp" : "00:00-00:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Welcome back to the Patriots Dynasty Podcast. Had a bye week last week, but uh in preparation for A big game, you kind of have to do that. So we're back. And it is your host here, Andy Brown, along with both brothers Brown, Greg and Steve, who I believe actually both watched the game this week. I always watch the game. Me too. I think we both know I wasn't talking about Eustace Bobby's on. Bobby's on. Oh, and we got two guests. Kelly's here ruining the surprise.",
    "timestamp" : "00:22-00:57"
  },
  {
    "timestamp" : "00:58-01:01",
    "text" : "He has lurked into the bedroom. She can't hear anything we're saying.",
    "speaker" : "Greg"
  },
  {
    "text" : "And he was just about to announce me.",
    "timestamp" : "01:02-01:04",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:04-01:04",
    "text" : "Yeah."
  },
  {
    "text" : "I can only imagine. Okay, that's fine.",
    "timestamp" : "01:04-01:07",
    "speaker" : "Kelly"
  },
  {
    "text" : "Okay, bye. See you guys.",
    "timestamp" : "01:07-01:08",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Thanks for the contribution. Great start. Uh yeah, and so for uh the surprise that was now ruined, uh we have also with us joining us today our brother-in-law. Bobby Bridges, the Carolina Panthers fan, Bobby Bridges. It felt appropriate to bring him back because we've talked to him before. But uh these are better circumstances for you, Bobby, I would think.",
    "speaker" : "Andy",
    "timestamp" : "01:10-01:34"
  },
  {
    "text" : "I'm just here to boost my ratings from the last time I was on.",
    "timestamp" : "01:34-01:37",
    "speaker" : "Bobby Bridges"
  },
  {
    "text" : "With whom? Yeah. With all with all the Patriots fans that that are dying to hear. You come back on the podcast?",
    "timestamp" : "01:39-01:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "I just add whatever flavor I can.",
    "timestamp" : "01:49-01:51"
  },
  {
    "speaker" : "Andy",
    "text" : "I love it, yeah. So last time we talked to you, um The Panthers were 1 and 15 finishing out that season. This was only two seasons ago, and the Patriots had thrashed them to end their season going into their playoffs. Um and you said it was the low point in the franchise's history, if I recall.",
    "timestamp" : "01:51-02:12"
  },
  {
    "timestamp" : "02:12-02:14",
    "speaker" : "Bobby Bridges",
    "text" : "I believe that's accurate."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:14-02:22",
    "text" : "Yeah. So then would that make This 2003 team uh the high point or just a high point?"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "Yeah, I was thinking that. Um I for me personally, high point. Like this was a high watermark. This was like, I mean, this is the most important Panthers game I've ever watched. Most important Panthers game in my life. Hi. High moment for the franchise. I think arguably in retrospect, yes. Because we don't even need to talk about that stupid ass shit show against Denver a few years ago.",
    "timestamp" : "02:22-02:49"
  },
  {
    "text" : "Yeah, I mean those yeah that's the only competition, right? Yeah. Well, I mean, but which team would you say was better as a as a Panthers fan? Because that that more recent one with Cam Newton, they were what, fifteen and one?",
    "timestamp" : "02:49-03:01",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Bobby Bridges",
    "timestamp" : "03:02-03:13",
    "text" : "Yeah, that was a better team. Um But this 2003 theme was grittier. And the second half showed that, as I recall."
  },
  {
    "text" : "Yes. Um so yeah, these uh these Carolina Panthers back in 2003 finished the season 11 and five. Uh it was good enough for the three seed in the NFC. And they kind of had a bit of a wild ride to the Super Bowl. Because I know we actually touched on it last week, week before. Um when the Patriots were playing their oh their divisional game against uh the Titans in the cold. Yeah. They were they kept showing highlights of the the Panthers game because they were playing the Rams. And they beat the Rams in double overtime, where Steve Smith took a quick slant and just fucking housed it. Walked it off. Yeah.",
    "timestamp" : "03:13-03:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Bobby Bridges",
    "timestamp" : "03:56-04:19",
    "text" : "This was the most important game, but that Rams game is my favorite Panthers game of my entire life, actually. I actually vividly remember that game and where I was watching it. And I that Steve Smith play I remember that that play is seared into my soul. It was the only way it could have gone down. I can picture it in my in front of my eyes right now."
  },
  {
    "timestamp" : "04:19-04:56",
    "text" : "Yeah. I understand that feeling. I I have that for with a few pages, please. Um, but that actually brings me to my point. I because I feel like Steve, I don't I kind of want to hear what my brothers have to say about this. I feel like Steve Smith is like a Rodney Harrison type of guy where you love him if he's on your team, but otherwise you think you fucking hate him. Yeah, he was like kind of word to me. I knew you would, Greg. Because that Bobby, I imagine like he's probably one of like the top like Panthers in Panther history, right?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "04:57-05:06",
    "speaker" : "Bobby Bridges",
    "text" : "I have no hesitation in saying he's the greatest Panther in history. And my opinion is if you didn't like Steve Smith, you didn't fucking like football."
  },
  {
    "timestamp" : "05:06-05:14",
    "speaker" : "Greg",
    "text" : "Agree. Complete agree. He's different than Rodney in that even if he's not on your team, you love him because he's just fucking awesome."
  },
  {
    "text" : "But I feel like he was that same like Always played right on the edge, would just trash talk the shit out of everybody all the time. And like he seemed to be able to rile up the other team. In a way that felt very reminiscent of a Rodney Harrison.",
    "timestamp" : "05:15-05:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Feels like a Heinz Ward to me.",
    "timestamp" : "05:34-05:36"
  },
  {
    "text" : "Pretty good comparison. Yeah, I think he was probably more talented than Heinz Ward, but yes.",
    "timestamp" : "05:37-05:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "But also like if you're gonna, I mean, Steve Smith's making my top 10 all-time athletes in terms of biggest chip on your shoulder. Like he's up there in terms of just like every game showed up with a like I heard all these motherfuckers thought I sucked at football like literally before every game. And like the thing about his trash talk was like that shit cut deep. I mean the the most hilarious moment ever was this like Minnesota game when he like just just ripped Fred Smoot's like soul out of his body. That I think that was the like Ice Up Sun game.",
    "timestamp" : "05:41-06:16"
  },
  {
    "timestamp" : "06:15-06:17",
    "text" : "Yes. Oh, that's right.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "06:17-06:18",
    "speaker" : "Bobby Bridges",
    "text" : "Yeah."
  },
  {
    "timestamp" : "06:19-06:37",
    "speaker" : "Greg",
    "text" : "He's even better now with like the the analyst stuff he did, like he was doing Thursday night football halftime show. And like Michael Urban was like trying to like playfully talk shit to him about like his suit or something. Oh, that's right. And Steve Smith was just having none of it. He was just like"
  },
  {
    "timestamp" : "06:37-06:57",
    "text" : "He was like fuck you, I'm a better receiver than yours, I know that's how he responds to every moment and and it's become clear in all aspects of his life. Like if you have something to say, I have a response. I'm coming for you He also apparently runs like an epic soccer camp. Really? Soccer? Yeah. His kids his kids play soccer. He's like super into it.",
    "speaker" : "Bobby Bridges"
  },
  {
    "timestamp" : "06:57-07:12",
    "speaker" : "Andy",
    "text" : "No shit. Interesting. Pretty sweet. So I just googled uh like top Steve Smith, best of Steve Smith Sr. 's trash talk. on Baltimore Ravens. com of all websites."
  },
  {
    "timestamp" : "07:12-07:15",
    "text" : "Whatever. They can try to claim that ownership if they want.",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:15-07:24",
    "text" : "Yeah, well, I know. But the slideshow The number, the first slide is I look in the eyes of all my victims before I take their lunch money."
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "That sounds right. That sounds right.",
    "timestamp" : "07:26-07:28"
  },
  {
    "text" : "Yeah, it really does. Um, and there's another one. I don't know who he's talking about, but we're not on the same team anymore. So I'm gonna go try and knock his block off too. And when I get up, I'm gonna spin the football, go back to the huddle, and do it again. That's just media shit talking too. Yeah. Put your goggles on because there's gonna be blood and guts everywhere",
    "timestamp" : "07:29-07:49",
    "speaker" : "Andy"
  },
  {
    "text" : "I think he said that about coming back to his first Panthers game.",
    "speaker" : "Bobby Bridges",
    "timestamp" : "07:50-07:53"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:54-07:55",
    "text" : "Oh, did he?"
  },
  {
    "timestamp" : "07:55-08:00",
    "speaker" : "Bobby Bridges",
    "text" : "He was unhappy about the way things ended. He was not wrong in the way he was treated by ownership."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:00-08:02",
    "text" : "How did it end? I don't think I remember that."
  },
  {
    "text" : "They just didn't re-sign him and it was just like for a franchise icon, completely inexcusable. Oh yeah. Because there's a lot of quotes in here about like had a thousand yard season and was like fuck everybody. Yeah. Yeah.",
    "timestamp" : "08:02-08:19",
    "speaker" : "Bobby Bridges"
  },
  {
    "text" : "I remember that year. This is a good one. Honestly, I want your mom to be pissed off when she sees on SportsCenter that I'm doing her son like dirt.",
    "speaker" : "Andy",
    "timestamp" : "08:20-08:29"
  },
  {
    "text" : "The difference like is is like do you have those players now like uh the guy from the Rams, the cornerback. You have the cocky guys, yeah, yeah, yeah, Rams or the Sherman, the Richard Sherman, but they don't feel as authentically like psychopathic as Smith does. Like that's what's great about Smith is it's very genuine. You could tell it's not like he's just like playing a playing a character. He is actually that fucking crazy.",
    "timestamp" : "08:30-09:03",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "09:03-09:28",
    "speaker" : "Bobby Bridges",
    "text" : "Yeah, it was never for attention. It was not about spectacle. This was pre-social media. He like actually took all of this shit personally. And that was like his journey to the league, right? He was like a special teams guy from like Utah that nobody thought would make it. And like you know, he's like one of those guys. He like he like truly legit fought and earned his spot in the league and then I think truly felt disrespected by everyone all the time."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:28-09:55",
    "text" : "It sure seems that way. And that's why I was saying like if uh that my comparison was Rodney Harrison because I mean Rodney Harrison was the king of nobody believes in us. We're playing with the chip on our shoulder because everybody's talking shit and we're going to prove the world wrong and all that sort of crap. Even when they were in the midst of like a 20-something game win streak and nobody was doubting them. Is he in the Hall of Fame, Steve Smith? It's a good question."
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "I don't think he's eligible yet. He's one of those like borderline cases on the numbers, but I I mean I think I've made it clear where my my opinion lies.",
    "timestamp" : "09:55-10:08"
  },
  {
    "timestamp" : "10:08-10:09",
    "speaker" : "Andy",
    "text" : "I think so too."
  },
  {
    "timestamp" : "10:09-10:23",
    "text" : "I think you should get in. I'm saying here he's seventh in NFL career receiving yards. That's gotta be that's gotta be a Hall of Famer. 12th in receptions and 25th in touchdowns. It's gotta be it's pretty good.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, that's pretty legit. What about Edelman then?",
    "timestamp" : "10:24-10:26",
    "speaker" : "Bobby Bridges"
  },
  {
    "timestamp" : "10:28-10:40",
    "text" : "That would have been sneaky crazy too. Yeah, I think he's also got that chip on his shoulder. He played he didn't he didn't say, like he didn't talk the same way that um Steve Smith did, but I think he played the same way.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Right. I agree. I always think back to I think it was the Seattle Super Bowl when they had like the mic'd up version and he like got crunched in a hit and he got up laughing and goes, I love getting hit. Yeah. That that's just a fucking crazy man.",
    "timestamp" : "10:40-10:57"
  },
  {
    "text" : "That's a lunatic, yeah. Or they he was saying something about how uh like he was on the bench mic'd up And he's like, so my dad always said growing up, when you have somebody on the ground, you gotta step on their throat. Yeah. And then like later on it comes back to him. He's like That explains a lot about me, actually, really, doesn't it? I think his dad was a bit of a psycho, though. Which makes a lot of sense.",
    "speaker" : "Andy",
    "timestamp" : "10:57-11:22"
  },
  {
    "timestamp" : "11:22-11:27",
    "text" : "He seems a little more like social media savvy though and like kind of knows what he's doing.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean that could also just be a sign of the times, too, though, right? That's true.",
    "timestamp" : "11:27-11:31"
  },
  {
    "speaker" : "Greg",
    "text" : "That's true.",
    "timestamp" : "11:31-11:32"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "11:32-11:44",
    "text" : "Um but yeah, so Bobby, uh, do you have any like just overall thoughts about this 2003 team? Just memories generally about them?"
  },
  {
    "text" : "Yeah, I mean I mean I remember this team so well. This was like such a such a watershed moment. I mean for me this was freshman year in college and uh in the early days of the Panthers I like had not Like I didn't I didn't really get in on the team closely when they in like you know '96 and all that. But like a little bit later on high school started to, because then this was like after we lost the Hornets and like the Panthers were kind of the the thing in town. Football's grown a little bit, but uh and I might have said this the last time, but like it was still big time Redskins Cowboys territory. Um, which is why actually I I seem to remember we trashed Dallas in the first round during the stupid Quincy Carter days. And it was such a satisfying victory because the Cowboys fans were such obnoxious assholes. Um and we just like smash them. I think we might have even we either shut them out or they only scored like three points. And it was just like fucking assholes. 29 to 10 apparently. Yeah. That's all a beat down. Yeah, I mean this team it was like I mean it the the winning season came out of nowhere. Um you know like you said it's like we were total shit and then 2001, John Fox takes over in 2002. It immediately at least makes the franchise respectable. I think we went seven and nine the year before. Um And then was like had the makings of a solid defense. But like we're coming into that season and it's like Steve Smith, like, this was his blow-up season. Like he'd been solid in 2002, but like he was just a returner before that Right. Mussoud Muhammad was like a respectable veteran, but he didn't blow up until really about this time as like the legit number two receiver. We like signed Steven Davis, I think, from the Redskins as like this like slightly over-the-hill workhorse back, but like nobody knew if he was gonna stay healthy. Um and then Rodney Pete was the starting quarterback to start that season. Rodney Pete. And uh it's funny because my uh the first game of that season we played the Jaguars and my parents went to that game. Um and that was the game that like j I mean to like Jake Delome. Remember this this is fucking Jake Delome like coming out of nowhere, NFL Europe, like on the practice squad, and then they put him at a halftime in religion to Jacksonville. He sparks the comeback. And then wins the starting job week one. Like people were, I mean, my parents like were buzzing about it coming home. Like people were jacked. The second half was awesome. This guy, Jake Baboom, comes on. brings the comeback. And it just, it was one of those seasons, right? Where it's like this like scrappy kind of team of no names comes together. And that was the vibe. Um but like I mean without that team, I don't think the Panthers look like they do now. Like without that team to galvanize the fan base, like I don't know where things are at. Um, I don't know if the team really gains momentum. Hell, who knows? They might have gotten moved. I'm maybe I'm being a little dramatic, but like they didn't accomplish much before that. And it's like This season made the Panthers like a like a legit thing in in the region. And like so it was a big deal. I mean, they won a lot of close games that season. Um Like I they weren't dominant. You know what I mean? They won eleven to five. I'm I mean I'm pretty sure they like won a shitload of like down to the wire games and close and like it was like scrappy defense and opportunistic offense and you know, kind of a like nobody believes in us attitude the whole fucking way. And I don't think they were favored in any of their playoff games. Like even people were talking about Dallas beating us in week one in the first round, which is why it was so disrespectful. Because they also scratch.",
    "speaker" : "Bobby Bridges",
    "timestamp" : "11:45-15:23"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "15:24-15:26",
    "text" : "They had five overtime games and won them all."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "15:26-15:34",
    "text" : "Oh no, they lost one. Apparently Delome had eight game winning drives in Yeah. Fourth quarter overtime. Which is an NFL record. Yeah."
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "It was that kind of season. Yeah.",
    "timestamp" : "15:34-15:36"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "15:38-15:40",
    "text" : "Daylight come and you gotta delome."
  },
  {
    "timestamp" : "15:42-15:52",
    "text" : "I mean I still got my uh somewhere in the closet. I you know I should have fucking worn it. Uh maybe I'll go get it in a minute. I got a I got it I got the powder blue Delome jersey in the closet somewhere from the 17.",
    "speaker" : "Bobby Bridges"
  },
  {
    "text" : "That's a deep cut. I like that.",
    "speaker" : "Andy",
    "timestamp" : "15:53-15:55"
  },
  {
    "text" : "No, I mean he's one of those guys you can't get his jersey because he's such a fucking dork.",
    "speaker" : "Greg",
    "timestamp" : "15:56-16:00"
  },
  {
    "text" : "He looked like he was on drugs and skin. Nope. But the the thing you don't gotta remember is the whole franchise was a giant dork and he he did something special. So like I don't you say whatever you want about him that guy That guy's an important franchise player. But yeah, I mean he's he's a nerd.",
    "timestamp" : "16:01-16:20",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Greg",
    "text" : "He's a dork.",
    "timestamp" : "16:20-16:20"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "Oh totally. Totally.",
    "timestamp" : "16:21-16:22"
  },
  {
    "timestamp" : "16:22-16:39",
    "text" : "I'm like watching I'd I'd take like four players jerseys over his on this roster. Name them. Julius Peppers, Steve Smith, uh Chris Jenkins, Ricky Manning. Boom.",
    "speaker" : "Greg"
  },
  {
    "text" : "Ricky Manning?",
    "timestamp" : "16:39-16:40",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, Ricky Mane was awesome.",
    "timestamp" : "16:41-16:43"
  },
  {
    "speaker" : "Bobby Bridges",
    "timestamp" : "16:43-16:47",
    "text" : "Yeah, he was like l like low-key contributor glue guy."
  },
  {
    "text" : "Uh-huh. Big play guy.",
    "timestamp" : "16:47-16:49",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "16:50-16:50",
    "speaker" : "Bobby Bridges"
  },
  {
    "timestamp" : "16:51-16:52",
    "text" : "Plays best in the big games.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "I mean all of this is true from a like from a like football nerd standpoint But like, I don't know, like so many of those moments, it's just like this is a franchise that everything went wrong for beforehand. And then Like Delome was the guy who like, did anybody think he was a franchise quarterback? Nope. By the end of that season, did people trust him to come through in the clutch? Yes. And it was like a moment. You know what I mean? It was like a it was like a Linsanity kind of moment. For a whole season.",
    "timestamp" : "16:53-17:20"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:20-17:27",
    "text" : "He was uh only the second undrafted quarterback to start in the Super Bowl. I think he probably still is, I would guess."
  },
  {
    "text" : "Was that after Kurt Warner? It was. Yeah, he got a lot of the a lot of the Kurt Warner comparisons that year.",
    "timestamp" : "17:27-17:33",
    "speaker" : "Bobby Bridges"
  },
  {
    "text" : "Yeah. Uh and uh like you I think you uh touched on it earlier, Jake Delome was uh the backup for Amsterdam in the World Football League. You know who who he backed up? Kurt Warner. Oh, I would have known this. It was Kurt Warner. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "17:33-17:49"
  },
  {
    "timestamp" : "17:50-17:55",
    "speaker" : "Bobby Bridges",
    "text" : "Yeah. I remember they had a connection from the NFL Europe gig. The Amsterdam Admirals"
  },
  {
    "text" : "So the Amsterdam Admirals are basically a a quarterback factory, is what we're saying.",
    "speaker" : "Andy",
    "timestamp" : "17:55-17:59"
  },
  {
    "timestamp" : "18:05-18:13",
    "text" : "University. Another powerhouse. College that does not exist. Well, I guess it does. It's UL Lafayette now. They changed their name.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "That's right. I thought I thought they had become Lafayette, yeah. But yeah, I mean and then the playoff run. I mean, I was watching all these games in my college dorm, and this kind of like helped set the like I'm going to Davidson, right? So I'm like literally 20 minutes out of Charlotte. But I'm going to college with a bunch of out of staters. Like my whole freshman hall's a bunch like New Jersey, New England, Florida, like people are all over. And this like cemented me as like, oh, Bob's the like local guy who's like fucking crazy about the",
    "timestamp" : "18:13-18:43"
  },
  {
    "timestamp" : "18:45-18:46",
    "speaker" : "Andy",
    "text" : "You're that asshole."
  },
  {
    "timestamp" : "18:47-18:47",
    "speaker" : "Bobby Bridges",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "18:49-18:51",
    "text" : "Steve made a fucking friend group out of that."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "18:52-18:53",
    "text" : "Oh yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Just being like, oh, he's a Boston sports guy.",
    "timestamp" : "18:54-18:57"
  },
  {
    "timestamp" : "18:57-19:06",
    "speaker" : "Steve",
    "text" : "Yeah. That was a good idea. And here I am doing a fucking Patriots podcast for 65 fucking episodes, rewatching all these games. Yeah."
  },
  {
    "text" : "Uh I got a question about Delome. Um based on the Wikipedia. com entry for Delome It said uh Delome is noted for licking his fingers before every play and sticking his tongue out as part of his focus, which led him to be a Bojangles fried chicken. uh uh representative what do you ever want to call it like he was in all the commercials yeah do you do you remember any of the Bojangles the Lone commercials?",
    "speaker" : "Greg",
    "timestamp" : "19:07-19:39"
  },
  {
    "text" : "Oh I don't I was like waiting to be like, what's the question? All of those things are just facts. And yes, well known Carolina. I 100% remember the Bojangle subscript uh commercials. Awesome. I mean I also like no joke remember the tongue thing.",
    "timestamp" : "19:39-19:57",
    "speaker" : "Bobby Bridges"
  },
  {
    "timestamp" : "19:57-20:03",
    "speaker" : "Steve",
    "text" : "I didn't notice it in this game. Dude, he looked like he was on drugs on multiple points in this game."
  },
  {
    "timestamp" : "20:03-20:49",
    "speaker" : "Bobby Bridges",
    "text" : "Oh yeah, he looks he's like he's like kind of wild-eyed at times. Um at one point for years I had this DVD that was like I got out of like the $10 bin at Walmart once on a whim during like maybe later in college. And it was like one of those uh like Super Bowl highlights videos and it like gave you like the spiel in every Super Bowl. Yeah. And for years, like like the day of the Super Bowl, I would like make my roommates at the time watch it and like get hype. Um And I remember, I mean, I can vividly remember all the highlights it had for this game, which was the second to last game on the disc. The last game on the disc was the Eagles Super Bowl, the next one. And uh But like you can literally see him in the huddle doing that crazy tongue out shit. Yeah, he was crazy. Some country bumpkin crazy ass."
  },
  {
    "speaker" : "Andy",
    "text" : "He was crazy because and But I I think it was more of a good crazy than like a Steve Smith scary crazy. Yeah. But y there was one time where um not to ruin anything, but he threw a touchdown. And he was running down to celebrate it and Rodney Harrison kind of like shoulder-checked him. And he spun around and just started screaming at Rodney Harrison. No idea what he was saying.",
    "timestamp" : "20:49-21:12"
  },
  {
    "speaker" : "Steve",
    "text" : "That's why I wrote that note, that that scene there. It looks like he's just on, you know, those guys you see and Raven by the 7-Eleven. That's what it looked like, yeah. Looked like he was the other way. Yeah.",
    "timestamp" : "21:13-21:23"
  },
  {
    "timestamp" : "21:24-21:27",
    "text" : "Yep. Bringing Jesus to the the field. It's great.",
    "speaker" : "Andy"
  },
  {
    "text" : "Are you guys watching the Jake Delone Bo Jangles commercials now? Uh no.",
    "speaker" : "Steve",
    "timestamp" : "21:27-21:32"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:32-21:34",
    "text" : "I already watched them. They're awesome."
  },
  {
    "speaker" : "Steve",
    "text" : "I think we'll have to put them in the Diks to Hazard one?",
    "timestamp" : "21:34-21:36"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, the Dikes to Hazard one's sweet.",
    "timestamp" : "21:37-21:39"
  },
  {
    "text" : "But I g I mean He was, I mean, you're talking like an a like underdog upstart franchise in a region that hasn't had football. And here you have this guy who took him to the Super Bowl who, say what you want about him. He like bleeds authenticity. So people love that shit.",
    "speaker" : "Bobby Bridges",
    "timestamp" : "21:39-21:57"
  },
  {
    "speaker" : "Greg",
    "text" : "That's true. Yeah, that is true.",
    "timestamp" : "21:57-21:59"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "Like he none of this shit was an act. He just was himself.",
    "timestamp" : "21:59-22:02"
  },
  {
    "speaker" : "Greg",
    "text" : "You know, that's the the it's kind of the vibes you got from Brady back in the day, too. Like before Brady became cool, he was kind of similar, like nerdy off shucks kind of guy. That was like also a competitor when you put him on the field, but you get him off the field, he's like, oh, you know, my teams. Yeah, exactly. Yeah.",
    "timestamp" : "22:02-22:21"
  },
  {
    "speaker" : "Bobby Bridges",
    "timestamp" : "22:21-22:34",
    "text" : "Yeah. And he had more of the like quiet intensity on the field vibe. But like that also, yeah, in those days read as authentic. Of course now we know it's just, you know, a sociopath, but he was duffy on drugs."
  },
  {
    "text" : "Steve Smith is in one of these commercials.",
    "speaker" : "Steve",
    "timestamp" : "22:36-22:38"
  },
  {
    "timestamp" : "22:39-22:45",
    "speaker" : "Andy",
    "text" : "Oh boy. But that's a good one. Yeah, Steve Smith strikes me as somebody who can't take a joke."
  },
  {
    "timestamp" : "22:45-23:27",
    "text" : "Well, I also remember like moments like this the Steve Smith-Jake Delome relationship was interesting. because they like simultaneously had a ton of success together and like had a like clear connection. And as Steve Smith sort of like, as he hit his prime There was also this clear tension of like, hey, motherfucker, if you would just be a little bit better, I could do a lot more. But he would just like they had the kind of relationship where they would just go at it. Like Steve Smith would just tell him like Motherfucker, you missed that throw in the in the huddle. And they would just like, that was the relationship. But like I think that like that's what set the tone for the whole team. It was just like We just like it was like a very like real vibe on that team.",
    "speaker" : "Bobby Bridges"
  },
  {
    "text" : "It seemed like another strength of this um Panthers team. was their defensive line. Like I remember like that's one of the few things I remember from like the buildup to the game was just It was nonstop talk about how would the Patriots' offensive line handle this, these absolute fucking monsters on the Panthers defense.",
    "timestamp" : "23:28-23:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Bobby Bridges",
    "timestamp" : "23:52-23:58",
    "text" : "Peppers and Mike Rucker on the end, Brinson Buckner and Chris Jenkins on the middle. Yeah, they were a force."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "23:58-23:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Bobby Bridges",
    "timestamp" : "23:59-24:00",
    "text" : "They really were."
  },
  {
    "speaker" : "Andy",
    "text" : "And I thought you kind of saw it early in this game, too, where Like Brady just had absolutely no time and and they were the whole offensive line of the Patriots getting pushed around.",
    "timestamp" : "24:01-24:13"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "Yeah, the first the first half was low scoring, right?",
    "timestamp" : "24:13-24:16"
  },
  {
    "timestamp" : "24:16-24:24",
    "text" : "Oh it was twenty One twenty-five minutes. Yeah. That's right. Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "24:24-24:28",
    "text" : "And then twenty-four points were scored right at the end of the half.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "24:28-24:31",
    "text" : "Oh, that's right. It was right before halftime. Things kind of lit up.",
    "speaker" : "Bobby Bridges"
  },
  {
    "timestamp" : "24:31-24:35",
    "speaker" : "Andy",
    "text" : "Yeah. And then nothing in the third quarter, then the fourth quarter."
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "Yeah, back and forth. Yeah. Ton of points.",
    "timestamp" : "24:35-24:37"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, it was supposed to be a boring game, right? Because the Patriots were the the defensive juggernaut and the Panthers had just come off a 14 to 3 win against the Eagles. So the over-under is 38, which is you know You never see a 38 point over under these days. Right. But yeah, I think people were had low expectations of what the Super Bowl would be like. And the Pats are seven point favorites, so it's like They weren't even expecting like a close game, they were thinking a low scoring Patriots win price. Yep. Exactly. And it was the complete opposite. It was a fucking shootout that came down at the last play.",
    "timestamp" : "24:37-25:16"
  },
  {
    "timestamp" : "25:17-25:26",
    "speaker" : "Andy",
    "text" : "Which is pretty awesome. It wasn't, it wasn't though, because like the first half was 14-10. Yep. And actually after the third quarter is still 1410. And then we're going to be able to do that."
  },
  {
    "text" : "Yeah, and then there's that that back and forth just mayhem at the end. Yeah.",
    "speaker" : "Bobby Bridges",
    "timestamp" : "25:26-25:30"
  },
  {
    "timestamp" : "25:30-25:38",
    "speaker" : "Andy",
    "text" : "Yeah. So do we want to give this a watchability score, boys? We haven't actually done there. We haven't actually said what the final score is either"
  },
  {
    "text" : "Everyone knows we went in on a last-minute field goal. Yeah.",
    "timestamp" : "25:39-25:42",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "32-29 after all that. So 38 point over under. And the Pages almost covered that themselves, as of the Panthers. So Nice high scoring game, even though 14, like I said, 14-10 going into that fourth quarter.",
    "timestamp" : "25:42-25:56"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "There was one my man John Casey kicked it out of bounds.",
    "timestamp" : "25:57-26:00"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:00-26:01",
    "text" : "Five touchdowns."
  },
  {
    "text" : "That final that final kickoff.",
    "timestamp" : "26:02-26:03",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And he was like he was a really good kicker too for you.",
    "timestamp" : "26:04-26:08"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "I'll say no bad words about him. Another important man in the franchise, but what a tragic moment.",
    "timestamp" : "26:08-26:14"
  },
  {
    "speaker" : "Andy",
    "text" : "It was kind of the opposite of Adam Vinateri in this game because Adam had struggled all season with misses and missed his first field goal and then had his second one blocked. So he was 0 for 2 on the game and field goals. And then it came down to Him having to kick. His other field goals were actually short of it, like 30 something yarders. This one was a 41 yard to win it.",
    "timestamp" : "26:14-26:39"
  },
  {
    "speaker" : "Bobby Bridges",
    "timestamp" : "26:39-26:48",
    "text" : "What a great example of how the the the victor set the narrative. Because like the Pats lose that game. Vinateri's a fucking goat."
  },
  {
    "text" : "Goat. Yeah. And not in a good way. Wouldn't you even close? Six add six points to that.",
    "speaker" : "Steve",
    "timestamp" : "26:49-26:55"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:55-26:56",
    "text" : "It's true, yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Or even three.",
    "timestamp" : "26:56-26:57"
  },
  {
    "timestamp" : "26:58-27:07",
    "text" : "Also a tough look for John Casey is did you see he had earplugs in? Yeah. That is just For a kicker that it's just a tough look.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "27:11-27:13",
    "speaker" : "Steve",
    "text" : "Such a kicker thing."
  },
  {
    "timestamp" : "27:13-27:30",
    "speaker" : "Bobby Bridges",
    "text" : "I mean, I remember him as like a like pretty weird dude Really? He was also like old. Yeah. He like kicked for a long time. Uh he had like a really long career, but like he was like I think he might have even been then at that time one of the oldest guys on the team."
  },
  {
    "timestamp" : "27:31-27:39",
    "speaker" : "Greg",
    "text" : "He was 34. He kicked for 20 years in the NFL. The rookie season was 1991. So yeah, he had been around."
  },
  {
    "speaker" : "Steve",
    "text" : "Speaking of uh kicking, I have notes on that long snapper from the Patriots. Oh, that's right, yeah. Speaking of old ass motherfuckers. Yeah, tell me about them. So I read that uh I think it's a sports illustrated piece. You should read. I got a I got a little quick Cliff Notes version, but if you have time, you should definitely read it. He had snapped for Bilitek in Cleveland, had been retired for like three years and was teaching third grade or second grade in Louisiana. And then they brought him up right before the playoffs.",
    "timestamp" : "27:39-28:12"
  },
  {
    "speaker" : "Andy",
    "text" : "Right, because the Patriots long snapper got hurt. And so they brought in the backup and he got hurt too. So they just didn't have a long snapper. So they literally signed this guy off the street, right?",
    "timestamp" : "28:13-28:22"
  },
  {
    "text" : "Yeah. But from like Belichick's Cleveland days.",
    "speaker" : "Steve",
    "timestamp" : "28:23-28:26"
  },
  {
    "speaker" : "Bobby Bridges",
    "timestamp" : "28:26-28:51",
    "text" : "So you gotta love that shit. There's nothing better about sports. I wanna I wanna I wish I could do that as a principal. I wish I could be like, this teacher's on leave, this backup sucks. I'm literally calling somebody I know from college and saying, I need you in here to teach seventh grade science for six weeks. We're on the verge of a major breakthrough. You're a part of the team. Here's a Jersey. A lot of pressure."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:52-29:42",
    "text" : "A lot of pressure. He's like he's like m taking camcorders around the Patriots facility and his experience and mailing them back to his second grade classroom in Louisiana. I would love to see those tapes by the way. Oh man. I wonder if we can get a hole in this guy. Yep, right before the Super Bowl. And he like snap a ball save his life. Yeah. He's skipping them all. And if if you look close, there's there's a couple of skip snaps in this game on punts. On punts, yeah. That's one of the field goals. Uh So he's like up all night the night before the game snapping into a pillow goes to goes to the the meal before the game. Tries to cut a dinner roll with a steak knife and fucking gets three stitches, cuts his fucking hand before the Super Bowl, the the the meal, the morning of"
  },
  {
    "timestamp" : "29:43-29:44",
    "speaker" : "Bobby Bridges",
    "text" : "Bro, get it together."
  },
  {
    "text" : "Yeah. So he's already got the yips. Belichick's pissed at him, but there's nobody else to replace him. Yeah. Then he cuts his hand the the the dinner the day before or the morning of. This is my nightmare. And so he was like, please score a touchdown, please score a touchdown. They did. And then the Panthers came back and scored another touchdown. So then he was just flipping his shit when they uh When they had the field goal to win it. And he's like, look, you know, if I'm gonna go out, I'm gonna go out guns firing, so I'd rather snap it over the guy's head entirely than just like dribble that doesn't get there. So yeah, you ended up Crushing it.",
    "timestamp" : "29:44-30:21",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Perfect snap. The only one he needed. Rassum didn't really matter. Because it's not like Ken Walter was going to put a good pun together, even if you did snap it to him. It's true.",
    "timestamp" : "30:21-30:32"
  },
  {
    "text" : "But he had he had played with Ken Walter in Cleveland as well, so they'd known each other from like way back when.",
    "timestamp" : "30:33-30:38",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh my god. Yeah. Because Beljak was a coach of them in like late 80s, early 90s. This is not recent. Yeah. Ridiculous times. Jesus.",
    "timestamp" : "30:38-30:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "His brother is a NFL receiver, Todd Kitchen. I think the Cardinals. Todd Kitchen, I recognize that name. Not not anymore, but And then he worked as a college uh analyst and then retired after Explaining that receivers make catches with their hands because they can crest the ball, he added. That's kind of gay, but hey, whatever",
    "timestamp" : "30:48-31:11"
  },
  {
    "text" : "This uh who is this? This is the one? Yeah, no guy. Oh my god.",
    "speaker" : "Andy",
    "timestamp" : "31:13-31:19"
  },
  {
    "speaker" : "Greg",
    "text" : "It's like uh the guy for the So speaking of Carolina, the the Hurricanes goalie, the emergency goalie was like the equipment manager. Oh yeah, yeah. I'm trying to look it up right now. This was like recently. And he he pitched like a shutout basically, right? He got into the game.",
    "timestamp" : "31:23-31:45"
  },
  {
    "text" : "Yeah. And was just like stonewalling whoever they're playing the blues or someone.",
    "timestamp" : "31:45-31:50",
    "speaker" : "Andy"
  },
  {
    "text" : "I'll try and find it. Alright. Yeah, I remember that guy.",
    "speaker" : "Greg",
    "timestamp" : "31:50-31:54"
  },
  {
    "timestamp" : "31:55-32:16",
    "speaker" : "Andy",
    "text" : "Yeah, there's a lot of those just like stories that are under the radar that you don't even realize are happening. Yeah. Um I mean, because wasn't there a thing with the Panthers running backs too? So I remember Steven Davis went down in the Rams game and got hurt. And then who was the the second?"
  },
  {
    "timestamp" : "32:17-32:18",
    "speaker" : "Bobby Bridges",
    "text" : "Deshaun Foster."
  },
  {
    "timestamp" : "32:18-32:20",
    "text" : "Yes, Deshaun Foster. That's right.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "32:20-32:23",
    "speaker" : "Bobby Bridges",
    "text" : "It was always kind of the like change of pace back."
  },
  {
    "timestamp" : "32:23-32:28",
    "speaker" : "Andy",
    "text" : "Yeah. He's kind of like the uh the the Kevin Falk of the Panthers, I would say."
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "Yeah.",
    "timestamp" : "32:28-32:29"
  },
  {
    "speaker" : "Andy",
    "text" : "Bit of like a third down.",
    "timestamp" : "32:29-32:30"
  },
  {
    "timestamp" : "32:30-32:40",
    "speaker" : "Bobby Bridges",
    "text" : "Never quite lived up to The hype. But he had his moments. He had a sweet T D in this game. I thought so. He had a like reaching over the pylon T D, didn't he?"
  },
  {
    "text" : "Yep. He had one where like we thought he had him down. He ran into like two guys and then burst out of it and ran really touchdown.",
    "speaker" : "Steve",
    "timestamp" : "32:40-32:46"
  },
  {
    "timestamp" : "32:46-33:00",
    "text" : "Yeah, they they showed a stat where um the Patriots hadn't given up a touchdown all season of more than 30 yards, and they did it twice in this game. And that was one of them, was that The Deshaun Foster touchdown right.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "Yeah, I mean that was the character of that team. It was just like back's against the wall, not everything's gonna go right. We're not the best team on the field in a lot of games, but somebody's gonna step up when needed and make a play.",
    "timestamp" : "33:00-33:13"
  },
  {
    "text" : "I guess they just didn't make uh one more play enough in this game, Bobby. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "33:13-33:17"
  },
  {
    "text" : "I mean, what'll haunt me forever is uh I mean, at the end of the day, if John Casey doesn't kick that that ball out of bounds, I mean I felt like momentum was swinging our way. Like I'll I'll take that game to overtime any fucking day. I'll roll that I would have rolled the dice on overtime in that game. Any fucking day. Come on, John Casey. Come on. Seriously? You kicked it out of bounds and gave Brady 30 yards to go? God damn it.",
    "speaker" : "Bobby Bridges",
    "timestamp" : "33:17-33:44"
  },
  {
    "timestamp" : "33:44-33:46",
    "speaker" : "Andy",
    "text" : "This is Tom, Brady. He was gonna do that anyway."
  },
  {
    "timestamp" : "33:47-33:48",
    "speaker" : "Bobby Bridges",
    "text" : "That's probably true."
  },
  {
    "text" : "Yeah. I mean he's a very good thing.",
    "timestamp" : "33:48-33:49",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:49-34:00",
    "text" : "But not then he's coming from. But not then, yes. In in 2015, sure. But 2003, Tom Brady, not. And that game? That's not what that game felt like.",
    "speaker" : "Bobby Bridges"
  },
  {
    "text" : "I don't know. I think the Rams felt the same way.",
    "timestamp" : "34:00-34:03",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, yeah, until Steve Smith cut their fucking throats in double overtime.",
    "timestamp" : "34:04-34:07",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:08-34:14",
    "text" : "That's true. But I mean you you can say that, but like The Patriots had driven down the fields the last three, four."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "34:15-34:17",
    "text" : "Tom Brady had like 350 yards passing at that point. Yeah."
  },
  {
    "timestamp" : "34:18-34:22",
    "speaker" : "Andy",
    "text" : "Guys, we can agree to disagree on this. Both teams were were picking up yards in chunks at this point."
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "We can agree to disagree. I'm just saying falling apart. I'm just saying that game should have gone to overtime and I liked our chances. Yeah.",
    "timestamp" : "34:22-34:29"
  },
  {
    "text" : "You guys did play a lot of overtime games that year.",
    "speaker" : "Andy",
    "timestamp" : "34:29-34:31"
  },
  {
    "text" : "Exactly.",
    "timestamp" : "34:32-34:32",
    "speaker" : "Bobby Bridges"
  },
  {
    "timestamp" : "34:33-34:49",
    "speaker" : "Andy",
    "text" : "But I mean you say that, but the Patriots also coming into this, they were what 16 wins in a row or something? And they had won all of those games except for one by less than seven points. So both were teams that knew how to win close."
  },
  {
    "timestamp" : "34:53-34:54",
    "speaker" : "Bobby Bridges",
    "text" : "Uh at face value."
  },
  {
    "timestamp" : "34:54-34:54",
    "speaker" : "Steve",
    "text" : "For sure."
  },
  {
    "speaker" : "Andy",
    "text" : "Absolutely. Kind of that strong veteran defense almost it felt like.",
    "timestamp" : "34:55-34:59"
  },
  {
    "text" : "In the past, overcoming all those injuries. Yeah, yeah. That was incredible earlier this year where everybody down and they're still just reeling off wins.",
    "speaker" : "Steve",
    "timestamp" : "35:00-35:08"
  },
  {
    "timestamp" : "35:08-37:17",
    "speaker" : "Andy",
    "text" : "There was some stat where The Patriots were leading the league in most different starters with like 40 something. And and they showed a list of all the other teams who had led the league in starters. And I think the most wins on the season was four for those teams that that suffered that many injuries and had to start so many players. And the Patriots went, what would they go this season? I don't even remember. Well, fourteen and two. So just like figuring out how to plug guys in and it all worked out Um but I think the one guy that they couldn't plug and play was uh Rodney Harrison, actually, who this was one of my memorable moments from the game where he was He made it it's in the fourth quarter at some point. Oh, it was it was on that last uh Carolina touchdown drive where Rodney made the tackle of the running back and apparently like broke his arm or like separated his shoulder or something like that. I can't remember what exactly what the injury was. Greg, do you remember? I do not remember. I just remember him being in the sling um after the game. But so he broke his arm, but Carolina was running the no-huddle, so he couldn't get off the field. So he was then in coverage on the next play on, I think it was the tight end, and they threw it to him. The tight end caught the ball. He had to make the tackle out of bounds with a broken arm and still managed to make the play and then just kind of like laid there out of bounds. Which is like one and then I remember there was some camera shot of him coming out like after the confetti was falling in a sling and he's just like covered in confetti and he's like crying because it's Rodney Harrison and he just runs on emotion. So but as soon as he went out after that, the Panthers are just like, oh well whoever that new guy is, which I didn't even recognize who he was. It's like number 29 or something. Couldn't even figure out who he was on the the game sheet. But he was he was not good. And the pagers just picked him apart with Ricky Prol of all people."
  },
  {
    "text" : "Ricky Pro, another key member of that scrappy team.",
    "speaker" : "Bobby Bridges",
    "timestamp" : "37:18-37:22"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:23-37:56",
    "text" : "Yeah, I mean, and he was he he was one of those guys who always seemed to show up against the Patriots in Super Bowls. Because This is actually gonna be one of my bests at the end, but uh I'll put it in here because it fits. He in this game caught the tying touchdown. Like to tie the game up with less than two minutes left Um and he also did the exact same thing when he was a member of the Rams in Super Bowl 36. He was the one that caught the tying touchdown with under two minutes left. And then the Patriots did what they did then as well."
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "Yep.",
    "timestamp" : "37:57-37:57"
  },
  {
    "speaker" : "Andy",
    "text" : "So Ricky Prohl, I think he may have also been the guy at the beginning of the Rams Super Bowl to be like tonight a dynasty is born. Yes, he is. Yep. Just didn't realize which team he was talking about at the time.",
    "timestamp" : "37:57-38:09"
  },
  {
    "text" : "He must hate the Patriots. He really must.",
    "speaker" : "Steve",
    "timestamp" : "38:09-38:11"
  },
  {
    "timestamp" : "38:11-38:25",
    "speaker" : "Andy",
    "text" : "Yeah. Um also, while because he's just next to Ricky Prol on my list here of Panthers players. Bobby, do you have any um Feelings one way or another on Jermaine Wiggins?"
  },
  {
    "text" : "Nope, zero feelings. He was one of those guys that floated in the background for a while. Another guy who like always kind of flashed like, maybe he'll be kind of good. And nope.",
    "timestamp" : "38:26-38:36",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because he was a former patriot, and that's how we felt about him too. And now he's uh like on one of the sports radio morning shows. Wiggy. Good for him. He is unlistenable. I uh I didn't know he was in this game. Uh for the Panthers, yeah. He had a couple of catches like right at the end there. He used the one that hurdled Eugene Wilson, Greg's boy. Yeah. Wilson did not have a good game in this game. Sorry to say, Greg. It's okay. No comments? Does he sound okay? He doesn't, does he?",
    "timestamp" : "38:37-39:13"
  },
  {
    "speaker" : "Greg",
    "text" : "No comment.",
    "timestamp" : "39:14-39:15"
  },
  {
    "speaker" : "Andy",
    "text" : "Fair enough. Because he's the one that got beat on the uh the 85 yard touchdown.",
    "timestamp" : "39:16-39:22"
  },
  {
    "text" : "Oh yeah, that longest play in Super Bowl history.",
    "speaker" : "Steve",
    "timestamp" : "39:23-39:26"
  },
  {
    "timestamp" : "39:26-39:27",
    "text" : "Is it still?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yes, I looked it up.",
    "timestamp" : "39:27-39:28"
  },
  {
    "text" : "No. As long as play from scrimmage it has to be because I remember the touchdown, I guess. It is. No, because the Patriots had in their Super Bowl in 97 gave up like a 99-yard kick return to whoever that Green Bay Packers returner was. Desmond Howard. Desmond Howard, yeah.",
    "speaker" : "Andy",
    "timestamp" : "39:28-39:44"
  },
  {
    "timestamp" : "39:44-39:52",
    "speaker" : "Steve",
    "text" : "Okay. Kick returns as Greg has has said, special teams aren't really a part of the game, so that doesn't count. It's true."
  },
  {
    "timestamp" : "39:53-40:03",
    "speaker" : "Bobby Bridges",
    "text" : "Yeah, it was definitely the longest something or another at the time it happened. It was what? It was the longest something at the time it happened."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:03-40:07",
    "text" : "It is still the longest touchdown pass or run in Super Bowl history. Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:08-40:14",
    "text" : "Against like one of the historic best defenses in the National Football League."
  },
  {
    "text" : "Well Delon didn't even complete 50% of his passes. No.",
    "speaker" : "Steve",
    "timestamp" : "40:15-40:18"
  },
  {
    "timestamp" : "40:20-40:33",
    "text" : "No, he started off terribly in this game. I think I was trying to keep track. Um they didn't actually have positive offensive yards um with five minutes left in the in the second half, in the second quarter.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "Yeah, the beginning of the game was brutal.",
    "timestamp" : "40:33-40:36"
  },
  {
    "timestamp" : "40:37-40:48",
    "speaker" : "Andy",
    "text" : "Yeah, he was one for nine for one yard with two minutes left in the second quarter. And like three sacks or something like that. So he had technically I think he had negative passing yards."
  },
  {
    "text" : "Classic Jake Delone.",
    "timestamp" : "40:47-40:48",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. So I mean, what did he finish with? He finished with probably a few hundred yards.",
    "timestamp" : "40:49-40:53"
  },
  {
    "timestamp" : "40:53-41:00",
    "speaker" : "Steve",
    "text" : "Oh yeah. 23, 20 yards, over 20 yards per completion. 16 completions for 323 yards. Jesus."
  },
  {
    "speaker" : "Andy",
    "text" : "And three touchdowns. Four sacks, one of which was a fumble which he lost.",
    "timestamp" : "41:00-41:04"
  },
  {
    "text" : "You gotta think the man can live with that. That's that's how he showed up in the Super Bowl. You gotta think Uh you know, he's got these forces in Lafayette in Louisiana somewhere and he's his mind is at peace.",
    "timestamp" : "41:04-41:17",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Andy",
    "text" : "You would have to think so, yeah. Because I mean they didn't have really any offense going. They they couldn't get the running game going either. Steven Davis was he had a bad day.",
    "timestamp" : "41:18-41:26"
  },
  {
    "timestamp" : "41:26-41:30",
    "text" : "No, and they were they were a really run-oriented team.",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:29-41:44",
    "text" : "Right, exactly. And they kept trying it. Uh Steven Davis, 13 carries, 49 yards, with the longest of 21. So not not great. And then Deshaun Foster, three carries, 43 yards, but one of those was a 33 yard touchdown."
  },
  {
    "text" : "Yeah, this was really before the era when you're tossing a lot of passes to your your running back.",
    "timestamp" : "41:44-41:49",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:49-41:57",
    "text" : "Yeah. So it was it was mainly Jake Delome to Steve Smith and Musha Muhammad."
  },
  {
    "speaker" : "Steve",
    "text" : "Can we talk about Antoine Smith's stat line by the way? 26 carries.",
    "timestamp" : "41:57-42:01"
  },
  {
    "text" : "26 carries, 83 yards and a touchdown.",
    "speaker" : "Andy",
    "timestamp" : "42:02-42:04"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "42:04-42:06",
    "text" : "Touchdown. Hell yeah."
  },
  {
    "timestamp" : "42:07-42:30",
    "text" : "Touchdown. He was sneaky good in this game. He was, yeah. The Patriots running game was actually because it started off real slow. But Antoine Smith, again, we've said it the last couple of weeks, is running like it's 2001 again, because he has been Like the wheel had fallen off through the regular season. I don't know if they were saving him or what, but he was actually running it relatively effectively in this game. game.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "42:30-42:40",
    "text" : "Especially against that D-line too. Everyone thought they were absolutely tough. They couldn't run it all year. Yep. And then the Panthers have a monster D-line. For him to get 83 yards and a touchdown. Huge.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "42:40-42:50",
    "text" : "Yeah. Uh quick question on uh what you boys thought about our Lord and Savior Troy Brown in this game. Oh, big Troy Brown game.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "42:50-42:56",
    "speaker" : "Steve",
    "text" : "You know, this is a big game for both my favorite receivers, Troy and David Gibbons. David yeah, David Gibbons had a had a good game."
  },
  {
    "timestamp" : "42:56-43:02",
    "text" : "I mean, Dion Branch had the numbers, 10 catches, 143 yards, and a touchdown.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, it didn't seem like Dion Dion seemed like the third best receiver out there.",
    "timestamp" : "43:02-43:06",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, and the commentators were talking about how he was the he was Brady's new like favorite target. Which everyone's like, you know, you'd expect it to be Troy Brown, but Brady says it's it's Dion Branch because, you know, for whatever reason, he's small, but he's strong. Um, and then you get to the last drive of the game, and it's incomplete to Dion Branch, Brady Detroit Brown, Brady Detroit Brown, Brady Detroit Brown, Brady to Graham, and then Brady Branch.",
    "speaker" : "Andy",
    "timestamp" : "43:06-43:36"
  },
  {
    "text" : "So yeah, well you're just discounting the most important play of that drive is Brady Branch.",
    "timestamp" : "43:36-43:42",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "43:42-43:43",
    "speaker" : "Andy",
    "text" : "Yeah, that's true. Greg has got a good play."
  },
  {
    "text" : "That's the game that won the Super Bowl.",
    "timestamp" : "43:44-43:45",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, but if you look at that play Uh they're both on the same side. They were both wide open.",
    "timestamp" : "43:47-43:53",
    "speaker" : "Andy"
  },
  {
    "text" : "So he could have hit he could throw at the branch is because his favorite player said it's open deeper down the field. Brady's Brady's favorite player is not dictated by Brady. It's it's up to him who his favorite player is. And he told the commentators it was Branch.",
    "timestamp" : "43:53-44:08",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And I disagree.",
    "timestamp" : "44:08-44:10"
  },
  {
    "text" : "And you disagree with Brady as to who Brady's favorite player is.",
    "timestamp" : "44:10-44:14",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Well think about Branch's stat lines in his two Super Bowls here back to back years.",
    "timestamp" : "44:14-44:18"
  },
  {
    "text" : "Yeah, it's pretty crazy.",
    "timestamp" : "44:19-44:20",
    "speaker" : "Greg"
  },
  {
    "text" : "Ten catches, one forty-three, and a touchdown in this one, and then he wins the MVP in the next one.",
    "timestamp" : "44:20-44:24",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:24-44:29",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. I think he sets the the record for catches in the next one, isn't that what it is?"
  },
  {
    "speaker" : "Steve",
    "text" : "Something like that.",
    "timestamp" : "44:29-44:30"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:30-44:50",
    "text" : "In a Super Bowl. Yeah But yeah, there's there's some good uh good wide receiver play on both ends of the ball, really. Like on both sides. Yeah. Like the yeah, it was because usually you see the Patriots kind of spread the ball around. Um and Brady's favorite receiver is the open one, but in this one it was pretty much all wide receivers, I thought."
  },
  {
    "text" : "It really was. Didn't do like a lot of screen or any any bubble screens either. It was all passes down the field.",
    "speaker" : "Steve",
    "timestamp" : "44:50-44:56"
  },
  {
    "text" : "Yeah, which was very unusual. And it sounded like And Bob, correct me if I'm wrong. It sounds like the uh the Panthers relied on a lot of screens in the regular season as well. Similar to the Patriots offense.",
    "timestamp" : "44:56-45:10",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:11-45:27",
    "text" : "Yeah, I mean I I think there were a lot of similarities. Um like they were a running team and then I mean they lived on they they made their money on play action and like Steve Smith bailing them the fuck out, you know, and do pulling out crazy shit.",
    "speaker" : "Bobby Bridges"
  },
  {
    "timestamp" : "45:27-45:28",
    "speaker" : "Andy",
    "text" : "Yeah, so they're very similar."
  },
  {
    "speaker" : "Greg",
    "text" : "There's uh there's somebody wrote down from the first quarter, it was third and sixth and they ran the ball. And and Sim said, I know it's not exciting to watch, but it's kind of fun. And I was like, well No, it's not exciting and it's not fun either.",
    "timestamp" : "45:29-45:45"
  },
  {
    "timestamp" : "45:46-45:48",
    "text" : "Oh, we go into the commentators?",
    "speaker" : "Steve"
  },
  {
    "text" : "Also pre-saging Phil Sims eventually getting the axe for being fucking boring as hell. Yeah, he was pretty bad.",
    "speaker" : "Bobby Bridges",
    "timestamp" : "45:48-45:56"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "45:56-46:04",
    "text" : "I don't know. He called Julius Peppers being a beast. I mean Julius Peppers is his second overall pick. Yeah. It's not really a reach."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "46:05-46:09",
    "text" : "Virg, I thought you would have been up about him roasting Bill Belchak's squib kick decision."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "46:09-46:21",
    "text" : "Hey double, that was a terrible decision. And he was a kick. He was pretty butter about that. Ver Yeah, I'm sure you were too. I was too, yeah. I was dumb. You should take Belichick to task for that, dude."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, give it to us. Give it give us the uh the Greg Brown Belichick hate minute.",
    "timestamp" : "46:21-46:26"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "46:26-46:34",
    "text" : "Well what was how much time was left? There was like fifteen seconds left in the half. You just you just gone up 14 to 7."
  },
  {
    "speaker" : "Andy",
    "text" : "Mm-hmm.",
    "timestamp" : "46:34-46:35"
  },
  {
    "timestamp" : "46:35-47:01",
    "speaker" : "Greg",
    "text" : "The Panthers have been like absolutely dominated the whole half with the at like the two-minute warning. They had like zero total yards. Yeah. The one was like one of nine up to that point. Like you had absolutely shit pumped them the whole half and it was 14 to 7. And for some reason, instead of just kicking it deep, they do this stupid squib kick. Which gets returned to like midfield, one play later, it's a 50-yard field goal and it's good. And then you go in without momentum."
  },
  {
    "timestamp" : "47:01-47:09",
    "text" : "I I think you're kind of uh glossing over the fact that that one play was just like a run up the middle. The Patriots just did not defend.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, if that play happens from your 20-yard line, it doesn't matter. Like when does a kick ever get to the fucking 50-yard line? Just play the odds. Play the numbers. It doesn't make any sense. Do your job, Belichick.",
    "timestamp" : "47:09-47:22"
  },
  {
    "text" : "Some would say. We've seen the Colts kick off to the Patriots in this exact situation, and Bethel Johnson takes to the house. That's a good point, Andy. So I think he is playing the numbers. As long as that doesn't happen, we're okay. Field goal, yeah, okay. We're still winning. You you think he's okay with giving up field goal there? Probably not, but I think he in the in the moment that decision was the right decision because there's l the least amount of chance of of giving it. All right.",
    "speaker" : "Andy",
    "timestamp" : "47:23-47:50"
  },
  {
    "timestamp" : "47:53-48:01",
    "text" : "And I want to get Bobby's thoughts on this. was the Panthers going for two somewhat early in the fourth quarter because Phil Sims hated that Sims hated it.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "48:01-48:08",
    "text" : "I was like the first thing he said at the end of the game was like, well they'll be second guessing that. I was like what Yeah he brought it back to shit on him again.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "48:10-48:39",
    "text" : "So let's set it up, right? It's 1248 left in the fourth quarter. Deshaun Foster's sick-ass touchdown makes it 21-16. Yeah. Yeah, I think all three timeouts left. So it was a fair whole quarter to play. A lot of football left, yeah. Kicking it puts you down what? Four going for two gets you in within three. So they go for two and don't get it, so they're down five."
  },
  {
    "text" : "Correct. I mean, there's two schools of thought here. Like, there's the school of thought of like don't go for two until you have to. But in the context of this game, I have mixed feelings. In the context of this game, I kind of liked it because I was just like, your point scoring opportunities have been really limited so far. Maximize them. Get within three. Hell yeah. So I think it made sense ultimately. That said, the other part of my brain says. . Motherfuckers, you don't have an offense to get a two-point conversion in this game. And they didn't. That's true. Like you weren't like this ain't Philly special. You didn't have a play in your back pocket And so it was it was maybe maybe sort of like from a strategic standpoint the right call, except you you weren't you weren't equipped to win on it. So I don't know.",
    "timestamp" : "48:40-49:34",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, the the play did not look good.",
    "timestamp" : "49:35-49:37"
  },
  {
    "timestamp" : "49:41-49:42",
    "speaker" : "Andy",
    "text" : "Oh, I know it's right."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that's the difference in the coaching stats, right?",
    "timestamp" : "49:42-49:45"
  },
  {
    "timestamp" : "49:45-49:51",
    "speaker" : "Andy",
    "text" : "Belichick had a play for a two-point conversion when they guarantee that they had practiced multiple times."
  },
  {
    "speaker" : "Greg",
    "text" : "Correct.",
    "timestamp" : "49:51-49:52"
  },
  {
    "timestamp" : "49:52-49:57",
    "text" : "Even though this was their first two-point conversion attempt of the entire season.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "49:57-50:02",
    "text" : "And remembering that team and John Fox, I fucking guarantee the Panthers did not.",
    "speaker" : "Bobby Bridges"
  },
  {
    "timestamp" : "50:03-50:03",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "I had a quite is this the first direct snap to Kevin Falk?",
    "timestamp" : "50:03-50:07",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh no, no. They've been running this uh since the Bloodsoe days. Oh really? Oh yeah.",
    "speaker" : "Andy",
    "timestamp" : "50:07-50:14"
  },
  {
    "timestamp" : "50:14-50:16",
    "speaker" : "Greg",
    "text" : "You never read Andy's blog post?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:16-51:09",
    "text" : "Yeah, there's a blog post about it. The uh Evolution of a play. Yeah. It's been around for ages and they always seem to break it out like when they need it the most. Yeah. Um, and it was here. Uh they did it in 2006. When they needed two points against the uh Chargers in the Marlon McCree Troy Brown interception fumble game. Um they did it in the Falcon Super Bowl with James White. They did it in 07 where they actually faked it. They snapped it to Brady. Brady pretended like it went over his head, even though he had the ball. And so they faked the run and then Brady threw a touchdown. So they've uh they've run this play a lot, but it's like it's that absolutely have to have this point play. Whereas I think beforehand, like back in the Bloods of the Days, they'd run into midfield just for shits and giggles."
  },
  {
    "speaker" : "Steve",
    "text" : "Um which came off the heels of the varabel touchdown that I think everybody associates this game with on some level.",
    "timestamp" : "51:10-51:17"
  },
  {
    "text" : "Yeah, I I still think um this is my hot take for this game. Mike Vrabel should have been uh Super Bowl MVP He had two sacks. He had a strip sack, which set up the first Patriots touchdown, and he caught a touchdown as a defensive player. How do you not give him MVP? I agree. Just because it goes to the quarterback.",
    "timestamp" : "51:17-51:37",
    "speaker" : "Andy"
  },
  {
    "text" : "As a non-Patriots fan. For some reason Mike Vrabel is one of the guys from that era that sticks out in my mind so much, maybe subconsciously because of this game.",
    "timestamp" : "51:37-51:47",
    "speaker" : "Bobby Bridges"
  },
  {
    "text" : "Yeah. And uh and he caught what eight touchdowns in his career or something like that? Yeah. I think he had eight passes. Uh eight receptions on eight attempts uh for eight touchdowns. I bet the tight ends love that. With like nine yards. But Yeah, and they also I thought it was interesting the commentators were talking about Mike Vrabel saying I think it was after he caught the touchdown maybe? uh that he aspires to be a coach someday and wants to go back to Ohio State and is hoping that they would give him a uh like assistant coaching job after he finishes playing.",
    "timestamp" : "51:47-52:20",
    "speaker" : "Andy"
  },
  {
    "text" : "And he was said that if he ever was to become a coach that if his team made the Super Bowl, he would cut off his penis.",
    "speaker" : "Greg",
    "timestamp" : "52:22-52:28"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "He did say that. I think that was later. Yeah. Wait, when did he also mind the dream two seasons ago?",
    "timestamp" : "52:29-52:37"
  },
  {
    "text" : "That was a thing. Yeah, he's like I cut off my own dick to to get Zoom.",
    "timestamp" : "52:38-52:42",
    "speaker" : "Andy"
  },
  {
    "text" : "Not said when he was twenty-five year olds. Said said two years ago as head coach of an NFL franchise.",
    "timestamp" : "52:42-52:47",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:48-52:59",
    "text" : "Yeah, as a young twelve-year-old boy, he If I ever leave the the Houston Oilers to the Super Bowl, cut off my penis. And then of course they got renamed as the Titans."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah Oh boy. Yeah, so do we wanted to do the commentators, Steve? I know you said you had some notes. I I've already settled all of my notes. Really?",
    "timestamp" : "52:59-53:11"
  },
  {
    "timestamp" : "53:11-53:26",
    "speaker" : "Steve",
    "text" : "Because I had one more. Uh Phil Sims blaming Ty Law for the blown coverage on the touchdown when it was Asante Samuel. Yeah, yeah, it definitely was. I'm sure Greg was Greg was mad about that, but happy that he called out Bill Belchak for a shitty squib quick. Yeah, exactly."
  },
  {
    "text" : "Um I the the one other quote that I had was um Phil Sims saying, neither team is big on celebrating or trash talking. I'm thinking to myself, have you met Steve Smith and or Rodney Harrison? Like that's their own.",
    "speaker" : "Andy",
    "timestamp" : "53:26-53:40"
  },
  {
    "timestamp" : "53:41-53:44",
    "text" : "You're protecting yourself on this game. Right.",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Andy",
    "text" : "Like, what the fuck, dude? Like both of them, that's all they do is trash talk the entire fucking time.",
    "timestamp" : "53:45-53:51"
  },
  {
    "timestamp" : "53:51-53:56",
    "speaker" : "Steve",
    "text" : "Greg Gumble did call Adam Benateri's game-winning field goal. I don't know if you caught that too."
  },
  {
    "timestamp" : "53:56-53:57",
    "speaker" : "Andy",
    "text" : "Oh I missed that. What did he say?"
  },
  {
    "text" : "He's like, oh maybe you'll have a an opportunity to redeem himself and kick kick for the win.",
    "speaker" : "Steve",
    "timestamp" : "53:57-54:01"
  },
  {
    "timestamp" : "54:01-54:01",
    "text" : "Oh yeah, yeah, yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:02-54:03",
    "speaker" : "Steve",
    "text" : "That was before the Rables T D."
  },
  {
    "timestamp" : "54:04-54:14",
    "speaker" : "Andy",
    "text" : "Yeah. Um all right, since we're not gonna trash on the commentators, though, how about we trash on the referees? Because this was an Ed fucking hockey league game. Made it all about him."
  },
  {
    "text" : "I didn't notice referees at all. I thought they were perfectly fine.",
    "speaker" : "Steve",
    "timestamp" : "54:14-54:17"
  },
  {
    "text" : "No, how many penalties were? There was a shit ton. There was uh New England, eight penalties for 60 yards. Carolina, 12 penalties for 73 yards. I'd say a good half of those were Tiki Tac. They were just like fucking Ed Hawkley wanted to hear himself talk, wanted to be fucking uh major league baseball umpire taking control of the game or like a fucking NBA basketball referee being this this the center of attention.",
    "timestamp" : "54:17-54:40",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:40-54:46",
    "speaker" : "Bobby Bridges",
    "text" : "I do vaguely remember there being periods of this game that were frustrating with lots of penalties."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:46-54:57",
    "text" : "I remember I think Andy's butthurt. No. I mean, well, all right. Let's go. Let's go to the the last one, the Detroit Brown offensive pass interference. You're gonna tell me that was a legit call?"
  },
  {
    "speaker" : "Steve",
    "text" : "There's one stretch where I was like, this is getting out of hand where they had a measurement three plays in a row and then called a challenge after the third measurement. And like that was in the first quarter or the first half when the game was just a slog fest anyways and like three straight",
    "timestamp" : "54:57-55:14"
  },
  {
    "timestamp" : "55:14-55:27",
    "text" : "plays with the like okay come on measure it out and you're just like oh fuck not again it's not exciting but it's kind of fun to watch yeah I mean it it is interesting too like",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "55:28-55:36",
    "speaker" : "Bobby Bridges",
    "text" : "You know, shortly after this is when the NFL uh changed the um illegal contact rule"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "55:37-55:37",
    "text" : "Yes."
  },
  {
    "timestamp" : "55:37-55:57",
    "text" : "And like that Panthers, Eagles, NFC Championship got often cited as a game that caused them to change the rule when like I mean, I haven't gone back and watched it, but it seems pretty clear that in retrospect, like the Panther secondary, like absolutely fucking robbed the Eagles in that game and was just like fuck them up at every moment.",
    "speaker" : "Bobby Bridges"
  },
  {
    "timestamp" : "55:58-55:58",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "And that that game was often cited as the one of the key exhibits for the NFL to like change the illegal contact rules. And it makes you wonder if in the immediate aftermath there wasn't some sort of conversation about that chip.",
    "speaker" : "Bobby Bridges",
    "timestamp" : "55:58-56:12"
  },
  {
    "text" : "I think if that's exhibit A, then exhibit B is uh The Patriots Colts game where the the Patriots defense just manhandled that red hot Colts offense.",
    "timestamp" : "56:12-56:23",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "Yep.",
    "timestamp" : "56:24-56:24"
  },
  {
    "timestamp" : "56:24-56:33",
    "text" : "And so yeah, I think and that was the two what Conference championship games, both of those? So you basically have this defense.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It's interesting. Ricky Manning had three picks in that game and Ty Law had three picks in the past game. Oh shit. We call it the Ricky Manning Ty Law rule.",
    "timestamp" : "56:34-56:43"
  },
  {
    "speaker" : "Andy",
    "text" : "God damn. So this this kind of like these two teams are very kind of parallel to each other. Which makes sense why it was such a close scoring game.",
    "timestamp" : "56:43-56:54"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "Are we I just gotta ask, are we talking about the halftime show at all?",
    "timestamp" : "56:54-56:57"
  },
  {
    "text" : "Oh yeah, I was just looking at the.",
    "speaker" : "Andy",
    "timestamp" : "56:57-57:00"
  },
  {
    "timestamp" : "57:00-57:01",
    "speaker" : "Bobby Bridges",
    "text" : "Oh, is that this one?"
  },
  {
    "text" : "So I th yeah.",
    "speaker" : "Steve",
    "timestamp" : "57:01-57:02"
  },
  {
    "speaker" : "Andy",
    "text" : "I wanted to say that this is the uh the the triple X uh Super Bowl that was in the XXX range of Super Bowls because they no longer are. Because this is 39, so XXX V III 38, yeah. So we're getting close to the the front.",
    "timestamp" : "57:03-57:21"
  },
  {
    "timestamp" : "57:22-57:23",
    "text" : "Fucking Temborough Lake, man.",
    "speaker" : "Bobby Bridges"
  },
  {
    "timestamp" : "57:24-57:28",
    "speaker" : "Andy",
    "text" : "Yep. So yeah, Greg, did I I kind of just assumed you had notes on this."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "57:29-57:59",
    "text" : "It's just so audacious that they could even think to call this a wardrobe malfunction. She had a tassel around her nipple. So what are we talking about here? I'm not sure. She just wears those under her clothes without the intention of showing them. I have tassels on my nipples, Greg. Can you milk me? People just like bought it too. No one everyone was like, okay, wardrobe malfunction. What are you trying to accomplish?"
  },
  {
    "text" : "I mean, the last line in the song is I'm gonna have you naked by the end of this song. Come on, people. Come on, people.",
    "speaker" : "Bobby Bridges",
    "timestamp" : "57:59-58:06"
  },
  {
    "text" : "And then he grabs he grabs like a piece of clothing right right in her her her breast area and pulls it. What what if it was if it didn't malfunction, what was supposed to happen?",
    "timestamp" : "58:06-58:16",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:16-58:32",
    "speaker" : "Steve",
    "text" : "This is probably my defining memory of this as a kid, because we had TiVo And it had just gotten feebles. Oh, thank God. We were like, what did I just watch? Wow, this thing is the best. We just rewinded that shit like a million times."
  },
  {
    "text" : "So I was at college watching this too, and we were all in like the the main common room and we like wheeled the TV in because this was back in the days before like flat screens and shit. So we had the TV like we w wheeled somebody's TV in, whoever had the biggest one. And we're all watching it. And so it was halftime and like everybody else left to like, you know, go pee or grab some food or more drinks or whatever. And so I'm sitting there watching this thing by myself alone in in this like empty room. And that happens. I'm like Oh did that did did I just see boob on live TV and I had nobody to validate it with me. Like I I don't know and this is like kind of before like live internet's happening. So you can't go on Twitter and find out. You can't go on Twitter and and like ask people. So you're like, I think it's just a boob on TV. And so everybody came back. I'm like, guys, you missed it. There was boobs on TV at the halftime show. And they're like, yeah, go fuck yourselves. Wow. Like we're so we're sticking your shit already.",
    "timestamp" : "58:32-59:25",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "59:25-59:44",
    "speaker" : "Bobby Bridges",
    "text" : "Like Yeah, what a strange moment. A viral moment before viral moments were things. And like I just remember it as like it kinda happened and then there was like this pause and then they like the lights went out. Yep. And it was just like, wait. Everyone just looked at them each other and be like, did I just like Andy was, did I just see that?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "59:44-59:48",
    "text" : "Or was that nipple? No, and that's signable."
  },
  {
    "timestamp" : "59:49-59:51",
    "speaker" : "Bobby Bridges",
    "text" : "The question is obviously staged."
  },
  {
    "timestamp" : "59:51-01:00:09",
    "speaker" : "Greg",
    "text" : "Right, but how far up did it go? Like obviously Janet Jackson and Justin Timberlake knew it was happening. Did the show producers know it was happening? Did the NFL know it was happening? Did the people that had commercials? They could have told Phil Sims if you have no clue."
  },
  {
    "text" : "That's true, yeah. Maybe he's talking about boobies.",
    "speaker" : "Steve",
    "timestamp" : "01:00:17-01:00:19"
  },
  {
    "text" : "He knows he's talking about you know he knew it was coming. Fucking Phil sad Oh boy. Yeah, I mean I think uh ballsy move though.",
    "timestamp" : "01:00:19-01:00:30",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:00:30-01:00:41",
    "text" : "I I gotta give it props. You know, I think I think if they uh just If they were just if they just leaned into it and were they were like, yeah, you saw what you saw. Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "What do you how do you like that shit?",
    "timestamp" : "01:00:41-01:00:43"
  },
  {
    "text" : "We'll put that on the Super Bowl for you. I would have loved it. But the fact that they immediately tried to walk it back and be like, no malfunction. It's like, come on. You can't like commit and then backtrack immediately. Yeah. Yeah. Back then they probably would have been. What's wrong with a little nipple? It's it's it's very European. Just be like you guys aren't cultured enough. You know what it is?",
    "timestamp" : "01:00:43-01:01:03",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know if the world was ready for that in 2000.",
    "timestamp" : "01:01:03-01:01:05"
  },
  {
    "timestamp" : "01:01:06-01:01:19",
    "speaker" : "Bobby Bridges",
    "text" : "before Greg. Yeah. Still let's not pretend Justin Timberlake didn't tuck that shit right onto his resume. This was this was building a brand before building a brand was a thing. Bob's got a great point here."
  },
  {
    "timestamp" : "01:01:19-01:01:30",
    "speaker" : "Andy",
    "text" : "Yeah. Although Greg, you know, you know why why they didn't uh cop to it? It's because it was uh very naughty Yeah. Very and uh our our boy."
  },
  {
    "speaker" : "Mom",
    "text" : "What is Justin Timberlake, Andy?",
    "timestamp" : "01:01:31-01:01:32"
  },
  {
    "speaker" : "Andy",
    "text" : "Our boy Justin Timberlake.",
    "timestamp" : "01:01:32-01:01:33"
  },
  {
    "speaker" : "Mom",
    "text" : "Sometimes a naughty boy.",
    "timestamp" : "01:01:34-01:01:35"
  },
  {
    "text" : "He is.",
    "timestamp" : "01:01:35-01:01:36",
    "speaker" : "Andy"
  },
  {
    "text" : "He's it's been back in the news because uh the Britney Spears documentary. Oh yeah apparently it doesn't shine very uh good light on Timberlake, so he is He was apologized for both that and the Janet Jackson. I'd heard that, yeah. Apparently he said he was trying to compete with Uh Madonna, Christina Aguilera, and Britney Spears kissed at the MTV music awards. Oh, that's right, yeah. Remember that? I mean formulative years there.",
    "speaker" : "Greg",
    "timestamp" : "01:01:39-01:02:12"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "This is consistent with how we perceive Mr. Timberlake. We just it would be great if he could just be honest about these things.",
    "timestamp" : "01:02:14-01:02:20"
  },
  {
    "timestamp" : "01:02:20-01:02:22",
    "speaker" : "Greg",
    "text" : "Uh-huh. Yeah. I agree."
  },
  {
    "timestamp" : "01:02:23-01:02:29",
    "speaker" : "Bobby Bridges",
    "text" : "Stop trying to present yourself as like kind of wholesome, dude. Like that's not how you are."
  },
  {
    "text" : "Yeah. He he never quite got the line right between am I a bad boy or am I America's sweetheart? No man.",
    "timestamp" : "01:02:29-01:02:35",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:02:36-01:02:38",
    "speaker" : "Andy",
    "text" : "He couldn't make his decision, I think."
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "Mm-hmm.",
    "timestamp" : "01:02:38-01:02:38"
  },
  {
    "timestamp" : "01:02:38-01:02:41",
    "speaker" : "Greg",
    "text" : "Yep. He wanted the best of both worlds."
  },
  {
    "text" : "But I think we're he would have thrived on TikTok.",
    "speaker" : "Bobby Bridges",
    "timestamp" : "01:02:41-01:02:44"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:02:44-01:03:01",
    "text" : "For sure. Oh gosh. There's still time. There's still time. Um also uh this is in Houston and then They did a NASA tribute in the pregame is the one year anniversary of the Columbia disaster."
  },
  {
    "timestamp" : "01:03:01-01:03:02",
    "speaker" : "Andy",
    "text" : "Oh sure."
  },
  {
    "timestamp" : "01:03:02-01:03:04",
    "speaker" : "Greg",
    "text" : "One year? Yes. Wow."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:05-01:03:22",
    "text" : "Well, way to bring it down right before I was gonna segue into that um halftime show not being the sexiest thing to happen in this game. You talking about Tom Brady? Uh no, actually. Here, I will share my screen so you gentlemen can can share in this with me."
  },
  {
    "timestamp" : "01:03:22-01:03:25",
    "speaker" : "Steve",
    "text" : "You're saying this is sexier than Janet Jackson's boob."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:25-01:04:09",
    "text" : "It is, yes. Um this is the right after right before the halftime kickoff, there was this gentleman who dressed up as a referee, got to midfield, and then took off the vast majority of his clothes. And went streaking. And then our good friend of the podcast, Matt Chatham. With quite possibly the best tackle of the game. He bodies him. Yeah. This gate uh Matt Chattle with with the the neck roll at this point and like the the arm sleeves and everything, just absolutely The view from the end zone is better. The view from the end zone's best. He's like, oh no, I give up, I give up and match up the bottom. We don't give up in this game."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:04:09-01:04:12",
    "text" : "Well yeah, if Matt Chad doesn't hit him, that Panthers guy's gonna get him."
  },
  {
    "timestamp" : "01:04:12-01:04:14",
    "text" : "And then just kind of like walks.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "But to be clear, so like this like 45-year-old guy, I'm thinking pretty overweight. Um, in a jock strap and a ref's hat. And that's it. Running down the field is sexier than Jan Jackson. No, the hit was sexier. Oh, oh, the hit part of it. Oh, that makes more sense.",
    "timestamp" : "01:04:14-01:04:32"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "I mean Yeah, he got he got fucked up. Yeah.",
    "timestamp" : "01:04:32-01:04:35"
  },
  {
    "timestamp" : "01:04:35-01:04:38",
    "speaker" : "Steve",
    "text" : "Yeah. They had like the Maddox on the field, I think."
  },
  {
    "text" : "I mean, you guys have been rewatching old games, but so you're this is probably your yeah. I'm just like Man, pre-high def. What the fuck is that shit? It might as well have been 1925.",
    "speaker" : "Bobby Bridges",
    "timestamp" : "01:04:41-01:04:51"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, actually, I mean when we Yeah, when we first started, they didn't have the yellow first downline and it was so hard to watch. You're like, wait, yeah. And they they didn't have like the uh the score bug up all the time. It only showed like when the play was starting. Yeah. So you get to be like Where are they on the field? What down is it? I don't even know what's going on right now. So hard to follow.",
    "timestamp" : "01:04:53-01:05:12"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "Yeah, very weird. Just watching that highlight. I was just like, I was distracted by the pixels? Fucking yeah, archaic quality.",
    "timestamp" : "01:05:13-01:05:22"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:05:22-01:05:28",
    "text" : "Like the Monday night footballs and the Sunday Super Bowls, they always have a little bit better quality than the regular season shit. Yep."
  },
  {
    "speaker" : "Greg",
    "text" : "It it's uh I think it's like watching football as like my wife Kelly watches it Where there's no perception of like what down is it, how how much time's left, but like, ooh, exciting play. Yeah. I'll watch that and then just like drift off for a bit. Ooh, exciting play. I'll watch that, you know? Like that's her fan experience, which is similar to like pre-yellow line and clock and shit.",
    "timestamp" : "01:05:28-01:05:51"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. That's a good way of doing it.",
    "timestamp" : "01:05:52-01:05:54"
  },
  {
    "text" : "Yeah. Every play has like less significance when it's like that, because it's like, I don't even know. Could be a first down, couldn't be, I don't know.",
    "speaker" : "Greg",
    "timestamp" : "01:05:54-01:06:01"
  },
  {
    "timestamp" : "01:06:00-01:06:01",
    "speaker" : "Andy",
    "text" : "Are we winning? I don't know."
  },
  {
    "text" : "I don't know if we're winning.",
    "speaker" : "Greg",
    "timestamp" : "01:06:02-01:06:03"
  },
  {
    "timestamp" : "01:06:04-01:06:06",
    "text" : "I have to wait till they bring the chains on the field to know what's happening.",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:08-01:06:24",
    "text" : "It's true though, yeah. No, it's uh it's been almost like relearning how to watch some of these little football games. He's like, oh fuck, I actually have to pay attention to like how far we got. Is that a first down? Eh, nobody knows. Yeah, no, the uh and but they're starting to get better. We're getting closer to high def, I think, in 2003."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:06:25-01:06:40",
    "text" : "Um another another interesting little anecdote from this game, the kick returner and like third string running back. is none other than Rod Smart, He Hate Me from XFL Glory."
  },
  {
    "text" : "I thought I recognized that name, but I couldn't place it. That wasn't really",
    "speaker" : "Andy",
    "timestamp" : "01:06:40-01:06:43"
  },
  {
    "text" : "He hate me. Damn. He hates me.",
    "timestamp" : "01:06:44-01:06:47",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:06:47-01:06:48",
    "speaker" : "Andy",
    "text" : "This game was sweet. Yeah."
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "Yeah. Another like character on this Panthers team.",
    "timestamp" : "01:06:49-01:06:53"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he was pretty good success returning kicks in this game, I will say. You don't care though. No, he I don't think he got back to the 20. Troy did really well. Troy, yeah, so Troy Brown was returning punts, and then all of a sudden he wasn't. And then he was again, and then there was no more punts. Is how this game seemed to go.",
    "timestamp" : "01:06:54-01:07:13"
  },
  {
    "timestamp" : "01:07:13-01:07:16",
    "text" : "He got that knee in the like through the face mask early.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, I I don't know if he broke his nose, but he he came back on the field and just had like the the tissue just wedged up in there.",
    "speaker" : "Andy",
    "timestamp" : "01:07:16-01:07:22"
  },
  {
    "timestamp" : "01:07:23-01:07:30",
    "speaker" : "Steve",
    "text" : "He's playing like that. Yeah, that's a sweet. That's a speech throw trotting out there with a wad of stuff up his nose. Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:07:30-01:07:34",
    "text" : "You can see the red starting like leak through it. Jesus Christ."
  },
  {
    "timestamp" : "01:07:35-01:08:12",
    "speaker" : "Greg",
    "text" : "Uh another interesting he hate me note is that upon retirement, Jake Delome got into like owning horses and shit like that. And one of the horses that he he raced, he had named She Hate Me. Okay. So you mean the horse hated him? I don't know. Uh it was a reference to that. Apparently spiked. There was also players in the XFL that were playing against He Hate Me's team that put on their nameplate. I hate he. And the other guy put I hate he too."
  },
  {
    "speaker" : "Steve",
    "text" : "The number two or the letter T-O-O?",
    "timestamp" : "01:08:13-01:08:15"
  },
  {
    "text" : "T-O-O.",
    "speaker" : "Greg",
    "timestamp" : "01:08:15-01:08:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Ooh. Oh my god.",
    "timestamp" : "01:08:17-01:08:18"
  },
  {
    "timestamp" : "01:08:19-01:08:28",
    "speaker" : "Greg",
    "text" : "Yeah. Imagine taking yourself seriously having I hate he too on your jersey, which is a response to a teammate whose response to an opponent."
  },
  {
    "timestamp" : "01:08:31-01:08:41",
    "speaker" : "Bobby Bridges",
    "text" : "thinking about this through our modern lens of like this is the shit people do on Twitter now. But in these days, dudes were like getting jerseys made with this shit. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "That was the only way you could like get your name out was by like putting something ridiculous in your jersey.",
    "timestamp" : "01:08:41-01:08:46"
  },
  {
    "text" : "Yeah, like these were guys trying to do the equivalent of going to the colour.",
    "speaker" : "Bobby Bridges",
    "timestamp" : "01:08:46-01:08:49"
  },
  {
    "timestamp" : "01:08:53-01:08:57",
    "text" : "Yeah, you got like 15 characters to fucking Gets your name out there.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Which honestly is probably the that is the defining piece of the XFL. You know, XFL he hate me is probably like the most That and uh XFL MVP Tommy Maddox actually starting some games for the the other part I remember of the XFL clearly was the inside of the coin flip they just put the ball in the middle and",
    "timestamp" : "01:08:58-01:09:17"
  },
  {
    "speaker" : "Bobby Bridges",
    "timestamp" : "01:09:18-01:09:21",
    "text" : "The kickoff rule. That was the greatest thing. Two guys would run at each other. Yeah."
  },
  {
    "text" : "And the guy like tore his ACL on like the first one. I remember opening day.",
    "speaker" : "Greg",
    "timestamp" : "01:09:21-01:09:25"
  },
  {
    "text" : "Oh, this leads to injuries? Interesting.",
    "timestamp" : "01:09:26-01:09:29",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Andy",
    "text" : "Shocking.",
    "timestamp" : "01:09:30-01:09:30"
  },
  {
    "timestamp" : "01:09:30-01:09:32",
    "text" : "No one predicted this. Yeah.",
    "speaker" : "Bobby Bridges"
  },
  {
    "timestamp" : "01:09:33-01:09:47",
    "speaker" : "Greg",
    "text" : "This is awesome though. Such a good idea. Yeah. Like we should bring this back. Oh yeah, we did. Oh boy."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:09:48-01:09:49",
    "text" : "You all do best and worse?"
  },
  {
    "timestamp" : "01:09:49-01:10:15",
    "text" : "Yeah. Sure. So Bobby, uh growing up in the Brown House, we at dinner time we all have to do best and worst, go around the table and give our best of the of the day and the worst of the day. So we've brought that over to the podcast for the game. So uh you're more than welcome to participate, but we're putting you on the spot. So If you have any bests and worse just of either the Super Bowl or this Panthers season in general, uh feel free.",
    "speaker" : "Andy"
  },
  {
    "text" : "Thankfully, uh your mother has uh you know, spent enough time with m with her grandchildren that I'm very familiar with best and worst at this point.",
    "timestamp" : "01:10:15-01:10:23",
    "speaker" : "Bobby Bridges"
  },
  {
    "text" : "Bobby knows about best and worse.",
    "speaker" : "Steve",
    "timestamp" : "01:10:24-01:10:25"
  },
  {
    "text" : "Um Best and worse, best and worse. I mean, enduringly the worst for me was the kickoff going out of bounds in this game. It's the thing I remember is the biggest like regret what the fuck moment.",
    "timestamp" : "01:10:25-01:10:37",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:10:37-01:10:37"
  },
  {
    "text" : "I just remember at the end of that game, like tying it up in the end, it was a moment that felt like It felt like the whole season. It was just like, this is it. A game we shouldn't win, but we're gonna have a chance to win. And the kick and the kick out of bounds was just such a fucking punch in the stomach from a from a guy who otherwise had just been so stalwart. Like John Casey kicked it out of bounds on it. On a kickoff? Like what? Yeah.",
    "speaker" : "Bobby Bridges",
    "timestamp" : "01:10:39-01:11:07"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:11:07-01:11:07"
  },
  {
    "text" : "So that was my worst. Like I I I'll never forget that. Uh I think best Best for this game was was definitely the Muhammad touchdown. It was just such a like fuck you moment.",
    "timestamp" : "01:11:08-01:11:22",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Andy",
    "text" : "Um because it was third and ten. Uh And the first two passes had to look real bad. The Patriots defensive line were like rag dolling Delome all over the place.",
    "timestamp" : "01:11:23-01:11:36"
  },
  {
    "text" : "And DeLome tossed that ball just like up. Like that shit rainbowed so high and so hard. Um but I think that was my best. Yeah, the the best for the game. I mean I'll still just say like I'll go back a second and we talked about it briefly, but that that Rams game is my favorite Panthers game of all time. And I re I watched it at a friend's house and it was uh I mean it wa it was like happening over like Christmas break, I think, because it was that time of year, you know what I mean? So I was home and my my buddies from home who were Panthers fans were all over there. We're at this house and like This house was like a family. They had four kids and it was like it was like literally we called it the game house growing up because his parents would have game nuts on Friday, all these fucking kids over there, right? Like literally like 30 kids over there And we go over there and we're like in a back bedroom watching this game. And these people are not football fans. This is like where we went to play like board games, right? And like Dungeons and Dragons. So like we're like watching a Panthers game hardcore in the other room and I'm like losing my fucking shit. I'm like totally losing my shit. And uh the thing I remember from after that game was uh Oh, you know what it was? I was about to leave to after that game to drive back to Davidson. And uh The oldest son in that family, Scott, went there with me. He was a year older than me. So I was going to give him a ride back. And I just remember their mom, Maxine, who was like this really nice like soft spoken woman. I just remember vividly her looking at me in the living room. And like I've known this woman my whole life. I've been around her a hundred times. But I probably had like three direct conversations with her ever. And she just looks at me and she just goes, She had clearly heard my like insanity from the other room. And just goes, I really love you, but if the Panthers had lost this game, I was not going to let my son drive back with you.",
    "timestamp" : "01:11:37-01:13:32",
    "speaker" : "Bobby Bridges"
  },
  {
    "timestamp" : "01:13:39-01:13:41",
    "text" : "Maxine. Classic Maxine.",
    "speaker" : "Greg"
  },
  {
    "text" : "Classic Maxine. Always.",
    "speaker" : "Steve",
    "timestamp" : "01:13:41-01:13:43"
  },
  {
    "text" : "All right. Well, my best is learning that my brother-in-law plays Dungeons and Dragons.",
    "speaker" : "Andy",
    "timestamp" : "01:13:45-01:13:50"
  },
  {
    "timestamp" : "01:13:51-01:13:53",
    "speaker" : "Bobby Bridges",
    "text" : "Listen. We can talk about that later."
  },
  {
    "timestamp" : "01:13:54-01:13:54",
    "speaker" : "Andy",
    "text" : "All right."
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "A lot of things happened on game night, okay?",
    "timestamp" : "01:13:56-01:13:57"
  },
  {
    "text" : "DD's legit, my friend.",
    "timestamp" : "01:13:57-01:13:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:14:00-01:14:10",
    "speaker" : "Greg",
    "text" : "I never played, but uh I'm I'm very intrigued by it. I need a dungeon master, yeah. Right? Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Honestly, this this uh Podcast is too much of a commitment. I can't imagine a Dungeons and Dragons. I feel like it's gonna be even more. Yeah, you need somebody who like knows what they're doing and runs. Oh, so you need somebody who like preps a whole like eight pages of show notes every week, edits the episodes, runs the website.",
    "timestamp" : "01:14:10-01:14:25"
  },
  {
    "speaker" : "Andy",
    "text" : "So what I'm saying is I don't I don't have enough time because I'm doing this podcast.",
    "timestamp" : "01:14:26-01:14:28"
  },
  {
    "text" : "Later I can introduce you guys to Joel, who used to work as a aerospace engineer for Delta and got laid off during the pandemic and now is just a full-time Dungeons and Dragons dungeon master. I meet with him on Wednesdays every three weeks. Don't worry about it.",
    "timestamp" : "01:14:30-01:14:42",
    "speaker" : "Bobby Bridges"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh no, I've got a few friends like that too. They uh they 3D print little mini they 3D print their their people. Uh so when you're in person you can you can be your own little guy and they set up all sorts of yeah good times. So is that your worst or your best, Andy? I can't remember. That was one of my best. No, my actual best for this game was Dion Branch catching his first ever career playoff touchdown. Just happened to be in the Super Bowl. And happened to be um a long one, actually. It was one that kind of kicked off the okay. No, his his was the uh the play action one early. So that was good. Um and then my worst was Reliance Stadium as a stadium. I thought the grass was like the turf itself seemed pretty bad. Like nobody could stay on their feet for the whole game. And I'm going to blame the stadium for Adam Vinateri's. Misses because he has only missed up until this point four field goals indoors, all four of them in the stadium. Because the other two were against the Houston Texans when they're playing in Reliance Stadium earlier this this season, season before. Whatever that was.",
    "timestamp" : "01:14:44-01:16:04"
  },
  {
    "text" : "Whatever. Go ahead and blame all blame all of David Carr Sacks on the turf. Whatever.",
    "speaker" : "Bobby Bridges",
    "timestamp" : "01:16:04-01:16:08"
  },
  {
    "text" : "Hey, you know what else we can blame on this turf? Uh John Casey kicking the ball out of bounds on the kicker.",
    "speaker" : "Andy",
    "timestamp" : "01:16:08-01:16:13"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "There we go. See?",
    "timestamp" : "01:16:13-01:16:13"
  },
  {
    "timestamp" : "01:16:14-01:16:14",
    "text" : "Oh, there you go.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:16:16-01:16:17",
    "speaker" : "Bobby Bridges",
    "text" : "No double standards, all right?"
  },
  {
    "text" : "Andy the commentators are wrong and the refs really fucked that up.",
    "speaker" : "Steve",
    "timestamp" : "01:16:18-01:16:21"
  },
  {
    "timestamp" : "01:16:21-01:16:25",
    "text" : "Yeah, but really it was the it was the the stadium. The whole the whole thing was a joke except for the two teams.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That's a good uh segue into my best actually. Alright, give it to me. So I was watching this and there's so many plays in this game that remind me of other big Patriots plays that happened either before or after. I'm listening. So the Adam Benateri game winning field goal, very similar to the one against the Texans earlier in the year, which If you're gonna go back actually watch one of the games from the season that you don't maybe not remember, that's a good one. You think? Yeah. The Texans game? Yeah, that was a that was a close game the whole way through, and it went all the way almost to the whole way over time. That was the longest game in Tom Brady's career. That's true. I remember correct. I don't remember being a good game. The Brable strip sack looked exactly like Hightower.",
    "timestamp" : "01:16:26-01:17:14"
  },
  {
    "timestamp" : "01:17:15-01:17:15",
    "text" : "Against the Falcons.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:17:16-01:17:38",
    "text" : "Yeah. That was like Just mirror image flipped on the other side of the field, but the same gets like he's rearing back to throw, gets him right in the arm, and he just drops it on the ball. It just chops the arm. There was a coverage by Tyrone Poole on Steve Smith where he pulls the the Steph play. Yeah, he looks back for it and bats it down with the with his offhand."
  },
  {
    "text" : "Which is great because that I think that was the only play Tyrone Pool made the entire game.",
    "timestamp" : "01:17:38-01:17:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, they didn't have a great game, but he had that thick Steph Gilmore looking one.",
    "timestamp" : "01:17:42-01:17:46"
  },
  {
    "text" : "He did, he did.",
    "speaker" : "Andy",
    "timestamp" : "01:17:46-01:17:47"
  },
  {
    "timestamp" : "01:17:47-01:18:11",
    "text" : "There was a Wigan sighting of him hurtling people like in the Raiders game. True. Yeah. There's the direct snap to Kevin Falk, which looked a lot like the James White one, you know? So I was just getting a lot of flashbacks to other Peaches games in this one. It's like a Amalgation of all those other big plays sort of in this one with just different versions of it that you don't actually quite remember those plays. Like if you had to pull one play out of this, it's probably the variable touchdown.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:18:12-01:18:17",
    "speaker" : "Andy",
    "text" : "Yeah. Which again is also reminiscent of Super Bowl next year in 2004."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:18:17-01:18:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, it's true. So that's a great, that's a great best. What do you got for your worst?",
    "timestamp" : "01:18:18-01:18:24"
  },
  {
    "text" : "Uh Tom Brady's interception.",
    "timestamp" : "01:18:25-01:18:27",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:18:28-01:18:52",
    "speaker" : "Andy",
    "text" : "Oh, in the end zone. He's been doing that this season a few times, mostly against the Colts where they drive down all and he's ready to put his foot on the team's throat. And just like end it as a contest and he throws that interception like deep in enemy territory or in the end zone. Give them life. And wasn't that right before the the big Yeah, that was right right before the uh 85 yard Muhammad 85 yard touchdown."
  },
  {
    "timestamp" : "01:18:52-01:19:07",
    "speaker" : "Steve",
    "text" : "Yeah yeah like literally yeah they they're inside the what the nine or something like that inside the 10 yard line you throw an interception on the goal line Yep. And you're up, you know, 21-10 at that point. You go 28-10 with you know 748 left in the field goal at least. Yeah."
  },
  {
    "text" : "So yeah, that was that was a bad one. I blocked that out of my mind. I didn't even write that down. Fuck it.",
    "speaker" : "Andy",
    "timestamp" : "01:19:09-01:19:14"
  },
  {
    "text" : "It is also sort of similar to not really, but the pick six he threw in the Falcons game, you know, where like, god damn it, we're just finally getting something going.",
    "timestamp" : "01:19:15-01:19:23",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:19:24-01:19:24"
  },
  {
    "speaker" : "Steve",
    "text" : "All right, Greg, what you got for me, boy?",
    "timestamp" : "01:19:24-01:19:26"
  },
  {
    "timestamp" : "01:19:27-01:20:00",
    "text" : "So going back to just wanted to mention this, the Hurricanes goalie. I found the article on it. Oh yeah. So this guy is, they're playing in Toronto. who it was. He is like he's the emergency goalie, but he he lives and works in Toronto for like their AHL team. And he sometimes subs in and practices with Toronto. the maple leaves as just like their third goalie during practice. So I think he's the emergency goalie for both teams. I think that's how it works.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:20:00-01:20:00",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Logistics work out. So they they both the starters for the hurricanes get injured. This guy's a 42-year-old. He's the Zamboni driver for an AHL team. That's right. He comes off the bench. He's wearing a Maple Leafs goalie face mask, the helmet. And he comes in and plays against the Maple Leafs for the Hurricanes. Gives up goals on his first two shots and then settles down block stops his last eight and ends up winning the game for the Hurricanes.",
    "timestamp" : "01:20:00-01:20:33"
  },
  {
    "text" : "That's amazing.",
    "timestamp" : "01:20:34-01:20:34",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, and they're making a Disney movie about it. Nice. As they should. So pretty cool story. Um My best, I think Vrabel. I think you kind of stole it earlier, but he was uh he I think he had a case for MVP. You know, two sacks, force fumble, tackle for loss, and a touchdown. Pretty impressive game. Yeah. My worst. Um that not that they'd know in retrospect, but the all the fawning they kept doing over Jerry Richardson. Everything they showed him in the box is kind of like cringy at this point.",
    "speaker" : "Greg",
    "timestamp" : "01:20:34-01:21:06"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:09-01:21:14",
    "text" : "And how he would do anything to win. It's like, well. This is true."
  },
  {
    "text" : "Yeah, they did a cut right before the the kick where they cut to Robert Kraft and he's sitting there holding hands and people next to him and Myra's right there and everyone's like, oh, and then they cut to Jerry Richardson He's sitting by himself, legs crossed, arms crossed, just looking so pissed off.",
    "speaker" : "Steve",
    "timestamp" : "01:21:14-01:21:31"
  },
  {
    "timestamp" : "01:21:32-01:21:37",
    "speaker" : "Andy",
    "text" : "Yeah, arms crossed across that like big old gut of his. Yeah. He's a weirdly shaped man"
  },
  {
    "timestamp" : "01:21:37-01:21:42",
    "speaker" : "Steve",
    "text" : "Sometimes he was he had like a resting bitch face anyways and he looked even more pissed off there. Yeah."
  },
  {
    "text" : "Yeah, you wanna hear the if for any of those that never read up on what happened. Obviously he had he was forced to sell the team, so this is From the article I was reading. Friday was Jean's Day when most staffers of the Panthers team offices would wear denim to work. The female employees knew what that meant. As a team's owner, Jerry Richardson made his rounds on his way to his spacious office. He would ought he would ask women to turn around so he could admire their backsides. Uh then in in his in his rolling southern drawl, he'd offer comment drawing from a store of one-liners, he'd recycle each week. Among those in heaviest rotation. Show me how you wiggle to get those jeans up. I bet you had to lay down on your bed to fit into those jeans. Did you step into those jeans or did you have to jump into them?",
    "timestamp" : "01:21:43-01:22:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:22:37-01:22:38",
    "text" : "Oh my god."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:22:38-01:22:46",
    "text" : "So the cringiest, creepiest old fucking man shit. Bob's phase right now is classic."
  },
  {
    "timestamp" : "01:22:46-01:22:48",
    "speaker" : "Mom",
    "text" : "Very naughty. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Show me how you wiggle. Imagine a fucking billionaire team owner saying that to someone in your presence. A man who wiggles uh just Like jigging. He's probably jiggling down the fucking hallway himself, dude.",
    "timestamp" : "01:22:48-01:23:00"
  },
  {
    "speaker" : "Steve",
    "text" : "Exactly. Yeah, he's wiggling to get his own fucking.",
    "timestamp" : "01:23:01-01:23:02"
  },
  {
    "timestamp" : "01:23:05-01:23:07",
    "speaker" : "Andy",
    "text" : "He knows from personal experience what it takes."
  },
  {
    "text" : "Just give me a their expertly hemmed to fit his gut precisely.",
    "timestamp" : "01:23:07-01:23:13",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "So watching Phil Sims and Greg Gumble like fawn over him during a Super Bowl is just like that's my worst Fair enough.",
    "timestamp" : "01:23:14-01:23:22"
  },
  {
    "timestamp" : "01:23:23-01:23:24",
    "speaker" : "Andy",
    "text" : "Who's the owner now?"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh David Tepper. I don't know who he is. He's another billionaire. He seems to be doing good things with the program. Yeah. Bobby? Comments?",
    "timestamp" : "01:23:24-01:23:32"
  },
  {
    "text" : "I mean, I'm pretty disassociated at this point. My read on him is like he's cut from the like ambitious entrepreneur cloth.",
    "speaker" : "Bobby Bridges",
    "timestamp" : "01:23:33-01:23:44"
  },
  {
    "speaker" : "Steve",
    "text" : "It did look like Jerry Richardson in those seats, but okay.",
    "timestamp" : "01:23:44-01:23:47"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:23:49-01:23:55",
    "text" : "All right. Well, this has been yet another successful season. Bobby, thank you for joining us."
  },
  {
    "timestamp" : "01:23:56-01:23:57",
    "speaker" : "Bobby Bridges",
    "text" : "Indeed. All right."
  },
  {
    "text" : "Steve, Greg, thank you for joining me on this journey again. Greg, thanks for watching the game. Yeah, thanks for watching this game.",
    "timestamp" : "01:23:58-01:24:05",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:24:05-01:24:07",
    "text" : "Steve, thank you for thanking me.",
    "speaker" : "Greg"
  },
  {
    "text" : "Greg, thank you for thanking me for thanking you.",
    "timestamp" : "01:24:07-01:24:09",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:24:10-01:24:11",
    "text" : "You're welcome.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:24:13-01:24:19",
    "text" : "And mom for listening. Thank you, Mom, for listening. Shout out, mom. Shout out, mom.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:24:19-01:24:20",
    "text" : "I love you. Yeah, sure."
  },
  {
    "timestamp" : "01:24:21-01:24:40",
    "speaker" : "Andy",
    "text" : "For everything. Um, yeah. And so this wraps up the 2003 NFL season. We'll be back soon with uh the start of the 2004 season when eventually we'll probably see the Patriots lose one day. Wagon keeps rolling, baby. It's been a while. I think we're 16 wins in so far."
  },
  {
    "text" : "If only Donovan McNabb didn't get tired He had an upset Tommy.",
    "speaker" : "Bobby Bridges",
    "timestamp" : "01:24:40-01:24:47"
  },
  {
    "text" : "Okay. He had some bad shellfish.",
    "speaker" : "Greg",
    "timestamp" : "01:24:47-01:24:50"
  },
  {
    "speaker" : "Bobby Bridges",
    "text" : "Yeah, that's not what Tyrell Owen said.",
    "timestamp" : "01:24:50-01:24:53"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean, maybe he shouldn't have fretexed it. Should have got a fresh one. Ooh, hey oh. But we'll see you next season on the Pages Dynasty Podcast. But until then, we'll see you later.",
    "timestamp" : "01:24:54-01:25:08"
  }
]