[
  {
    "speaker" : "Speaker 1",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17"
  },
  {
    "timestamp" : "00:23-00:32",
    "speaker" : "Andy",
    "text" : "Welcome back to the Patriots Dynasty Podcast. I'm your host Andy Brown. With me are my brothers Steve and Greg Brown. How you doing, brothers?"
  },
  {
    "timestamp" : "00:33-00:39",
    "text" : "Good. Great. You guys really sound it. Right.",
    "speaker" : "Steve"
  },
  {
    "text" : "Fucking killing it.",
    "timestamp" : "00:39-00:40",
    "speaker" : "Andy"
  },
  {
    "text" : "I am I am excited to do an episode of my adopted city. Oh yeah.",
    "timestamp" : "00:41-00:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "You're not from Washington DC though.",
    "timestamp" : "00:48-00:51"
  },
  {
    "text" : "But I've lived here for since two thousand six.",
    "speaker" : "Steve",
    "timestamp" : "00:51-00:54"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, but you live in Arlington. That's it's completely different. Is it? Is it yeah it's like us saying we're from Boston, we're from New Hampshire.",
    "timestamp" : "00:55-01:02"
  },
  {
    "speaker" : "Steve",
    "text" : "I I know. It's more like people like saying half hour away. You live in Brooklyn and like they're from New York City, right? It's kinda right across It's three miles from my house to DC.",
    "timestamp" : "01:03-01:11"
  },
  {
    "timestamp" : "01:12-01:14",
    "text" : "Wait, Brooklyn's not in New York City?",
    "speaker" : "Andy"
  },
  {
    "text" : "Well it looks like it's close enough right across the river, that sort of thing. Like saying you live in New York City. I can walk to Georgetown from my house. It takes about an hour.",
    "timestamp" : "01:14-01:25",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:25-01:36",
    "speaker" : "Greg",
    "text" : "That's a better analogy, Andy. New Jersey. Yeah. But that's cool. I'm just saying that you're a phony, you're a fake, and stop lying to us. Okay. Okay."
  },
  {
    "speaker" : "Steve",
    "text" : "Speaking of phony fakes, let's get into the Redskins and their owner, Dan Snyder.",
    "timestamp" : "01:36-01:41"
  },
  {
    "timestamp" : "01:41-01:48",
    "speaker" : "Greg",
    "text" : "Yeah, we'll have you. Wait, wait, wait, wait, wait. Before we get any further, look, can we s can we talk about what we're gonna call this team? Because I"
  },
  {
    "text" : "That's a good point.",
    "timestamp" : "01:49-01:50",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean obviously they're no longer currently called the This is true name of the Do we could but are they were them back then",
    "timestamp" : "01:50-01:59"
  },
  {
    "timestamp" : "01:59-02:05",
    "text" : "Right. And like as a historical podcast, do you still use the term that they were called?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "02:05-02:22",
    "text" : "Or do you censor it? Let's call them the Native Americans. We'll call them the R words. We can call 'em the skins. See, I back in my day I remember the original R-word. We call them the pigs. Steve, stop acting so R-worded.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Stop acting so red skinned. Oh boy. So if you have a guess by now, it's 2003 week four where the Patriots go to I don't even know what the scene was called. What is it called, Steve?",
    "timestamp" : "02:24-02:39"
  },
  {
    "timestamp" : "02:39-02:42",
    "text" : "Uh FedEx Field. I don't know if it was back then, but it is now.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:43-02:50",
    "text" : "Sure it was. Um FedEx Fields m uh built in nineteen ninety-seven.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "02:50-02:56",
    "speaker" : "Steve",
    "text" : "Which Phil Sims in this game called A Beautiful Place. He said it's a beautiful day and a beautiful stadium."
  },
  {
    "speaker" : "Andy",
    "text" : "So it was built in ninety-seven, but it was known as Jack Kent Cook Stadium until ninety-nine when it became FedEx Field. I don't know who Jack Kent Cook is, but stat check? No idea. Kent Cook? Jack Kent Cook. Cook with an E. He's an American-Canadian businessman. And he had he they named a team after him. Dude's kid.",
    "timestamp" : "02:57-03:18"
  },
  {
    "timestamp" : "03:19-03:20",
    "speaker" : "Greg",
    "text" : "Fucking hell."
  },
  {
    "speaker" : "Steve",
    "text" : "You might have been the owner before Snyder.",
    "timestamp" : "03:21-03:23"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't care.",
    "timestamp" : "03:24-03:25"
  },
  {
    "timestamp" : "03:25-03:31",
    "text" : "Um they're headquartered in in Lansdowne, Virginia. That's where the stadium is, right? Lansdowne? No.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "State is in Maryland. Landover. Landover.",
    "timestamp" : "03:31-03:33"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh. And then like their headquarters in Ashburn, Virginia.",
    "timestamp" : "03:35-03:38"
  },
  {
    "speaker" : "Andy",
    "text" : "So like in Bendover, Maryland.",
    "timestamp" : "03:38-03:40"
  },
  {
    "text" : "Bend over here.",
    "timestamp" : "03:41-03:42",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:42-03:48",
    "text" : "Yeah. Bend over and I'll show ya. Hey, where's the stadium? Bend over and over.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "03:51-04:08",
    "text" : "You know how when uh Patriots games are on TV and they're always showing like cuts of Boston, right? And Faniuel Hall and shit and everyone in New England's like, that ain't you know, Foxboro, it's a fucking middle of nowhere and one way in and one way out, and it's like Sort of a miserable experience to get there. Redskinsadium is the same way.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "But worse.",
    "timestamp" : "04:08-04:09"
  },
  {
    "text" : "It's in like middle of nowhere, Maryland, probably a good you know 45 minutes outside the city. Surrounded by concrete and highways. There is like the very end of a metro line out there, so you could take the metro if you want, but then you gotta walk a mile from the metro stop to the stadium.",
    "timestamp" : "04:09-04:24",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:25-04:26",
    "text" : "Well that's well planned. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "And then, you know, of course in this game they're they're cutting into like the Jefferson Monument and all these cool things you can do in DC. And it's just Same idea.",
    "timestamp" : "04:27-04:35"
  },
  {
    "timestamp" : "04:35-04:38",
    "speaker" : "Andy",
    "text" : "Disingenuous, shall we call it."
  },
  {
    "timestamp" : "04:38-04:41",
    "speaker" : "Greg",
    "text" : "Yeah. It's one of the oldest stadiums in the league, too."
  },
  {
    "text" : "This one's gotta be, yeah.",
    "timestamp" : "04:41-04:43",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "04:43-04:49",
    "speaker" : "Greg",
    "text" : "Yeah. I mean the some of the obvious ones are like Lambeau, Soldier Field, Arrowhead."
  },
  {
    "text" : "Well Soldier Field got renovated though. Yeah. A lot of these have been renovated. Yeah, 2002.",
    "timestamp" : "04:50-04:56",
    "speaker" : "Andy"
  },
  {
    "text" : "Hard Rock Stadium that got renovated. I think the Jacksonville one got renovated too, eh?",
    "speaker" : "Greg",
    "timestamp" : "04:57-05:02"
  },
  {
    "text" : "Well Snyder wanted to move the Redskins into DC. into JFK where they used to play that stadium right in DC on the water and they were like, not with that name, you're not. This is literally the whole hold up was like, we're not moving the the Redskins into DC. It's Really?",
    "speaker" : "Steve",
    "timestamp" : "05:02-05:20"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Huh. I think that's a big part of it.",
    "timestamp" : "05:20-05:22"
  },
  {
    "timestamp" : "05:22-05:24",
    "speaker" : "Steve",
    "text" : "And that's sort of what's forcing the name change right now."
  },
  {
    "timestamp" : "05:24-05:26",
    "speaker" : "Greg",
    "text" : "Oh, so then they're gonna move now?"
  },
  {
    "text" : "It's not like a done deal. There's still a lease they have at FedEx, but Snyder definitely, definitely wants to move him into DC.",
    "timestamp" : "05:27-05:32",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "05:33-05:38",
    "text" : "If he still owns a team by that point. And what Dan Snyder wants, Dan Snyder gets",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "05:39-05:46",
    "text" : "Well, do we want to talk about dance now? That seems like a good segue. Greg, I know that you uh you have some thoughts on Mr. Snyder.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "05:46-06:47",
    "speaker" : "Greg",
    "text" : "Sure. Um I mean, uh as I typically do, I look for any characters of interest in these teams that we're playing and try and do a little internet sleuthing. Yeah, to see if I can find anything interesting. And I mean he obviously has the reputation he has. And there was just an overwhelming amount of Like basically Dan Snyder bashing content on the internet. Like I did it I I I almost got to a point where I was like There was just so much that I was like reading the same thing over and over again or like listening to the same thing because the there's like, you know, there's like websites dedicated to like trash and on Dan Snyder. Ooh, what are they? Well, I mean I think the the one that is probably the most comprehensive is the one you sent me to, Andy. Like it it's like an alphabetical list of Shit reasons that Dan Snyder snocks."
  },
  {
    "timestamp" : "06:48-06:56",
    "text" : "The cranky Redskins Redskins fans guide to Dan Snyder. Yeah. From A to Z, an encyclopedia of the owner's many failings.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "And it was awesome. Definitely post this in the uh so there's like a bunch of yeah, there's a bunch of like interesting things on there. I pulled out a couple. I mean, I think one part that was a recurring theme is that he's a big nickel and dimea kind of guy to his own fans. Oh yeah. Which if you're not playing well really doesn't resonate well with a fan fan base, right? Which they haven't been doing. So a couple of uh examples of that. Um this one's pretty good. Uh So they were in 2006, they started offering vendors offered shelled nuts in royal blue and white five-ounce bags adorned with Independence Air logo. The problem being that the airline had gone under about a year earlier. And um apparently they were all the nuts were like past their expiration date as well.",
    "timestamp" : "06:58-07:55"
  },
  {
    "text" : "And so we just took them and sold them?",
    "timestamp" : "07:56-07:58",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:58-08:04",
    "speaker" : "Greg",
    "text" : "Yeah. Oh yeah. Oh my god. But the branding's still on it. The Independence Air branding's still on it."
  },
  {
    "speaker" : "Andy",
    "text" : "I wonder how much a bag of those peanuts went for. I mean stadium peanuts aren't cheap.",
    "timestamp" : "08:04-08:10"
  },
  {
    "timestamp" : "08:11-08:12",
    "speaker" : "Steve",
    "text" : "Fifteen bucks."
  },
  {
    "speaker" : "Greg",
    "text" : "Right.",
    "timestamp" : "08:12-08:12"
  },
  {
    "timestamp" : "08:13-08:13",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "08:14-08:32",
    "speaker" : "Greg",
    "text" : "One of the more like offensive ones here is after 9-11, they added a four dollar security surcharge to all ticket prices after that happened with no discernible difference in like the security at the stadium."
  },
  {
    "speaker" : "Andy",
    "text" : "That's not great.",
    "timestamp" : "08:33-08:34"
  },
  {
    "speaker" : "Greg",
    "text" : "That's really bad. And then they sold like uh there was like an anniversary or something, the fifth anniversary, and they were selling 9-11 hats. like memorial hats for twenty-four dollars and um they were like six dollars more than like just the standard hat. So they just like slapped a Redskins logo on it and said it was a 9-11 hat for six dollars more.",
    "timestamp" : "08:34-09:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh classy dude.",
    "timestamp" : "09:05-09:07"
  },
  {
    "text" : "Mm-hmm There was uh the sign incident where all the fans were putting signs up or like they bring signs to the game that were like, you know, kind of trash and ownership, stuff like that. So they um banned signs at the stadium, but then like later, uh Geico had a deal with them and they were hit Sending out Geico sides to everybody in the stadium. So yeah, it's only banned unless I unless I can make a couple cheap bucks off it, you know?",
    "speaker" : "Greg",
    "timestamp" : "09:07-09:41"
  },
  {
    "text" : "Banned for everybody but our corporate sponsors.",
    "speaker" : "Steve",
    "timestamp" : "09:41-09:44"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, exactly. Uh, they're the first people to ever charge admission for um training camp. Oh shit. Yep. They were the first ones to do that. I think they were like fifty bucks to get into training camp. Um holy shit, that's a lot. They were There's a rule, I guess, in the NFL about like uh having advertisements for alcohol and um they were They had strategically placed Smearnoff Ice and Captain Morgan's gold advertisements that were in like the sight line of the like the main cameras so that they could, you know, kind of sidestep those rules. Oh my God. And I guess there was some uh partnership with those brands as well. Shocking. Yeah. Um they were suing their seasoned ticket holders. In 2008, 2009, during the recession period, despite claiming that there was uh two thousand two hundred thousand people on their season ticket waiting list. So they were Suing the ones that had season tickets because they couldn't pay their their dues.",
    "timestamp" : "09:44-10:58"
  },
  {
    "timestamp" : "10:58-11:04",
    "text" : "Yeah, wasn't there some story about like some 90-year-old lady that got sued and had been a season ticket holder forever?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "11:04-11:22",
    "text" : "And yeah, that whole like everyone knew. Yeah. That like, dude, you want season tickets, whatever. They'll put you on the list. You gotta wait like 15 years. There's so many people on our season tickets. Everyone like knew it's kind of bullshit. And then that all shit went down and then they had to come out. And I'm pretty sure they're forced to admit like yeah. We got nobody."
  },
  {
    "text" : "Shocking. Because they have been terrible during that time too, right?",
    "timestamp" : "11:24-11:27",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "11:27-11:27"
  },
  {
    "text" : "They've been terrible for a while. They've been great.",
    "timestamp" : "11:28-11:29",
    "speaker" : "Andy"
  },
  {
    "text" : "They were terrible Once he bought the team. I think they're good up until then.",
    "timestamp" : "11:30-11:34",
    "speaker" : "Steve"
  },
  {
    "text" : "I have some numbers on that too, specific to the cut. But I mean just think about Like w as a business person, do you think it's a good idea to sue your seasoned ticket holders? Those are your most faithful fans and most reliable income is your season ticket holders and you're suing them during a nationwide Recession. Does that sound like a like regardless of anything, does that sound like a savvy business move?",
    "speaker" : "Greg",
    "timestamp" : "11:35-12:05"
  },
  {
    "timestamp" : "12:05-12:10",
    "text" : "Well, let's let's talk about how he made his money. Was there any of that on there?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "12:10-12:12",
    "text" : "Uh it might I I might have missed it."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "12:12-12:24",
    "text" : "What was how do you mean she's like one of the pioneers of email spam? So he pioneered email spam, like the whole CAN Spam Act, like the federal legislation against it."
  },
  {
    "timestamp" : "12:25-12:25",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "12:25-12:36",
    "text" : "Has a lot to do with Dan Snyder and like the shit that he did. So he made a fuck ton of money spamming people. with emails when email first came out, bought a football team and then it's just coasted since."
  },
  {
    "timestamp" : "12:36-12:39",
    "speaker" : "Andy",
    "text" : "And he looks like the type of guy that would invent email spam, doesn't he?"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, 100%.",
    "timestamp" : "12:39-12:40"
  },
  {
    "timestamp" : "12:40-12:41",
    "speaker" : "Andy",
    "text" : "That's slimy."
  },
  {
    "text" : "Acts like it.",
    "speaker" : "Steve",
    "timestamp" : "12:41-12:42"
  },
  {
    "speaker" : "Andy",
    "text" : "Chinless motherfucker.",
    "timestamp" : "12:43-12:44"
  },
  {
    "text" : "Everyone hates it. He's such a fucking little, I don't know, dweeb. Such a punchable face. He's a weasel, yeah. Yeah. Yeah.",
    "timestamp" : "12:45-12:53",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "12:53-13:17",
    "speaker" : "Greg",
    "text" : "And I think he I read some stuff about him. He like idolizes Jerry Jones. So he's He wants to be the star of the show, you know? Right. He just sucks at it. Yeah, he's just not a good Yeah, yeah. And then he he kind of like gets his lackeys in there that do will do whatever he wants to do. Oh yeah."
  },
  {
    "text" : "And he puts them in positions of power and 100%, yeah. Yeah.",
    "timestamp" : "13:17-13:22",
    "speaker" : "Steve"
  },
  {
    "text" : "Creates a toxic work environment.",
    "speaker" : "Andy",
    "timestamp" : "13:22-13:24"
  },
  {
    "speaker" : "Greg",
    "text" : "Right. Um I also looked through like some of the head coach head coaches in his tenure.",
    "timestamp" : "13:26-13:34"
  },
  {
    "timestamp" : "13:34-13:34",
    "speaker" : "Andy",
    "text" : "Oh yeah."
  },
  {
    "timestamp" : "13:35-13:50",
    "text" : "Because there's a lot of names on there that are like, you know, they're they're good coaches that you've heard of that, you know, outside of the Redskins are had really good careers. So I I looked at the case. Less players think. Hey, you got a big name.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "13:50-13:52",
    "text" : "He has a shillload of money.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "13:52-13:53",
    "speaker" : "Andy",
    "text" : "Did that with players too."
  },
  {
    "timestamp" : "13:54-13:54",
    "speaker" : "Steve",
    "text" : "Oh yeah."
  },
  {
    "timestamp" : "13:54-14:01",
    "text" : "Coaches, players, and old guys, yeah, old stars who were past their prime. Like in this game, um Bruce Smith.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "14:01-14:30",
    "text" : "Yeah. Yeah. And I think There is a bit of a common theme among among the coaches that, you know, he was a bit too heavy-handed in trying to get involved in personnel decisions rather than trusting these guys to do their jobs. But I I looked at I pulled a few of them out to to see what their records were like under Snyder compared to everywhere else they were in their careers. And there's a there's a I'll just say it's a common theme here."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "14:31-14:36",
    "text" : "So I guess they did way better working for Snyder."
  },
  {
    "text" : "Undoubtedly.",
    "speaker" : "Andy",
    "timestamp" : "14:37-14:38"
  },
  {
    "speaker" : "Greg",
    "text" : "Steve Spurrier. Um he's the coach during this 2003 game. So if you he he coached in a few different areas, his most notably was in the NCAA, obviously with uh Florida and then with South Carolina. So his record, yeah, his record in college as a college coach was 228, 89, and two. with a national title with Florida. He was thirty-five and twenty-one in the USFL He was seven and one in the AAF and he was twelve and twenty with the Washington Redskins And uh here's a quote from Spurrier. I went to the team that offered the most money instead of the best situation. The owner and the personnel guys, they picked the team. I couldn't even pick the quarterback the second year. So I knew it wasn't gonna work, but that's okay. I probably didn't do a very good job and the situation wasn't what I was looking for, so it was time to move on.",
    "timestamp" : "14:38-15:43"
  },
  {
    "text" : "That one quote sums up the entire Redskins organization under Snyder of like a big name. Here's a shitload of money, but we're not gonna actually let you do what we're gonna pay you to do, because like I have I can't give up that control. And then you're gonna leave. Yeah",
    "speaker" : "Steve",
    "timestamp" : "15:45-16:03"
  },
  {
    "timestamp" : "16:04-17:23",
    "speaker" : "Greg",
    "text" : "Um so before him, there's an interesting one of how he even got his job, is Marty Schottenheimer. Right. Oh, I remember this. Mm-hmm. So Marty Schottenheimer was He he he coached a bunch of teams, right? He was a Cleveland, Kansas City, San Diego. So he was he was 44 and 27 with Cleveland. He made the playoffs all four seasons that he coached Cleveland. Not bad. He was 101 and 58 with Kansas City. He made the playoffs seven out of those ten seasons. He was forty-seven and thirty-three with San Diego. He made playoffs twice out of five seasons and had that fourteen and two. Yeah, yeah. Uh San Diego team of the Pats beat. Yeah. And then he was he I guess I think they like started 0-5, and then he like rallied the team and they finished eight and eight by winning like Like seven of the last eight games or something ridiculous, right? Yeah, they won either final eleven games to narrowly miss the postseason, the despite this in a controversial move. Dan Snyder, the owner of the Redskins, fired Schottenheimer on January 2002 to make room for former University of Florida head coach Steve Spurrier, his shiny new toy. That's so that's so clad."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, we took the job for the money.",
    "timestamp" : "17:24-17:25"
  },
  {
    "timestamp" : "17:25-17:36",
    "text" : "No foresight, yes. Yeah. And like the one time your team is like showing signs of momentum, like, oh man, eight out of eleven, this team looks good, barely missed the playoffs. Like, all right.",
    "speaker" : "Greg"
  },
  {
    "text" : "So what was Schottenheimer's record on the skins?",
    "speaker" : "Steve",
    "timestamp" : "17:39-17:42"
  },
  {
    "text" : "Eight and eight. He gave him one year.",
    "timestamp" : "17:42-17:46",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "17:48-17:48",
    "speaker" : "Andy",
    "text" : "Brutal."
  },
  {
    "speaker" : "Greg",
    "text" : "Um another name you'll obviously recognize is Joe Gibbs. Yeah. He is he was with the Redskins prior to the Daniel Schneider regime. So this was back in the day. Yeah. He was before Snyder, he was 140 and 65 with uh three Super Bowl wins in his tenure. And then he came back to the Redskins when Snyder was there and he was 31 and 36",
    "timestamp" : "17:50-18:20"
  },
  {
    "text" : "And he like hated it so bad that he like goes into like NASCAR, right? Like he's just like fuck this.",
    "speaker" : "Steve",
    "timestamp" : "18:21-18:26"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "18:27-18:46",
    "text" : "I'm done with football, I hate football now. 140 so you in in 205 games but in the original era, it took him only like so you had 65 losses that whole time. In like 67 games, he's already up to 36 losses."
  },
  {
    "timestamp" : "18:48-18:58",
    "speaker" : "Andy",
    "text" : "But even he Joe Gibbs was one of the few coaches who took the Redskins to the playoffs. Or even had a winning record."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "18:58-18:59",
    "text" : "Yes. Yes."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:59-19:00",
    "text" : "I believe he did."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "19:00-19:01",
    "speaker" : "Greg"
  },
  {
    "text" : "Let's be real though. That was more just because the rest of the NFC was like a dumpster fire. That wasn't like they had a great season.",
    "speaker" : "Steve",
    "timestamp" : "19:02-19:09"
  },
  {
    "text" : "Yeah, they went 10 and 6 in 05 and lost in the divisional round and then 9-7 in 07 and lost in the wildcard.",
    "speaker" : "Andy",
    "timestamp" : "19:11-19:17"
  },
  {
    "speaker" : "Steve",
    "text" : "And that divisional round one was is that RG3?",
    "timestamp" : "19:18-19:22"
  },
  {
    "timestamp" : "19:25-20:04",
    "speaker" : "Greg",
    "text" : "Pedagogy three was we'll get to there. Um but Joe Gibbs is the only one that I that didn't seem to um I couldn't find any quotes of him like trashing Snyder. Like pretty much every other coach, there's either like direct quotes or like, you know. Yeah. But Joe Gibbs like he he stayed on as like a I don't know like a A consultant type deal, I think. So and I uh he's like a legend in in Washington, right, Steve? Like Yeah, because I mean Super Bowls he's gotta have like"
  },
  {
    "timestamp" : "20:04-20:40",
    "speaker" : "Steve",
    "text" : "He like gotta love the Redskins and hate Dan Snyder. I bet privately Joe Gibbs like absolutely hates what Dan Snyder has done to the team. You gotta. I will say people in DC Redskins are the number one team, but boy do they hate like I mean it's just like they just had all the ever beaten out of them. If Dan Snyder sells a team and like they get a competent owner and who lets like if they get an RKK in there and they turn the team around in five years, this place will be crazy. But so many years under Snyder is just taking the life out of all the fans here."
  },
  {
    "text" : "Turning into Lions fans.",
    "timestamp" : "20:41-20:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "20:43-20:53",
    "text" : "No, Lions fans care more. But Are you kidding me? There are no Trevor's out there of the Redskins. I know a fair amount of Redskins fans, and they're all just like Just so downtrodden."
  },
  {
    "text" : "I don't know. I bet I bet because wasn't uh what was the name of the owner for the the lions that they all want fired? Um",
    "speaker" : "Andy",
    "timestamp" : "20:53-21:00"
  },
  {
    "speaker" : "Steve",
    "text" : "That was Matt Millen, the GM was never the owner.",
    "timestamp" : "21:01-21:02"
  },
  {
    "text" : "Oh, that's right. It was Matt Mill in that mind. Yeah. You're right.",
    "speaker" : "Andy",
    "timestamp" : "21:02-21:05"
  },
  {
    "timestamp" : "21:06-21:11",
    "speaker" : "Steve",
    "text" : "I feel that like the owner is, you know, they just they see no hope because as long as they insigned the owner."
  },
  {
    "timestamp" : "21:11-21:12",
    "speaker" : "Andy",
    "text" : "He can't get fired."
  },
  {
    "text" : "We got nothing. Yeah.",
    "timestamp" : "21:12-21:13",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "21:13-21:15",
    "speaker" : "Andy",
    "text" : "Oh, that's true. That sucks."
  },
  {
    "speaker" : "Steve",
    "text" : "Then he's like he's relatively young too, right? It's like I don't know, fifties, sixties? Yeah, he looks pretty young. So like he's like what are you hoping for him to die?",
    "timestamp" : "21:16-21:27"
  },
  {
    "timestamp" : "21:27-21:42",
    "speaker" : "Greg",
    "text" : "Good luck there you get another 40 years guys No ways he sells like you can't really do anything about an owner like you can't force them to well Gotta force that guy in Carolina if they did something inappropriate. Right."
  },
  {
    "text" : "He was 55 years old, by the way.",
    "timestamp" : "21:42-21:44",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Damn.",
    "timestamp" : "21:44-21:45"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "21:45-21:46"
  },
  {
    "speaker" : "Andy",
    "text" : "His net worth is $2. 6 billion.",
    "timestamp" : "21:46-21:48"
  },
  {
    "timestamp" : "21:48-22:14",
    "text" : "But like that's the entire team. He has nothing else besides a team. He doesn't have any businesses. He's not like got a shiller money. His entire assets are there. He literally just made the money in spamming people emails. Bought a team, and that's it. That's why he's so involved. It's like his entire life. Like RKK's got a shit going on. He's like, I'm building Patriot Place and I'm doing this and I'm doing that, you know. Got a bunch of other ventures going on and getting jerked off and massage parlors.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "All right, all right. That's what somebody needs to do is somebody's to jerk this guy off. He's too busy doing it himself.",
    "timestamp" : "22:14-22:21"
  },
  {
    "text" : "Yeah, no, I stop, I can do that better than you. You're doing it wrong.",
    "speaker" : "Steve",
    "timestamp" : "22:21-22:26"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "22:27-22:29",
    "text" : "He's overpaying for it."
  },
  {
    "timestamp" : "22:30-22:38",
    "text" : "You have a big name, right? He's gonna try and get arcade caves the suits.",
    "speaker" : "Steve"
  },
  {
    "text" : "No, it's definitely some like over the hill porn star. Yeah. Stormy Daniels. Yeah, some huge name.",
    "speaker" : "Andy",
    "timestamp" : "22:41-22:48"
  },
  {
    "timestamp" : "22:48-23:12",
    "text" : "Yeah. Yeah. Wow. So the last one I had on this list was our boy Mike Shanahan. We kind of talked about how awesome he was when when uh Yeah. When we we played the the Broncos. I mean he's had a like a ridiculous career. 138 and 86 with Denver with two Super Bowl wins. And in Washington, 24 and 41.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "23:13-23:18",
    "speaker" : "Steve",
    "text" : "Oh. And then they had Kyle Shanahan on that staff."
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, they had Sean McVay, Kyle Shanahan, and the who's the coach for the Bengals, that young guy.",
    "timestamp" : "23:18-23:27"
  },
  {
    "text" : "Oh we uh yes, I know you're talking about.",
    "speaker" : "Andy",
    "timestamp" : "23:27-23:30"
  },
  {
    "speaker" : "Greg",
    "text" : "I can't uh they were all on that staff.",
    "timestamp" : "23:30-23:33"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:33-23:33",
    "text" : "Yeah."
  },
  {
    "text" : "Hey, and they had Robert Griffin, Zach Taylor.",
    "speaker" : "Greg",
    "timestamp" : "23:34-23:36"
  },
  {
    "speaker" : "Steve",
    "text" : "Zach Taylor, yeah, yeah Oh yeah, they have coaching talent, but why would you stick around? Because you don't get to do any of the actual coaching. You're just being told what to do. Yep. Yeah.",
    "timestamp" : "23:37-23:47"
  },
  {
    "timestamp" : "23:48-23:58",
    "speaker" : "Andy",
    "text" : "Oops. And now it's Ron Rivera. In between cancer treatments, he's trying to coach a football team, which is, I mean, good for him, but Jesus. Yeah. It's a tough situation."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "24:00-24:07",
    "text" : "I don't know why you took that well, I don't know. Uh because you got an NFL job to an NFL job, right? But I guess."
  },
  {
    "text" : "I mean it might be just the Steve Sparrier attitude. It's like these guys were offering me a shit ton of money. So",
    "speaker" : "Andy",
    "timestamp" : "24:07-24:13"
  },
  {
    "text" : "Yeah, but Mike Shanahan, they had a they had a messy divorce. I'm pretty sure that he was the one that the whole Robert Griffin knee injury situation in the playoffs. Yeah. Um There was something about like Griffin saying that certain plays had to be in the playbook or certain plays had to be called and That uh Shanahan got the indication that that was from the top. Like there wasn't a choice he'd have to play these plays, I guess. So he's even getting like involved in play calling.",
    "speaker" : "Greg",
    "timestamp" : "24:15-24:50"
  },
  {
    "speaker" : "Andy",
    "text" : "Good lord.",
    "timestamp" : "24:50-24:51"
  },
  {
    "text" : "Yeah. Yeah, he said this is a quote. Griffin actually mentioned what plays were acceptable and unacceptable. And when he started talking about what plays were acceptable and unacceptable. And that he wasn't a rookie anymore and wanted to voice his opinion. The term unacceptable is used by Dan, the owner, quite often. So I had a little bit of a smile when I heard some of these complaints. So I mean he might be projecting Shannon, but Maybe but I feel like the track records exist. Right. Yeah. You take the context of how every other coach has talked about him then.",
    "speaker" : "Greg",
    "timestamp" : "24:52-25:25"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "25:25-25:40",
    "text" : "Can you imagine Bill um Parcell's working for uh Snyder? Talk about not being able to buy the groceries, dude. You wouldn't even be allowed to go to the grocery store. Gotta ask for the car keys. Oh my god. Get his allowance every week."
  },
  {
    "timestamp" : "25:40-25:44",
    "text" : "Yeah, right, exactly. Get driven there and told what to buy.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:44-25:51",
    "speaker" : "Steve",
    "text" : "Yeah. Here's a list. Here's the exact amount of money you're in the to buy the things you need. Go. Right."
  },
  {
    "timestamp" : "25:51-25:57",
    "speaker" : "Andy",
    "text" : "So this this Redskins team, um, this was the Steve Spurrier area, like we we talked about."
  },
  {
    "text" : "This is Spurrier's second year, yeah.",
    "timestamp" : "25:57-26:00",
    "speaker" : "Greg"
  },
  {
    "text" : "Second season, yeah.",
    "speaker" : "Andy",
    "timestamp" : "26:00-26:01"
  },
  {
    "timestamp" : "26:01-26:02",
    "text" : "Second season.",
    "speaker" : "Greg"
  },
  {
    "text" : "Uh with Noted QB phenom Patrick Ramsey.",
    "speaker" : "Andy",
    "timestamp" : "26:02-26:07"
  },
  {
    "text" : "Before I looked this game up, I was like, all right, Greg, can you name any players on this team? Just off the top of your head. And like most teams you can like get like two or three guys. I couldn't think of a single one. And then even when I looked at the roster There was only a couple where I was like, oh, I should have known that. Right, yeah. Like Champ Bailey. Yeah, I think. Champ Bailey of our champion. That's it. Everybody else was like, I I didn't know Trump candidate played on the Redskins.",
    "speaker" : "Greg",
    "timestamp" : "26:09-26:36"
  },
  {
    "text" : "He was the starting running back. Yeah. He was he ran for 600 yards and one touchdown. Well, there was uh uh quite a I have a Burmanism for him. Oh, let's hear it.",
    "timestamp" : "26:37-26:49",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:49-26:51",
    "text" : "A trung Manchurian candidate.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, that's a good one. I wrote down, I think I may have said this before, but uh Trunk Candidate sounds like the newest Fox show starring Kiefer Sutherland.",
    "timestamp" : "26:51-27:00",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:00-27:05",
    "speaker" : "Greg",
    "text" : "Yes. Yeah. Yeah. I I thought it out when I read his name too. That's a good one."
  },
  {
    "timestamp" : "27:05-27:31",
    "text" : "Um, but apparently this this team had stolen uh a bunch of teams from the vaunted offense that was the New York Jets of 2002. That was their big offseason Hall was signing uh like I said, Lavernius Coles. Yep. Which when I was writing these notes, I uh I had to figure out how to spell Lavernius. That that is over the map.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, do it try Santana Moss is a red skin as well at some point. For sure. Either started the Redskins or went to the Redskins, but love Moss and Coles. I always got them mixed up because they both played in DC and in the Jets.",
    "timestamp" : "27:31-27:43",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "27:44-27:44",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "But that fits Snyder's MO because the remember we talked about the Jets going to the playoffs and they blew somebody out the Colts, right? Mm-hmm. 45-0 and or whatever it was. And like, wow, cool, shiny new thing. Let me just sign their best players.",
    "timestamp" : "27:45-27:57",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Best players, but yeah. Laverneus Coles I think was the was the jewel of this this this cash grab. Greg, did you want to give a shot to spelling Lavernius?",
    "timestamp" : "28:00-28:10"
  },
  {
    "text" : "All right, just give me a buzzer once I go wrong here. Okay. L A V. E R N E U S. Was that close?",
    "speaker" : "Greg",
    "timestamp" : "28:11-28:32"
  },
  {
    "timestamp" : "28:33-28:40",
    "speaker" : "Andy",
    "text" : "No, because that's how I would have spelled it too. L-A-V-E-R A-N-U-E-S."
  },
  {
    "text" : "Yeah. They talked about his contract in this game. Phil had said that he was way overpaid. Not overpaid, but like it was very expensive. Like everyone was questioning their signing because it was 13 million plus a bonus.",
    "speaker" : "Steve",
    "timestamp" : "28:44-28:57"
  },
  {
    "text" : "To be fair, he did go for twelve hundred yards and six touchdowns.",
    "timestamp" : "28:58-29:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:01-29:12",
    "speaker" : "Steve",
    "text" : "Yeah, I don't think it was a I mean I think Cole's a good player, but that just struck me as like $13 million is like a s one season for a middling receiver, like a a number two receiver this day and age."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:12-29:17",
    "text" : "Yeah, but that's probably like what Brady was making these days too, right? 13 mil a year."
  },
  {
    "text" : "But again, hey, you're a big name who had a good performance recently. I don't care if you might be over the hill. Here's a shitload of cash. Come to Redskins.",
    "timestamp" : "29:17-29:25",
    "speaker" : "Steve"
  },
  {
    "text" : "So on top of Laverne's Coles, they also stole uh John Hall, the kicker. If you remember him, he just had a massive leg but couldn't kick straight. So his kickoffs would always go in the end zone, but uh his field goals, he was I think six for nine on the season so far this year. And then the kick returner, uh, was it Johnny Morton? Something Morton. Chad? Chad Morton? Something like that, yeah. Speedy guy, which I think we saw no, that was somebody else maybe. I think we saw him last year against the Jets, and it was like They're all about him. Like I think he maybe won one of the games for the Jets in overtime because he took a kickoff return back for a touchdown. I think that was him. And then uh guard Randy Thomas, who I have no idea. I've never heard of him. No idea. But that was their hall with signing all the Jets offensive players and kick returners and such. Um it did work out in this game. We'll we'll say the final score because we always forget to do that. Uh final score was Redskins 20, Patriots 17. Uh this may be the worst game we've seen Brady play.",
    "speaker" : "Andy",
    "timestamp" : "29:26-30:31"
  },
  {
    "timestamp" : "30:32-30:37",
    "text" : "Dude, after all that trash in the Redskins. Oh yeah, and the Patriots lost to him. Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "30:37-30:40",
    "speaker" : "Andy",
    "text" : "Which would be the last loss of the Patriots season."
  },
  {
    "text" : "Very distinctly actually because I was working at Best Buy, which was one of my first jobs.",
    "timestamp" : "30:40-30:45",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "30:46-30:46",
    "speaker" : "Andy",
    "text" : "Oh yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "And I had to work on a Sunday for the first time in my life. And I was like, what the fuck? He was sucked, working's not worth it, you know? And um everyone got to take a break, and they they took the break at the beginning of the game. Like all the more senior cashiers, whatever, saw stuck working while the Patriots are playing. And then I have to take my break for the second half. And glad I did, because they actually did make it a game.",
    "timestamp" : "30:47-31:15"
  },
  {
    "speaker" : "Andy",
    "text" : "They did. Uh the first half was nothing to write home about. Went into the half at 6-3 Redskins.",
    "timestamp" : "31:16-31:23"
  },
  {
    "timestamp" : "31:23-31:24",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "31:24-31:31",
    "speaker" : "Andy",
    "text" : "Um, it should have been 9-3, but uh their vaunted signing John Hall had a field goal blocked."
  },
  {
    "timestamp" : "31:31-31:33",
    "text" : "By Dan Clecko.",
    "speaker" : "Steve"
  },
  {
    "text" : "Dan Clecko signing, right. Right. Not a name you hear very often, but yeah. It wasn't so much that he blocked it that he just beat his blocker and the ball like hit him in the face mask too. Like it was a real low kick.",
    "speaker" : "Andy",
    "timestamp" : "31:33-31:48"
  },
  {
    "timestamp" : "31:48-31:49",
    "speaker" : "Steve",
    "text" : "Yeah, it was."
  },
  {
    "timestamp" : "31:49-31:51",
    "speaker" : "Andy",
    "text" : "Which I think was kind of John Hall's."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "31:52-31:58",
    "text" : "He's a local guy, right? Cleco? John Hall? Cleco, he was like a f oh he was a Jets guy, yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Like his dad was a Super famous Jets player and he was from Boston area. So he got a ton of press in Boston, but it was never any good.",
    "timestamp" : "31:58-32:05"
  },
  {
    "speaker" : "Greg",
    "text" : "He was from Mar he went to Marble High.",
    "timestamp" : "32:05-32:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "32:08-32:08"
  },
  {
    "speaker" : "Greg",
    "text" : "And then Temple for college. Because I remember people like used to love 'em. And I was like, yeah, I don't know who this this dude really didn't do enough to Yeah.",
    "timestamp" : "32:08-32:19"
  },
  {
    "speaker" : "Andy",
    "text" : "No, no, he didn't. To warrant it, yeah. Yeah. But there was nothing good in this this first half. Brady got picked off twice. You could tell Brady was hurting. They actually talked about Brady and all his injuries and just injuries in general, but Brady specifically before the game had his right elbow drained. Which I've never had a joint drained. I used to play soccer with a kid who had his knee drained once because it swelled up the size of like a grapefruit, which is fucking gross. But I can't imagine that's a good thing, right?",
    "timestamp" : "32:20-32:53"
  },
  {
    "text" : "No, but he's a tough son of a patient.",
    "speaker" : "Steve",
    "timestamp" : "32:53-32:55"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "32:55-32:59",
    "text" : "This is And we also know that he's dealing with a separated shoulder still."
  },
  {
    "text" : "Right.",
    "timestamp" : "32:59-33:00",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:00-33:08",
    "text" : "And so all all like they're all like, oh, so yeah, he's taking care of it by wearing one of those like athletic sleeves on his arm. Yeah, it wasn't a sleeve."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "33:08-33:12",
    "text" : "His arm was like the two arms are in two different sizes. That'll do it."
  },
  {
    "speaker" : "Greg",
    "text" : "You never drain the main vein, Andy. Come on now",
    "timestamp" : "33:12-33:15"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean I wouldn't call that a joint, but yeah. What does your moon vein look like, Greg? Taking a hard rice?",
    "timestamp" : "33:17-33:26"
  },
  {
    "speaker" : "Steve",
    "text" : "Let's get out of this. Let's get out of here.",
    "timestamp" : "33:27-33:28"
  },
  {
    "speaker" : "Greg",
    "text" : "Speaking of more really talk regularly. Can we do something right now that I just looked up? Can you look up Joe Clecco's uh Wikipedia picture, because it is. It's a nine and a half out of ten, boys. Joe Clecko's Wikipedia Wikipedia.",
    "timestamp" : "33:29-33:48"
  },
  {
    "text" : "This is dangerous. Do they get to pick their own Wikipedia pictures?",
    "speaker" : "Steve",
    "timestamp" : "33:49-33:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh my, I don't think so. I think they're users. I think you can. If you're on Wikipedia, you can submit it. But what is going on in that?",
    "timestamp" : "33:52-34:01"
  },
  {
    "speaker" : "Steve",
    "text" : "I can't spell Cleco.",
    "timestamp" : "34:01-34:02"
  },
  {
    "timestamp" : "34:03-34:06",
    "speaker" : "Andy",
    "text" : "It's with a K. K L E K L C K L E C K L."
  },
  {
    "speaker" : "Greg",
    "text" : "What the ever loving Who does he look like, Andy?",
    "timestamp" : "34:07-34:11"
  },
  {
    "text" : "Looks like the He looks like the guy from uh the Goonies.",
    "timestamp" : "34:12-34:16",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:17-34:19",
    "speaker" : "Greg",
    "text" : "Or like Princess Bride, isn't there like a"
  },
  {
    "timestamp" : "34:22-34:31",
    "speaker" : "Andy",
    "text" : "I remember dancing around the term here, but yeah, the R words. Yeah. Um looks like a red skin. Yeah, he's like he's got ill-fitting uniform on."
  },
  {
    "speaker" : "Steve",
    "text" : "Like Well the knee pads go like halfway down his shins.",
    "timestamp" : "34:32-34:36"
  },
  {
    "text" : "I don't think he has knee pads on, he just It's the guy yeah, it's uh it is.",
    "speaker" : "Andy",
    "timestamp" : "34:37-34:42"
  },
  {
    "text" : "It's the guy from the Princess Bride. That's Who is the guy that does that? He's the wrestler. Andre the Giant. He looks like an Andre the Giant. He died a small version.",
    "timestamp" : "34:42-34:53",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "34:53-34:54",
    "speaker" : "Andy",
    "text" : "With more hair."
  },
  {
    "timestamp" : "34:54-34:57",
    "speaker" : "Greg",
    "text" : "He looks like a young Andre the Giant."
  },
  {
    "timestamp" : "34:57-35:06",
    "speaker" : "Andy",
    "text" : "Alright, we'll have to pick it in the show notes too, because yeah, this is but he's like he's standing what next to what I imagine is his his coach."
  },
  {
    "timestamp" : "35:07-35:08",
    "text" : "This is a temple.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "35:08-35:19",
    "text" : "Yeah, yeah, it's got temple gear on. And the coach is holding a football in his hands, like at his waist, and and Mr. Clecko here seems to be looking at the football quizzically.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, with his helmet in his hand. Yeah, I don't know if he's shoveled looking.",
    "timestamp" : "35:19-35:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:24-35:38",
    "text" : "Yeah, the look on his face is something like either is that or why isn't that edible? I think it's is that edible is the look on that face. Can I eat it? I love it. All right, eat it. Wow. Okay."
  },
  {
    "text" : "Local energy Joe Cleco What was that guy's name, Steve? The one that we smoking butts in the sideline that we looked up as the Eagles",
    "timestamp" : "35:39-35:50",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, for the the Steagles.",
    "timestamp" : "35:52-35:54"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh play for the Steagles. Bucko Kilroy.",
    "timestamp" : "35:55-35:58"
  },
  {
    "text" : "Yes Nice memory.",
    "timestamp" : "35:58-36:00",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:01-36:02",
    "speaker" : "Steve",
    "text" : "I'm never gonna forget Bucko."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:02-36:04",
    "text" : "Bucko Kilroy, yeah."
  },
  {
    "timestamp" : "36:04-36:11",
    "speaker" : "Greg",
    "text" : "Bucko, Kilroy. Joe Clacko. Joe Clacko. They're guys from the same, they're cut from the same cloth."
  },
  {
    "speaker" : "Andy",
    "text" : "Definitely a different era. Absolutely. Good Lord. Speaking of balls, footballs being where they're not supposed to be, Brady did not look good in this first half. Throwing two through uh Interception in the end zone on like the one drive that they actually like right after the the block field goal they were driving again and uh they got a deep pass interference to I think it was",
    "timestamp" : "36:12-36:39"
  },
  {
    "speaker" : "Steve",
    "text" : "Givens got the uh no, it's Bethel Johnson because he got hurt on that plate too.",
    "timestamp" : "36:39-36:43"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:43-36:44",
    "text" : "Oh, that's right. Yeah."
  },
  {
    "text" : "Had Champ Bailey beat pretty short on him.",
    "timestamp" : "36:45-36:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:49-36:51",
    "text" : "But still get the PI and then like I think it was the neckle."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "36:51-36:54",
    "text" : "Bethel like Jacks his ankle up, it was gross. Yep."
  },
  {
    "timestamp" : "36:54-37:06",
    "text" : "So Brady gets picked off in the end zone. Washington, I think, go like three and out and they punt and then Brady tries to go deep again because it's like right at the end of the half and he gets picked off by Champ Bailey. But So you're basically in the half.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "So everyone in this in these first couple games, everybody's getting injured. It's ridiculous.",
    "timestamp" : "37:06-37:11"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:12-37:13",
    "text" : "Yeah, so I am a little bit more."
  },
  {
    "text" : "Kevin Falk got injured and like was limping the entire game. Bethlehem Johnson like jacks up his angle. He was like a second round pick that year, right? So your second pick. The Patriots were going into this game, were missing",
    "speaker" : "Steve",
    "timestamp" : "37:15-37:27"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:28-37:44",
    "text" : "nine opening day starters. They showed a graphic of it. So we have Roosevelt Colvid, Mike Compton, the starting guard, Ted Johnson, Adrian Clem, Fred McCray, the fullback, who cares, David Patton, Mike Vrabel, Ted Washington, and Damian Woody. So basically their entire linebacker core."
  },
  {
    "text" : "David Gibbons gets injured in this game too.",
    "speaker" : "Steve",
    "timestamp" : "37:46-37:48"
  },
  {
    "text" : "Like everybody's getting hurt. They they were starting, no offense to him, um Matt Chatham in this game, which I don't think they wanted to be. But he was in there as a starter. And I mean, didn't hear his name, so I think he played well.",
    "speaker" : "Andy",
    "timestamp" : "37:48-38:02"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "38:02-38:02"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:03-38:44",
    "text" : "But uh yeah, like they just didn't have any linebackers. Then like on the first drive, Brucey went down. And you're like, well, like you just don't have any linebackers left. And during this entire time, I'm thinking, yeah, and then you know the the whole like tight law's giving it a go because even though he didn't practice all week because of his ankle from last week. Um Methel Johnson went down and uh he didn't come back. And uh Kevin Falk was the starting running back and on the opening drive of the second half. He fumbled the ball, which Washington recovered in return to the New England one-yard line, like two plays in. And he hurt his hand on that play and he didn't return."
  },
  {
    "text" : "That was a good play by Champ Bailey. It was. Billy was legit in this game. Actually in general.",
    "speaker" : "Steve",
    "timestamp" : "38:44-38:50"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he was he was great in this game. Twelve time pro bowler. What number was he, Greg? He's twisted.",
    "timestamp" : "38:51-38:59"
  },
  {
    "text" : "He's the guy that traded Champ Daily Prozingma. Of course. Denver, right? Yeah. He traded to Denver Yeah. For uh the big name running back. Clinton Portis. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "38:59-39:10"
  },
  {
    "text" : "Yeah. He play five years in Washington.",
    "timestamp" : "39:10-39:14",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "It's like they they fucking stumble onto the uh an awesome cornerback and they're like, hey, look, that guy had a great season running the ball as a running back. We can't find one of those from Mike Shanahan. And then we'll trade our like a 12-time Pro Bowl corner for him. And Clean Force was good, don't get me wrong.",
    "timestamp" : "39:14-39:32"
  },
  {
    "timestamp" : "39:33-40:05",
    "text" : "You want to hear what he did after he got traded? Yep. He uh had three straight seasons where he was Pro Bowler, first team all pro And he won. He went to the Pro Bowl in one, two, three, four, five, six, seven, eight out of the next nine seasons. Oops. Spent ten ten years in ten years in Denver, eight Pro Bowls, three all pros. Well like he could have done that in in Washington, you know?",
    "speaker" : "Greg"
  },
  {
    "text" : "Like he's clearly an elite player. Good trade. Oops.",
    "speaker" : "Steve",
    "timestamp" : "40:05-40:08"
  },
  {
    "text" : "Yep. Yeah, how long did Clinton Portis last after you got traded to Washington?",
    "speaker" : "Andy",
    "timestamp" : "40:08-40:12"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:12-40:17",
    "text" : "Clinton Ports wasn't bad, but like it certainly wasn't eight Pro Bowls out of that's what I'm saying."
  },
  {
    "speaker" : "Andy",
    "text" : "Because running backs don't last that long, regardless.",
    "timestamp" : "40:17-40:19"
  },
  {
    "timestamp" : "40:21-40:27",
    "text" : "Which like obviously elevates a running back's value. And then he's like, well, I know that didn't work out, so it must have been Shanahan. Let's go get him.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "And they fight his ass.",
    "timestamp" : "40:29-40:30"
  },
  {
    "text" : "Throw money at him. There's no salary cap for coaches.",
    "timestamp" : "40:32-40:34",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "40:34-40:35",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Dude, he had a ridiculous year in two thousand and six too. 10 interceptions. Oh. Champ Bailey was awesome. He was. Eight picks in 2005 and then 10 in 2006. He had 18 picks over two seasons.",
    "speaker" : "Greg",
    "timestamp" : "40:35-40:51"
  },
  {
    "text" : "That's fucking insane. Why would you even throw it to him? Yeah, right? Like just don't even test the guy. What a beautiful.",
    "timestamp" : "40:51-40:58",
    "speaker" : "Andy"
  },
  {
    "text" : "LeVargte was pretty good too. He stuck around, I feel, because he like was in the Redskins radio and stuff. He's still around here.",
    "timestamp" : "40:59-41:06",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:06-41:15",
    "text" : "Yeah, that's like the only because when we went to the Redskins game, whatever that was together, the only jersey you saw were LeVar Arrington jerseys. Oh, you'll see. Players that weren't currently playing."
  },
  {
    "timestamp" : "41:16-41:33",
    "speaker" : "Steve",
    "text" : "Yeah, because like why would you buy a regular player like say, Oh wow, we got a really good cornerback. Let me buy his jersey. And then two years later they ship him off to Denver to play the next ten years as a pro bowler Yeah and they replacing with like Bruce Smith in the very like whole 18 of his career. He's not even on the back nine."
  },
  {
    "timestamp" : "41:34-41:41",
    "speaker" : "Andy",
    "text" : "What's his name? The defensive tackle from Tennessee. Albert Hainsworth. Hainsworth, yeah. So he can lay on the floor."
  },
  {
    "timestamp" : "41:41-41:45",
    "speaker" : "Greg",
    "text" : "Beyond Sanders. Sanders was the original one. Jeff George."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "41:45-41:45"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "41:46-41:47",
    "text" : "The list goes on and on."
  },
  {
    "text" : "Massive names.",
    "speaker" : "Andy",
    "timestamp" : "41:47-41:49"
  },
  {
    "timestamp" : "41:49-41:53",
    "speaker" : "Steve",
    "text" : "It's just everyone with a big name, even if they don't have the talent anymore to back it up."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:53-42:00",
    "text" : "It's where stars go to die is what I wrote. Under Bruce Smith. Oops."
  },
  {
    "timestamp" : "42:01-42:04",
    "speaker" : "Steve",
    "text" : "Uh hey, can we talk about Bruce Smith for a little bit though?"
  },
  {
    "timestamp" : "42:05-42:06",
    "speaker" : "Andy",
    "text" : "Let's do it."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "42:06-42:08",
    "text" : "His face mask, first of all, was ridiculous."
  },
  {
    "speaker" : "Andy",
    "text" : "Wait, which is school.",
    "timestamp" : "42:08-42:09"
  },
  {
    "timestamp" : "42:10-42:13",
    "text" : "Which Bruce Smith? The Buffalo Bills guy.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:13-42:14",
    "text" : "Which Bruce Smith."
  },
  {
    "timestamp" : "42:14-42:20",
    "speaker" : "Greg",
    "text" : "There's only one. Oh. I always get him and Bruce Allen mixed up. Bruce Allen is the GM, right? Yes."
  },
  {
    "text" : "Yeah, yeah, yeah.",
    "timestamp" : "42:21-42:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Totally different.",
    "timestamp" : "42:22-42:22"
  },
  {
    "timestamp" : "42:23-42:32",
    "speaker" : "Andy",
    "text" : "Yeah, Bruce Smith was the longtime Bill's um rush. Yeah. Who was like still third on the list in sacks or something ridiculous."
  },
  {
    "timestamp" : "42:32-42:40",
    "text" : "So they were they were he was chasing the NFL sack. uh can't crown at this point. Yeah. All time.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Only a few behind.",
    "timestamp" : "42:40-42:42",
    "speaker" : "Andy"
  },
  {
    "text" : "All I want to do is win and like Bro, we know that's not true. You're just getting the money from Snyder and then hoping to pick up your last couple of sacks and then ride off at the sunset. Yep. Which, uh, spoiler he does. Does he? Yeah. He has 200 sacks on his career. Wow. That's a lot of sacks. You want to guess he's number one?",
    "timestamp" : "42:42-43:02",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "43:02-43:04",
    "text" : "Uh wait. Straight hand.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "43:05-43:15",
    "speaker" : "Andy",
    "text" : "Yeah. No. No, Stray Hangers has the most in a season. Six. Oh, Reggie White. Um two. Yeah, no, Reggie White is who he took it from."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, Bruce Smith is number one.",
    "timestamp" : "43:15-43:16"
  },
  {
    "text" : "Bruce Smith is still number one?",
    "speaker" : "Andy",
    "timestamp" : "43:17-43:18"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:18-43:20",
    "text" : "Yes. Isn't that crazy? Wow."
  },
  {
    "timestamp" : "43:20-43:23",
    "text" : "So Bruce Smith, Reggie White, LT's got to be up there.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, he's a linebacker. No, he's not really up that high. He's number he's tied four about peppers.",
    "timestamp" : "43:24-43:29",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Peppers is up there.",
    "timestamp" : "43:29-43:30"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:30-43:34",
    "text" : "Peppers is four. So who's three then? Who are we missing, Greg?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:35-43:39",
    "text" : "They actually showed this in that game, Andy. They had a a compilation of everybody sacking Phil Sims."
  },
  {
    "timestamp" : "43:40-43:40",
    "speaker" : "Andy",
    "text" : "They did."
  },
  {
    "timestamp" : "43:40-43:57",
    "speaker" : "Greg",
    "text" : "I wrote that down for you guys. Maybe someone from the purple people eaters. Uh Steel Curtain. Eagles. Eagles? It's not Reggie White. Reggie White played on the Eagles."
  },
  {
    "timestamp" : "43:58-44:02",
    "text" : "It's kind of like a deep cut name. You wouldn't really think of it. It's Kevin Green.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh shit. Wait, Kevin, I I think Kevin mean Joe Green. Yeah, he was on the the steel curve most of that, yeah. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "44:02-44:11"
  },
  {
    "speaker" : "Andy",
    "text" : "So yeah, that makes sense.",
    "timestamp" : "44:11-44:12"
  },
  {
    "speaker" : "Greg",
    "text" : "Also another name dropped from this team, Fred Smoot.",
    "timestamp" : "44:13-44:16"
  },
  {
    "speaker" : "Steve",
    "text" : "Great name.",
    "timestamp" : "44:17-44:18"
  },
  {
    "speaker" : "Andy",
    "text" : "There's gotta be a Burmanism for that, Craig.",
    "timestamp" : "44:19-44:21"
  },
  {
    "text" : "Well, there is I I I don't know if we wanna well Get into the Fred Smoot um when he was in the Vikings to the The Love Boat. The love boat I was gonna go down that path, but leave. We did. We talked about that.",
    "speaker" : "Greg",
    "timestamp" : "44:21-44:38"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:38-44:38",
    "text" : "He didn't anything."
  },
  {
    "timestamp" : "44:41-44:43",
    "speaker" : "Steve",
    "text" : "On Reddit. He didn't ask me anything on Reddit. It was ridiculous."
  },
  {
    "text" : "Yeah. Yeah, he was yeah, he yeah. Listen to the uh the Vikings when we did last season if you want to hear about Fred Smoot and the the shit he was talking about that that whole situation because he he got into it details and everything um Speaking of of getting into it, um Adam Vinateri got into it by missing his own field goal from 48, which Would come into play later.",
    "speaker" : "Andy",
    "timestamp" : "44:44-45:15"
  },
  {
    "text" : "Yeah. I mean the block kick and the miss kick both really came into play because it was a three-point game.",
    "speaker" : "Steve",
    "timestamp" : "45:15-45:20"
  },
  {
    "timestamp" : "45:20-45:38",
    "text" : "Uh left. And the and so that led to one of the more ridiculous plays of the game. With uh Fox Special Trunk candidate breaking a huge run, ran for like 40 something yards. No, see this is territory.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "He ran for like 20 yards Tyrone Poole comes behind him and punches the ball out towards the end zone, which rolls another 45 yard or 25 yards. Yeah. And then they get it. Shouldn't that be a good one?",
    "timestamp" : "45:39-45:50"
  },
  {
    "speaker" : "Andy",
    "text" : "And then Washington recover at New England's 10.",
    "timestamp" : "45:50-45:53"
  },
  {
    "speaker" : "Steve",
    "text" : "I thought you can't like advance a fumble.",
    "timestamp" : "45:53-45:55"
  },
  {
    "text" : "Uh no, it's only within certain time. Like you can't advance a fumble like inside the 20-yard line under two minutes or something ridiculous.",
    "speaker" : "Andy",
    "timestamp" : "45:55-46:01"
  },
  {
    "text" : "This is why the NFL's stupid, because the rules like that. You can't you can't, you know? Nope. No, it's definitely it was just an unfortunate like it was a great play by Poole. Hey Steve, what's a catch? To go he went for the tackle and punched it out, but he just happened to he was like cut tackling from behind, you know?",
    "timestamp" : "46:01-46:17",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, it was the perfect goal line where there was nobody. And Willie McGinnis had a chance at it, but he he missed, and so the Redskins recovered at the ten, which set up uh A Brock Cartwright touchdown run. Another great name. Who? Rock Cartwright. Who? What's the name? Rock Cartwright?",
    "timestamp" : "46:18-46:36"
  },
  {
    "speaker" : "Steve",
    "text" : "That's the point. Like all the no-name gods and skins probably do all the good work.",
    "timestamp" : "46:38-46:41"
  },
  {
    "speaker" : "Greg",
    "text" : "Liddell Betts. His name was Rock.",
    "timestamp" : "46:42-46:44"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "46:45-46:46",
    "text" : "Rock."
  },
  {
    "speaker" : "Andy",
    "text" : "Rock Cartwright. No, rock.",
    "timestamp" : "46:47-46:49"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh.",
    "timestamp" : "46:49-46:49"
  },
  {
    "text" : "His full name is Roderick Rashawn Cartwright, but he goes by rock.",
    "timestamp" : "46:49-46:53",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:53-46:56",
    "speaker" : "Greg",
    "text" : "Yeah. That's because he likes likes getting stoned."
  },
  {
    "text" : "Hey uh we didn't get stoned on that touchdown run. But that finally wakes Brady up because they're now down 20 to 3. Starts connecting with people and hits a deep ball to Givens for a diving touchdown. That was a sweet thing. Sweet throw. Finally overthrew somebody instead of underthrowing them on a deep ball. Yep. Beautiful touchdown. So now it's uh 20 to 10. And uh going into the fourth quarter, Washington doesn't do anything. So Pats are driving near midfield and Brady gets picked off yet again to start the fourth quarter. And that's kind of like that was probably the turning point where the like the Patriots had been driving and they were getting some momentum and that just fucking killed it. Um At this point, Washington's like running the clock, which is stupid.",
    "speaker" : "Andy",
    "timestamp" : "46:58-47:45"
  },
  {
    "timestamp" : "47:46-47:58",
    "text" : "Well yeah, it's like five minutes left. They had the ball. And they could have just like, you know, put together a little four minute offense and put salt of the game away, but The Redskins are the Redskins. What are they got? Three and out and they punted it back.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yep.",
    "timestamp" : "47:59-47:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:59-48:04",
    "speaker" : "Steve",
    "text" : "And then played prevent. Right. It's like, ah, three minutes left. Let's go into our pre-vent defense. Yeah."
  },
  {
    "text" : "And so they immediately go to to uh to prevent. And Bray just starts slinging. They go no huddle. And he finally scores a touchdown to Larry Senters, just over like just before the two-minute warning. So now it's close. Now it's 1720.",
    "timestamp" : "48:05-48:18",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:19-48:22",
    "speaker" : "Steve",
    "text" : "This has got to be centers only touchdown catch."
  },
  {
    "timestamp" : "48:22-48:23",
    "speaker" : "Andy",
    "text" : "With the Patriots."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "48:23-48:25",
    "text" : "I honestly forgot he's even on this team."
  },
  {
    "text" : "He was featured a lot in this game because they didn't have anybody else because Antoine Smith is the wheels have fallen off that train.",
    "timestamp" : "48:26-48:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I wouldn't be surprised if he doesn't play too much more because he had a pretty dirty hit too.",
    "timestamp" : "48:32-48:36"
  },
  {
    "timestamp" : "48:36-48:38",
    "text" : "Falk was Falk was done too, yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:38-48:45",
    "text" : "Uh his is he only played one year in New England. That was his only touchdown catch, but he had 28 for his career",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:45-48:54",
    "text" : "Yeah, yeah, he didn't doesn't he or at at the time he held the record for like catches or receiving yards or something as a running back."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "48:55-49:26",
    "text" : "Because we saw him against six thousand receiving yards over his career. That's pretty good. Nine years. As a wide receiver, yeah. Like that was a runner for yeah as a fullback. He is not that's probably what it is. Fullback most receiving yards for a fullback, not six thousand sixty eight hundred. He almost had a thousand yards one year in Arizona. Had 101 catches."
  },
  {
    "timestamp" : "49:27-49:37",
    "speaker" : "Andy",
    "text" : "Oh my God. Right? That's crazy, man. That's nuts. Like this is a fullback. A fullback. He's not a fullback. That's what he's listed as, dude."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:37-49:38",
    "text" : "Yeah, I'm pretty sure he was."
  },
  {
    "speaker" : "Andy",
    "text" : "He was like a third down fullback.",
    "timestamp" : "49:43-49:45"
  },
  {
    "timestamp" : "49:48-49:51",
    "text" : "Six foot two twenty-five, so he's a fucking he's a thick boy.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "How big was Kevin Falk? Or Antoine Smith for that matter. Antoine's probably about the same size, maybe bigger.",
    "timestamp" : "49:52-49:58"
  },
  {
    "timestamp" : "49:59-50:03",
    "text" : "Why won't you just let us have this one, Andy? Yeah, right. You know what, Greg? This has a fullback.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:04-50:13",
    "text" : "You can have it. You know what? I'm gonna look up Antoine Smith. The best pass catching fullback in the history of the Patriots."
  },
  {
    "timestamp" : "50:13-50:35",
    "speaker" : "Greg",
    "text" : "Oh, Antoine Smith listed as running back. 6'232. So he's bigger. He's taller, two inches and six pounds. So there's definitely lower BMI. Okay, good. That's sort of. Trust me, I did a lot of BMI research last week."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:35-50:49",
    "text" : "Yeah, that's true, you didn't you. Oh God. Oh speaking of which you uh I forgot. You wanted to circle back to something because you forgot to bring it up last week and you told me to remind you. I'm guessing you forgot that too."
  },
  {
    "text" : "The the teenage slang. What I forgot this. We'll come back to it. Let me find where it was. That's fine.",
    "timestamp" : "50:49-50:57",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "50:57-51:07",
    "speaker" : "Andy",
    "text" : "Yeah, let's just finish this game real quick. So in what Steve was saying, um Let me take this from there."
  },
  {
    "speaker" : "Steve",
    "text" : "Let me let me think us through here because if anyone knows the Redskins, it's me.",
    "timestamp" : "51:07-51:11"
  },
  {
    "timestamp" : "51:11-51:12",
    "speaker" : "Andy",
    "text" : "Okay."
  },
  {
    "text" : "And like they can only not be the Redskins for so long, you know?",
    "timestamp" : "51:12-51:16",
    "speaker" : "Steve"
  },
  {
    "text" : "True.",
    "speaker" : "Andy",
    "timestamp" : "51:16-51:17"
  },
  {
    "text" : "And so we get the ball back after we score the touchdown. We like line up for the onside kick and kick it deep when there's nobody back there, of course. You know, we don't just throw one guy back there just in case. So there's no one there. But the it goes. They still get it on their 20 or so. And then they have an intentional grounding penalty, which isn't called. So they so they they dodge a bullet with the intentional grounding that's not called. And then they false start. And so you're going back five yards, so yeah, whatever, you know, kind of on third down, right? Yeah, yeah. And then they fall start again. So now they're back ten yards, so it's pretty much like you did have the intentional grounding anyways. Yeah. And then they miss their they have a third and sixteen or whatever it is. So pretty long, third and long that almost gets converted by Santana Moss",
    "speaker" : "Steve",
    "timestamp" : "51:17-52:06"
  },
  {
    "timestamp" : "52:06-52:07",
    "speaker" : "Andy",
    "text" : "Yeah. But he can't hold it."
  },
  {
    "timestamp" : "52:07-52:12",
    "text" : "In this day and age, probably would have been because he like fumbled like lost control coming out of bounds, you know, as he hit the ground.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "52:13-52:22",
    "speaker" : "Andy",
    "text" : "Yeah. Like caught it, got two feet down, but then like as he hit the ground, the ball popped those. Yeah. So it probably would have been a catch these days, but it wasn't back then, yeah. Didn't make a football move."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "52:22-52:49",
    "text" : "So now you're punting from like your 10, you know, punter standing kind of on this goal line. And they fall start again. Now your punter's punting from the back of his own end zone. His own fucking end zone. And he punted like that's your response. You've taken like twenty-five seconds off the clock, fall started three times, got away with an intentional grounding. Here you are punting the ball back to Tom Brady, who just scored a touchdown in like a minute."
  },
  {
    "text" : "And he punts at like 30 yards, but the ball like rolls a bit. So the Pages start at the Washington 45-yard line.",
    "speaker" : "Andy",
    "timestamp" : "52:49-52:55"
  },
  {
    "timestamp" : "52:55-52:56",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "52:56-53:10",
    "speaker" : "Andy",
    "text" : "With one timeout in like just under two minutes. Um but just the way this game is going, um the Patriots literally go well, not three and out, but four and out. Uh can't convert fourth down."
  },
  {
    "speaker" : "Steve",
    "text" : "I thought they had like one first down. It was like where they could have no, they didn't mean Manada, but like it's been like a long, long field goal. Yeah, so that was the thing.",
    "timestamp" : "53:10-53:20"
  },
  {
    "text" : "It would have been like a a long fifty plus yarder, but because um Vinateri missed from forty-eight earlier I think they decided it was out of his range.",
    "timestamp" : "53:24-53:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "53:39-53:53",
    "text" : "I don't know. I thought that play call or that was kind of questionable. Kick it and see what happens. I mean, best part is you win the game, worst part is you know, you lose it, and fourth down, you're like, What are you gonna lose it? You're trying to go for the touchdown to win all the way outright? I didn't understand that."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:54-54:19",
    "text" : "Yeah, I mean there was still enough time that you probably could have like if you converted that first down taken a couple shots to win it before kicking the field goal but you were on that like typical Belichick We're not gonna kick a field goal from here because it's too far. We're not gonna punt it. So we're just gonna go for the fourth down. Fuck it. It didn't work. So They missed that and Washington knelt to win it. That was it. I do have one small line call, though."
  },
  {
    "timestamp" : "54:19-54:22",
    "text" : "Kind of bullshit though, right? Well I why would you run a draw play?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "54:23-54:24",
    "text" : "That's my point, yeah."
  },
  {
    "text" : "Yeah. It's third and five.",
    "timestamp" : "54:24-54:26",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "54:27-54:27",
    "speaker" : "Steve"
  },
  {
    "text" : "You're like fringe field goal wrench, just throw the ball.",
    "timestamp" : "54:27-54:30",
    "speaker" : "Greg"
  },
  {
    "text" : "You have a minute left. You're saying, all right, we're gonna go for it, like have two shots at that first down, you know? Yeah. Throwing the ball. As opposed to drop. Yeah, but you like a drop point says I want to get a couple extra yards so I can kick it. Two chances are thrown for five.",
    "timestamp" : "54:30-54:46",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "figured that Washington would be uh expecting them to sling it, trying to go for that deep pass.",
    "timestamp" : "54:50-54:57"
  },
  {
    "text" : "Yeah, but what they should have realized is that the Redskins are inept and been like they're probably don't adjust.",
    "timestamp" : "54:57-55:04",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "55:04-55:16",
    "text" : "Well, they actually talked about how um uh uh Steve Spurrier ha like needed to learn that other teams adjust to his game plan."
  },
  {
    "timestamp" : "55:16-55:21",
    "text" : "Yeah. Because here not just at the half, but like series to series.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "55:25-55:47",
    "text" : "Marker down. You know, Greg, I'll make a real quick point going back to what the Patriots have adjusted to after that one play. And Steve Spurry has probably found this out In college, teams don't adjust, holding against New England. They don't adjust sometimes for a whole game. In the NFL, they adjust after you show it to them one time. So that is a tremendous difference. Holding.",
    "speaker" : "Announcer"
  },
  {
    "text" : "A tremendous difference. The teams will adjust to what you're doing. And gameplay.",
    "timestamp" : "55:49-55:54",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:00-56:02",
    "speaker" : "Steve",
    "text" : "I can't just pay whoever I want."
  },
  {
    "text" : "I think Stephen's over there nodding. Yeah. Yeah. I think it's a whole different uh if I was a college coach, I would never move to the NFL.",
    "speaker" : "Greg",
    "timestamp" : "56:02-56:12"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah.",
    "timestamp" : "56:12-56:13"
  },
  {
    "speaker" : "Andy",
    "text" : "Unless you peek Carol and it's all about to come crashing down on you.",
    "timestamp" : "56:13-56:16"
  },
  {
    "speaker" : "Steve",
    "text" : "Also, the rules are different. I literally just learned last weekend that there's no two-minute warning in college.",
    "timestamp" : "56:16-56:20"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:22-56:24",
    "text" : "Did you know that the clock stops if you get a first down in college?"
  },
  {
    "text" : "I d I did know that. I did know that. But like I was like, well they don't have any timeouts, they got a two-minute warning. My friend was like, no, they don't.",
    "timestamp" : "56:24-56:30",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "56:31-56:33",
    "text" : "Did you know you only have to get one foot in?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "56:33-56:46",
    "text" : "Yeah, I knew that. Gotcha. All right. And like if he's not as done, then you're you're down. I know most of them, but there's a lot of like again, it's why football spokes do, but there's so many rules",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "56:46-56:54",
    "text" : "And they're different between the Yeah, and then the college will have the different rules. It's like imagine if soccer was like that. Like you go to the Premier League and now all of a sudden there's no offsides.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:54-57:02",
    "text" : "Like basketball is the same pretty much. Like the timing is a little different and the three-point line's different sides, but like the rules of the game. For the same."
  },
  {
    "speaker" : "Andy",
    "text" : "But even that, it's like why not just make it all standardized?",
    "timestamp" : "57:02-57:05"
  },
  {
    "text" : "Because people in college suck. And they can't hit the long three-pointer.",
    "speaker" : "Steve",
    "timestamp" : "57:05-57:10"
  },
  {
    "text" : "Yeah. You think that's bad? You should see medical device regulations. Seriously, it's the fucking worst.",
    "speaker" : "Greg",
    "timestamp" : "57:10-57:20"
  },
  {
    "timestamp" : "57:20-57:21",
    "text" : "Oh yeah?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Every single country has a different regulation and they all have to audit you. And it's all the same fucking thing. They're all just people that are too stubborn to be like, all right, why don't we just stick with one set of rules? Say like, no, I have to honor you too. No, I gotta audit you too. I gotta audit too. What I want to audit too. Next thing you know, you got like sixteen nations in your front fucking lobby.",
    "timestamp" : "57:21-57:45"
  },
  {
    "speaker" : "Steve",
    "text" : "Speaking of our words, let's uh",
    "timestamp" : "57:45-57:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, all right, you go first.",
    "timestamp" : "57:53-57:55"
  },
  {
    "timestamp" : "57:55-57:59",
    "speaker" : "Steve",
    "text" : "You seem like you're uh I have a lot of bests actually, so I can go last if you want to."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, all right, yeah, you go last because I I have kind of the opposite Greg, you want to go first? Sure.",
    "timestamp" : "57:59-58:04"
  },
  {
    "text" : "Steve Spurrier, head ball coach. That's a great nickname, by the way. Head ball coach. That's his nickname? Wait, that's his real nickname? You never heard that? No.",
    "timestamp" : "58:06-58:19",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, that's so they call Steve Spurrier. Did he give it to himself? That sounds like a nickname he gave himself.",
    "speaker" : "Andy",
    "timestamp" : "58:19-58:25"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh I don't know where it came from. Oh guys, well name Steve a call me head ball coach. He won't he's a pretty sassy guy though.",
    "timestamp" : "58:25-58:32"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "58:32-58:34",
    "text" : "He's really southern sassy for sure."
  },
  {
    "timestamp" : "58:35-58:45",
    "speaker" : "Greg",
    "text" : "Yeah. Uh apparently the citrus bowl was like The second place finisher in the SEC would go to the Citrus Bowl."
  },
  {
    "timestamp" : "58:46-58:46",
    "speaker" : "Andy",
    "text" : "All right"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "58:46-59:18",
    "text" : "So he said, I know why Peyton Manning came back for his senior year. He wanted to be a three-time Citrus Bowl MVP. That's not bad. I love that. That's not bad. Yeah. He fucking kicked ass at Florida. One national championship, uh played in two in a row, 95-96, won six SEC championships, and was SEC coach of the year five times. And I mean the SEC is not some fucking Joe Conference that's the best conference in football."
  },
  {
    "timestamp" : "59:19-59:22",
    "text" : "Maybe not quite back then, but Yeah, maybe not back then, but yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "So yeah, Steve Spurrier. He's he's my best. I had a lot of fun uh looking looking up stuff from him.",
    "timestamp" : "59:22-59:29"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:29-59:29",
    "text" : "Love it."
  },
  {
    "speaker" : "Greg",
    "text" : "My worst. Uh I want to say like last week it was kind of a roll reversal this week as far as like the stats go where last week they got like outgainaged Out yardage on paper that looked like they should have lost. And this week was the opposite. They had way more yards. It was 387 at 253. I mean, Washington only had 134 yards in the air. The Patriots like should have won this game if you look at it just from the stats. But again, it's like turnovers.",
    "timestamp" : "59:30-01:00:03"
  },
  {
    "timestamp" : "01:00:03-01:00:29",
    "speaker" : "Andy",
    "text" : "It's it Yeah. They showed us they showed a couple stats actually. Um Uh yeah, I think it was in the fourth quarter they showed one uh total yards in the second half, and the Patriots were ahead two forty-six to seventy-eight. And then uh the QB comparison uh in the second half Your boy Pat Ramsey was two for five for 12 yards. Brady was 16 for 20, 193 yards, two touchdowns and a pick"
  },
  {
    "text" : "I do think though, like I don't know, that's misleading.",
    "timestamp" : "01:00:29-01:00:32",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:00:32-01:00:37",
    "speaker" : "Andy",
    "text" : "I thought Patrick Ramsey actually played pretty decently in like He did, but they didn't even they just didn't play half."
  },
  {
    "speaker" : "Steve",
    "text" : "Don't make the big mistake.",
    "timestamp" : "01:00:42-01:00:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, what was the the rushing totals, Greg, comparatively?",
    "timestamp" : "01:00:43-01:00:47"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:00:48-01:01:08",
    "text" : "The rushing totals I don't know. The best stack of it. I think 100 to 100. Washing it at 120. All I have right now is like net passing yards and total yards. But there's like 100 is it's equivalent."
  },
  {
    "text" : "Uh let's see, rushing yards. Uh Patriots 30 for 106 and Redskins were 29 for 119. So 100 to 100. Yeah, give or take.",
    "speaker" : "Andy",
    "timestamp" : "01:01:09-01:01:18"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:01:20-01:01:33",
    "text" : "But again, like the but the game was kind of in hand to the Redskins and Hydra Ramsey played fine. He didn't make any dumb throws really. I thought he looked okay. I'm sure Dan Snyder was sitting there and being like, yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "He looked like uh I have written down he looks like a poor man's Brett Favre. Because he was just like slinging it. He was doing the sidearm throw, like off bounce, like into double coverage, and it was working for him. They're talking about how strong his arm was.",
    "timestamp" : "01:01:33-01:01:47"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Absolutely nothing to do with football, so. Maybe like uh Snyder went to like a track and field event in college or whatever, whatever he competed and he threw a 73-yard javelin throw.",
    "timestamp" : "01:01:48-01:02:04"
  },
  {
    "text" : "Yeah. Yeah, well something meters, but they convert it into 73 yards, which is that's far as javelin throw.",
    "speaker" : "Andy",
    "timestamp" : "01:02:04-01:02:11"
  },
  {
    "timestamp" : "01:02:11-01:02:12",
    "speaker" : "Steve",
    "text" : "That seems like a legit throw."
  },
  {
    "speaker" : "Greg",
    "text" : "I have no frame of reference for what's a far javelin throw. I don't know either. But I don't think I could throw 73 yards. throw this like yeah I'm getting like 20 yards maybe tops yeah it's a good point just if I was standing on a football field how how far could I throw the perfectly weighted stick Yeah. Probably not 73 yards.",
    "timestamp" : "01:02:12-01:02:32"
  },
  {
    "timestamp" : "01:02:32-01:02:36",
    "text" : "No, I maybe half that. I can't throw a football that far.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I can't throw a baseball that far. Not without a couple bounces.",
    "timestamp" : "01:02:37-01:02:42"
  },
  {
    "timestamp" : "01:02:42-01:02:47",
    "speaker" : "Steve",
    "text" : "I bet the Redskins would have drafted uh Jamarcus Russell if they had the chance."
  },
  {
    "timestamp" : "01:02:47-01:02:52",
    "speaker" : "Andy",
    "text" : "I bet they would have. I bet they were trying to trade up for him, but they just couldn't. Yeah. All right."
  },
  {
    "speaker" : "Steve",
    "text" : "So it's your worst, Greg.",
    "timestamp" : "01:02:52-01:02:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. That was his worst.",
    "timestamp" : "01:02:55-01:02:58"
  },
  {
    "speaker" : "Greg",
    "text" : "That was my worst. Patriots outgating, but turnover. Also another another best here. The field f field judge for this game, Boris Cheek.",
    "timestamp" : "01:02:58-01:03:09"
  },
  {
    "text" : "Bo cheek, baby. Bo cheek. Bo cheek. Keep an eye out. Keep an eye out for him the rest of the season. Some good names on that re on the officials list. Jim Quirk, Ed Camp, and Boris Cheek.",
    "speaker" : "Andy",
    "timestamp" : "01:03:12-01:03:25"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean, there's a great names all game here. Trunk Candidate, Fred Smoot. Smoot.",
    "timestamp" : "01:03:26-01:03:32"
  },
  {
    "timestamp" : "01:03:32-01:03:36",
    "speaker" : "Andy",
    "text" : "And they k they kept uh they kept smoothing the smoot chant. Yeah."
  },
  {
    "text" : "And they did that with Bruce Smith too with Bruce. Yeah. Even Liddell betts is like, I don't know, it just rolls off the tongue. Smookie's dad, right? That's a good idea. I kept thinking Mookie.",
    "timestamp" : "01:03:37-01:03:47",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:03:48-01:03:49",
    "speaker" : "Andy",
    "text" : "That's why I heard Mookie."
  },
  {
    "speaker" : "Greg",
    "text" : "What do you want to say? Can you name that other guy there? Ohilate? Ohete? Try it, Andy. Where? Ifianyi Ohelete?",
    "timestamp" : "01:03:50-01:04:01"
  },
  {
    "speaker" : "Steve",
    "text" : "Where?",
    "timestamp" : "01:04:02-01:04:03"
  },
  {
    "text" : "I see Zeron Flemister.",
    "timestamp" : "01:04:03-01:04:05",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:04:06-01:04:08",
    "speaker" : "Steve",
    "text" : "Whoa, that's a good one too. Whoa."
  },
  {
    "text" : "Pepi Zellner? Pepi Zellner? Yeah. He had a uh uh uh pass knock down.",
    "speaker" : "Andy",
    "timestamp" : "01:04:08-01:04:14"
  },
  {
    "timestamp" : "01:04:15-01:04:15",
    "text" : "Jeez, dude.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:04:16-01:04:20",
    "text" : "Some great name? Peppy Zellner. No, it is it. Give it to me.",
    "speaker" : "Andy"
  },
  {
    "text" : "Hundman's Giuseppe Zellner.",
    "speaker" : "Greg",
    "timestamp" : "01:04:21-01:04:24"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:25-01:04:34",
    "text" : "So he goes by he goes by his middle name's nickname. That's legit. It doesn't even go about Giuseppi's on there."
  },
  {
    "text" : "Yeah. I love that's Peppy with an eye too.",
    "timestamp" : "01:04:35-01:04:37",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. Peppy. Like Peppy longstocking.",
    "timestamp" : "01:04:37-01:04:40"
  },
  {
    "text" : "A little peppy.",
    "speaker" : "Steve",
    "timestamp" : "01:04:40-01:04:40"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:41-01:04:42",
    "text" : "Oh that's peppy, Andy."
  },
  {
    "text" : "A little peppy.",
    "timestamp" : "01:04:42-01:04:43",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:04:46-01:04:47",
    "speaker" : "Andy",
    "text" : "Peppy long stalking Zellner."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:04:48-01:04:55",
    "text" : "Okay, okay. Where is this guy from? What is that? Is that Italian? I mean Giuseppe's Italian. Giuseppe is definitely Italian."
  },
  {
    "timestamp" : "01:04:55-01:04:59",
    "text" : "Greg is from Georgia. I knew that.",
    "speaker" : "Andy"
  },
  {
    "text" : "I'm just that's why I didn't say where is he from, Andy.",
    "speaker" : "Greg",
    "timestamp" : "01:04:59-01:05:02"
  },
  {
    "speaker" : "Andy",
    "text" : "I just said what is that name? All right, Steve, give me your best and worse",
    "timestamp" : "01:05:02-01:05:06"
  },
  {
    "timestamp" : "01:05:07-01:05:12",
    "speaker" : "Steve",
    "text" : "You don't want me to go instead of you? All right. Like I said, I have a lot."
  },
  {
    "timestamp" : "01:05:12-01:05:39",
    "speaker" : "Andy",
    "text" : "All right. I'll go first then. Um My best is Rodney Harrison and his shoestring tackles. I had that one. Every time he's he's running a guy down from behind, he just like dives at their back leg and clips it like he used to do in high school to your friends walking down the Yeah. Like walking down the hallway, clip the back leg so it kicked there. Yeah. And he would do that and they would it it would hit him on a full sprint and they just go f straight face down into the turf."
  },
  {
    "speaker" : "Steve",
    "text" : "Well they're also like the two times he did it, they're big plays. One like where you're getting beat, like they call it the perfect play on a a screen on a blitz. Yep. And if he didn't make that tackle, it was probably six. And the other one was same idea, he's covering coals. In like a zone.",
    "timestamp" : "01:05:40-01:05:55"
  },
  {
    "timestamp" : "01:05:55-01:05:56",
    "speaker" : "Andy",
    "text" : "Yeah, Lavrett's cool."
  },
  {
    "timestamp" : "01:05:56-01:06:02",
    "speaker" : "Steve",
    "text" : "It was like a third and ten and Coles Adam pretty much beat. And if he doesn't make that tackle, he's probably going for like 40-50."
  },
  {
    "text" : "Yeah, it's going, he's gone down the sidelines, and he just barely clipped them.",
    "timestamp" : "01:06:02-01:06:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "late in the game to get the Patriots the ball back. It was uh That was his thing, yeah.",
    "timestamp" : "01:06:05-01:06:09"
  },
  {
    "text" : "Um so that was awesome. Uh And there was also Tom Brady, I think like uh I think it was the first drive where Uh as Phil Sims is saying, um, you know, they're talking about Brady's arm and his elbow and everything, how he had it drained before the game. Um, and so they say, you know, running the football protects your quarterback as they're running a reverse that Brady is the lead blocker on. Yeah. Which he throws like he throws his shoulder, his bad shoulder, into whoever it was that he's trying to block. It was uh slow getting up. Like, oh you gotta be kidding me.",
    "speaker" : "Andy",
    "timestamp" : "01:06:10-01:06:48"
  },
  {
    "speaker" : "Steve",
    "text" : "It was Champ Bailey.",
    "timestamp" : "01:06:48-01:06:50"
  },
  {
    "speaker" : "Andy",
    "text" : "I think it may have been, yeah.",
    "timestamp" : "01:06:50-01:06:51"
  },
  {
    "text" : "He was trying to drive block Champli, but with like a cut block.",
    "speaker" : "Steve",
    "timestamp" : "01:06:51-01:06:54"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:54-01:07:02",
    "text" : "Yeah. And this is on the first drive, and I'm like, I wrote down he's a lead blocker in the reverse with a bad elbow, knock that shit off."
  },
  {
    "text" : "And he definitely looked like he got like it hurt like a motherfucker.",
    "timestamp" : "01:07:02-01:07:04",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:07:05-01:07:23",
    "speaker" : "Andy",
    "text" : "Slow getting up and you're like, oh my, what are you doing? Um And then uh my worst is John Hall's helmet. He's he had a face mask that looked like uh his helmet was sliding down the front of his face. And that's probably why he missed so many kicks, I think."
  },
  {
    "text" : "He was the opposite of Bruce Smith. Yeah, Bruce Smith had half his forehead exposed.",
    "speaker" : "Steve",
    "timestamp" : "01:07:23-01:07:27"
  },
  {
    "text" : "John Oh yeah Bruce Smith helmet was great. like super old school lineman helmet. It's the same one that uh John Clecko was probably holding in his hand. Yes. It may have been the same helmet. It might have been and then I'll see if I can post this picture on the show notes, but um this picture of Snyder Which it wasn't even a touchdown. No, it was a fumble return that that was obviously down to one and he was doing this. And he just you just want to punch him right in the teeth.",
    "timestamp" : "01:07:27-01:08:04",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That looks like like if a European like came to an NFL game and was like, what are we doing?",
    "timestamp" : "01:08:04-01:08:10"
  },
  {
    "text" : "Is this what we do here? Is it this no, this is what um Why is fingers? Yeah, yeah. It's just like he doesn't know how to celebrate foot. That was my worst is just watching that fucker get to celebrate.",
    "speaker" : "Andy",
    "timestamp" : "01:08:10-01:08:33"
  },
  {
    "text" : "And then they replayed it too, which was even worse.",
    "speaker" : "Steve",
    "timestamp" : "01:08:33-01:08:35"
  },
  {
    "text" : "Yeah. Yeah, and he's like trying to high-five his his buddy standing there too, his hedge fund buddy, whatever the fuck that was, and they like couldn't high five.",
    "timestamp" : "01:08:36-01:08:43",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, whole thing is brutal, brutal.",
    "timestamp" : "01:08:43-01:08:48",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:08:49-01:09:04",
    "text" : "Yeah, and then also the last thing, um oh I got I I got a couple here. Um this we already talked about the sack leader highlights all showing them sacking Phil Sims. was beautiful. And Phil Sims is like, I did not like that one bit. Shut the fuck up, Phil."
  },
  {
    "text" : "I liked Phil.",
    "timestamp" : "01:09:04-01:09:05",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, yeah, it was fine. Um but the audio in this, because this was obviously from a VHS tape, but it felt like Uh for some reason at certain points the audio for either Phil or Greg Gumble would kind of like go up a little bit into chipmunk territory. Did you notice that? No. It was especially like when they would cut away from the game and they were like showing like a a stat or something. Like their voice would get just a little bit higher and it would start sounding like this and and then it would come back again. And Even in some spots, listen listen for for the next game too. Cause it happened in the in the last game and I forgot to mention it. But it it happened At certain points when like Phil Sims would get excited about something. So all of a sudden something's happy. And he starts sound sounding like this. And then the the the play would be over and he'd he'd go back to normal. It was great. It just added a little bit of flair to a game that I didn't really want to watch because I knew the past lost. To the fucking redskins.",
    "speaker" : "Andy",
    "timestamp" : "01:09:06-01:10:00"
  },
  {
    "text" : "Are you sure it was like something to do with the audio quality or maybe he was just Yeah, no, it because it was coming back in and out.",
    "timestamp" : "01:10:00-01:10:06",
    "speaker" : "Greg"
  },
  {
    "text" : "To the point where he gets excited.",
    "speaker" : "Andy",
    "timestamp" : "01:10:07-01:10:09"
  },
  {
    "speaker" : "Steve",
    "text" : "We should probably imagine if everyone wants to watch these actual games and really like listen to how the pitch of Phil Sin's voice and find out if Andy's actually Talking about the truth or not, they are available on the PGSdynasty. info website.",
    "timestamp" : "01:10:09-01:10:24"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. Yeah, I post the game every time in the show notes. Um",
    "timestamp" : "01:10:25-01:10:29"
  },
  {
    "text" : "So I know you guys are all over like, yeah, wow, that's such a great insight, Indy. Uh must be the VHS quality. Let me go and watch this game for a couple hours to see if it's there.",
    "speaker" : "Steve",
    "timestamp" : "01:10:30-01:10:40"
  },
  {
    "timestamp" : "01:10:40-01:10:43",
    "text" : "It's right at the beginning too. It starts early. Cool.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:10:44-01:10:48",
    "text" : "All right. I can't believe no one's talked about the best best from this game."
  },
  {
    "speaker" : "Andy",
    "text" : "Let's hear it.",
    "timestamp" : "01:10:48-01:10:49"
  },
  {
    "text" : "The absolutely brutal sack from William McGuinness",
    "speaker" : "Steve",
    "timestamp" : "01:10:49-01:10:53"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:53-01:10:57",
    "text" : "Oh yeah, that I have that as a highlight. It is the cleanest thing."
  },
  {
    "text" : "It was like if you uh hit a driver flush. You know? You just middle middle it and it's just like The most clean fucking I didn't watch this game. That's fine. It's on the highlights on uh Peaches Dynasty Influx like the number one highlight.",
    "timestamp" : "01:10:57-01:11:11",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "It is. It's the first time.",
    "timestamp" : "01:11:10-01:11:11"
  },
  {
    "speaker" : "Steve",
    "text" : "He comes off in the red zone. I think right there early in the game when like right after Bruce goes down, everyone's like, Man, what the hell are we gonna do? And really comes in and is like, I got this, and yeah, comes clean off the edge and just",
    "timestamp" : "01:11:11-01:11:21"
  },
  {
    "text" : "Bam. Can you see this, Greg? Uh-huh. So watch Bob. Just clean. It's the cleanest sack I've seen in a long time from a Patriots player. It was sexual. Just straight up like he gets a full head of steam and Patrick Ram, he's coming from the quarterback's like front side, not even his blind side, but the quarterback just doesn't even see him. And just shoulder directly into the chest and cleans him out.",
    "timestamp" : "01:11:22-01:11:50",
    "speaker" : "Andy"
  },
  {
    "text" : "And it wasn't even like, you know, sometimes you see those and it like hurts you because it looks so violent, but that was just like fluid. Yeah. Where like it almost like seemed like Ramsey was like kinda leaning into it before. So it was just like he just like picked him up and carried him and just like boom play over.",
    "speaker" : "Greg",
    "timestamp" : "01:11:51-01:12:06"
  },
  {
    "speaker" : "Andy",
    "text" : "Beautiful.",
    "timestamp" : "01:12:08-01:12:08"
  },
  {
    "speaker" : "Steve",
    "text" : "And it was a big sack too. Like it was huge, yeah. At the beginning of the game, they were in the red zone on the 10-yard line and that's they they stalled them for a field goal there. Yep. Uh cost Steve. I also saw a commercial for the brand new Hummer. It's hilarious because like right now they're releasing commercials for the brand new Hummer. That's true, yeah. That's electric. This is hilarious. Like we've come full circle. Uh my worst, and it pains me to say it, is uh it's kind of like a best and worst. No. Right? There's a play where Patriots are in kind of thirty ish on the Redskins and um Brady tries for a quick slant, like a hot read on a blitz.",
    "timestamp" : "01:12:09-01:12:52"
  },
  {
    "text" : "Oh, this is a good point.",
    "timestamp" : "01:12:52-01:12:53",
    "speaker" : "Andy"
  },
  {
    "text" : "Throws it to Troy Brown and Troy turns. He's just not he's like a second behind Brady, so when he he flips his head around, the ball's on him already. He just is not ready for it and it bounces off him. right up in the air and there's like a crowd of people.",
    "speaker" : "Steve",
    "timestamp" : "01:12:53-01:13:07"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:13:07-01:13:07"
  },
  {
    "speaker" : "Steve",
    "text" : "And a Dion just grabs it out of nowhere.",
    "timestamp" : "01:13:07-01:13:11"
  },
  {
    "timestamp" : "01:13:11-01:13:13",
    "speaker" : "Andy",
    "text" : "On third, like on third and three too."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:13:14-01:13:14"
  },
  {
    "text" : "Yeah. In the red zone. Convert off. And now that plays also on the website too.",
    "speaker" : "Andy",
    "timestamp" : "01:13:14-01:13:18"
  },
  {
    "speaker" : "Steve",
    "text" : "So negative on Troy. Come on. Come on, buddy. You know?",
    "timestamp" : "01:13:18-01:13:21"
  },
  {
    "speaker" : "Andy",
    "text" : "I think it was a timing issue.",
    "timestamp" : "01:13:22-01:13:23"
  },
  {
    "text" : "Yeah, yeah. It's probably not really Troy's fault. Maybe it was Brady. Brady threw it too quick.",
    "speaker" : "Steve",
    "timestamp" : "01:13:23-01:13:27"
  },
  {
    "text" : "Yeah, Brady was overcommentating at this point, hucking the balls in there because he'd been under throwing everybody.",
    "timestamp" : "01:13:27-01:13:32",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:13:32-01:13:43",
    "text" : "And then I had a couple uh pluses as well for Brady. Even though you've kind of played pretty poorly on this. That Sick Given's touchdown was his fiftieth touchdown.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh damn.",
    "speaker" : "Andy",
    "timestamp" : "01:13:44-01:13:44"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:13:44-01:13:49",
    "text" : "That was a nice little uh TD. Great, great pass for his touch 50th."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:13:50-01:13:50",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:13:50-01:14:10",
    "speaker" : "Steve",
    "text" : "And then um it's awesome to see Brady showing uh Bruce respect. He didn't get a sack, but he uh Bruce Smith had a sick ass spin move on Matt Light, just totally left him in the dust. Brady's able to get rid of it pretty quick. It was like a three-step drop, right? And he still got like knocked to the ground. And you watch the replay closely. He's like patting his helmet as he's Yeah he was. You know? He's like that was a sweet moves."
  },
  {
    "text" : "Typical brain, that's what he does every time somebody gets him on the ground. He's probably talking shit to him, but he's patting him on the helmet about it.",
    "speaker" : "Andy",
    "timestamp" : "01:14:10-01:14:16"
  },
  {
    "timestamp" : "01:14:18-01:14:29",
    "text" : "He's a competitor. That was a sweet, sweet move by Bruce Smith. I think it's pretty cool that I didn't I didn't know that until doing the research for all this, that Bruce Smith is the all-time NFL sec leader.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:14:30-01:14:35",
    "speaker" : "Andy",
    "text" : "And I'm sure he had a few sacks of Patriot quarterbacks in his days with the Bills too."
  },
  {
    "timestamp" : "01:14:35-01:14:40",
    "speaker" : "Steve",
    "text" : "Oh yeah. He's been eating Drew Bredso's a lot. I mean a lot of those is built on Drew Bledsoe and trying to"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and Steve Krog. Yeah.",
    "timestamp" : "01:14:40-01:14:42"
  },
  {
    "text" : "And let's be real, if Drew Butts hadn't tried to throw the ball away and made like six interceptions in Bruce's grass, he probably would have had six more sacks.",
    "speaker" : "Steve",
    "timestamp" : "01:14:42-01:14:49"
  },
  {
    "text" : "Oh yeah. Yeah. He would have got to 200 much quicker. Mm-hmm.",
    "timestamp" : "01:14:50-01:14:53",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:14:54-01:14:58",
    "text" : "Nice. We don't have to go sell out in Washington, D. C. for Dan Snyder.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Hey, you gotta make that money.",
    "timestamp" : "01:14:59-01:15:00"
  },
  {
    "text" : "Yeah, I'm all about it. Hope you got paid a shitload.",
    "speaker" : "Steve",
    "timestamp" : "01:15:01-01:15:04"
  },
  {
    "speaker" : "Andy",
    "text" : "We should also talk about this uh Patriots defense too because uh again I think we talked about this last week, but this does not look like a team that's about to win 22 straight football games.",
    "timestamp" : "01:15:05-01:15:14"
  },
  {
    "text" : "Absolutely not.",
    "timestamp" : "01:15:14-01:15:15",
    "speaker" : "Steve"
  },
  {
    "text" : "Like injured dude. Right. They have nobody left. Brady looks like he's struggling. But this defense, they showed a stat. Um this obviously must have been before they scored the two touchdowns the um Redskins scored their two touchdowns, but Uh opponents in Page's territory uh in the last three games, which I'm assuming doesn't count. Well no, it has to count week one, because this is week four of the season. So the the last three games, the first three games of the season. The 19 drives in Patriots territory for the opponents has turned into four punts, four takeaways, eight field goals attempts, one loss on downs, and two touchdowns. On 19 drives, they score two touchdowns.",
    "timestamp" : "01:15:15-01:15:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:16:00-01:16:07",
    "speaker" : "Steve",
    "text" : "Yeah, so some of the signs are there that they're actually one of it is like they're able to compete pretty well despite all the injuries."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:16:07-01:16:07",
    "text" : "Yeah."
  },
  {
    "text" : "And maybe that really does help them of like, you know, when we get people back and the depth in the team is really, really solid. It's gotta be. A good draft with Asante Samuel getting reps, you know.",
    "timestamp" : "01:16:08-01:16:18",
    "speaker" : "Steve"
  },
  {
    "text" : "Eugene Wilson.",
    "speaker" : "Andy",
    "timestamp" : "01:16:19-01:16:20"
  },
  {
    "text" : "He's he's already their starting safety at this point. And he's what four games into his rookie year.",
    "speaker" : "Steve",
    "timestamp" : "01:16:20-01:16:25"
  },
  {
    "timestamp" : "01:16:25-01:16:33",
    "speaker" : "Andy",
    "text" : "Yeah. I mean it's by default almost, but yes. All right, Greg, what did you have? Something about teenagers?"
  },
  {
    "timestamp" : "01:16:33-01:16:37",
    "text" : "Are you guys done your best and worse? Steve, you don't get any you got anything else?",
    "speaker" : "Greg"
  },
  {
    "text" : "I'm good. He only had four. How dare you.",
    "speaker" : "Andy",
    "timestamp" : "01:16:37-01:16:39"
  },
  {
    "timestamp" : "01:16:41-01:16:46",
    "speaker" : "Greg",
    "text" : "Well my worst is all this losing. I think if they lose if they lose another game, I'm quitting."
  },
  {
    "speaker" : "Steve",
    "text" : "That's one more to go, Greg.",
    "timestamp" : "01:16:49-01:16:50"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, this website I found last week when we were talking about children's uh teen slang, if there's any parents on the uh that listen to the podcast, I want to point them in the direction of netsanity. net. Forward slash teenslash slang dash parents guide. It's it's it's all about decoding teens slang And what what is what's just good harmless what's good harmless fun and what you need to be concerned about? Yes. So they got um Let's see what categories. Well, the ways how to stay on top of the trends in terminology. Um, one idea they have is to bookmark urg urban dictionary. Oh.",
    "timestamp" : "01:16:53-01:17:42"
  },
  {
    "text" : "That is.",
    "speaker" : "Steve",
    "timestamp" : "01:17:42-01:17:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:17:46-01:17:49",
    "text" : "No, you you should just I'm sure they have an app. You should just download the app to your phone."
  },
  {
    "text" : "Just like, no, that that website is for very specific things only. You know, you don't want to just go poking around in there and see what you find. And really it should be urban to story, shouldn't it?",
    "timestamp" : "01:17:49-01:17:59",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:18:00-01:18:33",
    "speaker" : "Greg",
    "text" : "Yeah, can you imagine like that's a couple middle-aged parents like suburbia white Kids and they're just like, what is this fucking website? Good God. Uh they got uh they got a couple of different categories how to how to look for things here. You know, they have um Fun and harmless teen teenage slang like bruh, fam, goat, Hundo P"
  },
  {
    "text" : "In your estimation, Greg, how up to date is this website? You are wearing a backwards hat right now.",
    "speaker" : "Steve",
    "timestamp" : "01:18:35-01:18:42"
  },
  {
    "text" : "It's uh it's definitely a little bit old because there are like things to keep your eye on Up and coming. They're like it a lot of people sound like they're starting to use this thing called TikTok. Um they got uh so they have like harmless fun and then they have teen slang terms to keep your eye on. Bay, that could be concerning. What? Avocado. What is avocado supposed to mean? Uh used to describe a person who is socially construed as straight by those around him or her, but in actuality is gay. Oh, so they're in the closet. Yeah, so Andy. If you if you if you disagree. Speak now or or be ever Thought of as an avocado Avocado Andy. Avocado Andy",
    "timestamp" : "01:18:42-01:19:52",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:19:55-01:20:06",
    "text" : "We've done 40 something episodes of this fucking podcast. The one time I gotta leave to go pee. We just lost our LGBTQ plus crowd."
  },
  {
    "text" : "Uh so you want to hear some of the warning flags? This is that teenage slang you better fucking shut your shit down for. Oh girl. Netflix and chill. Oh yeah. What does that mean? If you see your kids doing that, it could mean open quotation, making out closed quotation or sex. Oh man. Oh boy.",
    "timestamp" : "01:20:08-01:20:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Why is making out in quotes? No.",
    "timestamp" : "01:20:36-01:20:38"
  },
  {
    "timestamp" : "01:20:39-01:20:40",
    "speaker" : "Greg",
    "text" : "Scare quotes?"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh no, I don't know.",
    "timestamp" : "01:20:40-01:20:41"
  },
  {
    "speaker" : "Greg",
    "text" : "It is. Um smash to have casual sex. It's one to keep an eye on. Also, this is my favorite. 420 slang for marijuana. If you haven't figured that one out by yet, your kids are already maladjusted.",
    "timestamp" : "01:20:42-01:21:07"
  },
  {
    "timestamp" : "01:21:07-01:21:14",
    "speaker" : "Steve",
    "text" : "Yeah, you're it's like your whole this website isn't gonna help you. Like there's so many other things. It's probably not even on this site."
  },
  {
    "text" : "Oh, all those parents up there, that is netstandity. net forward slash teenslang parents guide Oh boy, I love fucking old people.",
    "speaker" : "Greg",
    "timestamp" : "01:21:15-01:21:29"
  },
  {
    "speaker" : "Steve",
    "text" : "Especially you, mom. We love ya.",
    "timestamp" : "01:21:31-01:21:34"
  },
  {
    "text" : "I would say I'm the hippies one on this podcast, right? Why do you say that?",
    "speaker" : "Greg",
    "timestamp" : "01:21:34-01:21:39"
  },
  {
    "text" : "Um that's like saying you're the tallest midget, but okay. You're the youngest, so I guess by default.",
    "speaker" : "Andy",
    "timestamp" : "01:21:41-01:21:49"
  },
  {
    "timestamp" : "01:21:50-01:21:52",
    "speaker" : "Greg",
    "text" : "We don't use the M word around here."
  },
  {
    "speaker" : "Andy",
    "text" : "What do we use?",
    "timestamp" : "01:21:52-01:21:53"
  },
  {
    "timestamp" : "01:21:53-01:21:55",
    "text" : "Greg, you're the smartest redskin.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:21:57-01:21:58",
    "speaker" : "Andy",
    "text" : "Oh, that's better."
  },
  {
    "text" : "I believe the term is the one-eyed man in the land of the blind.",
    "timestamp" : "01:22:01-01:22:05",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:22:06-01:22:09",
    "text" : "That would be you. That's giving yourself way too much credit, Deb."
  },
  {
    "timestamp" : "01:22:10-01:22:17",
    "speaker" : "Andy",
    "text" : "I I think that's true, yeah. You're the two-eyed man in the land of the one-eyed. Yeah. I'm so lit. It's no better."
  },
  {
    "speaker" : "Greg",
    "text" : "I'm Gucci, bro. You trying to curve me right now? Don't make me ghost you.",
    "timestamp" : "01:22:17-01:22:28"
  },
  {
    "speaker" : "Steve",
    "text" : "You're just reading off this website.",
    "timestamp" : "01:22:29-01:22:31"
  },
  {
    "speaker" : "Greg",
    "text" : "Yo, you salty. Low key. Andy is an avocado. Avocado Andy for sure. Did you hear that, Andrew? I sure did. Okay.",
    "timestamp" : "01:22:32-01:22:45"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:22:45-01:22:47",
    "text" : "That's cool. You're ghetto spread."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:22:47-01:22:57",
    "text" : "Andy, you're fucking your avocado toast, bro. I'm pretty sure Avocado is just like a way to make fun of millennials. Avocado toast?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:22:58-01:23:01",
    "text" : "Possibly. Yeah. I'm not a hip, Greg. You tell us."
  },
  {
    "text" : "You guys know yeet?",
    "timestamp" : "01:23:02-01:23:03",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:23:04-01:23:04",
    "speaker" : "Steve",
    "text" : "Yep."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:23:09-01:23:12",
    "text" : "Swallow yeah that's that's what I do when I go to swallow foods baby."
  },
  {
    "timestamp" : "01:23:13-01:23:19",
    "speaker" : "Greg",
    "text" : "Turnt up you you get turned up at swall foods in goddamn right on that kombucha"
  },
  {
    "speaker" : "Andy",
    "text" : "This isn't organic.",
    "timestamp" : "01:23:20-01:23:21"
  },
  {
    "text" : "I keep it hunting.",
    "timestamp" : "01:23:21-01:23:22",
    "speaker" : "Steve"
  },
  {
    "text" : "I chug that butcha, baby. I keep it, honey. All the avocados you can eat, boy. Yeah, that's Gucci, man.",
    "timestamp" : "01:23:23-01:23:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:23:33-01:23:45",
    "text" : "I I tried to use Gucci with this girl I managed and she's like, hey, is this good? And I was like, it's Gucci. And I spelled it G-U-C-H-I because like that's how you spell Gucci, right?"
  },
  {
    "text" : "No. Even I know that's not right. It's G-O-O-C-H-I.",
    "timestamp" : "01:23:45-01:23:52",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know if that's right or not, but I'm assuming it's right.",
    "timestamp" : "01:23:54-01:23:57",
    "speaker" : "Steve"
  },
  {
    "text" : "No, that's gooch, which is so yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:23:59-01:24:01"
  },
  {
    "timestamp" : "01:24:02-01:24:06",
    "speaker" : "Steve",
    "text" : "So now it's I use that all the time. That feels right."
  },
  {
    "speaker" : "Announcer",
    "text" : "Look at it, he is podcasting.",
    "timestamp" : "01:24:07-01:24:09"
  },
  {
    "text" : "Hey Kelly, you're live on the podcast. What a unique Chicks, huh?",
    "timestamp" : "01:24:09-01:24:24",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:24:26-01:24:33",
    "text" : "Is that on the is that on the website, Greg? Chicks? What does that mean? There's gotta be something applicable on here.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:24:34-01:24:40",
    "speaker" : "Andy",
    "text" : "So I I heard that there was a term smash, but is there something for uh doing a tie law dance afterwards?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, something for that. The the smash and sweep.",
    "timestamp" : "01:24:41-01:24:46"
  },
  {
    "speaker" : "Greg",
    "text" : "Straight fire, something hot or trendy. That could apply. Yo, Andy, you're looking like a snack.",
    "timestamp" : "01:24:48-01:24:54"
  },
  {
    "text" : "I am a snack. Are you B4? Because I'm trying to buy a snack.",
    "timestamp" : "01:24:55-01:25:02",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:25:02-01:25:07",
    "speaker" : "Greg",
    "text" : "Yeah. G-N-O-C, Andy. I don't know that one. Get naked on camera."
  },
  {
    "timestamp" : "01:25:09-01:25:29",
    "speaker" : "Andy",
    "text" : "Now they're making shit up. I love these things. That's on warning. That's all warning flags. That is it. Dude, this is bougie? Are you bougie, Greg? That's a good one. You are acting a little extra, I will say."
  },
  {
    "text" : "All right. Speaking of absolutely useless drivel, let's wrap this podcast up.",
    "speaker" : "Steve",
    "timestamp" : "01:25:29-01:25:34"
  },
  {
    "text" : "Yeah. Yeah. All right, what's next week? Who we playing? Who we got?",
    "timestamp" : "01:25:35-01:25:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "We got the Tennessee Titans a rematch from late last year. Yeah. This is it, right?",
    "timestamp" : "01:25:41-01:25:48"
  },
  {
    "speaker" : "Steve",
    "text" : "This isn't that the last loss.",
    "timestamp" : "01:25:48-01:25:50"
  },
  {
    "timestamp" : "01:25:50-01:25:54",
    "text" : "But to tune in next week and find out Steve. I don't remember.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:25:55-01:25:59",
    "speaker" : "Andy",
    "text" : "Steve. I don't know anything. We actually talked about this with Brian Morey."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, we're like they score a touchdown and like everyone cheers at the wrong time because the Red Sox are playing or some shit like that.",
    "timestamp" : "01:25:59-01:26:04"
  },
  {
    "text" : "Correct. And the Patriots are so angry that they decided they would never lose again.",
    "timestamp" : "01:26:04-01:26:10",
    "speaker" : "Andy"
  },
  {
    "text" : "I love it. So the",
    "speaker" : "Steve",
    "timestamp" : "01:26:10-01:26:15"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:26:16-01:26:20",
    "text" : "Oh, but before we go, don't forget we have a hotline."
  },
  {
    "text" : "Oh yes.",
    "speaker" : "Steve",
    "timestamp" : "01:26:21-01:26:22"
  },
  {
    "timestamp" : "01:26:22-01:26:23",
    "speaker" : "Andy",
    "text" : "What's the number stage?"
  },
  {
    "timestamp" : "01:26:24-01:26:25",
    "speaker" : "Steve",
    "text" : "Sent you anything, Andy?"
  },
  {
    "text" : "Uh well those episodes haven't aired yet, so no.",
    "timestamp" : "01:26:26-01:26:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:26:29-01:26:30",
    "text" : "Oh. Right."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:26:31-01:26:37",
    "text" : "But they'll start airing this week, I think. So I will keep you posted. What's the number?"
  },
  {
    "timestamp" : "01:26:37-01:26:41",
    "speaker" : "Greg",
    "text" : "Uh I'm texting you for 5555."
  },
  {
    "speaker" : "Andy",
    "text" : "603.",
    "timestamp" : "01:26:42-01:26:43"
  },
  {
    "speaker" : "Greg",
    "text" : "Hi, is it Neanderthones here? No motherfucker. He's not real. Yeah, also a hot tip for all our fans, the Dave Chappelle show all on Netflix now. Yes. So check that out.",
    "timestamp" : "01:26:43-01:26:58"
  },
  {
    "timestamp" : "01:26:59-01:27:04",
    "speaker" : "Steve",
    "text" : "I just texted 603-505-8043. Yeah."
  },
  {
    "text" : "Which may or may not be Andy Brown.",
    "timestamp" : "01:27:05-01:27:08",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, apparently it goes right to Andy because I just texted me as an avocados.",
    "timestamp" : "01:27:09-01:27:12"
  },
  {
    "timestamp" : "01:27:14-01:27:25",
    "speaker" : "Andy",
    "text" : "I got it on my computer so I can I can respond. So again, we will put out the warning that it is not a one-way form of communication. Wait, did we say it can go both ways?"
  },
  {
    "speaker" : "Steve",
    "text" : "It was it was 505 Troy Brown for three. For three, right, there it is.",
    "timestamp" : "01:27:26-01:27:33"
  },
  {
    "text" : "So yeah, Troy Brown shooting a three-pointer from the corner.",
    "speaker" : "Andy",
    "timestamp" : "01:27:33-01:27:35"
  },
  {
    "speaker" : "Steve",
    "text" : "I bet Troy Brown's a great basketball player.",
    "timestamp" : "01:27:36-01:27:38"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:27:38-01:27:44",
    "text" : "Oh yeah. I bet he's a glue guy. He's a hustler. Yeah. He gets back on defense."
  },
  {
    "timestamp" : "01:27:45-01:27:45",
    "speaker" : "Steve",
    "text" : "Yes. Yeah."
  },
  {
    "text" : "Great teammate, great passer. Great passer.",
    "timestamp" : "01:27:46-01:27:48",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:27:49-01:27:57",
    "text" : "But also can and can nail a three. And when he nails it, everyone's all about it. Oh yeah, you know he's think people love Scalabrini threes? No. Everyone loves Troy Brown for three.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh yeah. Which there is a a college basketball player now, I think, Troy called Troy Brown.",
    "timestamp" : "01:27:57-01:28:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:28:02-01:28:02",
    "text" : "Yes.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:28:03-01:28:12",
    "text" : "Because when I was looking for Troy Brown jerseys, Troy Brown college jerseys. Uh can't find him, but you can find the uh the basketball player. I think he's gonna go to college.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:28:12-01:28:16",
    "text" : "I think isn't there a Trey Barn in the NBA? Or like the G League at least."
  },
  {
    "timestamp" : "01:28:17-01:28:22",
    "speaker" : "Andy",
    "text" : "Well he might be in the MA now, but when I was looking at Oswald's looking at Troy Brown college was he went to Marshallburg. Oh yeah."
  },
  {
    "text" : "The thundering herd. Yeah, he's on the The Wiz, right?",
    "speaker" : "Greg",
    "timestamp" : "01:28:22-01:28:27"
  },
  {
    "text" : "And Moss. Yeah. DC has their own Troy Brown playing basketball.",
    "speaker" : "Steve",
    "timestamp" : "01:28:27-01:28:31"
  },
  {
    "speaker" : "Andy",
    "text" : "See? Always gotta get the uh the wrong one though.",
    "timestamp" : "01:28:32-01:28:36"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean our Troy Brown's definitely better. That's what I'm saying.",
    "timestamp" : "01:28:36-01:28:40"
  },
  {
    "timestamp" : "01:28:40-01:28:41",
    "text" : "So, all right. Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:28:41-01:29:02",
    "speaker" : "Greg",
    "text" : "Next week Steve McNair, Jeff Fisher, Eddie George, Frank Wycheck, and the three-and-one Tennessee Titans come to Gillette Stadium. The Patriots are reeling. The Patriots are favored by one point going into this game. Really? What? Yeah. How? Own field advantage, baby. Still fans."
  },
  {
    "timestamp" : "01:29:02-01:29:04",
    "speaker" : "Andy",
    "text" : "I guess so. Still fans."
  },
  {
    "speaker" : "Greg",
    "text" : "I can't wait till the day where like, oh yeah, there used to be fans in the stands that changed the batting lines.",
    "timestamp" : "01:29:06-01:29:11"
  },
  {
    "speaker" : "Andy",
    "text" : "They used to have football.",
    "timestamp" : "01:29:11-01:29:13"
  },
  {
    "timestamp" : "01:29:14-01:29:17",
    "text" : "It's a game that you can find on the line. Fucking dare say that, Andy.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, at least we have this podcast to memorialize it.",
    "timestamp" : "01:29:17-01:29:20"
  },
  {
    "timestamp" : "01:29:20-01:29:46",
    "speaker" : "Greg",
    "text" : "That's true, yeah. Patriots are currently 2-4. They're reeling, but I'm not giving up yet. We had the Jets. That's this week. We're gonna five, Greg. I made a bet this week with the Dolphins fan of my work. Whoever Finishes higher in the in the division has to buy the other person a jersey of their choice."
  },
  {
    "text" : "Oh whoever finishes higher buys the jersey.",
    "timestamp" : "01:29:46-01:29:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "No loseres. Yeah, the loser.",
    "timestamp" : "01:29:50-01:29:51"
  },
  {
    "timestamp" : "01:29:52-01:29:56",
    "speaker" : "Andy",
    "text" : "Loser buys a jersey. All right. Yep. I love that. Jersey of their choice. What jersey would you choose?"
  },
  {
    "text" : "I don't know. I got my eye on a Randy Moss jersey because I don't trust anybody on the current roster to be on the team next year.",
    "speaker" : "Greg",
    "timestamp" : "01:29:57-01:30:03"
  },
  {
    "timestamp" : "01:30:05-01:30:08",
    "text" : "I would have said Chase Winovich a couple of weeks ago, but oops.",
    "speaker" : "Steve"
  },
  {
    "text" : "I was gonna say I was gonna say Gilmore 'cause he's twenty four. So you may as well add to that twenty four collection",
    "timestamp" : "01:30:08-01:30:13",
    "speaker" : "Andy"
  },
  {
    "text" : "If he wins, he wants a two one. I'm just gonna order him a Ryan Fitzpatrick one and just be like, deal with it.",
    "speaker" : "Greg",
    "timestamp" : "01:30:12-01:30:18"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, that's what I'm no, Greg, order my tua from uh Maryland, a little tua.",
    "timestamp" : "01:30:21-01:30:26"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh.",
    "timestamp" : "01:30:27-01:30:27"
  },
  {
    "timestamp" : "01:30:30-01:30:52",
    "speaker" : "Andy",
    "text" : "Oh Jesus. I love it. All right. Well, we will find out how these Patriots do. Because uh just like today's Patriots, these ones are reeling starting the season. Need to write the ship. against the uh incoming Tennessee Titans. So we'll see you next week on the Patriots Tennessee podcast. See you later."
  },
  {
    "speaker" : "Announcer",
    "text" : "See you later. See you later.",
    "timestamp" : "01:30:53-01:30:54"
  }
]