[
  {
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother."
  },
  {
    "speaker" : "Andy",
    "text" : "Welcome back to the Patriots Dynasty Podcast. I'm your host Andy Brown. With me are my the beautiful brothers. We are all for some reason dressed the same today. With our baby blue shirts and our backwards wall caps.",
    "timestamp" : "00:23-00:39"
  },
  {
    "timestamp" : "00:40-00:41",
    "text" : "Brother Intuition.",
    "speaker" : "Steve"
  },
  {
    "text" : "I guess so. We didn't even call each other for this. It just happened. Don't you love it when that happens?",
    "timestamp" : "00:41-00:45",
    "speaker" : "Andy"
  },
  {
    "text" : "Colin Cowherd would be pissed off. Why? Because we're all matching? No, because he hates people that wear their hat backwards. Oh, that's right. He was calling out Carson Wentz saying he's like immature for wearing his hat backwards at a press conference.",
    "speaker" : "Greg",
    "timestamp" : "00:45-01:02"
  },
  {
    "speaker" : "Andy",
    "text" : "How dare he. You never see Kim Newton wear a backwards hat. That's for sure.",
    "timestamp" : "01:03-01:07"
  },
  {
    "text" : "Can't tell if a top hat's backwards or forwards, though. See?",
    "timestamp" : "01:10-01:13",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13-01:20",
    "text" : "Loophole, baby. So was the argument that the hat was backwards or that he had a hat on at all? Like if he had worn it forwards, would that have been okay?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. It's the backwards that got a a B in his bonnet.",
    "timestamp" : "01:20-01:25"
  },
  {
    "timestamp" : "01:25-01:30",
    "speaker" : "Steve",
    "text" : "Oh man, that's a shame. It's a shame. We're Colin Cowherd, my poor guy."
  },
  {
    "speaker" : "Andy",
    "text" : "Speaking of um cow herding, um No. No, I couldn't do it. I couldn't fit that in. Um this week is 2003 week three. We're um Getting along in the in the 2003 season. It's been kind of an enjoyable, more enjoyable than last season. I th I think I realize why. It's because there's a payoff at the end of this season. So the wins are fun to watch and the losses like don't matter as much because you know how it ends.",
    "timestamp" : "01:32-02:04"
  },
  {
    "timestamp" : "02:04-02:09",
    "text" : "Yeah, none of those. Oh man, if we only won this game then. Exactly, exactly.",
    "speaker" : "Steve"
  },
  {
    "text" : "Um but yeah, this is uh the Jets coming to town. The 0-2 New York Jets struggling on the season. Um We've kind of talked, these jets aren't much different than in the past.",
    "timestamp" : "02:09-02:23",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "02:24-02:38",
    "speaker" : "Steve",
    "text" : "Well, this is recovered in uh the Chad Pennington deep dive, right? This is he must have got hurt in that fourth preseason game, so like three games ago. Right. And they're back to back to the well with Vinny."
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly. That's what I was going to say. The only real difference from the last time we saw them was uh the starting quarterback is back to Vinny Testavardi. Vinny uh Greenhead. Greenhead.",
    "timestamp" : "02:38-02:47"
  },
  {
    "text" : "Yep. Old Greenhead himself.",
    "timestamp" : "02:48-02:50",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Green testicle. Um and what a difference it makes. Final score. Indeed. Yeah, it wasn't even that close, I feel like.",
    "timestamp" : "02:51-03:03"
  },
  {
    "timestamp" : "03:05-03:05",
    "speaker" : "Andy",
    "text" : "It wasn't that."
  },
  {
    "speaker" : "Steve",
    "text" : "What do you think, Greg, since you watched the whole thing? You know, how did you feel the ebbs and flows of the game?",
    "timestamp" : "03:06-03:10"
  },
  {
    "text" : "I did not watch this one. I give it a two out of six. All right. That's the one that's there wasn't there wasn't much noteworthy. I don't know. These Jets games, it's all is the same roster. Like the Bills, you got the Bledsoe stuff. The dolphins, I guess, are kind of entered to the Jets just are they just bore me in this generation, you know? They don't they're not terrible, but they're not good. They're just kind of like eh.",
    "timestamp" : "03:11-03:43",
    "speaker" : "Greg"
  },
  {
    "text" : "I'm gonna give it a three AO three Super Bowl trophies in an AOC championship.",
    "speaker" : "Steve",
    "timestamp" : "03:44-03:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "03:50-03:50"
  },
  {
    "timestamp" : "03:50-03:58",
    "speaker" : "Steve",
    "text" : "Because while I agree with you, Greg, not a lot going on in this game. You gotta bump it up one trophy just because you're beating the Jets."
  },
  {
    "speaker" : "Andy",
    "text" : "I knew that's where you're headed with that. Yeah, I was gonna give it three because it's beating the Jets, but I I kind of do it by how many highlights I can pull from a game when I'm doing it, and so I can put them on the website. And I think there were four total highlights in this entire game. Uh and I think they were like two of them were in the first quarter and the other two were in the fourth quarter. Like it was not it was a there was a big gap in the middle that was just borderline unwatchable.",
    "timestamp" : "03:59-04:28"
  },
  {
    "timestamp" : "04:28-04:33",
    "text" : "As we discussed before we started recording though, Andy, you missed the good lowlights.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:34-04:38",
    "text" : "Yeah, I don't add other teams' highlights to a patrons website."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "04:38-04:45",
    "text" : "It feels no it's not their highlights. This is the stuff don't want us to see. Right? This is the stuff they're ashamed of."
  },
  {
    "timestamp" : "04:45-04:47",
    "text" : "Are you censoring?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Well Greg, I don't know if he's if you saw this play or not, but the uh fake field goal pass to Kevin Mwai, the center.",
    "timestamp" : "04:47-04:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Kevin Mawai. Alright, we're just gonna we're just gonna get into this. We're not gonna talk about the Jets. Great. Um yeah, so you want to talk about the Jets, Andy? Yeah. I have I have a um A trivia question for you. Okay. Okay. Since uh in honor of Vinny Testaverdi being back. Tom Brady, uh that just this week was named NFC Player of the Month, right? Uh today maybe actually yesterday, something like that. And he became the fourth QB twin it in both the AFC and the NFC. Can you name the other three?",
    "timestamp" : "04:55-05:31"
  },
  {
    "text" : "Venita Severdi. Yeah, duh. One of them.",
    "timestamp" : "05:32-05:34",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Uh he did it three it uh three separate times.",
    "timestamp" : "05:35-05:39",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Once Bucks Patrick in 1990.",
    "timestamp" : "05:39-05:42"
  },
  {
    "text" : "No, that was one of my guesses, but nope. Bucks, Browns, and Jets was Vinnie Testaverdi. Drew Breath. No.",
    "speaker" : "Andy",
    "timestamp" : "05:42-05:49"
  },
  {
    "speaker" : "Steve",
    "text" : "McNabb. Is it like a this generation guys?",
    "timestamp" : "05:50-05:55"
  },
  {
    "timestamp" : "05:55-06:34",
    "text" : "Uh they're names you've heard of, but they're kind of earlier than than this. The other two. That's a deep, that's a deep I wasn't born. Uh yeah, you've seen both of them play. Uh one is an announcer on the radio, I think. Phil Sims? No. Chris Collinsworth? He played for the Bengals. He started in the Bengals. Carson Palmer? And then went to the Jets. And then went to the Cardinals. Just saying we're not gonna get boomerus i never would have got that in a million years. Yeah. Alright. And the other one's Warren Moon. Good luck.",
    "speaker" : "Andy"
  },
  {
    "text" : "I also never would have got that. Useless.",
    "timestamp" : "06:34-06:37",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Useless.",
    "timestamp" : "06:37-06:38"
  },
  {
    "text" : "That's uh code that's so obscure. Yeah. Cool cool trivia question, Andy. You're like the guy who runs bar trivia and is asking like differential equation shit.",
    "speaker" : "Steve",
    "timestamp" : "06:38-06:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh dude, bar trivia people are the worst. Not my fault, you boys are fucking idiots. Go kind of big dick dummies up in here. Jesus. All right, fine. Speaking of big dick dummies, uh let's talk about this field goal. Fake field goal. It was what six three in the six-three pats. No, we're we're in the uh the second quarter now. Pats had just kicked a field goal. Well, actually the Pats had driven down inside the Jets five-yard line twice on their first two drives. Um and settled for field goals on both of them. So that's cool. Because Brady kept getting sacked on third down, too, which is great. Uh Pat's up 6-3 and the Jets drive to their New England like 20-yard line. And instead of kicking a field goal to tie it, they attempt a fake field goal. Where they snap it to the punter who throws it to their starting center, who for some reason was lined up on the wing on this play instead of like, I don't know, a tight end or someone like that. Kevin Y hits him in the hands. Not a perfect pass. He's also double covered, by the way. I don't know if you noticed that. Yeah, by Teddy Bruski. And Mike Vrabel, I believe. Yeah. So tightly covered, throws into double coverage and incomplete. And um no, I'm not gonna put that on website My website's better than that.",
    "timestamp" : "06:48-08:11"
  },
  {
    "speaker" : "Steve",
    "text" : "I I want to laugh at the Jets, dude.",
    "timestamp" : "08:12-08:14"
  },
  {
    "speaker" : "Andy",
    "text" : "Did you hear her medwall on the website? Yeah, that's because it was a play for that the Patriots made. It was a fumble recovery that they returned for a touchdown. Why would you not put that on there? This is just a bumbling circus show.",
    "timestamp" : "08:14-08:28"
  },
  {
    "timestamp" : "08:28-08:31",
    "speaker" : "Steve",
    "text" : "Look, the butt fumble has the word bum in it."
  },
  {
    "timestamp" : "08:32-09:20",
    "text" : "Did you did you hear Herm Edwards talk about it? No. Yeah. They they interviewed him after the game and they asked him. He actually had a pretty good response. He's like He's basically like yeah we suck but like why not why not try shit? You know like Like I'm not gonna go out there and just play like boring football and lose every game. He's like, I'm gonna do things that are different to try and win games. He he literally almost said the You play to win the game, quote. He like in in like different words, he said basically that, which Uh he's sticking to his guns, yeah. I kind of respect it. Like if I was supporting a shitty team, I'd be like, let's try a fake field, let's do something, because this blows just watching bad, boring football. Fuck that. Yep.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean the Browns always have fun teams, right?",
    "timestamp" : "09:21-09:23"
  },
  {
    "timestamp" : "09:23-09:29",
    "speaker" : "Steve",
    "text" : "Well, what year was that you play to win the game? Like a viral clip of him."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:30-09:39",
    "text" : "It's probably I think it was like 2000. It sounds like a it was in this general time frame, I'm pretty sure. I think we looked up before and decided that."
  },
  {
    "text" : "Oh, I found an oral history of memorable moments. I think.",
    "timestamp" : "09:40-09:44",
    "speaker" : "Steve"
  },
  {
    "text" : "So it's the season before then. Yeah.",
    "timestamp" : "09:44-09:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "09:48-10:02",
    "text" : "October thirtieth, two thousand two. So he's just repeating himself. Jets were just made the playoffs in two thousand two. They did. And October would be playoffs. Speaking of things quotes."
  },
  {
    "text" : "Well that was 2001, I believe, that that quote. Because that was when uh Peyton Manning couldn't stop throwing interceptions. Yeah. Playoffs. It's the golden age of hilarious head coaches. I'm a man. I'm 40. Come after me. That guy's my favorite.",
    "timestamp" : "10:03-10:22",
    "speaker" : "Andy"
  },
  {
    "text" : "He's still kicking around. Is he? Yeah.",
    "speaker" : "Greg",
    "timestamp" : "10:22-10:25"
  },
  {
    "text" : "Still doing the college circuit?",
    "timestamp" : "10:25-10:26",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:27-10:40",
    "text" : "He got he's I think he's still at Oklahoma State. Oh god damn. I think he got in trouble recently for some Some insensitive things he said. If you could imagine that."
  },
  {
    "text" : "I mean, to bring it back to uh Herm Edwards' play calling there on that fake. It makes sense considering Kevin Wai never ever caught a pass ever in his NFL career.",
    "timestamp" : "10:40-10:53",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So it was one of those things where like the idea behind it was good. It was just the execution was kind of hot garbage.",
    "timestamp" : "10:53-11:00"
  },
  {
    "text" : "Yeah, it doesn't make sense on like let's roll a slide.",
    "timestamp" : "11:00-11:02",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Like if you have a backup QB as your holder, okay. Or if you have a tight end out there, like you know, the Patriots used to have Gronk basically in that exact spot blocking for field goals. So that I mean that seems to make a bit more sense.",
    "timestamp" : "11:02-11:17"
  },
  {
    "speaker" : "Steve",
    "text" : "And like we've thrown it to offensive linemen like then that Ravens game in the playoffs. Yeah when they used that ineligible receiver guy to trick them. But he was wide open, you know? Like literally zero people were covering him, not our two best coverage linebackers.",
    "timestamp" : "11:17-11:33"
  },
  {
    "text" : "Right, yeah. I mean There wasn't a whole lot of misdirection happening. Um But it didn't really matter because this second quarter was kind of a hot mess. Patriots got that the I felt like While I've been watching these first three games, knowing what's coming ahead, and like we're gonna see one more loss in the next like 20 something episodes. This does not look like a team that's about to reel off a bunch of wins.",
    "timestamp" : "11:33-12:00",
    "speaker" : "Andy"
  },
  {
    "text" : "No, they're they're dropping like flies.",
    "speaker" : "Steve",
    "timestamp" : "12:01-12:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:03-13:09",
    "text" : "They're getting hurt, yeah, because um, like there's a ton of injuries already. Even in this game, Roosevelt Colvin is out for the season with like he had that hip injury, which I had completely forgotten about until they mentioned it in this game. Where he, I don't know, he like had some sort of fracture in his hip or something like that. Um, and they were like super cagey about it, and it just turned out like he couldn't play the rest of the season. And he was their big off-season signing. And then in this game, Ted Washington goes down, which with a leg injury. And the uh the commentators We're not even gonna talk about who it was because I'll get all riled up. Um we're talking about how Actually no, it was the the sideline. It was uh it was Leslie on the sideline Talking about how um because he was down, the guys were replacing him were both 70 pounds lighter than he was, as that nose tackle guy, because Ted Washington weighed in at 360 pounds And the guys replacing him were a lightweight, a Svelte 290."
  },
  {
    "text" : "I have I have a lot of notes on this.",
    "speaker" : "Greg",
    "timestamp" : "13:11-13:13"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay, at this nine expected you to have your notes voted. Let's do it.",
    "timestamp" : "13:13-13:17"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, well this is where it started was. Uh good old Mount Washington, aka the Washington Monument at six foot five. He He went up to at least 375 during his playing day. So he was like 365. And they actually asked Matt Chatham about it.",
    "timestamp" : "13:18-13:43"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:43-13:44",
    "text" : "Yeah."
  },
  {
    "text" : "And and Chatham had a quote. Once you get to that weight, you stop stepping on the scale. What does he see the numbers anyway? Yeah, like what is he truly? And it's like it's no one really knows, but it's a fuck mode, you know?",
    "speaker" : "Greg",
    "timestamp" : "13:44-13:57"
  },
  {
    "timestamp" : "13:57-14:02",
    "speaker" : "Andy",
    "text" : "So how many uh how many C's would you put in thick for for Ted Washington when describing?"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean, he is a thick seven or eight, right? I mean, he is He's like legendarily thick, but that got me thinking like what are the heaviest players that have ever played?",
    "timestamp" : "14:02-14:14"
  },
  {
    "timestamp" : "14:15-14:18",
    "text" : "So I went This is why we keep you around. Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:19-14:48",
    "speaker" : "Greg",
    "text" : "Went down that rabbit hole. I am interested to hear where this leads. Yeah, so there's a few. Um Nate Newton played for the Cowboys with their uh Super Bowl teams. He won three Super Bowl, six Pro Bowls. He was 6'3, 401 pounds. Wow. At 6'3, which is pretty impressive. Yeah. His nickname was uh The Kitchen because he was that much bigger than the fridge."
  },
  {
    "text" : "William Perry.",
    "speaker" : "Mom",
    "timestamp" : "14:49-14:50"
  },
  {
    "timestamp" : "14:52-15:07",
    "speaker" : "Greg",
    "text" : "There's nothing better than like fat football games. And I'll I'll get to the fridge, but the the heaviest player ever to play Was Aaron Gibson. Let us guess how heavy it was. Okay. Steve, what'd you guess?"
  },
  {
    "timestamp" : "15:08-15:10",
    "speaker" : "Andy",
    "text" : "Four and a quarter. Oh, that's what I was gonna guess."
  },
  {
    "text" : "I'm gonna say four thirty. He was four hundred and ten pounds. Oh. But he played at four forty in high school. In high school So he dropped weight to make it the offensive lineman? He was six yeah, six six, four ten.",
    "timestamp" : "15:10-15:27",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Damn. Yeah.",
    "timestamp" : "15:27-15:29"
  },
  {
    "text" : "So yeah, he was the biggest one. I mean, a lot of these guys, I think when you get past like 350, there's like multiple numbers floating around. But yeah, yeah. I'm just going based on yeah, the best scale stopped working once you pass 350.",
    "speaker" : "Greg",
    "timestamp" : "15:30-15:43"
  },
  {
    "speaker" : "Steve",
    "text" : "No, they just don't even step on him anymore.",
    "timestamp" : "15:43-15:45"
  },
  {
    "speaker" : "Greg",
    "text" : "What's that too? So the obviously the one of the most famous ones is William the refrigerator Perry. I mean he was part of that Super Bowl that Scored a touchdown against the Patriots. What was it? Super Bowl 20? So back in 86, whatever they're doing. So he was six two, three eighty-five, so he's shorter and slightly fatter or thicker than Ted Washington.",
    "timestamp" : "15:45-16:13"
  },
  {
    "timestamp" : "16:13-16:15",
    "text" : "He played on the defensive right line, right?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "16:16-16:51",
    "speaker" : "Greg",
    "text" : "Yes. Yeah. But he also played a fullback, which is why he got so famous. Um He weighed two hundred pounds at eleven years old. Wow. And apparently he was like a freak athlete at that like middle school, high school age. Like he would used to run the hundred-yard dash for his high school. He could do like a 360 dunk. He was on his they're saying he was on the diving team. He was on the what team? Diving team?"
  },
  {
    "timestamp" : "16:52-17:00",
    "speaker" : "Andy",
    "text" : "A guy that big that on the diving team he he can only dive once. They have to refill the pool. I would have loved to see. Right."
  },
  {
    "timestamp" : "17:01-17:05",
    "speaker" : "Steve",
    "text" : "I looked this up because my my point of comparison for fat guys is Vince Wilfork."
  },
  {
    "text" : "Right.",
    "timestamp" : "17:05-17:05",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. That's a pretty, you know, he's like a big dude, not massive. Do you have any guesses on what he weighs?",
    "timestamp" : "17:05-17:12",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "On the sixty. He's got short though.",
    "timestamp" : "17:12-17:14"
  },
  {
    "text" : "Three twenty-five at six two.",
    "timestamp" : "17:16-17:17",
    "speaker" : "Steve"
  },
  {
    "text" : "6'2. 6'2, 325. So Nate Newton's 6'3's 401 is just insanity. Because the height has a lot to do with it, right? Like tall. Yeah. You got more place to put it. Yeah. Because even one of the I have some other notables, Trent Brown, he was 6'8, 380. So he didn't quite look as wide as Wilfork did, but he's just a huge dude. So I think that plays a lot into it. So more on the fridge here. Um he had the largest Super Bowl ring ever fitted. It was a size 25 where the normal male adult has a size 10 to 12.",
    "timestamp" : "17:18-18:02",
    "speaker" : "Greg"
  },
  {
    "text" : "So it's size 25. You can fit that over a hot dog. Yeah, that's like God damn.",
    "speaker" : "Andy",
    "timestamp" : "18:02-18:07"
  },
  {
    "timestamp" : "18:07-18:21",
    "speaker" : "Greg",
    "text" : "I'm assuming that's like uh Is that the same as like your waist? Is that the same measurement? Probably. Because that's like almost I could almost fit that on as like pants, dude. If that's what that measurement is."
  },
  {
    "speaker" : "Andy",
    "text" : "I don't think it is, but we're gonna go with it. Yeah.",
    "timestamp" : "18:22-18:24"
  },
  {
    "speaker" : "Greg",
    "text" : "So obviously he's he got really like famous during those Super Bowl days because he was kind of like that like you know funny guy. He scored touchdowns. Everybody knew him. They used to sell like toys with him on it and shit like that. He had a great nickname. Yeah. Mm-hmm. So then I fur I further went down the rabbit hole to a 2002 celebrity boxing match between the fridge and minute bowl.",
    "timestamp" : "18:25-18:53"
  },
  {
    "speaker" : "Steve",
    "text" : "What?",
    "timestamp" : "18:54-18:54"
  },
  {
    "speaker" : "Greg",
    "text" : "Which guy basketball player? The basketball player. Tall and skinny though, right?",
    "timestamp" : "18:55-19:00"
  },
  {
    "timestamp" : "19:00-19:00",
    "speaker" : "Andy",
    "text" : "Like yeah."
  },
  {
    "timestamp" : "19:01-19:30",
    "speaker" : "Greg",
    "text" : "Tall and skinny is the most loudly On an unexaggerated way to define maneuver. Paint me a picture. Tall and skinny, he is a legitimate stick bug. He weighed in in height at 7'7, 240 pounds. Damn. 7'7. What's the reach on that though? 102."
  },
  {
    "timestamp" : "19:32-19:34",
    "speaker" : "Steve",
    "text" : "Okay. Do you have like a video of this boxing match?"
  },
  {
    "speaker" : "Greg",
    "text" : "There is a video on YouTube. Oh how long is it? It's like 15 minutes. Damn, that boxing match print for that long? It's so Perry was 6'3. They had him listed as 350 plus. And the the commentators noted that He broke our scale while weighing in. He's probably pushing 400. And and I let me tell you, he was not in good shape, the French. Well since two thousand two.",
    "timestamp" : "19:35-20:08"
  },
  {
    "timestamp" : "20:08-20:11",
    "speaker" : "Andy",
    "text" : "He was in his prime in eighty six, like Yeah"
  },
  {
    "timestamp" : "20:11-20:24",
    "speaker" : "Greg",
    "text" : "Yeah. And I think he I think he struggled with his weight a little bit and like some like had some other issues going on, but He like you know they they show the hype up videos of them like training in the gym."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:24-20:24",
    "text" : "Yeah."
  },
  {
    "timestamp" : "20:24-20:59",
    "text" : "It's worth watching for that 'cause Uh the fridge is wearing a Hawaiian shirt and a Kangol hat. And he's just like lazily punching at a bag. And then like Manute Bulls like shadow boxing or like sparring with a guy who's like 5'4. And it's just the most ridiculous visual you've ever seen. Who won? Uh Manute Bowl won in a landslide. I'm pretty sure uh Fridge didn't even throw a punch. He was just kind of like he was so beat and like He was just cutting a check, you know.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:59-21:04",
    "text" : "That's kind of why I was surprised that the video was 15 minutes long because I didn't think the fridge could go for that long."
  },
  {
    "timestamp" : "21:04-21:18",
    "speaker" : "Greg",
    "text" : "Yeah, they went three rounds. Wait into four bills. Uh Perry, he didn't really punch. He kind of did some shoves towards the end. The ref said, you better start he said you better not you better start fighting or we're not gonna pay you. The ref legitimately said that."
  },
  {
    "text" : "The ref said that to him.",
    "timestamp" : "21:19-21:20",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "21:21-21:52",
    "speaker" : "Greg",
    "text" : "Oh shit. But Manute Ball was doing it to raise money for Sudan. He's Sudanese. Yeah. And I kind of like did a little brief look into him. He's he's a pretty amazing dude, Manuk Ball. Like he's an ambassador for Sudan. He's done tons of humanitarian work. And he's like super, super legit. So shout out, shout out Manute Bull and his son Bull Bull. For real bull ball, first round traffic."
  },
  {
    "timestamp" : "21:52-21:53",
    "text" : "Yeah, he's in the NBA, right?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he's like Manute Bull with handles. It's ridiculous.",
    "timestamp" : "21:53-21:56"
  },
  {
    "timestamp" : "21:57-22:00",
    "text" : "How tall is he? Is he seven plus? Same thing.",
    "speaker" : "Andy"
  },
  {
    "text" : "I think he might not be quite as tall, but he's he's also stick bug status, you know.",
    "speaker" : "Greg",
    "timestamp" : "22:00-22:05"
  },
  {
    "timestamp" : "22:05-22:08",
    "text" : "Damn. All right. Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "22:08-22:39",
    "text" : "Dude, they legit look like stick bugs. It's watching them play sports is fucking crazy. Oh my goodness. So you want to hear some other notables here? I just had a couple other guys that are on the list. Um Makai Becton, the the Jets first round pick from this previous draft. Oh yeah, yeah. Yeah. Six seven, three sixty-four. Went the went 11th overall. He ran his 40 faster than Tom Brady. As events Wolf."
  },
  {
    "timestamp" : "22:40-22:40",
    "speaker" : "Andy",
    "text" : "We decided, yeah."
  },
  {
    "text" : "Um, how big was he though? 6'4. 6'7, 364. Damn, that's a big dude. Yeah, and he ran he ran the 40 in like six steps. Yeah. He's a crazy athlete, man. I guess he's done pretty well too for the Jets. And then the only other guy I had well actually Roy Williams from the Cowboys. Right? He was their safety. Oh yeah. He uh Bill Parcells nicknamed him Biscuit because he was one biscuit shy of a linebacker. I thought it was funny.",
    "speaker" : "Greg",
    "timestamp" : "22:41-23:18"
  },
  {
    "text" : "Wasn't that a quote about Calvin Benjamin too? He was one biscuit away from uh tight end.",
    "timestamp" : "23:18-23:23",
    "speaker" : "Andy"
  },
  {
    "text" : "That would make sense.",
    "speaker" : "Greg",
    "timestamp" : "23:23-23:25"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:25-23:29",
    "text" : "Somebody said that on like Monday Night Football. I think it was Booger who said that on Monday Night Football."
  },
  {
    "timestamp" : "23:29-24:13",
    "speaker" : "Greg",
    "text" : "Oh booger. Oh joke stealing from Bill Parcells again. Again. And then uh the fattest punter ever, Sav Rocka. Six five two sixty-five. For the Giants? For I had him as the Washington Football team. Name that should be not named. Well, he wasn't the football team at the time. Rwards. Yeah. Yeah. He was an Aussie rules football player that came over and played in the NFL. Oh yeah, I remember they loved them. Ozzy Aussie, I guess. Aussie rules football. So that's it. That's all my notes for the game. Okay."
  },
  {
    "text" : "Thanks. Thanks for chiming in. Appreciate that. So for any of you who had um on their bingo card, Gregos down on a fat guy. Uh deep dive, you can check that off.",
    "speaker" : "Andy",
    "timestamp" : "24:13-24:27"
  },
  {
    "speaker" : "Steve",
    "text" : "And ends up in basketball.",
    "timestamp" : "24:27-24:30"
  },
  {
    "timestamp" : "24:30-24:31",
    "speaker" : "Andy",
    "text" : "And talks about"
  },
  {
    "speaker" : "Greg",
    "text" : "Humanitarian work in Sudan. Gotta love the internet, guys. Gotta love the internet.",
    "timestamp" : "24:33-24:38"
  },
  {
    "timestamp" : "24:40-24:41",
    "speaker" : "Andy",
    "text" : "Oh goodness."
  },
  {
    "text" : "Yeah, all right. Well that's uh Yeah, let's see bring this one back, Andy. I don't know if I can all right.",
    "timestamp" : "24:42-24:48",
    "speaker" : "Greg"
  },
  {
    "text" : "Um let's see.",
    "timestamp" : "24:48-24:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. But we could have brought back around Trent Brown. He was on Or m Mikai Becton. I mean Jets offensive lineman. Speaking of jump jets offensive lineman, how about that fake field goal they threw a pass to a Jets? What a fucking stupid play that was.",
    "timestamp" : "24:50-25:06"
  },
  {
    "text" : "Oh God, yeah. That's I can't recover from all this fat boy talk. I'm just like I'm a little hungry now.",
    "speaker" : "Andy",
    "timestamp" : "25:06-25:15"
  },
  {
    "timestamp" : "25:16-25:16",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "25:17-25:30",
    "speaker" : "Andy",
    "text" : "What I want to know, Greg, is I think you should write a blog post about it. Um I want to know who the fastest fat guy was in terms of like 40 time to wait."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, BMI. I tried to look that up, like who who was the highest BMI like weight.",
    "timestamp" : "25:31-25:38"
  },
  {
    "text" : "Like the fastest Fat dude. So in terms of like who was the fattest, yeah, but also ran the quickest, you know what I mean? So like somebody who's you know 400% inertia. Yeah, yeah, yeah.",
    "timestamp" : "25:40-25:55",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:55-25:58",
    "text" : "Are we talking speed or velocity?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know, dude. I don't even know what those words mean. Are they the same thing?",
    "timestamp" : "25:58-26:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Well velocity is just speed with direction, isn't it?",
    "timestamp" : "26:02-26:05"
  },
  {
    "text" : "Yes.",
    "timestamp" : "26:05-26:06",
    "speaker" : "Greg"
  },
  {
    "text" : "You didn't see that coming, did you? It's gotta be pulled like I was from elbow deep up my ass right there.",
    "speaker" : "Andy",
    "timestamp" : "26:08-26:15"
  },
  {
    "timestamp" : "26:15-26:18",
    "speaker" : "Greg",
    "text" : "11th grade physics thing he sold out of his ass."
  },
  {
    "text" : "Not bad. I feel like I read that recently, so that's the only reason I know it. As you do. Speaking of velocity, we had another Tom Brady touchdown run in this game. In the third quarter of a week three game, this is the Patriots' first rushing touchdown of the season, which blew my mind. Um didn't help that they also showed us that Anton Smith on the season was averaging 1. 8 yards a carry So that's great. Can't imagine why Yeah. Kevin Falk was averaging like five something, and he actually got most of the carries in this game. He did.",
    "speaker" : "Andy",
    "timestamp" : "26:19-27:01"
  },
  {
    "text" : "He out carried him.",
    "speaker" : "Greg",
    "timestamp" : "27:01-27:02"
  },
  {
    "timestamp" : "27:03-27:29",
    "text" : "Um, but they showed his stat. Uh earlier on in the game where uh they had a rushing comparison on the season. Jamal Lewis, who I'm assuming was the leading rusher. For the Ravens had 364 rushing yards through three games and three touchdowns. Clinton Portis, 249 and two touchdowns. The Jets and Patriots combined, 245 yards and one rushing touchdown. Through three games.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:29-27:31",
    "speaker" : "Greg",
    "text" : "Curtis Martin."
  },
  {
    "speaker" : "Andy",
    "text" : "Right. Uh the Jets as a team in their first two games. had accumulated 78 total rushing yards in the first two weeks. It was the sixth worst ever in the history of the NFL. That's tough. And there was and they were saying that um on the season there were 33 running backs, like individual running backs in the league that had uh rushed for more yards than that. And they have Curtis Morton. Right. So the Jets offense was uh the 34th ranked running back in terms of yards gained on the season.",
    "timestamp" : "27:31-28:06"
  },
  {
    "timestamp" : "28:06-28:08",
    "speaker" : "Greg",
    "text" : "Well he gets it together though, right? Curtis?"
  },
  {
    "timestamp" : "28:09-28:11",
    "text" : "I think he ends up rushing for a thousand yards on the season. Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "28:14-28:22",
    "speaker" : "Greg",
    "text" : "But to team all bro the next year too. So he's not this is not the downfall of Curtis Martin. It's just a slow start. Is that fair?"
  },
  {
    "timestamp" : "28:23-28:50",
    "speaker" : "Andy",
    "text" : "I think so, yeah. I think that's basically what happens here. It's just a slow start for the Jets in general. Um and I think they are still kind of recovering from the Chad Pennington thing, even though which is weird because he must come back this season because he finished as the leading uh passer on the team. Yeah, he does. And Santana Moss went for over a thousand yards and ten touchdowns. Which is surprising because the Jets finished 6 and 10, last in the AFC East."
  },
  {
    "timestamp" : "28:50-28:54",
    "speaker" : "Steve",
    "text" : "Is it that surprising though? A little bit."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:54-28:55",
    "text" : "They had"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm just saying the Jets blowing it.",
    "timestamp" : "28:56-28:58"
  },
  {
    "timestamp" : "28:59-29:02",
    "text" : "I mean they had they had Pro Bowler Sean Ellis with 12 and a half sacks on the team.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:03-29:07",
    "text" : "He was the guy that they picked with the Belchek pick."
  },
  {
    "timestamp" : "29:07-29:08",
    "speaker" : "Andy",
    "text" : "Right. Yeah."
  },
  {
    "text" : "Uh and also had a 40-year-old Vinny Testaverdi. That's true. Starting at quarterback, so that's not gonna help. I mean, I don't think Vinny was bad.",
    "speaker" : "Greg",
    "timestamp" : "29:09-29:20"
  },
  {
    "speaker" : "Steve",
    "text" : "He was like like you said, Greg, I feel that that Paddington injury in the fourth preseason game fucked this team up for a couple years. Yeah, yeah. Because you compare these games and they're not too far apart that when we lost to the end of 2002 and this one, they're only five games or so apart.",
    "timestamp" : "29:21-29:39"
  },
  {
    "text" : "If and they're coming off that like forties once enough thing thrashing of the Peyton Colts too in the playoffs. So they're They're coming into the season supposed to be good, right? They have high expectations. Yep. And then they then they put pennington in week four preseason. Fucking Herm, dude. Herm, the more I'm speaking this out loud and the more I'm saying is Herm blew it, right? A fucking idiot.",
    "timestamp" : "29:40-30:06",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "30:06-30:08",
    "text" : "And then he's like, well, fuck it, we're gonna suck anyways.",
    "speaker" : "Steve"
  },
  {
    "text" : "Let's call terribly designed fake fields. Now I'm pissed he said that because it's like they could have been good. They should be good. He's out there just fucking around.",
    "speaker" : "Greg",
    "timestamp" : "30:08-30:19"
  },
  {
    "text" : "Oh Jesus.",
    "timestamp" : "30:21-30:22",
    "speaker" : "Andy"
  },
  {
    "text" : "But even to you, you said I mentioned this earlier, Andy, of like this team does not look like they're about to go rip off a huge Right.",
    "speaker" : "Steve",
    "timestamp" : "30:22-30:28"
  },
  {
    "text" : "Like the offense looks completely out of sorts. They can't get a running game going. Uh Brady looks like he's hurt. Yeah. Like he got hurt again in this. And we already talked about how he had his separated shoulder you're still dealing with. Same week. After the previous week's game against the Eagles, he had um like a bad elbow and it got rocked again in this game. Like he was throwing and he got he got his arm caught. And it was like and he he was making these like weird mistakes like he went to pump fake and threw the ball backwards over his head.",
    "timestamp" : "30:28-30:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:00-31:02",
    "text" : "Yeah. The old empty hand."
  },
  {
    "text" : "Yeah, exactly. Just and it wasn't like it was not raining or nothing. It wasn't cold. It was just a weird like unbrady-like sort of thing.",
    "speaker" : "Andy",
    "timestamp" : "31:02-31:10"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh what branch got hurt in this game too?",
    "timestamp" : "31:10-31:12"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, we were talking about injuries, weren't we? And then we got fat guys.",
    "timestamp" : "31:13-31:16"
  },
  {
    "speaker" : "Greg",
    "text" : "Was it a patent that got hurt?",
    "timestamp" : "31:16-31:18"
  },
  {
    "text" : "Patton went down, yeah, with a knee didn't come back. Um Brady was hurt. Ty Law went down with an ankle injury that looked like it was broken. And he was like writhing on the floor. And then uh that opened the door for Asante Samuel to come in. And all he did was um uh first play of the fourth quarter got a pick six off of uh good old Vinnie Tessaverde. For 55 yards, his first ever interception in the NFL.",
    "timestamp" : "31:18-31:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "It was a great one.",
    "timestamp" : "31:47-31:48"
  },
  {
    "speaker" : "Andy",
    "text" : "It was a fantastic pick, I guess.",
    "timestamp" : "31:48-31:49"
  },
  {
    "timestamp" : "31:50-31:57",
    "speaker" : "Greg",
    "text" : "It's a game, Turner. Seven-point game at that point. Yep. Started the fourth. Probably about their like midfield."
  },
  {
    "text" : "Yeah, well it's a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of",
    "timestamp" : "31:57-31:58",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "So it looked like they might be driving down for points.",
    "timestamp" : "31:58-32:00"
  },
  {
    "timestamp" : "32:00-32:49",
    "speaker" : "Andy",
    "text" : "Yeah, this is the drive where like right after the Patriots scored their only offensive touchdown with Brady running it in. And so the Jet and the Jets had been kind of driving all day. And they kind of picked it up in the second half, too. Like they drive down the field and then they do something stupid like um try a fake field goal or not convert any third downs. I think there were like I wrote it down somewhere. Like they were really bad on third down. They were one and one for 13 on third down for the game. So they see they they drive all the way into New England territory and then get a third down and not convert it. So that's great. Um yeah, but so like Greg's saying, like The Jets get the ball back. They're driving again like they've been doing all day. Get to about midfield. And I don't know. It wasn't a great throw."
  },
  {
    "speaker" : "Steve",
    "text" : "No.",
    "timestamp" : "32:50-32:50"
  },
  {
    "timestamp" : "32:51-32:56",
    "speaker" : "Andy",
    "text" : "Sante picks it up. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he knocked it into his own face and then knocked it straight up again. I would define him his like running as scampering. Yes. Do you think Asante Samuel was like a scamper? Brr. He always seemed to be like running in a I don't know, he just feel he felt like he was like like Tylaw's like a heavy like physical guy. And like Asante Samuel was just like he was all quickness, like a like uh those bugs that are on water.",
    "timestamp" : "32:58-33:25"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:25-33:28",
    "text" : "Don't you think? The little, yeah, the water bug. It's funny you say that."
  },
  {
    "speaker" : "Steve",
    "text" : "Water bugs. Yeah, water bugs. What other bugs are we getting after?",
    "timestamp" : "33:31-33:33"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:33-33:50",
    "text" : "What is this? National Geographic. It's Nature R with the Brown brothers. Speaking of which, uh listen to the outside in podcast by N H PR. It's great. Um No. Yeah. Wish Let's talk about philosophy."
  },
  {
    "timestamp" : "33:50-33:53",
    "speaker" : "Mom",
    "text" : "You're sad. Go fuck yourself, Andy."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "33:53-33:58",
    "text" : "You yelled at me for hyping my show. Which one? Stuff you should stuff you should know"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean, yellow we we promote different podcasts on this constantly.",
    "timestamp" : "33:59-34:03"
  },
  {
    "timestamp" : "34:04-34:09",
    "speaker" : "Steve",
    "text" : "Yeah, but only ones that I like. Yeah, but and and come on, people aren't trying to lie. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Why the fuck are they listening to us?",
    "timestamp" : "34:10-34:11"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "34:12-34:16",
    "text" : "Because we're a bunch of big dick dummies. Greg's deep dives into fat guys."
  },
  {
    "timestamp" : "34:18-34:27",
    "speaker" : "Andy",
    "text" : "But speaking of Asante Samuel running style, they actually had a quote from Belichick about how Asante Samuel is quote built like a soccer player."
  },
  {
    "timestamp" : "34:27-34:29",
    "speaker" : "Greg",
    "text" : "Yep. He just built different."
  },
  {
    "text" : "Didn't explain what that means. Just that he's billing I don't know if that's like a a dig at soccer players, Greg. Care to respond?",
    "speaker" : "Andy",
    "timestamp" : "34:29-34:35"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah, that just means they're not good in the weight room. That's all that means.",
    "timestamp" : "34:35-34:42"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, at least you're honest about it.",
    "timestamp" : "34:45-34:46"
  },
  {
    "speaker" : "Greg",
    "text" : "Yep. Trust me.",
    "timestamp" : "34:46-34:47"
  },
  {
    "text" : "So when you when you were at UNH playing soccer, how many times did you lift weights?",
    "timestamp" : "34:48-34:52",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:53-35:28",
    "speaker" : "Greg",
    "text" : "I mean I used to go occasionally. Kelly always tells the story of like she came like to my house and I was sleeping when I was supposed to be at uh lifting. But that was erroneous because I was supposed to be I couldn't make lifting because I had class. I was just skipping class so I could sleep in. So If I I went to the ones I was like supposed to that I didn't have classes. Sometimes I skip classes, but I wasn't gonna skip class to go lifting. That's ridiculous."
  },
  {
    "text" : "Uh you've got a uh an interesting moral compass, I will say that.",
    "timestamp" : "35:31-35:37",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. But we used to weightlift in the same weight lift room as the football team. And like the they would the trainers, the weightlifting guys there were like you'd see them with the football team and they'd be like hyped up, playing loud music, getting in people's faces, you know, like",
    "speaker" : "Greg",
    "timestamp" : "35:37-35:53"
  },
  {
    "timestamp" : "35:53-35:54",
    "text" : "Football stuff.",
    "speaker" : "Andy"
  },
  {
    "text" : "So much energy in that room. And then we would get there and they'd be like, okay, yeah, we wrote some workouts on the whiteboard, just do that. And then they'd just go in their office and chill. It's like, thanks, guys. Put on some smooth jazz. Yeah, thanks. Well you guys can't handle the the real stuff, so here you go. Yeah, they did not give a shit about us. And for probably for fair reason we weren't as interested as football players were.",
    "speaker" : "Greg",
    "timestamp" : "35:54-36:15"
  },
  {
    "timestamp" : "36:18-36:25",
    "speaker" : "Andy",
    "text" : "That's fair. What about the hockey players? I bet they probably lifted like football players, especially at uh hockey school like UNH."
  },
  {
    "speaker" : "Steve",
    "text" : "Right.",
    "timestamp" : "36:25-36:26"
  },
  {
    "text" : "Uh I never I don't think I was ever in there when they were lifting, but they were very I think hockey in general, you're off the They're super casual attitude towards a sport. They're not like, oh, we gotta work hard. They're more like",
    "speaker" : "Greg",
    "timestamp" : "36:26-36:42"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "36:43-36:45",
    "text" : "Yeah, I can see that. Look how cool my flow is."
  },
  {
    "timestamp" : "36:45-37:06",
    "speaker" : "Greg",
    "text" : "Yeah, exactly. Yeah. I mean we used to see them do like fitness stuff outside and they were fucking around, slacking. They just looked they looked like a bunch of dopes. Yeah, I think it's way more important to be skilled in hockey than it is to be fit. If that makes sense."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "37:06-37:06"
  },
  {
    "text" : "Like if your hand eye coordination, your quickness.",
    "timestamp" : "37:07-37:09",
    "speaker" : "Greg"
  },
  {
    "text" : "Level of fitness. So it's certainly a a really hard sport to play at from a fitness level.",
    "timestamp" : "37:10-37:14",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "But Greg, you played hockey for a while too, didn't you? And and like you said it was Miserably hard.",
    "timestamp" : "37:14-37:20"
  },
  {
    "timestamp" : "37:22-37:56",
    "text" : "No, not fitness-wise. Um like hard of it. Like skating. Skating's just such a unique skill. And it's like it's such it's really hard sport to like break into and get past the first learning curve. Once you can skate, it's okay, but The first fucking I came into it late and I was terrible and it was fucking miserable for like two years. Didn't he used to use the boards to stop because he didn't I I couldn't stop. It was that was a problem for a while.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "37:59-38:05",
    "speaker" : "Steve",
    "text" : "We finished we stuffed Curtis Martin on that first drive on third and two."
  },
  {
    "text" : "Uh speaking of running backs, Kevin Falk, MVP of the 2002 season, like we talked about. Continuing that run. Yeah. He had a mixed day. They talked about how he was the all-time kick return leader, which I thought, I don't know if that's a real thing or still stands. Turns out it does. And not only that, he uh leads Patriots kick returns, kick returners in terms of yards by Oh god, like another quarter. He ended his career with 4,098 kick return yards.",
    "speaker" : "Andy",
    "timestamp" : "38:07-38:49"
  },
  {
    "text" : "Wait, Patriots all-time or all-time all-time? Patriots all-time. Okay.",
    "speaker" : "Steve",
    "timestamp" : "38:50-38:53"
  },
  {
    "text" : "Uh in second place is Ellis Hobbs. Pretty good. 2,913 return yards.",
    "timestamp" : "38:55-39:02",
    "speaker" : "Andy"
  },
  {
    "text" : "Doubled them up.",
    "speaker" : "Steve",
    "timestamp" : "39:02-39:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:03-39:08",
    "text" : "Well, not quite, but yeah. It's another an extra thousand on top, basically."
  },
  {
    "speaker" : "Greg",
    "text" : "Well, didn't they change where they kick off from? This is when we're touchbacks now.",
    "timestamp" : "39:08-39:14"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. There are now, yeah. Yeah.",
    "timestamp" : "39:14-39:16"
  },
  {
    "speaker" : "Greg",
    "text" : "So yeah, this will have a record that'll never be broken, right? Yeah. Unbreakable records. That intrigues me. Uh number three is Dave Megott. Greg, your favorite.",
    "timestamp" : "39:16-39:28"
  },
  {
    "speaker" : "Andy",
    "text" : "2500 yards. And right behind him was the other kick returner in this game, Bethel Johnson.",
    "timestamp" : "39:32-39:37"
  },
  {
    "timestamp" : "39:39-39:40",
    "speaker" : "Greg",
    "text" : "Bethel. That's interesting."
  },
  {
    "speaker" : "Andy",
    "text" : "He flashed in to Yeah, he did. He's he's done okay this season. Um wow. All right. What did he flash for you, Steve?",
    "timestamp" : "39:41-39:50"
  },
  {
    "timestamp" : "39:50-39:51",
    "text" : "Talent.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, I know, I know, but like can you explain the plays maybe or what he did that He took the ball and for somebody who uh perhaps didn't have a big thing. There's only one highlight of the case. Like all our listeners, Andy. Like you can't you can't just say shit and just think like, oh yeah. Everyone who's listening is gonna agree they didn't watch the fucking game.",
    "timestamp" : "39:51-40:11",
    "speaker" : "Greg"
  },
  {
    "text" : "This is Bethel Johnson. He only has one highlight. He catches the ball and then goes really fast. All right. Wow, that guy's pretty fast.",
    "timestamp" : "40:12-40:20",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Actually, he had one other highlight that didn't involve him with the ball running really fast. Uh it involved him running down Santana Moss on a punt return. Because they were both really fast. And the only person on the field that could run down Santana Moss is Bethel Johnson.",
    "timestamp" : "40:20-40:32"
  },
  {
    "speaker" : "Greg",
    "text" : "Hit him with the old Daniel Graham Denwitt. Watson?",
    "timestamp" : "40:33-40:36"
  },
  {
    "text" : "Ben Watson. Sure shit wasn't Daniel Graham. The DK Metcalf. The DK Metcalf. That's what it is. Now so I was actually thinking uh in this game. That uh if we have some younger listeners, we may want to uh kind of explain who these people we're talking about now are in terms of current players. Oh, I like that. And so the one that's comparisons. Yeah, the one that stuck out to me was Vinnie Testaverdi is the original Ryan Fitzpatrick.",
    "timestamp" : "40:36-41:06",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "What do you mean? Journeyman?",
    "timestamp" : "41:08-41:10"
  },
  {
    "timestamp" : "41:11-41:30",
    "speaker" : "Andy",
    "text" : "Journeyman who flashes everywhere he plays. I mean they're still like a true starter. Do you think he flashes? He he had yeah, he was um what I say he's the only one of four quarterbacks to get uh AFC and NFC player of the month, and he did it in with three different teams. Including Melchak's Pratt."
  },
  {
    "text" : "He passes Johnny Unitis in this game on the all time list.",
    "timestamp" : "41:30-41:33",
    "speaker" : "Steve"
  },
  {
    "text" : "40,000 passing yards. You're like one of eight guys that's a lot of people.",
    "timestamp" : "41:34-41:38",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "41:38-41:48",
    "speaker" : "Steve",
    "text" : "Part of that is longevity, but we've discussed this earlier as well of like you gotta be good enough to be around long enough. Inc Yeah, you know, there's a certain level of freshness you need to hit."
  },
  {
    "timestamp" : "41:48-42:16",
    "speaker" : "Greg",
    "text" : "He wasn't maybe I'm one of the younger listeners. Because I mean I only really remember Testa Verde from like 2000 onwards. So he's it he's oh yeah in 87. So I probably missed like the real flashes where you're like this guy has talent. Yeah, played a shift on Tampa. By the time I watched play, it was kind of just like He was serviceable, not yeah, like you could get like a huge win out of this guy."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. He's 15th in the career passing yards right now. Still pretty good. It's a lot. Uh 12th and Sacks.",
    "timestamp" : "42:16-42:26"
  },
  {
    "speaker" : "Greg",
    "text" : "He got so many opportunities. It's crazy.",
    "timestamp" : "42:28-42:30"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:31-42:38",
    "text" : "Yeah, he was all over the place. He was with yeah, he was the one that replaced uh was it Bernie Kozar and In Cleveland."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "42:38-42:53",
    "text" : "Yeah, uh where Belichak was there, yeah, and they they eviscerated him for it. He started 16 games in Dallas in 2004. Like what the fuck? Like, how you gonna pick up a 41-year-old quarterback and start him the whole year?"
  },
  {
    "speaker" : "Andy",
    "text" : "Dude, he started six games in 07 for Carolina.",
    "timestamp" : "42:54-42:57"
  },
  {
    "timestamp" : "42:57-43:12",
    "speaker" : "Greg",
    "text" : "He went five and ten. What? That's Bill Parcells, right? That's Bill Parcells. Oh four. I think it may have been four cowboys. Bill Barcel scooped up a 41-year-old Vinetesta Verdium was like, we're rolling with this guy for the year."
  },
  {
    "speaker" : "Andy",
    "text" : "We knew him. What a fucking idiot there. I it must have been when it must have been because uh Drew Henson went down because Drew Henson was one-0 on the season.",
    "timestamp" : "43:13-43:24"
  },
  {
    "timestamp" : "43:24-43:25",
    "text" : "Okay. That makes sense.",
    "speaker" : "Greg"
  },
  {
    "text" : "No, he started one game but played in seven, so maybe not. What the fuck? Oh greenhead.",
    "speaker" : "Andy",
    "timestamp" : "43:26-43:32"
  },
  {
    "text" : "Oh many greenhead.",
    "timestamp" : "43:32-43:34",
    "speaker" : "Steve"
  },
  {
    "text" : "So yeah, Vinita Sabre is he is old school Ryan Fitzpatrick. Yeah, he is the early 2000s Ryan Fitzpatrick. Uh who else do we have? I had another one, but I forgot it now. It slipped my my mind.",
    "timestamp" : "43:34-43:49",
    "speaker" : "Andy"
  },
  {
    "text" : "Curtis Martin, who's his comparison?",
    "timestamp" : "43:50-43:53",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "43:54-43:58",
    "speaker" : "Andy",
    "text" : "I mean they're really quiet workhorse running back."
  },
  {
    "timestamp" : "43:58-44:02",
    "text" : "DJ Peterson. Yeah, I like that one. Well, that's not a bad one.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "44:02-44:02"
  },
  {
    "text" : "First ballot Hall of Famer.",
    "speaker" : "Greg",
    "timestamp" : "44:03-44:04"
  },
  {
    "text" : "Productive as shit year in year out.",
    "timestamp" : "44:04-44:06",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "It's productive longer than you'd expect him to be. Yeah. Yeah. That's a good one, Steve.",
    "timestamp" : "44:06-44:11"
  },
  {
    "text" : "Yeah, that's that's pretty good. Um see Rodney Harrison. Who would you compare Rodney Harrison to these days? Like Tyron Matthew, maybe.",
    "timestamp" : "44:11-44:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "More physical. Talks a lot. Super confident. Heavy hitter, like playmaker, ball hawk type.",
    "timestamp" : "44:21-44:35"
  },
  {
    "speaker" : "Steve",
    "text" : "Or even uh Earl Thomas might be a good comp too because one of those you hate him if he's not on your team, but if he's on your team, you kind of love him. Except apparently everybody who's actually on the team hates him.",
    "timestamp" : "44:36-44:46"
  },
  {
    "text" : "Right, right, right, right. But yeah, he's kind of that like always walk in the line. You want it uh when he's on your team you fucking love the guy but if he's playing for somebody else you can't stand him. Oh I had another one.",
    "timestamp" : "44:49-45:01",
    "speaker" : "Andy"
  },
  {
    "text" : "Um I think Well oh what about Camp Chancellor?",
    "timestamp" : "45:01-45:04",
    "speaker" : "Greg"
  },
  {
    "text" : "He's he's retired now but yeah yeah yeah Yeah, just like a bit more physical player. Yeah, yeah.",
    "speaker" : "Andy",
    "timestamp" : "45:04-45:10"
  },
  {
    "timestamp" : "45:13-45:14",
    "speaker" : "Greg",
    "text" : "Throwing his weight around."
  },
  {
    "text" : "Uh but here's one that That started me thinking it because this is what popped into my head when I'm watching Christian Fourier. You look great, Steve. Um Christian Fourier is, I think, a bargain basement version of Travis Kelsey. They look and play exactly the same.",
    "speaker" : "Andy",
    "timestamp" : "45:15-45:33"
  },
  {
    "text" : "You're just saying that because they're both white, Andy.",
    "timestamp" : "45:33-45:35",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "45:36-45:42",
    "text" : "No, their their mannerisms and the the way they run routes and everything are exactly the same. Is Travis Kelsey white?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Are you calling Travel racist? No. What? Travis Kelsey Asian people? What? Where is this coming from? Didn't Fourier get in trouble for um",
    "timestamp" : "45:45-45:56"
  },
  {
    "timestamp" : "45:58-46:09",
    "speaker" : "Greg",
    "text" : "Oh yeah, he did reach Travis Kelsey's white. I have to check these things after Patrick Mahomes. I know. I had no fucking clue that guy was black."
  },
  {
    "speaker" : "Andy",
    "text" : "That's what that throwback was. But yeah, they they look and play exactly the same. And uh just that like quick like run five yards down the field, turn and sit, and then catch the ball. And if you don't catch the ball, you complain to the referees that you're being held. Um and make some pretty acrobatic catches in the end zone sometimes, but also drops easy passes. They have a similar feel to them to me.",
    "timestamp" : "46:09-46:34"
  },
  {
    "text" : "Who's like Brewski and Willie McGuinness? Like some of the linebackers, edge guys.",
    "timestamp" : "46:34-46:39",
    "speaker" : "Steve"
  },
  {
    "text" : "I don't know if there are comps anymore just because of how big linebackers used to be back in the day. Like that's not a thing anymore.",
    "speaker" : "Andy",
    "timestamp" : "46:40-46:48"
  },
  {
    "timestamp" : "46:48-46:53",
    "speaker" : "Greg",
    "text" : "I almost said Vanderesch, but I think that's because I was thinking white middle linebacker."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:55-46:59",
    "text" : "Oh maybe you are racist, Greg. We're just uncovering this now."
  },
  {
    "speaker" : "Steve",
    "text" : "No.",
    "timestamp" : "47:03-47:03"
  },
  {
    "text" : "So much.",
    "speaker" : "Mom",
    "timestamp" : "47:03-47:04"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm just trying to recover for you, Greg.",
    "timestamp" : "47:04-47:06"
  },
  {
    "text" : "Okay. Um yeah, I don't know about McGidd. I I think for middle linebacker, I think oh my god. Now that he's not on who's the uh the middle linebacker last year for the Pets? Hightower? Jesus Christ. No, high tower, thank you. I think hightower would probably be a reasonable comp for Teddy Bruskey, maybe?",
    "speaker" : "Andy",
    "timestamp" : "47:07-47:34"
  },
  {
    "timestamp" : "47:34-47:42",
    "text" : "Uh Bruce looks like a playmaker guy though. Like he's the all these pick sixes we're seeing him make. I feel like Hightower never did that.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Like Ted Johnson was Olandon Roberts. Yeah, the thump part. Risky is the run stopper. Sort of like Hightower.",
    "timestamp" : "47:43-47:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I think that's the closest you're gonna get on this.",
    "timestamp" : "47:49-47:52"
  },
  {
    "timestamp" : "47:52-47:59",
    "speaker" : "Steve",
    "text" : "And then Vrabel was their version of Jamie Collins, more athletic and coverage oriented. And blitzing."
  },
  {
    "timestamp" : "48:00-48:02",
    "speaker" : "Andy",
    "text" : "More like a uh Rob Ninkovich."
  },
  {
    "timestamp" : "48:02-48:27",
    "speaker" : "Steve",
    "text" : "And then Richard Seymour is just a watered down Julius Peppers. Whoa, other way around. I think Julius Peppers was better than Richard Seymour. I can say that. Richard Seymour was great. Don't get me wrong, but Julius Peppers was an absolute monster. Well, I think they just played different positions. Yeah."
  },
  {
    "timestamp" : "48:27-48:35",
    "speaker" : "Greg",
    "text" : "So I'm reading the Christian Fourier thing about when he got in trouble. Yeah. It's fucking ridiculous. I knew it was quiet for too long."
  },
  {
    "speaker" : "Andy",
    "text" : "I knew something was going on.",
    "timestamp" : "48:35-48:36"
  },
  {
    "speaker" : "Greg",
    "text" : "It was about Don Ye, Brady's agent.",
    "timestamp" : "48:37-48:40"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh-huh.",
    "timestamp" : "48:40-48:41"
  },
  {
    "speaker" : "Greg",
    "text" : "Right. And Uh basically the crux of the joke that they're trying to make on EEI was that they had expected Don Yi to have an Asian accent, but he didn't have an Asian accent. Because he's probably born in America. Yeah, exactly. Exactly. So uh he starts like they actually play Don Yi like audio and be like, isn't this crazy? This guy doesn't have an Asian accent. And then he starts reading fake Don Yi text in a normal voice, but they put soft bamboo flute music in the background and then he slips back into Asian Don Yi.",
    "timestamp" : "48:41-49:20"
  },
  {
    "timestamp" : "49:20-49:22",
    "speaker" : "Andy",
    "text" : "What the fuck?"
  },
  {
    "text" : "What an idiot. Yeah, Don Yi was born in Sacramento.",
    "timestamp" : "49:22-49:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Fucking idiot, dude. Dude, EI, that's the best part is because.",
    "timestamp" : "49:28-49:32"
  },
  {
    "text" : "Wait, where was Tom Brady born? Uh Santa Bay. Yeah. Was he born in the same area? This is also yeah, it's uh the Bay Area at least So they're basically born the same. Nobody from EEI was like, this is stupid. Yeah, we we should we should bail on this pretty quick. No, they put flute music behind it. It's 2018. Oh yeah, this is recent. This is yeah. Oh man, that's funny. This is not old. But yeah, that's why it kind of bums me out to see him catch touchdowns on this. I don't know.",
    "timestamp" : "49:32-50:06",
    "speaker" : "Andy"
  },
  {
    "text" : "I'll give him a second chance.",
    "speaker" : "Greg",
    "timestamp" : "50:06-50:07"
  },
  {
    "text" : "You know, so I guess Tom Brady kind of made Don Ye. He has been Brady's agent since ninety-nine.",
    "timestamp" : "50:08-50:14",
    "speaker" : "Steve"
  },
  {
    "text" : "Damn. Since coming into the league. Yeah. It's crazy. Oh man. I can see that look on your face. You're about to say something real fucking stupid that I'm gonna have to cut out of this. I can feel it. You should cut this anyways. What are we, W-E-I? Leaving it all in.",
    "speaker" : "Andy",
    "timestamp" : "50:16-50:39"
  },
  {
    "timestamp" : "50:40-50:41",
    "text" : "Oh man.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh fuck.",
    "timestamp" : "50:42-50:43"
  },
  {
    "text" : "I mean it's not the worst thing in the world. It's just stupid, you know. Yeah. Um speaking it just more shows how dumb they are. Yeah, you know. Like I don't think it's like particularly harmful. I'm sure Donny is like whatever. You know?",
    "speaker" : "Greg",
    "timestamp" : "50:43-51:00"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "51:00-51:01"
  },
  {
    "text" : "It just shows how dumb they are that they're like.",
    "speaker" : "Greg",
    "timestamp" : "51:01-51:03"
  },
  {
    "timestamp" : "51:03-51:14",
    "text" : "But this was also the time when uh Like I think Dennis and Callahan were getting in a bunch of trouble for like wing nutjobs and see those guys actually racist are problematic.",
    "speaker" : "Andy"
  },
  {
    "text" : "Where I think Callahan is, yeah. He's still a big thing. Four years okay. Yeah. And I don't even mind the other guy that went to Barstool, but the Callahan, he's the one that's like a legitimate like problem.",
    "timestamp" : "51:15-51:29",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "51:29-51:29"
  },
  {
    "timestamp" : "51:29-51:36",
    "text" : "Yeah. Yeah. I don't know, because I don't listen to Boston Sports Talk Radio. Thank don't. How were they this week?",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, I've I've checked out. I I can't listen to them this year. Apparently they were talking about how uh Belichick the GM has been tanking this whole time. And it's his fault that and actually looking back on it, Brady did better than anybody could have expected last year because he has no weapons. And the Patriots suck at drafting weapons and the Patriots suck at everything.",
    "timestamp" : "51:37-51:58",
    "speaker" : "Andy"
  },
  {
    "text" : "It's funny they weren't saying that last year. Right. This uh to give context, this is after week Six, so they are current Patriots are currently two and four. You guys want to make predictions as to how this season will play out? Yes. Steven, go ahead.",
    "timestamp" : "51:58-52:18",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "52:20-52:25",
    "text" : "We expose Josh Allen as not good. This game against the Bills."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:25-52:28",
    "text" : "Certified, stamped, not good."
  },
  {
    "speaker" : "Steve",
    "text" : "Whoop-em-up. He throws a bunch of interceptions, plays awful. We crush him and and spur that to go on a fat run.",
    "timestamp" : "52:30-52:38"
  },
  {
    "timestamp" : "52:39-52:41",
    "speaker" : "Andy",
    "text" : "So you're thinking twelve and four like I am?"
  },
  {
    "text" : "Maybe not twelve and four, but you know, ten and six.",
    "speaker" : "Steve",
    "timestamp" : "52:42-52:45"
  },
  {
    "text" : "Okay. And who's the quarterback at the end of the season, Steve?",
    "timestamp" : "52:46-52:49",
    "speaker" : "Andy"
  },
  {
    "text" : "Cam Newton. They go in like they they they sort out Cam and they go on a fat run and The offense looks like it did in the Seattle game and in the Raiders game and you know in the Dolphins game.",
    "speaker" : "Steve",
    "timestamp" : "52:49-53:00"
  },
  {
    "timestamp" : "53:00-53:37",
    "speaker" : "Andy",
    "text" : "I'm with Steve on everything except the record. I think they go twelve and four. I don't think they lose again this season. Similar to this 2003 season that we're about to do. I think uh because uh Ellen goes down, I think it's another um changing of the guard. I think it's the West Welker to Edelman. I think it's now Edelman to Gunnar Olshewski. And he is going to be the new Uh Julian Ellerman, who is the new Wes Walker, who is the new Troy Brown. I think we're going to continue that, especially since he's number 80. It's all going to work out. So he's going to have a thousand-yard season. Uh in 12 more games."
  },
  {
    "text" : "Well I guess we'll have to agree to disagree, Andy, with or I think they go 11 and 5 and you think they go 12 and 4. Greg.",
    "speaker" : "Steve",
    "timestamp" : "53:37-53:45"
  },
  {
    "timestamp" : "53:47-54:55",
    "text" : "I wanna like As soon as you guys started talking, my gut was to be like, we're gonna go fucking two and fourteen. But I actually am like, I I'm not as into dumps about this team as I think other people are. Me neither. I mean they've shown that they can play offense. We've done it with Cam Newton. He can do it. I think they're in disarray right now, but there's still a good coaching staff. Still one of the best in the league. You get back to basics. I think the offensive line is still good and talented, and now they're starting to get healthy. There's no reason they can't run the ball. And there's talent on defense. This team is too talented and too good a coaching staff to be a sub-500 team. But Greg, they have no weapons. It never had weapons. I do think there's some legitimacy to like people underestimated what Brady meant to this team though. Just from like uh keeping the ship righted and situations like this where you start things don't go well. That's why the Patriots like never lose like multiple games in a row is because I think everyone's like, we have faith in Brady and Belichick, but once cracks show and you have new guys in there, it's like",
    "speaker" : "Greg"
  },
  {
    "text" : "Well, they were talking this week about how all the old school Patriots like uh Devin McCourty have been asking the new guys who come in how they handle a losing streak. Yeah. Don't know how to do it because they've never experienced it before as a Patriot player. It's crazy. Like so what do you guys do if you lose like three of these games in a row? Like do we panic? Is that is that how this works?",
    "timestamp" : "54:56-55:18",
    "speaker" : "Andy"
  },
  {
    "text" : "Well, I'm gonna say one thing and then I'm gonna bring it home to the Jets game again. The only thing that gives me pause is their inability to stop the run because they don't have any fat boys in the middle. Everyone keeps getting hurt. And I'm surprised like we saw that doom in in 2002, right? That was a big issue with that team. That's why they didn't play well because they just could not stop the run. And then we get the biggest fat boy on the market in the offseason. Not Washington. Horically fat, as we discussed here today. The Washington Monument. And then he gets injured in week three. So I'm s I'm interested to see how the Patriots piece together the because he what fractured his leg, so he's got to be out for a while. Did he? Week ten. He comes back week 10.",
    "timestamp" : "55:19-56:01",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Also, I I looked up the Roosevelt Colvin thing. Wikipedia said he shattered the socket in his left hip.",
    "timestamp" : "56:03-56:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it was I knew it was something like crazy like that.",
    "timestamp" : "56:09-56:12"
  },
  {
    "speaker" : "Greg",
    "text" : "Stood out.",
    "timestamp" : "56:12-56:13"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:14-56:23",
    "text" : "Right? Oh my god. That's a horrendous thing. How do you I don't even understand how that works. There's some like muscles and shit attached to that too."
  },
  {
    "text" : "Like God. Oh yeah.",
    "timestamp" : "56:23-56:24",
    "speaker" : "Steve"
  },
  {
    "text" : "The rehab on that's gonna suck.",
    "speaker" : "Andy",
    "timestamp" : "56:25-56:27"
  },
  {
    "text" : "That that makes me feel Not better, but I I I pictured Roosevelt Colvin as kind of a bust. Like I remember being excited about him. But if it was more injury related, then he couldn't fit the system. That makes me feel better for him.",
    "speaker" : "Greg",
    "timestamp" : "56:27-56:41"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "56:41-56:42"
  },
  {
    "text" : "I don't know. You never want to see a guy not perform well. I mean, obviously injuries suck, but at least it wasn't just like I I he couldn't figure it out.",
    "speaker" : "Greg",
    "timestamp" : "56:42-56:51"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:51-57:16",
    "text" : "Like I think he's a cool dude, too. Uh from what I I think it was him, he owns uh cupcake shop in the shop. Yeah. Like didn't expect you to say cupcake shop, right? But yeah, I think that's what he does. So he like he still does like radio interviews and stuff. Cause what when the pages are playing a Super Bowl in Indianapolis, what was that one? Yeah, I saw that same segment."
  },
  {
    "text" : "Is there somebody else with it as well, right? There's him and another player or something. Maybe. I don't know.",
    "speaker" : "Steve",
    "timestamp" : "57:17-57:21"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:21-57:23",
    "text" : "But yeah, so cool dude still."
  },
  {
    "text" : "Cupcake shop.",
    "timestamp" : "57:24-57:25",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, that's um but go going back to I think that'd be like Ted Washington. Going back to WEI and um talking about why are we going back to WE about Brady? Uh Speaking of Brady talking badly or having a hard time deciphering him, John Abraham in this game was quoted as saying that he can't get a handle on Brady's cadence. Which was blatantly obvious because Brady, I think, had what three, maybe even four uh hard counts that that drew just defenders off sides. He looked like Aaron Rodgers out there. This was peak Tom Brady hard count. I don't remember him using it recently. Yeah, I've seen that too. When's the last time you've seen Brady try to draw somebody off sides? Yeah. It doesn't do it anymore. But he was real good at this game.",
    "timestamp" : "57:25-58:12",
    "speaker" : "Andy"
  },
  {
    "text" : "He like I say he looks like Aaron Rodgers out there. Aaron Rodgers been doing that forever. That's that's pretty impressive. That's his version of Brady's quarterback sneak. True, yeah. You ever seen the stats on Roger's like free plays? They're insane. Yeah, they're out of control.",
    "timestamp" : "58:13-58:27",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:27-58:29",
    "text" : "Because he just he just takes a deep shot every single time."
  },
  {
    "timestamp" : "58:30-58:34",
    "speaker" : "Steve",
    "text" : "Because he does it so often, he gets so many of them that Yeah, everybody on the team knows just go deep."
  },
  {
    "timestamp" : "58:36-58:42",
    "speaker" : "Greg",
    "text" : "I wonder if they they change it. Like people figured out Brady's Through like film study or whatever."
  },
  {
    "timestamp" : "58:42-58:43",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, yeah."
  },
  {
    "text" : "And like Rogers has like changed his cadence enough that he can still get people.",
    "speaker" : "Greg",
    "timestamp" : "58:43-58:47"
  },
  {
    "timestamp" : "58:47-59:07",
    "text" : "Well that's what they were saying, like because they were talking about John Abraham and how he Would like he would study that on quarterbacks he'd get the jump on them. He's like, I can't do that with Brady. I can't figure out what his cadence is. And they got him a few times. Wouldn't that fuck with deer Own team? Offensive line? You can think. Unless you just tell them, hey, I'm going on three.",
    "speaker" : "Andy"
  },
  {
    "text" : "Maybe that's maybe that's something to do with it, is like you weigh like how often you're getting false starts as opposed to",
    "speaker" : "Greg",
    "timestamp" : "59:09-59:15"
  },
  {
    "timestamp" : "59:15-01:00:30",
    "speaker" : "Andy",
    "text" : "offsides and if you're like it's not worth it to even try these yeah because the pages did do one of the uh hang on see they they did do the the whole um Trying to do uh drawing them off sides on fourth down that Greg hates. I hate that. But the the whole sequence was amazing because Um, it's fourth and one, like just inside Jets territory. And they line up to punt it, like they send the punt team out, line up to punt it, and then last second. I don't know how they managed to sneak him on, but uh Damon Heward is in there and they they tried something like this maybe last season or something, where they shift really quickly and Damon Heward gets under center. And then like they literally just snapped the ball and he did the Brady QB sneak because it's fourth or one. Uh, but like right as they shifted the one of the jets called timeout. Because they had no clue what was going on. And Damon Hewitt basically took the ball. Like as they called timeout, they hiked up hiked it. The refs gave them the timeout, but it was like Fraction of a second close. And Damon Hewitt just took off at a full sprint straight down the field. And basically, if the play had stood, would have had a one-on-one with Santana Moss to get in the end zone"
  },
  {
    "text" : "That would have been cool.",
    "timestamp" : "01:00:30-01:00:31",
    "speaker" : "Mom"
  },
  {
    "speaker" : "Andy",
    "text" : "So but it the but then it gets called back because the timeout. So then they put the offense on the field, do a shit ton of motion. Brady's trying to do a hard count and everybody's like, yeah, we know what this is. And then they call a timeout and come bring the punt team on and actually punt it. It's like it took like probably five full minutes of actual time to get a punt to get up to get a punt off.",
    "timestamp" : "01:00:31-01:00:51"
  },
  {
    "speaker" : "Greg",
    "text" : "And they just wasted everybody's time, including the viewers. They never think about me, the fan. You know? How dare they? This is an entertainment business. You can't just like get my hopes up and be like, we're gonna go for this and then pull this bullshit like What if we get 'em? What if this is the one out of a thousand times we would actually trick him on this?",
    "timestamp" : "01:00:52-01:01:16"
  },
  {
    "text" : "Well, that's the you think you you get 'em all relaxed and then you snap it anyway.",
    "timestamp" : "01:01:17-01:01:21",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "That's what they should do is do this like let the clock run and then at the last second call it and play it. Yeah because no one does that. Nobody does that. Nobody does that. Yeah, and the whole offensive line should do the defense line just sitting there going, okay, this is one of those things. I don't know. No jump off sides, guys. Whatever you do, don't move.",
    "timestamp" : "01:01:21-01:01:38"
  },
  {
    "text" : "They're not ready for someone to come and hit them. Yeah. They're not yeah, they're not gonna get a push on it because you're you're definitely gonna be able to do that.",
    "speaker" : "Steve",
    "timestamp" : "01:01:39-01:01:43"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:01:44-01:01:46",
    "text" : "Or you should go sell this to fucking Belichick."
  },
  {
    "speaker" : "Andy",
    "text" : "No, you know what you should do is you should you should line up And then have your punter throw it to your center who's lined up as the tight end and have it bounce off his hands. Yeah. Great play guy. Bringing it all back, baby. Pro Bowl Captain May didn't get in the Pro Bowl for his hands. Not as well Aaron Rodgers' free plays.",
    "timestamp" : "01:01:46-01:02:08"
  },
  {
    "timestamp" : "01:02:08-01:02:20",
    "speaker" : "Steve",
    "text" : "He has nearly 2,000 passing yards. Yeah, I love it. The next closest is Ben Rothesburger. He has just barely above a thousand, so he's doubled up second place. Damn."
  },
  {
    "text" : "Well, all right. I think that's probably about it for this game, yeah?",
    "timestamp" : "01:02:20-01:02:23",
    "speaker" : "Andy"
  },
  {
    "text" : "You guys want your best and worst?",
    "speaker" : "Steve",
    "timestamp" : "01:02:23-01:02:24"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:02:26-01:02:30",
    "text" : "All right. Uh Greg, what was your best and worst?"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, Greg gets to go first. He never gets to go first.",
    "timestamp" : "01:02:30-01:02:33"
  },
  {
    "speaker" : "Andy",
    "text" : "Well he did watch the game. Oh he didn't watch the game.",
    "timestamp" : "01:02:33-01:02:36"
  },
  {
    "speaker" : "Greg",
    "text" : "My guest was Asante Samuel. 55 yard interception return for a touchdown. That's the game.",
    "timestamp" : "01:02:36-01:02:49"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:02:49-01:02:52",
    "text" : "Taking over for uh an injured Tylaw though."
  },
  {
    "timestamp" : "01:02:53-01:03:04",
    "text" : "That's fine. I'm not butthurt because Patriots are making plays, you know. You know who was butthurt? I can root for two two people at once.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "You know who's butthurt about it? Oh Ty Law, because he came back still hobbling it like very obviously, but came back in his butt hurt. Uh he wasn't about to stop to sign by Samuel the rookie. Yeah.",
    "timestamp" : "01:03:04-01:03:20"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:03:20-01:03:23",
    "text" : "How do you know that's what was going through his head though? Are you just projecting?"
  },
  {
    "text" : "No, you could tell.",
    "speaker" : "Andy",
    "timestamp" : "01:03:23-01:03:24"
  },
  {
    "timestamp" : "01:03:24-01:03:34",
    "speaker" : "Greg",
    "text" : "You can see it in his eyes. Oh, you could see it in his eyes. Mm-hmm. I can read people. Interesting. I didn't realize that. What am I thinking right now? You're thinking I'm bullshitting. I'm coming up with a lot of bullshit."
  },
  {
    "text" : "Yes. So yeah, I can read people.",
    "speaker" : "Andy",
    "timestamp" : "01:03:34-01:03:36"
  },
  {
    "text" : "Yeah, you're good at this. Uh all right, what's your worst? Um How about fucking Herm Edwards? Like recycling that quote. That's what's getting me here because he I listened to it and I was like, that's actually a pretty good quote. And then now that I know he just recycled it from the year before, you play to win the game, like, dude, come up with new material, you know? He's probably one of these coaches. Yeah, I bet he's one of these guys who's like, I don't read the newspapers either. Yeah, right. He saw how people reacted to the first time he said it and he's like, people love this shit. I'm definitely using it.",
    "timestamp" : "01:03:36-01:04:14",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Mm-hmm. Yeah. All right, I'll give you that. What about you, Steve Brown? Okay.",
    "timestamp" : "01:04:15-01:04:21"
  },
  {
    "timestamp" : "01:04:23-01:04:39",
    "text" : "All right. Um Let's see, I'll go my worst first. Okay. We didn't touch on this yet, but um I've mentioned this earlier, how I think it's so dumb with the hat taking off thing for the referees.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, I couldn't remember if that was you or if that was Greg.",
    "timestamp" : "01:04:39-01:04:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. They just look like idiots. And then they all huddle up and one guy's got his hat and then sometimes like they take their hat off and throw it off while they're in the huddle. Stupid. That that made its own appearance in this uh game where Benny Tessaverde actually threw a great ball down the sideline and Wayne Corbett just kind of barely stepped out and came back in and caught it for a touchdown. And we kind of got bailed out there a little bit because your boy Eugene Wilson just like fell over his own feet Yeah, he just was trying to like flip his hips and just tripped over the twenty yard line. He's a rookie dude.",
    "timestamp" : "01:04:41-01:05:23"
  },
  {
    "text" : "Well Asante Samuel's also a rookie, but he's he's returning interceptions for touchdowns.",
    "speaker" : "Andy",
    "timestamp" : "01:05:24-01:05:30"
  },
  {
    "timestamp" : "01:05:31-01:05:34",
    "text" : "Yeah, I think they figured out we'll see how that plays out, Andy.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Asante Samuel still thinks he can he can go today. He thinks he's uh trying to make a case for himself to be in the Hall of Fame on Twitter right now.",
    "timestamp" : "01:05:36-01:05:44"
  },
  {
    "timestamp" : "01:05:44-01:05:46",
    "speaker" : "Greg",
    "text" : "I'll sign him. He's a scamper guy. I like scamper guys."
  },
  {
    "speaker" : "Andy",
    "text" : "It's uh yeah, it's pretty entertaining. Yo, he just built the print.",
    "timestamp" : "01:05:47-01:05:50"
  },
  {
    "text" : "I have another worst Andy. This one's this one's dedicated to you.",
    "speaker" : "Steve",
    "timestamp" : "01:05:50-01:05:53"
  },
  {
    "timestamp" : "01:05:53-01:06:04",
    "speaker" : "Greg",
    "text" : "Yo, that's sus. Blue is sus. Yo, this whole podcast is sus. Sante Samuel built different."
  },
  {
    "timestamp" : "01:06:04-01:06:11",
    "text" : "Greg's the imposter. Steve, what let's hear. I I love dedications.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:06:11-01:06:51",
    "text" : "Your second worst is uh your buddy Dan Deerdorf's quote. Fuck Dan Deerdorf. What was it? It was on uh the Asante Samuel Pick Six that Greg's favorite play is. Yeah. Where he like bats it up and catches it and has actually great ball skills. Yeah. And he's just like, oh, it's all luck. Right. The actual like great football play, I mean, maybe lock that like Vinny Tessa Verdi was behind center, but the actual play was a pretty high ball skill play, and he just totally, totally disregards it for like five minutes and doesn't play it."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:52-01:07:26",
    "text" : "Ever since they tried the uh the fake field goal where they were throwing it to an offensive lineman, which he used to be, they were talking about how many balls he had caught, which uh spoiler alert was zero. He's like, yeah, no, I I had 17 touchdowns in my career. And uh who was it Dick Emberg? Basic is like, no you no you didn't And so the entire time was like talking he was trying to like talk himself up as a receiver. And so I think that was part of it was Asante Samuel making this great acrobatic catch. Like, well that was that was just luck. I should I should know because I'll call a lot of it."
  },
  {
    "speaker" : "Steve",
    "text" : "Get me riled up, Steven. This should have me laughing my ass off because I was watching it with my roommate Abby, who's from India. And I rewound it and played it again for him. And I was like, did you just hear that? He's like, no. So I rewound it and played it. And this is a this isn't even a football or not football. This is the direct quote. This is just power dick pounded away at the interior of the jets.",
    "timestamp" : "01:07:29-01:07:53"
  },
  {
    "text" : "Power dick football, baby.",
    "timestamp" : "01:07:54-01:07:57",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Oh fucking course.",
    "timestamp" : "01:08:02-01:08:04",
    "speaker" : "Andy"
  },
  {
    "text" : "Who is his broadcast partner? Someone named Richard, right? I'm assuming. Dick Enberg, yeah. Yeah, Dick Enberg. So this is just power, Dick.",
    "speaker" : "Steve",
    "timestamp" : "01:08:05-01:08:12"
  },
  {
    "timestamp" : "01:08:16-01:08:18",
    "speaker" : "Greg",
    "text" : "Power tech football, baby."
  },
  {
    "speaker" : "Andy",
    "text" : "I feel like that should be like a video game on your like a football game on your phone, power deck football.",
    "timestamp" : "01:08:21-01:08:27"
  },
  {
    "timestamp" : "01:08:27-01:08:35",
    "speaker" : "Greg",
    "text" : "Just taking that. That should be a t-shirt. Yeah. Power dick football. Shit pumping and power dicking."
  },
  {
    "speaker" : "Steve",
    "text" : "Shit fucking objective.",
    "timestamp" : "01:08:38-01:08:39"
  },
  {
    "timestamp" : "01:08:41-01:08:43",
    "speaker" : "Andy",
    "text" : "Oh Christ."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:43-01:08:51",
    "text" : "I guess that could be a best. I don't know. Maybe that's a best. I'm writing that shit down."
  },
  {
    "speaker" : "Andy",
    "text" : "All right, I'll go off of that. My best. Um speaking of paradigm football, I discovered a new uh video football video game for your phone called Retro Bowl. I highly recommend it. It's free. And I've I have spent all week uh sitting on the toilet playing it to where I uh my legs keep falling asleep and I keep not being able to get up afterwards.",
    "timestamp" : "01:08:53-01:09:17"
  },
  {
    "speaker" : "Greg",
    "text" : "See, I stopped doing that once I stopped going into the office. Used to happen to me all the time. It hasn't happened since March, coincidentally.",
    "timestamp" : "01:09:18-01:09:29"
  },
  {
    "timestamp" : "01:09:32-01:09:42",
    "speaker" : "Andy",
    "text" : "Uh I can't help it. I live in a small house, so the bathroom is my sanctuary. If I need to just like have some me time, I go in there, you know, I make it a big deal, light some candles, bring my phone in."
  },
  {
    "timestamp" : "01:09:43-01:09:43",
    "speaker" : "Greg",
    "text" : "Oh god."
  },
  {
    "speaker" : "Andy",
    "text" : "Watch a video or or play plays a play a game, read a book, play my guitar sometimes.",
    "timestamp" : "01:09:44-01:09:49"
  },
  {
    "text" : "Andy, I'm gonna be honest, this sounds sus.",
    "speaker" : "Greg",
    "timestamp" : "01:09:49-01:09:51"
  },
  {
    "text" : "Yeah, retro bowl on your phone. So it's uh retro bowl on your toilet bowl. It's great. I highly recommend it. Retro bowl on the toilet bowl. Is that your best? Yeah. Uh also if you wanna if you want a game specific best, I would put Tyrone Pool up there. He had himself a great game. I think all the defensive backs did. They played a great one. Hiron Olympic sized pool.",
    "timestamp" : "01:09:56-01:10:19",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I think we said kitty pool last time, but yeah, in this game he was Olympic sized.",
    "speaker" : "Greg",
    "timestamp" : "01:10:19-01:10:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:23-01:10:25",
    "text" : "Yeah. Yeah. Uh he had himself."
  },
  {
    "text" : "Um Kevin Mawai, you gotta be so rude. That's a good one.",
    "speaker" : "Greg",
    "timestamp" : "01:10:25-01:10:31"
  },
  {
    "text" : "I was gonna say Kevin Mawaian shirt.",
    "speaker" : "Andy",
    "timestamp" : "01:10:32-01:10:35"
  },
  {
    "timestamp" : "01:10:36-01:10:39",
    "speaker" : "Greg",
    "text" : "Oh good too. That's good."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh my worst was uh as much as I talked about Kevin Falker being the MVP, he did make a mistake in this game. The Patriots called a running back pass. And Kevin Falk looked like a high school quarterback that he probably was by throwing it, lofting it into triple coverage. And nearly getting it intercepted. Which brought out the Dan Dierdorf. Oh, this is why they this is why they say that this is why he plays defensive back, because if he could catch, he'd be a wide receiver. So he got he got to beat that dead horse again. So that was fun. And then one stat that I enjoyed that they showed kind of Halfway through this game, uh the teams in the AFC that made the playoffs in 2002 um all started uh 500 or worse. The Jets and the Titans both started 1-4. Steelers started 1-3. Browns started 2-4. And the Colts and Raiders started 4-4.",
    "timestamp" : "01:10:39-01:11:43"
  },
  {
    "text" : "Yeah, this is the the first time in NFL history that the two Super Bowl contestants did not make the playoffs the following year.",
    "speaker" : "Greg",
    "timestamp" : "01:11:45-01:11:53"
  },
  {
    "timestamp" : "01:11:54-01:11:54",
    "text" : "Really? Yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:11:55-01:11:57",
    "text" : "Oh shit. So the Raiders in the box."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because they both fell the fuck off. Wait, the box fell off too? No shit.",
    "timestamp" : "01:11:57-01:12:01"
  },
  {
    "speaker" : "Greg",
    "text" : "com, so can't be wrong. Must be true.",
    "timestamp" : "01:12:04-01:12:06"
  },
  {
    "text" : "Yeah, all right. Uh oh, don't forget we have our uh we have our hotline to make it easy for people to tell us what they think of us. Um and and why Greg should or shouldn't do more deep dives into fat people.",
    "speaker" : "Andy",
    "timestamp" : "01:12:10-01:12:24"
  },
  {
    "timestamp" : "01:12:25-01:12:38",
    "speaker" : "Greg",
    "text" : "Ooh, 603-505-8043. That number again. Get your pens ready. 603-505-8043."
  },
  {
    "speaker" : "Andy",
    "text" : "Can you say it a bit slower for the people with the the rotary rotary dial?",
    "timestamp" : "01:12:39-01:12:43"
  },
  {
    "timestamp" : "01:12:44-01:12:58",
    "text" : "The number six, the number zero, the number three 505 8043.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:12:59-01:13:39",
    "speaker" : "Andy",
    "text" : "You can always text this number, correct? Yeah, that was good. You can text that number, yeah. It's a it's a it's a fully grown up. Phone number. You can text it, you can call it, and you leave a voicemail. Um who's gonna be receiving these texts? It's hooked up to it's hooked up to my cell phone at the at the moment and my computer, so I may accidentally answer it. Um, but we'll see. I can see both of you audiophones right now, and I'm a little worried what's about to come through. Uh just don't forget that if you send a dick pic, make sure it's funny, right, Greg? Um that if we post it on show notes, no dick pic talks."
  },
  {
    "text" : "Mom said no and mom said no willy talk on the air.",
    "speaker" : "Greg",
    "timestamp" : "01:13:40-01:13:44"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:44-01:13:49",
    "text" : "So do not send us any pictures of your Willy."
  },
  {
    "timestamp" : "01:13:49-01:13:51",
    "speaker" : "Greg",
    "text" : "No Willy pics, dude."
  },
  {
    "timestamp" : "01:13:53-01:13:55",
    "text" : "No Willy Grams, please.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Andrew, can you confirm that you have received the hotmail message? Yeah, I sent one. Oh, he got it. You got it.",
    "timestamp" : "01:13:56-01:14:05"
  },
  {
    "speaker" : "Andy",
    "text" : "I sure did. And I can respond right on my phone too. So if you actually reach out to us, uh just be prepared that it is not just a one-way Street. What does GFY mean?",
    "timestamp" : "01:14:06-01:14:17"
  },
  {
    "speaker" : "Steve",
    "text" : "Stat Trek? Sounds sus. Sounds very sus.",
    "timestamp" : "01:14:17-01:14:21"
  },
  {
    "text" : "It is. I mean it's good for you, Steve. Yeah.",
    "timestamp" : "01:14:22-01:14:26",
    "speaker" : "Andy"
  },
  {
    "text" : "But that's not good for me because I say Greg smells, can we do something about that? And that's not good for me. It is because you're not in the same room as him. Yeah, but I can smell them all the way up here, 500 miles away. Yeah, that's tough.",
    "speaker" : "Steve",
    "timestamp" : "01:14:27-01:14:38"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, this this podcast is on fleek",
    "timestamp" : "01:14:38-01:14:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:14:44-01:14:56",
    "text" : "I think this podcast is over. What a way to go out. It's unraveling. Hitting the high notes. So yeah, so if you have any if you have anything you need to say to us."
  },
  {
    "speaker" : "Greg",
    "text" : "Six oh three five oh five eight oh four three Hundo P Yo fam Hundo P this shit is lit",
    "timestamp" : "01:14:58-01:15:06"
  },
  {
    "speaker" : "Andy",
    "text" : "And that's enough. All right, we'll see you next week for the I think the last loss in uh very long future.",
    "timestamp" : "01:15:08-01:15:19"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. This next week is gonna be Gucci. Yeah, fam. Yeah, fam. Hundo P see you next time, Hondo Peace.",
    "timestamp" : "01:15:19-01:15:30"
  },
  {
    "timestamp" : "01:15:31-01:15:41",
    "speaker" : "Andy",
    "text" : "We'll see you next week. Uh maybe without Greg if he continues this on the Patriots Dynasty podcast. Yo, you gonna do me like that, fam?"
  },
  {
    "timestamp" : "01:15:42-01:15:43",
    "text" : "See you later.",
    "speaker" : "Mom"
  }
]