[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:23-00:38",
    "text" : "Welcome back to the Pages Dynasty Podcast. I'm Annie Brown. I'm here today, my brothers, both brothers, Steve and Greg. Steve, how you doing? Perific. Oh god. New new dog dad Steve Brown."
  },
  {
    "timestamp" : "00:38-00:42",
    "speaker" : "Steve",
    "text" : "Yeah, but I said I was perrific, Andy, not Barkorific."
  },
  {
    "text" : "We got a woofer. A little baby woofer is part of the family. He's a doggy daddy now.",
    "speaker" : "Greg",
    "timestamp" : "00:46-00:52"
  },
  {
    "text" : "A little fur baby.",
    "speaker" : "Steve",
    "timestamp" : "00:52-00:53"
  },
  {
    "text" : "Do do you have a do you have a bumper sticker where it's you and your girlfriend and the dog now is stick figures?",
    "timestamp" : "00:53-00:59",
    "speaker" : "Andy"
  },
  {
    "text" : "Wait, wait. Greg, you hate fur baby, don't you? Of course. Oh yeah, I'm definitely gonna call this dog my fur baby all uh I expect nothing less. In fact, while you were until now.",
    "timestamp" : "00:59-01:10",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Because I hate it. While you were out of the room just now, before we started recording, me and Andy were discussing and we came to the agreement that it it's very fitting that you got the runt of the litter because you're the runt of mom and dad's litter.",
    "timestamp" : "01:10-01:26"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:27-01:38",
    "text" : "Yeah, I guess that's fair. I don't I don't choose the smallest, but we are certainly the last one. Well just the dumbest and most uncouth. Yeah, I wanted my dog to be like me, Greg."
  },
  {
    "text" : "The rundiest",
    "timestamp" : "01:38-01:39",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "The runtiots.",
    "timestamp" : "01:39-01:40"
  },
  {
    "text" : "The runtiest of the brown letter, Steven.",
    "speaker" : "Greg",
    "timestamp" : "01:41-01:44"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:45-01:48",
    "text" : "Oh God. Mom is now yelling at this podcast."
  },
  {
    "timestamp" : "01:49-01:50",
    "text" : "That's not true.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:50-01:57",
    "text" : "And Greg, the cruttiest of the Brown Brothers. Well played."
  },
  {
    "text" : "Well played.",
    "speaker" : "Greg",
    "timestamp" : "01:58-01:58"
  },
  {
    "timestamp" : "01:58-02:04",
    "text" : "All right. Well if you haven't figured it out by now, this is a podcast where we talk about Patriots games from 20 years ago.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, first Steve, have you uh how many times have you picked up shit with your hands?",
    "timestamp" : "02:05-02:10"
  },
  {
    "timestamp" : "02:10-02:11",
    "speaker" : "Steve",
    "text" : "None."
  },
  {
    "timestamp" : "02:11-02:13",
    "speaker" : "Greg",
    "text" : "None. Does the dog shit yet?"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "02:14-02:14"
  },
  {
    "text" : "They do",
    "speaker" : "Greg",
    "timestamp" : "02:15-02:15"
  },
  {
    "speaker" : "Andy",
    "text" : "Greg is stretching limits of his knowledge here.",
    "timestamp" : "02:18-02:20"
  },
  {
    "text" : "Yeah, we have a yard. Just shits in the yard and then use a pooper scooper. Alright. Oh good.",
    "speaker" : "Steve",
    "timestamp" : "02:22-02:26"
  },
  {
    "timestamp" : "02:27-02:30",
    "speaker" : "Greg",
    "text" : "See, that's what I'd never be able to do with dogs is the shitting."
  },
  {
    "text" : "Yeah. Good thing you you want to get a baby because then you can just have the shit all over your hands and but it's also it's another human, like us the most evolved species on earth.",
    "speaker" : "Steve",
    "timestamp" : "02:30-02:40"
  },
  {
    "speaker" : "Greg",
    "text" : "humans are waiting for a dog to shit, following it around and then picking it up with our hands and be like, I got this for you. Let me let me just take care of this. It's like what have we come to that that's acceptable? We should ask Kelly what she thinks about it. I bet she's still doing it. At least um if I'm picking up a human shit, it's humans, you know? I feel it's worse.",
    "timestamp" : "02:40-03:02"
  },
  {
    "speaker" : "Andy",
    "text" : "It feels worse to me. I don't know why. Speaking of human shit, uh this week we're talking about the Jacksonville Jaguars.",
    "timestamp" : "03:03-03:12"
  },
  {
    "timestamp" : "03:12-03:14",
    "text" : "Good transition, Andy.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "03:14-03:34",
    "speaker" : "Andy",
    "text" : "I don't know where I was at it with that. That's as far as I got though. You hate the Jaguars that much, huh? Jack Del Rio, I guess, maybe? I don't know, I think. Head coach, rookie head coach Jack Del Rio. His first game. Yeah, is his first attempt at the uh playing the Patriots. First of six times that he would play the Patriots. Wanna guess how many times he would beat them?"
  },
  {
    "text" : "Zero. None. None.",
    "speaker" : "Greg",
    "timestamp" : "03:34-03:36"
  },
  {
    "timestamp" : "03:37-03:50",
    "speaker" : "Andy",
    "text" : "You did not look and uh it was never close. The average margin of victory against Jack Dorio teams was almost three touchdowns. It was 18 points. And Brady averaged a 126 quarterback rating."
  },
  {
    "speaker" : "Steve",
    "text" : "That being said, I thought the Jaguars played pretty competitively in this game.",
    "timestamp" : "03:50-03:54"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because they came in at four and nine, so this is supposed to be like another trap game like the Texans was a few weeks ago. But it didn't feel that way and Belichick wasn't talking about that way.",
    "timestamp" : "03:54-04:05"
  },
  {
    "text" : "Not that he would, but well this is like a decent roster.",
    "timestamp" : "04:06-04:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and uh and I think the Jaguars were kind of hot at the time too.",
    "timestamp" : "04:10-04:13"
  },
  {
    "timestamp" : "04:13-04:19",
    "text" : "They came in Yeah, they they went they started one and seven, right? And then they'd started playing better.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:19-04:35",
    "text" : "They they had beat the Colts earlier this season, they had hung with the Titans. I guess they said they were on the two-yard line with the Titans at the end of the game, but couldn't finish that. And last week, the week before this game, they beat the hell out of the Texans 27-0. Who gave the pages run for their money a few weeks ago?"
  },
  {
    "speaker" : "Greg",
    "text" : "So speaking of Titans, I saw this when I was doing my research for this podcast.",
    "timestamp" : "04:35-04:40"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "04:40-04:41"
  },
  {
    "timestamp" : "04:41-05:20",
    "speaker" : "Greg",
    "text" : "We call the Bucks, the Buccaneers, the Bucks. We call the Jaguars the Jags. What do we call the Titans? The tights. The tits. I'm gonna that's my research. That's how I research. It sure is. You don't want you want to see know what I want to know what I do is I I Google search? I I Google Jacksonville Jaguars funny and Jacksonville Jaguar is sad. What comes up?"
  },
  {
    "timestamp" : "05:22-05:28",
    "text" : "I feel like you need a third Google search, which is Jacksonville Jaguars stupid. Stupid. Yes. I feel like that might kind of broaden the range of the thing.",
    "speaker" : "Andy"
  },
  {
    "text" : "Jacksonville Jaguars, Florida man. Ooh.",
    "timestamp" : "05:29-05:32",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "They are a very Florida man team, aren't they?",
    "timestamp" : "05:32-05:35"
  },
  {
    "text" : "So Greg, you did you want to talk about these Jacksmill Jaguars a bit?",
    "speaker" : "Andy",
    "timestamp" : "05:35-05:39"
  },
  {
    "speaker" : "Greg",
    "text" : "Sure. Yeah. All right.",
    "timestamp" : "05:39-05:40"
  },
  {
    "speaker" : "Andy",
    "text" : "What do you got?",
    "timestamp" : "05:40-05:41"
  },
  {
    "text" : "Well, I figured like since they're like a relatively new team, you can really kind of like quickly go over like the history of the franchise. Like the whole thing. Yeah. Yeah. So they're a ninety-five expansion team. Because I think, you know, we have this perception that the Jags are like like the Browns in that category of like perennial losers, but I don't think that's their reputation going into this game. I agree. Yes, which I We played them twice in the playoffs before this, which I had forgotten.",
    "timestamp" : "05:41-06:17",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:17-06:18",
    "text" : "I forgot the second one."
  },
  {
    "timestamp" : "06:18-06:36",
    "speaker" : "Greg",
    "text" : "Yeah, so they're a 95 expansion team. They have like a decent record their first year, which was like kind of out of the norm. They got Mark Brunel and Tom Coughlin, which I think had a lot to do with some of their early success. So their second year in the league, they make the AFC championship game."
  },
  {
    "timestamp" : "06:36-06:37",
    "speaker" : "Andy",
    "text" : "Lose to the Patriots."
  },
  {
    "speaker" : "Greg",
    "text" : "That's the year we we go to the Super Bowl against the Patriots.",
    "timestamp" : "06:37-06:40"
  },
  {
    "text" : "Didn't the the because the Panthers were the other expansion team. I think they also made the NFC championship game. Both Catholic this year.",
    "speaker" : "Andy",
    "timestamp" : "06:42-06:51"
  },
  {
    "text" : "So then they have like a bunch of winning seasons within their first like six or seven years. So 1998, they went 11 and 5 and they beat the Patriots. In the wildcard game. Did you remember that? I had no recollection of this. What year was that? 1998. That was the Robert Edwards year. Oh, right, right. So I think the Pats kind of like backdoored into the playoffs anyways. Yeah, yeah, yeah. And they had to go to Jacksonville and they lost. That was the Pete Carroll days.",
    "timestamp" : "06:51-07:22",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Mm-hmm.",
    "timestamp" : "07:22-07:23"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Um nineteen ninety-two or nineteen ninety-nine, they went fourteen and two. Holy shit. Yeah. And this was like it slid me down a further rabbit hole, but their divisional game, they were playing the Dolphins in Merinos last game.",
    "timestamp" : "07:23-07:42"
  },
  {
    "timestamp" : "07:42-07:48",
    "text" : "Oh, I remember this. I don't remember this at all. I remember this game. Not a great way to go out.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:52-07:56",
    "text" : "The Jacksonville beat Miami sixty-two to seven.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. In the playoffs.",
    "timestamp" : "07:56-07:58"
  },
  {
    "speaker" : "Greg",
    "text" : "In the playoffs. It was, I got some notes here on this. It was 38 to nothing before Dan Marino threw a completed pass.",
    "timestamp" : "07:58-08:08"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh.",
    "timestamp" : "08:08-08:09"
  },
  {
    "text" : "To his own team though. He had already got two interceptions at that point in time. Before he had completed a pass to his own team, it was 38 to nothing.",
    "timestamp" : "08:09-08:18",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "So it's like the second half or middle of the second quarter. Oh no, that's not.",
    "timestamp" : "08:20-08:25"
  },
  {
    "timestamp" : "08:26-09:21",
    "speaker" : "Greg",
    "text" : "Yeah. They they had Jacksonville had their backup quarterback in the game in the first half Jay Feedler, which I Jay Feedler. Yeah, that comes in for Brunel in the first half. Um The total yards at the end of the game, Miami had 131 and Jacksonville had 520. Jesus. Never mind like the interception return for touchdown yards and all that. That's just offensive yards. 62 to 7. And that was the same week that Bill Belichick. was a head coach of the New York Jets. So he was only head coach for the United States. For a day. Oh no shit. Yeah, so it was the end of that season when Belichick did that whole, oh I'm going with the Jets backdoor and back onto the Pats. So that was the time frame it that's when that all went down."
  },
  {
    "text" : "That's amazing. What a great week that was.",
    "speaker" : "Andy",
    "timestamp" : "09:22-09:25"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. So yeah, that's kind of their history. So they went that that was their best season, fourteen and two, and then they've had like three straight subpar years of like six wins, five wins. Uh Coughlin gets fired at the end of last year. And then they come into this year and they draft Byron Lefich with the seventh overall pick. From",
    "timestamp" : "09:25-09:47"
  },
  {
    "timestamp" : "09:49-09:51",
    "speaker" : "Andy",
    "text" : "The thundering herd. That's right. From Marshall."
  },
  {
    "speaker" : "Greg",
    "text" : "That's right.",
    "timestamp" : "09:52-09:52"
  },
  {
    "timestamp" : "09:53-09:58",
    "speaker" : "Andy",
    "text" : "No, he wasn't the quarterback with Randy Moss. That was Chad Pennington. Also from Marshall."
  },
  {
    "text" : "I have some interesting factoids on his martial career too.",
    "speaker" : "Greg",
    "timestamp" : "09:59-10:02"
  },
  {
    "timestamp" : "10:03-10:07",
    "speaker" : "Andy",
    "text" : "Yes. Didn't he have some like was he the one with the broken leg game?"
  },
  {
    "timestamp" : "10:07-10:19",
    "text" : "Yes. Yeah. That game is unreal. You watch like a 15 minute YouTube thing on it. Didn't watch this game, but what fifteen minutes fucking martial highlights.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "10:21-10:21",
    "text" : "Love it."
  },
  {
    "timestamp" : "10:22-10:32",
    "text" : "They were they were playing like Akron who was like one and seven and the only win was against like a non-Division I team. UNH MA. He broke his shin in the first quarter.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "10:32-10:32"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:33-10:58",
    "text" : "It was like still 0-0. They they uh he's like we don't we can't lose this game. It's fucking Akron. So then he they tell him to get x-rays. He has to go to like the hospital. He's like, no, not doing that So hangs out, comes back in in the third quarter and starts playing with a broken leg. And I'm sure some listeners are familiar with it when the offensive linemen are putting him on their shoulders."
  },
  {
    "text" : "Yeah, after every play. He's just like out of a shock at every play. Slinging the ball and then like two of his offensive line would come back, grab him under each shoulder, yeah, and carry him to the next line of scrimmage.",
    "timestamp" : "10:58-11:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "11:07-11:57",
    "speaker" : "Greg",
    "text" : "He literally could not move. No Like could not put any weight on his on his shin. Um is the the re one of the main reasons I think he got drafted so high is one because this was when Mac made the decision to start putting their games on Thursday. You know they always have like shitty Thursday night Mac football games. Mac shit. So this is the first year they were doing that. So there was a 2001 GMAC bowl. Sorry, I didn't know what that stands for. Marshall versus East Carolina. This is a battle of the Jacksonville quarterbacks. It was David Garrard versus Byron Lefwitch. The final score ended up being 64 to 61, Marshall."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "11:58-12:07",
    "text" : "That's what you got drafted first. Yeah. So that's such a typical like action game too. Oh yeah."
  },
  {
    "timestamp" : "12:07-12:16",
    "speaker" : "Greg",
    "text" : "Marshall was down 38 to 8 at half. It ended up at the time it was the highest scoring bowl bowl game in history."
  },
  {
    "timestamp" : "12:16-12:26",
    "speaker" : "Andy",
    "text" : "So they scored all but eight of their 60-something points in the second half. They scored like 50-some odd points in the one half. Holy shit."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, left which went 41 of 70 for 576 yards, four throwing touchdowns, and one rushing touchdown. Damn. But that's not even the most impressive thing. The most impressive thing is that David Girard. His team scored sixty-one points, and he went eleven of twenty-three for a hundred and sixty-one yards. What were they like an option team?",
    "timestamp" : "12:27-12:52"
  },
  {
    "timestamp" : "12:52-12:57",
    "text" : "Two interceptions. How the fuck does that even ask? How do you score 61 points?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "12:57-12:58",
    "speaker" : "Greg",
    "text" : "I don't know."
  },
  {
    "text" : "They have to have been like a run option team, right?",
    "speaker" : "Andy",
    "timestamp" : "12:58-13:00"
  },
  {
    "timestamp" : "13:01-13:09",
    "speaker" : "Greg",
    "text" : "There was like three defensive touchdowns, I think. He ran for like two touchdowns or three touchdowns himself, but god damn. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Fascinating. So yeah, so Byron Leftwich got drafted seventh overall in 2003. Damn, that's high for a Mac quarterback. And Garride had been I thought he was decent. Yeah. Until a point. Yeah, because this this season started off with Brunell, but uh he got benched, I guess, for injury maybe.",
    "timestamp" : "13:10-13:28"
  },
  {
    "timestamp" : "13:28-13:29",
    "text" : "Yeah, I think he got benched.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "13:29-13:50",
    "text" : "And then because they were saying because he By the time he was healthy, they were out of playoff contention. So they said, fuck it, we'll just keep Byron Leftwich in. But I wrote down that he was starting Byron Leftwich was starting over Mark Brunell, and I bet Brunel cried about it. Fucking. No, we don't like Mark Brunel, Steve.",
    "speaker" : "Andy"
  },
  {
    "text" : "We don't?",
    "timestamp" : "13:50-13:51",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:51-13:51",
    "text" : "No."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "13:51-13:53",
    "text" : "He's kind of a bitch."
  },
  {
    "text" : "Remember we don't want to cried on TV because of uh Deflate Gate. Oh, that was him. Yeah. How could you lie to me? Yeah.",
    "speaker" : "Andy",
    "timestamp" : "13:53-14:00"
  },
  {
    "text" : "It's pretty bad. I mean, I have no opinion in this player that of Brunel But that was embarrassing. Like I he could be like a perfectly legit guy and I'll give him the benefit of the doubt, but that was embarrassing that he cried on TV about the flake gate.",
    "timestamp" : "14:01-14:14",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "14:14-14:18",
    "text" : "Yeah, I'm not gonna give him the benefit of the doubt Yeah, it's on your own.",
    "speaker" : "Andy"
  },
  {
    "text" : "You saving the benefit of that doubt for the commentators?",
    "speaker" : "Steve",
    "timestamp" : "14:20-14:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:23-14:31",
    "text" : "No, I'm not saving the benefit of the doubt for anybody. You boys better have your head on a swivel. All right."
  },
  {
    "speaker" : "Greg",
    "text" : "Do you think Byron Leftwich is good?",
    "timestamp" : "14:31-14:34"
  },
  {
    "text" : "Yeah, he does. Okay.",
    "speaker" : "Steve",
    "timestamp" : "14:34-14:35"
  },
  {
    "timestamp" : "14:36-14:47",
    "text" : "Define good. Yeah, it's interesting. Like if you look at his stats, he wasn't good. No. I mean for especially for a first round pick.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "14:48-14:51",
    "speaker" : "Steve",
    "text" : "He also factoring in his coaching as well."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "14:51-14:52",
    "text" : "He's a coach now."
  },
  {
    "speaker" : "Steve",
    "text" : "That's true.",
    "timestamp" : "14:52-14:53"
  },
  {
    "timestamp" : "14:53-14:58",
    "text" : "He started 50 games. He started 50 games. He had like a decent record.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "That's also crazy given he was on Jacksonville.",
    "timestamp" : "14:58-15:00"
  },
  {
    "timestamp" : "15:00-15:02",
    "speaker" : "Andy",
    "text" : "Yeah, it's two games under 500."
  },
  {
    "speaker" : "Steve",
    "text" : "Competing against Tom Brady. Yeah. And Tom Brady's already got a Super Bowl ring and is about to get one more this year. And then now he's the coach coaching Tom Brady who just got up another.",
    "timestamp" : "15:02-15:13"
  },
  {
    "speaker" : "Andy",
    "text" : "Tom Brady's still, yeah. Yeah. Yeah, he's now Tom Brady's offensive coordinator, which is ridiculous.",
    "timestamp" : "15:14-15:18"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "15:19-15:24",
    "text" : "Six foot five, two hundred and fifty pounds is a fucking easy quarterback."
  },
  {
    "text" : "Yeah. Um yeah. So do you have anything else on the Jags you want to? Because I had one thing that you haven't.",
    "timestamp" : "15:24-15:30",
    "speaker" : "Andy"
  },
  {
    "text" : "I have a couple like uh some things that might fit better into the uh the quiz, the trivia section. So we'll get to that later. Yeah. Um Jimmy Smith, that's the only other name I had highlighted. He had a pretty ridiculous career too.",
    "speaker" : "Greg",
    "timestamp" : "15:31-15:48"
  },
  {
    "timestamp" : "15:48-15:54",
    "speaker" : "Andy",
    "text" : "Yeah, he did. Yeah, he was kind of like their first real all-star, it felt like Jimmy Smith."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. So it's Fred Taylor, Jimmy Smith, Mark Burnell, Keenan McCardell. Kina McCardell's right. Yeah, they're kind of like household names. Yeah.",
    "timestamp" : "15:54-16:02"
  },
  {
    "text" : "Tony Brackens, Tony Baselli.",
    "speaker" : "Steve",
    "timestamp" : "16:02-16:04"
  },
  {
    "text" : "Baseli. Yeah, if we have a Biselli. Some great names, yeah. Yeah. So these are vintage like early 2000s NFL names on this team. Oh definitely, yeah.",
    "timestamp" : "16:04-16:15",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, this is the the Jaguars I remember. What do you say, Steve? What you got on the Jags? So there's just one thing was um A lot has been made of the Miami Miracle, the lateral touchdown pass that the um Dolphins won their game against the Patriots a few years ago. The last time a last play lateral touchdown uh Or a lateral was a touchdown on the last play of the game was uh how the Jags would win their game after this one. Except it happened in ridiculous fashion against them. So what happened was it was it was the same idea. They were playing the Saints. Jesus, hang on a second.",
    "timestamp" : "16:15-17:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Jesus. Speaking of fucking weepy sports commentators.",
    "timestamp" : "17:08-17:14"
  },
  {
    "timestamp" : "17:15-17:53",
    "speaker" : "Andy",
    "text" : "Oh, I can't get emotional. But yeah, so the Jags were playing the Saints and the Saints were down by seven at the uh With like one one last play left, you know. And so they tried the lateral thing and it ended up working and they scored a touchdown. But then um I can't remember who their kicker was. Who was the old dude? Carney. One of the Andersons, Gary or Morton. Carney. Oh, yeah, yeah, you're right. John Carney. John Carney. Missed the extra point. And the Jags won 19 to 20. That is one of the craziest things ever."
  },
  {
    "timestamp" : "17:53-17:55",
    "text" : "I've seen a highlight before. Now you bring it up.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "And I think, yeah, I'll I'll link it too. I found the highlight. It's amazing. It's unbelievable how that happened. Oh yeah. Because like and the the play was it wasn't nearly as clean as the Miami American was either.",
    "timestamp" : "17:56-18:09"
  },
  {
    "text" : "Like it was oh yeah it was shout out Dante Stalworth on that play.",
    "timestamp" : "18:09-18:12",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "18:13-18:23",
    "speaker" : "Andy",
    "text" : "Yeah it was iffy former but or yeah former patriot future patriot I guess future patriot uh for us but uh Uh we'll we'll put that link in there as well."
  },
  {
    "text" : "As well as the um Yeah, if you haven't seen that play, if you don't know what we're talking about, that is an absolute must watch. Yeah. Because it's like the the For it's like the Miami Miracle, but then they mi this is the old PAT too. This is from the two-yard line. Chip show. It's a Miami Miracle followed by The mo an equally as unlikely play. Yeah.",
    "timestamp" : "18:23-18:46",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes. Of like Adam Vinateri pushing uh an extra point right, basically. Yeah.",
    "timestamp" : "18:46-18:50"
  },
  {
    "text" : "I I'm I'm looking up the numbers right now on 2003 uh PAT percentages. There's 15 teams, so half the league didn't miss one the entire season. Hundred percent. The lowest percentage is ninety two point six eight percent and 30 out of the 32 teams were 95% or more.",
    "timestamp" : "18:51-19:14",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "19:15-19:16",
    "text" : "So it's almost a guarantee.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "19:16-19:22",
    "speaker" : "Greg",
    "text" : "Yeah. You're talking about like missing One to two a year per team."
  },
  {
    "speaker" : "Andy",
    "text" : "And that was the one. And that's the one they next. And I don't know if it had uh playoff implications for the Saints or not? I think it I think it kind of did because they they were seven and seven going into the game. So they would have put them in eight and seven like in the hunt. With one game left, but that fucked their playoff chances.",
    "timestamp" : "19:22-19:44"
  },
  {
    "speaker" : "Steve",
    "text" : "River City Relay.",
    "timestamp" : "19:45-19:47"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:47-19:48",
    "text" : "Yes, that's what what do they call it?"
  },
  {
    "timestamp" : "19:49-19:50",
    "speaker" : "Steve",
    "text" : "River City Relay."
  },
  {
    "text" : "River City Relay, that's right, yes.",
    "speaker" : "Andy",
    "timestamp" : "19:50-19:51"
  },
  {
    "timestamp" : "19:51-19:52",
    "speaker" : "Steve",
    "text" : "Wikipedia."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:52-19:55",
    "text" : "I knew there was some silly name for it, but"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "19:56-20:16",
    "text" : "There's there's one like uh video out there with the commentator that's like, how could you do that? How could you miss that? I think that's all I found. That guy rules. Definitely the Saints like radio broadcasting. Yeah, for sure. Hate kickers. Yeah."
  },
  {
    "text" : "All right, well, speaking of uh football though, this game Was a defensive battle again, would you say? Not so much as last week with the Dolphins. Yeah. Because there was 12 total points scored in that. And six of them were a Teddy Bruski pick six, which I don't know if we mentioned last week, but his last four interceptions he's returned for touchdowns so far. Yeah. Two this season and two the season before.",
    "speaker" : "Andy",
    "timestamp" : "20:21-20:48"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, it's crazy. And then he doesn't have another one has the rest of his career, I believe. I think you're right. Yeah.",
    "timestamp" : "20:48-20:53"
  },
  {
    "timestamp" : "20:55-21:05",
    "text" : "Yeah. That's why they call him T D Brushki, right? That's a good one. Did he make a joke like that last time? Didn't Steve make that joke last week or something similar?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "21:05-21:08",
    "speaker" : "Steve",
    "text" : "That sounds like that sounds something I would say."
  },
  {
    "timestamp" : "21:11-21:21",
    "speaker" : "Greg",
    "text" : "Teddy one wi or teddy one D Brewski. I don't know. I didn't pull that off the top of my head. That's from like Steve or something. Yeah, no, it was something."
  },
  {
    "text" : "I think it was TD Brewski. Yeah What do you call someone who's afraid of Santa Claus?",
    "speaker" : "Steve",
    "timestamp" : "21:21-21:26"
  },
  {
    "text" : "Oh, here we go.",
    "timestamp" : "21:27-21:28",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "That came with myself in the middle of the night.",
    "timestamp" : "21:32-21:35"
  },
  {
    "speaker" : "Andy",
    "text" : "While the dog was keeping you up. It's working.",
    "timestamp" : "21:36-21:40"
  },
  {
    "timestamp" : "21:41-21:45",
    "speaker" : "Greg",
    "text" : "Um what's the difference between uh a car and a golf ball?"
  },
  {
    "timestamp" : "21:45-21:47",
    "speaker" : "Steve",
    "text" : "No, it case guy. What?"
  },
  {
    "timestamp" : "21:48-21:50",
    "speaker" : "Greg",
    "text" : "Tiger Woods can drive a golf ball 400 yards."
  },
  {
    "timestamp" : "21:50-22:22",
    "text" : "Oh shit. Oh man. He's fine. He's fine. Oh, if it wasn't we'd probably have to cut that, but there we go. Poor tiger. Not bad. I don't know. I I have a hot take about Tiger. About I don't I don't know. Like I don't everybody seems to have just like accepted all the shitty days. Like, oh no, he's fine now. We're back to loving Tiger.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm I'm not on that. That big one. Did you see the documentary, the HBO? No, I don't think so. It's pretty good. It's worth watching. Like I'm not gonna say it's He's not to blame, but he's his childhood was all fucked up. Like I I'm not surprised at all.",
    "timestamp" : "22:23-22:37"
  },
  {
    "text" : "Um that same guy who wrote the dynasty book did one on Tiger Woods. Oh that's right, he did, didn't he? Yeah.",
    "timestamp" : "22:38-22:43",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I have actually a hot takes hot take Patriots take on this.",
    "timestamp" : "22:44-22:48"
  },
  {
    "timestamp" : "22:48-22:49",
    "speaker" : "Andy",
    "text" : "Ooh, okay."
  },
  {
    "text" : "You know how like Tiger is like Nationally like beloved, right? Everyone loves Tiger, no matter what. They're all rooting for him. The Tiger fanboys. I'm saying that if if If Tom Brady didn't play like a regional sport like football, he would be in that same category of being beloved by sports fans, if not m higher.",
    "speaker" : "Greg",
    "timestamp" : "22:49-23:13"
  },
  {
    "text" : "I agree.",
    "timestamp" : "23:13-23:14",
    "speaker" : "Andy"
  },
  {
    "text" : "Because the reason they hate him is because he beats their team every yeah. And it's just like that's how sports go when you play these regional sports. But if it's like Tigers just an American playing these tournaments. Yeah. Every American get behind him, right? So I think if Tom Brady played a a sport like golf, if football is an international sport. Everybody would love him. Every single person on planet Earth would love him.",
    "timestamp" : "23:14-23:35",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:36-23:58",
    "text" : "It's kind of like uh when we talked about when they had whatever that baseball tournament was, like the the national baseball thing. Yeah. And Derek Jeter was on the USA team and we all got to root for him. Finally we got to root for him. Yeah. It felt kind of nice because it's fucking Derek Jeter. I know. You always respected his ass, but you couldn't root for him because he's a Yankee. So yeah, I think you're right. I think it'd be pretty small."
  },
  {
    "text" : "This game is pretty god.",
    "speaker" : "Steve",
    "timestamp" : "23:59-24:00"
  },
  {
    "text" : "This is what you do when you when you have a 27-13 week 14 game.",
    "timestamp" : "24:04-24:08",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:09-24:26",
    "text" : "It was a bit of a slog, but I think s this is the first game this season I have no memory of. Give it a watchability score, Andy. Uh I'd give it a I'm just looking back. I give it a three just because Troy Brown's back."
  },
  {
    "text" : "Yeah, I think it was it was somewhat entertaining.",
    "speaker" : "Steve",
    "timestamp" : "24:27-24:31"
  },
  {
    "speaker" : "Andy",
    "text" : "It was good defense.",
    "timestamp" : "24:31-24:32"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "24:32-24:32",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "24:33-24:34",
    "text" : "Wasn't as good as last year.",
    "speaker" : "Andy"
  },
  {
    "text" : "Like the quarterback Jags. Jags played pretty well too for for a bit of it and then selling, which is also cool. Yep. Um yeah, and the Patriots defense was again nasty.",
    "timestamp" : "24:34-24:45",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "24:46-24:54",
    "speaker" : "Greg",
    "text" : "Yeah, that field was a shit show though. Yes. Would have been better if it was Brunel. Just probably would have yeah. Yeah. Nostalgia's sake."
  },
  {
    "text" : "I just like the Byron Leftwich versus Tom Brady. That struck a chord to me because they're one's coaching the other one. Yeah, I suppose that's true too. Yeah. Good point.",
    "timestamp" : "24:54-25:03",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "25:05-25:11",
    "text" : "So he's younger than Brady. And he's coaching Brady? Yeah. That's interesting."
  },
  {
    "text" : "Tom Brady's older than like I think it's like a quarter or a third of the league coaches younger than And you I mean let's be honest, what is Byron Leftwitch teaching Tom Brady? Yeah. It's the other way around at this point, right? Yeah, yeah. Somebody's like, I hear what you're saying, but if we try it my way. Exactly. I I've seen you play this, so I think I'm gonna do it my way and uh you can learn from me.",
    "speaker" : "Andy",
    "timestamp" : "25:11-25:39"
  },
  {
    "speaker" : "Greg",
    "text" : "That's interesting. I wonder what that dynamic is like. I bet I mean it takes a certain type of person to be the coach too. And like You know, to be able to like see some of that like innate power that you have in that role to be like, okay, this is no longer like I'm your boss and you're my player. Like this is like a mutual, like let's work together and figure things out, you know? Yeah.",
    "timestamp" : "25:40-26:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:03-26:06",
    "text" : "How can I make the offense work better for what you need to do?"
  },
  {
    "text" : "Yeah. Tell me what I need to do as the coach. I'm almost like working for you. I bet that's what it's like. Yeah, I think so too.",
    "timestamp" : "26:06-26:12",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "And yet they still call fucking runs up the middle every first down.",
    "timestamp" : "26:13-26:16"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:16-26:20",
    "text" : "So maybe not. Hey, won the Super Bowl."
  },
  {
    "timestamp" : "26:21-26:22",
    "speaker" : "Andy",
    "text" : "It felt like in spite of the five years."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "26:22-26:37",
    "text" : "Byron played nine years. I just looked it up. Had a nine-year NFL career. A lot longer than most. And then Retired, did whatever the fuck he did, worked his way all the way up to the coaching ranks to get to OC and then coach Brady. Yeah."
  },
  {
    "text" : "Yeah, he retired in 2012. So nine years ago.",
    "timestamp" : "26:37-26:42",
    "speaker" : "Andy"
  },
  {
    "text" : "I remember liking him. Like that was my memory of he's one of those guys that was like he You know, I put up flashy numbers, but he was like a scrappy, like he's not an easy out, you know? Yeah, yeah, yeah. You're gonna have to play when you come and play.",
    "speaker" : "Greg",
    "timestamp" : "26:44-26:57"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:57-27:04",
    "text" : "Yeah, bit almost like uh Ben Rothesburger-esque, I thought. Big dude who had a cannon for an arm and"
  },
  {
    "speaker" : "Steve",
    "text" : "Always played smart enough.",
    "timestamp" : "27:05-27:06"
  },
  {
    "text" : "Who?",
    "timestamp" : "27:11-27:11",
    "speaker" : "Andy"
  },
  {
    "text" : "Fred Taylor.",
    "speaker" : "Steve",
    "timestamp" : "27:11-27:12"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:12-27:14",
    "text" : "Oh yeah. For like a minute."
  },
  {
    "text" : "Yeah. Didn't he get hurt really early?",
    "timestamp" : "27:14-27:17",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh something like that. I remember playing with him in Madden and he was like an absolute monster because he didn't realize that people age, especially running backs. Won a lot of s Madden Super Bowls with uh Fred Taylor as a Patriot. Whatever year that was.",
    "timestamp" : "27:17-27:33",
    "speaker" : "Andy"
  },
  {
    "text" : "He played for the Patriots for two years.",
    "timestamp" : "27:34-27:36",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh. Probably not many games though.",
    "speaker" : "Andy",
    "timestamp" : "27:37-27:39"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "27:39-27:44",
    "text" : "Nine and ten. Wow, okay. 13 games total, one start."
  },
  {
    "text" : "Yeah, so he didn't start much.",
    "speaker" : "Andy",
    "timestamp" : "27:44-27:46"
  },
  {
    "timestamp" : "27:46-27:49",
    "speaker" : "Steve",
    "text" : "We'll get to see four Fred Taylor touchdowns though."
  },
  {
    "speaker" : "Andy",
    "text" : "Damn right we will. Speaking of touchdowns though, uh most of these were Tom Brady touchdown passes. Well, both of the touchdowns, I should say.",
    "timestamp" : "27:49-28:01"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:02-28:04",
    "text" : "I mean there could have been a lot more touchdowns too."
  },
  {
    "timestamp" : "28:07-28:20",
    "text" : "Yeah, there was a lot of missed opportunities on both sides. Fred Taylor, especially, dropped A wide open screen pass from the five yard line that bonked off his face mask because it went through his hands.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "It was the perfect call against the perfect defense. You know, just like they brought the house, they threw the quick little slip screen. Red tails wide open, perfect ball right in his face, and just eats it.",
    "timestamp" : "28:20-28:31"
  },
  {
    "timestamp" : "28:31-28:37",
    "text" : "Yeah. And then Larry Center is the other usual um Sure handed. What do we decide he was a fullback?",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I don't like Larry Sanders. They kind of must have center.",
    "speaker" : "Steve",
    "timestamp" : "28:38-28:42"
  },
  {
    "timestamp" : "28:43-29:32",
    "speaker" : "Andy",
    "text" : "Good one. Yeah. Uh yeah, no, there uh I think the the highlight of the game for me was Troy Baron being back. Returning punts. Didn't quite look the same, but still like getting the job done. And like his first catch, I think, was um converting a third and 20. And he got 23 yards on it. And it just like hopped up like he was he'd been there. It's like, yeah, that's cool. Fucking typical. But and and he had a touchdown catch, and that was a great touchdown catch too. Yep. Bro, you're looking at him the entire way. Beautiful. Um what else? Yeah, I mean what do you what would you guys give as a watchability score? Greg?"
  },
  {
    "timestamp" : "29:33-29:49",
    "text" : "I didn't watch it. Nothing jumped out at me from the highlights or any of that that made it particularly enticing besides just like the names of this team.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "29:50-29:55",
    "speaker" : "Steve",
    "text" : "Yeah, I will I I know I talked about earlier, but I'll still give it a half. I'll still give it two, Lombardi."
  },
  {
    "text" : "Yeah. I like defense, so I'll give it a three. This this defense is absolutely outstanding. This is I think when you talk about old school Patriots football and like the defense first, offense just not making mistakes, this is like this stretch is almost what I think of. It is a 2003 stretch. Like the they kept showing different stats about the defense. Um, let's see. In the first quarter when the uh The Jaguars finally got in the red zone. They showed a stat that said New England defense at home. First time the opponent has penetrated New England 10-yard line in the last 47 drives. Which is fucking batshit.",
    "timestamp" : "29:55-30:36",
    "speaker" : "Andy"
  },
  {
    "text" : "How many games is that? Must have been, I bet I know the last time.",
    "timestamp" : "30:37-30:41",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "30:42-30:53",
    "speaker" : "Andy",
    "text" : "What? Uh I wasn't at home. Oh, at home. At home, yeah. So probably towards the beginning of the season. Maybe week one. They lost anyone else."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "30:53-30:55",
    "text" : "Yeah, maybe. That's a lot of drives. Right."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:56-31:13",
    "text" : "Um uh another one, they haven't allowed a touchdown at home in the last five games, which was 260 minutes of game time, 53 drives, 292 total plays. Well that got broken at the end. Right at the end in garbage time, yes it did."
  },
  {
    "speaker" : "Steve",
    "text" : "Which was really frustrating because it was like a garbage time, absolute prayer of a throw into the snowstorm lights. So even on the camera, you couldn't see it. No. No idea. Sante Samuel had no idea. Whoever caught it had no idea either. And it just kind of dropped right in his left.",
    "timestamp" : "31:13-31:29"
  },
  {
    "text" : "Some no name like Robert Johnson or someone like that. Kevin Johnson. He's not a known. Put some respect on his name. Like a no name. I don't recognize him he's a no-name, Kevin Jones. He was a Browns guy, right? Dude, Kevin Johnson is like a fucking He had a thousand yard season. That's that's the name that Madden like creates when you're doing a draft. He's like, oh, we gotta we gotta create some some real names. It's Kevin Johnson.",
    "timestamp" : "31:29-31:54",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, Andy Brown. Andrew Brown. He had a thousand yard season. Uh-huh. Not good. No. Not good enough.",
    "timestamp" : "31:55-32:03",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "32:03-32:10",
    "text" : "The total streak was 63 drives. I didn't write down the minutes or whatever, but it was some it was 63 drives out allowing a touchdown at home.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That's that's amazing. Yeah. And then there's another like halfway through the fourth quarter, they showed that uh the Jaguars averaged 123 yards rushing per game And today they had forty six. And that had been their huge like uh cause they they've been on a bit of a streak lately. Um and the most rushing yards in the last five weeks of the season, Fred Taylor was second, just behind Clinton Portis. Clinton Porters had six hundred and fifty nine yards in the last five weeks. Because was it last week? Yeah he had that five touchdown game. Yeah, he had like two hundred and something rushing yards and five touchdowns. Fred Taylor, six hundred and seventeen yards. He's only like 40-something yards behind him. Fred Taylor was good. Yeah. And he was he was hot right this point of the season too.",
    "timestamp" : "32:11-33:03"
  },
  {
    "timestamp" : "33:03-33:04",
    "speaker" : "Greg",
    "text" : "Yeah, so hot right now."
  },
  {
    "text" : "So hot right now.",
    "speaker" : "Andy",
    "timestamp" : "33:05-33:05"
  },
  {
    "text" : "Oh Fred Taylor, so hot right now.",
    "timestamp" : "33:06-33:08",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh Bayern Leftwoods were also hot too because uh I'm gonna throw in self-part right now. Uh we're gonna do uh verbal meme, isn't that what they do on some other podcasts? You know, the um part of my dick? Where we started. Sure. Where we started uh where we are now sort of thing. It's all over Twitter. So the where we started was in the first quarter they showed the stat Byron left which zero interceptions and last ninety-nine pass attempts and it went over a hundred. as they were talking about it. And then later in the fourth quarter they showed a stat. Byron left which two interceptions and last eight pass attempts.",
    "timestamp" : "33:09-33:45"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "33:45-33:47",
    "text" : "So both the time pool."
  },
  {
    "text" : "So that verbal meme. Yeah.",
    "timestamp" : "33:48-33:52",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "33:53-34:07",
    "speaker" : "Andy",
    "text" : "The pointing. Yeah, pointing. Yeah, the hand thing. Yeah. Except instead of Drake, it's actually uh Byron Leftwitch's mugshot from this. He's a super babyface looking guy here. Smug shot?"
  },
  {
    "speaker" : "Greg",
    "text" : "Like a rest smug shot or just a shot?",
    "timestamp" : "34:08-34:09"
  },
  {
    "text" : "His uh his his uh picture. With the stats Yeah, his his picture here. He does not look like a happy dude. That last puppy. That's what he looks like. Oh me.",
    "timestamp" : "34:10-34:26",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:26-34:35",
    "speaker" : "Steve",
    "text" : "That last pole interception, Andy, the where he was doing the uh Don BB thing. It was very close to that."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it was. He uh The Leon. Yeah, the Leon Light. You started celebrating Five yards too early and got run down from behind.",
    "timestamp" : "34:35-34:43"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "34:43-34:53",
    "text" : "Or Deshaun Jackson, if you will. Or that guy from the Seahawks. What's his name? Which one? Seahawks one? Yeah, that was like this past year he did that too."
  },
  {
    "timestamp" : "34:54-34:56",
    "text" : "Oh yeah, yeah, yeah. Oh fuck.",
    "speaker" : "Andy"
  },
  {
    "text" : "Um the big guy. Yeah. TK, yeah, he did that.",
    "speaker" : "Greg",
    "timestamp" : "34:56-35:00"
  },
  {
    "text" : "I missed that.",
    "timestamp" : "35:01-35:02",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. My buddy had him in fantasy and he threw a little hissy fit. Shut up, Mark. Hissy fit's not uncommon.",
    "timestamp" : "35:02-35:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:12-35:24",
    "text" : "Oh boy. Yeah, but that was Poole's second interception of the game, too. Yeah. Um and it actually worked out better because the Patriots got first and goal from the two-yard line."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "35:24-35:24"
  },
  {
    "speaker" : "Andy",
    "text" : "And we're able to just run Antoine Smith up the middle three times and finally score a touchdown in the third.",
    "timestamp" : "35:25-35:29"
  },
  {
    "timestamp" : "35:29-35:50",
    "speaker" : "Greg",
    "text" : "Well and the key to to to celebrating those prematurely is do the ball in front raise high step thing. Don't do the ball down to the side behind like running through like sprinter running through the final thing. No, that's make sure your your swag is up in front of you. That way if you get caught, you're not gonna fumble at least. You're just gonna get tackled."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:50-35:55",
    "text" : "Well that was the swag corner with Greg Bradley. That's all yeah. That's all the pro swag projects."
  },
  {
    "text" : "But Deion Sanders, he used to do the swag out front, you know. That's true, yeah. Ty Law?",
    "speaker" : "Greg",
    "timestamp" : "35:59-36:03"
  },
  {
    "timestamp" : "36:04-36:05",
    "speaker" : "Andy",
    "text" : "Swag out front?"
  },
  {
    "timestamp" : "36:05-36:09",
    "speaker" : "Greg",
    "text" : "He only swagged when he got in there. Yeah. I suppose that's true."
  },
  {
    "speaker" : "Andy",
    "text" : "I was swagging the the floor. Yeah. Swagging all over that floor. Oh my god. Uh but did you guys know it snowed in this game?",
    "timestamp" : "36:09-36:21"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "36:21-36:22",
    "text" : "Saw that."
  },
  {
    "text" : "Because speaking speaking of segments, uh, this is the time for me to shit on the commentators. I don't think they'd ever seen snow before, so maybe we'll we'll chalk it up to that. But they would not stop talking about how cold it was. And they like especially towards the end of the game, they just got obsessed about it. As soon as it started snowing, you could see the snow on the field. Like, look, there's this guy on the sideline wearing shorts. And then they cut to um a clip of Bill Belichick pregame in shorts. And they're like, the weather was 21 degrees. And but we've got we've got heaters and and they had like in the little studio there was like the TV behind them that they would show stats on it had like fire in it, like oh we're standing next to this, but it's not warming us up.",
    "timestamp" : "36:22-37:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "The Natalie clad Bill Belichick. That's what uh they did on prime time. I love Berman. I just love Berman so much. Just little things like that. Yeah. The Natalie clad Bill Bellish.",
    "timestamp" : "37:05-37:17"
  },
  {
    "text" : "It's perfect. Yeah. The alliteration is so on point. Just rolls off the tongue. And it paints a picture too.",
    "speaker" : "Andy",
    "timestamp" : "37:18-37:24"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:24-37:32",
    "text" : "One complaint and I think that I'm building a case against Phil here. Oh, okay. Not a case for me, but case for Armin Kateyan."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:33-37:33",
    "text" : "Oh yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:34-37:58",
    "text" : "In some sort of workplace sexual harassment thing. Oh. Because he was talking about his feet in one Monday night game or something like that. It was it was a very awkward foot thing. There was yeah, there was something, wasn't it? Was it foot or hand thing maybe? Yeah. I don't even want to relive that and look that up, but it's up there somewhere. I'll find it. On this one, they're like Oh Armin, you look good with a little snow on you. You little snowman."
  },
  {
    "text" : "But then and then like at one point around that same time, they're like Huh, they cut to him and he didn't have much snow. I'm like, oh, he's got uh uh uh like a surprisingly little amount of snow on him. What are you like hiding him under something guys?",
    "speaker" : "Andy",
    "timestamp" : "38:01-38:15"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah, Armin, you getting wet?",
    "timestamp" : "38:15-38:17"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "38:17-38:18"
  },
  {
    "speaker" : "Greg",
    "text" : "Naughty little bitch.",
    "timestamp" : "38:19-38:21"
  },
  {
    "timestamp" : "38:21-38:32",
    "text" : "And then they from there they cut to Bill Belichick who's just like in his hoodie and the whole front of him just covered in snow, just standing there like a miserable. Mm-hmm. Like he you know, he knows he can wear more clothing, right?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "He's still gonna look miserable. Exactly. You can put whatever the fuck you want on Bill Belichick, he's still gonna look miserable.",
    "timestamp" : "38:35-38:40"
  },
  {
    "timestamp" : "38:41-39:08",
    "speaker" : "Andy",
    "text" : "Well, isn't the story that like he wanted to wear a suit on the sidelines? To because that's how like old school coaches used to do it. They used to like wear like a full suit. So you want to do that and the NFL for whatever because I think for licensing reasons because Reebok doesn't make a fucking suit. Like, no, you have to wear Reebok shit. He's like, okay, fine. I'll wear this. I'm not gonna give a shit. I'll cut the fucking sleeves off. And it's like supposed to be like thumbing his nose at the NFL or something."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "39:08-39:13",
    "text" : "I did not know that. See, I just got the impression that he just did not give a shit in one way or the other."
  },
  {
    "text" : "I mean, you've seen him like dressed like in public. And he's not wearing a suit and tie there. So I think he's a little bit more than a little bit of a shortcut.",
    "timestamp" : "39:13-39:20",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "39:21-39:24",
    "text" : "He's just like the definition of disheveled.",
    "speaker" : "Greg"
  },
  {
    "text" : "He dresses like our father does. Yeah, like a dead if Mick Brown could wear that fucking button-up turtle shirt or whatever frogs or whatever the fuck it was all over.",
    "speaker" : "Andy",
    "timestamp" : "39:24-39:35"
  },
  {
    "text" : "Yeah, that frog shirt rules.",
    "speaker" : "Greg",
    "timestamp" : "39:35-39:37"
  },
  {
    "text" : "Yeah, the the the America flag shirt also rules. Yeah.",
    "timestamp" : "39:37-39:42",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "39:43-40:02",
    "speaker" : "Greg",
    "text" : "And the fact is so big that he can't wear a ball cap, but he does anyway. The Jerry Garcia sweatshirt that he wears in like June and July. Yeah, oh just constantly. The Christmas one. Yeah. Christmas Jerry Garcia. Just the mullet. Oh my god."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:03-40:05",
    "text" : "Yeah, that was that was bad."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "40:05-40:06"
  },
  {
    "timestamp" : "40:06-40:21",
    "speaker" : "Andy",
    "text" : "All right. So the missing front tooth era was an error. And Mick Brown kind of has that Belichick scowl, I think. It's around the mouth. They look very similar. They look very similar. Yeah, they do. So we gotta get that that's OG hipster, right?"
  },
  {
    "timestamp" : "40:21-40:35",
    "speaker" : "Greg",
    "text" : "Like hipster like claim that they don't like care what they look like. No, you do care. You just care in a different way. Yes. Brown, Bill Belichick, they're real hipsters. Literally do not care. Truly do not give a shit what they'll look like."
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know. I like the spite angle better. I feel like Him spiding Roger Cadillac.",
    "timestamp" : "40:36-40:41"
  },
  {
    "timestamp" : "40:41-40:43",
    "speaker" : "Greg",
    "text" : "That feels good, doesn't it? Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. So who knows?",
    "timestamp" : "40:43-40:45"
  },
  {
    "text" : "Once we get him on the pod, we'll ask him.",
    "timestamp" : "40:45-40:47",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "40:47-41:03",
    "text" : "Oh yeah. Oh, we've got a whole bunch of hard-hitting questions to ask Bill Belichick. Oh, speaking of uh who's back, we all know Troy Brown's back, but uh also huge news. Ken Walter, my boy's back.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Ken Walter, back to the book. Ken Walter.",
    "timestamp" : "41:03-41:04"
  },
  {
    "timestamp" : "41:05-41:09",
    "speaker" : "Andy",
    "text" : "Back. And punting, not punting like booty, I wrote down."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, for some reason him getting cut and then re-signed again turned him into a decent punter.",
    "timestamp" : "41:09-41:14"
  },
  {
    "timestamp" : "41:14-41:24",
    "text" : "Yeah, average 40 yards a punt on four punts. Did you hear how the crowd cheered him? They gave him a stay to go on the first pun, yeah. Cause it went more than thirty yards.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "41:25-41:27",
    "text" : "That's being a good fan there.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yep. Yeah. And then knowing what's going on. And then one of the punts he uh he pinned at the four yard line. Who is this guy? Because I don't think it's Ken Walter. And then he he had uh his next punt was the typical really bad punt that died halfway but then dribbled another like 30 yards.",
    "timestamp" : "41:26-41:46",
    "speaker" : "Andy"
  },
  {
    "text" : "Yes.",
    "timestamp" : "41:46-41:46",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "We dribbled that one inside the 20. So that still counts in the stats, boys. That's classic Walter though. So he's back. And Vinateri looked a lot less shaky on his field goals because Ken Walter's holding again. So that was nice to see.",
    "timestamp" : "41:46-42:00"
  },
  {
    "text" : "He reminds me of like what Flanders would look like in real life. I maybe I don't know his personality at all, but I don't know. Like just the name being bland. Yeah. Him being just like generic looking dude.",
    "timestamp" : "42:00-42:12",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "42:12-42:16",
    "speaker" : "Andy",
    "text" : "Ken Walters is also another Madden uh recreated name, isn't he?"
  },
  {
    "timestamp" : "42:16-42:27",
    "text" : "Yeah. Yeah it is. And a guy that you like kind of remember, but I don't know. Ye Was he good? Who knows? It's just a dude that was on the roster.",
    "speaker" : "Greg"
  },
  {
    "text" : "I I just tried to Google Ken Walters to see if we could find him to like. Reach out to him on Twitter or something. Uh he's not on the front page of uh Google. There's other Ken Walters. That's 200 plus Ken Walters profiles on LinkedIn. It's Walter, Andy, that's why. Is it? Yeah.",
    "timestamp" : "42:27-42:44",
    "speaker" : "Andy"
  },
  {
    "text" : "Idiot. Because I just Google search for him and I got millions of pictures. First hit, Ken Walter, Wikipedia.",
    "speaker" : "Greg",
    "timestamp" : "42:44-42:52"
  },
  {
    "timestamp" : "42:52-42:55",
    "speaker" : "Andy",
    "text" : "You play for the Panthers. Oh, good thing we have you to stat check, Greg."
  },
  {
    "text" : "I know. Someone's gonna keep us on us around, yeah. Look at this people also searched for Mark Edwards, J. R. Redmond, Bethel Johnson And Rashe Caldwell.",
    "timestamp" : "42:56-43:08",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:09-43:11",
    "text" : "Whoa, that's rarefied air right there."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "43:12-43:13",
    "text" : "It's called classification there."
  },
  {
    "speaker" : "Steve",
    "text" : "Martin Edwards is in this game, right?",
    "timestamp" : "43:13-43:15"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he's on. Yeah. So is Chris Fuamatu Mafala.",
    "timestamp" : "43:15-43:19"
  },
  {
    "timestamp" : "43:19-43:21",
    "speaker" : "Steve",
    "text" : "Wait. Fumato is in this game?"
  },
  {
    "timestamp" : "43:21-43:25",
    "text" : "Yeah, in this game? The one bad Mafala. Yeah, he's in Jacksonville.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I saw that uh Edwards was in this game. Wait, no, it's Troy Edwards. No, Mark Edwards. No, it's Mark. Yeah. Oh, it is more the fullback who was like the Patriots' top weapon like two years ago.",
    "timestamp" : "43:25-43:37",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:38-43:41",
    "speaker" : "Steve",
    "text" : "Four catches 41 yards, one of thirteen. I know."
  },
  {
    "text" : "Who knew? Mark Edwards. He's a super like MAGA guy now though. It's a shame. Who cares?",
    "timestamp" : "43:41-43:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I uh there's a lot of people that are Either f former Patriots or future Patriots, right? Yeah. Fred Taylor. Yep. Mark Edwards. Kyle Brady. Yeah.",
    "timestamp" : "43:50-44:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. There is at least one Brady to Brady touchdown. I believe it's an 07 against the I guess it's only other one I can think. Yeah.",
    "timestamp" : "44:04-44:15"
  },
  {
    "timestamp" : "44:17-44:20",
    "speaker" : "Greg",
    "text" : "Jimmy Smith feels like he could be a Patriot. Yeah, yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Jack Del Rio, he was a linebacker for eleven years. Where did he play?",
    "timestamp" : "44:20-44:24"
  },
  {
    "text" : "Ohio State.",
    "speaker" : "Greg",
    "timestamp" : "44:25-44:26"
  },
  {
    "timestamp" : "44:29-44:30",
    "speaker" : "Andy",
    "text" : "What?"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't know. Look it up. I bet he's the Ohio State guy.",
    "timestamp" : "44:30-44:35"
  },
  {
    "speaker" : "Andy",
    "text" : "Jack Del Rio? USC",
    "timestamp" : "44:35-44:37"
  },
  {
    "text" : "Trader. JDR.",
    "timestamp" : "44:39-44:42",
    "speaker" : "Greg"
  },
  {
    "text" : "What what is this? Come on, show me him as a player. Jack Del Rio. Yeah, I went to USC.",
    "timestamp" : "44:46-44:54",
    "speaker" : "Andy"
  },
  {
    "text" : "Do you see his little turtleneck setup in this game? Yeah. I don't know how how many years.",
    "timestamp" : "44:54-44:58",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:59-45:07",
    "text" : "Yeah, the and the commenters like, oh look, he's He's braving the w the winter weather. I'm like, not in a turtleneck. You're not braving anything in a turtleneck.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:07-45:09",
    "speaker" : "Greg",
    "text" : "Ooh, it's got some turtleneck hate going on right now."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Why? You got a turtleneck you want to put on? No, but you Steve Jobs?",
    "timestamp" : "45:10-45:14"
  },
  {
    "timestamp" : "45:14-45:19",
    "speaker" : "Steve",
    "text" : "Yeah, some sort of obscure Patriots player that we didn't even know you had a jersey. He had turned into a turtleneck."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "45:21-45:23",
    "text" : "I'm Elizabeth Holmes, bro."
  },
  {
    "speaker" : "Andy",
    "text" : "That's a deep cut.",
    "timestamp" : "45:25-45:26"
  },
  {
    "timestamp" : "45:26-45:40",
    "speaker" : "Greg",
    "text" : "Deep cut. But applicable here. Yeah. Yeah. She was turtleneck lady. That would turn out to be a fraud and a phony. That's me. Okay. It's perfect. Yeah. Self-burn, that makes sense."
  },
  {
    "timestamp" : "45:41-45:46",
    "text" : "Uh all right, you guys got anything else in this game? I think I've covered all the time. I got some trivia.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:46-45:47",
    "speaker" : "Greg",
    "text" : "You want to give my trivia?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:47-45:48",
    "text" : "Let's do trivia."
  },
  {
    "speaker" : "Greg",
    "text" : "Okay. This is not gonna be a Patriots. related trivia, but it's going to be a Jacksonville related trivia.",
    "timestamp" : "45:48-45:54"
  },
  {
    "text" : "Oh, good, because we know all about them.",
    "speaker" : "Andy",
    "timestamp" : "45:54-45:56"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, you're a football fan, so suck it. We're about to find out. Okay. Can you name The top five quarterbacks for Jacksonville in terms of yards.",
    "timestamp" : "45:57-46:14"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:16-46:18",
    "text" : "Um well Mark Brunel. Mark Brunel, yeah."
  },
  {
    "timestamp" : "46:18-46:29",
    "text" : "Mark Brunel is number one. Okay. Leftwitch is number four. Oh shit. Uh who is the other one we talking? Gerard? Gerard is number three.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, so I'd do a leverage long term.",
    "timestamp" : "46:30-46:32"
  },
  {
    "speaker" : "Greg",
    "text" : "All right, all right, all right, all right. This is yards thrown in Jacksonville, not",
    "timestamp" : "46:33-46:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Um who is the one that Bortles, Blake Bortles. Blake Bortles is number two. So we're missing number five?",
    "timestamp" : "46:38-46:49"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "46:49-47:13",
    "text" : "You're missing number five. Is this Gardner? Now Gardner Minshew is number six. Oh. He's played like four games. I just hope Jay Feedler. Jay Feeler is 15."
  },
  {
    "timestamp" : "47:14-47:20",
    "speaker" : "Andy",
    "text" : "Oh my goodness. Um I think we need a time frame for number five."
  },
  {
    "speaker" : "Greg",
    "text" : "Okay, number five played from 2012 to 2017.",
    "timestamp" : "47:20-47:26"
  },
  {
    "timestamp" : "47:28-47:41",
    "speaker" : "Andy",
    "text" : "Oh oh fuck what was his name? I know who he is because we beat him like 51 to like seven or something that year. Oh, he was a high draft pick too, right?"
  },
  {
    "text" : "Uh like I think you're thinking of number seven Oh god. Give me number seven. I need it. Number seven is the infamous Blaine Gabbart. Blaine fucking Gabbart is seven doll times. Wow. How many yards does he have at number seven? A total of 4,357 yards.",
    "speaker" : "Greg",
    "timestamp" : "47:42-48:03"
  },
  {
    "text" : "I'm ready to throw for more of my yards in a season.",
    "timestamp" : "48:03-48:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:06-48:23",
    "text" : "Oh, okay. Number number 12 is Nick Foles. What? He played four games last year. And he's numbered 736 yards. That's tough. I'll give you number five because I don't think you're gonna get it. It's a deep cut. Chad Henney.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "48:24-48:26",
    "speaker" : "Andy",
    "text" : "Oh yes, I should have got that."
  },
  {
    "speaker" : "Greg",
    "text" : "Who's back in the limelight these days? Winning playoff games. Played five years in Jacksonville. Damn. Yeah.",
    "timestamp" : "48:26-48:36"
  },
  {
    "text" : "How is that him and Drew Henson mixed up?",
    "speaker" : "Steve",
    "timestamp" : "48:36-48:38"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh Drew Henson, yeah. Yeah, yeah, yeah. I can see that. Kind of similar timeframe.",
    "timestamp" : "48:39-48:43"
  },
  {
    "text" : "So from that I started thinking like, where does like how does Brady compare to these numbers?",
    "timestamp" : "48:44-48:50",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Jacksonville? So I think my question to you, because I think this is where this is headed. Um, how many of the top ten lists combined does it take to get to Tom Brady's total?",
    "timestamp" : "48:51-49:04"
  },
  {
    "speaker" : "Greg",
    "text" : "Right. So that's where I started. Okay. So Brunel actually has like a decent number of yards.",
    "timestamp" : "49:04-49:11"
  },
  {
    "timestamp" : "49:11-49:12",
    "speaker" : "Andy",
    "text" : "Okay, that makes sense."
  },
  {
    "timestamp" : "49:12-50:02",
    "speaker" : "Greg",
    "text" : "So it takes a little it it's like the top seven, I think. You'll get to like Brady is where the call. The touchdowns. Touchdowns are a different story. Oh no Believe it or not, Tom Brady has more passing touchdowns than the entire Jacksonville franchise. So I'm Brady has 581 career touchdowns. Yeah. Jacksonville quarterbacks in general, 520 touchdowns. So it's not even close. 61 more touchdowns. Oh my god. And then you go, well, what about interceptions? Wait, because Tom Brady's played a long time, yes. Tom Brady has 191 career interceptions. Yes. Jacksonville quarterbacks. Three hundred and fifty eight."
  },
  {
    "timestamp" : "50:03-50:28",
    "speaker" : "Andy",
    "text" : "Oh double I'm pretty sure Tom Brady also has More playoff touchdown passes for Tampa Bay than every other Tampa Bay quarterback. Yeah, that makes combined. Uh except Tampa Bay was around since like how long ago? The 70s?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "50:32-50:43",
    "text" : "See all the all the playoff stats are gonna make sense. Yeah. What about but this team was a 95 expansion team. They got like a six-year head start on Tom Brady."
  },
  {
    "timestamp" : "50:45-50:47",
    "speaker" : "Andy",
    "text" : "They've been able to choose whoever they want to do it too."
  },
  {
    "timestamp" : "50:48-50:53",
    "speaker" : "Greg",
    "text" : "A six-year head start with like first overall picks like galore."
  },
  {
    "text" : "Yep. Unbelievable. But yeah, uh yeah.",
    "speaker" : "Andy",
    "timestamp" : "50:54-50:58"
  },
  {
    "timestamp" : "50:59-51:17",
    "speaker" : "Steve",
    "text" : "That's ridiculous. Does he have more than the Panthers? Shadow Chat any. are also or you know doing way better than it makes sense yeah yeah I wonder what the the"
  },
  {
    "speaker" : "Andy",
    "text" : "touchdown totals are for every team and where Brady ranks just on that list in general. Wonder how many teams because I I imagine he's probably throwing more touchdowns than the Texans too. Just because they're the most recent. But I don't know. That's banana.",
    "timestamp" : "51:17-51:31"
  },
  {
    "speaker" : "Steve",
    "text" : "Panthers got like they had big years from Cam and they made the Super Bowl with you know this year.",
    "timestamp" : "51:31-51:37"
  },
  {
    "text" : "Yeah, with um Jake Delome who threw a bunch of touchdowns.",
    "timestamp" : "51:37-51:39",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And they had a couple good years. I would think the Panthers gotta be above Brady's career. Or at least closer. Six years.",
    "timestamp" : "51:40-51:46"
  },
  {
    "speaker" : "Andy",
    "text" : "It's also ridiculous that we're comparing an entire franchise to one. To Tom Brady, who's I mean played for 20 fucking years, but still. God damn. And just for the record, uh Tom Brady's 5, what do you say, 81 touchdowns? That's just with the Patriots. He's thrown 664 total.",
    "timestamp" : "51:46-52:02"
  },
  {
    "speaker" : "Greg",
    "text" : "Wait, what?",
    "timestamp" : "52:02-52:03"
  },
  {
    "text" : "Tom Brady's thrown six hundred and sixty four touchdown passes in his career. I don't know if you're not included in playoffs or what.",
    "timestamp" : "52:03-52:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I must be non playoffs.",
    "timestamp" : "52:09-52:10"
  },
  {
    "timestamp" : "52:13-52:17",
    "speaker" : "Andy",
    "text" : "Where are you on for a football reference? Uh no, I have my own website for this."
  },
  {
    "timestamp" : "52:17-52:19",
    "speaker" : "Steve",
    "text" : "Oh, PS Dynasty info."
  },
  {
    "timestamp" : "52:19-52:22",
    "speaker" : "Andy",
    "text" : "No, this is a new one. That's just Tom Brady's touchdowns."
  },
  {
    "timestamp" : "52:22-52:25",
    "speaker" : "Steve",
    "text" : "Oh, so you have a Tom Brady touchdown website."
  },
  {
    "timestamp" : "52:25-52:28",
    "text" : "Yeah. Of course. Yeah, you know, as you do.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "52:28-52:28",
    "speaker" : "Steve",
    "text" : "Mm-hmm."
  },
  {
    "timestamp" : "52:29-52:45",
    "speaker" : "Andy",
    "text" : "I need I needed something to get me through the uh the playoffs this year. And that was it. His uh touchdown for the most air yards or the the most common air yards is ten For him, he's thrown 45 touchdowns of 10 air yards. Imagine that. Hi."
  },
  {
    "timestamp" : "52:46-52:46",
    "speaker" : "Kelly",
    "text" : "Hello."
  },
  {
    "text" : "Hi Callie.",
    "timestamp" : "52:46-52:47",
    "speaker" : "Andy"
  },
  {
    "text" : "I can't hear you, so I don't know if you said the end of the conversation. For",
    "timestamp" : "52:48-52:52",
    "speaker" : "Kelly"
  },
  {
    "text" : "Whatever Greg is saying, we didn't actually say.",
    "timestamp" : "52:52-52:54",
    "speaker" : "Steve"
  },
  {
    "text" : "Your dinner is gonna be delicious.",
    "timestamp" : "52:58-53:00",
    "speaker" : "Kelly"
  },
  {
    "speaker" : "Andy",
    "text" : "Nailed it. Thanks, Kelly. Yeah. Uh All right, best and worst.",
    "timestamp" : "53:02-53:10"
  },
  {
    "speaker" : "Steve",
    "text" : "Let's do it.",
    "timestamp" : "53:11-53:11"
  },
  {
    "timestamp" : "53:12-55:42",
    "speaker" : "Andy",
    "text" : "Steven? Greg's gotta eat dinner. Yeah. So Greg, you go first before you start eating on fucking audio, because that's what we need. Oh, can you guys go first? Sure. My oh, here's my best. I will share my screen so you can all hear it. Tom Brady definitely had uh an Omaha call. If you listen closely. Brady making adjustments at the line of scrimmage. D'ye hear it? Yeah, yeah, you're right. So I don't know if he's copying a uh a certain other quarterback or if he's making fun of it, because I feel like that'd be something he would do. So that's I don't know, is that a best or worst? I don't know. Uh oh uh one of my best was uh Willie McGuinness. Played out of his mind, and he almost had these uh really amazing interception. Where he jumps like back against the way he was moving and almost snagged like two-handed is like ridiculous. like uh fucking cannon throw of uh Byron Leftwich. He had a script sack too that just got recovered by the other team. He did, yeah. He was uh he was disruptive and he had some like play where he blew up the run and the commentators couldn't get over the fact that Ted Washington was also on the field, who like eventually made the tackle because of Willie McGuinness disrupting the entire play all by himself. But yeah, it was uh a good game for the defense again, who just like aren't allowing anything. Uh and eventually the offense, I think, will probably come into their own, but they don't even need to because this Patriots is This Page team isn't allowing any fucking any scores, any yards, any anything at this point in the season Because they're all healthy again, which is another thing we haven't really touched on. Yeah, they're getting everybody back. Yeah. Although um Dion Branch, first play from Scrimmage. uh has a really nice long catch on the sideline, hurts himself and is out for the rest of the game. You don't see him again. Yeah, I can't catch a break. Uh and my worst is probably Jack Del Rio's turtleneck. Hates turtlenecks. Yeah. Yeah fuck it. Fucking turtlenecks. I mean it's fucking make up your mind. Either wear like a like a full thing or or or not. Like wear a t-shirt."
  },
  {
    "timestamp" : "55:43-55:46",
    "text" : "How do you feel about scarves, Andy? I mean it's kind of like a removable turtleneck.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Scarves are fine. Cause they they are what they are. Like a turtleneck's like, you know, do I want to be like a full thing or what about collars? Not a huge fan of collars, but I wear them because I have to.",
    "timestamp" : "55:47-55:57"
  },
  {
    "timestamp" : "55:58-55:59",
    "speaker" : "Steve",
    "text" : "I have a short sleeved turtleneck."
  },
  {
    "text" : "That's that's a crime against humanity, I'm pretty sure.",
    "speaker" : "Andy",
    "timestamp" : "56:00-56:03"
  },
  {
    "timestamp" : "56:04-56:11",
    "speaker" : "Steve",
    "text" : "It's like a shirt sleeved turtleneck wicking. material. I have a short sleeve hoodie."
  },
  {
    "speaker" : "Andy",
    "text" : "Well that's because you're Bill Belichick, apparently.",
    "timestamp" : "56:13-56:14"
  },
  {
    "text" : "It's legit a Bill Belichick. Hoodie. Like it's branded Patriots.",
    "speaker" : "Greg",
    "timestamp" : "56:15-56:19"
  },
  {
    "text" : "Yes, the one with a little BB on it. They like they took Bill Belchek's protest and turned it into an even more lucrative revenue stream by selling. They're shirt fucking sleeves cut off and they can save them materials. It's looking nice.",
    "speaker" : "Steve",
    "timestamp" : "56:20-56:32"
  },
  {
    "timestamp" : "56:32-56:36",
    "speaker" : "Andy",
    "text" : "I guess that's what you're doing. Yeah. But mine has sleeves."
  },
  {
    "text" : "I actually wear it a lot because like it's nice to keep like your core warm, but like if you're like cooking or like doing woodwork and you don't want your sleeves all up in your shit.",
    "timestamp" : "56:36-56:44",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "56:45-56:46",
    "text" : "It's true, the sleeves do get in the way. Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Have you discovered the world of vests yet, Greg? No.",
    "speaker" : "Steve",
    "timestamp" : "56:47-56:52"
  },
  {
    "speaker" : "Greg",
    "text" : "That's or my worst is like just decide where you want to be.",
    "timestamp" : "56:53-56:58"
  },
  {
    "speaker" : "Andy",
    "text" : "Fucking turtlenecks. Well add there's some comic to talk about how it feels like. If you're wearing a turtleneck and a backpack it feels like a a weak midget is trying to strangle you all day. I'd shadow who said that but I don't know.",
    "timestamp" : "56:59-57:11"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "57:11-57:20",
    "text" : "I'm gonna start with my worst. Okay. And you get the bad out of the way early. Like the worst play was Antoine Smith fumble inside the ten-yard line. That was bad."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that was bad. His first fumble in Like 40 games or something though.",
    "timestamp" : "57:20-57:25"
  },
  {
    "timestamp" : "57:26-57:38",
    "speaker" : "Steve",
    "text" : "But then like Willie almost gets that strip sack. Yeah. Interception by Timon Poole. Touchdown by Troy Brown. So it all the defense build them out. Yes. But Uh it was a bad, bad fumble."
  },
  {
    "speaker" : "Andy",
    "text" : "It wasn't great.",
    "timestamp" : "57:39-57:40"
  },
  {
    "timestamp" : "57:40-57:53",
    "speaker" : "Steve",
    "text" : "And then just like bigger picture that just speaks to the whole thing, like We said a couple times, I cannot believe the Patriots win the Super Bowl this year because there are some fundamental flaws. That one fumbling not really is it. It's penalties."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "57:53-57:53"
  },
  {
    "text" : "But they won a whole half without a penalty, and I was like, wow, the whole half, no penalty. And they get one like the first fucking play of the second half.",
    "speaker" : "Steve",
    "timestamp" : "57:53-57:59"
  },
  {
    "text" : "Yeah, and it was like a It was like a uh what is it uh uh like a roughing penalty after the play was over, like jumping on the pile or some bullshit.",
    "speaker" : "Andy",
    "timestamp" : "57:59-58:09"
  },
  {
    "timestamp" : "58:10-58:11",
    "text" : "And then like a no-doubter too.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. It was even like a Matt Light of all people. Yes. Yeah, and not push him out of field goal range. It's like third and twenty something, and you're not gonna recover from that.",
    "timestamp" : "58:11-58:21"
  },
  {
    "timestamp" : "58:21-58:29",
    "text" : "And then they showed another stat. And this speaks to the defense, you know, really propping up the offense of the worst red zone percentage in the NFL.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "58:34-58:39",
    "speaker" : "Andy",
    "text" : "It's because they can't run the ball because Antoine Smith is Like basically a a horse with a broken leg at this point."
  },
  {
    "text" : "17 for 39. That's bad. That is And that is really fucking bad.",
    "speaker" : "Greg",
    "timestamp" : "58:39-58:47"
  },
  {
    "text" : "Yeah. But this is why, like to Steve's point, he's been saying all season, this is why they go out and get a running back who can finish drives, right?",
    "timestamp" : "58:47-58:54",
    "speaker" : "Andy"
  },
  {
    "text" : "But the question is Why does he still get carries? Why does he have 17 carries? We have nobody else.",
    "timestamp" : "58:54-59:01",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "And the field is so shit that like it really limits coming out. And he actually, well, he Played okay in this game. He had some decent runs. And then as soon as you fumbled, you never saw him again.",
    "timestamp" : "59:01-59:11"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but they also called like a third like on that right after they showed that stat, they called the third and inches Antoine's stretch play. And I was like What are you doing?",
    "timestamp" : "59:11-59:20"
  },
  {
    "timestamp" : "59:20-59:21",
    "speaker" : "Andy",
    "text" : "Yeah, we all know that's not gonna work."
  },
  {
    "speaker" : "Steve",
    "text" : "And then kick like a 22-yard field goal.",
    "timestamp" : "59:23-59:25"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but then he had they had they called a draw play to him and he gained like 15-16 yards on it",
    "timestamp" : "59:25-59:31"
  },
  {
    "timestamp" : "59:32-59:36",
    "speaker" : "Steve",
    "text" : "So there's no one thinking we're dumb enough to give the ball to Antoine Smith who's got nothing."
  },
  {
    "speaker" : "Andy",
    "text" : "Especially not on a draw.",
    "timestamp" : "59:36-59:37"
  },
  {
    "text" : "But let's talk about bests.",
    "timestamp" : "59:39-59:41",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:41-59:43",
    "text" : "Yeah, give me some bests."
  },
  {
    "speaker" : "Steve",
    "text" : "My bests involve the officials. Oh, oh. Not not their",
    "timestamp" : "59:43-59:48"
  },
  {
    "text" : "Good or bad officiating of the game. I think this this if this is a high I'm thinking of it is it will be on the website because I I made sure to snag this.",
    "timestamp" : "59:49-59:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "59:57-01:00:16",
    "text" : "But before that I noticed this and I think we've all noticed this at some point But it's good to see that it really started very early. Tom Brady gets in every single ref huddle. And they're like he's like one of the refs. And he's like, oh yeah, Tom, this is what we're doing. He's like, oh okay, okay. You know, no, no, come on, what are you talking about? Yeah. I didn't see that. I didn't see that."
  },
  {
    "speaker" : "Andy",
    "text" : "I I saw it slightly differently, guys.",
    "timestamp" : "01:00:17-01:00:18"
  },
  {
    "text" : "Yep. And it's crazy to see that. Like he's been doing that for his whole career. He's doing that now.",
    "timestamp" : "01:00:18-01:00:23",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:23-01:00:24",
    "text" : "Yeah."
  },
  {
    "text" : "Anytime the refs huddle up, he's like, yo, what's up? Yeah, yeah, he does. He just wants to know what the what the call's gonna be so they can prepare. And then the highlight you're talking about on that Tyrone Poole celebrating too early play. The reason he started celebrating is because he is looking out his right eye at Leftwitch, he's like a you know pretty big and fast. Yeah, how big was he, Greg? How big was Byron Leftwitch?",
    "timestamp" : "01:00:24-01:00:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:00:48-01:00:50",
    "speaker" : "Greg",
    "text" : "Six six five, two fifty."
  },
  {
    "timestamp" : "01:00:50-01:00:58",
    "speaker" : "Steve",
    "text" : "Yeah, and and like he just threw that pick, like he got it, and kind of run into it as a pylon. Yeah. And I think Leftwich had the angle, it would have been pretty close. Referee."
  },
  {
    "timestamp" : "01:01:00-01:01:03",
    "speaker" : "Andy",
    "text" : "Head referee. Yeah. Throws the perfect block."
  },
  {
    "timestamp" : "01:01:03-01:01:10",
    "speaker" : "Steve",
    "text" : "Yes, Left which shuts him down, they trips him up with his feet and Levage hits the game."
  },
  {
    "timestamp" : "01:01:10-01:01:28",
    "text" : "And Leftwish like stands on him. And then like the end of the clip is just the ref laying on his back as if he's just fucking dead. I thought That almost looked intentional. No, the re the ref had no idea. I mean, Leftwich, I don't know what the Left Witch saw the guy. Yeah, maybe.",
    "speaker" : "Andy"
  },
  {
    "text" : "He like stamped him. It was like fucking Lion King shit.",
    "speaker" : "Greg",
    "timestamp" : "01:01:29-01:01:33"
  },
  {
    "timestamp" : "01:01:33-01:01:34",
    "text" : "I mean it's from Marshall.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01:36-01:01:38",
    "text" : "Thundering herd coming through.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Choo choo. That thundering herd on him just. Get him underfoot. Yeah, that was that was amaz and then I don't know if you not notice this Steve, but after the play, like after they got him up and like checked and everything, uh I think it was fourth day. Oh no, because the pages had the ball So but you s they showed uh Teddy Bruski walking over him and holding up finger and you can tell he'd like how many fingers am I holding up? You okay? Can you still see? Pats about the rump but like heads off I was wondering what that I saw him do it. I was like, I didn't get it. Yeah, no, it took me a second. Oh, oh right. Yeah, that's the ref that just got his ass trucked. Yeah, that's a good one. Good one.",
    "timestamp" : "01:01:39-01:02:18"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:02:20-01:02:35",
    "text" : "All right, can I do mine? Yes, please. Okay. Uh the my best is gonna be Steve's dog Gus. Congratulations, Steve. I'm very happy for you."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:02:35-01:02:40",
    "text" : "You know, Greg's never coming back on the box. This is just a setup for his worst. We all know."
  },
  {
    "timestamp" : "01:02:40-01:02:42",
    "text" : "No, it's not. No, it's not.",
    "speaker" : "Greg"
  },
  {
    "text" : "Alright.",
    "timestamp" : "01:02:42-01:02:43",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:02:43-01:02:58",
    "speaker" : "Greg",
    "text" : "I'm happy for you. You're excited. You got a dog. Congratulations. Wow. My worst. Is the over-under on this game. Suck it, Steve. Okay. The over-under going into this game was 33."
  },
  {
    "text" : "With snow in the uh Yeah.",
    "timestamp" : "01:02:59-01:03:02",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:03:02-01:03:10",
    "speaker" : "Greg",
    "text" : "25 to 15. Seeing a modern day NFL over-under at 33. I mean they barely got the over."
  },
  {
    "speaker" : "Andy",
    "text" : "No, it was over a bit. Okay.",
    "timestamp" : "01:03:11-01:03:13"
  },
  {
    "timestamp" : "01:03:13-01:03:14",
    "text" : "Yeah, it smashed you over.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:14-01:03:20",
    "text" : "Alright. Well the the ga the last week's game was 35. It was 12-0. Yeah, and they scored 12 points."
  },
  {
    "timestamp" : "01:03:20-01:03:22",
    "text" : "Different times, man. Different times, huh? Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:22-01:03:27",
    "text" : "And both these defenses were hot. I'm a little surprised it went over to be honest."
  },
  {
    "speaker" : "Greg",
    "text" : "Can't you filter your website by over under Andy?",
    "timestamp" : "01:03:27-01:03:30"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:30-01:03:32",
    "text" : "It should be able to, yeah. Is that what you're doing right now?"
  },
  {
    "timestamp" : "01:03:32-01:03:54",
    "text" : "Can you guys hear me? My best is this sandwich Kelly just brought me. But my worst my worst is great. Kelly's timing on dinners. We record at 7 p. m. Every every Thursday. What time's dinner served? She's seven twenty five.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:03:57-01:04:05",
    "text" : "We've dinner at eight o'clock. Greg, there was one other Patriots game with a lower over-under than this game. E Really?",
    "speaker" : "Steve"
  },
  {
    "text" : "Well, how did you figure this out?",
    "timestamp" : "01:04:05-01:04:06",
    "speaker" : "Greg"
  },
  {
    "text" : "Andy's website. You can filter by over-under. Oh yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:04:07-01:04:10"
  },
  {
    "text" : "Sweet. Website, Andy. Go fuck yourself.",
    "speaker" : "Greg",
    "timestamp" : "01:04:10-01:04:13"
  },
  {
    "speaker" : "Steve",
    "text" : "Week 11, 2000, Cleveland Browns. On your fucking hat. It was 19 to 11. We lost to the Browns. And the over under was thirty-two. There you go. And it was under. Yeah. Wow. The underhead. Wait, what which which season was that? 2000. Oof.",
    "timestamp" : "01:04:14-01:04:35"
  },
  {
    "speaker" : "Greg",
    "text" : "So this is pretty remarkable that an overunder would be 33. Yes. What week was that, Steve?",
    "timestamp" : "01:04:35-01:04:40"
  },
  {
    "text" : "Uh 2011.",
    "speaker" : "Steve",
    "timestamp" : "01:04:40-01:04:42"
  },
  {
    "speaker" : "Andy",
    "text" : "Week eleven. Alright. So because I think I remember reading a story about how in 2000 because the cap had been so mismanaged by Pete Carroll, probably. Um the Patriots didn't have enough money to sign a full 53 players to the roster. So they actually play with like 50 guys on the team. The end of that season. And they're basically just like, we just want guys who want to be here at this point. Like they're doing it to prove a point as well as having no money. So I'm wondering if that contributed to An over under of 32 and then hit in the under. Because that would be about that same time, I think. Yeah. All right.",
    "timestamp" : "01:04:43-01:05:22"
  },
  {
    "timestamp" : "01:05:22-01:05:24",
    "text" : "I wish I got to go to Shaper Stadium.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Apparently I did once. But I was a an infant and my grandmother took me back to the car and watched a guy pee in the uh that was the game where they were passing sex ball.",
    "timestamp" : "01:05:25-01:05:37",
    "speaker" : "Andy"
  },
  {
    "text" : "Stanking give you good speed.",
    "speaker" : "Greg",
    "timestamp" : "01:05:37-01:05:38"
  },
  {
    "timestamp" : "01:05:41-01:05:58",
    "speaker" : "Andy",
    "text" : "Exactly, yeah. I'll have to link that in the show notes too. If you want to listen to Mama Brown talk about Shaver Stadium and the uh blow-up dolls that were being passed around. That's kind of the dark the dark times of the Patriots era or the Patriots uh as a as a franchise."
  },
  {
    "text" : "It's pretty tough for our family, but then Greg was born.",
    "timestamp" : "01:06:00-01:06:02",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "It all turned around.",
    "timestamp" : "01:06:03-01:06:04"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:06:05-01:06:07",
    "text" : "No, it went even further downhill."
  },
  {
    "speaker" : "Andy",
    "text" : "All right, so what is next week, gentlemen? Wednesday, Thursday. Tuesday? There will be those days next week. You are correct. I'll give it to you.",
    "timestamp" : "01:06:09-01:06:23"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:06:23-01:06:33",
    "text" : "I fucking knew it, Andy. I fucking knew it. You know what? Every day is the same these days This is true. How are you guys hanging in there with COVID? You good?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I guess got new dogs.",
    "timestamp" : "01:06:33-01:06:34"
  },
  {
    "timestamp" : "01:06:34-01:06:38",
    "speaker" : "Greg",
    "text" : "You how that is? Yeah, that's probably a good one."
  },
  {
    "timestamp" : "01:06:38-01:06:39",
    "text" : "Oh yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "I just got this new printer Have you printed anything on it yet?",
    "timestamp" : "01:06:39-01:06:43",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:06:43-01:06:44",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:06:44-01:06:54",
    "text" : "Pretty distracting. I've successfully completed one printed page and then it shit the bat again. And you've had it for how long? Over a week now."
  },
  {
    "text" : "Yeah, two weeks. You'll get there? And by get there, I mean you'll you'll throw that one away. Oh, you know what? I should I should uh yeah, I'll mail you my basel bat",
    "speaker" : "Andy",
    "timestamp" : "01:06:55-01:07:06"
  },
  {
    "timestamp" : "01:07:06-01:07:08",
    "text" : "Yeah, I'm gonna do the office space.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly. And then I'll I'll tell you which one you should really buy. All right, next week we are traveling to New Jersey.",
    "timestamp" : "01:07:09-01:07:17"
  },
  {
    "text" : "New Joycey. New Joycey. The Medal Ants.",
    "timestamp" : "01:07:17-01:07:20",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. The New York. I can't even call them the New York Football Giants because they're in the New York Jets. Yeah. So uh next week will be fuck the Jets week, which is exciting. I love those weeks. Yeah. Uh James Chadwick Pennington, we'll see. Chadwick. Chadwick. Chadwick. The seventh. All right. But uh yeah, until then, we will see you later.",
    "timestamp" : "01:07:20-01:07:48"
  }
]