[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom"
  },
  {
    "timestamp" : "00:22-00:45",
    "text" : "Welcome back to the Patriots Dynasty Podcast. The podcast where we are reminiscing back in the day of the Patriots Dynasty era, 2001 onwards. I'm your host, Andy Brown. With me this week both my brothers, Steve. How are you doing, bud?",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, good. Me and Gus having the best time. Are we Gus?",
    "speaker" : "Steve",
    "timestamp" : "00:45-00:49"
  },
  {
    "timestamp" : "00:50-01:00",
    "text" : "Yeah, that's right. You're uh you're home by yourself this weekend. Single dog daddy. Right, which is uh why I got a drunken phone call on uh on Saturday.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, you jealous, Greg?",
    "timestamp" : "01:00-01:02"
  },
  {
    "timestamp" : "01:02-01:11",
    "speaker" : "Greg",
    "text" : "Uh one second. This is also with us. Give me one second."
  },
  {
    "speaker" : "Andy",
    "text" : "Baby brother Greg Brown. Who is currently preoccupied because he has double booked and is uh 10 minutes late to his fantasy football draft. So he is attempting double duty. So um who'd you pick, Greg?",
    "timestamp" : "01:12-01:26"
  },
  {
    "speaker" : "Greg",
    "text" : "James Robinson. So let me explain this too. So they the the the commissioner's draft is inept. So they don't know how to do sleepers or sleep keepers? No. Okay. They don't know how to do keepers, so they um They just sent us a list in a text message and say don't draft these players till it's your turn. And has to and it's like everyone has to like double check the list and then",
    "timestamp" : "01:28-01:55"
  },
  {
    "speaker" : "Mom",
    "text" : "If you pick them, they have to like pause the draft and like start.",
    "timestamp" : "01:56-01:59"
  },
  {
    "text" : "It's like it's a shit. So I just go through and be like, oh, I want this guy. Oh no, he's already on the keeper list. You know?",
    "timestamp" : "01:59-02:05",
    "speaker" : "Greg"
  },
  {
    "text" : "It's it's so confusing. Bruto. I mean, yeah, it is uh it is a confusing time. Um I think we are dedicating this episode To the jersey Gregory is wearing and the man behind it. We lost David Patton this week to a motorcycle accident. And so this one goes out to him. Because he is an awesome guy. And I recommend listening to the Pats from the Past episode that was literally came out like a couple weeks ago. And it was with him. And it was He was just like the happiest dude to the point where it made me send him an email being like, thanks for doing that, because it made me smile. So tough break. But we get to relive them because we are back in 2004. This is week six against the who is it, Steve Brown?",
    "speaker" : "Andy",
    "timestamp" : "02:05-03:06"
  },
  {
    "speaker" : "Steve",
    "text" : "Seahawks.",
    "timestamp" : "03:06-03:07"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:08-03:10",
    "text" : "Seattle Seahawks. Um who"
  },
  {
    "speaker" : "Steve",
    "text" : "Coming into this game page is obvious. What's up? Just go on the website, look at his highlight. David Bryan has the sickest highlight in this game. This actually only gif you rift from this game. So far. The first go-round when you only did one per game to just get one on there.",
    "timestamp" : "03:11-03:28"
  },
  {
    "timestamp" : "03:28-03:29",
    "speaker" : "Andy",
    "text" : "Yep."
  },
  {
    "timestamp" : "03:29-03:35",
    "text" : "Catches the little bubble screen inside the five, holds it like a loaf of bread. It's like a stiff arm and just dances right by the end.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:35-03:38",
    "text" : "It just yeah, waltz into the end zone. Yeah. Swaggy P. Yeah."
  },
  {
    "timestamp" : "03:39-03:39",
    "speaker" : "Steve",
    "text" : "So swaggy."
  },
  {
    "text" : "Definitely the highlight. Anybody have a favorite uh David Patton moment?",
    "speaker" : "Andy",
    "timestamp" : "03:39-03:43"
  },
  {
    "timestamp" : "03:43-03:46",
    "text" : "It's gotta be the three touchdown indie game",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "That's well, I was gonna say the sneaky the the miracle and champagne. Oh, that might be right the best catches that we've seen. That is. I was trying to rack my brain and think of like a pure catch Yeah. In a in an important moment that was better than that catch and nothing came to mind. I mean the obvious one is the one in the Super Bowl.",
    "timestamp" : "03:45-04:05"
  },
  {
    "timestamp" : "04:06-04:13",
    "speaker" : "Steve",
    "text" : "See. You talked about this, how they just put that new rubber pellet field in. Right, right, right. You could see it in the orange end zone because they're playing the Illinois."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that's right. And you watch it live and you're like, no way. See There's no way I got two feet. But then you read it. And it's just like one of those ones where the second foot is just like Right on the line. Perfect. Perfect. Yeah. Dotted the eye, I believe they say. Yeah. Yeah. No, that was fantastic. That's a great one. And the commentator call on that is awesome too. He goes One, because he's counting the feet, he goes one, two, six.",
    "timestamp" : "04:14-04:39"
  },
  {
    "speaker" : "Andy",
    "text" : "That was two thousand two week ten. Um so a rough season overall, but not in that game. That was a fantastic comeback. It was a sweet game. So yeah. So you can find that on the website if you want to reminisce. Um I think the obvious one is his catch into Bowl 36, the only offensive touchdown the Path scored, which looked exactly like the one the week before against the Steelers, remember? That Bledzel threw him. So they they pointed out somebody pointed out online this week that um David Patton caught Drew Bledsoe's last playoff touchdown. And Tom Brady's first.",
    "timestamp" : "04:41-05:19"
  },
  {
    "timestamp" : "05:19-05:19",
    "text" : "Ooh.",
    "speaker" : "Greg"
  },
  {
    "text" : "Pretty good, right? Pretty good. Yeah.",
    "timestamp" : "05:20-05:23",
    "speaker" : "Andy"
  },
  {
    "text" : "I love that.",
    "timestamp" : "05:23-05:24",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "05:24-05:28",
    "speaker" : "Andy",
    "text" : "Yep. Also, sneaky good game was the snowball."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "05:29-05:29",
    "text" : "Yeah."
  },
  {
    "text" : "Remember he caught literally everything and like every catch was from his knees because he kept falling over.",
    "speaker" : "Andy",
    "timestamp" : "05:29-05:33"
  },
  {
    "speaker" : "Steve",
    "text" : "As me said on that episode though, some of those could not have been maybe not have been catches just because they hit the snowplow bank in front of him and never knew, you know.",
    "timestamp" : "05:33-05:42"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "05:42-05:54",
    "text" : "But he was still scooping them up. He was scooping them up that's a good question. Is that considered the ground? I don't know. Because I mean rain isn't, right? Right. But But then I'm not sure if you're not going to be able to do that."
  },
  {
    "text" : "Uh yeah. So I think those are probably the most memorable plays. There might be more coming. We're not sure How long?",
    "speaker" : "Andy",
    "timestamp" : "06:06-06:13"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "06:14-06:17",
    "text" : "And like he's he's an unbelievable player too because he's he was undrafted."
  },
  {
    "timestamp" : "06:18-06:20",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. I was a bit of a journeyman too before he landed on the Patriots."
  },
  {
    "text" : "Didn't he play at the CFL or something?",
    "timestamp" : "06:21-06:22",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "06:22-06:23",
    "speaker" : "Andy",
    "text" : "Arena. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "06:24-06:24"
  },
  {
    "timestamp" : "06:24-06:32",
    "speaker" : "Andy",
    "text" : "Yeah. And uh he was on the Bears for a while, wasn't it Bears? No, he he was undrafted in ninety-six."
  },
  {
    "speaker" : "Greg",
    "text" : "He went to the Albany Firebirds Arena League. And then he played for the Giants for two years. Giants, that's who it was. Uh the Browns for one year. And then he signed with the Pats and won three Super Bowls. In four years. Yeah, he signed with them in 01. And yeah, I was actually looking into this to see like because I think that's one position where you get way it's way less frequent that you get great players undrafted. Because I think wide receiver is like a very physical position. So it's like the measurables really matter.",
    "timestamp" : "06:32-07:04"
  },
  {
    "timestamp" : "07:05-07:05",
    "speaker" : "Steve",
    "text" : "True."
  },
  {
    "timestamp" : "07:06-07:12",
    "text" : "Yeah. So I looked it up and like what are the best undrafted receivers ever.",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh.",
    "speaker" : "Andy",
    "timestamp" : "07:12-07:12"
  },
  {
    "text" : "We talked about one. Um who was it for the Broncos? Rod Smith. That's who it was. He's number one.",
    "timestamp" : "07:12-07:19",
    "speaker" : "Greg"
  },
  {
    "text" : "Wasn't Wayne Corbet also on the Wayne Corbet was number three.",
    "speaker" : "Mom",
    "timestamp" : "07:19-07:23"
  },
  {
    "timestamp" : "07:24-07:43",
    "text" : "Wes Welker was number two. Victor Cruz of UMass. Oh, yeah, yeah. Yep. Yep. And Miles Austin was number five. So I mean Miles Austin, his stats are pretty comparable to David Patton for a career. Uh he was not on this list, so maybe it's an older article. I don't know.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "07:44-07:48",
    "text" : "Is he not tracked? Huh. And he had some big seasons in Pittsburgh.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I would imagine he'd be like top of that list.",
    "timestamp" : "07:49-07:51"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "07:51-07:52",
    "speaker" : "Steve"
  },
  {
    "text" : "All right. My picks coming up. You guys want to help me with this next one? Yeah. Yeah. Give it to me.",
    "timestamp" : "07:52-07:57",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "We got Greg.",
    "timestamp" : "07:57-07:58"
  },
  {
    "text" : "Okay. Who's PR? This is P P I don't know.",
    "timestamp" : "07:58-08:04",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm in four leads.",
    "timestamp" : "08:05-08:06"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "08:06-08:07",
    "text" : "I have no idea what any of them are."
  },
  {
    "timestamp" : "08:08-08:11",
    "speaker" : "Steve",
    "text" : "Half point is like the standard. We'll call it half."
  },
  {
    "timestamp" : "08:11-08:37",
    "text" : "Yeah, we'll call it half. I have Devontae Adams as my first rounder. James Robinson as my second, because you know the injury to what's his face. Okay. So let's see, I can get Nope, that guy's I gotta go check. Check your list. Mike Evans. Oh, Mike Evans just got picked. Alan Robinson. George Kittle. I like George Kittle. I like George Kittle.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "08:37-08:39",
    "text" : "Third round pick though it's too early.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "08:39-08:58",
    "text" : "Keenan Allen. That's a decent Adam Thielen, Robert Woods, Miles Sanders, Chris Carson. Tyler Lockett. So you're definitely on wide receiver here. Is that the deal? I mean George Kittle is like a wide receiver. He puts the wide receiver number. I'm taking Kittle, Steve. No. Yeah, take Kittle."
  },
  {
    "speaker" : "Steve",
    "text" : "I would have taken the",
    "timestamp" : "08:58-08:59"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "09:00-09:01",
    "text" : "Who? Alan Robinson?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I like Alan Robinson.",
    "timestamp" : "09:01-09:02"
  },
  {
    "text" : "He is pretty good, yeah.",
    "timestamp" : "09:03-09:04",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, you can put a little trust in fields, so like be good. And Robinson is by far the best receiver on that team. It's not even close.",
    "timestamp" : "09:04-09:13",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, I know. I know. Also, Steve thinks um Tannehill's overrated.",
    "timestamp" : "09:13-09:18",
    "speaker" : "Andy"
  },
  {
    "text" : "I actually drafted Tannehill and I dropped him and picked up Mac Jones when he didn't start a job. I hope that's true. And it's a league where you only get three transactions all year. So I use one of my three transactions to get the stuff.",
    "speaker" : "Steve",
    "timestamp" : "09:19-09:33"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:34-09:38",
    "text" : "That is stupid. Fucking yeah, that's that's a dumb league and a dumb move."
  },
  {
    "timestamp" : "09:38-09:41",
    "speaker" : "Steve",
    "text" : "Yeah, that was a dumbest thing. You're the king of running dumb leagues, buddy."
  },
  {
    "text" : "That's true. Can we talk about that? Yeah, let's talk about a fantasy episode. I guess so.",
    "timestamp" : "09:43-09:48",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "09:48-09:58",
    "speaker" : "Steve",
    "text" : "The only thing I really remember from playing in your fantasy league, Andy was the Cardinals kick returner being the top point scoring player in the league."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:59-10:00",
    "text" : "Oh, yeah, that was a rookie mistake though."
  },
  {
    "timestamp" : "10:00-10:01",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I play Ryan's uh Ryan's story we've had on the podcast made that similar mistake where he there was too many points for uh kick return yards.",
    "timestamp" : "10:01-10:10"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "10:10-10:10"
  },
  {
    "timestamp" : "10:10-10:11",
    "speaker" : "Andy",
    "text" : "He didn't see it."
  },
  {
    "text" : "Yes, that was the mistake. Hey, it happens. Happens to the best of us. And the Cardinals. sucked at the time. So they were of course they did getting the ball kicked to them because their defense was just expensive. And like this dude was just He was like a decent record. But he has so many opportunities it was ridiculous.",
    "speaker" : "Steve",
    "timestamp" : "10:14-10:36"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:36-10:41",
    "text" : "And I was like, I remember Mike Mellon's team was just all returners. Yeah."
  },
  {
    "text" : "Which is exactly what I did to Ryan Stories League because I figured out before the draft. So I drafted them all and was getting heckled murk mercilessly and then went undefeated in the regular season. Cool.",
    "timestamp" : "10:41-10:52",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "10:53-10:54",
    "speaker" : "Steve",
    "text" : "Cool league, Andy."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "10:54-10:54"
  },
  {
    "text" : "Hey, after that it was great. After that was fantastic. I don't know. I'm gonna take the kick returners on the worst teams. I'm really getting in the depth chart. Who's returning the kicks for them? Yeah, it made you learn about football, Steve. You're welcome. Punt returner.",
    "speaker" : "Steve",
    "timestamp" : "10:54-11:10"
  },
  {
    "text" : "Put him on the bench. Berrios. So who Braxton Berrios. He's from The Pats. Was he around from around here?",
    "timestamp" : "11:11-11:21",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "11:21-11:22",
    "text" : "No, he's from Miami."
  },
  {
    "speaker" : "Greg",
    "text" : "I think he's from North Carolina actually. Oh, some when you say from someone I work around here. Yeah, yeah. Yeah. I think some might work with, like went to high school with him. Oh. Said he was a bitch. I was gonna say.",
    "timestamp" : "11:22-11:34"
  },
  {
    "timestamp" : "11:34-11:45",
    "text" : "Yeah. Speaking of speaking of which, uh, we have a new drop, Greg. Um I was uh setting it up. Uh t before you jumped on and Steve. I I had a couple and Steve wanted me to go with this one.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Turn in next week to see how much of a blubbering little bitch Greg is. On the Patriots Dynasty podcast. What the hell? I don't know, but those are your words.",
    "timestamp" : "11:46-11:56"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "11:57-11:59",
    "text" : "Everything's recorded. You keep forgetting this."
  },
  {
    "speaker" : "Greg",
    "text" : "Everything is recorded. I don't remember that. Yeah, but no one listens to it, Steve. That's the thing. It's like when a tree falls in the forest. At least we get to listen to it all the way. Those words are never said if no one hears them.",
    "timestamp" : "11:59-12:13"
  },
  {
    "timestamp" : "12:14-12:19",
    "speaker" : "Andy",
    "text" : "And yet. We have them. Uh all right, speaking of football."
  },
  {
    "speaker" : "Greg",
    "text" : "Can we do a well can we do like a little round table of our like biggest pet peeves about fantasy? Okay. All right. You clearly have something on the mind. Go on.",
    "timestamp" : "12:19-12:28"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, I think everybody has like you enjoy fantasy, but there's a piece of uh mine is that it I I can't I couldn't enjoy watching football the same. That's a good one. Because I had to worry about like who I had and like who the other who I was playing against had and that sort of thing. Yeah.",
    "timestamp" : "12:28-12:44"
  },
  {
    "timestamp" : "12:44-13:01",
    "speaker" : "Steve",
    "text" : "See, mine is the opposite. I watch way more football. I've watched it anyway though. I went from going from one Patriots game a week to like let me park my ass in front of Red Zone every Sunday. And then also watch the Patriots. Now we're we're like tripling my time commitment."
  },
  {
    "timestamp" : "13:01-13:02",
    "speaker" : "Andy",
    "text" : "That's true, yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "And I honestly don't give a fuck about anybody at the Patriots.",
    "timestamp" : "13:02-13:05"
  },
  {
    "timestamp" : "13:05-13:31",
    "speaker" : "Andy",
    "text" : "Right, no, me neither. So I've just stopped playing fantasy. Actually, you know, I haven't stopped playing fantasy. I've just I it's now my new investment strategy too. I just I draft and then I forget that I'm in the league and I don't check it for six weeks. Oh, you're you're one of my pet peeves, Andy. Yes. I won I won my only the only time I've ever won a league was last year doing that. This is why I call me I s I set the team, but I don't do anything else."
  },
  {
    "timestamp" : "13:31-13:47",
    "text" : "I it's me and three other owners, so I don't actually have to do anything Somebody else is gonna make that waiver wire pickup and start that guy and manage. I just you share a team with three guys? Four ways is the best.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, but do you have to like I did that once with someone for my work and he would he'd come to my desk and be like, yo, which defense should We pick up and I just be like, I don't give a shit. Just pick up and then he'd just be like, well, well, you know, do you think the bears or or the dolphins? I'd be like, dude, I just said I don't give a shit.",
    "timestamp" : "13:48-14:06",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "14:09-14:38",
    "text" : "Here's the secret. And I started doing this to my wife before she caught on. But it took her a few years. She would ask me. Actually, I used to do it with Mike Mellows where I started it originally. Um, but they ask you your opinion and you just pick one at random And you always pick one at random with no reasoning behind it. So even if they say why, you say you just shrug at them, say, I don't know, because you told me to pick one. And eventually they learn to stop asking you because they know you're picking one at random, which is even worse than not picking.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That sounds like a losing proposition in the long run, Andy.",
    "timestamp" : "14:38-14:41"
  },
  {
    "timestamp" : "14:42-14:45",
    "speaker" : "Greg",
    "text" : "Nope. Worked out. What if you really do have an opinion though?"
  },
  {
    "timestamp" : "14:45-14:46",
    "speaker" : "Steve",
    "text" : "Yeah, there you go."
  },
  {
    "text" : "Well then you can give your opinion. But you won't even get asked. Well, that's fine. I don't want to get asked. I rarely have an opinion. If I have an opinion, I'll let it be known You don't have to ask for my opinion. I think you both know that. You're gonna get it regardless.",
    "timestamp" : "14:46-15:01",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't care about your opinion, Andy. Kelly's Kelly's got a team this year. You want to know what her team name is? Oh boy. Yes Smell my punt. Oh my.",
    "timestamp" : "15:01-15:14"
  },
  {
    "text" : "Yeah. What is your team name, Greg? Smell her.",
    "speaker" : "Steve",
    "timestamp" : "15:14-15:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:17-15:19",
    "text" : "Smell my wife's punt."
  },
  {
    "timestamp" : "15:19-15:29",
    "text" : "Smell Kelly's punt. System of a brown. Make up, make up. Come on, come on, come on, make up, make up. You wanted to.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "A decade.",
    "timestamp" : "15:33-15:34"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah?",
    "timestamp" : "15:34-15:35"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "15:35-15:37",
    "text" : "The Steveland Browns."
  },
  {
    "timestamp" : "15:37-15:39",
    "text" : "Oh that's pretty good.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah.",
    "timestamp" : "15:39-15:39"
  },
  {
    "text" : "Yeah, that's funny you say that is cause that's why I did that work team because the co-owner was Steve. So our team name was I really only did it so we could name our team that.",
    "timestamp" : "15:39-15:50",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Dude, I'm telling you, co-managing is a shit. These gotta get more managers, Greg. That way you have four people and that guy can go ask somebody else and you don't have to care, you know. It's nice. We have a whole we have our name. We have a it's called Berts and Brown and Associates. We have a logo.",
    "timestamp" : "15:50-16:06"
  },
  {
    "timestamp" : "16:08-16:08",
    "text" : "Oh god.",
    "speaker" : "Andy"
  },
  {
    "text" : "We we like proposed trades, like we're a law firm, we have a letterhead, we fucking draft it up, send it over to them, you know. Alright, that's pretty good. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "16:09-16:16"
  },
  {
    "text" : "The only team I co-managed was was with Ryan. And that's because we were both running the league and it was garbage. Oh, you run a garbage league, Andy? Shocker. Oh no, the team. I run a garbage team. I run a fantastic league.",
    "timestamp" : "16:16-16:28",
    "speaker" : "Andy"
  },
  {
    "text" : "In the in the league.",
    "timestamp" : "16:28-16:29",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Yeah.",
    "timestamp" : "16:29-16:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "16:30-16:32",
    "text" : "The team finished bottom."
  },
  {
    "timestamp" : "16:32-16:32",
    "speaker" : "Andy",
    "text" : "Huh?"
  },
  {
    "timestamp" : "16:32-16:34",
    "speaker" : "Steve",
    "text" : "Let's get into the Seahawks game."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:34-16:37",
    "text" : "No, my pet peeve. What's your pet peeve?"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh the group chats.",
    "timestamp" : "16:37-16:38"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh god. I've Never actually had one that had an active group chat. The group the group chats are brutal, dude. That's why I stopped running a fantasy football league, is because nobody would participate except for me. I put a shit ton of Baffert into running a league.",
    "timestamp" : "16:39-16:51"
  },
  {
    "speaker" : "Steve",
    "text" : "When I do my shit talking as as the law firm as Berts and Brown Associates, we do it very, you know, formal, you know. I like that. Less group chat, more memo. Yeah. I like that. Yeah. All by email.",
    "timestamp" : "16:51-17:03"
  },
  {
    "text" : "I might steal that em that idea. Yeah.",
    "timestamp" : "17:03-17:05",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "17:06-17:26",
    "text" : "I have a I have a work email signature that I can just drop to it and it's a fucking Burton Brown Associates email signature. It's not bad, Steve. I'm impressed. Scott did a logo in paint. It has it's ridiculous. It has uh McGurt, the golfer's fucking sweaty ass face in it, has some tigers. And then in the bottom corner it says ampersand ass.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "17:30-17:34",
    "speaker" : "Greg",
    "text" : "Andy, can you make me one if I make one of my team names something like a law firm?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yes.",
    "timestamp" : "17:34-17:34"
  },
  {
    "text" : "Of course. You just let me know what you need. That's what we do. Steve.",
    "timestamp" : "17:35-17:40",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "17:42-17:50",
    "speaker" : "Greg",
    "text" : "All right. Speaking of talking to your girlfriend again, Steve? No, Gus is eating fucking dirt. Well, dog's gonna dog, dude. Yeah, I know, I know."
  },
  {
    "timestamp" : "17:51-17:52",
    "speaker" : "Steve",
    "text" : "That's why we have a plant on the floor. It's our fault."
  },
  {
    "text" : "Yep You you walked right into that one, Steve. Fucking dirt muncher over there. Speaking of dirt munchers, Seattle Seahawks 2004. Uh Mike Holmgren, definite dirt muncher.",
    "timestamp" : "17:53-18:04",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "18:05-18:05",
    "text" : "That mustache."
  },
  {
    "timestamp" : "18:05-18:08",
    "speaker" : "Andy",
    "text" : "He has like a walrus. He does. Yes. Yeah, definitely."
  },
  {
    "speaker" : "Greg",
    "text" : "Very walrus-y.",
    "timestamp" : "18:08-18:09"
  },
  {
    "timestamp" : "18:09-18:10",
    "text" : "Yes, absolutely.",
    "speaker" : "Andy"
  },
  {
    "text" : "What a whales eat? What do whales eat? Plankton. He's a plankton eater for sure. Like Holmgren. He just opens his gullet and just lets shit flow into it. He's like chewing right. They're not gills. They're something like that. Oh the baleen. The baleen, that's what it is. That's what he's got on his face.",
    "timestamp" : "18:10-18:33",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "18:35-19:16",
    "speaker" : "Andy",
    "text" : "So out of the three of us, which one of which one of us do you think is married to a preschool teacher that knows all the names to the parts of a fucking whale? Oh boy. All right. Yeah, so um my colmgren and his baleen. Seattle Seahawks, uh never uh Mike Holmgren never beat um the Patriots. Really not a surprise because I felt like this team was ill prepared for this game. Like they came out. I think even um Holmgren said like at halftime, it's like, oh, we came out jumpy in the first half. Which is the reason they were down twenty to nine or twenty to six."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:16-19:19",
    "text" : "Did he coach longer in Seattle or the Packers?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:20-19:22",
    "text" : "Packers, yeah. He was there for a while."
  },
  {
    "timestamp" : "19:23-19:27",
    "speaker" : "Steve",
    "text" : "They had some talented teams. I mean Sean Alexander sneaky great."
  },
  {
    "text" : "They made a Super Bowl, Seahawks. Yep. They lost to uh Big Ben.",
    "speaker" : "Greg",
    "timestamp" : "19:30-19:36"
  },
  {
    "timestamp" : "19:37-19:37",
    "text" : "Really?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I think it was oh five.",
    "timestamp" : "19:37-19:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:40-19:43",
    "text" : "Right right after the pit Yeah, 13 and 3."
  },
  {
    "timestamp" : "19:43-19:46",
    "speaker" : "Steve",
    "text" : "Yeah, it was because Roth Lathasburger loses this year as a rookie. Right."
  },
  {
    "text" : "So next year they make the But yeah, he won the Super Bowl in Green Bay in ninety-six against the Patriots, right? And then made the Super Bowl the next year too. Uh is that the year they lost to Brett Favre? No, not Brett Favre. Um John Elway. And the Broncos.",
    "speaker" : "Andy",
    "timestamp" : "19:47-20:02"
  },
  {
    "text" : "All right. I'm on the clock. Sorry to interrupt. I'm on the clock.",
    "timestamp" : "20:02-20:06",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "20:06-20:07",
    "text" : "Who you got?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Your options. My options are Odell Beckham Jr. or Cooper Cup. ODB. Yeah, I'm on I'm ODB. Cooper Cup could be fucking good though.",
    "timestamp" : "20:07-20:19"
  },
  {
    "timestamp" : "20:19-20:24",
    "speaker" : "Andy",
    "text" : "Yeah, I don't think I think Baker Mayfield Begar Mayfield's going to be the better quarter of the game."
  },
  {
    "timestamp" : "20:25-20:32",
    "text" : "I think that I'll trust you guys on this one. I would have taken Cup, but I think the I think the Rams are overrated this year, especially offensively.",
    "speaker" : "Greg"
  },
  {
    "text" : "They just if they get hurt, if they get injuries, they got nothing behind it.",
    "timestamp" : "20:32-20:35",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, they got Sony now though.",
    "timestamp" : "20:35-20:37"
  },
  {
    "text" : "Yeah, no.",
    "speaker" : "Steve",
    "timestamp" : "20:37-20:37"
  },
  {
    "timestamp" : "20:38-21:40",
    "text" : "He's a good draft pick. I like some of the things. So maybe. I don't know. We'll see. Uh more about these. You you good, Greg? I'm good. Thank you. More about these uh Mike Holmgren Seahawks. Um this is the year that they traded for Jerry Rice. And this is the year that Jerry Rice finally sucked. Yeah. 25 catches, 360 yards. He didn't even see on the season. No, I yeah, I don't I didn't even see him. Um But this was like I I thought the this was a game on Fox too because it's an NFC team. And I thought the commentators were like pushing real hard for this to be Seattle's opportunity. This is their coming out party against the the champs. And I guess they had a heartbreaking loss the week before. Where they were up 24-7 at the half against the Rams and they ended up losing 33-27.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And he we're I can't be getting the commentation so early because they were terrible, but I have a note in all caps. Did Fox jinx the Yankees an investigation? So we'll get to that. We'll get to that. Will we? Let's get into it right now. All right. Because the time of this game is pretty important.",
    "timestamp" : "21:40-22:04"
  },
  {
    "timestamp" : "22:04-22:23",
    "speaker" : "Andy",
    "text" : "What day is it? So this game happened on Sunday, October 17th, 2004. And Gregory, can you tell me um what may have been happening around that time? On uh on on the middle of October in 2004. Perhaps not in this sport, but in another one. Oh, yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "22:23-22:27",
    "text" : "Fox was also happened to be broadcasting that night on the same channel."
  },
  {
    "timestamp" : "22:27-22:55",
    "speaker" : "Andy",
    "text" : "Correct. Oh. So The game tonight that they mentioned ad nauseum because it's Fox and so nauseum. So Fox in these days was all about uh any football game being just a a really long commercial for whatever baseball game they're gonna broadcast. But the game they were broadcasting that night, I think seven thirty, was game four of the two thousand four ALCS. Oh, that's the best one."
  },
  {
    "speaker" : "Steve",
    "text" : "It's it's coming right off the Red Sox. Remember the game Red Sox trying not to get sweats.",
    "timestamp" : "22:55-23:00"
  },
  {
    "speaker" : "Greg",
    "text" : "Ridiculous.",
    "timestamp" : "23:00-23:01"
  },
  {
    "text" : "There is so many bullshit ass references to how much the Red Sox suck.",
    "timestamp" : "23:01-23:07",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "23:07-23:07",
    "speaker" : "Andy",
    "text" : "Yep."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "23:08-23:10",
    "text" : "And how the Patriots game."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:10-23:34",
    "text" : "They did suck. They well they had just lost 19 to 8 the night before. Yeah. So But uh yeah, there was a lot of um here we go. Uh the one quote that I wrote down, Steve, was I don't know if anything can really ease the pain of what the Yankees are doing to the Boston Red Sox in the ALCS, which you'll see tonight on Fox But you know, the pages have won fucking 20 games in a row."
  },
  {
    "timestamp" : "23:35-23:50",
    "speaker" : "Greg",
    "text" : "Oh man. That's awesome. Yeah. Because true. I mean, like if anyway If that would be happening right now, I would say this is just embarrassing. You know, like, yeah. No, that that was perfect part of it because you no one saw that coming. No, we don't know."
  },
  {
    "text" : "Sop though, of like it's a done deal. The Yankees are fucking deal.",
    "timestamp" : "23:50-23:57",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "23:57-24:00",
    "speaker" : "Andy",
    "text" : "No, no team had ever come back from three three games down."
  },
  {
    "text" : "I get that, but man, they fucking uh laid it on. Thick.",
    "timestamp" : "24:00-24:04",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:05-24:05",
    "text" : "It was on thick."
  },
  {
    "speaker" : "Steve",
    "text" : "It was every five minutes they're referencing it. And you're just like, okay, we get it. Like, isn't there a football game going on right now?",
    "timestamp" : "24:06-24:13"
  },
  {
    "text" : "I mean, not in the first half no. Um, but Yeah, uh there there was one person who would disagree with you, Greg. And I tried to get him on on the pod. Uh but it was it was a late uh I only realized it late, so I I couldn't uh get a hold of him. But no, your father, Mick Brown. Oh I this I remember this day because we were watching this Seattle Seahawks game. And we're shooting the shit about the Red Sox. And he turned to me and says, if you're gonna break an 86 year old uh 86-year curse, there's only one way to do it, and that's to come back from three games down to the Yankees. And to win that series and then win the World Series. So Mick Brown. He literally called it in the middle of this game that we're we're recapping today.",
    "speaker" : "Andy",
    "timestamp" : "24:13-25:03"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "25:04-25:08",
    "text" : "So yeah, I tried to get him on, but I think it's not impressed."
  },
  {
    "text" : "I'm not impressed too. People say that shit all the time. It's like the dude that goes like You know, this one's going out of the out of the park when someone gets the bat. Yeah. And does it like six times a game and then finally it happens?",
    "speaker" : "Greg",
    "timestamp" : "25:08-25:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Like, dude, I called that. I called that. Right. But except you know who your father is, and he's not exactly the uh the prognostic.",
    "timestamp" : "25:20-25:28"
  },
  {
    "timestamp" : "25:29-25:31",
    "text" : "It's not like he believed that. He wouldn't have put money on that.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "25:33-25:36",
    "text" : "You'll have to ask him. I'm not gonna speak for him",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:37-25:40",
    "speaker" : "Greg",
    "text" : "He definitely didn't believe the Red Sox were gonna win."
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know. You'll have to you'll have to bring that up with him.",
    "timestamp" : "25:40-25:43"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, the commentators believe that Roderick Clemens is the GOAT. They were talking seriously about him being the best baseball player of all time.",
    "timestamp" : "25:43-25:51"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "25:52-25:52",
    "text" : "Yo, I'm taking a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit."
  },
  {
    "timestamp" : "26:01-26:01",
    "speaker" : "Andy",
    "text" : "Do it."
  },
  {
    "speaker" : "Greg",
    "text" : "Do it. You're going in that early. Fifth round. Fourth pick? Do it. Fifth pick. Yeah, I have I need a second running back. It's my fifth pick.",
    "timestamp" : "26:04-26:10"
  },
  {
    "text" : "Who else is out there?",
    "timestamp" : "26:11-26:12",
    "speaker" : "Steve"
  },
  {
    "text" : "Case Edmonds, Kareem Hunt, Miles Gaskin, Raheem Mostert might have a good year, Leonard Fournette. These are all fucking schlubs. Garbage. And Dream Hunt or feed me. You know? Let's go. Dude, I'm hyped to get Harris. All right. Uh speaking of the good Patriots running backs. Well, can we go back to the Red Sox one second? Because this will be a story for Steve is I had gym class with Jeff Carr throughout this this time period, this series And we were both huge Red Sox fans at the time. And like every day we'd come in like, man, this sucks, this sucks. And then they'd win and then you'd come in the next day and be like, oh maybe a chance. And then the next day at school you team in be like, dude, two in a row. We could do this. Like just the building of like enthusiasm throughout the week. Oh yeah. Like before like social media, you know, like That was something that I miss is like the old school like everyone gets to school and talks about the game from the night before. Like that was just such a cool thing to experience like being in high school when they did that was awesome. Well now you have your uh fantasy football group chat, so you're good, Greg. Yeah exactly. Now I can get angry about it when people How the world is jaded, man. Oh god. You just hate technology. Aluddite.",
    "timestamp" : "26:12-27:39",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "27:39-27:40",
    "speaker" : "Andy",
    "text" : "A Luddite, indeed."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah Oh by the way, Steve, did you have trouble with your computer today logging on? No, I just had to restart it. It was fine. Oh, interesting. Thought I was the only one that had technical problems.",
    "timestamp" : "27:41-27:55"
  },
  {
    "timestamp" : "27:55-28:03",
    "text" : "Well he wasn't a problem. You know, I gave myself a little buffer before the episode started because I knew you were gonna be late anyway. So exactly",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "28:08-28:29",
    "text" : "Right. It's Domino's fault, dude. They told me 717 would be ready. It was not ready at seven seventeen. How dare they? How dare they? On Labor Day, no less. On Labor Day no less. Should file a complaint. That's some poor laboring. Yeah, man. Guy asked me my name three times too.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "28:29-29:18",
    "speaker" : "Steve",
    "text" : "I was like how dick deer Greg The quarterback of the Seahawks' time I was Matt Hasselbeck, which they he's like Ryan Fitzpatrick, where where'd he go to school? Where'd he grow up? You know? Oh yeah. New England baby. They blew that storyline just over and over. But they're coming home, but He wasn't getting a hometown reunion. Do you see that clip of the mini green monster he had in his his yard in his doorway? Oh my god, yeah. That thing was sweet. It wasn't though. It was a fucking it was a fence painted green, dude. Come on, dude. That thing was sweet. It was a yard. It wasn't nearly as cool as the van we painted. I mean that's how you know he's like legit. You're a hater, Andy. Yeah. What do you well how you hate I'm at I mean Matt Matt Hasselback? What's that's why? Why Matt Hasselback?"
  },
  {
    "text" : "I got I got no reason. I can I can just say fuck whoever I want. This is my pocket",
    "timestamp" : "29:18-29:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Dude, the dude has a fucking mini monster head.",
    "timestamp" : "29:22-29:24"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, did you ever hear shitting on him? Dude, he was such a wild bitch in this game.",
    "timestamp" : "29:24-29:28"
  },
  {
    "timestamp" : "29:28-29:41",
    "text" : "Dude, he went to Zavrin. What? I don't know. Isn't that like a famous fucking high school football or something? I don't know. No, the high school football. Oh. I think that's like a big one in that area. Sure.",
    "speaker" : "Greg"
  },
  {
    "text" : "And he played decently well in this game.",
    "timestamp" : "29:41-29:44",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "He was running around like he's pretending to be Brett Favre in this game.",
    "timestamp" : "29:44-29:47"
  },
  {
    "timestamp" : "29:48-29:50",
    "text" : "Yeah. Yeah. Like I said decently well.",
    "speaker" : "Steve"
  },
  {
    "text" : "What about Tim Asselbeck? Do you like him, Andy?",
    "speaker" : "Andy",
    "timestamp" : "29:50-29:52"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "29:52-29:52",
    "speaker" : "Steve"
  },
  {
    "text" : "Like any of the Hasselbeck bros?",
    "speaker" : "Greg",
    "timestamp" : "29:53-29:54"
  },
  {
    "text" : "No, I'm not a big fan of the Hasselbeck family in general.",
    "timestamp" : "29:54-29:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "29:57-30:34",
    "text" : "What about Grace Elizabeth Hasselbeck? Oh, she's the worst. Who is she? What about Isaiah Timothy Hasselbeck? Isaiah's cool. Those are Tim's children. Cause his brother went to Boston College too, right? And then did he play in the NFL? Maybe it's like I know they were like a football family. Yeah, he played four years. For who? Philly, Washington, Giants, Arizona. Didn't really start though, right? He attempted 177 passes in his whole career all in one season. Oh boy."
  },
  {
    "text" : "So okay, so he's that guy.",
    "timestamp" : "30:36-30:37",
    "speaker" : "Andy"
  },
  {
    "text" : "Poor Tim. He's like you, Steve, like just the least athletic of the brothers. But the coolest. Well Andy did say he liked Tim more than Andy likes me more than you.",
    "timestamp" : "30:37-30:53",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "It's really what he's saying.",
    "timestamp" : "30:53-30:54"
  },
  {
    "timestamp" : "30:54-31:03",
    "speaker" : "Greg",
    "text" : "Oh, there's that's actually a third. There's a third. The forgotten Hassleback, Nathan. Oh yeah, that's definitely Steve. Nathaniel, sorry. Oh boy."
  },
  {
    "speaker" : "Andy",
    "text" : "Wasn't there uh was it one of the hasslebacks that started like um like an app? That was supposed to tell you like what the best time to pee during a movie was. I think that was a hassleback. I think it was Tim.",
    "timestamp" : "31:03-31:17"
  },
  {
    "timestamp" : "31:17-31:22",
    "speaker" : "Steve",
    "text" : "What? Let's get back to the game. Let's get back to the game. Golly."
  },
  {
    "speaker" : "Greg",
    "text" : "Like at a movie theater? Because couldn't you just pause it? No, like at a movie theater. Run P app.",
    "timestamp" : "31:22-31:27"
  },
  {
    "timestamp" : "31:27-31:28",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Run P",
    "timestamp" : "31:28-31:28"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Well, how do they decide what's the best time? Uh when there's the least amount of action and like the least amount of plot stuff happening, which is like the filler stuff.",
    "timestamp" : "31:30-31:39"
  },
  {
    "text" : "Okay.",
    "timestamp" : "31:40-31:40",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Um",
    "timestamp" : "31:40-31:41"
  },
  {
    "speaker" : "Steve",
    "text" : "I feel like that's most movies, just pee whenever you want, buddy.",
    "timestamp" : "31:41-31:45"
  },
  {
    "text" : "Apparently not. Uh you guys continue talking. I'm gonna find out who who uh did this. Speaking of movies, you're gonna see Dune, Steve?",
    "timestamp" : "31:45-31:53",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:53-31:58",
    "speaker" : "Steve",
    "text" : "No. Why not? I don't even know what Dune is. I don't know where they watch movies."
  },
  {
    "text" : "Oh, it's like a Star Wars. It's like one of the original sci-fi books. Yeah, I know. They run like okay. I just read it. What did you say? I loved it. Yeah, reading it. It was a bit it was a bit meandering at times. Mm-hmm. And they got like somewhat pretentious overall. Yeah. There's all this philosophy bullshit in it, which I wasn't I could have done without, but the world building, as they say in the sci-fi community, was excellent.",
    "timestamp" : "31:59-32:29",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "32:31-32:39",
    "speaker" : "Steve",
    "text" : "You know who's a fucking beast that we haven't even talked about when we're like an hour into this? Probably maybe even the best player on the Seahawks."
  },
  {
    "timestamp" : "32:39-32:40",
    "speaker" : "Greg",
    "text" : "Sean Alexander."
  },
  {
    "speaker" : "Steve",
    "text" : "Exactly.",
    "timestamp" : "32:40-32:41"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:41-32:41",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. That guy flew under the radar hardcore.",
    "timestamp" : "32:41-32:45"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Dude, he won an MVP.",
    "timestamp" : "32:45-32:47"
  },
  {
    "text" : "Yeah. And he said an NSL rushing record.",
    "timestamp" : "32:47-32:49",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "32:50-32:50"
  },
  {
    "text" : "Wait, no, he didn't. For sure he had the NFL Russian record at some point. It was broken soon after, but for a couple years he had the most yards.",
    "speaker" : "Steve",
    "timestamp" : "32:50-32:58"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, before Priest Holmes, maybe, right? Him and Priest Holm the back.",
    "timestamp" : "32:58-33:02"
  },
  {
    "speaker" : "Steve",
    "text" : "We already talked about this in this podcast, I'm pretty sure.",
    "timestamp" : "33:02-33:04"
  },
  {
    "text" : "Yeah, it sounds familiar. Yeah, maybe nothing. Still, that's a result two thousands where the the And and leading the way for him, the fullback.",
    "timestamp" : "33:04-33:20",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "33:20-33:21",
    "text" : "Mac Strong."
  },
  {
    "text" : "Oh yeah, there was some good uh there was some good names in this team.",
    "timestamp" : "33:22-33:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "33:25-33:32",
    "text" : "Mac Strong, dude? Mac Strong the fullback. Wait, is it strong or strong? Strong. Like strong."
  },
  {
    "timestamp" : "33:34-33:35",
    "text" : "Like yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know how you get a better name than that for a fullback.",
    "timestamp" : "33:36-33:38",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, Mac truck. Yeah. Like literally, what else could he be do he could he do as a job? Mac Strong, a bouncer maybe?",
    "timestamp" : "33:38-33:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "33:46-33:48",
    "text" : "Wasn't there a Heath Evans sighting in this game too?"
  },
  {
    "timestamp" : "33:49-33:49",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, yeah."
  },
  {
    "text" : "On special teams. He fucking laid some dude out and they highlighted it. Twice. Yeah.",
    "timestamp" : "33:50-33:54",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Yeah. He was like the wedge guy in the uh On the special teams.",
    "timestamp" : "33:54-33:58",
    "speaker" : "Andy"
  },
  {
    "text" : "He's sitting behind Max Strong and Belchek saw his special teams tape and then said, you know what, we need to get this guy on the team.",
    "speaker" : "Steve",
    "timestamp" : "33:59-34:04"
  },
  {
    "timestamp" : "34:04-34:21",
    "speaker" : "Andy",
    "text" : "No, other way around. He was on the Patriots before. Really? Yeah, he was uh at the beginning, like when we first started doing this, he was like the weapon that shows you how much attention I play. Yeah, no kidding. Shocking. Um"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "34:22-34:24",
    "text" : "Lisa watching Greg."
  },
  {
    "timestamp" : "34:25-34:25",
    "text" : "Mm.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "34:26-34:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly. Oh man.",
    "timestamp" : "34:27-34:29"
  },
  {
    "timestamp" : "34:30-35:20",
    "speaker" : "Greg",
    "text" : "I was looking up Max Strong. He's a bit of a he suffered a herniated disc in his vertebrae in a game against the Steelers. The injury was said not to be life threatening if Strong discontinued his playing of football. Okay. But did he? Yeah, he retired. Okay. All right. Jesus. That's what I was hoping it was like he continued playing until the doctor gave the doctor a wedgie. And ran back on the field. Oh, we got another person that picked incorrectly. Oh good. Pause the draft. God damn it, Dave. Pay attention, Dave. God damn it, Dave. Yeah. Sorry, he said my bad fam."
  },
  {
    "speaker" : "Andy",
    "text" : "Speaking of people we hate, uh Matt Hasselback coming into this game uh had actually been pretty good. He the He's good. The uh the Seahawks started off pretty hot this. They started off 3-0 and then lost a heartbreaker to the Rams. Um, but they're I think it was mostly on their defense because And the first three games, they gave up a combined 13 points. And then they had to buy a week. And then the next three games, they averaged almost 30 points per game against. But As part of that like beginning doing well, Matt Hasselback hadn't thrown an interception in his last 88 attempts coming in, which I think is pretty good. Probably a couple of weeks worth there, right? Maybe start off the season without throwing a interception yet. Um, and then immediately threw two interceptions and four pass attempts in the first quarter. So That went right out the window.",
    "timestamp" : "35:21-36:15"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "36:15-36:16",
    "text" : "Defense was nasty."
  },
  {
    "timestamp" : "36:16-36:20",
    "text" : "Typical Matt Hasselbeck, if you ask me. This defense was typical.",
    "speaker" : "Andy"
  },
  {
    "text" : "Excellent.",
    "timestamp" : "36:21-36:22",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "36:22-36:29",
    "text" : "This is one of the best defenses. All right, if you're going to draft a quarterback in the sixth round, because that's also when Hasselback got drafted, who do you pick? Him or Brady? Steve.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Dude, the first play was a sack. Yeah, it was. And he had that whose fault was it? Willie, who got fooled on the screenplay, tipped it up to Richard. Other way around on like the first drive or the second drive.",
    "timestamp" : "36:29-36:42"
  },
  {
    "timestamp" : "36:42-36:42",
    "speaker" : "Andy",
    "text" : "Yep."
  },
  {
    "timestamp" : "36:43-36:45",
    "speaker" : "Steve",
    "text" : "This defense was sweet."
  },
  {
    "text" : "Yeah, this this defense was sweet.",
    "speaker" : "Andy",
    "timestamp" : "36:45-36:46"
  },
  {
    "timestamp" : "36:47-36:53",
    "text" : "Tyla interception forced by Rodney Harrison's corner blitz or safety blitz. Like they're all over the place.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:54-37:36",
    "text" : "But it was just like a lot of it, especially in the first half, was just like this Seahawks team look like they didn't come to play. Like they're making a whole bunch of mistakes. Like you said, that sack was just like a free rush on the first play. Um and they had they they were moving the ball on offense for the most part. Um but they had Corin Robinson at this point, who was supposed to be like their weapon. Um I think he probably would have been if you could catch the ball. Yeah. Because I mean, even in this game, let's see. He played quite well. Uh nine catches for 150 yards. Uh, but on thirteen uh targets. I mean that's actually decent, but like he was not."
  },
  {
    "text" : "Except he came out of Michigan.",
    "timestamp" : "37:36-37:38",
    "speaker" : "Steve"
  },
  {
    "text" : "He's all thirteen of those targets hit him directly in between the numbers.",
    "timestamp" : "37:38-37:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, because Matt Hasselbeck is good, is what we're saying, right?",
    "timestamp" : "37:43-37:45"
  },
  {
    "text" : "No, he doesn't throw a catchable ball apparently.",
    "speaker" : "Andy",
    "timestamp" : "37:46-37:48"
  },
  {
    "text" : "Either Matt Hasselbeck sucks or receiver sucks. You've got to take one position. You can't be on both. Oh, Andy's",
    "timestamp" : "37:49-37:55",
    "speaker" : "Steve"
  },
  {
    "text" : "He's weaving the tangled web here. It's both. Haven't you ever heard of throwing a catchable ball, Steve?",
    "speaker" : "Greg",
    "timestamp" : "37:55-38:00"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "38:01-38:06",
    "text" : "Hit him in the hands, that means the quarterback sucks, but he dropped it because that means the receiver sucks."
  },
  {
    "text" : "It's both Just because he can hit a guy in the chest doesn't mean nothing.",
    "timestamp" : "38:06-38:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Fucking idiot, Andy. He had one decent season, Corin Robinson, 78 catches for 1240. That's pretty good. Which season was that? Two thousand and two.",
    "timestamp" : "38:10-38:20"
  },
  {
    "text" : "Oh, so a couple years before this.",
    "timestamp" : "38:21-38:22",
    "speaker" : "Andy"
  },
  {
    "text" : "Yep. Okay. Yeah, he went pretty steadily downhill after that. That feels right. By the way, I made a boo-boo. Remember George Kittle? Yeah. My keeper was Darren Waller. I fucked up. I fucked up. If they had just let me add my keeper to start with, I would have remembered that. Dummy. Oh my god. I hate this league and I hate fantasy. That's why I don't play anymore. I'll just put him in the flex. Double tight end. I'm on the Patriots.",
    "timestamp" : "38:23-38:53",
    "speaker" : "Greg"
  },
  {
    "text" : "You're running that 12 personnel.",
    "speaker" : "Andy",
    "timestamp" : "38:53-38:55"
  },
  {
    "text" : "The guys trade them too.",
    "timestamp" : "38:56-38:57",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Love it. Trade him for a King's Ransom. Everybody needs a tight end. Hunters. Because there's only still out there. Three good ones out there. Oh yeah. See? Pick them all up, Greg. Yeah. Uh all right, what else? Um Tom Brady.",
    "timestamp" : "38:58-39:15"
  },
  {
    "speaker" : "Greg",
    "text" : "Should we talk about Sean Alexander?",
    "timestamp" : "39:16-39:19"
  },
  {
    "text" : "Yes, that's why I said Tom Brady. Pause because I want to talk about Sean Alexander. We always talk about Tom Brady.",
    "timestamp" : "39:21-39:27",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "39:27-39:28",
    "text" : "Let's talk about the other team."
  },
  {
    "timestamp" : "39:28-39:30",
    "speaker" : "Andy",
    "text" : "Well Tom Brady took some lumps in this game."
  },
  {
    "speaker" : "Greg",
    "text" : "Let's talk about the I don't care. Yeah, he got his chin strap knocked off, right?",
    "timestamp" : "39:31-39:36"
  },
  {
    "text" : "Dude, he Well, he split his chin open again from having He had um he got roughed up the week before and had stitches in it and they popped the stitches in his chin, scrambling and getting he got lit up and he fumbled it. Did you see his chin strap come off?",
    "speaker" : "Andy",
    "timestamp" : "39:37-39:53"
  },
  {
    "text" : "They showed it on prime time. His whole helmet popped off. Yeah, his helmet popped off, but then the chin strap broke off the helmet. Holy shit. And went like flying five yards off the helmet. Yeah, the hit was brutal.",
    "timestamp" : "39:53-40:06",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "It's like the uh Nate Clemens hit. From the Buffalo game. I think this one was like that, but worse. He could because he can sandwich. He gets like the high low sandwich.",
    "timestamp" : "40:06-40:15"
  },
  {
    "text" : "Yeah, and blindsided by the guy that hit him high.",
    "timestamp" : "40:16-40:19",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "40:19-40:19"
  },
  {
    "speaker" : "Andy",
    "text" : "But you think it was a dirty hit?",
    "timestamp" : "40:20-40:21"
  },
  {
    "text" : "I mean Tom Brady just trying to go for the first down instead of sliding. Yeah. Tom Brady running like a wounded uh especially that time of the NFL, like of course he's gonna get Blasted. Yeah. But that dude, he was a defensive end, came trucking around from the other side and legit launched himself shoulder height. He was like. Parallel coming in there.",
    "speaker" : "Steve",
    "timestamp" : "40:21-40:45"
  },
  {
    "timestamp" : "40:45-40:47",
    "text" : "Yes. Fuck yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "That might be the hardest hit I've ever seen Brady take.",
    "speaker" : "Steve",
    "timestamp" : "40:47-40:50"
  },
  {
    "text" : "Well, yes. I think I think you're probably right.",
    "timestamp" : "40:50-40:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:54-41:20",
    "text" : "His head, his helmet goes flying off. He fumbles the ball. Yeah, that was bad. They recover it. They go three and out because our defense is a base. Right. Tom Brady gets it back. Throws an interception immediately. Because he still can't see straight, probably. Yeah. I yeah, I would imagine. He's still struggling. He is all day on that pick too. He's just standing there patting the ball, patting the ball, patting the ball. Throws a dumb pick."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:21-41:37",
    "text" : "Yeah, throws it right at the linebacker. Yeah, it was a kind of a game of two halves in this one where the Patriots like didn't punt in the first half and then didn't score really until right at the end in the second half."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "41:39-41:48",
    "text" : "But I mean, it didn't matter because they built up a 20 to 6 lead. Yeah, that little sequence there got Seattle back into it. The final was 30 to 20, but"
  },
  {
    "timestamp" : "41:49-42:56",
    "speaker" : "Andy",
    "text" : "But it was at yeah, it was uh it was actually pretty close until the they were only down by three by the end of it. Um Seahawks were it was uh yes 2320. And they had kind of like scraped back in, yeah. And so I feel like because that even the the commentators were touching on the fact that like, yeah, the Patriots have like they've they've won nineteen in a row coming into this. But their average margin of victory was nine points. So they're not blowing anybody out. And they posted a um A little uh Chevron thing. And it was a 19-game win streak, 10 wins by eight points or less. They were they trailed or were tied in the fourth quarter in eight of those games, and two of the wins were in overtime. So it wasn't like some hugely dominated thing. They just figured out how to pull games out in the end, which is exactly what happened here. Like they built up a big lead at halftime. And then the Seahawks clawed their way back into it. And so the Pats are only up by three. And it's they got the ball back with three minutes left, the Patriots did. Up by three."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "42:56-43:00",
    "text" : "And they just throw it on first down incomplete."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:00-43:06",
    "text" : "Yep. Run it straight up the middle for two yards on second down. Timeout. Seattle. Yep. And then what happened?"
  },
  {
    "text" : "Third down and seven.",
    "timestamp" : "43:07-43:09",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:09-43:29",
    "text" : "Yeah. And Tom Brady rolls out to his left on the next play. Designed rollout to the left to the opposite side of like the way he would throw it normally. So he's throwing a against his body and only chucked it like 50 yards on a rope to a diving Bethel Johnson for a first down at the 25-yard line."
  },
  {
    "speaker" : "Steve",
    "text" : "Who had not played last week because his attitude wasn't good enough and he didn't even dress.",
    "timestamp" : "43:29-43:34"
  },
  {
    "timestamp" : "43:34-43:50",
    "speaker" : "Andy",
    "text" : "Right, because uh the Patriots are also without um Dion Branch and Troy Brown in these past few weeks. Yeah. So they're dressing uh literally the number one wide receiver on this team right now. David Patton."
  },
  {
    "timestamp" : "43:50-43:51",
    "speaker" : "Steve",
    "text" : "Yeah. Yeah, he was."
  },
  {
    "speaker" : "Andy",
    "text" : "That's kind of all they had. And David Patton had a a couple of nice catches, but that's like all there was. Available to Brady.",
    "timestamp" : "43:52-44:00"
  },
  {
    "speaker" : "Steve",
    "text" : "Inside three minutes, his first target, his only catch. Yeah. 48 yards. Yep. On a third and seven from your own. Yeah. 30. Right, yeah.",
    "timestamp" : "44:00-44:11"
  },
  {
    "text" : "Yeah, 30 something.",
    "speaker" : "Andy",
    "timestamp" : "44:12-44:12"
  },
  {
    "text" : "Just they just bombed it down there. An awesome play. It was fun.",
    "timestamp" : "44:13-44:16",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:17-44:18",
    "speaker" : "Andy",
    "text" : "Yeah, it was so good."
  },
  {
    "timestamp" : "44:18-44:24",
    "speaker" : "Steve",
    "text" : "They got him so hard on the run fake to it, and it's just like Bethel versus some guy who's just not as fast."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:24-44:43",
    "text" : "Yeah, the deep safety. You could see the fear in his eyes as soon as he saw what was happening. Um then two plays later, Corey Dillon running in for his second touchdown of the game. And that was the play, I believe they said, that put him over 100 yards for the game, too. So he finished with 105 and two touchdowns. Not too bad."
  },
  {
    "timestamp" : "44:43-44:45",
    "text" : "He had a sweet Gronk spike on that touchdown.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:45-44:47",
    "text" : "Yes, he did. He was super excited.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "44:47-44:51",
    "text" : "You know who was also excited? Brady was fucking all up in his grill."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:51-44:52",
    "text" : "Up in his grill."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Awesome. They showed a nice little replay of that bomb to uh Bethel of Daniel Graham with a little cleanup law keeping the main.",
    "timestamp" : "44:52-45:03"
  },
  {
    "speaker" : "Andy",
    "text" : "Daniel Graham, he actually had um a couple of good plays here because he bailed him out on another third long third down too. Um that I think was Oh yeah, that that was again in the fourth quarter. Um it was a like a 20-yard play to Graham on third and ten, which is what ended in a in the field goal. So those two catches result in the ten points that the Patriots won by. How about that? Yeah, you should draft Corey Dillon, Greg.",
    "timestamp" : "45:03-45:33"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "45:34-45:39",
    "text" : "I drafted weird Patriots names that I saw and I was like, who the fuck are them?"
  },
  {
    "speaker" : "Andy",
    "text" : "Which guy? Who the fuck are they? I can think of one.",
    "timestamp" : "45:40-45:44"
  },
  {
    "timestamp" : "45:44-45:45",
    "speaker" : "Steve",
    "text" : "Well, who you got?"
  },
  {
    "text" : "Abdullah? Yes. Yep, I knew he'd be one.",
    "speaker" : "Andy",
    "timestamp" : "45:45-45:49"
  },
  {
    "text" : "Rab Rabbi?",
    "timestamp" : "45:51-45:52",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "45:53-45:56",
    "speaker" : "Andy",
    "text" : "Rabbi, yeah. R-A-B-I-H. Rabbi Abdullah."
  },
  {
    "speaker" : "Steve",
    "text" : "Who is the other one? He has this season I looked it up. He has 13 carries for 13 yards and one touchdown.",
    "timestamp" : "45:56-46:06"
  },
  {
    "text" : "Cool, Abdula? Yeah, uh he had a touchdown a couple weeks ago, I think.",
    "timestamp" : "46:06-46:09",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, I missed that.",
    "speaker" : "Steve",
    "timestamp" : "46:10-46:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:11-46:11",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "He's his only catch of the season in this game. Yeah.",
    "timestamp" : "46:12-46:15"
  },
  {
    "timestamp" : "46:15-46:15",
    "text" : "And it wasn't.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "The other was a Patriots number 10. And um, you know, I I just have my eyes out for number 10 now, you know?",
    "timestamp" : "46:16-46:23"
  },
  {
    "speaker" : "Andy",
    "text" : "Right, right, right. Uh recent news.",
    "timestamp" : "46:24-46:27"
  },
  {
    "timestamp" : "46:27-46:28",
    "text" : "Casper with a K.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:29-46:54",
    "text" : "Oh yeah. Um he was a street free agent that they picked up because um the pages were so thin at wide receiver. I I think it was last week when they sat Bethel. They literally picked this guy up and started him in fr instead. And he was like wasn't on the team on Thursday and was starting on Sunday. And so you could tell he didn't actually know like what routes he's supposed to be running."
  },
  {
    "text" : "I thought he's a quarterback.",
    "speaker" : "Greg",
    "timestamp" : "46:55-46:57"
  },
  {
    "timestamp" : "46:57-47:01",
    "speaker" : "Andy",
    "text" : "No, I don't think so. I think he's uh he was a street free agent wide receiver."
  },
  {
    "text" : "Wow.",
    "speaker" : "Steve",
    "timestamp" : "47:01-47:01"
  },
  {
    "text" : "That played a little bit. The week before, and uh that's probably it. Well, I don't think we'll see. That's a pretty good average.",
    "timestamp" : "47:02-47:14",
    "speaker" : "Andy"
  },
  {
    "text" : "He has no catches and three targets.",
    "speaker" : "Steve",
    "timestamp" : "47:14-47:17"
  },
  {
    "text" : "Yeah, yeah. I think all three targets came last week. I don't think you'll see much of him again. Uh another thing of note in this game, Greg Brown, this one's for you. Ty Law got his 36th interception of his career. Which ties him with Raymond Claiborne for first on the pets all time.",
    "speaker" : "Andy",
    "timestamp" : "47:17-47:32"
  },
  {
    "timestamp" : "47:34-47:35",
    "text" : "Was it a nice one?",
    "speaker" : "Greg"
  },
  {
    "text" : "It wasn't in the highlight package. It was a diving grab. It was.",
    "timestamp" : "47:35-47:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "47:39-47:42",
    "text" : "It was a lot of Rodney on the blitz."
  },
  {
    "text" : "Yeah. The throw was early. It was one of those ones where, you know, it's Ty Law running the route for the wide receiver. Like before the receiver makes the cut, he's already cutting. And he dove in front of him and the receiver didn't come back to like try break it up or anything, but it was a nice one. He almost had a second one in this game, um, where he did the exact same thing and ran the route and the receiver stopped. Uh but he just like couldn't couldn't bring it in.",
    "timestamp" : "47:42-48:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:06-48:12",
    "speaker" : "Steve",
    "text" : "That one would have been an awesome pick. Yeah, that would have been. Now route for the receiver better than the receiver uh ran it."
  },
  {
    "text" : "Yeah. Uh did you catch uh Ross speaking of Rodney Harrison? They made uh comments on the two-point conversion the Seahawks did to pull it within three. Where um Matt Hasselbach says that um Rodney Harrison is the dirtiest player in the league. And the reason they brought that up was on the two-point conversion there was a flag. And then I saw the referee do uh the roughing the passer motion. I'm like, oh, that's gotta be Rodney. And then they announced that it was roughing the passer, number 37 defense. I'm like, of course it was Rodney. Because that's the the exact type of penalty that Rodney Harrison gets.",
    "speaker" : "Andy",
    "timestamp" : "48:12-48:50"
  },
  {
    "timestamp" : "48:51-48:51",
    "speaker" : "Steve",
    "text" : "Yes."
  },
  {
    "timestamp" : "48:51-48:53",
    "speaker" : "Andy",
    "text" : "A roughing the passer on two point conversion."
  },
  {
    "timestamp" : "48:54-48:55",
    "speaker" : "Steve",
    "text" : "He I mean I'm somewhat deserted."
  },
  {
    "timestamp" : "48:55-49:05",
    "text" : "What do they do there? Do they just replay it? No, uh it got added to the kickoff. So the and the Seahawks just kicked it out of the back of the end zone. So fucking whatever. Right.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:06-49:20",
    "text" : "Um but did you see that did you see that where uh Coron Robinson makes the catch finally because he drops a couple early? Yeah he makes one and The dude legit catches it and just spins it on the ground. Just like just stoked because he finally fucking caught one."
  },
  {
    "timestamp" : "49:20-49:21",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "49:21-49:38",
    "speaker" : "Steve",
    "text" : "And Harrison happened to be standing there and the ball spun through his feet. And he happens to be standing next to a official and he's just like What's up? What's up? How is that not taunting? So they called taunting on him. Yeah, they called taunting on Core Rama. He finally gets like a 20-yard catch and then gets a negative 15-yard beat."
  },
  {
    "timestamp" : "49:39-49:42",
    "speaker" : "Greg",
    "text" : "Taunting was a thing back in this day? This is like the when it"
  },
  {
    "timestamp" : "49:42-49:54",
    "speaker" : "Steve",
    "text" : "First, first just barely. Yeah, wow. I thought it was like manipulating the officials to get a fucking taunting call. Yep. It was not taunting at all. Not even Close to this is the perfect works rule ever."
  },
  {
    "timestamp" : "49:54-49:54",
    "text" : "Oh, ever.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, it's gonna be terrible this year too. Yeah.",
    "timestamp" : "49:55-49:57"
  },
  {
    "timestamp" : "49:57-50:11",
    "speaker" : "Greg",
    "text" : "Taunting, that's what we're concerned about. Yep. Like get real. These are all grown men. Nope, not CTE. We're worried about it. He hurt my feelings because he celebrated too much. Like, what the fuck are we talking about?"
  },
  {
    "timestamp" : "50:13-50:15",
    "speaker" : "Steve",
    "text" : "I mean, I like the targeting rule in college and like the attack."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, yeah. Spinning the balls. Sorry, Greg. We never get it with like fights aren't an issue in the NFL, right?",
    "timestamp" : "50:17-50:28"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "50:28-50:29"
  },
  {
    "text" : "So they're solving a problem that doesn't exist because I would imagine that's why that's there is to stop like fights. Maybe that's why it doesn't exist though.",
    "speaker" : "Greg",
    "timestamp" : "50:29-50:36"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:36-50:38",
    "text" : "That's why there is no way."
  },
  {
    "text" : "This must be the thing I agree with you the most. This is the thing I agree with you the most I can't agree with you more.",
    "speaker" : "Steve",
    "timestamp" : "50:38-50:44"
  },
  {
    "speaker" : "Andy",
    "text" : "All right, well how about this one? What about this one? This is a penalty they called. Shut up, Andy. Just shut the fuck up.",
    "timestamp" : "50:44-50:52"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "50:55-51:11",
    "text" : "Next week to see how much of a blubbering little bitch Greg is on the Patriots Dynasty Podcast. You need to cut off the dynasty podcast to make it a better drop, you know. All right. I have some other ideas about that clip, but that clip has that legs."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:11-51:12",
    "text" : "That thing has legs."
  },
  {
    "text" : "Yeah. Yeah. This is the rough, the rough start of it. Yes.",
    "speaker" : "Andy",
    "timestamp" : "51:12-51:15"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "51:15-51:15"
  },
  {
    "timestamp" : "51:16-51:41",
    "speaker" : "Andy",
    "text" : "The rough draft. But they uh fucking we're doing referees now, so fuck you, Steve. Uh they called I have no referee notes, Andy. So go I got I got one. This is a big one. This is all caps, baby. Uh, you know when uh an offensive player like false starts and so the defensive player goes and just shoves them to make sure the play is over. I love that. I love that. So Colvin did that and they called him for unnecessary roughness."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:42-51:47",
    "text" : "He did dump the dude on his ass, sort of intentionally. He pushed him and then he kept going and then just dumped the dude."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:48-52:01",
    "text" : "He didn't, he just pushed him. It was that was a soft call. Even Chris Collins was like, I've never seen that before. Yeah, Chris Collinsworth is saying it was deserved though. Soft call. That's because Chris Collinsworth is soft, though."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, Andy. Andy, Andy. Andy Andy. Andy Pandy. What else? All right. Should I pick up Sony Michelle here? Yes.",
    "timestamp" : "52:01-52:11"
  },
  {
    "timestamp" : "52:17-52:22",
    "speaker" : "Steve",
    "text" : "Yeah, go ahead. He you know what he showed this year is be able to catch the ball out of the backfield. The Rams are gonna use that a lot."
  },
  {
    "timestamp" : "52:27-52:32",
    "text" : "James Connor. AJ Dillon, Kenyon Drake. No. These are all fucking bums.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "52:33-52:34",
    "speaker" : "Steve",
    "text" : "Yeah, Sony is gonna have a lot of people."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:34-52:39",
    "text" : "I might pick up Sony here. Got him. I never thought I would say that. I might craft Sony."
  },
  {
    "text" : "I'm in a Sony stand my whole life. It's because he's not on the Patriots.",
    "speaker" : "Andy",
    "timestamp" : "52:40-52:43"
  },
  {
    "timestamp" : "52:43-52:44",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Don't draft well you've also already drafted a Patriots running back too.",
    "timestamp" : "52:44-52:47"
  },
  {
    "timestamp" : "52:47-52:59",
    "speaker" : "Steve",
    "text" : "So I always said Sony could catch the ball, he'd be No. I think well I actually in there you knew it was a run. That was his problem. And they spent a first round pick on him."
  },
  {
    "timestamp" : "52:59-53:13",
    "speaker" : "Greg",
    "text" : "Like I would have had way more patience for him if he was like a third or fourth round pick. But to draft a running back in the first round, they need to be a stud. And he just wasn't a stud. He wasn't that first season. He was decent."
  },
  {
    "text" : "Exactly what they needed.",
    "speaker" : "Mom",
    "timestamp" : "53:13-53:14"
  },
  {
    "speaker" : "Greg",
    "text" : "He was decent to win the super yards you needed. But he gave them that Super Bowl in the playoffs. But you can find those players on the side of the street, dude.",
    "timestamp" : "53:14-53:21"
  },
  {
    "text" : "Still, I don't know.",
    "speaker" : "Steve",
    "timestamp" : "53:21-53:22"
  },
  {
    "timestamp" : "53:22-53:35",
    "speaker" : "Greg",
    "text" : "I would pay a first round pick for a Super Bowl win, would you? Yeah. That's exactly and also it was a bad drag. You can say he helped the team win and say it wasn't a great value pick for where they picked him, right? Can we say that? Yeah. All right. That's all I'm saying."
  },
  {
    "speaker" : "Steve",
    "text" : "I was going to say Chubb was right the other the other back in that backfield and widely regarded as the better of the two. And we went against the grain and picked Sony over Chubb.",
    "timestamp" : "53:35-53:43"
  },
  {
    "text" : "But that's because they uh had issues with Chubb's um blitz pickup, which was a big part of the pages offense. And so the for the fact that Sony Michelle, who when's the last time you've seen a rookie",
    "speaker" : "Andy",
    "timestamp" : "53:44-53:56"
  },
  {
    "speaker" : "Mom",
    "text" : "running back start in a New England Patriots offense.",
    "timestamp" : "53:56-53:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh you haven't. So there's a reason for that. And so uh they actually picked up the perfect guy for their offense. So it worked out fine. And also they're picking at number thirty two, which I would argue isn't even that much of a first round pick.",
    "timestamp" : "53:59-54:12"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "54:12-54:51",
    "text" : "He's not borderline second round anyway. What? Because the best the best back in the Pages offense, which we really haven't ever seen, is someone who can catch the ball and run the ball in between tackles. So You know, like Sony when when he was in there, it was clearly a run. And when James White was in there, it's clearly a pass. Like so they they just they told you what they're gonna do, but just by their personnel packages. And I always thought if Sony could catch the ball, he'd be really good. And I feel the same way about Damian Harris. If Damian Harris can start grabbing some balls at the backfield, it'd be really good. And that's why I'm super duper high on Stevenson because he did a lot of that in college."
  },
  {
    "text" : "Ramondre. I'm high on him because I love his name. Ramondre Stevenson.",
    "speaker" : "Greg",
    "timestamp" : "54:51-54:57"
  },
  {
    "speaker" : "Steve",
    "text" : "He's looking Garrett Blunt that can catch balls out the backfield.",
    "timestamp" : "54:58-55:01"
  },
  {
    "text" : "I think he's he's looked way better. Like any have you seen his highlight film?",
    "speaker" : "Greg",
    "timestamp" : "55:00-55:05"
  },
  {
    "timestamp" : "55:05-55:06",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "55:07-55:36",
    "speaker" : "Greg",
    "text" : "Dude, you're fucking kidding me. Dude, the you Very naughty. What Abbott. Sometimes a naughty boy Someone picked a player they shouldn't have picked. Yeah. And then I picked Sony Michelle. They rolled the draft back. Paused it and then that person went back and picked Sony Michelle. Oh party phone. That's a party. This can't be legal."
  },
  {
    "timestamp" : "55:38-55:40",
    "text" : "How can they not figure out the keeper thing?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "55:41-55:54",
    "text" : "While Greg is um is writing the wrongs of of history, Steve, give me some uh give me some other stuff. You want to give it the best and worse? Yeah, give me all right yeah, give me your best on worst. It's about time for that.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I have I have a worst. Okay. And you're gonna love this worst, Andy. Is it Matt Hasselbeck related? No, hasn't it? Maybe I don't remember. It's tangenti related to Matt. It's a commentator quote. Several commentator quotes, actually.",
    "timestamp" : "55:54-56:16"
  },
  {
    "timestamp" : "56:16-56:18",
    "speaker" : "Andy",
    "text" : "Okay. I'm listening."
  },
  {
    "speaker" : "Steve",
    "text" : "And right in my wheelhouse. It's like a soft-ish roughing the passer penalty.",
    "timestamp" : "56:18-56:23"
  },
  {
    "text" : "Mm-hmm.",
    "speaker" : "Andy",
    "timestamp" : "56:23-56:24"
  },
  {
    "text" : "And They say this is what Collinsworth and uh who's the other the other name?",
    "timestamp" : "56:25-56:33",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "56:33-56:36",
    "text" : "Oh, I wrote it down play-by-play guy. Oh, Stockton.",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, Dick Stockton is the worst.",
    "timestamp" : "56:36-56:39",
    "speaker" : "Steve"
  },
  {
    "text" : "He's terrible.",
    "timestamp" : "56:38-56:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:39-56:44",
    "text" : "And they say you gotta keep those quarterbacks in their dresses.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "56:44-56:45"
  },
  {
    "timestamp" : "56:46-56:51",
    "text" : "So they insinuate that quarterbacks I guess cross-dress or are little bitches.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Or are women, basically.",
    "timestamp" : "56:51-56:52"
  },
  {
    "text" : "Yeah, women. And therefore soft and they have to call those penalties more aggressively, which You know, it was a clear roughing the passer penalty in today's day and age. Oh, it was Brady got ragdolled like three seconds after the play. I remember that. And then Stockton chimes in, tight dresses at that. He doubles down with not only you gotta keep him in dresses, but tight dresses.",
    "timestamp" : "56:52-57:19",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "57:19-57:21",
    "speaker" : "Andy",
    "text" : "He wants to see Tom Brady's booty pop."
  },
  {
    "speaker" : "Steve",
    "text" : "What the Dude, that is just if that has happened in this day and age. Oh my god. What do you think mom thinks of that? Very naughty. Yeah, mom. Sometimes a naughty boy. She's gonna write Dick Stockton a fucking angry letter.",
    "timestamp" : "57:21-57:35"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:36-57:37",
    "text" : "A strongly worded letter."
  },
  {
    "speaker" : "Mom",
    "text" : "I feel like it got worse too.",
    "timestamp" : "57:38-57:40"
  },
  {
    "speaker" : "Andy",
    "text" : "It got worse too, I feel like. Because I I was gonna write it down, but they kept on going. I'm like I'm on it for a bit. Yeah, yeah. Yeah. It was it was rough.",
    "timestamp" : "57:40-57:48"
  },
  {
    "speaker" : "Steve",
    "text" : "And it was like the point where like okay, it was should have ended and then like the next play was starting because you thought it was gonna end, and then like the next play snapped, and then you said, Oh tight dresses at that, and you're like, Oh my god.",
    "timestamp" : "57:48-57:57"
  },
  {
    "timestamp" : "57:57-58:03",
    "speaker" : "Andy",
    "text" : "Yeah, we're still on this. Yeah, not something you could uh get away with today without getting being canceled."
  },
  {
    "text" : "Oh. Right. You want my uh big plus?",
    "timestamp" : "58:03-58:08",
    "speaker" : "Steve"
  },
  {
    "text" : "Well my best is Greg has left. I don't think it was on purpose.",
    "timestamp" : "58:09-58:14",
    "speaker" : "Andy"
  },
  {
    "text" : "Technology issues. You know how he works.",
    "timestamp" : "58:14-58:17",
    "speaker" : "Steve"
  },
  {
    "text" : "Perfect. Oh wait, wait, wait, wait. Tune in next week to see how much of a blubbering little bitch Greg is on the Patriots Dynasty podcast.",
    "timestamp" : "58:17-58:27",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "58:27-58:31",
    "text" : "He gets so upset from his fantasy draft he just fucking Yeah, exactly.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "58:31-58:40",
    "speaker" : "Andy",
    "text" : "He's a blubbery little bitch. Uh Alright, what's your best? Give me your best. Also a commentator. Ooh. Yeah, you like that? All right. I'm sensing the theme."
  },
  {
    "timestamp" : "58:40-59:27",
    "speaker" : "Steve",
    "text" : "Yeah, it's Collinsworth talking about Corey Dillon. And he says he gives this offense the physical presence that defense has always had. And I was like, because it's right after his like game. Clinching uh you know touchdown run after they hit that big bomb to fucking uh Yeah, as soon as they hit that all they just they just started feeding Cory Dillon. Yeah, they they they get inside the 12 and they just give it to Cory Dillon and he just takes it all the way in. And he's so right. Like that, like, you know, watching these games over again and like the defense has just been absolutely beast. And then Corey Dillon comes in and he is You're almost like watching Prime Corey Dylan back then. You got an appreciation for how much how physical he has. He just fucking run through people. And it's one of those backs that get stronger as the game goes on."
  },
  {
    "text" : "Like it's almost like he's so fast too. Yeah. But he does. He just like he doesn't really try to avoid anybody. Every once in a while he'll do a juke and you'd be like, holy shit, where'd that come from? But I like I wrote on here, like my one note for Corey Dillon was that he's running heavy. Because that's what it feels like.",
    "speaker" : "Andy",
    "timestamp" : "59:27-59:45"
  },
  {
    "timestamp" : "59:45-59:54",
    "text" : "He just like six guys miss on like a one-yard run, too. Yeah, exactly. But he runs like like third and goal from the one, he gets three yards, sort of thing, you know? Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, exactly. Yeah, even from the one yard line, he's still picking up those three yards.",
    "speaker" : "Andy",
    "timestamp" : "59:55-01:00:00"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:00:00-01:00:00"
  },
  {
    "speaker" : "Andy",
    "text" : "Because he does. He runs like he's a fucking cement mixer.",
    "timestamp" : "01:00:01-01:00:03"
  },
  {
    "speaker" : "Steve",
    "text" : "It makes you think that like it could have been cooler if he'd been there for a long time. Oh my god, yeah.",
    "timestamp" : "01:00:03-01:00:07"
  },
  {
    "timestamp" : "01:00:08-01:00:08",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "But even this season's worth it. Whatever is totally worth it because he's been a beast.",
    "timestamp" : "01:00:09-01:00:15"
  },
  {
    "text" : "And I don't know if you caught this at the beginning of the game, but uh he did all that on uh a bad foot. He came into the game with a footage. They weren't even sure he was gonna play. And all he did was run for a hundred yards and just like absolutely turned men into Like mountains of puddles.",
    "timestamp" : "01:00:15-01:00:31",
    "speaker" : "Andy"
  },
  {
    "text" : "I mean when the when pushkin is shoved, they gave it to him and he fucking just pounded it in a couple times.",
    "speaker" : "Steve",
    "timestamp" : "01:00:31-01:00:35"
  },
  {
    "timestamp" : "01:00:36-01:00:45",
    "speaker" : "Andy",
    "text" : "Did what he needed to do. Love it. Yeah, and look strong doing it. All right, my best in this game, Dan Clecko."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:46-01:00:48",
    "text" : "Stretch Andy."
  },
  {
    "text" : "Defensive tackle, Dan Clecko, lining up in fullback. Leading the way for Corey Dill on both his touchdown runs and also making a catch out of the backfield on third down to convert the uh third down. Did you catch that? He could have been like a beast. Yeah, I feel I don't know. I well, you know what happened is he's a he's a nose tackle, right? Yeah. And then they drafted Vince. Vince Wilfork. Were you ever gonna start in front of that?",
    "speaker" : "Andy",
    "timestamp" : "01:00:48-01:01:12"
  },
  {
    "speaker" : "Steve",
    "text" : "No He's like a super at he's pretty athletic and I feel like he never caught on anywhere else either.",
    "timestamp" : "01:01:13-01:01:17"
  },
  {
    "text" : "Yeah, where did he go? I feel like I remember Because I thought he was a local boy too.",
    "timestamp" : "01:01:18-01:01:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, he went to England, so you gotta like him.",
    "timestamp" : "01:01:26-01:01:29"
  },
  {
    "timestamp" : "01:01:29-01:01:32",
    "speaker" : "Andy",
    "text" : "He was born in New Jersey, went to Temple."
  },
  {
    "timestamp" : "01:01:32-01:01:36",
    "speaker" : "Steve",
    "text" : "Uh his dad played for the Pats then?"
  },
  {
    "text" : "Yeah, it could have been something like that. Yeah, something like that. Yeah, so he played three years in New England, two years in Indy, and then one in Philly.",
    "timestamp" : "01:01:36-01:01:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01:45-01:01:48",
    "speaker" : "Steve",
    "text" : "But I mean he was like athletic for a big boy."
  },
  {
    "speaker" : "Andy",
    "text" : "Didn't really start any of those games. Oh, there's a text from Greg, my internet died. Uh so while I'm doing my best and worst, would you mind texting him that he's a blubbery little bitch?",
    "timestamp" : "01:01:48-01:02:00"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:02:02-01:02:03",
    "text" : "Well, I'll send that to him."
  },
  {
    "text" : "Don't I know it? So yeah, so my best was a Dan Cleco um third down conversion reception, because that's amazing. Uh let's see, what is my worst in this game? I think my worst is uh the politics going on. I don't know if you saw the the pe the sign that people had that was uh Oh it was a bed sheet and it said election 2004 and it had the check boxes the Bush carry and then underneath it was Belcheck with the Belcheck box checked. I'm like, oh, if only you know how bad it's gonna get in this election cycle.",
    "timestamp" : "01:02:04-01:02:44",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, did they punch it through? Was the Chad hanging? That's a real question.",
    "timestamp" : "01:02:44-01:02:48"
  },
  {
    "timestamp" : "01:02:48-01:03:08",
    "text" : "Hey oh. You like that? No, it was just a checkbox. Yeah, that's a good one though. Um I had another best. You did? I mean, is it the fact that the pages have set an official record by um The all-time regular season wins consecutive win streak?",
    "speaker" : "Andy"
  },
  {
    "text" : "Nope.",
    "speaker" : "Steve",
    "timestamp" : "01:03:08-01:03:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Or is your worst effect that they uh consider the the 33, 34 bears to actually hold that record? Before the Patriots.",
    "timestamp" : "01:03:09-01:03:18"
  },
  {
    "timestamp" : "01:03:18-01:03:19",
    "text" : "It's none of that.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:03:19-01:03:19",
    "speaker" : "Andy",
    "text" : "Because that's garbage."
  },
  {
    "timestamp" : "01:03:21-01:03:23",
    "text" : "It's this uh this sequence here.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:03:23-01:03:25",
    "speaker" : "Andy",
    "text" : "This see okay, give me the sequence."
  },
  {
    "speaker" : "Steve",
    "text" : "12 seconds left. Yeah. First and goal from the four.",
    "timestamp" : "01:03:25-01:03:28"
  },
  {
    "timestamp" : "01:03:28-01:03:29",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "Offsides, Brable. Yeah. First and goal from the two. Incomplete. Incomplete. Incomplete. Fourth down, max strong up the middle, no gain. The Patriots, like they they Yeah, I don't know. You could see like after they stuffed that guy on it, like Rodney was just going buckwah, like but that you know stoked, like you could tell like this there's just so much pride in this defense again. Like this defense is so good.",
    "speaker" : "Steve",
    "timestamp" : "01:03:29-01:04:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and we've seen this before. Remember against the Bills, against Drew Drew Bledsoe and the Bills, when the Bills are trying for that garbage time touchdown. And it's a red zone stop and they come up and and stop them.",
    "timestamp" : "01:04:02-01:04:12"
  },
  {
    "timestamp" : "01:04:13-01:04:40",
    "text" : "That's a deep one-nothing game. Exactly. I was gonna say that 31-00-00 random week five game where even if they score, you have a 10-point lead and there's literally four seconds left. Doesn't matter actually, but it matters to like Rodney Harrison and Mike Vrabel and Teddy Bruski and Richard Seymour and they just Ty laws on that tactic. And they yeah, they rise to the occasion. And they're just like, let's go. I love it.",
    "speaker" : "Steve"
  },
  {
    "text" : "It's so good. Yeah. Yeah. That's the swagger you need, right?",
    "timestamp" : "01:04:40-01:04:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Super Bowl this year. That attitude. Yeah. Defense always stepping up. Hopefully that's what we'll see this year. In the preview. Defense. I mean, Donbert Knab had a chance to win it.",
    "timestamp" : "01:04:46-01:04:57"
  },
  {
    "timestamp" : "01:04:57-01:04:59",
    "text" : "Mm-hmm. What happened?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Couldn't get it done.",
    "timestamp" : "01:04:59-01:05:00"
  },
  {
    "timestamp" : "01:05:00-01:05:19",
    "text" : "Nope. What a surprise. So next week, Steve, on this Patriots Dynasty podcast. Who is it? I don't know. The New York Jets who won again in this week. Oh yeah. Isn't it like aren't the Jets real good this year? Jets are undefeated to start the season.",
    "speaker" : "Andy"
  },
  {
    "text" : "Five and oh quarterback? Pennington?",
    "speaker" : "Steve",
    "timestamp" : "01:05:19-01:05:22"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:22-01:05:24",
    "text" : "I think it might be. Yeah, I think it is."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:05:25-01:05:35",
    "text" : "I think it's still Pennington without uh this is him coming back from his his hand injury from the fourth preseason game last year, right?"
  },
  {
    "speaker" : "Andy",
    "text" : "I think so. Is this pre- or post-shoulder issues, I wonder?",
    "timestamp" : "01:05:35-01:05:40"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm sure we'll find out next week. But it is Chad Pennington. That's maybe my favorite jet story of all time.",
    "timestamp" : "01:05:40-01:05:49"
  },
  {
    "text" : "It's pretty good. I mean it's up there with the butt fumble, I think. I think butt fumble you can't top the butt fumble and just how that goes.",
    "speaker" : "Andy",
    "timestamp" : "01:05:50-01:05:57"
  },
  {
    "timestamp" : "01:05:57-01:06:31",
    "speaker" : "Steve",
    "text" : "I mean the butt fumble is it's really Mark Sanchez's fault. But the whole game, everybody who put him in position to make that play, their fault too. But the whole Chad Pennington That is not his fault. That is solely on the Jets as an organization's fault. Maybe. That's why I love it because They had a good quarterback and they just ruined him by playing him in the fourth preseason game. What the fuck are you doing? I just, I just love it. It's so Jets."
  },
  {
    "text" : "It's fantastic. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:06:31-01:06:33"
  },
  {
    "text" : "And they're gonna do the same thing with Zach Wilson. They're gonna ruin him too, just like they did Sarum Darnold.",
    "speaker" : "Steve",
    "timestamp" : "01:06:33-01:06:39"
  },
  {
    "timestamp" : "01:06:39-01:06:44",
    "text" : "Yeah, I mean that's kind of what they do, right? Mm-hmm. And like you can go back and name all the quarterbacks.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:06:44-01:06:47",
    "text" : "They're so dysfunctional, they just take talent and ruin it."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:06:47-01:06:47"
  },
  {
    "speaker" : "Steve",
    "text" : "That's just their MO, and I love it. I love every second of it.",
    "timestamp" : "01:06:48-01:06:51"
  },
  {
    "speaker" : "Andy",
    "text" : "You really do. I do. I can see it in your eyes. Like this is this isn't for radio or anything. Like this is this is how you actually feel.",
    "timestamp" : "01:06:51-01:06:58"
  },
  {
    "timestamp" : "01:06:58-01:06:59",
    "text" : "Yes.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:06:59-01:07:17",
    "speaker" : "Andy",
    "text" : "Yep. I I hear you. All right, so yeah, so next week, the oh, it's at home. So the New York Jets will be traveling to Gillette Stadium. The 5-0 New York Jets. The 5-0 New England Patriots. We'll see how this goes. Next week."
  },
  {
    "speaker" : "Steve",
    "text" : "I wonder what'll happen.",
    "timestamp" : "01:07:17-01:07:19"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know.",
    "timestamp" : "01:07:19-01:07:20"
  },
  {
    "timestamp" : "01:07:20-01:07:32",
    "text" : "Turn in next week to see how much of a blubbering little bitch Greg is. on the Patriots Dynasty Podcast. So until then, we will see you later.",
    "speaker" : "Greg"
  },
  {
    "text" : "See you later.",
    "timestamp" : "01:07:33-01:07:34",
    "speaker" : "Andy"
  }
]