[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:21-01:03",
    "text" : "Welcome back to the Patriots Dynasty Podcast. I am your host, Andy Brown. We are the podcast that is going back and re-watching every game. Of the Dynasty Arab Patriots. We are we've made it through the 2004 regular season, and we are getting to, I'd say one of my sneaky favorite games. The 2004 AFC Championship game. Patriots are having the Pittsburgh, Pennsylvania. The old ketchup bottle itself Rest in peace. Right. Yeah. But with me today, as always, my trusty brothers, Steve Brown, all the way from Virginia. Going on, Steve?"
  },
  {
    "text" : "This is this is exciting. This isn't just a podcast where we do games with names. We do every game, including the games with names. That's right. We'll get to that.",
    "timestamp" : "01:04-01:12",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, fucking paddlement.",
    "timestamp" : "01:12-01:14"
  },
  {
    "text" : "Yeah, so Greg is also here.",
    "timestamp" : "01:14-01:15",
    "speaker" : "Andy"
  },
  {
    "text" : "Greg, how you doing? I'm doing great. Just dandy.",
    "timestamp" : "01:16-01:19",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:19-01:19",
    "text" : "Yeah."
  },
  {
    "text" : "Only two games left, guys. Two games left? Yeah, we're we're stopping after the right.",
    "speaker" : "Greg",
    "timestamp" : "01:20-01:27"
  },
  {
    "text" : "Oh, is that right?",
    "timestamp" : "01:27-01:28",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:29-01:30",
    "text" : "So then one game left?"
  },
  {
    "timestamp" : "01:30-01:57",
    "text" : "I've seen what I need to see, you know. We'll pick this back up in 2016-ish. Yeah. I mean, that is one way of doing it. But then everything I've set up to this would be a lie. And we can't do that to people. Should we trash Ellen? Well topic. Yeah. Yeah. I think uh Steve, you want to uh you you want to give your thoughts on uh Julian Elman or explain what's happening for those that aren't in the know.",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, you think I'm in the know?",
    "timestamp" : "01:57-01:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Well you you came in hot with that. I figured you'd always go steam Greg up.",
    "timestamp" : "02:01-02:04"
  },
  {
    "speaker" : "Steve",
    "text" : "I thought it would trigger him. It did trigger him, but he kept it under control there for a little bit. That's a surprise.",
    "timestamp" : "02:05-02:11"
  },
  {
    "speaker" : "Greg",
    "text" : "Greg, are you feeling all right? Well, it's not just that one. There's another one too. Really? Yeah. See, I am not in the no. I just know about this one.",
    "timestamp" : "02:11-02:20"
  },
  {
    "timestamp" : "02:21-02:22",
    "speaker" : "Andy",
    "text" : "Greg, Greg, catch us up."
  },
  {
    "timestamp" : "02:23-02:54",
    "speaker" : "Greg",
    "text" : "Well, I was watching the the preseason game. And like halftime, they did like a legitimately like a 15-minute segment on a podcast, Pat's from the past. Yeah. And basically that it's like the same thing as what we're doing. They're like, do you want to go back and relive all the greatest Patriots' memories? I was like, yeah. And they like had all these that got infused with Bloodsoe, with Will Fork, all these guys."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:54-03:07",
    "text" : "It's like, this is bullshit. So you know one of the guys that does that, right? Or used to do it, Brian Morey. We've had him on the podcast. Yeah, Greg. Nah. The guy that runs the Patriots Hall of Fame."
  },
  {
    "text" : "He talked about that podcast on our podcast.",
    "timestamp" : "03:09-03:11",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:11-03:14",
    "text" : "Oh, okay. So we already had the idea. Yeah, oh yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "They've been doing it before. All they do is interviews with players. So we're we're actually encroaching on yeah, we're encroaching on their shit by interviewing people like Kevin Falk and Matt Shadow.",
    "timestamp" : "03:15-03:25"
  },
  {
    "timestamp" : "03:26-03:38",
    "speaker" : "Greg",
    "text" : "What's that what's that uh white girl comedian that steals all the jokes? The the one that Amy Schumer? Yeah, we're getting Amy Schumered right now, guys. We are Amy Schumer right now. We're like the fucking Dave Chappelle."
  },
  {
    "text" : "They're the Amy Schumer. We did this first. Well let's let's talk about something we did do first. Greg, you you came up with uh I think actually quite a good I mean especially for you uh idea in terms of rating these games because we were doing it by Uh Lombardi trophies. So out of six Lombardies, how many? And I I think that still works. But you came up with your own system. Remind me exactly what it was. Oh, I don't remember all of them.",
    "timestamp" : "03:38-04:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "04:04-04:38",
    "text" : "Well remember some of them. I guess the take-home point is one of them was The name game where you can you can say three words and define a game like Snowball, right? We all know what game that is. It has a name to it. That's two nice. Yes. Three three words or less, right? Fine. V snowball, Andy. Go fuck yourself. And apparently Edelman's got his fucking nose to the ground here. Yeah, what's what's his podcast called I don't know. Is it something like name game rate?"
  },
  {
    "text" : "Games with names.",
    "speaker" : "Andy",
    "timestamp" : "04:38-04:39"
  },
  {
    "text" : "Games and names. Right. That's what Schumer does. She takes the joke and she just like makes it work. To make it not as good.",
    "timestamp" : "04:39-04:48",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "04:48-04:52",
    "text" : "Yeah. I feel like Hellman might get better guests though than we have."
  },
  {
    "text" : "Uh you would think, but his first episode that came out, the first game with names that they did. The helmet catch. Oh jeez. With guest Eli Manning. Whoa.",
    "timestamp" : "04:52-05:04",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "05:05-05:07",
    "text" : "What are you doing? It's rather disrespectful."
  },
  {
    "timestamp" : "05:08-05:11",
    "speaker" : "Greg",
    "text" : "And like What audience are you trying to get with that?"
  },
  {
    "speaker" : "Andy",
    "text" : "I guess he already has that, right? Did you listen to it, Andy? No. I'm refusing to listen to his podcast until he comes on ours. So I'm going to what I'm going to do is I'm going to find Greg's when he announced his rating system. Uh and I'll I'll share it with you two so we can fucking remember what it is. And I'm going to tweet that at Julian Edelman and all of their podcast related uh accounts until he comes on the podcast. So pair with a bunch of Julian highlights too.",
    "timestamp" : "05:13-05:41"
  },
  {
    "timestamp" : "05:41-05:44",
    "text" : "So you can just this the work for Kevin Fall. Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "05:45-05:55",
    "speaker" : "Andy",
    "text" : "Well yeah, no, we're we're taking a different approach with it with uh Julian Edelman. We're going to shame him into coming on the podcast instead of I don't think it's gonna work, Andy is no shame on Twitter, dude."
  },
  {
    "timestamp" : "05:56-06:02",
    "speaker" : "Steve",
    "text" : "We'll see. That's like the point of Twitter is you just say things without shame. We shall see. It's just a big old session."
  },
  {
    "text" : "Not corporate Twitter though. He's part of corporate Twitter.",
    "timestamp" : "06:02-06:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "He is?",
    "timestamp" : "06:06-06:06"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. He's he's it's all about branding and all that stuff.",
    "timestamp" : "06:07-06:10"
  },
  {
    "timestamp" : "06:10-06:11",
    "speaker" : "Greg",
    "text" : "He is a brander. Yeah."
  },
  {
    "text" : "And he and this podcast is a big brand. You can tell it's got a lot of money behind it. They have a bunch of fancy graphics and shit. So there are fancy graphics, Andy.",
    "timestamp" : "06:11-06:21",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "06:21-06:31",
    "speaker" : "Greg",
    "text" : "Yeah, I think. Well that sounds like three and a half years now. Naughty boy, right? That's right."
  },
  {
    "speaker" : "Andy",
    "text" : "Very naughty.",
    "timestamp" : "06:32-06:33"
  },
  {
    "timestamp" : "06:34-06:38",
    "speaker" : "Greg",
    "text" : "Brilliant. You're all new ones, don't you, Andy, that we haven't heard yet?"
  },
  {
    "timestamp" : "06:38-06:49",
    "speaker" : "Andy",
    "text" : "Uh yeah, we're gonna save those. Okay. But yeah, those will be coming up. Don't you worry about it. But speaking of things we haven't talked about, talk about these Steelers."
  },
  {
    "timestamp" : "06:49-06:53",
    "speaker" : "Greg",
    "text" : "Well this is uh let's talk about let's rate this game then if we're on the topic of the rating system. Yeah, yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "A hidden gem, right? Because that was one of the yeah that was right below name game. What would you call it? The flu game? Ooh, that's not bad. I don't know. The Brady Flu game? Okay. Yeah.",
    "timestamp" : "06:56-07:10"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, yeah, yeah. I think you gotta put a poll out there and if people can recognize what game it is. Okay. All right.",
    "timestamp" : "07:11-07:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:18-07:26",
    "text" : "I will do that, yeah. Let me uh let me make note of that because I have ADHD and I will forget if I don't. He didn't look that sick."
  },
  {
    "timestamp" : "07:26-07:30",
    "speaker" : "Steve",
    "text" : "He did not look sick at all. He did not look sick at all. Ben Rathlessberger looked sick."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "07:30-07:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "07:31-07:33",
    "text" : "But not the good kind of sick, the bad kind of sick."
  },
  {
    "text" : "The flu kind of sick Hung over, kinda sick. To spend too much time in uh barroom bathrooms, kinda sick. Too far?",
    "speaker" : "Andy",
    "timestamp" : "07:33-07:46"
  },
  {
    "text" : "Nope. That's that's all fair game. That's the TV not too long after this airing of this here. He was flying on top of the world. But I did remember a little differently. I remembered I thought Big Ben was like lighting it up this year. Right. But they were talking in the game that he hadn't he'd really cooled off during the season.",
    "speaker" : "Steve",
    "timestamp" : "07:47-08:07"
  },
  {
    "text" : "Exactly. Yeah. He uh it was one of those things where he hadn't lost, but it's almost like defenses had figured him out at this point. Um And so his his splits, I think I have them somewhere. His splits were like not great. Second half. You want a splits?",
    "timestamp" : "08:08-08:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "All right, hang on. Let's hear some fucking splits, dude.",
    "timestamp" : "08:30-08:33"
  },
  {
    "timestamp" : "08:34-09:49",
    "text" : "Let me uh I'm pretty sure I took a screenshot of this, so watch this. Okay, here you go. Hidden the rookie wall this season. First 11 games completion percentage, 67. L 7, not too shabby. Last five games, 59. 4. Not so great. Touchdown and interception ratio, uh 14 to 6 first 11 games. Now it's 4-9. His last five four touchdowns, nine interceptions. So his passer rating went from 103. 2 to 65. 7. And they also had I thought was actually kind of a impressive stat for um, you know, who who are the commentators in this? Jim Damns. Yeah. That was a film. Uh I just made it up. Um yeah, so uh they came out and said that uh because Rossesberger's first pass in this game was like the third play of the game. Uh was an interception to. Quick brand. Eugene Wilson. Eugene. And so that was the first throw of the game for him was an interception. And they said uh in seven of his 15 games that he's played, he's been picked off within the first four throws of the game. Which is that's not good. Kind of bananas. And he also has uh eight interceptions in his last 87 attempts. So he has cooled off considerably.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "This is bad. He also threw one, he threw three picks in this game. Should have shown thrown five.",
    "timestamp" : "09:49-09:55"
  },
  {
    "timestamp" : "09:55-10:14",
    "text" : "Oh yeah, I wrote down that um uh Asante Samuel was dropping interceptions like he's practicing for the Giants Super Bowl. Because he could have had three easily by himself. And th this first one was one of them. It hit it hit him right in the hands and he bobbled it straight up in the air, fell over, and Eugene Wilson dove and caught it.",
    "speaker" : "Andy"
  },
  {
    "text" : "Ralph Burger had some really bad throws in this game.",
    "timestamp" : "10:14-10:17",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "10:17-10:23",
    "text" : "But he but he still hasn't lost a game in 27 games dating back to college.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Right.",
    "timestamp" : "10:23-10:23"
  },
  {
    "timestamp" : "10:23-10:26",
    "text" : "Yeah. Where'd you go to college, Steve?",
    "speaker" : "Greg"
  },
  {
    "text" : "Miami of Ohio?",
    "timestamp" : "10:27-10:28",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "10:28-10:43",
    "speaker" : "Greg",
    "text" : "Yeah, the shitty Miami. Who's Steve? Nicely done. I did not think you were getting back. He would go to Miami of Ohio. He probably thought it was the other Miami. He's like, Yeah, he definitely did Hey guys are going to University of Miami. Dude, I'm gonna get so many bitches there."
  },
  {
    "text" : "It's gonna be party non-stop.",
    "timestamp" : "10:44-10:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "10:46-10:56",
    "speaker" : "Steve",
    "text" : "Guys, where's the beach? Went to the U. Had some dude in his neighborhood go accidentally to Miami, Ohio, and apply accepted him and then had to do his freshman year there before he transferred back."
  },
  {
    "speaker" : "Andy",
    "text" : "I bet that happens all the time. I bet it does. Yeah. Oh my god. Oh, also um Ben Rothsberger's first ever throw in his first ever start was an interception. So true to four. Good throwing peaks.",
    "timestamp" : "10:57-11:11"
  },
  {
    "text" : "Rookie of the year",
    "timestamp" : "11:11-11:13",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "11:14-12:23",
    "text" : "Was it official he was officially yeah? Yeah, offensive rookie of the year. Um but I think The criticism that he wasn't getting is a lot that you see the criticism that Mac Jones got last year as a rookie. Because the Steelers team had I think it was a second ranked rushing offense in the league. Because they had the Deuce is loose. Exactly. So they had Deuce Staley, uh, who started off the season as a starter because Bettis was getting old. And uh actually got hurt in the first Patriots game, week eight, on Halloween, when the uh Steelers blew the doors off the Pats. Uh and then the beta uh the bus drone bettis was, you know, rested and healthy for the first half of the season. So he started running really well. So they showed some stat where Deuce Staley had the majority of the yards, but he had one touchdown in the season and Jerome Bettis had like a quarter of the yards that he had, but he had 14 rushing touchdowns on the season. That makes sense. Right, exactly. Yeah. And and even the commenters like most of those touchdowns are probably within one yard. It was that season.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, fantasy owner's nightmare. Yeah, yeah, yeah. Owning either of those. Dece Staley is he's uh on hard knocks this year? Is he? Coaches? He's a fucking psychopath, dude. Color me shot. The whole the whole staff of the Lions is all ex-players. It's like remember Aaron Glenn from the Jets? Yeah.",
    "timestamp" : "12:24-12:44"
  },
  {
    "timestamp" : "12:44-12:47",
    "text" : "Oh, uh the one that Mike Mellow thought was in the Hall of Fame. Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, he's he's there's still time.",
    "timestamp" : "12:47-12:50",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, could get him for coaching.",
    "speaker" : "Steve",
    "timestamp" : "12:52-12:53"
  },
  {
    "timestamp" : "12:54-12:58",
    "text" : "Yeah, he's the defensive coordinator, and then I think Deu Staley is the offensive coordinator.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:00-13:02",
    "text" : "I think it's gonna be exciting to watch."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "13:02-13:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:03-13:18",
    "text" : "I think they're probably gonna be like the 90s Cowboys, where they're just the most penalized team. Or no not the Cowboys, the um the Raiders. The most penalized team, but don't give a fuck about it. Dude, Dan Campbell rules. He is bad shit insane."
  },
  {
    "text" : "Like legitimately insane.",
    "speaker" : "Greg",
    "timestamp" : "13:18-13:19"
  },
  {
    "timestamp" : "13:19-13:52",
    "speaker" : "Andy",
    "text" : "He's awesome. He's probably a terrible coach, but well he gave his he gave his players a players-only practice the other day. Like you sent all the coaches home and just like sat there and watched from the the bleachers or something and just like let them practice themselves. Yeah, they probably just did like TikTok dances all practice and shit. Yeah, but imagine what are they gonna do when they score a touchdown? Those celebrations, those choreograph celebrations are gonna be on point. That's you're implying that they're gonna score touchdowns this year, Andy. Everybody gets lucky after all."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "13:52-13:52"
  },
  {
    "speaker" : "Andy",
    "text" : "What what is the least amount of touchdowns a team has ever scored? I don't know. I don't need that. I'm asking the stat check guy, but he's not gonna, he's he's not reading for his computer, so I guess we'll never know. If you know, uh tweet at us and let us know. With the least amount of touchdowns ever scored with. I bet Julian couldn't have those. I bet it was like one of those like sixties. It's producer notes. We need a producer. We do need a producer. But we have we have an intern. We should probably have him on in the background looking the shit up. We'll have him on at some point. No, fuck that room, front and center. All right, yeah. Get Tim on here. We will. Week one of 2005. This is when you can look forward to seeing Tim on the uh shout out Tim. Shout out Tim. All right. Uh let's see. Other stealers of note. Are there any?",
    "timestamp" : "13:52-14:42"
  },
  {
    "speaker" : "Greg",
    "text" : "Number one ranked defense in the league, points and yards. Correct.",
    "timestamp" : "14:43-14:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. Absolute steel curtain sort of thing. Yeah, real good against the run, right? Real good against the run, yeah. Um which you could see in this game. Uh and actually the last time the Patriots played him, they s tied the record for least amount of rushing attempts in a game. with six. Because five yards, right? Something like that, yeah. Cause Corey Dillon was injured for that game. So they were back in this one. And I have to say, um I enjoyed this game so much I I kind of watched it twice. I watched the regular version on YouTube and then I also watched the Three Games of Glory version. And the the you know the NFL films like narrator guy who does it was throwing some bombs. Like it was here. Let me uh I did the same thing, Andy.",
    "timestamp" : "14:47-15:35"
  },
  {
    "speaker" : "Steve",
    "text" : "It was excellent. The video quality in the three games of glory is significantly better.",
    "timestamp" : "15:35-15:39"
  },
  {
    "speaker" : "Andy",
    "text" : "It's high def. Oh yeah. So this is talking about the uh halftime, like going into halftime, what the Steelers thought.",
    "timestamp" : "15:40-15:49"
  },
  {
    "timestamp" : "15:49-16:00",
    "speaker" : "Announcer",
    "text" : "Half for the defending world champions. The Steelers predicted they would beat the stuffing out of the Patriots. But with a 21 point lead it was the Patriots doing the stuffing."
  },
  {
    "timestamp" : "16:02-16:06",
    "speaker" : "Greg",
    "text" : "Jeez. I should have stayed on the fucking cutting room floor."
  },
  {
    "text" : "No, absolutely not. This is stuff in the Steelers like a Thanksgiving turkey.",
    "timestamp" : "16:06-16:11",
    "speaker" : "Steve"
  },
  {
    "text" : "Gobble gobble bitch. It was the Steelers getting pounded in the ass.",
    "timestamp" : "16:11-16:17",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "And this this is the one that that uh triggered my my memory. It was uh there for those that can't see it because this is obviously an audio medium, uh there's it's a It's the video is a Steelers fan holding a sign it says Corey Hoop because Cory Dillon didn't play in the last game.",
    "timestamp" : "16:18-16:33"
  },
  {
    "text" : "And this is the voiceover. On Halloween, Pittsburgh didn't get a glimpse of Corey Dillon. Now, after a long, hard look, they will likely remember his last name.",
    "timestamp" : "16:33-16:44",
    "speaker" : "Announcer"
  },
  {
    "timestamp" : "16:48-16:54",
    "speaker" : "Steve",
    "text" : "He has to spell out CBS on his sign too. I can't make it out. It's like Corey Bet or something. Yeah, stay home or something, yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Um and then this was, I think, in the fourth quarter. Sorry, the Patriots up by two touchdowns and they had a s they got a the Steelers got a sack.",
    "timestamp" : "16:54-17:03"
  },
  {
    "speaker" : "Announcer",
    "text" : "Inexplicably the Steelers continued to preen despite sitting on a 14-point deficit. Patriots now taking their",
    "timestamp" : "17:04-17:12"
  },
  {
    "text" : "That sounds about right. Which we've seen in in uh past games with like the Steelers are getting their doors blown off by the Patriots. I think like whatever that week one game was in two thousand three maybe where the Patriots came out and stomped them, or two thousand two. After yeah, after it was two thousand two after the uh after the Patriots beat him in in Pittsburgh the year before. They opened the season against them and the Patriots blew their doors off and they were still like Celebrating tackles for loss and something like in the fourth quarter. Joey Porter. Yeah, yeah, that's right. It was Joey Porter. Yeah, he's an idiot. But the whole team is like that. Oh yeah. Specifically Joey Porter. Yeah. And they uh they actually had James Farrier mic'd up for this game. And he like he you could just like at the beginning was so hyped. And he was obviously like the the type of guy who was super hyped like all the time. You know, he was like the hype guy for the team. Um like the you know the the energy guy and like even at at halftime he's like guys we c we can't go out like this. This isn't how it's gonna end. And then they came out and got stomped in the second half too. And he was just like you could just like slowly see him kind of melting down throughout the entire game. It's fantastic.",
    "timestamp" : "17:13-18:22",
    "speaker" : "Andy"
  },
  {
    "text" : "It was funny to watch him shut the fuck up, yeah.",
    "timestamp" : "18:22-18:24",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, just like getting less and less enthusiastic all the way through. Which you could tell was really hard for him.",
    "timestamp" : "18:25-18:31",
    "speaker" : "Andy"
  },
  {
    "text" : "Is this Troy Palomalu rookie year? I think it's his second year.",
    "timestamp" : "18:31-18:35",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "18:35-18:38",
    "text" : "Yeah, I thought they said it was his rookie year and the commentation.",
    "speaker" : "Andy"
  },
  {
    "text" : "This was his second year. But he was rookie of the year last year, right? Something like that. I think he was.",
    "speaker" : "Steve",
    "timestamp" : "18:39-18:45"
  },
  {
    "timestamp" : "18:46-19:09",
    "text" : "No, I don't think he actually even started last year because I looked it up in like in 2003 he played sixteen games but didn't start any. So this is his first year as a as a starter. And he was like Yeah, and like an all pro too, I think. Like this was his coming out year But he got played like a fiddle by Tom Brady on the first touchdown pass, which we should probably talk about.",
    "speaker" : "Andy"
  },
  {
    "text" : "Well you wanna wanna give a a quick rundown of final score? Yeah, give it to me. Patriots win 41 to 27. And it wasn't that close. Up 24-3 at halftime. Steel has made a kind of a run in the second half. Yeah. Got within Two five yards of making it a one-score game. Yep. And then the put pit Pat's put him to bed. Yeah. So it really wasn't that close. No. It never felt first. Yeah. Yeah. Yeah. And I mean 41 points against the number one ranked defense in the league. Yeah. when this isn't really an offensive team is pretty impressive.",
    "speaker" : "Greg",
    "timestamp" : "19:09-19:53"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. It was actually um they said it. They the Steelers defense allowed more points in this game than in their previous five games combined.",
    "timestamp" : "19:54-20:04"
  },
  {
    "text" : "I think it was a steal. I mean Big Ben gifted the Patriots at least ten points with the immediate interception and the pick six.",
    "speaker" : "Steve",
    "timestamp" : "20:05-20:13"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. Yeah.",
    "timestamp" : "20:13-20:14"
  },
  {
    "timestamp" : "20:14-20:19",
    "speaker" : "Greg",
    "text" : "Big Ben was bad. Three interceptions. Looked lost."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "20:19-20:30",
    "text" : "But the whole Steelers team, like they so they go for it on fourth fourth and a yard way early on the Patriots 40. They don't get it. They get big best uh the bus gets stuffed."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "20:31-20:31"
  },
  {
    "text" : "And then immediately they throw that bomb 60 yards the other way. Yep. Defense let them down, better let him down. Big Ben let them down, they're all to shit.",
    "timestamp" : "20:31-20:39",
    "speaker" : "Steve"
  },
  {
    "text" : "It was a loud crowd and then that first play, Big Ben interception, field goal. Second drive. Don't get a fourth down conversion, immediate next play, 60 yard touchdown. Yeah, you're down 10-0 and really never recovered.",
    "speaker" : "Greg",
    "timestamp" : "20:39-20:52"
  },
  {
    "speaker" : "Steve",
    "text" : "Then you kind of get a little close and Big Ben throws a pick six and it's like, well, yeah, as you're driving like in the second half, in the second quarter.",
    "timestamp" : "20:52-20:59"
  },
  {
    "timestamp" : "20:59-21:00",
    "text" : "Right before the half.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, it was uh actually if you think about it, kind of similar to the Atlanta Super Bowl, right? Thompson field goal, Laguerre Bunt fumbles. They're going the other way. Clon Brady's pick six of Robert Alford and you're like 24-3 or whatever it was.",
    "timestamp" : "21:01-21:16"
  },
  {
    "text" : "I was thinking that. Yeah. And you're you're down 24-3 instead of 28-3. When I saw that score, I'm like, that's it's kind of similar actually at the half.",
    "timestamp" : "21:16-21:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "21:22-21:23"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "21:27-21:27"
  },
  {
    "timestamp" : "21:28-21:28",
    "speaker" : "Greg",
    "text" : "If you're in the case."
  },
  {
    "timestamp" : "21:28-21:34",
    "speaker" : "Steve",
    "text" : "Luckily the Patriots just kept pouring on because Cory they thought Corey Dillon they just kept feeding him the ball. He's just wearing down."
  },
  {
    "text" : "I thought that too, but I actually, if you look at it, Corey Dillon didn't have a great day. He had one good run. And it's a 25-yard touchdown run, which again, I think came it uh kind of a sneaky pivotable m moment where uh the Steelers had just scored a touchdown. Patriots were third and like 17 or something like that. And then they tried a screen pass to Kevin Falk, but he got held like blatantly. And so they got a five-yard defensive holding call, got a first down. Then I think it was the next play, threw it to Givens, who caught the ball, fumbled it as he went down, and Steelers recovered it, but then there was a late hit on a Stealer. uh on a Patriot after the play was over. But the Steel was like, we don't give a fuck. We got the ball back. But then the play got overturned because Givens knee was down and they tacked on the 15 yards. So now it's like first and First and 10 from the 25 next play, Corey Dillon, 25 yard touchdown run. And that was just like an absolute backbreaker for that defense.",
    "speaker" : "Andy",
    "timestamp" : "21:34-22:42"
  },
  {
    "text" : "See, I disagree. Really? You see he didn't have a good game. 75 yards, that game changing touchdown. And then he was also like they were so keyed on Corey Dillon, the defense. I would agree with that. First play of the game, they come out and run an end around. And it works really well because they're all geared towards stopping Corey Dylan. And then I to put the game absolutely away with that final touchdown. They literally run the same play again because everybody's ready for Corey Dillon's run. And they said, gotcha twice, bitch.",
    "speaker" : "Steve",
    "timestamp" : "22:42-23:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:10-24:03",
    "text" : "It's true. Yeah. But Corey Dillon also 24 carries, 73 yards, which is about three yards a carry. So, like his are his yards were hard-earned. The bus who you think didn't have a good game. 17 carries 64 yards, so about the same. There was some bullshit stuff at the end there. Oh yeah, yeah, there was. I don't think that was him though. I think that was uh Deuce Staley. Although Deuce Daley 10 carries 26 yards. Not great. Not great running in general. I think the low and bright spot was Kevin Falk's 17-yard run. Uh in the fourth quarter there. And he had a he had a fourth down conversion. The Patriots ran out on fourth and one with Kevin Falk to the exact same side that the bus got stopped to the left side of the line, which I thought was a circle and um Falk picked it up. Of course he did."
  },
  {
    "text" : "That's one of those play calls if it goes wrong, Greg's real mad about. I didn't see that one.",
    "timestamp" : "24:04-24:10",
    "speaker" : "Steve"
  },
  {
    "text" : "The audacity of Bill Belichick thinking he's got a big thing.",
    "speaker" : "Andy",
    "timestamp" : "24:11-24:14"
  },
  {
    "text" : "Running the third down back on fourth and one from the shotgun of McGregor.",
    "timestamp" : "24:14-24:17",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, you know what? To get on the Patriots play calling here. Here we go. It was in the first quarter and it was like third and Third and 11, then they got a penalty, went to third and 16. And in my head, I was like, Pat's run a draw play here. Because that's what they do now. Yeah. But they like threw it down the field and had a chance at a first down. It was like a drop. But that was a play where I was like In my head I was already like past draw play. That's Belichick. What the fuck happened? Where how did we get to the point now where we're fucking running drawplays on third sixteen?",
    "timestamp" : "24:17-24:53"
  },
  {
    "text" : "Risky, Greg. He's almost turned that over. The hit was really well timed. The ball popped up in the air. Could have easily been an interception. But it wasn't. It could have been a first down. Throw the fucking ball.",
    "timestamp" : "24:54-25:02",
    "speaker" : "Steve"
  },
  {
    "text" : "But it wasn't her first down. Charlie Weiss, right?",
    "timestamp" : "25:02-25:04",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "It's Charlie Weiss. That's right. Charlie Weiss is second to last game too. I can already tell it. And Romeo Cornell's second to last game. You all all three you guys have the same in common, Greg.",
    "timestamp" : "25:04-25:14"
  },
  {
    "speaker" : "Greg",
    "text" : "Matt Patricia? Oh no. It'll be fine. Hey, what's Matt Patricia that really good at?",
    "timestamp" : "25:14-25:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Keeping offenses on the field on third down.",
    "timestamp" : "25:20-25:23"
  },
  {
    "speaker" : "Greg",
    "text" : "I suppose. Yeah. Kryptonite baby. I'm not I'm not excited for the Patriots offense this year.",
    "timestamp" : "25:23-25:31"
  },
  {
    "timestamp" : "25:31-25:32",
    "speaker" : "Steve",
    "text" : "Oh I'm very excited."
  },
  {
    "timestamp" : "25:33-25:45",
    "speaker" : "Greg",
    "text" : "Shocking. Joe Judge and Matt Patricia. I'm all in. Oh my god. And then Belichick's son calling the plays on the defense. Like good God."
  },
  {
    "timestamp" : "25:46-25:59",
    "speaker" : "Andy",
    "text" : "You mean one of the top ranked defenses last year? Yeah. Until everybody kind of got injured at the end of this. Yeah, they looked great in that playoff game, Andy. Well, you know, like I said, everybody was injured. It happens."
  },
  {
    "text" : "Well, nice to see you calling into a lot of bosses and sports talk radio there, Greg.",
    "speaker" : "Steve",
    "timestamp" : "25:59-26:04"
  },
  {
    "text" : "Right, yeah. Dude, when when even the beat reporters are saying it's gonna be bad, that's when you know. So you're you're aligned with Boston's course gradings, and then you're a good sign, Greg. Right, Jesus. No, I'm aligned with what's his name? The beat reporter? That narrow down. Mike Reese. Even Mike Reese is saying it's ugly. Yeah, so when Mike Reese says it's ugly, you know he's not just like blunt.",
    "timestamp" : "26:04-26:28",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "26:30-26:32",
    "speaker" : "Steve",
    "text" : "Right, Mike Reese is only played one preseason game."
  },
  {
    "text" : "He's also saying pump the brakes because none of the players or coaches are concerned. And they're just like ironing out the kinks. And he's he's willing to give them some patience.",
    "timestamp" : "26:32-26:40",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh god, you guys.",
    "timestamp" : "26:41-26:41"
  },
  {
    "timestamp" : "26:42-26:48",
    "speaker" : "Andy",
    "text" : "Greg Brown, though. Not so. I'm telling you what Greg Reese said, your boy. Mike Reese, you're Greg."
  },
  {
    "speaker" : "Greg",
    "text" : "You're you're like checking your fucking Michael Felger but the opposite Andy. Someone has to be",
    "timestamp" : "26:49-26:57"
  },
  {
    "text" : "Gotta balance his shit out.",
    "timestamp" : "26:57-26:58",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:03-27:04",
    "speaker" : "Steve",
    "text" : "I will shank that bitch."
  },
  {
    "timestamp" : "27:04-27:12",
    "text" : "I will shank that bitch. And the world will be better for it. No, you won't. You'll be extremely polite and probably be like, yeah, you're right. No, not to my father.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "It's so great to meet you. Absolutely not. How are you? Thanks for coming on the pod, Mr. Maz.",
    "timestamp" : "27:12-27:20"
  },
  {
    "text" : "Maz, you fucking tool. Maz. How does Felger's butthole smell like? See face buried in it. I don't think they come on this podcast.",
    "timestamp" : "27:20-27:31",
    "speaker" : "Andy"
  },
  {
    "text" : "Andy, you're on Twitter too much, buddy. That's probably true. Twitter's getting to you.",
    "timestamp" : "27:31-27:35",
    "speaker" : "Steve"
  },
  {
    "text" : "Yep. Uh Twitter would uh wouldn't Twitter make me more negative about the Patriots? How many coffees?",
    "timestamp" : "27:36-27:43",
    "speaker" : "Andy"
  },
  {
    "text" : "We were just talking about smelling buttholes. It was a big one. Smelling buttholes is a very Twitter thing. You know, you're all worked up. You're all angry. Yeah, let that go. No, that's not gonna happen.",
    "timestamp" : "27:43-27:54",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:54-27:56",
    "text" : "This this is my vent session, boys."
  },
  {
    "text" : "I know, I guess.",
    "speaker" : "Greg",
    "timestamp" : "27:57-27:57"
  },
  {
    "speaker" : "Andy",
    "text" : "What?",
    "timestamp" : "28:00-28:01"
  },
  {
    "text" : "We're looking at these therapists. Oh god, I hope not. Except we're not licensed and we probably do more harm than good. Probably.",
    "timestamp" : "28:01-28:09",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "28:11-28:46",
    "speaker" : "Andy",
    "text" : "Probably. Oh, there's no probably about that. Yeah. Uh speaking of doing more uh bad than good. Uh they're talking about Corey Dillon in this game. and his time with the Cincinnati Bengals. Played seven seasons with the Cincinnati Bengals, and in two thousand four alone, he had almost half as many wins as he did in Cincinnati. And he would finish. He had half as many wins this season in New England as he had in seven years in Cincinnati."
  },
  {
    "timestamp" : "28:46-28:51",
    "speaker" : "Steve",
    "text" : "So if he did the same season again, he's he's got as many career wins. So I looked it up."
  },
  {
    "text" : "Uh in Cincinnati, the Bengals went 34 and 78 over his seven years. In his three years on the Patriots, any guesses? More or less wins?",
    "speaker" : "Andy",
    "timestamp" : "28:52-29:05"
  },
  {
    "timestamp" : "29:06-29:06",
    "speaker" : "Greg",
    "text" : "More."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, more. Thirty-six and twelve in three seasons with the Patriots. So we had two more wins with the Patriots. Than he did in seven seasons with the Bengals.",
    "timestamp" : "29:07-29:15"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:16-29:25",
    "text" : "And twelve losses versus seventy-eight. Correct. That's the real number right there. Not the wins. Just losing seventy-eight games, there's only losing twelve of them."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:25-29:41",
    "text" : "Yeah. That's like uh I think Tom Brady finally passed Drew Bledsoe for most interceptions on the Patriots or something like that. Or or no, he tied him for most losses when he was on the Patriots with whatever it was. But he also had like 200 more wins or something to get there."
  },
  {
    "timestamp" : "29:41-29:45",
    "text" : "You want to hear some of the quarterback names he played with though? They're fucking hilarious.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "29:45-29:46",
    "text" : "Give it to me.",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh I don't know if we went this far back, but Neil O'Donnell. Jeff Blake, Akili Smith, Scott Mitchell, John Kittner, Gus Farrat. So I mean that explains a lot of it.",
    "speaker" : "Greg",
    "timestamp" : "29:46-29:59"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:01-30:02",
    "text" : "Yeah, that was that was rough."
  },
  {
    "text" : "Good old Gus, dude.",
    "speaker" : "Greg",
    "timestamp" : "30:03-30:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Gus Ferrari. Pretty sure I had like 80 of his rookie cards. Gus Ferrari. When I would collect football cards back in the day. Every time you'd open a pack, there'd be a Gus Farrat rookie card in there. Like, well, the fact that I have so many means he's not going to be very good because they wouldn't give you good ones.",
    "timestamp" : "30:04-30:21"
  },
  {
    "timestamp" : "30:21-30:23",
    "text" : "Yeah, that's stiller stock right there.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:23-30:27",
    "text" : "Yeah, exactly. Yeah. Okay, we need to fill this pack up. Just throw Gus Rot in there."
  },
  {
    "text" : "Throw some throw some gas out of us.",
    "timestamp" : "30:28-30:29",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "30:29-30:40",
    "speaker" : "Andy",
    "text" : "Seventh round draft pick. Why would he if rookie cards of them? They had rookie cards of everybody, but he was filler, like Steve said. Rough. Oh boy."
  },
  {
    "speaker" : "Greg",
    "text" : "Achilles Smith was a third overall pick.",
    "timestamp" : "30:41-30:44"
  },
  {
    "timestamp" : "30:44-30:45",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. Oh yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "I did not know that. That's huge bust. Yeah.",
    "timestamp" : "30:46-30:48"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, not great. But you could hear Corey Dillon running the ball in like the fourth quarter. He was like fucking hype, screaming at people out there. Games were inch in hand. He was ready for the Super Bowl.",
    "timestamp" : "30:48-30:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, he was. Yeah, he was probably the most ready. Uh oh yeah. Although in that statement Yeah, in the uh three games of glory at the end, there was a nice shot of Belichick. Congratulating uh one the Tully Bentacane in there. TBC saw that.",
    "timestamp" : "30:59-31:21"
  },
  {
    "text" : "Yeah. And Matt Chitum sighting too. Yeah. When Gwendia is hugging craft.",
    "speaker" : "Steve",
    "timestamp" : "31:21-31:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. It's pretty great. Hey, everybody plays a part, right?",
    "timestamp" : "31:26-31:31"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "31:31-31:35",
    "text" : "Andy, I can get some more uh some better lighting here in this video. I like to see your face."
  },
  {
    "text" : "You don't want to see my face? Okay, let's see what I can do. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "31:35-31:37"
  },
  {
    "text" : "He's in the car, Greg. Andy is in the car again. I'm in the car, yes. It's been relegated to the outdoors.",
    "speaker" : "Greg",
    "timestamp" : "31:37-31:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, my child.",
    "timestamp" : "31:43-31:43"
  },
  {
    "timestamp" : "31:44-32:01",
    "speaker" : "Greg",
    "text" : "Indoors, outdoors. Yeah. And the sun is setting, so we're just seeing like A silhouette of Andy. Why do you want to see his face? This is like a nightmare. It's just like a black image silhouette bitching and moaning. You can still see the shit I see in my fucking youngers."
  },
  {
    "timestamp" : "32:02-32:04",
    "text" : "You can't really make out much more besides the chin strap.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "32:04-32:11",
    "speaker" : "Andy",
    "text" : "Yeah. Good. That's all you're getting. I want you to I want you to dream of me tonight, Greg."
  },
  {
    "text" : "Wait, you don't dream of your brothers every night?",
    "speaker" : "Steve",
    "timestamp" : "32:13-32:16"
  },
  {
    "text" : "I do. Oh, okay.",
    "timestamp" : "32:16-32:19",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "32:19-32:20",
    "speaker" : "Steve",
    "text" : "Yeah, I think we all do."
  },
  {
    "timestamp" : "32:20-32:22",
    "speaker" : "Andy",
    "text" : "All right, good. As it should be."
  },
  {
    "speaker" : "Steve",
    "text" : "All right.",
    "timestamp" : "32:22-32:23"
  },
  {
    "timestamp" : "32:24-32:30",
    "speaker" : "Andy",
    "text" : "One with Greg where he had these like massive feet, they're like flippers, but it was actual feet is fucking weird."
  },
  {
    "text" : "No, no, that was my penis, Andy.",
    "speaker" : "Greg",
    "timestamp" : "32:29-32:31"
  },
  {
    "timestamp" : "32:31-32:46",
    "speaker" : "Andy",
    "text" : "Oh, it wasn't. You know what I mean? I have the same. You big dick dummy. Uh all right, anything else that you want to talk about in this game?"
  },
  {
    "text" : "I got lots of best and worsts.",
    "timestamp" : "32:46-32:48",
    "speaker" : "Steve"
  },
  {
    "text" : "I got yeah, I got I got a handful.",
    "speaker" : "Andy",
    "timestamp" : "32:48-32:50"
  },
  {
    "timestamp" : "32:52-33:00",
    "text" : "Well let's make fun of the let's make fun of the Steelers some more. Okay. I have a theory. I have a theory that this loss",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "33:00-33:24",
    "text" : "uh rapidly changes their franchise psyche forever because they were flying so high after this. No, they weren't dude. No, before this, Ben Ben, he's a rookie. 151 had losses. Last year they were really good. They got beaten us by the in the AFC Championship game with Cordell Stewart, but then they came with with the and they came into our house and and ended our in win streak, you know.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "33:24-33:26",
    "speaker" : "Greg",
    "text" : "Well, you're like, all right, this is it."
  },
  {
    "speaker" : "Steve",
    "text" : "You know, if they win this game, I bet they they actually win the Super Bowl, and you know, who knows what happens. But ever since then, they just haven't been able to beat the Patriots bug about we've been in the we've been in their heads, and I think it traces back to this game. That's that's not a bad theory.",
    "timestamp" : "33:26-33:42"
  },
  {
    "timestamp" : "33:42-34:13",
    "text" : "I don't hate it. But they had been to what five of the last ten AFC, they'd hosted five of the last ten AFC conference games. Correct. And it only won one of them. And it lost to the Patriots twice. So I mean they're kind of like Ben here before with the hopes. You know, maybe not Big Ben, but you know, they're they're kind of got that Eagles thing going where they're they're right there.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, but they just got this this brand new quarterback who looks to be the franchise on a rookie deal and they can build around him.",
    "timestamp" : "34:14-34:21",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:21-34:23",
    "speaker" : "Steve",
    "text" : "They only have one loss and that was weak one."
  },
  {
    "text" : "Never never lost.",
    "timestamp" : "34:23-34:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "34:24-34:26",
    "text" : "Best defense in the league."
  },
  {
    "timestamp" : "34:26-34:34",
    "speaker" : "Andy",
    "text" : "Yeah. Oh like solid running game and you have this quarterback who looks like he can win games. It felt like a 2001 Patriots, right?"
  },
  {
    "speaker" : "Announcer",
    "text" : "Yep.",
    "timestamp" : "34:35-34:35"
  },
  {
    "text" : "Although probably more so because it's the Steelers and they're a well-run organization. They have a history of winning things when they put the pieces together.",
    "speaker" : "Andy",
    "timestamp" : "34:36-34:43"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "34:44-34:49",
    "text" : "It's kind of funny seeing Big Ben look almost athletic, but still not."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "34:49-34:49"
  },
  {
    "text" : "You know?",
    "timestamp" : "34:50-34:50",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Nothing really changed with him.",
    "timestamp" : "34:50-34:51"
  },
  {
    "text" : "Yeah, m more athletic than he did. at the end of his career, but still not athletic. It's kinda hilarious.",
    "speaker" : "Greg",
    "timestamp" : "34:52-34:59"
  },
  {
    "text" : "But he like plateaus of this athleticism for like ever. And then right at the end he falls off. But he's like this athletic for the rest of his career.",
    "speaker" : "Steve",
    "timestamp" : "35:00-35:07"
  },
  {
    "timestamp" : "35:07-35:42",
    "speaker" : "Greg",
    "text" : "There's nothing that makes me happier than watching Big Ben get like sacked because it's the least graceful shit and it's just he just like stumbles around and looks super awkward. He's It's amazing. I can't imagine rooting for someone like Big Ben. It's gotta be horrendous. It's gotta be exhaustive. Because like he's good enough that like You have to root for him. Yeah. You don't want to move on from him, right? But there is just nothing likable about him. He's not like pretty to watch. He's ugly as sin. He's a terrible person. It's like there's nothing besides like he wins games."
  },
  {
    "text" : "Yeah, he doesn't come across as like a great teammate or anything either. Like he's not that It's not well spoken. He's he's raping chicks left and right, dude.",
    "speaker" : "Andy",
    "timestamp" : "35:42-35:50"
  },
  {
    "speaker" : "Steve",
    "text" : "Like getting wrecked on motorcycles.",
    "timestamp" : "35:50-35:53"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "35:53-35:56",
    "text" : "Yeah, yeah, the motorcycle. Yeah. You have to."
  },
  {
    "timestamp" : "35:56-36:17",
    "speaker" : "Steve",
    "text" : "Yeah. So have you heard how that motorcycle accident went down? I don't think so. I mean I'm sure I did in the Stevie. There is a thing in Pittsburgh, and this is fucking wild, called the Pittsburgh Left. And what it is, is if you're In line, you're trying to take a left across a lane of traffic, right?"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "36:17-36:17"
  },
  {
    "speaker" : "Steve",
    "text" : "And like you're sitting at the light and it's just green lights. There's no left turn light. Yeah. And the light turns, the oncoming traffic will wait for one car to make the left and then they go. Yeah. Which seems just stupid, right? Yeah. How do I know that? I don't live in Pittsburgh. Someone had someone who lived in Pittsburgh had to tell me, oh yeah, that's the Pittsburgh left, you know?",
    "timestamp" : "36:18-36:40"
  },
  {
    "speaker" : "Greg",
    "text" : "God.",
    "timestamp" : "36:40-36:41"
  },
  {
    "speaker" : "Steve",
    "text" : "And he was doing one of those and a lady in the car coming in the oncoming traffic didn't think wasn't from Pittsburgh or something, or didn't know about the Pittsburgh left. So he did the Pittsburgh left on his motorcycle. And got plowed by like a lady in a corolla, an old lady. Oh shit. Right. And she was very right. She was like, I saw the green light and went go. And he just like his bite is.",
    "timestamp" : "36:41-36:59"
  },
  {
    "text" : "And this dickhead on the most like coming out.",
    "timestamp" : "37:02-37:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Is it a law or is it just like no, it's just like a regional thing people do?",
    "timestamp" : "37:04-37:08"
  },
  {
    "speaker" : "Greg",
    "text" : "It's supposed to be nice, like, oh I'll let you go, you know? Yeah, yeah, because people get like stuck in the middle of the intersection. Yeah, if you're yeah, yielding. That's interesting. That's so big then not yielding and getting in trouble for it. I looked into some of the um the allegations, we'll call them. Okay. So just uh maybe I'll go do a deeper dive later, but can't wait. It's a couple things that are kind of funny. So there was two of them, if you remember. The first one was in 2008 in Lake Tahoe and he he called up by like a front desk lady being like, yo, my TV's broken. And then shut the door when she walked in and like tried to like make out with her and shit. Jesus Christ. And apparently apparently he was. Deshaun Watson, but just skipping a couple steps. Right. Jesus. Yeah. Yeah. So that so he was there like with Donald Trump apparently. What? And he made it into fucking Stormy Daniels like tell all book. And she said she said that he like Tried to he got introduced by Donald Trump to Stormy Daniels and she like rejected him like stood in the hallway and like kept knocking the door trying to like get in so we could Do God knows what.",
    "timestamp" : "37:08-38:27"
  },
  {
    "timestamp" : "38:27-38:28",
    "speaker" : "Andy",
    "text" : "Oh, we know what."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. So then that chick sues him, right? That that first chick sues him. And while that case is still open, In 2010, he's at a bar in Georgia and he has his bodyguard like grab some girl by the arm and like bring her into a hallway. And then when she got in the hallway Quote, his penis was out of his pants. What? Yeah. And that one's a legitimate rape accusation. Like Rape, rape. And she went to the hospital and everything. There was like bruises, like all this, like, you know, telltale signs of like an actual rape occurring. There only one officer actually like investigated the case. Yeah. And it turned out that officer had asked for like a photo with Big Ben earlier that evening. There's a photo of them two together. Yeah. And he was somewhere on record as calling the girl a drunken bitch. So small town in Georgia. Yeah. No one knows how this is gonna go. Yeah, that got dropped. No. But the NFL still suspended him. Six games for like the con whatever player conduct. Detrimental to anywhere. But then it got dropped to four games for good behavior.",
    "timestamp" : "38:28-39:51"
  },
  {
    "speaker" : "Steve",
    "text" : "What? What? Oh my god.",
    "timestamp" : "39:51-39:54"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "39:54-40:02",
    "text" : "Uh huh. And it's just a lot of people. Yeah, Brian left, which got hurt in the preseason, because it's supposed to be the first six games."
  },
  {
    "timestamp" : "40:02-40:03",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "And then the day after. They made the six games four games because of a letter that Art Rooney wrote to Roger Goodell. Holy shit.",
    "timestamp" : "40:03-40:13"
  },
  {
    "text" : "Do we have a copy of said letter?",
    "timestamp" : "40:14-40:15",
    "speaker" : "Steve"
  },
  {
    "text" : "Um that I didn't see it out there, but there was some quotes from it and like quotes from Goodell. And it's the most ball washy shit ever, dude. He's like, he's really shown growth in this offseason. It's like dude, he he has two open cases against him. What do you mean show him growth? Like you're a fucking idiot. Jesus Christ. Yeah. So neither of those look very good. And the fact that they happen within two years of each other. Yikes.",
    "speaker" : "Greg",
    "timestamp" : "40:16-40:42"
  },
  {
    "speaker" : "Andy",
    "text" : "Not great.",
    "timestamp" : "40:42-40:43"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "40:43-40:44",
    "text" : "Yeah. Big yikes."
  },
  {
    "timestamp" : "40:45-40:51",
    "speaker" : "Andy",
    "text" : "Not great. And then on the field he decided to play way past his uh expiration date."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, and he's got like six chins and he's fucking hideous. Yeah. He can't take spikes for to save his shit. And he's addicted to alcohol and porn. Did you see that?",
    "timestamp" : "40:51-41:02"
  },
  {
    "speaker" : "Andy",
    "text" : "No, but I uh you could just tell me whatever and I'll believe it right now.",
    "timestamp" : "41:02-41:06"
  },
  {
    "timestamp" : "41:06-41:14",
    "text" : "Yeah, fuck it. Yeah. Yeah, this that was recent. He was like doing some fucking talk. I guess he's like a Christian now.",
    "speaker" : "Greg"
  },
  {
    "text" : "Wait, he he admitted to this?",
    "timestamp" : "41:14-41:16",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he was giving some talk at some like Christian thing to like young people or whatever. And he's like He's like, I've been addicted to alcohol, I've been addicted to porn, I've been a bad husband and father. But you know what? I'm a Christian and fucking, you know, you go to still. That makes it all better. Yeah, yada, yada, yada. Yeah. Yep. Jesus fuck. Just picture in your head right now, Big Ben, jerking off, dude. Just fucking.",
    "timestamp" : "41:16-41:41"
  },
  {
    "timestamp" : "41:42-41:43",
    "speaker" : "Andy",
    "text" : "Why are you gonna do that to me?"
  },
  {
    "text" : "Just grabbing his crank by the grossest shit.",
    "speaker" : "Greg",
    "timestamp" : "41:43-41:47"
  },
  {
    "text" : "Crack. God damn it.",
    "timestamp" : "41:47-41:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "How disgusting is that image? God damn it. All right, let's bring it back as a little point. I'm hammering home the point that Big Ben is a disgusting, despicable human. All right, so uh the right wing. I'm glad he threw three interceptions.",
    "timestamp" : "41:52-42:07"
  },
  {
    "text" : "I think they should have started Antoine Randall. Uh, they talked about bringing in uh Tommy Maddox at halftime if Big Ben didn't play better. What was the uh the quote here? Um, because he spent Bill Cowry spent the entire or most of half time calming Ben Rothesburger down. And then the quote was, if Rotheberger continues to struggle, you will see Tommy Maddox. Yes. Tommy fucking Maddox. Um but speaking of Big Ben, uh our buddy Tim, the intern, cut up some um Boston Globe articles for us. And there's one about Roth's burger. Uh you might find this. Uh w just based on everything that Greg told you you might find this pretty humorous. Uh Rossberger, we're called Snotgrass, who's a I guess Uh somebody who he knew growing up. Grew up with the idea of one day becoming a secret agent, perhaps working for the FBI. To snodgrass, that conjures up the idea of an escape artist, a trait he saw Rothesburger display time and again on the basketball court and football field. Quote, when you look at that wish, I mean that's so him, said Snoggrass. You know, sly and undercover, always finding ways to do things that are beyond the norm. He's like a James Bond 007. or an FBI agent thinking behind those sunglasses, how am I gonna get out of this one? Oh my god, being so nasty.",
    "speaker" : "Andy",
    "timestamp" : "42:07-43:29"
  },
  {
    "text" : "God damn it. Snodgrass said that? Nodgrass. Dude, a fucking FBI agent. They make this shit up. That's like a that's like an SNL sketch that I You know? Ben Rollinsberger's FBI agent.",
    "timestamp" : "43:29-43:45",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:48-43:50",
    "text" : "Fucking manhandling everything."
  },
  {
    "text" : "Oh yeah, just an absolute ruining crime scenes just sticking out like a sore thumb.",
    "speaker" : "Greg",
    "timestamp" : "43:50-43:56"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "43:56-43:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:58-44:03",
    "text" : "Undercover, quote unquote. Moppy industry. Agent Rothesberger, put your penis away."
  },
  {
    "timestamp" : "44:09-44:59",
    "text" : "Oh fuck exactly. Oh shit. Oh that's fucking hilarious. And Greg, it says Rawls, you brought up uh Randall L. Uh he has some shit to say that uh you might sour you on him as well, since we're talking shit about people. Uh this is also from the Boston Globe. The X factor in the Steelers game plan could be Randall L. All the former Indiana University quarterback did this season was lead the Steelers in punt return yards, finish second in kick return yardage, and hauling 43 passes second on the team For six hundred one yards and three touchdowns. He also threw his first touchdown passing NFL. He wants to do more such play defensive back. I'd like to get a chance to do that, said Randall L with a laugh. Move over, Troy Brown. When asked who was the better all-around player, himself or Brown, Randall L. laughed again. Quote, that would have to be me, he said",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That's he's gotta say that.",
    "timestamp" : "45:00-45:01"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:01-45:04",
    "text" : "The fuck. Fuck he's gotta say that. What do you want him to say?"
  },
  {
    "speaker" : "Steve",
    "text" : "Troy Brown joined that year.",
    "timestamp" : "45:04-45:05"
  },
  {
    "text" : "Fuck yeah, it'd be like yo Troy Brown's a goddamn pioneer. I hope to live up to his his greatness.",
    "timestamp" : "45:06-45:12",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:12-45:19",
    "speaker" : "Steve",
    "text" : "If you're your receiver, you're supposed to be super self-centered and think you're the best. That's how they that's how they work. Still, fuck him. Fuck him."
  },
  {
    "speaker" : "Greg",
    "text" : "I like Randall.",
    "timestamp" : "45:20-45:21"
  },
  {
    "timestamp" : "45:21-45:23",
    "speaker" : "Andy",
    "text" : "No, not I used to."
  },
  {
    "text" : "He's pretty crafty. And Heinz Ward. I like Heinz Ward too. Fuck him. Do you like Heinz Ward Andy?",
    "timestamp" : "45:23-45:30",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "45:30-45:32",
    "speaker" : "Andy",
    "text" : "No, fuck him, he's dirty."
  },
  {
    "text" : "I hate all steel, just kind of dark again.",
    "speaker" : "Greg",
    "timestamp" : "45:33-45:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:45-46:13",
    "text" : "Hey, you want some more hate? How about this? Fucking Bill Cower thinks he's hot shit. Uh again from the Boston Globe, the Steelers Bill Cower will be coaching in his fifth AFC championship game, his fourth at home, but he's only won one in ninety-five against Indianapolis. Asked whether he's changed his approach, Cower said. Any guesses? Yeah, changes approach. Quote, no, I think every game has been a pretty good football game. Really coming out on the short end more times than nothing. Fucking great coach."
  },
  {
    "timestamp" : "46:13-46:15",
    "text" : "What an asshole. What a prick.",
    "speaker" : "Greg"
  },
  {
    "text" : "What a fucking loser.",
    "timestamp" : "46:16-46:17",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:18-46:27",
    "speaker" : "Greg",
    "text" : "How dare he? What a loser. Who does he think he is with that mustache? Right? What a loser. What a fucking asshole."
  },
  {
    "text" : "And that all right, let's let's let's contrast that with uh Bill Belichick, a real uh NFL football coach. Uh one question to Belichick to Belichick at his news conference yesterday was a softball right in the coach's wheelhouse. Quote, if the Patriots can play defensively like they did against the Colts, Belichick swung away. Quote, if we play like we did against the Colts, we'll get killed, he said. It'd be a lot worse than whatever it was out there last time because Pittsburgh is not the Colts. And the Colts are not Pittsburgh. You're talking about two totally different teams. Things that we did against the Colts, if we tried to do them against the Steelers, there'd be 55-nothing. That might be if they kneel on the ball like they did at the end of the game last time. There's almost nothing that I would carry over or correlate from that game to this game. We couldn't make a bigger mistake than to try to do that, in my opinion.",
    "timestamp" : "46:28-47:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That's fair. Those teams are very, very different. Fuck it right. Almost as that's a good idea.",
    "timestamp" : "47:11-47:16"
  },
  {
    "text" : "As opposed to Bill Cow's like, no, I'll just do what I do. Who else you want me to shit on? Anybody else?",
    "speaker" : "Andy",
    "timestamp" : "47:16-47:22"
  },
  {
    "timestamp" : "47:23-47:24",
    "speaker" : "Steve",
    "text" : "This is ridiculous."
  },
  {
    "timestamp" : "47:27-47:33",
    "text" : "Uh they're fine. Yeah. Jim Nance?",
    "speaker" : "Andy"
  },
  {
    "text" : "You can't hate Jim Nance, right?",
    "timestamp" : "47:33-47:35",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, it's tough.",
    "timestamp" : "47:35-47:36",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, what do you think of the refs though, Andy?",
    "speaker" : "Greg",
    "timestamp" : "47:36-47:38"
  },
  {
    "text" : "The refs are fine. I like the parcel foul called after the reverse givens fumble. What about Jerome Bettis?",
    "speaker" : "Andy",
    "timestamp" : "47:38-47:44"
  },
  {
    "text" : "You definitely hate Bettis. Oh yeah, I can't stand Bettis. Yeah. He thinks he's good, but it's just fat. The fact that he's like fifth all time in rush yards is crazy.",
    "speaker" : "Greg",
    "timestamp" : "47:44-47:54"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:54-48:51",
    "text" : "He's just a fat offensive lineman or fast offensive lineman. That's fucking bananas. There's no way he's fifth all time. That's get the fuck out of here. Dude, you had 16. I hate fucking Greg. No, but there was a I actually had a a football, not football from uh I don't know which one it was. Uh the it was uh because right at the beginning of the game, Teddy Bruski basically took Betis on headfirst and just like stoned him. Like heavy. That was fake. It looked like both of them got the worst of it too. Like that looked like a car crash. Um But on the replay, I don't know which commentator it was said, uh, quote, he can load it up and put some weight in his pants when he needs to. Oh hell yeah, dude. Oh yeah, just dropping deuces, baby. Just when you need to. Just just put some weight in those pants. Steve. Steve. Yeah. Put some weight in those pants when you need to."
  },
  {
    "speaker" : "Steve",
    "text" : "Do you want me to take a shit in my pants right now?",
    "timestamp" : "48:51-48:53"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:53-48:57",
    "text" : "I just want you to if you need to, just you can, you know, load it up and put some weight in those pants."
  },
  {
    "speaker" : "Steve",
    "text" : "Expert sphincter control, Andy. I only poop when I want to poop. I'll believe that when I see it. He's eighth all time now. Bettis. Jesus.",
    "timestamp" : "48:57-49:06"
  },
  {
    "text" : "How the fuck did Jerome getting?",
    "timestamp" : "49:06-49:08",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "He does play one more year after this. 12 more games. How many yards is he?",
    "timestamp" : "49:08-49:12"
  },
  {
    "timestamp" : "49:15-49:38",
    "text" : "But nine more touchdowns. That that's yeah, that's how I remember him. I don't remember him as like an actual running back. I remember him as a goal. Yeah, bananas. And he had like uh Cause the last game uh before this the Steelers played the Jets and hung in there to win. Like uh he actually better had a fourth quarter fumble when the the Steelers were down.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, Greg went over this last week about how the Jets absolutely blew it.",
    "timestamp" : "49:39-49:43",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Right. Yeah. Yeah.",
    "timestamp" : "49:42-49:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "49:44-49:47",
    "speaker" : "Greg",
    "text" : "And these um but he also three field goals to win."
  },
  {
    "text" : "Yeah. Yeah. Including one like at The end of the the game too, right? Yeah, it's like two minutes. It was like in this fee in this in this stadium. Uh but yeah, Battis went for 27 for 101 last week against the Jets. So he had a fucking legit game. Um but it That actually the talk about the missed field goals, Adam and Terry in the first drive of the game, opened the scoring with a 48-yard field goal, which was the longest field you tied the longest field goal in Heinz Fields history. Forty-eight yards.",
    "speaker" : "Andy",
    "timestamp" : "49:47-50:24"
  },
  {
    "speaker" : "Steve",
    "text" : "That's over four years, right? I think so, yeah, something like that.",
    "timestamp" : "50:24-50:28"
  },
  {
    "timestamp" : "50:28-50:28",
    "text" : "Yeah, four years.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "50:28-50:31",
    "text" : "That's like how is forty-eight yards the longest Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:32-50:38",
    "text" : "By and like by stealers or visitors kickers, like any kicker, the longest was 48."
  },
  {
    "text" : "Well, it had the open end, right? Yeah, it was like renowned for being tough to kick in. Yeah, yeah, yeah.",
    "speaker" : "Greg",
    "timestamp" : "50:39-50:43"
  },
  {
    "timestamp" : "50:43-50:53",
    "text" : "Um, but the and this game was a cold one too. It was the second coldest game ever to in Pittsburgh. It was 13 degrees. Yeah That was surprising too. Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "I thought there'd be colder games in that in Pittsburgh.",
    "speaker" : "Greg",
    "timestamp" : "50:54-50:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Right, exactly. Yeah. But yeah, all the uh the um three games of glory, the Pittsburgh. Defense is talking about like, oh, this is Pittsburgh weather. Like, well, not really. This is it's New England weather. It just happens to be in Pittsburgh. Because the the coldest game in Pittsburgh was 1989 against these major patriots. Yeah. Interesting.",
    "timestamp" : "50:56-51:17"
  },
  {
    "timestamp" : "51:17-51:23",
    "speaker" : "Steve",
    "text" : "I love how Andy thinks that we own cold weather. We do. Other teams carrying out cold weather."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:23-51:26",
    "text" : "Uh-uh. That's our weather, bitch. We don't own cold weather. We own cold weather."
  },
  {
    "timestamp" : "51:27-51:32",
    "speaker" : "Steve",
    "text" : "Uh-huh. It's our weather. We own to be in Pittsburgh. This is Tom Brady's weather."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, this just happens to be in Pittsburgh. It's the San Mateo's own Tom Brady. This is his weather. Leisty. I love this game. Andy's on one tonight, boys. This is this is a great game. It's Andy at night. Andy in the dark. Fucking beautiful. That's right.",
    "timestamp" : "51:32-51:47"
  },
  {
    "speaker" : "Greg",
    "text" : "Andy after dark. Yeah, you don't want to.",
    "timestamp" : "51:47-51:50"
  },
  {
    "text" : "All right. Greg, you got anybody else you want you want me to shit on or want me to shit on before we do best and worst?",
    "timestamp" : "51:53-51:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "52:00-52:01",
    "text" : "No.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "52:01-52:03",
    "speaker" : "Andy",
    "text" : "Alright. Then do you want to go Fox?"
  },
  {
    "timestamp" : "52:05-52:12",
    "text" : "Actually. Just seeing his name come up gave me shivers. Me too. I didn't like seeing that. Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "He didn't catch the touchdown and like the meaningless garbage time one and he just he didn't celebrate it all, which was refreshing because they had been celebrating all game, being down big as the NFL film guys.",
    "timestamp" : "52:13-52:24"
  },
  {
    "timestamp" : "52:23-52:31",
    "text" : "Pointed. It was like it was like real close too. Like he caught it and then just like dropped it. I'm like, that was like almost not a football mo when you got that.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "52:31-52:41",
    "text" : "And that's very anti-Plaxical Burris' personality, too. Po Is it? Do you think of all the people that are going to be celebrating? Make it instead of 21 down, 14 down with a minute left?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:41-52:45",
    "text" : "It's I mean it I feel like him dropping things by accident and having them backfire on him."
  },
  {
    "timestamp" : "52:46-52:50",
    "speaker" : "Steve",
    "text" : "Yeah, he tried to tuck it in his waistband a little bit. I guess it slipped right out. Yeah, exactly."
  },
  {
    "text" : "I'm glad you knew where I was going with that. All right. Greg, you want to do your best and worse? Give me some best.",
    "speaker" : "Andy",
    "timestamp" : "52:50-52:55"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:57-54:27",
    "text" : "So my best is gonna be like celebrations from this game. The the pick six from Rodney Harrison. So that came it was like 17-3. It was coming like towards the end of the half. Yep. Steels driving. Steels are driving, pick six, like an 80-yard return. And it's like Harrison and Vrabel with Big Ben. The last guy back and Big Ben's trying to like run with him and like turn and turn which is awesome to watch. And then Brabel just like dumps him and goes down like a bag of fucking potatoes. Super awkward. Yeah, so like Harrison has like no one within 20 yards of him as he's going in. So he like literally walks the last five yards. Literally just staring up and just like starts Stomping as he crosses the line and just like staring up into the crowd and is like, you guys are done. 24 to 3 and a half. See you later. I just walked in for a touchdown. Which is like an iconic path celebration. And I know where you're going with the next one too. Uh the Dion branch. Yes. Yeah. Dion Branch also had a couple sick touchdowns that was like super hype. The second one that like really put the game out. He did like the Tyreek Hill last five yards, like wave at the defender as he's like walking over the goal line. So that was another one that was sick."
  },
  {
    "timestamp" : "54:27-54:44",
    "speaker" : "Andy",
    "text" : "Once you got in the end zone, you started waving to the crowd. Yeah. And then there was a clip in the three games to glory where he's on the sideline, I think, after scoring that touchdown. And he's like, where where where are all your towels? He's like waving one of his white ties like where are all your towels? Where's everybody's towels?"
  },
  {
    "text" : "And that's a throwback to the 2001 too. Because remember the Pats did it in that game too? Yep. On the sidelines, they were mocking the towel thing. Yeah, yeah, yeah. I bet everybody does though. Yeah, so good for Dion for knowing his Patriots history. Fuck yeah. Yeah.",
    "timestamp" : "54:44-54:59",
    "speaker" : "Greg"
  },
  {
    "text" : "But even after the first one, this is the first one. My bias celebration generally I am not a fan of. Seems a little cocky. I don't think Bill liked it either. Flip side of that coin mill with that safety had of it open field and I don't know what he just like stood there flat footed in branches. Gave him a little wiggle and he was absolutely right by him. Wasn't he?",
    "speaker" : "Steve",
    "timestamp" : "54:59-55:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Also, that was to go up by three touchdowns, I think, at that point.",
    "timestamp" : "55:19-55:21"
  },
  {
    "timestamp" : "55:22-55:32",
    "speaker" : "Steve",
    "text" : "Oh yeah, that was the that was the nail in the coffin game over. That was it. That was it. Everybody, that's you don't like the bye-bye, Steve? I loved it. Seems a little cocky to me."
  },
  {
    "text" : "Just because it's the Steelers, though.",
    "speaker" : "Greg",
    "timestamp" : "55:32-55:33"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "55:34-55:40",
    "text" : "Because the Steelers are the cockiest football team in football. Yeah, but it's like if Tyree Kill hadn't ruined it for me, I would probably like it a lot."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "55:41-55:42",
    "text" : "I like it when Tyreek does it."
  },
  {
    "text" : "I think it's hilarious. I hate Tyreek Hill a ton.",
    "speaker" : "Steve",
    "timestamp" : "55:42-55:44"
  },
  {
    "text" : "I hate him too as a person, but uh I don't hate that celebration. Especially the fact that Uh the Buccaneers did it to him in the Super Bowl.",
    "timestamp" : "55:44-55:53",
    "speaker" : "Andy"
  },
  {
    "text" : "That was sweet. Winfields. Was it Winfield? That's why I like it, is because like you can can like turn those things around on people. Yep. You know. I fucking love it.",
    "timestamp" : "55:53-56:03",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "56:03-56:04",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:04-56:16",
    "speaker" : "Greg",
    "text" : "But even after the first touchdown, Deion Dion Branch was hyped. That 60 yarder that put him up 10-0. He was like hopping around like stoked out of his mind. And you could tell you're like Oh yeah."
  },
  {
    "text" : "I mean that was these boys absolutely touchdown was the longest play, longest offensive play the Patriots had the entire season.",
    "speaker" : "Andy",
    "timestamp" : "56:16-56:25"
  },
  {
    "timestamp" : "56:25-56:28",
    "speaker" : "Greg",
    "text" : "And it's the longest play the Steelers have given up too, right?"
  },
  {
    "text" : "I think so, yeah. All year. Yeah. Not bad.",
    "timestamp" : "56:28-56:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. You got a worst? Do we want to well do you wanna yeah, we want to talk about that play for a second? Because that the Palomalo aspect is interesting from that play. Yeah, it's a good thing. Paul Amalu's obviously like, you know, I don't know, is he Hall of Famer, right? I think he got in this year, didn't he? I was just there.",
    "timestamp" : "56:31-56:46"
  },
  {
    "timestamp" : "56:46-56:47",
    "text" : "He was there.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Oh, that's right. Yeah. And like was an amazing player, but he used to do a lot of like off-schedule shit, right? Yep. So he'd like, he was the the high safety help for the post. And you look at the replay, and he clearly like took a chance trying to undercut like a route underneath and completely left his corner out to dry and Brady just threw it over the top. So like That's the other side of the coin when it came to Palomalu is Brady.",
    "speaker" : "Greg",
    "timestamp" : "56:47-57:15"
  },
  {
    "timestamp" : "57:19-57:21",
    "speaker" : "Andy",
    "text" : "And he just seemed to be a big instincts wrong."
  },
  {
    "text" : "His instincts",
    "speaker" : "Steve",
    "timestamp" : "57:21-57:22"
  },
  {
    "text" : "Yeah. Well I mean sometimes you're wrong, right? You can watch highlight clips of him just like timing the snap and jumping over the center to get a sack on what's supposed to be a like a running play. Those are my favorite things to watch. I love that, yeah.",
    "speaker" : "Andy",
    "timestamp" : "57:22-57:36"
  },
  {
    "text" : "And he had like all sorts of that. Yeah, and he's the only one that like I've ever seen do that in any sort of consistency. Yeah, that's true. He was the man.",
    "speaker" : "Greg",
    "timestamp" : "57:36-57:44"
  },
  {
    "timestamp" : "57:44-58:12",
    "text" : "Junior Seo used to do it. Yeah, maybe it's because he would like run up to the line to like just get there. Actually, Rodney sometimes. Rodney Harris, not nearly as much, obviously, but he was known for trying to jump that snap too. Um, but I think you got got though. Yeah, I think Palomalu is kind of almost a poor man's Ed Reed, and not to like take away from Palomalu. But Ed Reed was just like that, but except he never made the mistake. You know what I mean?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I will say Palomar is more of a rich man Bob Sanders.",
    "timestamp" : "58:12-58:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Rich man's Bob Sanders.",
    "timestamp" : "58:18-58:20"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "58:22-58:31",
    "text" : "I'm not even gonna ask you to explain that because I know you can't. They're both crazy in instinct. Driven, you know? Alright, I okay. Well that I had crazy hair too."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "58:31-58:54",
    "text" : "I'll give it to you. Fuck it. Alright, so my worst. Give me your worst. My worst is Bill Cower. You're gonna like this, Andy. I love it already. Not going for the for kicking it. So it's they're down 14 in the Start of the fourth, is that right? 1329 left in the end of the third."
  },
  {
    "text" : "No, right at the beginning of the fourth, yes. Right at the beginning of the fourth? Yep. And down 31-17.",
    "speaker" : "Andy",
    "timestamp" : "58:54-59:00"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "59:01-59:11",
    "text" : "You're down 31-17 and you have the ball at the five-yard line. You don't get in in three plays. And he kicks a field goal to go down 11. Yep. And what was the next one?"
  },
  {
    "speaker" : "Steve",
    "text" : "What was also run run or run post the further fade and then run it again?",
    "timestamp" : "59:11-59:16"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:17-59:30",
    "text" : "Yeah. Yeah. But then you have Jerome Bettis, who's like You have the second ranked rushing offense in the entire league. Yeah. If Jerome Benison scored 14 touches. Go for it, dude."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "59:30-59:30"
  },
  {
    "text" : "And what what what did the cameras show next after they kicked the field goal? The fans filing out of the stadium. Yeah. Because yeah.",
    "timestamp" : "59:31-59:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "59:39-59:42",
    "speaker" : "Steve",
    "text" : "That's so soft though. They they all left so early."
  },
  {
    "text" : "Yeah, that's pretty bad to leave an 11-point game, but still, I mean they were leaving before that. But that was when the exodus happened. That's a pussy move, dude. Yeah. I don't think anyone blames you if you go for it there and you don't get it. Like there's not a fan in the world that's gonna be like, I you know, should have kicked it.",
    "timestamp" : "59:42-59:57",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "59:57-01:00:05",
    "text" : "Also, you know when you have the top-ranked defense in the league Yeah. And so you're gonna so even if you don't score a touchdown, you pin the Patriots offense.",
    "speaker" : "Andy"
  },
  {
    "text" : "Who admittedly Google is saying I'm gonna trust my defense as well. And it didn't work. Patriots went on a big ass drive.",
    "timestamp" : "01:00:05-01:00:12",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, the pages well the pages in the in the fourth quarter put together two five-minute drives that both ended in scores, a field goal and touchdown. You still need two scores.",
    "timestamp" : "01:00:12-01:00:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Like what's the point?",
    "timestamp" : "01:00:20-01:00:22"
  },
  {
    "timestamp" : "01:00:22-01:00:32",
    "text" : "So dumb. Yeah. Love it. Join the dark side, Greg. Both literally and figuratively. Turn your light off. Steve, best and worst.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:00:32-01:01:04",
    "speaker" : "Steve",
    "text" : "Wait, I don't think anybody has like pro-Bill Cower here. Because the look on his face after Rothesberger throws a a pick with like seven minutes left and they're down 14. You're gonna see it. He's like, oh well, we're done. And that was like I was there for when he threw that fake spike interception. Uh that was the worst throw he's thrown in that stadium, but no, the one he threw back breaking pick was like the worst throw. I don't know. He overthrows him by like four yards, right, to the safety. Oh yeah, that's exactly what he did last playoff game against the Jets."
  },
  {
    "text" : "Yeah, that's true. Yeah.",
    "timestamp" : "01:01:04-01:01:05",
    "speaker" : "Andy"
  },
  {
    "text" : "So he's doing this every game.",
    "speaker" : "Steve",
    "timestamp" : "01:01:05-01:01:06"
  },
  {
    "timestamp" : "01:01:06-01:01:13",
    "text" : "Yeah, this is what he's known for. Cool. Yeah, Eugene Wilson, two interceptions, right? Yeah. Yeah, I'm surprised I wasn't your best, Greg. I was leaving that.",
    "speaker" : "Andy"
  },
  {
    "text" : "Shout out my boy. Eugene Eugene. It's no love, dude. Now we're going through and getting into the fucking weeds. We realize how good he actually was. That is correct. He was great.",
    "speaker" : "Greg",
    "timestamp" : "01:01:13-01:01:25"
  },
  {
    "text" : "All right, Steve. Give us give us your best and worse, bud. I guess other worst was the punting.",
    "speaker" : "Andy",
    "timestamp" : "01:01:25-01:01:30"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:01:31-01:01:40",
    "text" : "Yeah, which which they were like, oh, the the first half, the Patriots dominate in every phase of the game. Yeah. And it was true, except for the punting. That's the one thing they were just terrible at."
  },
  {
    "text" : "Well, I will say this, Josh Miller, his former team. Pittsburgh Steelers. Just throwing that out there. So he was probably a double agent for them because he pumped it to like the 50-yard line twice.",
    "speaker" : "Andy",
    "timestamp" : "01:01:40-01:01:50"
  },
  {
    "text" : "It wasn't great.",
    "speaker" : "Steve",
    "timestamp" : "01:01:50-01:01:51"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:01:51-01:02:00",
    "text" : "Did not have a good day. Although that's probably why he wasn't a Steeler anymore, too. And I also have a bone to pick with uh pro football reference."
  },
  {
    "text" : "Oh. Uh there's nothing listed about Hank Petit. in this game. Okay. And he definitely has at least one tackle that I saw. He does, yeah. I don't know like what and I didn't catch all of this. I don't know if you did, Andy. The commentators were saying he was playing at like that pit the week before?",
    "timestamp" : "01:02:00-01:02:22",
    "speaker" : "Steve"
  },
  {
    "text" : "Or he was working at a he was attending classes at the University of Pittsburgh. And he was signed off the street 11 days before this game. And he was um a former sealer who got cut. And he had two third-down stops in this game, one tackle that you're talking about. He also had a um a hit on the wide receiver as he was catching the ball. So you call it a pass break breakup. So he had two third down stops all by himself. He even went to bed undergrad. So he's like, his real name is? What's that?",
    "timestamp" : "01:02:22-01:02:54",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:55-01:03:06",
    "speaker" : "Greg",
    "text" : "Henry Major Petit the second. The second? Yeah it is. He's not just a Petit, he's a major Petit. Major Poteet. Major Petit, dude. Henry Major Poteet."
  },
  {
    "speaker" : "Andy",
    "text" : "Fantastic.",
    "timestamp" : "01:03:07-01:03:08"
  },
  {
    "timestamp" : "01:03:09-01:03:16",
    "text" : "It has him in his like career stats. There is 2004 with New England. I don't know if he plays in the Super Bowl or not. I don't remember. Oh",
    "speaker" : "Steve"
  },
  {
    "text" : "But man, there's something out next. Troy Brown's out there a lot. Troy, yeah. But like we're kind of almost used to seeing it now. The commenters like, oh Troy Brown's out there, and they're pointing him out. I'm like, well, yeah, of course he is. Like he's he's the nickel corner now. What do you want? And they're not throwing it at him anymore. Have you noticed that? And then like he doesn't have a lot of tackles or pass breakups because they're not they're like not going to him. Peyton definitely tried to pick on him. A little bit, yeah.",
    "timestamp" : "01:03:17-01:03:44",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Successful at Stokely. A little bit, yeah. But I mean we haven't heard that in a while. Yeah, he's got like what three or four interceptions or something. So how would you throw at him? Right, yeah. Silly. It's probably defensive back. Why not go after Hank Poti instead? Dude was in a goddamn college class down the street last week, thinking economics.",
    "timestamp" : "01:03:45-01:04:05"
  },
  {
    "timestamp" : "01:04:06-01:04:12",
    "speaker" : "Andy",
    "text" : "Taking third down breakups is what he's taking. Ridiculous. Absolutely ridiculous. So is that your worst?"
  },
  {
    "text" : "Yeah, I have a I have a real curveball best. Oh, all right. My best is the Patriots losing to the Steelers earlier this year. Not only because I feel it's hard to beat a same team twice and they got to experience them and they beat them, but Can you imagine if the knight courage wore orange was also the end of the Patriots winning streak at like 38 games? That would be fucking awful.",
    "speaker" : "Steve",
    "timestamp" : "01:04:12-01:04:41"
  },
  {
    "timestamp" : "01:04:41-01:04:57",
    "text" : "Oh, you bring up a great point, Steve. I can't argue with that. That would have been I think that that would have been more backbreaking, I think, than just losing to them. Yeah. I I think that may have derailed the season. I think he might be on to something.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. They might they wouldn't they would just never mentally recover for that. But they already had one loss in the season, right? Yes. It would have been undefeated at that point. It would have been ahead of the Steelers.",
    "timestamp" : "01:04:57-01:05:06"
  },
  {
    "text" : "And instead of just one of those like learning experiences of like, hey, just don't get too fucking fool of yourself because you can lose this fucking garbage dolphin scene. Yeah. It would have been way more than that. Kind of the opposite of 2007, right? And Where they just they went and beat everybody and then like ran out of gas at the end and just couldn't put that last win together. That's right. Where I think if they had lost to the Giants in that week 17 game, things would have been different.",
    "speaker" : "Andy",
    "timestamp" : "01:05:06-01:05:29"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:05:29-01:05:32",
    "text" : "Is this Rodney Harrison's only Super Bowl rank?"
  },
  {
    "text" : "No, he won last year.",
    "speaker" : "Andy",
    "timestamp" : "01:05:33-01:05:35"
  },
  {
    "text" : "He won his last year with the Batsu?",
    "speaker" : "Steve",
    "timestamp" : "01:05:35-01:05:37"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:05:37-01:05:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:05:38-01:05:39",
    "text" : "2008."
  },
  {
    "text" : "No, uh 2003 I'm saying. Against the Panthers.",
    "timestamp" : "01:05:40-01:05:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yes.",
    "timestamp" : "01:05:45-01:05:46"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:46-01:06:10",
    "text" : "Because he he that was when he broke his arm in the picture of him in the sling with the confetti. That was last year. All right. Is that your hair? Best and worst? That was it. All right. Uh my best is I'm gonna say This is perhaps Dion Branch's best two-game stretch of his career between this game and the week after."
  },
  {
    "speaker" : "Steve",
    "text" : "Yes.",
    "timestamp" : "01:06:11-01:06:11"
  },
  {
    "text" : "Because he was everywhere in this game. He had the the reverses, both went for big yard. I think he had like two rushes for 37 yards and a touchdown. And then he had Whatever catches and I think he had over a hundred yards rush uh receiving. The sixty yard bomb. He had another long one that he took an absolute shot from Paulomalu. Like as he caught the ball. I d I have no idea how he hung on to that. Like that's something Palomalu jars loose like 99 out of a hundred times. It was a clean hit too.",
    "timestamp" : "01:06:12-01:06:42",
    "speaker" : "Andy"
  },
  {
    "text" : "Got him right on the ball.",
    "timestamp" : "01:06:42-01:06:43",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "But it was yeah, exactly. Yeah. Literally as he caught the ball and he still hung on. I have no idea how he did it. So absolutely and this and then he wins, I mean, spoiler alert, he wins the uh Super Bowl MVP the next week for setting the receptions record.",
    "timestamp" : "01:06:43-01:06:58"
  },
  {
    "text" : "Which is a great previous question.",
    "speaker" : "Steve",
    "timestamp" : "01:06:58-01:07:00"
  },
  {
    "timestamp" : "01:07:01-01:07:01",
    "speaker" : "Andy",
    "text" : "What's up?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:07:02-01:07:08",
    "text" : "Is he the isn't he the only patriot besides Tom Brady to win a Super Bowl MVP for the bats? Yes, he is."
  },
  {
    "text" : "Didn't Edelman win that one against the Rams? Did he win it? Didn't they want to give it to the punter? Oh no, I think you're they wanted I they should have given it to the punter. Um but no, I think Greg might be right. The thief that he is also managed to steal a super MVP. Yeah, he's stealing our podcast idea. He's stealing supole MVPs. What a dick. Uh Alright, what else we got? Uh well I was gonna talk about Hank Pertite. We got that uh my worst in the uh Three games of glory, uh, Gil and or Gino, whoever it was, doing the commentating. They they had the radio commentators on, Gil and Gino. Top notch. Could not pronounce Troy Palomalu's name. So he was Troy Palomalu the entire game. Which I fucking love. But uh tough look Choi Palomalu.",
    "timestamp" : "01:07:09-01:08:03",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, what are you gonna do? You know? To be fair, it's only the third time they've seen him and called a game with him.",
    "speaker" : "Steve",
    "timestamp" : "01:08:03-01:08:09"
  },
  {
    "timestamp" : "01:08:09-01:08:59",
    "text" : "Yeah, well I mean I guess so, but still. Uh you kind of pay to to know the names and shit like that, but I'll I'll go with it, you know, fuck it. So also um Shout out to uh the tuna, the big tuna, Bill Parcells. Big Tat Tuna. Yeah, Boston Globe article uh clip talking about Ben Rossburger. Now the NFL's hottest young quarterback, anointed early in the season by Bill Parcellus as the game's best rookie quarterback since Dan Marino, a 23-year-old Rothes Berger and the Steelers on Sunday night will take on the Patriots. So wasn't far off except Rothesberger actually won a Super Bowl and wasn't nearly the quarterback Marino was Other than that, nailed it. There's somebody else I hate, Greg. That's for you. Fucking hate him, Parcells.",
    "speaker" : "Andy"
  },
  {
    "text" : "Hope he never gets Big Fat Duna.",
    "speaker" : "Steve",
    "timestamp" : "01:09:00-01:09:01"
  },
  {
    "timestamp" : "01:09:02-01:09:05",
    "text" : "Do you think you'll ever get in the uh Patriots Hall of Fame?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:09:06-01:09:09",
    "speaker" : "Greg",
    "text" : "Patriots offer. Probably not. No."
  },
  {
    "text" : "Way more people ahead of him. Way more people. He brought the pages back to relevance. Yeah, but he's got a lot of people to overcome who actually, you know, won Super Bowls.",
    "timestamp" : "01:09:10-01:09:19",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:09:20-01:09:20"
  },
  {
    "timestamp" : "01:09:20-01:09:22",
    "text" : "So you're gonna say never? No.",
    "speaker" : "Steve"
  },
  {
    "text" : "Even after they get through all the dynasty guys?",
    "speaker" : "Andy",
    "timestamp" : "01:09:22-01:09:24"
  },
  {
    "timestamp" : "01:09:25-01:09:39",
    "text" : "Yep, because there'll be a whole bunch of crew come about to win Super Bowls this year that I need to get in for. There you go Steve Brown. And then after that, once Belichuk retires. Yeah, the more and more. Let's just keep going. We got to save room for Matt Patricia and Joe Judge.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:09:42-01:09:48",
    "text" : "I can't. Joe Judge, if Joe Judge is in the Hall of Page Hall of Fame, I'll eat my hat on air."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:09:48-01:09:49",
    "text" : "Okay. Wow."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:09:49-01:09:50",
    "text" : "That's great."
  },
  {
    "text" : "What about judge or Matt Patricia? Give us the odds here.",
    "speaker" : "Steve",
    "timestamp" : "01:09:50-01:09:54"
  },
  {
    "speaker" : "Andy",
    "text" : "Fine. Okay. If either of them are in the Page Hall of Fame, Greg will eat his hat. I might have to clip that. I'm going to send it to myself 10 years from now just to see.",
    "timestamp" : "01:09:54-01:10:05"
  },
  {
    "text" : "All right. You guys want to make some Patriot season predictions on our way out since we are about to start the new year?",
    "timestamp" : "01:10:05-01:10:10",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh yeah. Um Greg, I feel like this is the time of the year where we make a jersey bet. All right. What's the Vegas? Uh I believe, I want to say it's nine and a half, but let me double check. Oh, just tell me what the fuck it is. Oh, it's eight and a half. Pedro's eight and a half wins for 2022. Alright, that's good. 10. I'll take the under. You got the over.",
    "timestamp" : "01:10:11-01:10:36",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:10:37-01:10:38",
    "speaker" : "Steve",
    "text" : "And what 10 is a push?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:39-01:11:03",
    "text" : "Yeah. All right. You can set that high. Confidence, huh? I like it. I think it's about right. I think it was 10. Yeah. I think it was nine and a half last year. So I'm fine taking the over. Let's go. What do you think it's gonna be, Andy? Sixteen, seventeen and oh, whatever. Seventeen. Doesn't matter. No, I'll be uh I think I said uh fourteen and three on the season. 13 and 3. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "He's the anti-Felger, Greg. Yeah. The six are gonna be three and fourteen. So they'll they'll start off slow.",
    "timestamp" : "01:11:04-01:11:09"
  },
  {
    "text" : "You know, they'll they'll lose one of the games of Miami, some bullshit like that, you know. Maybe maybe split with the bills and then yeah, the rest of that's it's gravy. Game on. Steve, what do you what do you think?",
    "timestamp" : "01:11:10-01:11:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I think about ten wins. I think they get they're they're pretty good early, despite everyone else's Consternation, you know, they they go like three and one, they have a nice easy stretch there. Tisha Brown's before Deshaun's back.",
    "timestamp" : "01:11:19-01:11:31"
  },
  {
    "timestamp" : "01:11:32-01:11:32",
    "text" : "Yep.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And then the latter half probably but on that Vikings or Cardinals game and the Bills game. That's really where it's gonna you're gonna find out if they're a really good team or not. But I think they can go 500, close the season out, get around to 10-11 wins. Back in the playoffs.",
    "timestamp" : "01:11:32-01:11:45"
  },
  {
    "speaker" : "Andy",
    "text" : "So all right, 10 wins under uh over under. Over. Oh, alright. And Greg, you think under 10 wins?",
    "timestamp" : "01:11:45-01:11:53"
  },
  {
    "timestamp" : "01:11:54-01:11:54",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "text" : "Okay. What it will give me a number? Like how under are you feeling it? Uh 8 and 9, 9 and 8. Oh.",
    "timestamp" : "01:11:55-01:12:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "You're a 500 team.",
    "timestamp" : "01:12:03-01:12:04"
  },
  {
    "timestamp" : "01:12:04-01:12:09",
    "speaker" : "Andy",
    "text" : "Wow. Greg Brown, the pissy little moaner of the Brown family."
  },
  {
    "text" : "Yeah, ye of little faith.",
    "timestamp" : "01:12:09-01:12:11",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:12:11-01:12:15",
    "text" : "Right. Get some joy in your life, Greg."
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, I have plenty of joy. I have plenty of joy. Yeah, it sounds like it. Andy, we just spent like an hour and a half listening to you fucking complain about everything under the sun.",
    "timestamp" : "01:12:15-01:12:23"
  },
  {
    "timestamp" : "01:12:24-01:12:41",
    "text" : "Yeah, and now I feel great. Sometimes you just gotta get some shit off your chest and then you know I'm happy as a clam. Snuggle my little bun la joy inside. It's gonna be great. Are these the things that are really on your chest or is this just Hey, I got I got nothing but love for everything else.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Commentators and referees Greg. Yeah, what about traffic, Andy, and people driving?",
    "timestamp" : "01:12:43-01:12:47"
  },
  {
    "timestamp" : "01:12:49-01:12:55",
    "speaker" : "Steve",
    "text" : "Are you really mad at the referees, Andy, or is it something else in your life? So what I'm referring your rage onto these referees."
  },
  {
    "timestamp" : "01:12:56-01:13:06",
    "speaker" : "Andy",
    "text" : "Would you like to know? What I what makes me mad and it's one thing or let's just start with what doesn't make you mad. No, it's literally one thing. And it's things that don't work the way they're supposed to."
  },
  {
    "timestamp" : "01:13:07-01:13:18",
    "speaker" : "Steve",
    "text" : "Hmm, I think yourself or the universe, Andy. I'm mad at you, Steve. You don't work the way you're supposed to. Is it the way you were grown up? Did your parent were your parents nice to you?"
  },
  {
    "timestamp" : "01:13:19-01:13:20",
    "speaker" : "Andy",
    "text" : "You tell me. You were there."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:13:21-01:13:23",
    "text" : "I wasn't nice to you. Yeah, I know."
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, I know. That's why I'm taking out my rage on the two of you right now.",
    "timestamp" : "01:13:25-01:13:28"
  },
  {
    "text" : "Payback, bitches. We'll dive deeper next episode.",
    "timestamp" : "01:13:28-01:13:33",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:13:33-01:13:33",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:13:34-01:13:35",
    "text" : "We'll really get in there."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:35-01:13:36",
    "text" : "We've said that a bunch of episodes."
  },
  {
    "timestamp" : "01:13:37-01:13:38",
    "text" : "So we'll put you under hypnosis, Andy.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, well maybe like maybe recline that chair back a little.",
    "timestamp" : "01:13:38-01:13:41",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:13:41-01:13:46",
    "speaker" : "Steve",
    "text" : "Yeah, all right. Can you do your next one from can you put a couch in your car for the next time?"
  },
  {
    "speaker" : "Andy",
    "text" : "I I can do my best, yeah.",
    "timestamp" : "01:13:46-01:13:48"
  },
  {
    "speaker" : "Steve",
    "text" : "I'll just record put a pen on the table in front of you.",
    "timestamp" : "01:13:48-01:13:51"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:51-01:14:16",
    "text" : "I got some I got some tissues. Don't worry about it. Nothing you can say. Yeah, I do. Watching this game, I do. All right. So uh what's next week, boys? I don't know. Super Bowl Sunday. Super Bowl Sunday. The Nigerian Patriots head to where was this game held? Indianapolis. That doesn't feel right. No."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:14:17-01:14:20",
    "text" : "Jacksonville? That sounds right."
  },
  {
    "speaker" : "Andy",
    "text" : "That's right. All Tell Stadium. One stadium place. Jacksonville, Florida. 32202. We will see you then. As the Patriots take on. The Philadelphia Eagles, led by Fred X, T. O. , and Pukeboy himself, Donovan McNabb.",
    "timestamp" : "01:14:21-01:14:41"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:14:41-01:14:46",
    "text" : "Very excited to watch that. Yeah, get your puke buckets ready. God damn right."
  },
  {
    "text" : "All right. So until next week.",
    "speaker" : "Andy",
    "timestamp" : "01:14:47-01:14:49"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:14:49-01:14:59",
    "text" : "Tune in next week to see how much of a blubbering little bitch Greg is. On the Patriots Dynasty Pop new material. Some new material."
  },
  {
    "text" : "Well fucking keep keep talking. I'll find some.",
    "timestamp" : "01:14:59-01:15:02",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:15:03-01:15:17",
    "text" : "Greg hates that clip. He's so easy to trigger, and you unfortunately our listeners can't see his face right now because it's the best. It was funny. It was funny. Yeah, but it's like the T thirty joke, right? The more you play it, the funnier it becomes.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:15:20-01:15:26",
    "speaker" : "Andy",
    "text" : "The Mick Brown school of humor. It only has to be funny to one person, and that one person is me."
  },
  {
    "text" : "Alright, sea letter.",
    "speaker" : "Greg",
    "timestamp" : "01:15:27-01:15:28"
  },
  {
    "text" : "Say letter Hall it up",
    "speaker" : "Announcer",
    "timestamp" : "01:15:29-01:15:31"
  }
]