[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "speaker" : "Mom",
    "timestamp" : "00:00-00:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:21-00:39",
    "text" : "Welcome back to the Patriots Dynasty Podcast. I'm your host, Andy Brown. We are the podcast that's going back and re-watching every Patriots game. Starting in 2001, we're currently 2004, week eight matchup against the Steelers. And with me today, Steve Brown. How you doing, Steve?"
  },
  {
    "text" : "Good. We have uh we have Gus here doing just as much work as Greg.",
    "speaker" : "Steve",
    "timestamp" : "00:39-00:43"
  },
  {
    "text" : "Nice work.",
    "timestamp" : "00:46-00:47",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, Greg is not here because what was his excuse this time? Uh he's at a concert with mom and dad.",
    "speaker" : "Steve",
    "timestamp" : "00:47-00:52"
  },
  {
    "timestamp" : "00:53-00:55",
    "text" : "Yeah. So I'm sure that's a great time.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah.",
    "timestamp" : "00:55-00:56"
  },
  {
    "timestamp" : "00:56-01:12",
    "speaker" : "Andy",
    "text" : "Revolution, I believe. Oh, all right. All right. I can get into some uh some reggae. But we figured we'd replace him with uh professional. Uh as we well, as m more well, if you'd met Greg, you'd understand that uh it's a low bar."
  },
  {
    "text" : "All right, good.",
    "timestamp" : "01:13-01:13",
    "speaker" : "Mike Dussault"
  },
  {
    "timestamp" : "01:14-01:19",
    "speaker" : "Andy",
    "text" : "He's our fact checker. But uh this week we have with us Mike Dusot. Deuce, thanks for joining us."
  },
  {
    "text" : "Yeah, guys. Happy to be here.",
    "speaker" : "Mike Dussault",
    "timestamp" : "01:20-01:21"
  },
  {
    "timestamp" : "01:21-02:09",
    "speaker" : "Andy",
    "text" : "Yeah. All right. So Uh we're gonna talk about you for a little bit first, because uh otherwise having you here wouldn't make a lot of sense. Yeah, and we'd have to talk about this Steelers game, which is Yeah, so we're gonna avoid that for as long as possible because uh wash I d I don't need a patriot another Patriots lost to talk about right now. Right, yeah. I mean it it does feel fitting though this this week uh and this this current game for some reason it just matched up well. Uh so I'm in I am I'm in a mood this week and this game did not help watching it Um so yeah, so right now you work for pages. com. Yes. Um So I have to, I've I've been asked to ask you, um, is Andy Hart as insufferable in person as he is on the radio?"
  },
  {
    "speaker" : "Mike Dussault",
    "timestamp" : "02:09-02:19",
    "text" : "Well, I actually replaced Andy Hart. So I've never actually worked with Andy Hart, but from the reaction I received when I arrived there, I I I get the impression that yes, he is, in fact."
  },
  {
    "text" : "Okay. All right.",
    "timestamp" : "02:20-02:21",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Dussault",
    "timestamp" : "02:22-02:31",
    "text" : "No, he's a good guy. I get along well with him. I I've uh he's been nice enough to have me on his radio show a couple times, but uh but no I know Andy. He is uh I mean he's one of a kind. What can you say?"
  },
  {
    "text" : "Yeah, so is this Andy Yeah, that's fair. Way worse. It's definitely anything, I'm pretty sure.",
    "speaker" : "Steve",
    "timestamp" : "02:31-02:37"
  },
  {
    "text" : "I'm on the other end of the spectrum though. I'm I'm Mr. Positivity.",
    "timestamp" : "02:38-02:41",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "02:41-02:44",
    "text" : "How are we supposed to replace you, Andy? You're a friggin' brother.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:44-02:46",
    "speaker" : "Andy",
    "text" : "Right. No replace in this case."
  },
  {
    "timestamp" : "02:46-02:47",
    "speaker" : "Steve",
    "text" : "Yeah, it sucks."
  },
  {
    "speaker" : "Andy",
    "text" : "Also, then you'd have to do some work.",
    "timestamp" : "02:48-02:49"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:49-02:54",
    "text" : "So it works out. None of that. Yeah, this whole thing would fall apart and immediately."
  },
  {
    "timestamp" : "02:55-03:03",
    "speaker" : "Andy",
    "text" : "Right, absolutely. Um, so Uh Page. com, that's a hell of a job. How did you kind of luck into something like that?"
  },
  {
    "timestamp" : "03:04-04:45",
    "text" : "Oh. Well, it's a long long not that illustrious story but uh I I I started uh I started a Patriots blog myself um back in in 2007 was when I really first started uh watching and or not watching I should say uh thinking about blogging I actually um You guys won't get there for another three years, but the 07, I was I was living in California and I had to I had to come back and see the 07 team and came back for the Pittsburgh game. And my sister and I were standing in the parking lot and uh somebody had paid to actually have a banner flown around the stadium with, you know, three Super Bowl uh trophies with asterisk next to them. And so I was I was very angry by that and so when I when I flew back uh while living in California at the time, I I hey I'm gonna write a blog about it. So uh that's so that started the blog and then uh so I you know blog for different places early in the you know mid the mid-2000s. And about 2009, I believe, I started um tweeting under a handle called Pat's Propaganda, which I thought sounded uh edgy, kind of cool. And that That kind of evolved into a Tumblr blog and then that became a regular blog. And so basically after writing for a lot of different outlets for a while, I just said I just want to write about the Patriots on my terms. And so I wrote past propaganda the blog. And part of that. um became the Bill Belichick hoodie database. So I started tracking all of Bill Belichick's hoodies. That got me some attention for its ridiculousness. And yeah, just kept Plowing away at it, loved it, and moved back to to Boston here in 2017 and saw this job when Andy left, opened up and knew Fred Kirsch a tiny bit. just I mean I wouldn't even say I knew him. I had emailed with him a couple of times.",
    "speaker" : "Mike Dussault"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "04:45-04:45"
  },
  {
    "timestamp" : "04:45-05:29",
    "speaker" : "Mike Dussault",
    "text" : "Sent him an email, said hey, I I you know I'm an idiot that loves the Patriots and loves blogging about the Patriots and I have experience in TV and all these things and you know I was podcasting and making t-shirts and hustling and everything. And they said, great, come on in and be on Patriots Unfiltered. So it was kind of like a crazy audition where I just got thrown into the fire with Eric Scalavino and Paul Perillo and Fred. And uh Yeah, that was uh crazy. I mean, I know I I know how lucky I am and uh you know I come from blogging roots and that's why I always, you know, I'm happy to go on with passionate Patriot fans. Like you guys have a totally unique podcast. This is awesome. So Uh I know the grind. I love it. And uh that's that's kind of a long story. I've been there um two seasons now and into my third season and they just kind of let me keep doing what I did on Pat's propaganda. So I guess that's a short version. It's kind of long though."
  },
  {
    "timestamp" : "05:30-05:33",
    "text" : "No, that's not bad. CC, there is hope for me.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Dussault",
    "text" : "No, there isn't it.",
    "timestamp" : "05:34-05:34"
  },
  {
    "timestamp" : "05:36-05:41",
    "speaker" : "Andy",
    "text" : "That feels like my uh my origin story, except for the end part where I get to work for the Patriots."
  },
  {
    "text" : "No, hey, hang in there, man. I'm in my mid-40s when I got this, so I was",
    "timestamp" : "05:41-05:46",
    "speaker" : "Mike Dussault"
  },
  {
    "timestamp" : "05:48-05:57",
    "speaker" : "Steve",
    "text" : "Yeah, it's really cool. Graphic Andy just got a bunch of repeats or whatever the internet does with things like that. The touchdown ones, all the different size jerseys."
  },
  {
    "timestamp" : "05:57-06:03",
    "speaker" : "Andy",
    "text" : "That's true, yeah. I'm well on my way, Steve. Is that what you're saying? That's my hoodie database."
  },
  {
    "speaker" : "Mike Dussault",
    "text" : "Yeah, you gotta find some piece of stupidity that only you care enough about to document. And then you know you'll get to be on ABC Nightly News and they call you. But this man has the answer to what hoodie Bill Belichick should wear. That's me.",
    "timestamp" : "06:05-06:17"
  },
  {
    "text" : "That he drags his brothers through.",
    "timestamp" : "06:23-06:25",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "06:25-06:26",
    "speaker" : "Announcer",
    "text" : "That's perfect."
  },
  {
    "text" : "Yeah, it's a good fit. Um so yeah, I well I guess we should probably ask you then, um, the hoodie for this upcoming big game.",
    "speaker" : "Andy",
    "timestamp" : "06:26-06:33"
  },
  {
    "timestamp" : "06:34-08:13",
    "speaker" : "Mike Dussault",
    "text" : "Is there I mean you guys are on the cutting edge right now. I mean I it's funny I um on uh yesterday I was sitting there and I'm like, oh man, I probably for this game should figure out what he should wear, you know, because I I mean I don't I just kind of tweet out now, like I keep track of it, but he doesn't wear a lot of old stuff anymore. So there's not that much interest to it. So um so I do I dove into it and I wish I had my notebook. Had I known you guys were gonna ask me this, I was like, I'm gonna compose a tweet tomorrow because God knows what you're gonna let me. write it on patriots. com, right? Like, no, that's that's not going. Maybe I'll go back to I let some guys write past propaganda now, so maybe I'll go back and write it there. But I went and I thought, I mean you guys can weigh in on this because my criteria were games that Brady played terrible, but that the Patriots still won. So that was what how that was kind of the the the the general idea I had. So I not only dove into those, I also dove into some of the playoff games as well. And just a couple of you know Brady's just all-time. Terrible, terrible games. Um and so I think what I came up with, and then you guys are probably, you know, I think you guys are gonna concur with this being the fans that you are, I I came back to in a great majority of them, Bill Belichick had the classic. gray hoodie on with no sleeves. Like his like iconic look, which he really hasn't worn much of. So uh he can't wear the Reebok anymore. So I'm thinking it's gonna be Here it is. I'm gonna drop it here first. I think it's a 27 or 2018 gray cut hoodie. And if he wears that, I mean, and then I'll know he's listening to me. I am I am in the building. They won't let me within fifty feet of them, but maybe that's no restraining oath. This will this will somehow get to him. It's a great cutoff hoodie."
  },
  {
    "text" : "It makes uh I think it just makes sense. Like visually and everything, just like the whole thing.",
    "speaker" : "Andy",
    "timestamp" : "08:13-08:18"
  },
  {
    "timestamp" : "08:18-08:41",
    "text" : "He's going against Tom. He's got to wear his all-time classic look, regardless of what the record was. But you know, games like the And again, you guys aren't going to be hit there for seven years now, but the 2011 AFC Championship game, you know, kind of an all-time Brady Clunker that they managed to pull out. So, you know, that's one, that's one right there. that he had. So I yeah, I think that's what that you know you guys got ahead of the curve.",
    "speaker" : "Mike Dussault"
  },
  {
    "speaker" : "Andy",
    "text" : "I'll have to put something out tomorrow to keep it quiet for you.",
    "timestamp" : "08:42-08:46"
  },
  {
    "speaker" : "Mike Dussault",
    "timestamp" : "08:48-08:50",
    "text" : "That's an embargo on that until uh tomorrow."
  },
  {
    "timestamp" : "08:50-09:06",
    "text" : "Yeah yeah. So yeah, I mean there's not many games that Brady plays poorly that they still win. And usually they win because Brady does something at the end. Right. If we were further along, that'd be the perfect segue into this this game.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but he no, he doesn't even play well in this game.",
    "timestamp" : "09:07-09:09"
  },
  {
    "timestamp" : "09:09-09:26",
    "text" : "No, but well, that's what we're saying. You don't want Brady to play well, but you still want the page to win. That's the hoodie that you gotta wear. Right. Yeah. Right. That doesn't happen this week. That was my criteria. Yeah. Um and I think it's kind of you to say that we're gonna get to 2007 in three years, because it's gonna take us a lot longer than that",
    "speaker" : "Andy"
  },
  {
    "text" : "You seem like you got the dedication for it.",
    "timestamp" : "09:28-09:30",
    "speaker" : "Mike Dussault"
  },
  {
    "text" : "Oh yeah, this bug is gonna go forever, but it's gonna take us fucking twenty years to finish the whole damn thing. Stupid once every other week.",
    "timestamp" : "09:30-09:39",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, we're getting like eight weeks a year, and there's like 300 games to go.",
    "speaker" : "Steve",
    "timestamp" : "09:39-09:44"
  },
  {
    "timestamp" : "09:44-09:46",
    "text" : "Yeah, so we'll get there.",
    "speaker" : "Andy"
  },
  {
    "text" : "Okay.",
    "timestamp" : "09:46-09:46",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Maybe you will. Plenty of time. Yeah, I'll get there. You can come along if you want. Um, but the the more interesting thing than Page Unfiltered that I want to talk to you about is the new podcast that I think it's just you who's doing, right? Your name's on the on the box.",
    "timestamp" : "09:47-10:03"
  },
  {
    "timestamp" : "10:03-10:09",
    "speaker" : "Mike Dussault",
    "text" : "Yeah, kind of. I mean me and producer Matt Morell, who's really my the sound guy that put it all together."
  },
  {
    "timestamp" : "10:09-10:18",
    "speaker" : "Andy",
    "text" : "Nice. And it's called uh 2001 a Super Bowl Sound Odyssey. And the first six episodes? Uh six one's not out yet, right? There's three."
  },
  {
    "timestamp" : "10:19-10:52",
    "speaker" : "Mike Dussault",
    "text" : "Yeah, there's four out right now, actually. And uh the fifth one will be out a week from tomorrow. So uh the Friday before the Texans game, and then two weeks from that will be the final episode, um, which will be the Rams game. Just uh I guess I should I'm getting ahead of myself a little bit just to what it's six episodes. The first episode is basically free agency training camp building the team. The first the second episode is then Essentially, Drew Bledsoe getting hurt in 9-11. The third episode is Brady begins. It's Tom Brady, the regular season, uh kind of the ups and downs of that season. And then one episode each for the playoff games."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. And then you're gonna do season two, right? 2002.",
    "timestamp" : "10:52-10:55"
  },
  {
    "speaker" : "Mike Dussault",
    "text" : "Well, it's I mean it's it's it's funny, you know, how it how it all kind of came about is this was kind of an idea that they had. I mean, obviously you guys are in the area as well. Um and so they I mean they they they had kind of the general area that they had wanted to do for a while and it's all part of the 20-year celebration of 2001, but it was nice because they just kind of gave me Carpe Blanche to do it. And I mean, for me, you know, hearing Gil Santos and Gino Capoletti and their calls in the radio, that that stuff was awesome. So my my the producer, Matt Morale, he went through a lot of that stuff. A lot of it was you know just finding random sound and and that was it was like we came up with the name 2001 a Super Bowl sound odyssey but the whole time we were doing it it was like I I really hope this lives up to the Odyssey part of it. I don't know if this is gonna be an Odyssey or what but um but based on the sound we were able to get And then the Patriots PR staff was awesome lining up interviews for me. So I was able to talk to just, I mean, you know, I was gonna have to.",
    "timestamp" : "10:57-11:51"
  },
  {
    "timestamp" : "11:51-11:52",
    "text" : "There's some big names in there.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Dussault",
    "text" : "Yeah, I mean Scott Pioli. Um that was one of the first ones I did, which I was just like, you know, I'm like I mean again, I'm like past propaganda pretty database guy, and I'm talking to Scott Pioli asking him about the O one. season.",
    "timestamp" : "11:52-12:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:04-12:14",
    "text" : "My favorite was was the Chris Berman stuff on there because I mean he's been the voice of our childhood growing up with the Patriots. You watch him on NFL prime time at uh after the games every week."
  },
  {
    "text" : "He was so awesome and it was it was one where you know as you were kind of going along, I was I really wanted to cover it from all angles, which was uh obviously players and and management and and all that. And then it was like, well, I have some local media. I'd really love a national media. And Aaron Sulkin, one of the guys who works in Patriots PR, knows Chris Berman. So I was like, hey, can we just ask him? And and Aaron's like, yeah, he'll do it. And and and the cool thing was was he was one of the like he called and you know I'm I'm totally nervous to talk to him and everything and and and he started asking me about it. So what do you So this like a part, but it's gonna be edited, it's not live, right? Like you're gonna put it like he instantly kind of got yeah what we were going for. And usually I try to get people in and out, you know, 20 minutes. You don't want to take up people's time. He I couldn't get him off. I mean he just I got I got one more story for you Mike. I got one more story for you. I mean and and just uh you know like a little a little sample of it was from the most eas uh recent episode we released episode four which was the Raiders and uh the story he tells is you know I used to call Bill after the games and so after that game I was you know had finished taping prime time I you know gave Patriots a call and he said, you know, one ring and burnt Patriots. Bill Belcheck answers the phone. He goes, Bill, what are you doing? You know, he said, well, Chris, if you boomer, have you seen the weather? I'm not going anywhere. And so they, you know, ended up chatting at about 2 a. m. after that game. So You know, a lot of really cool stories. There's another story he tells uh before the Rams Super Bowl game about, you know, he he cleared the room before the game uh in the media availability and talked to Bill Belichick. you know, shared those stories with me as well. So it's just, you know, super cool. Um, we also got Joey McIntyre from New Kids on the Block, which randomly kind of came about. He was like, hey, I sang the anthem for the Raiders game. I'd love to do something. And I'm like, well, this idiot here's got a podcast. You want to be on that?",
    "speaker" : "Mike Dussault",
    "timestamp" : "12:16-13:57"
  },
  {
    "timestamp" : "13:57-13:58",
    "text" : "Go talk to him.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Dussault",
    "text" : "Yeah. So there I am, you know, sitting with Joey McIntyre, the new kids in the Patriot studio. So Um, so it was it was super fun. And I mean, as as uh you know, as you guys probably share the same passion that I had that drove the whole thing. And so for me it was just so exciting to be able to Spend the off season and and kind of try to contribute something to that season and and a new perspective here 20 years later. So uh very very proud of it. It's definitely one of the biggest things I've ever done. So Um, just, you know, really a love letter to the fans and and the people that love it. And, you know, being able, just for me as a fan, being able to hear those calls again, to hear those plays unfold from when you're not quite sure what's going to happen. I mean, everybody kind of knows the big moment calls for. From everything that's been put out, but you know, when you come in a little bit early to the play and you start to hear it unfold and it's like, you know, all right, Brady back to what's gonna happen. So I I I think that's been a lot of fun.",
    "timestamp" : "13:58-14:49"
  },
  {
    "text" : "Even just hearing uh I can't remember if it was Gil or Gino. just talking through what the uh like the offensive lineup was, you know? He's talking about he's got two to the far side left, one to the near side, right? And it's just like it it brought me right back to exactly where I was listening to that game.",
    "speaker" : "Andy",
    "timestamp" : "14:50-15:07"
  },
  {
    "timestamp" : "15:07-15:50",
    "text" : "You can hear the atmosphere, you know. I think that was one of the things was cool. I mean, there's you know, many moments just as I was editing it and going through it with Matt where it's just, you know, I'm like I I I get I'm getting chills again, you know. You just just those moments is the the sound, especially. So that was It was cool. A lot of it came out, you know, how I was hoping, especially I think in episode four with the Raiders. That was, I think, one of the I you know, we got Amy Trask from from the Raiders who was just awesome and and really funny and and sweet and just, you know, really, really Great interview. And I think she and Michael Lombardi as well, who was kind of the perfect connection between Belichick and Peoli and their Cleveland days and then, you know, working for the Raiders. So he he kind of knew the Patriots, knew what the Patriots were and all that. Yeah.",
    "speaker" : "Mike Dussault"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes. So if you listen to this this little podcast, um, I highly recommend listening to the 2001 Super Bowl Sound Odyssey because it's Basically what we would do if we were professionals with all with access to all the audio and the interviews. It's it's fantastic. Yeah.",
    "timestamp" : "15:51-16:07"
  },
  {
    "timestamp" : "16:07-16:12",
    "speaker" : "Steve",
    "text" : "Yeah, if I was in your spot, I would have insisted on talking to Troy Brown for on the U."
  },
  {
    "timestamp" : "16:12-16:53",
    "text" : "S. I know, I know. Well he's there all the time. And so I mean, you know, the funny thing is is I mean, you guys probably have a pretty good idea of how things roll there with you know how it's run and everything and uh you know so I I was just laughing that hey it's easier for me to get Mike Vrabel from the Titans than it is to get Troy Brown, the receiver's folks or you know. I really wanted uh I mean one of the ones I was disappointed about was just uh trying to get Josh McDaniels. We just couldn't quite work it out as we got kind of down And uh, you know, as he was a first year kind of low level assistant, you know, I was talking, he was like, why does he want to talk to me? I'm like, that's exactly why I want to talk to you. You know, you were here to kind of see the ground floor of it. So That was one that got away, but but I think overall we get we got some good some good people who who kind of covered it all.",
    "speaker" : "Mike Dussault"
  },
  {
    "speaker" : "Andy",
    "text" : "Nice. Yeah I've enjoyed the uh especially the the most recent one because It's a shame Greg's out here. That's his uh didn't he say that's his favorite ever Patriots game?",
    "timestamp" : "16:53-17:03"
  },
  {
    "speaker" : "Steve",
    "text" : "I think he said non-playoff.",
    "timestamp" : "17:04-17:06"
  },
  {
    "text" : "No, it was the the playoff game was the uh Super Bowl Yeah, I don't think it mattered. I thought he said that was his best ever pages game just because of the atmosphere and it being the last game in old Fox Rose Stadium and everything and the snow and",
    "timestamp" : "17:06-17:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "17:20-17:24",
    "text" : "He said if you could go to one pages game, it would be that one, which I think we all agreed on."
  },
  {
    "text" : "Yeah, yeah, yeah. If you go if you go back in time, that's that's the way to be.",
    "timestamp" : "17:24-17:28",
    "speaker" : "Andy"
  },
  {
    "text" : "And it's it's and I mean we had the problem with the episode because it's like so two legendary, never to be got forgotten plays at least. He I mean maybe three with with both kicks, but Yeah, you know, happen within the last few minutes of the game. And it's like now, you know, and then I'm now I'm trying to edit the Pittsburgh the next week, and you're like, nobody cares about special. Teams big trees, you know. Like, I mean obviously Bledsoe coming in plays plays a big part in it, but uh, but you know, it's just it's I mean such an epic game. And obviously the Super Bowl was epic too, so it's just uh You know, it's that I don't think anything can ever really top that that Raiders win in the snow.",
    "timestamp" : "17:28-18:01",
    "speaker" : "Mike Dussault"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah, I think you're right. So do you have Let's say outside of that. Well let's say uh regular season. Do you have a favorite uh Patriots game or favorite Patriots movement or anything like that",
    "timestamp" : "18:01-18:13"
  },
  {
    "speaker" : "Mike Dussault",
    "text" : "That's a good one. Um, you know, I'd have to probably go with uh games that I went to because I and I I lived in California for like I grew up around here in New England and then I lived in California for 18 years and then I moved back the last uh four or five years. So Um Doing to Games was always a special occasion for me. So some of the games that I went to that were great experiences were the 06. Chargers playoff game. I drove down to San Diego for that. Um, had a bought a LA. It's a whole long story. I'll tell it quick because it's good. So you live so you live in California, I live in California, I live in Los Angeles, and you know the the Patriots beat the Jets, and now all of a sudden it dawns on the idiot that oh geez, the Patriots are coming out here. They're gonna have to play the friggin' Chargers with Tomlinson and Rivers. And I mean they were a wagon that year. Yeah, they were. So you get word that They're gonna release some tickets to California residents only. So you know, like oh hell yeah. So get on Ticketmaster and this is like you know the olden days. I had all these you know windows open and ticket man. I mean I guess it's not the old days, it's probably still the current days I I got all these windows open and you know and so oh I and I you know some tickets come up I get them oh nice you know and I and I go to like checkout and the site crashes you know so every I mean probably everybody's been there you think you got them I go back, I'm looking, no tickets. All the tickets have sold out within five minutes. I'm so mad. I had 'em, the computer crashed, I lost them. So A few minutes go by and I'm fuming. And I say, all right, you know what? If it happened to me and my tickets got returned, maybe I'm just going to take one more change, one more shot. So put it in. There's one ticket available. I don't even look where it is. I just put it in the I just I'm like, I'm buying it. Like I'm you know, every click is like completely slow, deliberate, like trying to get through everything. I get it. I get the tickets. You know, I'm like waiting for the email confirmation. It comes through and I'm like, all right, well, where am I sitting? Go to look at the ticket. I'm nine rows in the back of the Patriots bench. Like a solo ticket. Actually. I think you can see it over my shoulder right here, uh right there. Right this my wife made me a nice thing with like the cover, my ticket, picture from the game. But I mean it was I went solo. I was in the middle of a bunch of Patriot fans, you all know. Well you guys will get there in about what two years. Uh you'll know how that game is. Give or take. But it was it was awesome. So that game and then also um I came back once for the 2014 game against the Broncos and went with my my my buddy Fitzy. And Peyton Manning, they ran him off the field. It was the you know the Gronk One handed catch, the Edelman bot return that we've seen so much of. And that was just from the blog stuff, we had some some giveaways. They gave us a bunch of stuff to give away in the parking lot. So it was like Me, Nick, Pixie Stevens, his buddy uh George, who he does all the uh the Patz fans videos with, and Jerry Thornton. And we were running around the parking lot. Just spreading Patriot joy to tailgators, giving stuff away. And then we went in and watched the Patriots beat up on Pate Manning. So it was uh those I those are the two I think that come to mind as as random favorites of my own.",
    "timestamp" : "18:13-21:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, those are good ones. I like that. Yeah. Yeah, being a being in one of those playoff games, those comebacks. Speaking of Troy Brown, right? Jeez. Yeah.",
    "timestamp" : "21:08-21:16"
  },
  {
    "timestamp" : "21:18-21:19",
    "speaker" : "Mike Dussault",
    "text" : "Troy Brown game right there."
  },
  {
    "text" : "Yeah, exactly.",
    "timestamp" : "21:19-21:20",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:20-21:21",
    "speaker" : "Mike Dussault",
    "text" : "Thought it was over. Thought it was over."
  },
  {
    "timestamp" : "21:22-21:22",
    "text" : "Yep.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "21:28-21:30",
    "text" : "I've never said a word to him. I've been there two and a half years.",
    "speaker" : "Mike Dussault"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "21:31-21:39",
    "text" : "You should say to him, all right. You know, these guys who have a podcast saying Yeah, that's our goal for this podcast. Also Brown."
  },
  {
    "timestamp" : "21:39-21:43",
    "speaker" : "Mike Dussault",
    "text" : "Yeah, gotcha. Brother from another mother."
  },
  {
    "text" : "That's right. All right. Uh Steve, you got any questions? I'm good. You're good? All right.",
    "speaker" : "Andy",
    "timestamp" : "21:43-21:52"
  },
  {
    "timestamp" : "21:52-21:55",
    "text" : "How do you guys feel about the game this week? Let me ask you one question before I get out of here.",
    "speaker" : "Mike Dussault"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:57-21:59",
    "text" : "You got any questions for us?"
  },
  {
    "timestamp" : "21:59-22:40",
    "text" : "Yeah, how you feel about the game this weekend? Where where do your allegiances lie right now as two crazy Patriot fans? Because I'm in a weird position. You know, I I'm I work for the team, so I have to be kind of positive, but A lot of people there that I work with, you know, are also very like argumentative. And so I gotta deal with all that. But it's been a rough week. And I mean I guess I'll just throw out what I'm where I'm at. I've I've just tried to appreciate it. Everybody wants to talk about how it ended. I want to remember the good times. It's crazy that we're going to get to see these guys play against each other. For me, it's going to be the last time I'm probably ever going to see them in person, which I've been, you know, incredibly lucky to do a bunch of times now. So That's how I'm trying to go into it. And whatever happens, the Patriots are one and three. It is what it is.",
    "speaker" : "Mike Dussault"
  },
  {
    "text" : "Yeah, I I think I echo um Julian Edelman's sentiments about how this is it feels like A divorce and like having to go to a picnic with both parents or sort of something like that. Um it just feels part of it just feels really awkward. Especially because you know how much pressure the media is gonna put on it. Like isn't like the the morning shows are all showing up like the national morning shows are doing their show from Gillette Stadium or something ridiculous.",
    "speaker" : "Andy",
    "timestamp" : "22:41-23:13"
  },
  {
    "speaker" : "Mike Dussault",
    "timestamp" : "23:13-23:16",
    "text" : "Like it's it's I can confirm. I can confirm that."
  },
  {
    "timestamp" : "23:17-23:49",
    "text" : "It's like Super Bowl levels of of just like attention, which I think I actually thought about this in the shower this morning. Uh the one good thing about this Is that uh Mac Jones will get that sort of environment and that sort of like playoff atmosphere against a really good team. And in the end of the day, it doesn't really matter that much in the standings. Because losing a game early in the season to uh an NFC team is like, who the fuck cares?",
    "speaker" : "Andy"
  },
  {
    "text" : "Week four against the NFC self, right?",
    "timestamp" : "23:49-23:51",
    "speaker" : "Mike Dussault"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:51-24:00",
    "text" : "Right, exactly. Yeah. So I mean it's fine. And maybe Mac will show us something and maybe he will be the next Tom Brady or even the next true bloodsoe."
  },
  {
    "timestamp" : "24:01-24:50",
    "speaker" : "Mike Dussault",
    "text" : "Hey, I'll just I'll just take the next four years. He's a solid quarterback that that can maybe win you some games. And I mean I'll just say too, like, I mean it it's been really cool getting to watch him develop and I mean from the when we saw him in the spring. just the progress he's made has been amazing and and you know just instantly having kind of pocket presence and you know delivering accurate throws under pressure i mean it's you know i obviously he's getting uh super crash course right now but yeah um but just having you know seen him a lot this summer saw him you know we went down to Philly saw him in the joint practices there saw him against the Giants which he had you know a great day when Cam was out Um so I I I I continue everything that's kinda happened the first three weeks. I'm just excited about Mac Jones and and getting uh, you know, see what what happens. I don't know if he's gonna be the next 20 year quarterback here, but I think He's shown enough, he'll be the next few years. He's he's somebody we can be excited about watching."
  },
  {
    "timestamp" : "24:50-25:22",
    "speaker" : "Andy",
    "text" : "And if and even just watching the 2001, two, three, four seasons. Yeah. Like there's the yeah, I mean Tom Brady back then isn't Tom Brady who he is now, you know? So I mean he's still even in the game we're going to talk about after this is making very un Brady-like mistakes, sort of thing. So I mean you kind of have to mistakes. You have to remember that like he hasn't always been this infallible football god and that like there's gonna be some bumps in the road for whoever the new guy is, even if he does end up being that Tom Brady."
  },
  {
    "speaker" : "Mike Dussault",
    "text" : "Yeah. But just love to see that clutch gene. I think that's what was cool about Brady was that he always had the ability down the stretch to make the big plays and and and that and that showed up right away. He wasn't 2007 Brady right out of the gate, but You know, he had I mean uh I think right the next week will be I think the anniversary of the Chargers or maybe two weeks from now be the Chargers game that you know they won an overtime where he threw the ball like fifty times in like week four. So Yeah, it's uh I I'd love to see Mac get that kind of opportunity to to pull a win out, you know, maybe maybe in the last moments. I don't know about this weekend, but but maybe next weekend.",
    "timestamp" : "25:22-25:55"
  },
  {
    "text" : "Yeah, you're right. It's gonna be interesting to see him in that situation and in this high pressure situation too. I think it's close, but Brady wins. And I can love the Patriots and I can love Tom Brady. I don't see why these are mutually exclusive. Because they're going against each other's thief. So I want the Patriots to win, but I don't want to.",
    "timestamp" : "25:55-26:14",
    "speaker" : "Steve"
  },
  {
    "text" : "Pick a side. My thing is that I just don't care about the Bucs. Like I just like I'll watch Tom Brady play in the Bucks. It's great. I don't I just don't care. I mean I can't risk for the Bucks. I don't feel anything.",
    "speaker" : "Mike Dussault",
    "timestamp" : "26:14-26:24"
  },
  {
    "timestamp" : "26:24-26:43",
    "speaker" : "Andy",
    "text" : "Yeah, that yeah, I I I feel the same way. Like it's It's like rooting for like the Arizona Diamondbacks. It's like they're are they even a real team? Like I I don't even are they triple A? I'm I'm not sure. That's kind of how the Bucks feel. They feel they feel like a like a a Disney ride that turned into a football team to me."
  },
  {
    "text" : "Right. It's gonna be over soon. Fun to watch though.",
    "timestamp" : "26:44-26:47",
    "speaker" : "Mike Dussault"
  },
  {
    "speaker" : "Andy",
    "text" : "But it's just Tom Brady that you're watching. You're not watching it for the bucks, are you?",
    "timestamp" : "26:50-26:52"
  },
  {
    "timestamp" : "26:52-27:00",
    "speaker" : "Steve",
    "text" : "Now I get Tom Brady on my fantasy team and I can put bets on him because I used to not do any of that shit because I don't need to be all the way in, you know?"
  },
  {
    "text" : "That's a good coping mechanism. I I deal with it through Madden. I I just I I sacked Tom Brady a bunch of times as the Patriots in it and I feel bad. At least you can get to him in that and only if you put it on easy, otherwise no, it's not good. And even then. Uh all right, Mike. Well, thank you for uh for giving us your time. This has been fantastic. Yeah. Yeah, guys. Can't wait to hear the the rest of the uh the 2001 Super Bowl Sound Odyssey. So look forward to that.",
    "timestamp" : "27:00-27:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Dussault",
    "text" : "Appreciate it guys. And uh yeah, hey, hit me up when you get to the 06 Chargers game. I'll come back. I'll do that. I'll I'll be happy to do that game with you guys. I'll I'll give you my whole live drunken perspective. It was awesome.",
    "timestamp" : "27:29-27:41"
  },
  {
    "timestamp" : "27:41-27:45",
    "speaker" : "Andy",
    "text" : "Perfect. That's what I like to hear. All right, Mike, we'll talk to you soon then."
  },
  {
    "text" : "All right guys, thanks for having me. Appreciate it.",
    "timestamp" : "27:45-27:47",
    "speaker" : "Mike Dussault"
  },
  {
    "timestamp" : "27:47-27:53",
    "speaker" : "Andy",
    "text" : "See you later. Tune in next week to see how much of a blubbering little bitch Greg is."
  },
  {
    "timestamp" : "27:53-27:56",
    "speaker" : "Steve",
    "text" : "On the Patriots Dynasty Podcast."
  },
  {
    "timestamp" : "27:56-27:57",
    "speaker" : "Andy",
    "text" : "Well that was the wrong button."
  },
  {
    "text" : "I meant to do but also friends. They both work.",
    "speaker" : "Steve",
    "timestamp" : "27:57-28:02"
  },
  {
    "speaker" : "Andy",
    "text" : "They do. All right. So there's hope for us yet, Steve. If Mike Dusot can get himself into one Patriots place, we should be able to get a word with Troy Brown. I think that's reasonable.",
    "timestamp" : "28:03-28:17"
  },
  {
    "text" : "You know, the strategy is just work as many angles as you can find, Andy.",
    "timestamp" : "28:17-28:20",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:20-28:23",
    "text" : "Right. And this is what we're doing. So so far, so good."
  },
  {
    "timestamp" : "28:23-28:28",
    "speaker" : "Steve",
    "text" : "Humping every every person who comes on with. Yo, yo, yo, let me not let 'em out. Yo."
  },
  {
    "timestamp" : "28:29-29:29",
    "text" : "Stich collar. I love how blunt you are about with literally every single person that comes on too. Like, hey, do you know Troy Brad? What's his phone number? I need to text him. Good to do it, dude. So I guess I mean it hasn't worked yet, but you do you. Doesn't mean it won't. That's true. Uh all right, we should probably talk about these uh 2004 Patriots because um It's put me in a very current game mood. I think we may have to release this episode a little earlier than our normal Tuesday. Because I feel like it should be released before the Buccaneers game. Sure. So because this uh this is the end of like a a streak of its own that we're coming to. This is the first loss that we have watched. In twenty-one weeks of doing a podcast. Oh episodes.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I only watched the first quarter and then the highlights.",
    "timestamp" : "29:29-29:33"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I mean, so I uh let's talk about a watchability score because I feel like that's inappropriate.",
    "timestamp" : "29:34-29:39"
  },
  {
    "text" : "Uh very low. Maybe I'll give it one and a half. Lombardies.",
    "timestamp" : "29:40-29:45",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "29:45-30:00",
    "speaker" : "Andy",
    "text" : "Oh, not even a half. There's there's no redeeming features on this. I I I was actually I was looking for um for highlights to to put on the website for this. And outside of the two touchdowns that happened, that there aren't any."
  },
  {
    "text" : "Come on, dude. Put every one of David Givens' catches up there. He was a beast. He had eight catches, two touchdowns, over a hundred yards. He did, but sweet catches too.",
    "speaker" : "Steve",
    "timestamp" : "30:01-30:11"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:11-30:34",
    "text" : "He he had one, but they but once he started making the catches, it was almost garbage time, so they stopped trying to replace. It was good, no, I'm saying, but I'm saying by the time he scored it, uh uh the coverage the the TV coverage has decided it was garbage time and so they weren't showing replays. So he had this one like super catch on the sideline."
  },
  {
    "speaker" : "Steve",
    "text" : "That wasn't first down.",
    "timestamp" : "30:34-30:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:37-30:45",
    "text" : "Yeah. And why wasn't it for a first down? Because it was like fourth or third or second and forty or whatever. It was second and twenty-four and it went for twelve."
  },
  {
    "timestamp" : "30:45-30:45",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "30:48-31:10",
    "speaker" : "Andy",
    "text" : "Yeah, and it was uh a toe tap catch in double coverage over Troy Palomalu. Uh and they didn't show a replay. They're just like, uh, they didn't even like mention that he actually caught it. Like, oh, I th uh we're not sure if you caught that one. And then like the referees placed the ball down. Yeah, and so they just like kept on talking. Like, okay. So that play will be on there, Steve, just for you."
  },
  {
    "text" : "All right, good. I'm saying there was very, very little bright. That was the only little bit.",
    "timestamp" : "31:10-31:16",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I'd say there was one other bright spot for the Patriots in this game. And that would be Bethel Johnson, who was literally the only person not having a nightmare day. Yes, because he fumble deck",
    "timestamp" : "31:16-31:29"
  },
  {
    "text" : "Kick return, the long one he broke, he fumbled it right as he went out of bounds.",
    "timestamp" : "31:28-31:32",
    "speaker" : "Steve"
  },
  {
    "text" : "Hey, he he did it out of bounds. It's five by eight.",
    "timestamp" : "31:32-31:34",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:40-31:50",
    "speaker" : "Steve",
    "text" : "When you substitute he didn't come inside the numbers, yeah, so wiped out like a seven-yard run because yeah, which was a rule, it's the dumbest rule of all time, yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "But let's let's actually talk about the the caveats to this game before we like get into all the bad stuff that happened. Because The Pagers came in with, could we call it a skeleton crew?",
    "timestamp" : "31:50-32:03"
  },
  {
    "speaker" : "Steve",
    "text" : "They're just injured.",
    "timestamp" : "32:04-32:05"
  },
  {
    "text" : "They're out. Dion Branch, their number one wide receiver. He's out with injury. Troy Brown is back, but has not looking his same self quite yet. Uh this is his first game back in a while. I think maybe the first game we've seen him this season.",
    "timestamp" : "32:05-32:18",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "32:19-32:20",
    "text" : "Yes.",
    "speaker" : "Steve"
  },
  {
    "text" : "I don't remember. It's it's been a while. I think we may have seen like early on, but he's been out for uh quite a few games. Um Tom Ashworth, their starting right tackle, he's out. And the big one is Corey Dillon, is not playing in this game because Uh he suffered an injury in practice. Practice, I think I said, yeah, like a leg injury. But he played last week on a leg injury too, so I'm wondering if he just kind of like re-aggravated something. Because they've been talking about him and an injury. past couple of weeks.",
    "timestamp" : "32:20-32:50",
    "speaker" : "Andy"
  },
  {
    "text" : "But which if you think about it, I'm assuming he plays next week. I believe so. But he he has like 1600 yards this year and he does it on one less game. Yeah.",
    "timestamp" : "32:50-33:00",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:01-33:08",
    "text" : "Yeah. And I think there was another game where he went out early too. So he kind of did it and Yeah, he did. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "So it's the first game, I think.",
    "timestamp" : "33:08-33:10"
  },
  {
    "timestamp" : "33:10-33:40",
    "text" : "Yeah, I think it yeah. Yeah, it was first. It was it was early in the season, yeah. So tough way to start. And then on defense, um the Patriots decided that uh going up against a red-hot rookie Ben Rothesberger without a defensive backfield was the way to go. Uh Tyrone Poole was out injured to begin with. And then Ty Law went down on the second drive of the game. Like pulled up hurt and tried to like limp off the field and couldn't even like get all the way off. Had to get covered off.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:41-33:51",
    "speaker" : "Steve",
    "text" : "I believe that is Tyla's last map in a Paiges uniform. What? Isn't he done after he's not isn't on on Paiges next year? Because he's hurt the rest of this year."
  },
  {
    "text" : "Is he? He's done for the season?",
    "speaker" : "Andy",
    "timestamp" : "33:51-33:53"
  },
  {
    "text" : "This isn't this angle injury that he hurts him pretty good.",
    "speaker" : "Steve",
    "timestamp" : "33:53-33:56"
  },
  {
    "timestamp" : "33:56-34:08",
    "speaker" : "Andy",
    "text" : "You might be right. Oh, I didn't even put that together, but shit. That sucks because and we'll get into it in a little bit more detail, but that was the beginning of the end for this game."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "34:08-34:11",
    "text" : "It was DeSante Samo's first start, I think."
  },
  {
    "timestamp" : "34:12-34:32",
    "speaker" : "Andy",
    "text" : "Asante's iron pools out. Yeah, so he may yeah, he may be getting his first start. I know he's played before. At this point he's our top corner with Ty La out. Right. And uh Ty Law's replacement is Randall Gay, who uh got absolutely torched in this game. I felt like every time there was a completion, number 21 was there behind the receiver."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "34:32-34:37",
    "text" : "Well the very next play after Tyler went out, they threw that bomb to Plactical Burroughs. Well yeah, yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "After that, but but Randall Gay also went out injured. So there they were talking about the only defensive backs that the pages had left were Dexter Reed and Gerard Cherry.",
    "timestamp" : "34:40-34:49"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "34:49-34:51",
    "text" : "Yeah, see, this is why I didn't watch this game."
  },
  {
    "text" : "Yeah. And I and I wrote down Dexter Reed. I don't even know if I spelled his last name right. I I couldn't tell you because I don't I don't remember a Dexter Reed on this team. But he was out there in the in the end of the game. But This game I mean for all it was it started out alright. The Patriots force a three and out and then get a field goal, but The uh Pittsburgh offense, I think, have been playing pretty well, mainly Ben Rothsberger. This is rookie season where he goes A bunch of games undefeated because they were talking about even at the beginning of this one where the winning streaks to open your like rookie career. is six games. It's going six and oh before your first loss. This is this is fantastic. It was uh Mike Kruzczek, who was a Steelers quarterback in 1976, who's the guy that went six and oh And then Phil Sims and Ben Rosselsberg, I think, are both at four-game win streaks at this point. But Mike Kruzczek in his six-game win streak to start his career. had a touchdown interception uh differential of zero to three. So zero touchdowns, three interceptions, and a QB rating of 67. 9 in those six games. And they went 6-0.",
    "speaker" : "Andy",
    "timestamp" : "34:51-36:12"
  },
  {
    "timestamp" : "36:13-36:17",
    "text" : "So didn't he like not ever start more than that either? Like that's like his entire record.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I I think it might be, yeah.",
    "timestamp" : "36:17-36:18"
  },
  {
    "speaker" : "Steve",
    "text" : "I didn't look it up",
    "timestamp" : "36:20-36:21"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:20-36:26",
    "text" : "Yeah, I didn't either because I I spent as little time on this game as I possibly could after the first quarter, like you said."
  },
  {
    "timestamp" : "36:26-36:30",
    "speaker" : "Steve",
    "text" : "Steelers don't lose again until They lose to us."
  },
  {
    "text" : "Correct. Yeah, this is the time when SEALs go 15 and 1, which is their best ever record.",
    "speaker" : "Andy",
    "timestamp" : "36:30-36:36"
  },
  {
    "timestamp" : "36:37-36:40",
    "speaker" : "Steve",
    "text" : "Big Ben must not have been starting for their first loss of the season, whenever that was."
  },
  {
    "timestamp" : "36:41-36:56",
    "text" : "No, so yeah, uh Big Ben Came in for an injured what the hell was it? No, it was it was after Cordell Stewart. Um here Someone like that, yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh stat check, Greg.",
    "timestamp" : "36:56-36:59",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, where the fuck is Greg? God damn it",
    "speaker" : "Andy",
    "timestamp" : "36:59-37:02"
  },
  {
    "timestamp" : "37:05-37:07",
    "text" : "Deliberate. It is Tommy Maddox.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:08-38:01",
    "text" : "Oh yeah, so it is Tommy Maddox. Yeah, he started season two and one and then Ben Rothsbury came in and went 13-0 the regular season. Did not lose a game. I think he came halfway through one of that one of those games, too. So he came in and the Steelers are actually the first AFC team ever to go 15-1. Um obviously not the best ever record in the AFC. That'll get broken in 2007-ish. But they were actually talking about this last week in last week's broadcast where the Steelers were watching the Jets-Patriots game last week because both teams were undefeated and they were rooting for the Patriots. Because they want to be the ones to end the streak. So it was that kind of Steelers team back with uh the chin, what's his name? Everyone wants the champs, Andy."
  },
  {
    "speaker" : "Steve",
    "text" : "Bill Cow wants the champs. That's true. Literally thought they wanted the champs. And then they got the champs in the playoffs. So were they asking for that too? Because it didn't work out for them.",
    "timestamp" : "38:01-38:10"
  },
  {
    "text" : "I don't think they were. But maybe they were. We'll find out when we get there. But yeah, so uh Bill Cower. And his team were were rooting for the pages because they wanted to be the ones to end this. And uh they are actually coming off a bye week this week, too. So everybody's healthy. Playing this beat up Patriots team who just had a brawl with the the Jets the week before. You know, typical shit. So Started off all right. Paige just led this game 3-0, believe it or not. Um, and defense hadn't been looking good. Ben Rothesburger getting chased around, not getting sacked, because sacking Ben Rothesburger is like sacking a Mac truck. Um, but getting harassed enough so they went three and out the first two drives. And then they almost had a chance to pin the Steelers at their own three-yard line, but that's when the issues started. And the ball got kind of the whoever the gunner was there tried to doubt it, but accidentally booted into the end zone. So it's a touchback. And even then, so here's I I actually printed out the the drive sheet for what happened Because we're talking five minutes and 43 seconds left in the first quarter. And Rothesberger just completed a pass to Barris, uh Plex Goburris. Um, but he but Barris was called for offensive pass interference. So it's first and 20. Pittsburgh on their own 28. And then Rosenberger hits Heinz Ward. uh who was open because Ty Law injured his ankle and might never play for the Pages again. Um two plays later Rothesberger hits Plaxico for 47-yard touchdown over Tyloff's replacement, Randall Gay. Page to get the ball back. First play from Scrimmage after the kickoff. Tom Brady sacked by Joey Porter. Hit from behind. Ball squirts out and Steels recover. And then like four plays later, Ben Rothberger hits Plax Goberris again for a four-year touchdown. So that's two touchdowns. Yeah. We're still in the first quarter, by the way. Pace get the ball back with 22 seconds left in the first quarter. Gonna try and make something happen. Brady gets intercepted. By DeShey Townsend and that is returned for touchdown.",
    "speaker" : "Andy",
    "timestamp" : "38:10-40:40"
  },
  {
    "timestamp" : "40:40-40:44",
    "speaker" : "Steve",
    "text" : "Why are you making me relive this in ya? I told you I already watched the first quarter And that's the thing."
  },
  {
    "speaker" : "Andy",
    "text" : "They need to wallow in our misery. The Patriots were in by the end of the first quarter. The Steels have now scored three touchdowns in three minutes and thirty-three seconds to end the first quarter. Except the first quarter is not over. There's still nine seconds left. So the payers get the ball back, kick return. Uh the first play is called dead because of the false start. And then uh they run the last play of the first quarter, which is Kevin Falk for negative two yards And then Tom Brady gets sacked at the first play of the second quarter by Joey Porter for 10 yards. It's now third and 27. So that is how this game turned. And That's kind of all you really need to know. Like that that was it.",
    "timestamp" : "40:49-41:36"
  },
  {
    "speaker" : "Steve",
    "text" : "First play of the second half, they get the ball. Oh yeah. Got it within like two touchdowns. And Kevin Fault strip of the ball after he catches it and they get it and and second play of the half.",
    "timestamp" : "41:38-41:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly. Then they turn around and score another touchdown and it's 34. Not worth watching 10, yeah, game over. 31-10. Game over. So uh there are two Brady to Gibbons touchdowns in this. The second one is an absolute dime, like you said. Givens is sweet. So if you want to catch that on pastdynasty. com, just watch those highlights. Like don't even, I think we link to the YouTube highlights.",
    "timestamp" : "41:50-42:17"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "42:17-42:19",
    "text" : "Don't even bother. Yeah, just go to the Divens ones."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep, just watch the Given's touchdowns.",
    "timestamp" : "42:19-42:21"
  },
  {
    "timestamp" : "42:21-42:26",
    "text" : "I did actually go to the full game and then go watch the Divin's touchdowns in their entirety.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. There's sweet. So that's the second one. The second one reminded me of uh the one Greg was talking about with David Patton against the uh Bears and that huge comeback.",
    "speaker" : "Andy",
    "timestamp" : "42:26-42:37"
  },
  {
    "timestamp" : "42:37-42:37",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "42:37-42:38",
    "speaker" : "Andy",
    "text" : "In 02."
  },
  {
    "timestamp" : "42:40-42:44",
    "speaker" : "Steve",
    "text" : "Even those highlights on YouTube don't even have them though, so you have to go actually go into the game to watch it."
  },
  {
    "speaker" : "Andy",
    "text" : "Right, right, yeah.",
    "timestamp" : "42:44-42:45"
  },
  {
    "text" : "The only place you can find it is patriotsdynasty. info.",
    "timestamp" : "42:46-42:49",
    "speaker" : "Steve"
  },
  {
    "text" : "Pastdyynasty. com now. Easy to remember. Yeah, they both work, but yes. Pastdyync. com is easier to remember.",
    "speaker" : "Andy",
    "timestamp" : "42:50-42:58"
  },
  {
    "text" : "Passpod. com still work? Because that's what I tell people.",
    "timestamp" : "42:58-43:01",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:00-43:04",
    "text" : "Yeah, Pathspod. com still works. That's how you get to the podcast page on the website."
  },
  {
    "timestamp" : "43:04-43:05",
    "speaker" : "Steve",
    "text" : "Got it."
  },
  {
    "timestamp" : "43:05-43:06",
    "text" : "Just don't tell people that.",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know if Twitter, I just do it like I using my voice I tell people.",
    "speaker" : "Steve",
    "timestamp" : "43:06-43:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:11-43:25",
    "text" : "Yeah, no, Pathspot. com, baby. Um so I think we should probably uh get a sense of what Belichick thought of this game?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:26-43:35",
    "text" : "That was on the uh primetime highlight his interview. Sounds like him now, doesn't sound any different."
  },
  {
    "text" : "Right. So What does Bill Belashak think about this?",
    "timestamp" : "43:35-43:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:41-44:01",
    "speaker" : "Bill Belichick",
    "text" : "They outcoached us, they outplayed us. Um they did a lot of things right and they certainly deserved to win and they won convincingly. Um we weren't very good in any phase of the game. Didn't do much anything right. Any time to give up thirty-four points, especially on the road, it's gonna be hard to win. In those things"
  },
  {
    "speaker" : "Andy",
    "text" : "Can you imagine if like you had a bad day at work and then your boss comes out and says that to the media? Like you are toast tomorrow. I don't know.",
    "timestamp" : "44:06-44:16"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "44:16-44:30",
    "text" : "I mean I'm I'm sure he's actually somewhat glad that the streak ended A that it ended so people stop talking about it and asking questions about it Maybe that ended in such a blow-up way where they made a million mistakes, right? That he can just say, Well, they're not perfect."
  },
  {
    "text" : "Yeah, and that could be one of those, yeah, that's true, yeah. Um Where it's one of those games where you kind of like the um 2001 game that David Patton talked about uh in his Pass from the Pass podcast. And he was talking about the thing that stuck with him in 2001 the most was when they got blown out by Miami. Remember that game? I think it was like right after the Either right before or right after. Oh no, it it was right after the um Brady's first start. It was his second start.",
    "speaker" : "Andy",
    "timestamp" : "44:31-45:03"
  },
  {
    "timestamp" : "45:03-45:04",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "45:04-45:49",
    "text" : "And they had beaten the uh the Colts in his first start. And then they got their doors blown off in Miami in 2001. And Belichick, when everybody, like they, you know, tore into bits in the film room. But then when they went out to the field, there was a Like a hole dug at the end of one of the uh the practice fields. And Balchak took the football and was like, this was the game ball from last game, and they just fucking buried it. He's like, so It's all done. Like we're we're done talking about it. We're done thinking about it. We're moving on next week. Like it sucked moving on. And Patton's like, that was the moment I realized that like we're going to be all right this year. Because we could bounce back from something like that. Why fuck yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:49-45:53",
    "speaker" : "Steve",
    "text" : "Maybe we'll do that after this Brady at Patz game."
  },
  {
    "text" : "Well can you though? They're synthetic fields now. Oh maybe the practice fields aren't.",
    "timestamp" : "45:53-45:58",
    "speaker" : "Andy"
  },
  {
    "text" : "There's somewhere in Dolette Stadium with actual dirt maybe.",
    "timestamp" : "45:59-46:01",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, you gotta find it. Like go out in the parking lot there.",
    "timestamp" : "46:02-46:04"
  },
  {
    "speaker" : "Steve",
    "text" : "He'll bury you in front of TB12 Fitness.",
    "timestamp" : "46:04-46:06"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:08-46:23",
    "text" : "That's not bad. Like be under the sign or something. I like it. I like it. Yeah, I mean, don't watch this game. That's basically what we're telling you. And if you do, it's your own goddamn fault because we've warned you multiple times."
  },
  {
    "text" : "Yeah, it's a very unwatchable game.",
    "timestamp" : "46:23-46:25",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, they did talk to a Steeler fan today. And he's like, well, I would watch that game. Like I fucking bet you would. So if you're a Steeler fan and you listen to this, one Y. And two, feel free to watch this. You'll probably really, really enjoy this game. Bring back a good memory.",
    "timestamp" : "46:25-46:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:43-46:45",
    "text" : "Point A, point B sort of thing.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:45-46:46",
    "text" : "He is so salty."
  },
  {
    "text" : "Fucking love it. I mean they play him again. They do, yeah. Same personnel.",
    "timestamp" : "46:47-46:52",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, the Pages will uh I think will be a bit healthier.",
    "timestamp" : "46:53-46:55"
  },
  {
    "text" : "And at that point, the Steelers are on a big win streak.",
    "timestamp" : "46:56-46:59",
    "speaker" : "Steve"
  },
  {
    "text" : "This is true, yeah. Yeah. So uh time return the favor. That's a great point, Steve. That is a great point. Um man. I'm thinking about best and worse in the back of my head here, and I don't know if I have it.",
    "speaker" : "Andy",
    "timestamp" : "46:59-47:14"
  },
  {
    "speaker" : "Steve",
    "text" : "But there is no other best besides David Givens.",
    "timestamp" : "47:14-47:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Well here's a here's a best. I saw Plaques Gobaris and I wrote down, is that a gun in his waistband or is he just excited to score touchdowns?",
    "timestamp" : "47:17-47:25"
  },
  {
    "speaker" : "Steve",
    "text" : "I hate practical bursts, that's why this game was also awful.",
    "timestamp" : "47:26-47:29"
  },
  {
    "text" : "Yeah, but come on, that's a pretty good one.",
    "timestamp" : "47:29-47:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Is it?",
    "timestamp" : "47:31-47:32"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I thought I thought that was a pretty good burn. It was a pretty good burn. It's cheap. It was it exactly, that's why it's good, because it's salty, just like you.",
    "timestamp" : "47:32-47:40"
  },
  {
    "text" : "No.",
    "timestamp" : "47:40-47:41",
    "speaker" : "Steve"
  },
  {
    "text" : "Yep.",
    "timestamp" : "47:41-47:41",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:42-47:43",
    "speaker" : "Steve",
    "text" : "No, it's not."
  },
  {
    "text" : "Yep. Uh they did show a stat of uh fewest rushing yards per rush touchdown.",
    "speaker" : "Andy",
    "timestamp" : "47:44-47:49"
  },
  {
    "text" : "Yeah, you know. Take this episode and bury that. So how about this?",
    "speaker" : "Steve",
    "timestamp" : "47:50-48:00"
  },
  {
    "timestamp" : "48:00-48:36",
    "speaker" : "Andy",
    "text" : "Oh, oh no, that doesn't work. Uh anyway. I got my numbers mixed up, but no biggie. Uh so this marks the end of the win streak, which is fine. Everything good comes to an end, which we're learning this week with the Patriots and everything. Um It was 399 days since the Patriots last loss. So we've had it pretty good here on this podcast and as Pats fans in general. So one loss is a bit of a blip because these Patriots in 2004 don't exactly lose a lot of games today."
  },
  {
    "text" : "My favorite was on the primetime highlights. They're talking about their last loss and they said it was in the Redskins back in 2002 and Steve Sparrier and they're both like, oh yeah. He's already an afterthought.",
    "timestamp" : "48:36-48:49",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:50-49:24",
    "text" : "Right. Well that's what they they they showed uh a stat where The last two coaches to beat New England uh are no longer head coaches in the NFL. Because one, like you said, was Steve Spurrier, who's just like not a coach anymore, and the other one was Greg Williams, who was the Buffalo head coach, who was now like a defensive coordinator or somebody because he got demoted. So Uh so maybe that that's the death null for um for your boy Bill Cower, because he doesn't last much longer, does he?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but he goes out on his own accord.",
    "timestamp" : "49:24-49:26"
  },
  {
    "timestamp" : "49:27-49:28",
    "text" : "Does he?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "49:28-49:29",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:29-49:33",
    "text" : "I don't remember how he did did he leave after he won that Super Bowl?"
  },
  {
    "text" : "I don't know if that's after that, but he definitely doesn't get fired.",
    "timestamp" : "49:33-49:36",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "No, but he he will go two more years. Uh two thousand five the Steelers win the Super Bowl. And probably should have gone out and topped because the next year, 2006, the Steelers go eight and eight miss playoffs. So uh yeah, and then he doesn't coach again. That was it. So when I was on a cord, but one year too late. Like all good Steelers things. I don't know.",
    "timestamp" : "49:37-50:09"
  },
  {
    "text" : "Dude, you just dragging this episode out to punish me right now, aren't you?",
    "timestamp" : "50:09-50:14",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "50:14-50:15",
    "text" : "Yes, that's exactly right.",
    "speaker" : "Andy"
  },
  {
    "text" : "The worst. I don't want to think about Bill Cowan's stupid fucking mustache.",
    "timestamp" : "50:15-50:19",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "50:19-50:45",
    "speaker" : "Andy",
    "text" : "And his the mustache is what it is, not the chin. The whole look. Yeah, that's fair. All right. Well, if you don't like his mustache, I think you'll probably not like um. This. Where is it? Here it is. Um, the fans. I just want to get your reaction because I don't think you could made it this far in the game."
  },
  {
    "timestamp" : "50:47-50:59",
    "text" : "What? What are they doing? Set! Mm-hmm. Get your hand in the game! Let's go! Let's go! Coach Cower?",
    "speaker" : "Random Fan"
  },
  {
    "timestamp" : "50:59-51:10",
    "speaker" : "Announcer",
    "text" : "Here on Halloween? He's like me."
  },
  {
    "timestamp" : "51:17-51:21",
    "speaker" : "Andy",
    "text" : "So bad. These fucking Steelers fans."
  },
  {
    "speaker" : "Steve",
    "text" : "That was actually a pretty good impersonation and costume.",
    "timestamp" : "51:21-51:24"
  },
  {
    "speaker" : "Andy",
    "text" : "I fucking knew you'd be positive. I should have known you'd be positive about that. Fucking I'm just trying to take the opposite side of you, Andy. So you it was awful. It was it was a half-ass approach. You put a fucking Steelers head on and a headset. I want you to not and had a laminated piece of paper. Yeah, and he had the nice impression.",
    "timestamp" : "51:25-51:41"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:42-51:57",
    "text" : "It wasn't that good. It was so good the TV camera still didn't put it on national broadcast, so they should. And so and we can't get nationally broadcast for all our less than you. At least he can tell his kids he was on TV. You got nothing. You got a stupid podcast. No one listens to it anyways."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:59-52:10",
    "text" : "Oh god damn it. Alright, so the only thing that sucks more than the fans uh and the field in this game is Steve Brown, apparently. No, it's you all right. Give me your best and worst then you No, I don't have any."
  },
  {
    "text" : "I got nothing No, it's a stupid exercise. All we're doing is harping on the bad things, which there are a million in this game. There's nothing good outside of David Gibbons. Should have been a two-minute conversation. You see those cool touchdowns, everything else, that shit sucked. All right. See you next week.",
    "timestamp" : "52:10-52:27",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "52:28-52:47",
    "speaker" : "Andy",
    "text" : "Steve. No, you gotta, you gotta suffer through the bad so that you can appreciate the good. Because now that we've watched this game, we've suffered through it, that AFC Championship game is gonna feel orgasmic. And to Gregory's looking be like, yeah, it's another win. Be like, nah, but we actually watched that."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "52:47-52:48",
    "text" : "I got a lot of character."
  },
  {
    "speaker" : "Andy",
    "text" : "You don't have enough character. No, I don't need to. You have the bad kind of character, Steve.",
    "timestamp" : "52:49-52:52"
  },
  {
    "text" : "Yeah, so I don't need any more. So that's No, you need the good kind of character. No Yes. Characters, not such different.",
    "speaker" : "Steve",
    "timestamp" : "52:52-52:58"
  },
  {
    "timestamp" : "52:58-53:11",
    "text" : "There is. All right, give me your best and worst. Are you for real? Yeah. I already went down this road. We we can't end this podcast until we do best and worst.",
    "speaker" : "Andy"
  },
  {
    "text" : "This is stupid. There is no best every everything sucks. This whole game sucked. Why are we doing this? This is stupid. And I guarantee you're sitting there nodding saying he's given that answer before on the dinner table about best and worst. I bet you has. Definitely. She knows better than to keep asking me, Andy. You don't.",
    "timestamp" : "53:12-53:34",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh all right, I'll do my best and worst. Okay, great. Let's see. Um struggle my best is learning where Ted Johnson got all his anger from.",
    "speaker" : "Andy",
    "timestamp" : "53:36-53:48"
  },
  {
    "text" : "Maybe if you watch this whole game, listen to the commentators the whole time, you're just ridiculous. Yes.",
    "timestamp" : "53:49-53:53",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "53:53-54:30",
    "text" : "I lost uh yeah, I watched the whole thing. I was I was kind of skipping through like the middle of plays by the end of it because it was fucking garbage time. Um But uh they were talking about how all of Ted Johnson's injury issues started uh when he tried to tackle Jerome Bettis the last time they met. So and Ted Johnson will go downhill fast from here. So I think we will now know why Ted Johnson has such an axe to grind against the Patriots and Bill Belichick specifically. But maybe it should be. Uh partially because of Jerome Bettis being so hard to tackle.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "54:30-54:32",
    "text" : "He has a bunch of head issues, right?"
  },
  {
    "timestamp" : "54:33-54:33",
    "speaker" : "Andy",
    "text" : "Bettis?"
  },
  {
    "speaker" : "Steve",
    "text" : "No, Johnson.",
    "timestamp" : "54:34-54:35"
  },
  {
    "text" : "Oh yeah, Ted John. Well he's on the radio now. Mm-hmm. So I don't know. He just, yeah, he's very uh comes across as very anti-patriots and anti-Belichek and what the fuck are they doing? But I mean, so do all Boston sports media these days. So who knows? Maybe it's real, maybe it's uh maybe it's just an act, like it is with everybody else. All right, what's your worst? My best is that Troy Brown is back.",
    "timestamp" : "54:36-55:01",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Is that your best? Catching balls.",
    "timestamp" : "55:01-55:03"
  },
  {
    "speaker" : "Andy",
    "text" : "Hmm. Was that you? You have multiple bests. Yeah. Well, I'm making up for you not having any. Oh, and also Bethel Johnson, we you f you talked about he had that one bonehead play, but you didn't talk about the fact that he did that awesome like the Steelers kicked it almost out of bounds. But it wasn't gonna go out of bounds. So he like jumped so he was standing out of bounds and then picked up the ball. So therefore it's technically out of bounds. We've seen Wes Welker do it before too. Didn't see it. Oh we will. Didn't watch a game, didn't see it. Next. So Bethel Johnson. Next awesome. Uh let's see. Do you want any more bests? I could probably find another one for you. That would get Kevin Falk, leading receiver. That's not necessarily a good sign, but it happened. Yeah. And a fumble. Yeah. All right, so worst um David Gibbons streak ending. That sucks. I don't know what it got up to. It was 25 or his first catch in the in the game was 25th. So it was right, it was almost 30, which is pretty fucking impressive. I asked uh Twitter and apparently there's some like receivers from 1970s. Who all they did were deep balls. So every catch was a first down. That was like hundreds. So so they might be uh the highest uh players with the high the most catches for first downs in a row with these guys like that's literally all they did.",
    "timestamp" : "55:04-56:29"
  },
  {
    "text" : "David Givens was to start a season.",
    "timestamp" : "56:29-56:32",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, well I mean these guys started every season that way. Cause all they did was catch first downs cause every pass to them was like forty yards downfield.",
    "timestamp" : "56:31-56:39"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:40-56:43",
    "text" : "Doesn't sound like real football to me. Sounds like it should be a David Gibbons record anyways."
  },
  {
    "text" : "Yeah, so we're gonna give it to David. So yeah, let's do it. We'll give it to David Gibbons. Um if you design a banner, I'll print it up and we'll see if we can find out where he lives and we'll mail it to him. That'll be creepy at all. No. Okay. We'll ask around. We'll we'll we'll get you to ask uh people if they know where David Givens lives. Yeah, let's start with Troy Brown.",
    "timestamp" : "56:44-57:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Then we'll get to David Gibbons.",
    "timestamp" : "57:05-57:06"
  },
  {
    "speaker" : "Andy",
    "text" : "All right, all right. Well maybe Troy, I mean Troy obviously knows David Givens. Of course, they're boys. So they'll be like, hey, would you would you give him this banner from us? This championship belt. This WWF championship belt. It's most first down good receptions to start a career.",
    "timestamp" : "57:06-57:24"
  },
  {
    "text" : "That's not even it, but alright. Come on. Next. What else? Whatever. Alright. Put this stupid game in the hole and bury it. So you want a worst? No.",
    "timestamp" : "57:25-57:34",
    "speaker" : "Steve"
  },
  {
    "text" : "That's what you're looking for? Because I did my best. Um the worst is the fact that the Steelers are so good. Uh they were after this, they would go on to beat the the other last undefeated team and the Eagles in back-to-back weeks. So they As Mike Dusot was saying, our wagon, they're a fucking wagon. Feeling pretty good. Yep. And they're backing up their talk about wanting to be the ones that break the streak and all that garbage. Garbo. Um Patriots halftime rushing stats. That's probably in the bad column. They had allowed 81 rushing yards and they had rushed for a total of negative one. A great start. No Corey Dillon. Nope. Oh, here's another good worst. The fans in Pittsburgh, they had the worst signs hanging. And I took a screenshot one. It literally just says big Ben number seven. Black letters, yellow background. That's it. That's wrong. Yeah, we we know. We can see he's he's out there. He's the guy in the number seven. Like put some sort of creativity. Like I I don't want the names of people and the numbers of the jerseys they wear.",
    "timestamp" : "57:34-58:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Hey Andy, they're big enough to get it on TV, smart enough to get it on TV.",
    "timestamp" : "58:48-58:51"
  },
  {
    "speaker" : "Andy",
    "text" : "You haven't been on TV.",
    "timestamp" : "58:51-58:51"
  },
  {
    "text" : "You're making fun of all these fans who have been a little bit more than a good thing.",
    "timestamp" : "58:52-58:53",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I've been on TV. I was on TV because I brought a rubber chicken to uh Wimbledon. I was on TV. Prove it. Uh ask Auntie Pauline, she was there with me. No. Yeah. And the Rushbury, the Rushbury's have it on on VHS somewhere, I think. Yeah. So you'll have to ask them.",
    "timestamp" : "58:53-59:14"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "59:14-59:18",
    "text" : "No, you have to you're the burden of proof, Andy. You're the one claiming to be on Wimbledon."
  },
  {
    "speaker" : "Andy",
    "text" : "No, I told you where the proof is. Go find it yourself. Do your own research, Steve.",
    "timestamp" : "59:18-59:22"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "59:24-59:25",
    "text" : "Let's get Greg on it. He's a stat check."
  },
  {
    "text" : "Oh yeah, that's true. Yeah. We'll get him to do it. Whenever he decides to ever show up again. Um So the last so they showed some Patriots winning ways. This was a best. Um 21 straight wins, including playoffs, is the longest streak in NFL history. 18 straight regular season wins, longest streak in NFL history. Seven straight road wins also longest streak in franchise history. No, franchise history. And then, like we said, it was 399 days since the Patriots last loss. It's four days since the Red Sox won the World Series. Fucking right. And uh it's two Britney Spears marriages worth of days is how they decided to Measure, apparently. That's terrible. Page hasn't lost in two Britney Spears marriages. So cool All right. Do you got anything else, Steve? No. Nothing else, Andy. Oh, I got a commentator thing for you.",
    "speaker" : "Andy",
    "timestamp" : "59:25-01:00:28"
  },
  {
    "timestamp" : "01:00:28-01:00:31",
    "text" : "Yeah, but you've got to talk about the rest too.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:00:31-01:00:36",
    "speaker" : "Andy",
    "text" : "I can talk about the refs. Yeah, I got one ref thing. I got one ref thing and one commentary thing."
  },
  {
    "timestamp" : "01:00:36-01:00:38",
    "speaker" : "Steve",
    "text" : "They got commentary things. We got plenty more to go."
  },
  {
    "speaker" : "Andy",
    "text" : "Come on. All right. Okay. All right. Uh the referees. Oh, um, also this this game was played on Halloween, which makes sense because it was such a fucking nightmare. Um, so that's very fitting. And then for referees, you probably didn't see this play because you were a coward and you dipped out early. But um It was a play on it I'm cuddling on the bed and gus. I know I can see that. I'm still gonna I'm gonna talk to you from here though. So the referee, the the play was it was like a one of those quick passes to David Patton. Um, you know, like the the defensive backs playing too far off. And so just like chuck it to him right off the the the snap. But it was kind of low, so he scooped it up off the the top of his toes. And then ran and then at the end of the play, there was a 15-yard face mask because the defender like literally ripped his helmet off by the face mask. So the play got challenged, and the referees reviewed the play. overturn the reception, but just because the play is incomplete, the um The 15-yard face mask still applies. So after all that, even though the Steelers won their challenge, they only got like one yard back on the drive. It was stupid. And then for commentators, this was perfect Chris Sims talking about like he knows what's going on and decides that uh on the pages' first drive that where they score their touchdown. He literally, as he's saying, now's the time to run it, the Patriots run a play action and immediately throw a touchdown pass. So nice to nice to know that he still got it and knows what he's talking about. And uh can predict games in the same way that better commentators can do. Like what's his name, Steve? Oh, Tony Romo, the QB whisperer, who's actually calls those plays. So there you go. That's what I got for referees and commentators. Oh, the another note that they pointed out the Panthers from last year's Super Bowl that the Patriots beat are currently one and six on the year. They've lost again. So struggling mightily after Super Bowl, unlike this Patriots team. So it could be worse. We could be watching a lot more losses, but we're not. So that's great. And I think that's it.",
    "timestamp" : "01:00:38-01:03:06"
  },
  {
    "speaker" : "Steve",
    "text" : "Are you sure?",
    "timestamp" : "01:03:07-01:03:08"
  },
  {
    "timestamp" : "01:03:08-01:03:11",
    "text" : "I think so, yeah. I'm taking a quick look.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, just double checking it. We don't want you to forget anything.",
    "timestamp" : "01:03:12-01:03:15",
    "speaker" : "Steve"
  },
  {
    "text" : "No Cedric Cobbs. There was a Cedric Cobb sighting who was a street Friet getting carries in this game because of the injury to Corey Dillon. I doubt we'll see him again. Uh yeah. Oh, they talked about what Bill Cower did on his uh By week. And you decided he went.",
    "speaker" : "Andy",
    "timestamp" : "01:03:15-01:03:35"
  },
  {
    "text" : "All right. You know where this uh I gotta go. I got some stuff to do.",
    "timestamp" : "01:03:35-01:03:39",
    "speaker" : "Steve"
  },
  {
    "text" : "I believe you, but uh tune in next week to see how much of a blubbering little bitch Greg is.",
    "timestamp" : "01:03:42-01:03:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:03:48-01:03:49",
    "speaker" : "Steve",
    "text" : "Very naughty."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh",
    "timestamp" : "01:03:50-01:03:50"
  },
  {
    "speaker" : "Steve",
    "text" : "An idiot, bro.",
    "timestamp" : "01:03:52-01:03:53"
  },
  {
    "text" : "All right. Well, hopefully next week is uh something a bit more upbeat. What is next week, Steve? I don't know. Oh, Pedri's playing the St. Louis Rams in the Edward Jones dome. What a terrible name for stadium. Super Bowl rematch. Super Bowl rematch from 2001. Mike Marts looking to get revenge. Will he get it, Steve? We'll find out next week on the Patriots Dynasty podcast. Hey Joana. See you Ana.",
    "timestamp" : "01:03:54-01:04:29",
    "speaker" : "Andy"
  }
]