[
  {
    "speaker" : "Mom",
    "timestamp" : "00:00-00:14",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen?"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh welcome back. Uh a long welcome back. Uh to the Patriots Dynasty Podcast. We are the Brown brothers and we're going back and re-watching every game of the Dynasty era. With me today, not both brothers, Greg is actually preparing to go to The current Buffalo game. Him and his friends are stuffing themselves in an RV and driving up to Buffalo, which sounds great, but in reality, uh doesn't smell very good. But with me we have Steve Brown, the good brother, the better brother. The best brother The better brother. Oh no, the best brother. I'm the best brother.",
    "timestamp" : "00:22-01:04"
  },
  {
    "timestamp" : "01:04-01:08",
    "speaker" : "Steve",
    "text" : "Well, if I'm the better brother, I'm automatically the best brother unless you have a brother I don't know about any."
  },
  {
    "text" : "That's fair. I mean we we might. We've been told we look like the mailman, so there might be other brothers out there that we don't know about. But In kind of this actually works out really well. We we've been gone for a few weeks um because shit's just been crazy.",
    "speaker" : "Andy",
    "timestamp" : "01:09-01:25"
  },
  {
    "text" : "Thanksgiving, Patriots game in Carolina.",
    "timestamp" : "01:26-01:28",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep, and I am redoing a kitchen, so Things are just a hot mess right now. So, uh, but everything's kind of worked out for the best because this in the current time, we are, what's the date today? December 2nd, 2021. We are preparing ourselves for, I'd say, the first uh real Patriots Bills game that's meant anything in a while. Wouldn't you say? Sure. I mean this is like the biggest deal of Pats fans.",
    "timestamp" : "01:29-02:02"
  },
  {
    "speaker" : "Steve",
    "text" : "I feel like Bills fans always build it up more than it actually is. Well yeah, I'm talking I'm talking from a Pats fans perspective here.",
    "timestamp" : "02:02-02:08"
  },
  {
    "text" : "Like bill this is this is the Bills Super Bowl every year. Especially because it's in Buffalo. Right.",
    "timestamp" : "02:08-02:13",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And they always get their ass kicked.",
    "timestamp" : "02:14-02:16"
  },
  {
    "text" : "Yes. I was actually going back and and re-like watching everything. And I think Uh the Patriots in like all the all the games against the Bills in Buffalo. Do you want to guess what their record is? I think it's 20 games. Yeah, 20 games. Do you want to guess what their record is? In Buffalo.",
    "speaker" : "Andy",
    "timestamp" : "02:17-02:38"
  },
  {
    "text" : "18 and 2, 18 and 3.",
    "timestamp" : "02:39-02:40",
    "speaker" : "Steve"
  },
  {
    "text" : "You fucking nailed it. 18 and 2. Technically 18 and 3 if you count the uh the Cam Newton game last year. Um so you can you can call it 18-3, but yeah. In the Belichick Brady era 18 and 2.",
    "speaker" : "Andy",
    "timestamp" : "02:41-02:53"
  },
  {
    "text" : "That's fumbled in the red zone, right? That was at Buffalo.",
    "timestamp" : "02:53-02:57",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes. Yep. That was the one where they were driving for the game when he touched down. So Eighteen two and a half 'cause Funka Bells fans. Yeah, it's Cam Newton. He sucks now, you see him. It's terrible. Yeah, yeah, yeah. So the fact that the pages got as much as they did out of him is uh a small miracle. I was big I'm still a big fan of Cam Newton. Yes, I love Cam, but he's just not good anymore. Yeah, yeah, he's just not the well, I mean you can't really judge him this year because like you can't just throw a starting quarterback in two weeks after you pick him up and expect him to like do anything, but Yeah, he's definitely not the uh MVP caliber that he used to be.",
    "timestamp" : "02:57-03:38"
  },
  {
    "text" : "Good thing Greg isn't here. He would be taking us on a whole different trajectory of this podcast by arguing. about how terrible Cam is or something like that.",
    "timestamp" : "03:39-03:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:47-03:49",
    "text" : "Oh undoubtedly, yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Um Dad were aligned Andy. Bel check's the best. He's an awesome coach who really got the most out of Cam.",
    "timestamp" : "03:49-03:56"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:56-04:03",
    "text" : "Right, exactly. And almost beat uh a really good Buffalo Bills team for the first time in two centuries."
  },
  {
    "text" : "Yeah. But from the Bills perspective, you're right. This is probably the biggest Patriots at Bills game in a lot of their lifetimes.",
    "speaker" : "Steve",
    "timestamp" : "04:04-04:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:10-04:10",
    "text" : "Yeah."
  },
  {
    "text" : "Oh yeah. Well at least so they can remember. Because they probably have bigger games like the AC Championship game last year was like a bigger game than this, but it means a lot to them, we'll say.",
    "speaker" : "Steve",
    "timestamp" : "04:10-04:20"
  },
  {
    "timestamp" : "04:20-04:59",
    "text" : "I I've been uh keeping an eye on Bill's social media. And half of them are very confident that the dynasty is over and the Bills are going to stomp the life out of the Patriots this week, and the Patriots are pretenders. And the other half are very nervous. I saw a meme today of um You know the one where Mo is chucking um uh and The Simpsons? Mo the bartender is chucking um who's the the fat drunk out of the bar. Barney. Yeah, Barney's chucking him out of the bar and then like Always the the next frame you see Barney in the background.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "04:59-04:59",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "And so it was that, but um Mo was the Buffalo Bills last year and then the Buffalo Bills this year. And Barney's like creeping back into it. It's like, yeah, that's that's how they feel. They're like, uh oh, uh, this feels familiar. If this game goes wrong, your shit's gonna fall in. They've been let down a lot. They've been so good games. So here's here's a paw quiz for you. Can you me can you do you remember those two games, those two losses?",
    "timestamp" : "04:59-05:27",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "05:27-05:33",
    "text" : "Uh one was the West Velker game where he has a ton of yards and they still lose it. I don't remember at all, but I think we're gonna watch soon."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, 2011, um, where Brady threw four touchdowns and also four interceptions.",
    "timestamp" : "05:33-05:39"
  },
  {
    "timestamp" : "05:39-05:45",
    "text" : "And the other one was is that the week seventeen game where Brady sat the second half? That one was at home.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Nope. No, this was uh this was a very memorable one. This is one that I think Bill's fans still talk about to this day. We've we've done it on this podcast.",
    "timestamp" : "05:45-05:56"
  },
  {
    "speaker" : "Steve",
    "text" : "The only other memorable bills moment I can remember is when they threw the dildo on the field, but I'm pretty sure they still lost that game.",
    "timestamp" : "05:56-06:02"
  },
  {
    "timestamp" : "06:02-06:15",
    "speaker" : "Andy",
    "text" : "Yeah, no, they did. No, this is um the opening of 2003. Oh yes. The Lori Malloy game. Yeah. And the the Sam Adams uh pick six."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:15-06:25",
    "text" : "So I will go on record because this this will come out after the game, right? Uh yeah, this will come out on Tuesday. That the Patriots won't lose 31-nothing."
  },
  {
    "timestamp" : "06:26-06:40",
    "speaker" : "Andy",
    "text" : "Okay. You think the Patriots will win? Not 31-nothing. I'm gonna go on record. I think the Patriots will win this game. I think it'll be real fucking close. I think it's gonna be a dog fight, but I think they they pull it out."
  },
  {
    "speaker" : "Steve",
    "text" : "I just don't think the Bills are mentally over it, you know.",
    "timestamp" : "06:41-06:43"
  },
  {
    "timestamp" : "06:44-06:44",
    "speaker" : "Andy",
    "text" : "No."
  },
  {
    "text" : "One win against Cam Newton when he fumbles in the red zone doesn't mean you're over that hump.",
    "speaker" : "Steve",
    "timestamp" : "06:44-06:48"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:48-07:05",
    "text" : "Yeah. Although they and then they beat uh the pants off the second stringers uh at the end of 2020 as well. I didn't even watch. I knew it was gonna be that So but where are we? We are 2004."
  },
  {
    "timestamp" : "07:05-07:18",
    "speaker" : "Steve",
    "text" : "Before we move on. Uh-oh. That feeling we just said there were like, wow, no, it doesn't really count. That's how Bills feel about every all those 18s. Because there's a lot of them like this game where Patriots beat the pants off the Bills and it wasn't even competitive."
  },
  {
    "text" : "That oh yeah, oh yeah. No, the the uh what was average margin of victory was twenty eight fifteen, so almost two touchdowns. And this one was twenty-nine six. Yes, yeah, so we're talking this is this is a home game, but this is twenty six thousand four.",
    "timestamp" : "07:18-07:31",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:31-07:36",
    "speaker" : "Steve",
    "text" : "is the better is because they only scored him on a punt return touchdown and then missed the extra point."
  },
  {
    "text" : "Yes.",
    "speaker" : "Andy",
    "timestamp" : "07:36-07:36"
  },
  {
    "timestamp" : "07:36-07:37",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "07:37-07:54",
    "text" : "Well, oh we'll we'll get to that. We will get from we'll get to that. That was my favorite. But yes, uh in the Brady Belichick era on the page 35 and 5, and the average score of the games was 2715. So they They generally beat the Bills by two touchdowns.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "com. Correct, yes.",
    "timestamp" : "07:58-07:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Nice, nice job, Steve Brown. You gotta plug your own work, Andy.",
    "timestamp" : "07:59-08:02"
  },
  {
    "text" : "Always the hype guy all the time.",
    "timestamp" : "08:03-08:05",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I need that. I'm not a hype guy. I'm a developer, man. I just build a you need a lot of help. Oh, yes. In a lot of things. Yeah. I'm just doing my little part. Appreciate it. One thing I don't need help in is uh rewatching these games because this is this was just the perfect game for it because we're back in 2004, week 10. Patriots uh have already beat the Bills in week four, 31-17 in Buffalo. This is this game is at home. Last week, uh since it's been a while, was the Rams game, where we first saw Troy Brown on defense because the Patriots so banged up in the defensive backfield that they're starting people who are named Earthwind Moreland and Randall Gay. Oh, yeah. Who apparently was the starting nickel back at LS LSU last year. I didn't know he was a rookie in this year, but yeah. I really ran up he was a rookie. But like him. But he wasn't even like a starting L corner for LSU, he was the nickelback in LSU. So he wasn't even like he's a depth guy in LSU when he's starting on the Patriots.",
    "timestamp" : "08:05-09:09"
  },
  {
    "speaker" : "Steve",
    "text" : "That the Bills could only muster six special teams points against this defensive backfield is Oh, and and it gets worse too.",
    "timestamp" : "09:10-09:17"
  },
  {
    "timestamp" : "09:17-09:52",
    "speaker" : "Andy",
    "text" : "Like this, it gets worse. Um but yeah, and oh and the the last time the pages lost, this I think there were twenty-three of twenty-four wins in this Stretch was yeah a couple weeks ago they got the doors blown off in Pittsburgh on Halloween. But this was Monday night. Which uh gives you the A team. I actually really like these guys. Mike Patrick, Drill Tyson, Paul McGuire. You like these three? I do. And especially in this game, I don't know what it was. I have a note here."
  },
  {
    "speaker" : "Steve",
    "text" : "Really? Two of these douches are recently in the Hall of Fame. Yuck. They're not in the Hall of Fame for their commentating, that's for goddamn sure.",
    "timestamp" : "09:52-10:00"
  },
  {
    "timestamp" : "10:01-10:07",
    "speaker" : "Andy",
    "text" : "I'm gonna have to get you a Joe Thisman jersey like you guys got me a uh what's his name jersey?"
  },
  {
    "text" : "See that's what they're they're they're just pushing storylines instead of actually like commentating on the game. They're just being like, they don't actually say what's going on in front of you to make any commentary on that. That's why Tony Romo is good because he's like Live stream in his head about what's happening. These guys don't even pay attention to what goes in the field and they're just talking about Tom Brady's determination. It's true, but it's like third and two and they make a big stop and like and he's so determined he gets the last person to show up and the first person to leave. Oops, I mean the other way around and just like God you're the worst.",
    "timestamp" : "10:12-10:39",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "10:39-10:50",
    "text" : "Yes, but what was the score at that point when they started bringing up because this game was a blowout like early. It was the whole game. It was it was 20-nothing at halftime and like it it should have been felt like double there.",
    "speaker" : "Andy"
  },
  {
    "text" : "Brady Bledsoe and then they shut cut to Susie Colbert and she's laughing at his mistake.",
    "speaker" : "Steve",
    "timestamp" : "10:50-10:54"
  },
  {
    "timestamp" : "10:54-11:18",
    "text" : "Yeah. Oh yeah. And Susie Colbert, too. Like, I I feel so bad for her because uh part of the like the extracurriculars that were going on was that the uh Red Sox had recently won the World Series. And so they had a couple of Red Sox at the game of like celebrating it. Like they brought the trophy and everything. And they had Uh Kurt Schilling on crutches, showing off the world too.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Just got out of the hospital after the exact after the surgery and everything. Oh that was I haven't no that was peak. That was his peak. Everything else from that moment downhill for Kurt. That is his peak. Yeah, and he's taking a TV appearance and then it's all just",
    "timestamp" : "11:18-11:37"
  },
  {
    "timestamp" : "11:38-12:03",
    "speaker" : "Andy",
    "text" : "Yeah. Oh yeah. He he just fell the fuck off. And the other guy that was there was Johnny Damon too. And so did you catch the interview? It was like towards it. Oh dude, it was so bad. Oh it like I I I couldn't tell if he was just uh like dumb or if he was drunk But I I have it here. He was just drunk. He wasn't drunk. He was just dumb and I don't know."
  },
  {
    "text" : "But listen, because he's like he's almost slurring, but not quite. So let me uh imagine being his coworker and he's just droning on and on in the clubhouse. You're playing baseball. He's just talking and talking without it. Like he went on for like three plays and sold.",
    "timestamp" : "12:03-12:16",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "12:16-12:22",
    "speaker" : "Andy",
    "text" : "Oh my god, that's what I said. Yeah. He just wouldn't shut up So fucking tip a poor Suzy Colbert."
  },
  {
    "timestamp" : "12:26-12:34",
    "speaker" : "Announcer",
    "text" : "Red Sox South Peter Johnny Damon honored before the game. The Patriots won a Super Bowl before your season. What kind of motivation?"
  },
  {
    "timestamp" : "12:35-13:04",
    "speaker" : "Jonny Damon",
    "text" : "Oh it's a huge motivation because they uh showed up or showed up to opening day a couple years ago, throwing out the first pitch and they showed up again this year. And um, you know, those guys inspire us. I mean they know how to play as a team, and that's exactly what we're doing. what we had to do to win a championship. So uh coming out here and supporting them, we're doing any day. We think they're the greatest teams around. And um they support enough like we support them. It's um New England's a very happy place right now."
  },
  {
    "timestamp" : "13:05-13:13",
    "speaker" : "Announcer",
    "text" : "You know, with so much criticism these days of athletes and selfishness, and you mentioned the team and the Patriots are so much of that. How do you forge that?"
  },
  {
    "speaker" : "Jonny Damon",
    "text" : "Well, you have to look towards the team because that's exactly what wins you championships. I mean, look at Kurt Schilling. You have guys like Orlando Cabrera, Dave Roberts making that big stone base. And of course we have the big guys, Ortiz and Manny and uh, I mean, you have to do that. I mean that's something very special. Keith Fall, Pedro, I mean, on and on and on. I mean there's 15, 16 guys who uh play number two. And uh that's what makes a great team. So um I'm very happy. happy of what we accomplished. These fans of New England. They're the absolutely, they're the best. And um I mean this is the best place in the world to play and I mean they've uh made me happy and I know they've made our teammates very happy and we are very happy that we got to bring a championship to them.",
    "timestamp" : "13:13-14:06"
  },
  {
    "speaker" : "Announcer",
    "text" : "Congratulations. Enjoy the office. Alright, thank you. Thank you very much.",
    "timestamp" : "14:06-14:10"
  },
  {
    "text" : "Do you see his face at the very end there? Go back like 10 seconds. Right when he finished, he looks up off camera. Like what the fuck was that? Like even look at that. We're off. We're off. He's like, there's 15, 16 guys. He named nine of them, including himself. Yeah. Oh man, we'll save that so we can Is it happy like three, five times in a row? Yeah.",
    "timestamp" : "14:11-14:38",
    "speaker" : "Steve"
  },
  {
    "text" : "And then he's like, oh you know, this is the best place to play. And then he immediately accepts us.",
    "timestamp" : "14:38-14:43",
    "speaker" : "Andy"
  },
  {
    "text" : "I'm happy and I hope the fans are happy and the team is happy and we like how happy they make us work feel happy. So this is a happy place.",
    "timestamp" : "14:43-14:50",
    "speaker" : "Steve"
  },
  {
    "text" : "But now I'm now one of the Yankees.",
    "timestamp" : "14:52-14:54",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "14:54-15:05",
    "text" : "That's why Monday night also the worst. Terrible production. You couldn't see the down and distance on the score clock. You know, I was always down because I was watching it and doing something else. Oh yeah, yeah."
  },
  {
    "text" : "Oh, I thought it was alright. I like it. I like the uh well they have the Sky Cam, which is still. I think I'm just a uh a connoisseur. So I I can understand the the finer points.",
    "timestamp" : "15:06-15:21",
    "speaker" : "Andy"
  },
  {
    "text" : "Fine point in the commentators' favor. I'll give them one this one bone. All right. They call the they're better than the Bills defensive coordinator Because they called the touchdown to uh Fourier. He's like, oh, look at number eighty-eight. It's a place where they like to go to him. Corey Dylan's off the field, and sure enough, Tomberry throws a play action to Christian Fourier for the touchdown. And it's like, oh wow, great call. Joel. It's like, yeah, he knows it. What the hell are you doing? DC on the bills letting that guy go free.",
    "speaker" : "Steve",
    "timestamp" : "15:22-15:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Fucking brutal. Yeah. Who was the coach on this team? Oh, this is Mike Mullarkey. This is back in the day. That's a bonehead Bill's move. Oh yeah. Yeah. But uh yeah, though uh I thought the the best part about the commentators in this was I think Paul McGuire was just having a bad day or something, but he was getting super snippy with the other two. Like they'd say something, he was like, no, that's wrong. And then just like let it hang. It was fucking beautiful. It's awkward. Yeah, that that's the best part.",
    "timestamp" : "15:49-16:18"
  },
  {
    "text" : "I love the awkwardness of it.",
    "timestamp" : "16:18-16:19",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "16:20-16:21",
    "speaker" : "Andy",
    "text" : "No, I want good commentating."
  },
  {
    "text" : "Good. It was telling me things about the game that I don't already know. These guys don't even know the game. Oh Joe Thizman does. Joe Thizman was the original Tony Romo, dude. No, Dro Disman, also bad. And you can't even hear him because the other two guys are bitching about who's right about if that was the right call or not. Three plus.",
    "timestamp" : "16:21-16:36",
    "speaker" : "Steve"
  },
  {
    "text" : "That's true. To be fair, they they did they were legitimately pissed off about the uh Roughing the past on Ironney for him. Which nowadays a hundred percent rushing the Oh yeah, it definitely was. It was.",
    "speaker" : "Andy",
    "timestamp" : "16:37-16:51"
  },
  {
    "text" : "He hit him. Just above the knees.",
    "timestamp" : "16:51-16:54",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "It was awkward, yeah.",
    "timestamp" : "16:55-16:55"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah. His foot is stuck in the ground, that's a blown knee.",
    "timestamp" : "16:56-16:59"
  },
  {
    "text" : "Yeah, so let's let's just talk about the the scoring in this real quick. Um Patriot, like the first quarter nothing really happened. Pats kicked the field goal, no big deal. Um and then there's a bunch of bone-headed Bills moves in the first quarter.",
    "timestamp" : "16:59-17:14",
    "speaker" : "Andy"
  },
  {
    "text" : "What are you talking about? All right, give them to me. I have this is my new thing. Every time you play the Bills, they do a bunch of boneheaded things that you just like, that's just what are you doing? Your Bills first kick of the game The returner catches it and runs in the end zone and the rest are like, we'll start that at the one-yard line. Yeah. Then they review it for 10. And they had to they had to challenge it.",
    "timestamp" : "17:14-17:34",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "17:34-17:34"
  },
  {
    "timestamp" : "17:34-18:00",
    "text" : "The Bills had to challenge it to get it to be a touchback. And it took 10 minutes. So like a way to kill the momentum. Like, oh, it's Monday night, let's go. And then like, all right, first kickoff. We're gonna have a 10-minute review. Yeah. Oh Oh, terrible. But why even putting that on the board, Bills? Like it's a bone-headed move. It's still they get their first possession. And they do a 24-yard punt to the 10-yard line.",
    "speaker" : "Steve"
  },
  {
    "text" : "That's true. Oh, well, but even before that though, um they tried to do a flea flicker, but the Patriots rushed so well that they were Standing next to Drew Bledsoe when whoever it was the running back went to turn around and pitch it. So he's like, fuck it, and kept it, and still ended up like running for 10, 12 yards. That was actually a good play by Willis. This was Willis McGee's fourth start, I think. It was. And his other three starts this season, he had all rushed for a hundred yards.",
    "speaker" : "Andy",
    "timestamp" : "18:01-18:28"
  },
  {
    "timestamp" : "18:29-18:31",
    "speaker" : "Steve",
    "text" : "And he was the guy who tore his ACL in college, right?"
  },
  {
    "text" : "Yep, yep, yep, yep. So this was his rookie.",
    "speaker" : "Andy",
    "timestamp" : "18:31-18:34"
  },
  {
    "text" : "He must have sat up the whole first year, I feel like.",
    "speaker" : "Steve",
    "timestamp" : "18:37-18:39"
  },
  {
    "text" : "Something like that. Yeah, yeah, yeah. So this this was his first time seeing the field. After be a first round pick. Yep. Yeah. Um but yeah, so and then you're right, they drove to the New England 35 and punted. Good start.",
    "timestamp" : "18:39-18:54",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "With they had like it was like a fourth and four too. Like you really Patriots had better team, like the Titans when we played them. They were going for it on fourth in the red zone a lot. Yeah. Putting extra pressure on the defense to see if they can convert.",
    "timestamp" : "18:55-19:08"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:08-19:09",
    "text" : "So you have to, yeah."
  },
  {
    "timestamp" : "19:09-19:19",
    "speaker" : "Steve",
    "text" : "Scare play calling. And then they punt it 24 yards to the 10. And like immediately Corey Dillon gets the ball. Falls over in the hole, no one touches him and he like rolls on the ground for the first down."
  },
  {
    "speaker" : "Andy",
    "text" : "So yeah, I I think this game it it felt like the pages driving up and down the field. They had like a two to one um advantage in like uh time of possession like they just Ran the ball at will. Because this is supposed to be a good Bills defense too.",
    "timestamp" : "19:22-19:39"
  },
  {
    "text" : "They hadn't uh the Bills defense was sort of like the Patriots defense of the I don't care what you get between the twenties, but in the red zone, they're pretty good in the red zone.",
    "timestamp" : "19:39-19:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "19:48-20:14",
    "speaker" : "Andy",
    "text" : "Well no, uh this year they're chippies. They were they're almost like uh this year's Patriots where they they were giving up Uh 268 total yards per game, which is phenomenal. And then they gave up 273 in the first half of this one and over 400. Which is the first time this Bills defense had given up four hundred yards um since two years ago against the Pats."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but Venetary kicked a 20, a 24, and a 27-yard field goal. They did good in the red zone. That's true, they did. The defense kept them in it as best they could. They gave a bunch of yards, they were on the field for twice as long. Yeah.",
    "timestamp" : "20:15-20:27"
  },
  {
    "speaker" : "Andy",
    "text" : "And the their offense was uh Trocious. I I don't think that's a strong enough word, Steve. It was let me give you this stat line. Uh Drew Bledsoe's passing. Uh 19 attempts, eight completions, seventy-six yards. Three interceptions, two sacks. How many how many completions? Eight. Eight of nineteen.",
    "timestamp" : "20:27-20:54"
  },
  {
    "timestamp" : "20:55-21:26",
    "text" : "And you get three interceptions. Yeah. Yeah. And this is coming into this game. Against Earthwind Moreland and Randall Gay and Troy Brown playing a lot of Corner snaps. Yeah. Yeah. Their safeties were in there. Harrison and he played especially well. And Eugene Wilson had interception on a terrible ball by Drew. Yeah. On a deep ball. Yes. Like I said, this game could have been way out of hand. This is what I'm saying.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Yeah, if you convert any one of the one, two, three, four, five Vinateri field goals for a touchdown. This game's over. But they only score. This game was already over. Yeah, exactly. But yeah, it's even more over.",
    "timestamp" : "21:30-21:45",
    "speaker" : "Andy"
  },
  {
    "text" : "You didn't even get any offensive points.",
    "speaker" : "Steve",
    "timestamp" : "21:46-21:49"
  },
  {
    "speaker" : "Andy",
    "text" : "No.",
    "timestamp" : "21:50-21:50"
  },
  {
    "speaker" : "Steve",
    "text" : "Not even from the two-yard line.",
    "timestamp" : "21:51-21:53"
  },
  {
    "timestamp" : "21:53-22:09",
    "speaker" : "Andy",
    "text" : "Right. So, yeah, both uh Patriots touchdowns came in the second quarter. Uh a couple of Brady touchdown passes. The one to Patton was nice because it took him a while to find him, but he was wide open. Oh yeah, yeah. And then the four one was a nice nice play."
  },
  {
    "speaker" : "Steve",
    "text" : "You like fake block almost fell down and got up and got touched down.",
    "timestamp" : "22:09-22:12"
  },
  {
    "timestamp" : "22:12-22:46",
    "speaker" : "Andy",
    "text" : "Yep, so that was nice. Um and that was Those were sandwiched between uh uh Bruce Key interception of Drew Bledsoe, which is the second one of the half, uh, on top of the Eugene Wilson one you mentioned And actually it was like, you know, the the Patriots strove down, scored a touchdown with not a lot of time left, like right around two minutes, and then Bloodzo immediately gets picked off like two plays later. And so the pages have like another two-minute drive and they go down and score another touchdown. And so now it was 6-0 and now it's 20 to nothing at halftime and this game's over. Fucking done. Um it would always die."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "22:46-22:49",
    "text" : "I mean before started, I feel like."
  },
  {
    "timestamp" : "22:49-23:32",
    "text" : "Yeah. I mean because in the third quarter the Patriots started the field goal and then Nothing happens, bunch of three and outs until Buffalo returned the punt for a seven yard touchdown. Went for a two-point conversion, and that's the one that Rodney Harrison had the roughing the passer because he dove and hit Uh Drew Bledsoe right above the knees, like right on those uh like thigh pads. And it looked awkward as well. That probably hurt because Bledsoe like had to jump and his knees went back, but it was awkward as fuck. So he got the call and they went for two-point conversion again and they still failed. Yeah. Tried to run up the middle with Wills McGee and I think he lost two yards. It wasn't close.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Well bad. They they crushed Willison Gahee. He must have been super hot coming in. He had two point six yards per carry. Yeah, he was that's why Goodrew was so bad because They shut down the run so effectively early that it was all him passing. I felt kind of bad. Again, you always feel bad for brewing these games because he had no help from the run game.",
    "timestamp" : "23:33-23:50"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:52-24:10",
    "text" : "And and his guys were dropping like even if he did put the ball in their hands, they were dropping like big plays, like third and fourth down conversions were getting dropped, and it's just like a typical like poor Drew Bledsoe game. You're right. It was a lot of it wasn't his fault, but then you turn around all of the interceptions."
  },
  {
    "timestamp" : "24:11-24:14",
    "speaker" : "Steve",
    "text" : "The Eugene Wilson was a bad throw for sure."
  },
  {
    "text" : "Yeah, that may have been like a miscommunication route too. He just didn't see he didn't even see Teddy Brewski. Yep, didn't see Teddy Brisky. And then the last one. This is what Greg was teasing in the last episode that I had forgotten about. But this is the the Druist of Drew Bloodsoe. The Bloodsoist Play where he is picked off by none other than his former favorite receiver, Troy Brown. to start the fourth quarter.",
    "speaker" : "Andy",
    "timestamp" : "24:14-24:40"
  },
  {
    "speaker" : "Steve",
    "text" : "He just couldn't help he just couldn't help throwing it to him. Couldn't felt so natural. Yeah, he's like I recognize him. Has he thrown to Troy Brown in his career? Oh, good question. A ton, you know? Yeah, I bet the Browns drafted like ninety seven, ninety-eight. Uh yeah, around then. Maybe a little bit. And Blood Soul was right around there too. Yeah. And Troy B esta by the time Brady came along, he was well established as awesome.",
    "timestamp" : "24:41-25:09"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:09-25:10",
    "text" : "Yeah."
  },
  {
    "text" : "You probably play with Ben Coates.",
    "timestamp" : "25:11-25:12",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "25:13-25:14",
    "text" : "Oh, Troy?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:14-25:15",
    "text" : "Yeah, do you think?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "25:15-25:16",
    "text" : "Oh yeah, I think so.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:16-25:19",
    "speaker" : "Steve",
    "text" : "I think they have a lap. Budshell loved Ben Coates."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, let's see.",
    "timestamp" : "25:19-25:20"
  },
  {
    "timestamp" : "25:20-25:31",
    "speaker" : "Steve",
    "text" : "Um Troy Brown. I don't know who was the starting tight end on the Bills. I said his name at the beginning and I immediately forgot it because it was that forgettable. Yeah, it was nobody worth. Uh there was no Ben Coats in Buffalo."
  },
  {
    "text" : "True Brown got drafted in 93. Oh, geez. Yeah, he's been around for 93 to 2007. That's a hell of a career. So let's see, 93. Drew Bledsoe was the quarterback, backed up by Scott Seekels and Scott Zolak. The leading rusher was Leonard Russell with a thousand yards. Uh let's see, the leading receiver was Ben Coates. 659 yards, eight touchdowns. Because Ben Coates 91 through 2000. So yeah. They definitely overlapped.",
    "timestamp" : "25:31-26:10",
    "speaker" : "Andy"
  },
  {
    "text" : "You're never gonna be able to figure out how many completions. But whatever it is, add at least one because Troy got another completion from Drew. And did you see his face? And he's running off the field. That is the most hype I've ever seen Troy Brown ever. He was kind of a flatline guy, you know?",
    "timestamp" : "26:11-26:27",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "26:27-26:35",
    "text" : "Yeah, no, that smile was just light up the whole stage. Electric. Electric. Yep.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "26:36-26:44",
    "text" : "Maximum stuck. That was awesome. Oh, it was so good. I love that. When you put that highlight, make sure you capture his whole"
  },
  {
    "timestamp" : "26:44-27:06",
    "text" : "Oh yeah, oh no, the highlight goes for the full, yeah, everything. It's it's top notch. It's like the perfect it's the epitome Troy Brown too. Because he was just in the right spot, good coverage, and then it was a bad throw by um Drew Bledzo and just put it like right on Troy Bron's hands. They actually retarded for a good like 15-20 yards too.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:06-27:26",
    "text" : "His number eighty number eighty was covering number eighty because he was covering Eric Molds too. It wasn't like he was covering scrubs. No, yeah, he was covering like a legitimate. Eric Molds run like a he ran like into the formation, then back out. He did like a pretty hard Root the cover and Troy just mirrored it. He was in his back pocket the whole way through. Yeah. It's fantastic. Yeah. So I know this trout.",
    "speaker" : "Steve"
  },
  {
    "text" : "I've run this a million times. All right, let's see. Uh okay, here you go. Drew Bloodsell Troy Brown, 266 receptions.",
    "speaker" : "Andy",
    "timestamp" : "27:26-27:35"
  },
  {
    "text" : "So 2026. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "27:35-27:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:38-28:29",
    "text" : "Perfect. There you go. Oh boy. Um unfortunately that was short-lived, that interception, because Brady was, I think it was maybe two plays later, was picked off by Nate Clemens. Um and this is where the uh rest of Bloodzill's offense kind of failed him because they They were they're on like the pages 30 or something like that. They were like deep inside and then went for it on because they're down, you know, 29 to 6 at this point, or 26 to 6. So they have to score touchdowns. Wentford on third and seven and a guy dropped it. Wentford on fourth and seven. And who was it? Lee Evans maybe made the catch, but like jumped up to make the catch and came down out of bounds, even though he didn't have to jump. It was just like So turnover and dance. And then that was it."
  },
  {
    "timestamp" : "28:29-28:47",
    "text" : "I skipped that part. I was like, pfft, those ain't gonna do nothing. This their off it sucks. I look at the pages drive and it was all Corey Dylan, Cory, Dylan, Corey, Dylan, Kevin, Fault, Kevin, Fault, Corey, Dylan, Corey Exactly, okay. Venetari field goal from the Buffalo 20.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly. Yeah. And then now we're officially in garbage time. Uh the pay the Bills bring in their uh their savior for the future, JP Lossman, who they had just drafted out of I don't know if I can remember first round out of Tulane. That's what it was, yep. Uh and he was like mediocre at Tulane. He threw like 30 something touchdowns and like 17 interceptions or something like that. Okay. Um But yeah, so yeah, Bledsoe just Did not have a good day. Eight of nineteen, seventy-six yards and three interceptions. What was their total yards? Uh their total yards in this game. You wanna give me a ballpark? Give me a guess?",
    "timestamp" : "28:48-29:32"
  },
  {
    "timestamp" : "29:33-29:42",
    "text" : "150 less Oh, that's tough because Corey Dillon ran for 151 yards. That's well, that was my barometer. I was like, did Corey Dillon outgame the whole team?",
    "speaker" : "Steve"
  },
  {
    "text" : "He did uh by 26 yards. They they had a total 125 yards total. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "29:43-29:49"
  },
  {
    "text" : "Well, I guess Corey Dillon had 156 because he has five yards receiving as well.",
    "timestamp" : "29:49-29:53",
    "speaker" : "Steve"
  },
  {
    "text" : "They rushed for 50 yards and had 75 night passing yards if you Factor in sacks and stuff.",
    "speaker" : "Andy",
    "timestamp" : "29:53-30:04"
  },
  {
    "timestamp" : "30:04-30:09",
    "text" : "Oof. Cory Done was a beast in this game. Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "And he was like he kept getting he would get the edge and then like wow look at that big dude move. And he would just turn up field and you could just you could sense the fear in the defensive backs.",
    "timestamp" : "30:09-30:19",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "30:19-30:25",
    "speaker" : "Steve",
    "text" : "Yeah, oh yeah, and then that that safety coming over to try and hit him just not having a good day because we Dylan was right."
  },
  {
    "speaker" : "Andy",
    "text" : "Well they actually uh had a quote by Lloyd Malloy talking about coming into this game. He's like talking about Corey Dillon. He's like, uh Us defensive backs, like when you go to tackle Corey Dillon, you have to want to hit him. Otherwise you have no chance. Like you have to want to do it. Otherwise he's just gonna run you over like you're not there. That's exactly what happened.",
    "timestamp" : "30:25-30:46"
  },
  {
    "timestamp" : "30:46-30:51",
    "speaker" : "Steve",
    "text" : "He looks bigger than 6'1, 225. But at this point, that's an NFL linebacker."
  },
  {
    "text" : "Right. Six one two twenty five. That's still a I mean two twenty-five is a big boy. But yeah. Maybe Harris is somewhere around there. Probably.",
    "speaker" : "Andy",
    "timestamp" : "30:51-31:00"
  },
  {
    "speaker" : "Steve",
    "text" : "They also look way bigger because they're wearing the big old shoulder pads back in the day. Yeah, the huge that's exactly what it looks bigger. Everybody looks way more massive. It's hilarious.",
    "timestamp" : "31:00-31:07"
  },
  {
    "timestamp" : "31:08-31:08",
    "text" : "They do, yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, everybody's more streamlined nowadays. It's like NFL Blitz. Couldn't you put in a code where you make the dude super massive?",
    "timestamp" : "31:08-31:14",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "31:14-31:24",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, yeah, yeah. Well, I mean they were already still pretty massive even without the code, but yeah. That was a fucking great game. Just power bombing people after the play. So good."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:24-31:34",
    "text" : "Yep. JP Lost win's stat line. One for two five yards with an interception and a sack, which he dropped the ball in that sack too, right? Yeah. Yeah. He fumbled that, which was recovered by the Patriots."
  },
  {
    "timestamp" : "31:36-31:37",
    "speaker" : "Andy",
    "text" : "Not a good day."
  },
  {
    "timestamp" : "31:39-31:41",
    "text" : "He had one rush for five yards too.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes. So he had ten total yards in his first ever. And the pay the pages finished with four hundred and twenty eight total yards. Against the Bills defense who was averaging what did I say? 30 yards. Yeah, they ate him up 268 per game.",
    "timestamp" : "31:41-31:55"
  },
  {
    "timestamp" : "31:55-32:02",
    "speaker" : "Steve",
    "text" : "Corey Dillon started running and then they had no chance. And Brady was playing similar to what Mac Jones is doing now where he's just hitting the play action. Yep."
  },
  {
    "timestamp" : "32:02-32:10",
    "speaker" : "Andy",
    "text" : "We'll go back again to the quick guys and letting them run with it. Yep. And uh the Bills had not given up a hundred-yard rusher this season. That ended"
  },
  {
    "text" : "Mainly because by him outgaining the offense by a significant margin.",
    "timestamp" : "32:12-32:17",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Corey Dillon gained 42 yards on the first drive. Just fucking setting the tone. Yeah, he was the best. Yeah. Yeah. It was it was great. Um another stat that I actually no, we'll save that. Um But yeah, this is uh fucking crazy ass defensive backfield. There's just yeah, just the the names in here. No time like you because you're your top two starting Cornerbacks are out. Tylaw and Tyrone Pool. Both out. Asante Samuel was kind of in I don't even think he was they said he was starting, but I didn't see him. Um, so you're starting Randall Gain, Earthwind Moreland, and Troy Brown as your three defensive backs. And the front seven was just so good that it didn't matter. Uh, but I think We talked a bit about JP Lossman, his interception that he threw to Tully Bantacane. We had a Tully Bantacane sighting. He had a sack in this game and an interception. So sign of things to come. I guess a little bit. Yeah. Look him up real quick. I want to know how tall he is, because he looked a whole lot shorter than anybody else in that field. He was always because short. I remember he was not a big dude. And all yeah, he's always wearing 48 too. So you know he's not like a a weird number. He's not a star. He he's definitely a um a special teams first guy because he's in the forties.",
    "timestamp" : "32:17-33:34"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "33:34-33:46",
    "text" : "I mean have we even had a number 48 since? Uh I don't know about 48. He's six two two fifty. Jesus, so he's twenty five pounds heavier than Corey Dillon and an inch taller."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so he's bigger than Corey Dillon and yet he he's dwarfed by the rest of the year.",
    "timestamp" : "33:46-33:49"
  },
  {
    "timestamp" : "33:53-33:54",
    "text" : "Again, right now.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, no.",
    "speaker" : "Andy",
    "timestamp" : "33:54-33:55"
  },
  {
    "timestamp" : "33:55-33:57",
    "speaker" : "Steve",
    "text" : "That's a big NFL linebacker."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but back then he was dwarfed by literally everybody else on that field. It was ridiculous. But yeah, so the interception was fantastic because JP Lawson rolls out. Now he's supposed to be this like athletic ish quarterback who, you know, gunslinger, Brett Farr sort of thing. And he throws it probably three yards directly into Tully Bantacane's chest, who was also rolling out with him. Like literally just threw it to him. Three yards.",
    "timestamp" : "33:57-34:26"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "34:27-34:39",
    "text" : "I didn't see this interception actually. I didn't watch this game because it was so bad. It was unbelievably bad. Now I'm interested. I'm gonna go on to padsdynasty. com and watch that highlight."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:39-34:41",
    "text" : "Yeah, I'll make sure it's up there."
  },
  {
    "timestamp" : "34:41-34:49",
    "text" : "You should put it on there before we do these things because sometimes, you know, Greg doesn't watch any of these games. So we can actually watch the highlights we're talking about after we talk about them.",
    "speaker" : "Steve"
  },
  {
    "text" : "Well, y if if there's not many I will, but there was like twenty different highlights in this game. So they're still uploading as a as we're doing this. It takes a while. Oh my goodness. Yeah, for how much they whooped them up. Yeah. Yeah. So many highlights. So many like just even the just the big Corey Dillon runs. You had like a whole like four or five separate 10 plus yard runs where you're running over people and all sorts of stuff. Ridiculous.",
    "timestamp" : "34:49-35:19",
    "speaker" : "Andy"
  },
  {
    "text" : "Alright, what else we got in here?",
    "timestamp" : "35:19-35:21",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, I think of uh I think I've touched on all my things here. So, you know, your typical Bills game. Patriots running up the score, even without a defensive backfield. Uh yeah. All right. Give me your best and worst, Steve. You go first. I always go first. You want me to go first? Okay. Well, I'm gonna take all your best though No, you're not. I had a million bests. Alright. There's a lot in this game that you can pick. Um I liked the They they were kind of like interviewing Tom Brady, but they'd obviously done before the game, but like kept interspersing it. And one of the things was that uh Yeah, they just draw they sprinkle in a couple of like interesting factoids. One of them was that his teammates call him Mr. Wonderful. Which I think that sounded corny as fuck. Yeah, but I I feel like I've seen that somewhere. Where uh like in his uh I don't know if it's like his uh pro football reference No, it's not in there, it's somewhere. Um oh Jesus. Because Pro Football Reference will have like the name and then like in parentheses will have all the nicknames for the the people. So but I've I've seen the the Mr. Wonderful somewhere.",
    "timestamp" : "35:24-36:45",
    "speaker" : "Andy"
  },
  {
    "text" : "It's like Kuba Susie Colbert is saying it, so I didn't trust it. I want to hear it out of Brady's mouth before I believe that.",
    "speaker" : "Steve",
    "timestamp" : "36:46-36:50"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:51-36:56",
    "text" : "That's fair. But I mean it's something somebody called him So I've called Tom Brady all sorts of things."
  },
  {
    "speaker" : "Steve",
    "text" : "He just doesn't know it.",
    "timestamp" : "36:56-36:57"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:58-37:28",
    "text" : "But here's here's the list of Tom Brady's current um Nicknames on Pro Football Reference. Okay. TB12, obviously. Tom Terrific. Touchdown Tom. Don't really know. Ghost. Yeah. Which that's not really a nickname. It's he's just the greatest of all time. Here's where it gets weird. The Pharaoh. I don't remember that one. I've never heard that one. Comeback kid."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:28-37:33",
    "text" : "Uh yeah. Yeah, like that was kind of like an early. When they first started coming back a bunch, I called him that."
  },
  {
    "text" : "Or sir",
    "speaker" : "Andy",
    "timestamp" : "37:33-37:36"
  },
  {
    "timestamp" : "37:37-37:38",
    "speaker" : "Steve",
    "text" : "Like S-I-R?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:38-37:48",
    "text" : "Yeah. That's not a nickname, that's just like salutation? Yeah, exactly. That's just what you call yeah, I don't know."
  },
  {
    "text" : "It's a sign of respect maybe? Hello, sir. I mean I respect him, but I don't remember anyone calling him Sir Brady. No. I mean I don't hate it That's not bad.",
    "timestamp" : "37:48-37:59",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "37:59-38:00",
    "speaker" : "Andy",
    "text" : "Sir Brady?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Yeah.",
    "timestamp" : "38:00-38:01"
  },
  {
    "timestamp" : "38:01-38:02",
    "speaker" : "Andy",
    "text" : "The brave Sir Brady."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. If you would call him Tom Brady, make no no no, it's actually Sir Brady. Yeah. Start correcting people, Andy. I'm sorry, I'm sorry. It's the pharaoh too. According to ProFootballreference. com, he prefers to be called Sir. One of his officially recognized nicknames on ProFootballreference. com.",
    "timestamp" : "38:02-38:19"
  },
  {
    "timestamp" : "38:19-38:44",
    "speaker" : "Andy",
    "text" : "Uh I'm sorry. He his he'll always be Mr. Wonderful to me. But this uh the other fun tibet in this was that um At this point in his career in 2004, he has more Super Bowl MVPs than he does Pro Bowls in his career. Which is interesting. Kind of crazy to think about."
  },
  {
    "speaker" : "Steve",
    "text" : "Like he just I'm assuming he goes this year, so you yeah, you would have to think. And he doesn't win Super Bowl MVP, so it evens up. Maybe. Yeah, we'll see. We know who wins Super Bowl MVP, Andy.",
    "timestamp" : "38:45-38:58"
  },
  {
    "text" : "Yeah, we don't know if he wins a Pro Bowl though.",
    "speaker" : "Andy",
    "timestamp" : "38:58-39:01"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "39:01-39:03",
    "text" : "I'm assuming he goes to Pro Bowl this year."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:04-39:11",
    "text" : "I I I They're the wagon It should have gone the the first two years as well, but the first year he didn't come on until halfway."
  },
  {
    "text" : "I think did he go in two thousand one? I don't think he did.",
    "speaker" : "Steve",
    "timestamp" : "39:11-39:15"
  },
  {
    "text" : "I don't know. Yeah.",
    "timestamp" : "39:16-39:17",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't think you did.",
    "timestamp" : "39:17-39:18",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:20-39:27",
    "text" : "Yeah, 'cause remember 2001 like the only there was a bunch of snubs because it was him and there was uh Troy Brown didn't make it in either"
  },
  {
    "text" : "Even though he led the 03, which makes sense. Yeah, yeah. And then it goes again in 2004. And then it goes again, I don't know how many fucking times a dude's been on the Pro Bowl now. Yeah, they're like This is only his fifth year and he's won two Super Bowl MVPs. It's like bruh, you guys got a long ride. Yeah. 15 years and a shitload more of those. Yeah. Only only two MVPs.",
    "timestamp" : "39:27-39:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "39:48-41:25",
    "text" : "He he starts wooding them and giving away the cars. Yeah, yeah, because he's giving you. Exactly. He's got no room for him anymore. Um my worst is let's see, oh there's a lot we could do. Uh you have a lot of worsts. Not for the Patriots. Um actually I'll give you one more best. They showed a um like an infographic thing of Bill Belichick's player profile, about what he looks for in players. Because they were asking about that. And they pointed out that um like athleticism didn't show up on that list. Like he just didn't talk about that or skill at all. They were like blowing themselves about it. Yeah, but it was uh Commitment to football, work ethic, intelligence, and team attitude. Which is like so Belichick. Like that is his system, right? I guess you still gotta be good. Yeah. But I think you also have to be good at what they tell you to do more than be Yeah. Particularly skilled. And then they showed like all the uh undrafted and late round draft picks um like to tie into that of the of the offensive starters. And there was like this list was crazy. Troy Brown in the eighth round, David Givens in the seventh. Which do those rounds even exist anymore? Your eighth round doesn't. Seven does. All right. Joe Andruzzi, undrafted. Dan Copen, fifth round. Steve O'Neill, undrafted. Brandon Gorin, seventh round. That's one, two, three, four out of their five offensive line spots. We're either undrafted or five plus around.",
    "speaker" : "Andy"
  },
  {
    "text" : "Do you see that thing recently about uh talking about Jakob Johnson being the second most improved player Belichick's ever coached? Really? After Stephen Neal.",
    "timestamp" : "41:25-41:36",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "41:37-41:41",
    "speaker" : "Andy",
    "text" : "Oh yeah. Well Stephen Neal was a uh He was a wrestler. Yeah, he was a wrestler."
  },
  {
    "speaker" : "Steve",
    "text" : "Right, right, right. Didn't a dick about football.",
    "timestamp" : "41:41-41:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. It's fucking banana.",
    "timestamp" : "41:44-41:45"
  },
  {
    "timestamp" : "41:46-41:52",
    "text" : "So it was cool that Belgium's like, yeah, he came along and time, and I guess Jakob Johnson as well, coming from Germany through that international thing.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, yeah, yeah.",
    "speaker" : "Andy",
    "timestamp" : "41:52-41:53"
  },
  {
    "speaker" : "Steve",
    "text" : "Also didn't a dig about football and now he's actually been turning it up. recently.",
    "timestamp" : "41:53-41:56"
  },
  {
    "timestamp" : "41:57-42:02",
    "speaker" : "Andy",
    "text" : "He has, yeah. He's he's been playing really well. He's I think a big reason why the run game's working so well at the moment."
  },
  {
    "speaker" : "Steve",
    "text" : "Which uh segues in me into one of my I guess the best and a worst. Alright, give him to me. I forgot how good Patrick passes. I feel like I've said this before, but for a fullback, he's awesome. Yeah. There's one Corey Dillon running play where he gets the corner and then To allow Cory Dunn at the edge and the linebackers like chasing them and he almost gets him and then Patrick Pass cleans him up, pushes him out of bounds to let Corey Dunn go for another 15 yards.",
    "timestamp" : "42:02-42:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah",
    "timestamp" : "42:26-42:27"
  },
  {
    "speaker" : "Steve",
    "text" : "And then on the punt return, he was a personal protector and so he almost ran down the punt returner. And he like dives and swipes at his ankles and just happens to miss, you know? Right there. But he was the closest one of the whole thing. Yeah. He's a fullback though. He's running down a punt returner. Yeah. Oh yeah. Right near the goal line. He was he was flying. Yeah. He's pretty quick for a fullback. He was, wasn't he? Yeah. And I think he gets no love, you know.",
    "timestamp" : "42:27-42:53"
  },
  {
    "timestamp" : "42:53-42:56",
    "speaker" : "Andy",
    "text" : "No, he doesn't. I mean fullbacks in general tend not to."
  },
  {
    "timestamp" : "42:56-43:11",
    "speaker" : "Steve",
    "text" : "That's true. But I feel like Paige's fullbacks have been sort of cult heroes, you know. In New England, yeah. Whew, good question. Devlin was well loved."
  },
  {
    "timestamp" : "43:12-43:15",
    "speaker" : "Andy",
    "text" : "Yep. Uh yeah, who was before him though? Um"
  },
  {
    "text" : "Magic Devil, right? Magic Bass was the fullback before Mark Edwards, right? Because we saw we played against Mark Edwards in the Saints game or something.",
    "timestamp" : "43:17-43:24",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "43:25-43:39",
    "speaker" : "Andy",
    "text" : "Yes, yeah, yeah, yeah. Um I feel like there's been more though. I don't know. I know we're missing somebody. In the middle of the year. Right. They get you a a Patrick pass."
  },
  {
    "text" : "That's a deep cut jersey, a Patrick Pass jersey. This is what I'm saying. It's a real deep cut.",
    "speaker" : "Steve",
    "timestamp" : "43:41-43:46"
  },
  {
    "timestamp" : "43:46-44:17",
    "speaker" : "Andy",
    "text" : "Yep. And let's see. Uh here's a list of all running backs. Marion Butts, he was more of a running back. They split him up by fullback? They really don't. This is why we need stat check Greg. I know, right? Yeah, yeah, Patrick Pass is listed as a running back in this. There's somewhere we're missing. They have Dan Cleco as a as a running back in here That's the other thing. Like it wasn't just Patrick Pass playing fullback in this. It used to be Dan Clecko, and then they had uh Richard Seymour in at times."
  },
  {
    "text" : "Yeah, like goal line stuff. Yeah, Patrick was a lighter fullback, I guess. Yeah, yeah, yeah. You also missed a little segment about when they were just talking about Tom Brady endlessly and pushing their storylines instead of watching the game. Did you hear that? I couldn't I rewind it and I couldn't understand what Susie said, but it was either Brady was a backup on an ON7 or an ON17 team. Oh, in seven, I think it was. There's no way they played 17 games in high school. No, no, no, no, yeah. It sounded like you said 17. I was like, holy shit. Either way.",
    "timestamp" : "44:17-44:49",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:49-45:03",
    "text" : "Yeah, that that's bad. That's uh and yeah, he he couldn't even start. That must have been high school, I'm assuming. Yes, it was high school, yeah. Yeah. And then he was a backup in uh In Michigan as well with all that stuff.",
    "speaker" : "Andy"
  },
  {
    "text" : "What are I so from back up on your shit high school team to going for your back-to-back Super Bowl wins for like a I don't know how many times. Eighth time, ninth time. Yeah. Yeah, I mean at this point, lost track. Before I do my my couple of bests. Uh and worse. Did you see the the mid-game highlights in this? Or from around the league? Uh yes, yeah, yeah. There's some good games. You see that Joey Porter throwing punches pre-game and getting kicked out from the game.",
    "speaker" : "Steve",
    "timestamp" : "45:03-45:39"
  },
  {
    "text" : "Yeah. Fucking Browns games, Browns Steelers games back in the day were legit.",
    "timestamp" : "45:39-45:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:45-46:38",
    "speaker" : "Steve",
    "text" : "And then I actually watched the end of it while I could post game Patriots coverage and their highlight of it, the dude was like I thought the NHL was on strike. He's got a really good laugh. And I was like, finally, some good fucking commentating. That's not but that's not bad, actually. Yeah. I'll give them the and then I sent Trevor a Snapchat of the uh Lions game where the Lions are down, was it seventeen three in the fourth quarter? Yeah And uh Drummond, who was beast back then, returns two punts in the fourth quarter for touchdowns. Yeah. I think the first time anyone's returned two punts in a game for touchdowns, and he does them both in the fourth quarter to tie the game and then David Girard beats him in over time. They still lose after all that. Fucking brutal. He's gotta be so mad. Oh man. Desmond in a drumming. That was what Chris Burban called him."
  },
  {
    "text" : "Oh Jesus. Yeah, that was that was so typically lion's esque, wasn't it?",
    "speaker" : "Andy",
    "timestamp" : "46:40-46:47"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "46:49-47:02",
    "text" : "Worse was Sam Adams. He he was a beast a little bit in this game. And there's one hit where he like legit lifted Brady off his feet and then with all that weight. Again, another foul nowadays. That's true, yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:02-47:05",
    "text" : "You got a blind side on one play. Yeah, kind of blind."
  },
  {
    "text" : "I mean it's hard to miss that guy coming.",
    "speaker" : "Steve",
    "timestamp" : "47:06-47:07"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:08-47:15",
    "text" : "Oh you you can you can feel him coming. That's what that's the commentator's side. You can feel the ground rumbling on it when he's on his way. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "And then the other worst slash best was uh Teddy Brewski like nearly tore his ACL. Yeah, that looks real bad. Like somehow miraculously does it and he's walking off the field, like hobbing off. And he comes to the side and he sees Vrabel and the camera still has like a close up on his face and his face is like, holy shit. Yep. Oh, ooh. You know, like, oh, goodness gracious.",
    "timestamp" : "47:15-47:41"
  },
  {
    "timestamp" : "47:43-47:46",
    "speaker" : "Andy",
    "text" : "Yeah, definitely escaped uh escaped something real bad there."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "47:48-48:16",
    "text" : "I think that could have changed the trajectory of their whole season if Teddy Bruce because he's a Their corners suck for sure, but their D-line is beast Petty Bruce Keys and awesome. My other best is his interception return. Which I don't know if you have this highly because they didn't even show a replay of it because there's such bad production values that they didn't even show another replay of their turn. It was so silky smooth. He like catches it, almost runs in the receiver, ducks him, slips out of a couple tackles, gets like 30, 40 yards out of him as possible."
  },
  {
    "timestamp" : "48:17-48:23",
    "speaker" : "Andy",
    "text" : "Yeah, and then like looks like he's gonna get run out of bounds, but then like Does like he jukes at one of the offensive line when it gets another like 10-15 yards."
  },
  {
    "text" : "Yeah, gives the old Olay.",
    "speaker" : "Steve",
    "timestamp" : "48:23-48:24"
  },
  {
    "text" : "Yeah, he did. Yeah, no, that'll be that'll be on the website too. That's uh uploading currently.",
    "speaker" : "Andy",
    "timestamp" : "48:24-48:30"
  },
  {
    "timestamp" : "48:30-48:30",
    "speaker" : "Steve",
    "text" : "Good."
  },
  {
    "timestamp" : "48:30-48:45",
    "speaker" : "Andy",
    "text" : "Like I said, lot of plays. Lot of plays. I try to grab all the uh all the defensive turnovers and sacks and then offensive plays, like running plays over 10 yards, and then like deep passes and touchdowns."
  },
  {
    "timestamp" : "48:45-48:51",
    "speaker" : "Steve",
    "text" : "You shouldn't get that crackback block that Eric molds through on Teddy Brisky early in the game."
  },
  {
    "timestamp" : "48:51-48:54",
    "text" : "I don't do highlights of other teams. It's only Patriots.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "48:55-48:59",
    "text" : "It's crazy seeing plays that are blatantly illegal now. Oh yeah."
  },
  {
    "timestamp" : "49:00-49:01",
    "text" : "It's a little jarring, isn't it?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "49:02-49:04",
    "text" : "And the and the commentators are like, about it",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "49:04-49:34",
    "speaker" : "Andy",
    "text" : "Yeah. Oh, they're like, what a great fucking hit. Legit. It's like that was Heinz Ward. Yeah, yeah, it looked like Heinz Ward up there. Yeah, exactly. Like, yeah, another dirty fucker. I mean it wasn't dirty but it was in the rules, you know. It's true, yeah. It wasn't dirty then. It is now. Can't do that. Definitely is now. Now now you got people praising um Jacoby Myers for not throwing that block and just throwing a pick instead to let Kendrick Born screw a touchdown. Jacoby definitely could have cleaned that guy off his feet for sure."
  },
  {
    "speaker" : "Steve",
    "text" : "Actually probably would have got like a block in the back. That's the thing about crackbacks are like ha almost there, you know?",
    "timestamp" : "49:35-49:39"
  },
  {
    "timestamp" : "49:40-50:04",
    "speaker" : "Andy",
    "text" : "Yeah, so um Yeah, so you can actually watch this game on YouTube. This one's on YouTube. Um the link's on the website. But uh Yeah, I mean this was a good game to kind of get you ready for Monday night this week, I think. Not that or you know, depending on how Monday night goes. Yeah, I was just thinking that when I said it, yeah."
  },
  {
    "timestamp" : "50:05-50:08",
    "speaker" : "Steve",
    "text" : "Well Bill's fans don't watch this game after Monday night."
  },
  {
    "speaker" : "Andy",
    "text" : "Regardless. Regardless. Depending on how it goes, maybe you want to relive some more glory. Or maybe you have some uh You know, maybe just want to relive the glory for better or for worse. Or just watch that second quarter.",
    "timestamp" : "50:08-50:24"
  },
  {
    "text" : "That's where the fun stuff is.",
    "speaker" : "Steve",
    "timestamp" : "50:24-50:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, watch the second second quarter and then the fourth quarter. Fourth quarter is great because it's a bunch of Bills turnovers. It's a great time. Yeah, it's just them imploding. Yeah.",
    "timestamp" : "50:26-50:36"
  },
  {
    "text" : "And yeah, JP Lossman sighting who he throws a fumble and has an interception.",
    "timestamp" : "50:37-50:40",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "50:40-50:58",
    "text" : "Yep. And he was s and you know he was getting hyped up even by the uh commentators talking about how uh he's the first First round quarterback selected by the Bills since Jim Kelly, so he's like the second coming. Yeah, first of fucking many buddy. Oops. Yeah, exactly. Won't be the last.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "50:58-50:59",
    "speaker" : "Jonny Damon",
    "text" : "Yeah."
  },
  {
    "text" : "So yeah, so that was uh 2004 week ten. A great game. If you're a Pats fan. What's next week? Next week, the Patriots travel to Arrowhead Stadium. Take on the Dick Vermiel, Kansas City Chiefs. I know nothing about this game. I know absolutely nothing about this game. I've remembered most of these so far, but this one. Couldn't tell you. Apparently Trent Green is a quarterback. Still not ringing any bells.",
    "timestamp" : "51:00-51:31",
    "speaker" : "Andy"
  },
  {
    "text" : "I feel like there's a bunch of big names in the Chiefs back then, so we'll see. Yeah. And he Kennison, Tony Gonzalez, Dante Hall. The other cheese game we did that went to overtime was electric.",
    "speaker" : "Steve",
    "timestamp" : "51:33-51:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:42-51:53",
    "text" : "Yeah, that was great. So we'll see how this one goes. Um I don't know. Yeah, I I This is one of those games I have no memory of. This is great. I'm looking forward to finding out what this is about."
  },
  {
    "text" : "So guess we'll find out next time on next week to see how much of a blubbering little bitch Greg is. On the Patriots Dynasty podcast. See, Greg's always joining us in spirit.",
    "timestamp" : "51:53-52:07",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Always. Yeah. And so next next time. Next week we will hopefully have him on and he can uh give us some recap of how being at uh Orchard Park, New York was for this Monday night game Yes.",
    "timestamp" : "52:08-52:22"
  },
  {
    "timestamp" : "52:22-52:25",
    "text" : "Did they have a pallets for the mudfield?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:25-52:32",
    "text" : "Yes, exactly. But until then, we will see you later. See you later."
  }
]