[
  {
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother."
  },
  {
    "timestamp" : "00:22-01:14",
    "text" : "Welcome back to the Patriots Dynasty Podcast. Uh this is uh 2004 week. For take two. Is that right? Yes. Because we tried to do it last week. Uh we're just gonna have uh talk with Miguel From Pat's cap. Uh and then dump jump in the game, and that just did not happen. Because he talks a lot. So uh speaking of which, uh during that episode, we said that we would Um donate a dollar for every person who listened to that episode between then and now. And we had 88 listens. So if you listened. you uh are helping out the cause and so we're actually going to just round it up to an even hundred bucks because we're nice guys. Um so we'll be donating a hundred bucks to Pat's cap's uh Habitat for Humanity page so Look for that.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "You write it off on your taxes. Oh, I could, couldn't I, yeah. Well I meant the listeners",
    "timestamp" : "01:15-01:20"
  },
  {
    "timestamp" : "01:21-01:25",
    "speaker" : "Andy",
    "text" : "Oh yeah, they probably could too, actually. That whole dollar, just write that off."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Yeah.",
    "timestamp" : "01:25-01:25"
  },
  {
    "speaker" : "Andy",
    "text" : "If the IRS comes coming, just send them our way.",
    "timestamp" : "01:25-01:28"
  },
  {
    "text" : "I'm sure we'll take care of it for you. So we'll get a bunch of lists from the IRS too.",
    "timestamp" : "01:28-01:31",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah, absolutely. If you're from the IRS, uh we we are not tax professionals, so don't listen to us. So there you go. Cover those bases. Uh also big news. Um the new website launched this week too. So patsdynasty. com is the new one. Go check it out. It's just like the old one, except newer and cooler.",
    "timestamp" : "01:31-01:56"
  },
  {
    "timestamp" : "01:56-02:00",
    "speaker" : "Steve",
    "text" : "Does patzpods. com still work? Because that's what I tell everybody."
  },
  {
    "text" : "It does. And I'm going to now that the new one's launched, I'm gonna it that will point to the new website too because there's a podcast thing on that that's fancier.",
    "speaker" : "Andy",
    "timestamp" : "02:00-02:10"
  },
  {
    "text" : "What's the uh give me the the elevator pitch for the new website The elevator.",
    "timestamp" : "02:10-02:15",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "02:15-02:18",
    "text" : "Nobody actually wanted it, uh Andy just did it anyways.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:19-03:09",
    "text" : "How dynamic is it? It's very dynamic. It's fully dynamic. It's fully it's fully mobile optimized. And if you want to learn anything about uh stats and eventually storylines from the Patriots Dynasty era, the Bill Belichick and Tom Brady era of the the this dynasty, the one that we're doing a podcast on. Uh that's where you'll get your information. That's where we get a lot of our information in terms of um, you know, all the cool stats and stuff that we we come up with and all the other cool things like um Here's a fun fact for you that while I found while I was putting this together, um, in the Brady Belcheck era, Patriots did not have a losing record against any team. Uh and they actually were undefeated against more teams than they had a 500 record against. Can you name the team that they went 500 against over the past 20 years?"
  },
  {
    "speaker" : "Steve",
    "text" : "Redskins.",
    "timestamp" : "03:10-03:11"
  },
  {
    "timestamp" : "03:12-03:40",
    "text" : "No, they were uh 10 and 9 against Denver. So you you were close. Redskins. Panthers. Not the definitely not the Redskins. Yes, it was the Panthers. That's right. Yeah, Cam Newton, which kind of uh when you look at it that way and you look at Belichick's pension for bringing in Players who have played well against his team. Makes sense that Cam Newton is here as the quarterback of the Newland Pagets right now. I think.",
    "speaker" : "Andy"
  },
  {
    "text" : "Are you guys gonna come to Carolina for the game this year?",
    "timestamp" : "03:41-03:44",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I would love to do that. I think we should. I think we should do a podcast from the parking lot of the uh of the Panther Stadium.",
    "timestamp" : "03:44-03:51"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "03:52-03:52",
    "text" : "It's a terrible idea."
  },
  {
    "speaker" : "Greg",
    "text" : "We're gonna burn Bank of America to the ground.",
    "timestamp" : "03:53-03:55"
  },
  {
    "text" : "Isn't it your birthday, Greg?",
    "speaker" : "Steve",
    "timestamp" : "03:56-03:57"
  },
  {
    "timestamp" : "03:58-04:06",
    "speaker" : "Greg",
    "text" : "Yeah. I'm gonna piss on the Ashes of Bank of America. So if you've ever wondered what Greg Brown sounds like, blackout drunk, uh listen to that podcast whenever we're gonna be able to do it."
  },
  {
    "text" : "Earn it down. We'll have a listener meetup. Yeah, we could do that.",
    "timestamp" : "04:06-04:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "04:11-04:11",
    "speaker" : "Steve",
    "text" : "Tailgate."
  },
  {
    "text" : "Yeah, I think we should.",
    "timestamp" : "04:12-04:13",
    "speaker" : "Andy"
  },
  {
    "text" : "Slash birthday party for Greg.",
    "speaker" : "Steve",
    "timestamp" : "04:13-04:14"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "04:14-04:15"
  },
  {
    "speaker" : "Steve",
    "text" : "And then just hope mom doesn't come.",
    "timestamp" : "04:15-04:17"
  },
  {
    "timestamp" : "04:18-04:30",
    "text" : "Just bring your flammables Anything explosive, bring it. Yeah. We're burning it down. I haven't been to a sporting event in two years. We're burning it down.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:33-04:50",
    "text" : "Oh my goodness. All right. Well speaking of um sporting events that we've been to this two thousand and four Pat's Bills Game in Orchard Park, New York is a game that I was at with Mr. Mike Mello, a friend of the show."
  },
  {
    "speaker" : "Steve",
    "text" : "So you said this uh when we first tried to do this game that it's snowing and you're in a plane, you thought you were gonna die.",
    "timestamp" : "04:50-04:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, it wasn't snowing. I was just in a tiny plane that I thought we were gonna die because of the uh the turbulence.",
    "timestamp" : "04:56-05:01"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "05:01-05:02",
    "text" : "Oh, come on."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:02-05:06",
    "text" : "Man up dandy. Yeah, girl up dude. The weather was fantastic."
  },
  {
    "timestamp" : "05:07-05:10",
    "speaker" : "Steve",
    "text" : "Oh, so the the weather's fantastic. You just are afraid of small planes?"
  },
  {
    "text" : "This one especially, yes. It was terrifying. And you know what? I don't care what you say. And after that, Andy never left New England ever again. That's right, yeah. Not not by plane. Except by plane. Not by little plane. I haven't been on a little plane like that since. So yeah, if I'm going down to North Carolina, it's gonna be a",
    "speaker" : "Andy",
    "timestamp" : "05:11-05:31"
  },
  {
    "text" : "Either a big ass plane or fucking driving there. Next plane you get on, Greg, tell everybody I haven't been on a plane in two years. We're burning this down. We're burning down.",
    "speaker" : "Steve",
    "timestamp" : "05:31-05:40"
  },
  {
    "timestamp" : "05:43-05:45",
    "speaker" : "Andy",
    "text" : "Hope you brought your flammables."
  },
  {
    "text" : "No, I will not wear a mask.",
    "speaker" : "Greg",
    "timestamp" : "05:46-05:48"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh God.",
    "timestamp" : "05:48-05:49"
  },
  {
    "text" : "I will die on this hill.",
    "timestamp" : "05:51-05:53",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:55-05:57",
    "text" : "And that's how Greg didn't get to Carolina."
  },
  {
    "timestamp" : "06:00-06:03",
    "speaker" : "Greg",
    "text" : "Imagine being like a stewardess these days."
  },
  {
    "timestamp" : "06:04-06:16",
    "speaker" : "Andy",
    "text" : "Uh we have a friend of the pod, uh, shout out Danielle, who is a stewardess for Southwest. And she's got some stories. It's uh it's a tough time right now to be. I can't imagine. Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "06:16-06:25",
    "text" : "Like it already probably sucks dealing with people. Yeah. Yeah. And now everyone's just like cooped up, all pissed off, scared."
  },
  {
    "text" : "I mean you see it in every sporting event that's happening now that the fans just don't know how to behave themselves.",
    "speaker" : "Andy",
    "timestamp" : "06:25-06:31"
  },
  {
    "text" : "Those poor, poor Bank of America Stadium employees.",
    "speaker" : "Steve",
    "timestamp" : "06:31-06:34"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:37-06:40",
    "text" : "I'll have no fury like Greg Brown unleashed."
  },
  {
    "timestamp" : "06:40-06:42",
    "text" : "Although we're assuming you're gonna get into the stadium, Greg.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "This is a valid point. I'll find a way in, Stevie. I mean, you have seen the inside of of the uh Gillette Stadium drunk tank, so If you believe it, you can achieve it.",
    "timestamp" : "06:44-06:56"
  },
  {
    "timestamp" : "06:56-07:04",
    "text" : "I'm just excited to compare the actual Bank of America Stadium to the one that I've read about in that book.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:04-07:29",
    "text" : "Oh, right. In the Cam Newton uh erotic fiction that we read. Uh I was talking to mom, she said that's the only episode she hasn't listened to. Thankfully. So that's smart. Very smart. All right, let's talk some football. We haven't done that in a while. Uh this is football or football? Football. We're not talking football."
  },
  {
    "text" : "Rest in peace, England.",
    "speaker" : "Greg",
    "timestamp" : "07:29-07:30"
  },
  {
    "timestamp" : "07:30-07:35",
    "speaker" : "Andy",
    "text" : "Yeah, rest in peace there. Uh apparently it's not coming home. So yes."
  },
  {
    "speaker" : "Greg",
    "text" : "Uh-huh.",
    "timestamp" : "07:36-07:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:38-07:59",
    "text" : "I feel I there's still time, baby. This feels a whole lot like um Pre-2004 Red Sox fans. No, it feels like Bills fans. Except the Patriots uh uh England has one Uh a major tournaments. That's true. Just not in a very, very, very long time."
  },
  {
    "timestamp" : "07:59-08:23",
    "speaker" : "Greg",
    "text" : "So it's like the it's like the leaves. The maple leaves. Okay. They probably have the most brutal record. As far as like playoff losses. Yeah, yeah. They're uh and I'm not sure if people are in tune with it because it's hockey. But like you look at some of the waves ways they've lost in the fan base they have, and it's just It's mind-boggling. Oh yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:24-08:29",
    "text" : "It's if we had a Cleveland Brown Finn on here, they'd be pissed. But they won back in like the 50s."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, they had the whole Jim Brown era and everything. Right. And they have like other teams in their city, really.",
    "timestamp" : "08:30-08:35"
  },
  {
    "speaker" : "Andy",
    "text" : "You know that's true that have won, yeah. England doesn't win things.",
    "timestamp" : "08:35-08:41"
  },
  {
    "timestamp" : "08:41-08:43",
    "speaker" : "Greg",
    "text" : "Come on, England."
  },
  {
    "speaker" : "Andy",
    "text" : "All right, and that's been your football moment.",
    "timestamp" : "08:44-08:46"
  },
  {
    "timestamp" : "08:47-08:49",
    "speaker" : "Greg",
    "text" : "Yeah, now we're a football podcast."
  },
  {
    "timestamp" : "08:50-09:06",
    "speaker" : "Andy",
    "text" : "Both New England and Old England. I just didn't think you'd be getting that chip chat on this one. Uh speaking of winning though, this Pagers team coming into this game had won how many in a row, Steve?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "09:07-09:07",
    "text" : "I don't know."
  },
  {
    "timestamp" : "09:08-09:32",
    "speaker" : "Andy",
    "text" : "Seventeen. Nice. Glad you're prepared. Um and so they're going for their record-tying 18th win in a row, tied with uh a whole bunch of teams, but only some that actually are legit. There was the uh 33-34 Bears and also the 41-42 Bears, which if it's pre-Super Bowl era, it doesn't fucking count."
  },
  {
    "text" : "If it's pre-World War II era, I think we should maybe call that one just",
    "speaker" : "Greg",
    "timestamp" : "09:32-09:37"
  },
  {
    "speaker" : "Andy",
    "text" : "A different league. That that's that's not really football that we know and love. Exactly. Um and then there was the 72 Miami Dolphins into the 73 season, which obviously they went undefeated 16-0 in uh 72. Only team to do so. And then won a couple games. But they still only won 18 in a row, even after going undefeated an entire season. So that's a little shocking. And the 8999 49ers, of course, with their their whole um dynasty then. 9798 Denver Broncos. That was with um Who was the running back back then? Terrell Davis. Was that Terrell Davis? Yeah. That uh Ricky Williams based his contract negotiations off of. And then the 76-77 Oakland Raiders surprisingly had 17 in a row. So the patients would pass them and move into a big old tie for first place if they were able to win this game.",
    "timestamp" : "09:37-10:31"
  },
  {
    "timestamp" : "10:31-10:34",
    "speaker" : "Steve",
    "text" : "With a big old asterisk of these are regular season wins, right?"
  },
  {
    "text" : "No. No, this is this is overall. How can someone have 17 wins? Well the commentators, how can you have 17 in a row? Just kidding. There you go. Well you could no, I th I think there was like uh because they talked about this, the the commentators, how this wasn't considered a legit record by the NFL, wasn't regarded as official by the NFL because it included the playoffs. And there were teams with longer regular season streaks that had lost in the playoffs. Like I think um I think the Colts around this time were doing something similar where they were winning a whole bunch of um regular season games in a row, but then losing to the pages in the playoffs. So if you only count regular season games. I looked this up.",
    "timestamp" : "10:35-11:20",
    "speaker" : "Andy"
  },
  {
    "text" : "The regular season one is the 08-09 Colts. Right. The 06 through 08 Patriots are second with 21. Okay. Those undefeated Pats. This team is third with 18. And the 14-15 Panthers are also third 18.",
    "timestamp" : "11:20-11:42",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "That's the year they went 15-1, right? Yeah. They must have won their last few games at the end of that. Yeah. Okay. Mm-hmm.",
    "timestamp" : "11:43-11:48"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "11:49-11:49",
    "text" : "Wow."
  },
  {
    "timestamp" : "11:49-11:50",
    "speaker" : "Andy",
    "text" : "All right."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "11:51-12:05",
    "text" : "And the the list for combined has changed since this date too. So that 2010, 2011 Packers had 19 straight, which they're actually this the second on the list."
  },
  {
    "text" : "Yeah. Because the Patriots are, spoiler alert, first, right? With twenty one? Twenty-one. Yeah. And that's just games in a row, including playoffs.",
    "speaker" : "Andy",
    "timestamp" : "12:05-12:17"
  },
  {
    "text" : "Yeah, so the one year that Rogers won it. Yeah. One and only year that Rogers didn't blow it.",
    "speaker" : "Greg",
    "timestamp" : "12:18-12:27"
  },
  {
    "text" : "Right. They still they still couldn't win as many games in a row as Tom Brady. So that feels about right. Second to Tom Brady again. But I I still I got a question though.",
    "timestamp" : "12:27-12:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "So I also saw the the playoffs record, most consecutive wins in the playoffs. I think that is an official NFL record. Okay. So this team obviously has that.",
    "timestamp" : "12:38-12:50"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:51-12:57",
    "text" : "So all one through 05, they have 10 straight wins in the I was gonna say because Brady won like 10 straight to start his career."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "12:57-12:57",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:58-12:58",
    "text" : "Right."
  },
  {
    "text" : "You got the 70s Steelers on there, the nine or the late 80s, 90s 49ers, 90s Cowboys, late 90s Broncos. All right. Which of those three records do you think is the hardest? To to break.",
    "timestamp" : "12:58-13:14",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Hmm. I think it's combined games in a row. Yeah, for sure. Because it's just like Because it's a matchup-based league, being able to win 22 games in a row all the way through. I think that's just uh uh uh some of that I think it just comes down to luck at some point. Like just being able to reel off that many wins. Especially now with the free agency and how tight everything's gotten. I th and and drafting and everything and the fact that draft picks aren't paid as high. So you have that like if you if a a bad team hits on a good draft pick. They can uh they can make a run pretty quickly and they can turn things around. I think that to me is probably the biggest one. I disagree.",
    "timestamp" : "13:15-14:03"
  },
  {
    "text" : "Okay. What's your choice? I think the playoffs one is the hardest. You basically have to win three Super Bowls in a row without losing a playoff game. That's fair. And look at the the teams on this list are all like era defining teams. You know, like the Niners, the Cowboys, the Broncos. Which you might not have again. Right. And and and even then you're like you You expect those teams to make the playoffs every year. So even you gotta basically win it like three years in a row. Right. And then when you're in the playoffs, you're playing the best team in the league. Yeah. All the way through. And I think winning the Super Bowl in the NFL is much harder than winning consecutive regular season games. So you don't get any layups.",
    "speaker" : "Greg",
    "timestamp" : "14:03-14:53"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know. I think the the uh the counterpoint is When you're on a huge win streak, the pressure ratchets up every single week and everyone's coming for you, you know? Like there's so much. You're about to see it on the rest of this where there's so much Gonna be so much bullshit about it.",
    "timestamp" : "14:53-15:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh my god, like the or even the 07 season where the Patriots go undefeated and then like can you finish this off? Which the answer is obviously no.",
    "timestamp" : "15:09-15:17"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "15:18-15:30",
    "text" : "Spoiler alert. But once you win that Super Bowl, right, the pressure ratchets up till you win the Super Bowl, and then the next year It's not really a huge deal until you get close to breaking a record."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:30-16:08",
    "text" : "Maybe. I mean I think but once you win that Super Bowl, you have that target on your back too now, right? Yeah, I guess. And a lot of teams, you know, you also don't have as much uh recovery time because you played a whole bunch of extra weeks. So teams that make it to the Super Bowl don't often do as well as they did the year before. And usually if you're winning a Super Bowl, you're kind of like a lot of teams sell out to do so because they know they're running the cusp. And so you have a lot of turnover the next year for the most part. Not necessarily this year, obviously, with every single buccaneer coming back, but generally speaking, there's a whole lot of people that like, I won my Super Bowl, let's go get a payday, you know?"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay, so then are you saying that the Colts from two thousand eight and two thousand nine are better than the Patriots?",
    "timestamp" : "16:09-16:15"
  },
  {
    "text" : "No. No, why would I ever say that, Craig? Because that doesn't include because that's that's just we're winning regular season games.",
    "timestamp" : "16:16-16:22",
    "speaker" : "Andy"
  },
  {
    "text" : "No, I'm talking about wins in a row is the hardest I disagree.",
    "speaker" : "Steve",
    "timestamp" : "16:26-16:31"
  },
  {
    "text" : "I mean I think you have a fair argument.",
    "speaker" : "Andy",
    "timestamp" : "16:32-16:34"
  },
  {
    "text" : "Not only do I disagree, but I think both of you are complete idiots. There it is. And I might walk out of this podcast right now. It's fine. I didn't realize this was a uh Can you insert the door slamming noise in this scene?",
    "timestamp" : "16:36-16:50",
    "speaker" : "Greg"
  },
  {
    "text" : "Uh how about how about this?",
    "timestamp" : "16:51-16:52",
    "speaker" : "Andy"
  },
  {
    "text" : "Actually this is probably more broken.",
    "timestamp" : "16:55-16:56",
    "speaker" : "Greg"
  },
  {
    "text" : "Okay, Greg walked out and he's back. Uh welcome back, Greg.",
    "speaker" : "Steve",
    "timestamp" : "16:56-17:00"
  },
  {
    "text" : "Yeah, they just apologized.",
    "speaker" : "Greg",
    "timestamp" : "17:00-17:01"
  },
  {
    "text" : "Apology accepted. Andy cut that because he cuts everything from this podcast.",
    "timestamp" : "17:01-17:06",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That's right, yeah. I I do a lot of editing to this to make it listenable. You should hear all the shit that that gets left on the cutting room floor. Uh yes. So okay. Um so this is the unofficial uh win streak according to the NFL, but Patriots coming in at 2-0 against the Bills team that are 0-2. And we'll just get out in front of it because I think everybody knows at this point the pages do win this game to move to 18 victories in a row. And uh on the NFL primetime uh video, this was like the game of the week because, you know. It was a good game and the Patriots set this record. The prime cut. Yeah, that's what they called it, right? The prime cut of the week. Um, and they showed a stat where the Patriots have 18 wins in a row. Buffalo Bills have 17 wins since the beginning of 2001.",
    "timestamp" : "17:06-18:02"
  },
  {
    "text" : "The Bills are at least decent at this point. This is the 31-0 revenge game.",
    "timestamp" : "18:04-18:08",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "18:09-18:17",
    "text" : "No, they already had that revenge gate at the end of the season, remember? Right, yeah, but this is the after the 3131s, yeah. Yeah, absolutely, absolutely",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "'Cause the last time the Patriots here, they got their ass whipped 31 zip.",
    "timestamp" : "18:16-18:19"
  },
  {
    "text" : "Yep, but I I still think the Bills hadn't they've been s pretty up and down.",
    "speaker" : "Andy",
    "timestamp" : "18:19-18:23"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "18:24-18:24",
    "text" : "Yeah."
  },
  {
    "text" : "Because in true Bills fashion, they started off hot. Got the hopes up of everyone in the Buffalo area and then faded down the stretch.",
    "timestamp" : "18:24-18:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That is classic Bills.",
    "timestamp" : "18:32-18:33"
  },
  {
    "text" : "Right, exactly. Um as we all know and love. Kind of similar to um listening to Lions fans in there. I don't know.",
    "timestamp" : "18:33-18:42",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:42-18:44",
    "speaker" : "Steve",
    "text" : "The Lions don't even get hot to start."
  },
  {
    "text" : "No, but but they always have that like they're they're ready to go at the beginning of the year. And then, you know. The Lions early season is their draft. Yes, exactly. So uh big news in this game, Corey Dillon on the first drive scores his first TD as a Patriots right up the middle. Great little run. Looking very uh solid as a as a running back, which is nice to see because we haven't seen that since we started this podcast really. Yeah, with some flashes from Antoine, but nothing at this level. But uh he would fumble later on in the game as a page of driving for uh A touchdown like inside the five-yard line. He fumbles and the Bills recover. Almost did it again towards the end of the game, but uh it was ruled, not a fumble. So, but this this game was actually uh a wild one, even for like Bill's patriot standards, I thought.",
    "timestamp" : "18:44-19:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "19:47-19:49",
    "text" : "Let's give the final score and a watchability rating.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "19:50-20:08",
    "speaker" : "Andy",
    "text" : "Oh yeah, we haven't done that in a while. Uh it's 3117 Patriots at the end. Uh it felt a lot closer than that up until right at the end, which we'll talk about in a bit. Uh in terms of regular season watchability game, we're out of six, I would say a good four and a half for me Lombardies."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "20:09-20:14",
    "text" : "Yeah, four, four and a half. It was very entertaining. A little sloppy, especially the beginning."
  },
  {
    "timestamp" : "20:15-20:15",
    "speaker" : "Andy",
    "text" : "Yeah. Oh yeah."
  },
  {
    "timestamp" : "20:16-20:20",
    "text" : "Ton of big plays, turnovers. There's just a lot of exciting plays going on.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "20:20-21:28",
    "speaker" : "Andy",
    "text" : "Yeah. Uh there was uh substitute referees because there was a referee got injured. I don't remember what he did, but he like I'm sure I wrote it down somewhere. I do remember the Bill Stanley to make this more watchable. Yeah, he had a torn leg muscle and they were like They put him on the Bill's bench were like icing up his knees, seeing if he'd come back and he couldn't, so they like had the uh the linesman come in to be the the head referee and like they had to switch his hat to the white one and everything. And there was like there were the commentators were all up about it. Jim Dance and Phil Sims, of course they were. And they're in like the hurry up, so the Bills. Yeah, so the bills, yeah, and the refs had to stop the the no huddle because the head ref comes up limping like early on in the game. And there was like a ton of uh penalties, a ton of like uh close plays that got reviewed, and this fucking backup referee was completely overwhelmed. Way overwhelmed and doing his best, but just like struggling. I'm like, yeah. 21 penalties total. Yeah. A lot of penalties. Yeah. Um and like everyone was getting injured. Um Patriots very watchable referees, just like nobody was safe in this game."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:29-21:33",
    "text" : "Well, there's so many. Tons of penalties, tons of reviews, tons of injuries. No, but like five."
  },
  {
    "timestamp" : "21:34-21:35",
    "speaker" : "Andy",
    "text" : "In a fun way though."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "21:35-21:36"
  },
  {
    "timestamp" : "21:36-22:18",
    "text" : "It was exciting. I gotta admit the the replacement referee season was awesome. Yeah, and it was kind of like a just a little sprinkle of that into this game, you know? It was nice. But there was like uh there was all sorts of just like weird shit that happened. Um the Patriots forced the the bills to punt at some point. Uh I have it on here somewhere. Don't matter. Can't find it. Yeah, but so the the Patriots force the Bills to punt They go to punt it and the punter drops the football and picks it up like almost as about to get blocked anyway and then just picks up and takes off running gets like 30 yards. 34 as I Mormon.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "This is the highlight of the Bills fans lives in this game right now. They look pretty good. His longest carry. He fucking scampers. And he's running.",
    "timestamp" : "22:18-22:27"
  },
  {
    "timestamp" : "22:27-22:33",
    "speaker" : "Andy",
    "text" : "He's like pointing out blockers too of like who to block. Yeah. And then immediately gets run down from behind."
  },
  {
    "text" : "It was a nice thing. Dude, if he could have turned that corner, he'd still be running. Yeah.",
    "timestamp" : "22:33-22:38",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "22:38-22:43",
    "text" : "There was uh uh Buffalo scored a kick return touchdown too. Like right after the Patriots.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That's a nice nice move, a little shimmy in the hole.",
    "timestamp" : "22:44-22:46"
  },
  {
    "timestamp" : "22:46-23:05",
    "text" : "Yeah. He fucking faked him out and then outran Adam Benateri, which, you know, Herschel Walker can't do. So impressive. Um bloodso throwing exceptions as he normally does, but then like fucking connecting deep to to molds on this like beautifully thrown touchdown pass.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "It was vintage Bledsoe. It was, yeah. Eighteen completions, like two hundred and seventy-five yards.",
    "timestamp" : "23:06-23:13"
  },
  {
    "timestamp" : "23:14-23:14",
    "speaker" : "Andy",
    "text" : "Mm-hmm."
  },
  {
    "timestamp" : "23:15-23:18",
    "text" : "One pick, one touchdown, six sacks.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "23:18-23:18"
  },
  {
    "speaker" : "Steve",
    "text" : "And and they were actually talking about the Bills are having trouble with sacks because he only threw like four or six actual incompletions because if you throw those six sacks in his incompletions or in his in his attempts, you know.",
    "timestamp" : "23:18-23:31"
  },
  {
    "text" : "Yeah. But no, uh the week before he was sacked seven times. And he's like leading the league in in being sacked, I think. Like by a decent margin over Oh yeah, since two thousand two they they showed a stat since two thousand two. Uh the this this is a hell of a graph. Most time sacks in 2002. Drew Bloodsaw in first place with 111 sacks. in just over two seasons. David Carr in second with 101. Feels right. And then Dante Culpepper, 93, Aaron Brooks, 77. And Donovan McNabb, of all people, 77. So you've got some mobile quarterbacks in there and then also Drew Bledsoe and David Carr who are just sack machines. So good for them. What else?",
    "speaker" : "Andy",
    "timestamp" : "23:30-24:18"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "24:20-24:31",
    "text" : "There was a we get the punt back. No, they get a punt, they stop us on third down. Then they throw a dumb pick. Then we hit a big bomb to David Patton and then there's that Corey Dillon fumble all in four plays."
  },
  {
    "text" : "Right, yeah. Like this it's just back and forth the entire time. There was one uh Page uh ended up in a first and thirty-five due to like penalties and stuff. Converted it and end up scoring a touchdown, I think. Uh, which is ridiculous.",
    "timestamp" : "24:32-24:46",
    "speaker" : "Andy"
  },
  {
    "text" : "Then there was a bunch of what I'm gonna call Bills being bills. You ready for this? I'm gonna read these off.",
    "timestamp" : "24:46-24:53",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:53-24:53",
    "text" : "Oh yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "24:54-24:56",
    "text" : "First play of the game, late hit, London Fletcher."
  },
  {
    "text" : "Yes.",
    "timestamp" : "24:57-24:57",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "24:59-25:02",
    "text" : "They they get the Patriots into a first and 35.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "25:02-25:02",
    "speaker" : "Andy",
    "text" : "Yes."
  },
  {
    "speaker" : "Steve",
    "text" : "44 yard completion of David Gibbons.",
    "timestamp" : "25:02-25:05"
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly.",
    "timestamp" : "25:05-25:06"
  },
  {
    "timestamp" : "25:07-25:17",
    "text" : "They get an interception in the in the end zone. And there's a flag. And I'm like, that's gotta be on the Bills. No, it's on the Patriots. Challenge overturns the interception.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh so bad.",
    "speaker" : "Andy",
    "timestamp" : "25:20-25:21"
  },
  {
    "timestamp" : "25:21-25:34",
    "speaker" : "Steve",
    "text" : "Um they're they get a two minute drive, just do a million penalties. Then they get the ball back to start the second half. And I have only the Bills can turn a first down from the 35 into a third and 21 from their own forty."
  },
  {
    "text" : "It's true. That's so blood so esque.",
    "timestamp" : "25:35-25:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh Patriots are are attempting a field goal. Bill's offsides give the Patriots a first down. And the Patriots score a touchdown. Yeah. Brady's 75th T D.",
    "timestamp" : "25:38-25:48"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:48-26:31",
    "text" : "Yeah. Oh, you also miss one where um On the Patriots third down, like in their own uh half. Uh it's a catch by I think uh David Patton Where and then uh it's like a bang bang play where he fumbles it. Buffalo recovers a fumble, returns it as uh one of the linebackers returns it like all the way to the five-yard line. gets caught and somebody punches him from behind, ball goes out the back of the end zone, Page's ball again. And so um The Bills challenge whether he was down before the ball came out, and actually the play was ruled incomplete after all that. Bethel Johnson wasn't okay."
  },
  {
    "text" : "Yeah, he got jacked up in that play. I think he's hurt.",
    "timestamp" : "26:31-26:33",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I don't think he came back from that, yeah.",
    "timestamp" : "26:33-26:35"
  },
  {
    "speaker" : "Steve",
    "text" : "And they dropped Watson was on IR.",
    "timestamp" : "26:35-26:37"
  },
  {
    "text" : "Which I didn't know. Yeah, and Dion Branch was also out with injury, so it was not a lot of uh offensive weapons. There was no it didn't seem to be any Troy Brown really either because they had Tyrone Poole returning punts.",
    "speaker" : "Andy",
    "timestamp" : "26:38-26:50"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "26:50-26:50"
  },
  {
    "speaker" : "Andy",
    "text" : "So",
    "timestamp" : "26:51-26:51"
  },
  {
    "timestamp" : "26:51-27:01",
    "speaker" : "Greg",
    "text" : "The uh you do you can get that feeling as a fan when shit's just not going your way in games. Yeah. Yes. And you're like, we're not winning this game. Right."
  },
  {
    "timestamp" : "27:02-27:04",
    "speaker" : "Steve",
    "text" : "If the Patriots weren't playing the Bills, we would have lost this game."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:05-27:25",
    "text" : "Yeah. And I felt that a lot of times against the Bills, too. There was one Uh I think Danny Amendola's first season, and uh he was hurt the whole game, and like Brady is the only person he was going to the entire game, and they somehow like managed to claw their way back and win that one. Yeah, there's definitely been a lot of those."
  },
  {
    "text" : "I don't get it as much with the Patriots, probably because they know how to execute, but you do get it. Like I've seen it with you know, the Celtics or the the Bruins where you're just like or the Bruins losing against the Islanders is a great example of like There's every every single mistake they just get punished for. Yep. And then like every bounce is not going your way and you're like I've seen this play before and I know how this thing ends. Yeah, exactly. Yeah. You just know that no matter what you're able to watch. Yeah. It's brutal to play in too, because even when you're playing in those games It's like the bounces aren't going your ways. You start forcing it more and then you get like penalties. And it's like you just there is something to that, like, all right, one play at a time. I know it's a cliche, but It definitely has an impact.",
    "timestamp" : "27:26-28:17",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "28:17-28:18"
  },
  {
    "timestamp" : "28:18-28:18",
    "speaker" : "Greg",
    "text" : "Yeah, yeah."
  },
  {
    "text" : "I agree.",
    "speaker" : "Andy",
    "timestamp" : "28:19-28:19"
  },
  {
    "timestamp" : "28:19-28:24",
    "text" : "We'll save the best bills being bills for the end. You want to talk about the commentators, Andy? I know you got that on your mind.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh I didn't really have a lot of notes on the commentators themselves. What what when is ji I've learned that Jim Nance and Phil Sims, I can just tune them out. Like that's just I think that's become a defense mechanism for me because they've done so many Patriots games, especially Phil Sims, that I'm just like It's like the uh the teacher in Charlie Brown, just like in the background.",
    "timestamp" : "28:25-28:49"
  },
  {
    "timestamp" : "28:49-29:06",
    "speaker" : "Steve",
    "text" : "See, I Despite there was a lot of penetration talk, which, you know, is what it is. I thought they had some good nuggets in there. They were talking about the 49ers dynasty being able to get the most out of veterans. cut into the team and trying to win a ring. A little foreshadowing there."
  },
  {
    "text" : "Right, yeah.",
    "timestamp" : "29:06-29:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:07-29:18",
    "speaker" : "Steve",
    "text" : "And then I forget which one said it, but they were talking about Michael, Mike Frabes, and they said he's a classroom coach. Yeah, they did. Real foreshadowing."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, they the of that's come up a few times in the past where they're like, oh, Mike Vrabel, he's uh he's like a coach on the field and all this stuff. He he he might want to get into coaching once he's finished uh once he's finished playing football.",
    "timestamp" : "29:20-29:33"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "29:33-29:42",
    "text" : "Speaking of veterans, what are you what are you guys just general thoughts on Corey Dillon on and off the field?"
  },
  {
    "timestamp" : "29:42-30:23",
    "speaker" : "Andy",
    "text" : "Um I don't know much about him off the field. I know that like when he came to the Patriots he had a lot of He was known to have a lot of baggage. And there was talk about like we I we tried to look it up. I couldn't find him. There was talk about him um Like his offensive line saying they wouldn't block for him for some reason, like towards the end of his tenure in Cincinnati. Um he seems just like a get shit done kind of guy on the field though. And he is just He moves much more fluidly than I think he should as a big man. Similar to like a Rob Gronkowski Like he's just too big to move as fast and and to change direction as quickly as he does."
  },
  {
    "text" : "I think Greg doesn't give a shit what we think and he's just asking that question because he has his own answer.",
    "timestamp" : "30:23-30:28",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "He's gonna give No no no I Well I remember like my perception being like he's like, oh Cory Dillon arrested for this and that. It's like I always like remember thinking of him like, oh, he's just a misunderstood like Randy Moss typeware. Right, right, right. Nothing that bad. He's just like wants to win. So I looked up like controversy for Corey Dylan and dude, it's some dark shit in there. Really? Yeah. So was he perhaps a uh sometimes a naughty boy Y'all naughty is an understatement.",
    "timestamp" : "30:28-31:04"
  },
  {
    "timestamp" : "31:04-31:11",
    "text" : "Oh, all right, let's hear it. Yeah. I didn't realize this. Saw this coming from a fucking mile. He did call this.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "31:12-31:22",
    "text" : "I mean he was convicted twice for assaulting women. Apparently he hit his wife with his car. Oh wow. And when the cop showed up, she had like blood in his mouth or in her mouth."
  },
  {
    "text" : "Oh",
    "timestamp" : "31:22-31:23",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "31:24-31:47",
    "text" : "Uh that was two thousand two, so that was before the dad was traded for him. Yeah, yeah. Two thousand ten. Uh, he was arrested for assaulting his wife in an argument at their South Cara California home. Uh DUI whatever, drug stuff, whatever."
  },
  {
    "text" : "I can't believe you're skipping over those, Greg.",
    "speaker" : "Andy",
    "timestamp" : "31:48-31:51"
  },
  {
    "text" : "Well beating your well hitting your car your wife with your car seems like uh a bit of a Yeah.",
    "timestamp" : "31:52-31:59",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "32:00-32:06",
    "text" : "But what if he was drunk when he did it though? Does that change things? Is that just a DUI or is that four way to do it? Well did you need to?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:07-32:07",
    "text" : "I don't know."
  },
  {
    "timestamp" : "32:07-32:08",
    "text" : "It could be PTSD too.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:09-32:11",
    "text" : "You mean uh oatmeal brain?"
  },
  {
    "text" : "Yeah. Jesus. TTI?",
    "timestamp" : "32:11-32:14",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "CTE?",
    "timestamp" : "32:14-32:15"
  },
  {
    "text" : "CTE.",
    "timestamp" : "32:15-32:15",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:16-32:17",
    "text" : "CTE. There you go."
  },
  {
    "speaker" : "Steve",
    "text" : "PTSD from CTE.",
    "timestamp" : "32:18-32:20"
  },
  {
    "text" : "You can do what CTE stands for, Steve?",
    "timestamp" : "32:20-32:23",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Nope",
    "timestamp" : "32:24-32:25"
  },
  {
    "timestamp" : "32:28-32:30",
    "text" : "There's one like super long word in there.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And I couldn't tell you.",
    "timestamp" : "32:30-32:32"
  },
  {
    "text" : "traumatic and septicalophopody I'm gonna give it to you I'm not even gonna nailed it dude nailed it you might have been one and and Encepha Encephalophus.",
    "timestamp" : "32:37-32:52",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "32:53-32:55",
    "text" : "Encephalophagus. Encephalophagus.",
    "speaker" : "Andy"
  },
  {
    "text" : "Chronic traumatic excuse excuse.",
    "speaker" : "Steve",
    "timestamp" : "32:56-33:00"
  },
  {
    "text" : "Oh boy.",
    "speaker" : "Andy",
    "timestamp" : "33:01-33:02"
  },
  {
    "text" : "But did didn't do you have that perception too of like the Randy Moss? Yeah, I I I felt they were kind of like similarly misunderstood people. I didn't remember like serious offenses off the field.",
    "timestamp" : "33:04-33:15",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "33:16-33:19",
    "text" : "I think a lot of it came well you said 2010. That's four years after he retired.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "33:20-33:24",
    "text" : "Yeah. Well also 2000 though, right? Which is still earlier.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:24-33:30",
    "speaker" : "Steve",
    "text" : "That's like pre media hype, social media. If that happened nowadays, it's on a twenty-four hour news cycle."
  },
  {
    "timestamp" : "33:30-33:49",
    "speaker" : "Andy",
    "text" : "It's uh Well, I'm just looking at Richard Sherman right now, going through it. Yep. So I think it's probably a similar situation. Yeah, it feels yeah, it kind of has that feeling to it, doesn't it? But I'm not gonna comment on things that aren't out there yet, so I'll wait and see what happens. Dude, that's our job we're journalists."
  },
  {
    "timestamp" : "33:50-33:50",
    "speaker" : "Greg",
    "text" : "Are we?"
  },
  {
    "text" : "Is that what we're calling ourselves right now? Analysts. Analysts.",
    "timestamp" : "33:51-33:53",
    "speaker" : "Mom"
  },
  {
    "speaker" : "Greg",
    "text" : "We analyze. I didn't realize this was a uh a tryout for a WE. Yeah, we told we told Miguel we're journalists.",
    "timestamp" : "33:54-34:00"
  },
  {
    "timestamp" : "34:00-34:01",
    "speaker" : "Steve",
    "text" : "He laughed at our fucking faces."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he did. We told Jeff Howe the same thing and he laughed at us too.",
    "timestamp" : "34:02-34:05"
  },
  {
    "text" : "I mean he was polite about it, but yeah, I get it. It was a nervous lap though. Because he knew we're coming for that head.",
    "speaker" : "Greg",
    "timestamp" : "34:06-34:12"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:13-34:13",
    "text" : "That's right, yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Come for that.",
    "timestamp" : "34:13-34:14"
  },
  {
    "text" : "As soon as you start asking about how to get uh press passes to Belichick's conferences, you got a little worried.",
    "speaker" : "Andy",
    "timestamp" : "34:14-34:19"
  },
  {
    "text" : "He's gonna see those hundred dollars we donated and be like, oh shit.",
    "timestamp" : "34:19-34:22",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep, coming for you, yeah. Ball is big balless. Spending all this money from the uh the pay the the the fat stacks of Pages Dynasty that we have in our bank account, which for some reason looks very similar to my personal bank account, strangely. But we'll have to figure out. Daddy Fatstacks. Daddy Fatstacks evolution. B-I-G-B-O-I. Give me them ducats. Uh speaking of bodies though, um there was definitely a moment in this game where the Uh stadium was playing the the aforementioned song by Drowning Pool. Really? Yeah So there's definitely some drowning pool in the background.",
    "timestamp" : "34:22-35:09"
  },
  {
    "speaker" : "Greg",
    "text" : "It's such a good song. So that's confirmed, not disturbed. Let the body sit the floor.",
    "timestamp" : "35:09-35:14"
  },
  {
    "text" : "We had this drowning pool. Okay. All right. Yeah. Uh speaking of one hit wonders. I used to listen to that to go to sleep. Yeah, me too. Really? I thought I was the only one. Oh no, I well it was that until Slipknot came out, I think. And then it was whichever one came out first, I don't remember. But Ace Lips was on a Slipknot album.",
    "timestamp" : "35:14-35:39",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I started to listen to that song and being like, what am I doing? This is supposed to help me sleep.",
    "timestamp" : "35:39-35:44"
  },
  {
    "text" : "There used to be a CD we had kicking around the house where it was like a mix of rock songs. It had like Sip Knot and a bunch of stuff on there. Oh yeah and I wouldn't listen to the Rob Zombie one before bed because it used to give me nightmares. I used to think that about Slipknot when I first started listening to them.",
    "timestamp" : "35:45-36:01",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Like this is This is a little much for me.",
    "timestamp" : "36:01-36:04"
  },
  {
    "timestamp" : "36:04-36:10",
    "speaker" : "Steve",
    "text" : "And then the next year he's wearing spiky backpacks and weird snowboarding hats to high school."
  },
  {
    "timestamp" : "36:10-36:15",
    "speaker" : "Andy",
    "text" : "Yeah, and starting a metal band called Liquid Fetus. So, you know. Life comes at you fast, boys."
  },
  {
    "speaker" : "Steve",
    "text" : "Uh uh Yeah, so what else is let's get to the the the biggest bills B and B.",
    "timestamp" : "36:18-36:26"
  },
  {
    "timestamp" : "36:26-36:37",
    "speaker" : "Andy",
    "text" : "Do we do is there anything else you want to get to un until like because uh when we mentioned this play like people are gonna be like oh that's right I remember this game now I didn't remember this game. I didn't remember it either. Oh really? This this is what I remember this game for."
  },
  {
    "text" : "I laughed out loud when I saw it.",
    "timestamp" : "36:38-36:39",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "36:39-37:34",
    "speaker" : "Andy",
    "text" : "Yeah. Alright, so Let's let's go over this play. So we gotta really set the whole table here. So the score is uh 21. 17 Patriots. Fourth quarter. The Patriots scored the go-ahead. Yeah. Yeah, 24-17. I know math is hard. No, I said 17. So uh the Patriots uh on the play you mentioned where they were went to kick a field goal and the Bills were offsides and the Patriots scored a touchdown. So that was at the beginning of the fourth quarter. Patriots go ahead by touchdown. Um and then Buffalo went three and out and punted. Patriots uh three and out again and punted. And then Buffalo drove inside New England 20. Uh and they have third and two right around the 20-yard line. And the handoff Travis Henry and he has before that they called timeout."
  },
  {
    "timestamp" : "37:34-37:35",
    "speaker" : "Steve",
    "text" : "They won't think about it."
  },
  {
    "text" : "No, I'm no I'm talking about the third down before this. So third down, Travis Henry has a gaping hole. They run it to the right side, gaping hole, trips over nothing and falls over. So now it's fourth and one. That's could have picked up the first down. Probably may have actually been in line to score a touchdown. Untouched falls over in the hole. He's got a lot of things.",
    "timestamp" : "37:35-37:54",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "37:57-37:58",
    "speaker" : "Greg",
    "text" : "He might be still running to this day."
  },
  {
    "timestamp" : "37:59-37:59",
    "text" : "Exactly.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "38:01-38:04",
    "speaker" : "Greg",
    "text" : "Yeah, well that's uh running from those child support payments."
  },
  {
    "timestamp" : "38:06-38:51",
    "text" : "Technically is yeah, he is on the run from somebody. So fourth, fourth and short Bills call a timeout, talk it over. They're like, you know what? This. We're gonna beat the Patriots just like we did last year. Um, and so they get up to the line. Bloodzo drops back to hand it off. There's no running back there. Turns around the other way, and um Teddy Bruski is there. Hits him so hard and also knocks the ball out of Bledsoe's hands straight to the ground. Richard Seymour picks it up and returns it almost 80 yards for The game ceiling touchdown with Rodney Harrison um escorting him the entire way.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "38:51-39:05",
    "speaker" : "Steve",
    "text" : "Yeah. Just it's one of those plays that you just like sometimes will happen, you'd be like, oh, that's it's a broken play, you know? Turn the wrong way and running back went the wrong way and like the guy nobody decided to block Teddy. Yeah. Off of a timeout right in the middle. Yeah."
  },
  {
    "text" : "Nobody s everybody, every single person. If you I watched the replay of this play over and over again. And it's I I couldn't tell what the play was supposed to be because half the offensive line pulled one way, the other half blocked, like half of it like a couple guys pulled to the right. The rest of the offensive line blocked to the left. The running back went to the right and still didn't block Teddy Bruski. Came in untouched. Well, they actually showed afterwards, they showed uh Bledsoe on the ground, like look around, and you could see like you see him mouth the words, uh, he went the wrong way. So it was definitely a broken plate. There was no naked bootleg to this whatsoever.",
    "speaker" : "Andy",
    "timestamp" : "39:06-39:46"
  },
  {
    "speaker" : "Steve",
    "text" : "It's just the this is classic builds. You called a timeout.",
    "timestamp" : "39:46-39:50"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:50-39:54",
    "text" : "Yeah. To get on the same page and this is how you do it."
  },
  {
    "text" : "If this happens in the first quarter, you're like, ah, you know, it's fine. No, but with the game on the line. Crash time execution, it's always been the Bill's bugaboo. Yep. C was so bad. Wide, comma, right.",
    "speaker" : "Steve",
    "timestamp" : "39:55-40:09"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:12-40:13",
    "text" : "Norwood, comma scott."
  },
  {
    "text" : "Yeah. It's just it was, I don't know, just I hell, what do you guys want to do? Okay, I got it. Mike Werlocky looking for his first W. He goes, all right, um So you go the wrong way, running back. Half the line blocks one way, half blocks the other way. Let's open up Teddy. So when Drew turns around, he's right there in his goddamn face and he's gonna fumble it to Richard Seymour. All right, break So good.",
    "timestamp" : "40:13-40:39",
    "speaker" : "Steve"
  },
  {
    "text" : "C. Sheldon, whatever his name was, that took that punt, that kickoff out of the end zone then fumbled.",
    "timestamp" : "40:40-40:44",
    "speaker" : "Greg"
  },
  {
    "text" : "Uh Leonus to Calvin.",
    "timestamp" : "40:44-40:45",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "40:48-40:52",
    "speaker" : "Andy",
    "text" : "Yeah, it's just such a Bill's way to lose."
  },
  {
    "timestamp" : "40:52-40:59",
    "speaker" : "Steve",
    "text" : "I'm telling you, if anybody has any Bills fans in their fantasy football league, make them listen to every single Bills episode."
  },
  {
    "timestamp" : "40:59-41:11",
    "speaker" : "Andy",
    "text" : "Them reliving this is just gonna you know what that might actually be a good like uh come in last place in fantasy football. That's what I'm saying. Yeah. Like punishment is to have non pages fans listen to this, listen to the games. Th"
  },
  {
    "timestamp" : "41:11-41:15",
    "text" : "Dude, we should skip every game that the Bills win.",
    "speaker" : "Greg"
  },
  {
    "text" : "Ooh.",
    "timestamp" : "41:16-41:16",
    "speaker" : "Steve"
  },
  {
    "text" : "You know?",
    "speaker" : "Greg",
    "timestamp" : "41:17-41:17"
  },
  {
    "text" : "We're only gonna miss like a couple.",
    "timestamp" : "41:18-41:20",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh do you know how many that is? I think we've already done one. Uh It's three with with Brady. Overall, the Bills have won five games out of 40. In fact, uh if you sort the you can do this on the new Patriots Dynasty website, pastdynasty. com. Um, but if you sort the Patriots uh records versus the opponents by win percentage. You have the Falcons and the Cowboys. Patriots are undefeated. So 100% win percentage. They're eight and one against the Jaguars, which is 889. They're 6-1 against the Rams and Raiders, which is an 857. But between the Jaguars and the Rams, so basically what would account to like a 7-1 record. Is the pages record against the Bills, which is 35 and 5. So they have a seven one record against the Bills five times. And this is just Tom Brady or what are we talking about? No, this is this is just overall. Tom Brady, I think, is uh I'll have that too. Give me one second.",
    "speaker" : "Andy",
    "timestamp" : "41:20-42:29"
  },
  {
    "timestamp" : "42:29-42:35",
    "speaker" : "Steve",
    "text" : "And one of those Tom Brady losses against the Bills is a week 17 game where he plays the first half and sits."
  },
  {
    "text" : "Brady's 32 and three, a 9-14 win percentage.",
    "speaker" : "Andy",
    "timestamp" : "42:35-42:39"
  },
  {
    "timestamp" : "42:40-42:47",
    "text" : "Does that count that one where they played half? One is a thirty-one nothing game and one is that West Welker getting two hundred yards and still losing game.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "42:47-43:08",
    "speaker" : "Andy",
    "text" : "Yep. Mm-hmm. Yep. Those are the three. You you just know them off top of your head, don't you? Yeah. And then the other two, um One uh when Brady had to sit out his his oh yeah, one against Matt Castle and one when Brady had to sit out the four games. And they they didn't actually have a quarterback to start. Jacoby Brissett. Yeah. They should have won that game though. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "I was at a building. They had a long touchdown call back at the beginning. And the Bills fans are so hype. And I was I was leaving. I said, enjoy your Super Bowl. Enjoy your Super Bowl. Enjoy your Super Bowl. And I could see it in their eyes. They're like, fuck he's right. Yeah. We won the Super Bowl that year.",
    "timestamp" : "43:08-43:23"
  },
  {
    "text" : "That was their Super Bowl.",
    "speaker" : "Andy",
    "timestamp" : "43:26-43:27"
  },
  {
    "text" : "Yeah, it really was.",
    "timestamp" : "43:27-43:28",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Yeah, I mean, I I feel like I don't want to skip the Bills losses just because they're so out of the ordinary, you know? And they're and because of that they're so memorable. I don't really remember that West Welker getting a ton of yards game, so I wouldn't Yeah, I well that must be an electric game. I only remember it because it was at Orchard Park, I believe.",
    "speaker" : "Andy",
    "timestamp" : "43:28-43:48"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:48-43:48",
    "text" : "too."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:48-43:58",
    "text" : "Yeah. And it was uh Ryan Fitzpatrick as a quarterback. Yeah. And he threw, I think he threw four touchdowns on four interceptions. So it's your typical Ryan Fitzpatrick."
  },
  {
    "text" : "It was sort of similar to this game. This game was really back and forth, and then the Bills just absolutely choked it.",
    "speaker" : "Steve",
    "timestamp" : "43:58-44:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:03-44:04",
    "text" : "Yeah."
  },
  {
    "timestamp" : "44:04-44:14",
    "text" : "And that was a critical moment. You know, fourth down, you're inside the red zone. You were third and two, and then the guy stumbles, and then you call timeout, and then you have the absolute Jorst play.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Worst play. Worst play. Man",
    "timestamp" : "44:14-44:19"
  },
  {
    "text" : "Uh I didn't look at the you look at the box score and the Patriots ran away with it, right? No, we beat him by two touchdowns. Like if you're just scrolling through that list on the Page of Science, like, yeah, of course we beat him 31-17, ho-hum.",
    "speaker" : "Steve",
    "timestamp" : "44:20-44:30"
  },
  {
    "text" : "Yep But no, this was like super exciting. It kind of came down to the wire except for that last fourteen point swing, basically.",
    "speaker" : "Andy",
    "timestamp" : "44:30-44:38"
  },
  {
    "text" : "Yeah, Bills could have won it if they hadn't fucked that up and gone off size on that field goal attempt.",
    "timestamp" : "44:39-44:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Right.",
    "timestamp" : "44:45-44:46"
  },
  {
    "timestamp" : "44:46-44:46",
    "speaker" : "Steve",
    "text" : "Right."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:47-45:23",
    "text" : "It's just those small little things that uh Classic build. So sit we've been doing this and we haven't seen a loss in 18 games. Do you remember what coach Steve Sferrier? Damn it. I can't believe you got that so quickly. It was 371 days ago. It was the last time the pages lost, and it was to Steve Sparrier's Washington Redskins. Fucking ridiculous. Of all the teams too. But again, that was a game like we're talking about that nothing went right, you know? They just it's a good bookend. Yeah, exactly."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, we got a dog alert. And how did she get out of her crate?",
    "timestamp" : "45:24-45:27"
  },
  {
    "timestamp" : "45:29-45:31",
    "speaker" : "Steve",
    "text" : "She opened the door to the room too."
  },
  {
    "timestamp" : "45:32-45:48",
    "text" : "Get her over here. Get her on the pod. Oh my god, we got a dog that's smarter than Steve. Oh gus. We got some questions for you. If you had to sniff any player's butt in the league, whose butt would it be? And why is it? If you had to hump one leg.",
    "speaker" : "Andy"
  },
  {
    "text" : "Tom Brady's leg. I mean come on.",
    "speaker" : "Steve",
    "timestamp" : "45:48-45:50"
  },
  {
    "timestamp" : "45:50-45:52",
    "text" : "Is it Tom Brady's left or right leg?",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh She's on the she's on the left side.",
    "timestamp" : "45:52-45:55",
    "speaker" : "Steve"
  },
  {
    "text" : "I like how we just knew that.",
    "timestamp" : "45:57-45:58",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, that's for the treatside schema treats on the left side, so she's always on the right side.",
    "timestamp" : "45:59-46:02"
  },
  {
    "timestamp" : "46:02-46:06",
    "text" : "That's fair. So it's your fault.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:06-46:08",
    "speaker" : "Steve",
    "text" : "Yeah. Alright, let's do best of worst here."
  },
  {
    "timestamp" : "46:08-46:11",
    "speaker" : "Andy",
    "text" : "All right, all right. Give me your best and worse, Steve."
  },
  {
    "timestamp" : "46:13-46:27",
    "speaker" : "Steve",
    "text" : "Uh from my perspective, the best. There was a couple milestones for Brady in this game. Early Brady milestones, where we didn't know how good. 1,000 completions."
  },
  {
    "timestamp" : "46:28-46:28",
    "text" : "Okay.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "46:28-46:31",
    "text" : "Corey Dillon had a sweet blitz pickup too."
  },
  {
    "text" : "That was gonna be one of my best. Yeah. Yeah. He yeah, he he caught Tom Brady's thousandth uh completion and he blocked the defensive end. And got like lit up doing it. Yeah. Gets up, catches the dump off, which was like wasn't even a great throw. Um, makes a nice snag and then runs for 12 yards in a first down.",
    "speaker" : "Andy",
    "timestamp" : "46:31-46:49"
  },
  {
    "speaker" : "Steve",
    "text" : "Yep. And then 75 touchdown passes. Daniel Graham and I have a note. That was an easy catch. I'm surprised he made it.",
    "timestamp" : "46:49-47:00"
  },
  {
    "timestamp" : "47:00-47:05",
    "text" : "My note on Daniel Graham was if he learned how to catch, he'd have been uh the original Rob Ronkowski.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "47:06-47:27",
    "text" : "And then my worst is poor poor Drew. You know, I love Drew Bledsoe and after that hilarious play, they trotted him back out there after they got the ball back and he was just getting Bliss. They're just bringing this Rodney Harrison over and over."
  },
  {
    "text" : "Yeah, he got sacked twice on the first two plays after the game.",
    "timestamp" : "47:30-47:33",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:33-47:49",
    "text" : "But it's true bloodstone. Throw deep balls, he's gonna chuck it up and he actually moved him down the field a little bit, but he was just taking a beating and you're like dude, it's like a there's four seconds left. Like what are you doing? He's gonna die.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes. Yeah, it was rough.",
    "timestamp" : "47:49-47:52"
  },
  {
    "speaker" : "Greg",
    "text" : "Um all right, Greg, you got any best and worse? That was gonna be my worst. They they sacked him three times on that last drive. They did, yeah. So bad.",
    "timestamp" : "47:53-48:04"
  },
  {
    "timestamp" : "48:05-48:06",
    "speaker" : "Andy",
    "text" : "And you just stood there and took it and you couldn't."
  },
  {
    "speaker" : "Steve",
    "text" : "Sack sack, 17 yard completion, incomplete. Sack. Six yards, two yards, ten yards, sack. Incomplete. 13 yards, incomplete in the end zone, which should have been a pick.",
    "timestamp" : "48:07-48:19"
  },
  {
    "text" : "Yeah. Yeah, that was 10 euro and three.",
    "timestamp" : "48:19-48:22",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "48:23-48:31",
    "text" : "Yep. And uh the pretty much season over there. Yeah, and the people in Buffalo were talking about how Drew just can't play anymore and they wanted to get rid of him because that's how Buffalo works.",
    "speaker" : "Andy"
  },
  {
    "text" : "This game happens, you're 0 and 3, you're punting on the year, you have an old quarterback. Let's move on. Yeah. I'd be saying the same shit.",
    "timestamp" : "48:36-48:44",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, 'cause how long did he last in Buffalo before he got traded to Dallas? And had a bit of a uh renaissance with Bella Ch uh Parcells and uh and Tyree Glenn too.",
    "timestamp" : "48:44-48:55"
  },
  {
    "speaker" : "Steve",
    "text" : "And kind of like who did the Bills end up moving on to? It's like Rob Johnson. That's the one.",
    "timestamp" : "48:55-49:01"
  },
  {
    "speaker" : "Andy",
    "text" : "It's JP Lossman.",
    "timestamp" : "49:01-49:02"
  },
  {
    "text" : "It is.",
    "timestamp" : "49:02-49:02",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "49:02-49:23",
    "text" : "Doug Flutie. JP Lossman. Wait, is Flutie before this? Yeah, remember we had the whole Flutie Rob Johnson uh conundrum and then we did they have it's lossman he's it is jp lossman guy that they they drafted yeah wow i think i had a jp lossman rookie card back in the day I don't think I kept it. It's probably not worth anything.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, yeah, no kidding.",
    "timestamp" : "49:23-49:24"
  },
  {
    "text" : "If I had to venture a guess. Oh man.",
    "timestamp" : "49:24-49:31",
    "speaker" : "Andy"
  },
  {
    "text" : "Alright, my best is Terrence McGee. Ooh, all right. Two passes defense. Seven tackles. And four returns for buck seventy-six, forty-four yard average and a touchdown. Yeah. Dude had a really good game He did, yeah, he be stepped up.",
    "speaker" : "Greg",
    "timestamp" : "49:31-49:54"
  },
  {
    "timestamp" : "49:54-49:55",
    "speaker" : "Andy",
    "text" : "And that kicked it up."
  },
  {
    "timestamp" : "49:55-50:12",
    "speaker" : "Steve",
    "text" : "Except for that one hurry got absolutely burned by Patton on that touchdown right before the f He The first half of it. Yeah, I don't know if that was so much as it was like kick returns it for a touchdown, like, yeah, fuck yeah, let's go. And then he just absolutely gives it up on the other end. Oops. Yeah. Steve, why can't you let him have nice things?"
  },
  {
    "timestamp" : "50:12-50:17",
    "speaker" : "Andy",
    "text" : "The touchdown well the touchdown of Patton, Patton didn't have anyone literally within like twenty square yards of it."
  },
  {
    "timestamp" : "50:17-50:20",
    "text" : "And like they replayed it and they like isolated like, yep, that's his fault.",
    "speaker" : "Steve"
  },
  {
    "text" : "We got caught up in the in the chaff. All right. Did you have a worse, Craig? Just the Tom Brady stuff? Yeah. Yeah. All right. All right. Um My best was um learning that this is kind of like a sad best for the bells, but those are the best ones. Um Eric Molds. of the uh he has every single Bill's offensive touchdown uh this season. And uh do you anybody want to guess how many that is?",
    "timestamp" : "50:22-50:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "50:56-50:59",
    "speaker" : "Steve",
    "text" : "Wait, so you hit every Bill's offensive touchdown?"
  },
  {
    "speaker" : "Andy",
    "text" : "Every single Bills offensive touchdown so far this season, three, three weeks.",
    "timestamp" : "50:59-51:02"
  },
  {
    "text" : "So far, I think.",
    "timestamp" : "51:02-51:03",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And yes.",
    "timestamp" : "51:03-51:05"
  },
  {
    "text" : "Um he had won this game.",
    "timestamp" : "51:05-51:07",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "51:07-51:08",
    "speaker" : "Andy",
    "text" : "He did."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. So I'm gonna guess one.",
    "timestamp" : "51:08-51:09"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:10-51:10",
    "text" : "Uh three."
  },
  {
    "speaker" : "Greg",
    "text" : "I got it. They lost both games 13 to 10 to start the year, I think.",
    "timestamp" : "51:11-51:16"
  },
  {
    "timestamp" : "51:16-51:21",
    "speaker" : "Andy",
    "text" : "Oh really? And he had all those touchdowns. So it was just him carrying the league."
  },
  {
    "timestamp" : "51:21-51:28",
    "text" : "Um ten catches for a buck twenty-six and a touchdown. That's a good game. Yeah. Fifteen targets.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "51:29-51:37",
    "speaker" : "Steve",
    "text" : "He had an early where Bledsoe had an absolute bomb to Lee Evans. See, Bledsoe's throwing some classic Bledsoe balls in this game."
  },
  {
    "text" : "As he does, but It takes them a while in the pocket to get there. And so if you can get to them, you're going to get your six sacks, and that's not going to work for them. Um My worst was the Bills fans in this game. I know it's tough in Buffalo, but they were dying to get a late hit penalty. And they were being super salty about it. Uh lots of booing and jeering and and whatnot. Just not a great look. Come on, Andy.",
    "timestamp" : "51:37-52:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Not a great look. I'm just saying Why I don't know.",
    "timestamp" : "52:09-52:13"
  },
  {
    "timestamp" : "52:13-52:19",
    "text" : "I saw criticizing refs for y them not calling penalties on your for your team in their favor.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "You're the king of that.",
    "timestamp" : "52:21-52:22"
  },
  {
    "text" : "I know.",
    "speaker" : "Greg",
    "timestamp" : "52:22-52:23"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. I saw a cut of a dude with a wind-up camera and wearing a wig.",
    "timestamp" : "52:23-52:27"
  },
  {
    "timestamp" : "52:27-52:46",
    "text" : "Yeah. Just just tough luck. Tough luck. And then one of the hurt raff was a tough luck. Yeah, yeah, that wasn't great. And then Booing the the guy that came in for him, who was completely in oversight. He was struggling. That guy gets spooed.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:46-53:17",
    "text" : "Yeah. And then speaking on that, I hate when people call like entire fan bases like scumbags or whatever over like A couple hundred people booing a raft. It's like every single fan base in the entire world does things like that. Yeah. And then people will be like, the city of Buffalo. Very problematic. It's like, dude. You mean humans in general? Yeah. Or have a have a percentile that are after."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "53:19-53:27",
    "text" : "Yeah, I hate that shit. I feel like I've heard you talk shit on Eagles fans and Ravens fans. Yeah, and there's plenty of good Eagles fans."
  },
  {
    "text" : "Yep.",
    "speaker" : "Greg",
    "timestamp" : "53:27-53:27"
  },
  {
    "text" : "Would you go any Baltimore or Philly?",
    "speaker" : "Steve",
    "timestamp" : "53:28-53:31"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "53:31-53:33",
    "text" : "Yeah, of course I would."
  },
  {
    "timestamp" : "53:33-53:44",
    "speaker" : "Steve",
    "text" : "I've never been to a game in Baltimore, Philly. You wouldn't go to one? I have no real desire to. Just from those fan base's reputations, because yes, there's bad apples in every group, but there's more in those. From in my opinion."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Philly I think has more of a reputation.",
    "timestamp" : "53:45-53:47"
  },
  {
    "timestamp" : "53:47-53:50",
    "text" : "Pittsburgh. I've been to Pittsburgh twice, thrice.",
    "speaker" : "Steve"
  },
  {
    "text" : "Baltimore wouldn't bother me. I think that's a good rivalry. I think the Baltimore fans are okay. Um but I don't get down.",
    "timestamp" : "53:51-54:02",
    "speaker" : "Andy"
  },
  {
    "text" : "Gus down.",
    "timestamp" : "54:02-54:04",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "54:06-54:06",
    "speaker" : "Steve",
    "text" : "Yes down."
  },
  {
    "text" : "Pooh. Pooh right there in the cooker. That's it.",
    "timestamp" : "54:07-54:12",
    "speaker" : "Greg"
  },
  {
    "text" : "Now puke on the floor, guys. This is such good radio.",
    "timestamp" : "54:12-54:15",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Steve, what's been the hardest part about owning a dog? Best and worst of owning a dog.",
    "timestamp" : "54:16-54:21"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, best and worst of owning a dog. Best is yeah, that's just awesome having a dog.",
    "timestamp" : "54:21-54:29"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay, pets, is that where you're going with?",
    "timestamp" : "54:31-54:33"
  },
  {
    "speaker" : "Steve",
    "text" : "Not just of the dog you own, but all the other dogs you meet on the street too.",
    "timestamp" : "54:36-54:38"
  },
  {
    "text" : "Oh, that's fair. You get to pet a lot of lot of But I could do I could pet other dogs in the street.",
    "speaker" : "Greg",
    "timestamp" : "54:39-54:43"
  },
  {
    "speaker" : "Steve",
    "text" : "It's not the same. It's not the same.",
    "timestamp" : "54:44-54:45"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "54:45-54:45",
    "text" : "Yeah."
  },
  {
    "text" : "Why not? You'd be a weirdo trying to be like, can I pet your dog but your dog can put your dog? Now Gus meets every single dog she sees because she just fucking loves everything.",
    "timestamp" : "54:45-54:54",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "You think so? You think that's a thing?",
    "timestamp" : "54:56-54:58"
  },
  {
    "timestamp" : "54:59-55:01",
    "speaker" : "Steve",
    "text" : "Yeah. Oh yeah. I had a lot more dogs with cuss."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I guess because you stop and you stand there. Right, because the dogs have to meet each other and yeah. Yeah. Isn't that kind of awkward though? Like what do you talk with the dog owner? Oh yeah.",
    "timestamp" : "55:02-55:12"
  },
  {
    "text" : "I love it. I love meeting new people, but Lauren's not a bite. If you don't like meeting new people, you're not gonna like",
    "speaker" : "Steve",
    "timestamp" : "55:13-55:17"
  },
  {
    "timestamp" : "55:17-55:19",
    "speaker" : "Greg",
    "text" : "Yeah, yeah, I would hate that."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, I love it.",
    "timestamp" : "55:19-55:20"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:20-55:25",
    "text" : "Like, oh, what kind of breed is it? Oh, no, she's beautiful. Oh. Oh yeah."
  },
  {
    "text" : "My line is Yeah, she's as cute as she is crazy. Oh, alright. Yeah, but they know that stacked up by Gus going Buck fucking wild while she's meeting other dogs, you know?",
    "speaker" : "Steve",
    "timestamp" : "55:28-55:37"
  },
  {
    "timestamp" : "55:37-55:42",
    "text" : "Steve, I'm gonna give you a little uh Pro tip here. Oh, okay. From a man who doesn't own dogs. Okay.",
    "speaker" : "Greg"
  },
  {
    "text" : "No, no.",
    "speaker" : "Steve",
    "timestamp" : "55:43-55:43"
  },
  {
    "text" : "Dude who's who's who just stepped in dog shit this past weekend. A little small talk pro tip. People know when you got a line that you say all the time.",
    "speaker" : "Greg",
    "timestamp" : "55:44-55:51"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "55:52-55:53",
    "text" : "Obviously."
  },
  {
    "speaker" : "Greg",
    "text" : "You know? It's like when you hear old men say that shit.",
    "timestamp" : "55:52-55:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "55:55-55:55"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:55-55:56",
    "text" : "Yeah?"
  },
  {
    "speaker" : "Steve",
    "text" : "So it's not gonna hit the same, you know. No shit. I don't need to hit the same. These fucking random strangers I'm meeting on the street. I'm not trying to fucking be best friends with them, Craig. Of course you're getting my BV. Fair enough. Fair enough.",
    "timestamp" : "55:56-56:07"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:09-56:13",
    "text" : "At least we don't see. Stand up for yourself."
  },
  {
    "timestamp" : "56:16-56:17",
    "speaker" : "Greg",
    "text" : "B material."
  },
  {
    "speaker" : "Andy",
    "text" : "All right.",
    "timestamp" : "56:17-56:18"
  },
  {
    "text" : "She's crazy as she looks. Yeah. I love this. She is crazy. Yeah. Any like work or like humor where you don't know the people that well is like almost inherently being material.",
    "timestamp" : "56:18-56:28",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "56:28-56:28",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "56:29-56:31",
    "text" : "I just like the fact that Steve thinks he's got A material too.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "That's the best podcast. I got A material. Sometimes. Sometimes it's unintentional. I'm laying all my A material out on this podcast. Are you kidding me?",
    "timestamp" : "56:31-56:39"
  },
  {
    "text" : "Really? When",
    "timestamp" : "56:39-56:40",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:40-56:50",
    "text" : "Yeah, everyone when I was down in North Carolina said, Oh, I love the podcast because you shit on Craig all the time. That's my A material people. No, they're just being polite because it's so good."
  },
  {
    "speaker" : "Andy",
    "text" : "They tell me that about you, Steve.",
    "timestamp" : "56:53-56:54"
  },
  {
    "text" : "Yeah, I care.",
    "speaker" : "Steve",
    "timestamp" : "56:55-56:55"
  },
  {
    "timestamp" : "56:57-57:04",
    "speaker" : "Greg",
    "text" : "So uh the best part is is petting other people's Dogs. Well, no, just petting dogs and dogs."
  },
  {
    "text" : "My dog plus other people's dogs. Just the amount of dog petting. That's fair.",
    "speaker" : "Steve",
    "timestamp" : "57:04-57:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. Worst.",
    "timestamp" : "57:09-57:10"
  },
  {
    "timestamp" : "57:10-57:24",
    "speaker" : "Steve",
    "text" : "Uh just you have to plan your you know everything around the dog. Here I thought it'd be poop related, but we're going we're going back in the office now, so we're like figuring out that and we're going to Maine and we gotta figure that out. You know, you just always just complicates plans."
  },
  {
    "timestamp" : "57:24-57:25",
    "speaker" : "Andy",
    "text" : "You can't just get up and leave anymore, yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Yep.",
    "timestamp" : "57:26-57:26"
  },
  {
    "timestamp" : "57:26-57:42",
    "speaker" : "Greg",
    "text" : "Yep. Do you feel like you are kind of like a I don't know if proxy is the right word, but like when the dog is acting inappropriately that you're getting judged for it."
  },
  {
    "text" : "Uh I don't get allowed because Gus is super easy. She's super chill. She just loves everything. She doesn't really have any behavior problems.",
    "timestamp" : "57:43-57:49",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "57:49-57:52",
    "text" : "Like jumping on people though? You told me she does that. Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "57:52-57:54",
    "text" : "Well at least she's pull it back."
  },
  {
    "text" : "Biting people in in the face.",
    "timestamp" : "57:54-57:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "57:57-57:58",
    "text" : "She doesn't really do that. Just me."
  },
  {
    "timestamp" : "58:00-58:02",
    "speaker" : "Andy",
    "text" : "I mean that's because you put your face in the way."
  },
  {
    "timestamp" : "58:02-58:14",
    "text" : "Yeah, I'm putting my face right in your mouth. Also that Steve's like impossible to shame. This is true, yeah. Yeah, you just have like the social acuity to I do.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "58:14-58:18",
    "speaker" : "Steve",
    "text" : "Again, I sh I feel like I should be ashamed right now, but I just I'm just not."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:18-58:25",
    "text" : "I just don't care if it's a people think, so here we go. You just never learn the shame pieces in way. No, everybody loves my dog."
  },
  {
    "text" : "No, no, I don't they they might not love my dog. I just don't care that they don't love my dog.",
    "timestamp" : "58:26-58:30",
    "speaker" : "Steve"
  },
  {
    "text" : "I agree. Ruffhausen dogs is is wicked fun.",
    "speaker" : "Greg",
    "timestamp" : "58:37-58:40"
  },
  {
    "speaker" : "Steve",
    "text" : "It's wicked fun. Yeah, I do enjoy that. The dog loves a good Ruffhausen too.",
    "timestamp" : "58:40-58:44"
  },
  {
    "timestamp" : "58:44-58:48",
    "speaker" : "Greg",
    "text" : "Yeah, just like pushing them around and being like, yeah, what's up? I'm the king here."
  },
  {
    "speaker" : "Andy",
    "text" : "Till it bites you in the face and then no longer the king. The game over when somebody cries. No blood, no hurt. That's how we used to play growing up.",
    "timestamp" : "58:49-59:00"
  },
  {
    "text" : "That's how we play the dog too.",
    "timestamp" : "59:01-59:02",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. The pooping though. Jeez man. Yeah. That would not that that would probably be my worst part, the pooping.",
    "speaker" : "Andy",
    "timestamp" : "59:03-59:09"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "59:10-59:10",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "59:11-59:38",
    "speaker" : "Greg",
    "text" : "Well, let's talk this in poopin' that. If they could just come up with a breed, I I was actually thinking of this the other day. doesn't poop that just uses every fiber of the food source. Yeah. Or even a food source that, you know. And then I was thinking like, what kind of like Like the human body is like a miracle, right? Mm-hmm. What are we pooping for? Why aren't we just using it? Like, I don't know. There's Everything poops, Greg. Haven't you read that book?"
  },
  {
    "speaker" : "Andy",
    "text" : "I yeah, I know everything poops, but have you ever thought why everything poops? Because not everything that goes in you is is good. Like if you're eating a fucking entire box of Cheetos, like some of that stuff's gonna come out.",
    "timestamp" : "59:38-59:51"
  },
  {
    "text" : "So what about peeing then? Like it's just water. I should be using the water.",
    "speaker" : "Greg",
    "timestamp" : "59:51-59:54"
  },
  {
    "speaker" : "Andy",
    "text" : "It's not just water. No, it's getting rid of all the shit that your liver is filtering out, right? Liver?",
    "timestamp" : "59:54-59:59"
  },
  {
    "text" : "Just like a car, you know, you there's waste when you uh press on the gas.",
    "timestamp" : "59:59-01:00:03",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Shut up Gus. We're talking. I don't know, I'm just saying, if we could get a dog that didn't poop, I'd really be onto something. J Get on that science. Write this down. Dog that doesn't poop.",
    "timestamp" : "01:00:05-01:00:22"
  },
  {
    "timestamp" : "01:00:23-01:00:24",
    "speaker" : "Andy",
    "text" : "How do you patent something?"
  },
  {
    "timestamp" : "01:00:27-01:00:31",
    "speaker" : "Greg",
    "text" : "Or even a food that makes them not have to poop but keeps them alive."
  },
  {
    "speaker" : "Andy",
    "text" : "Like that's I I mean think of how much of how much more you get done in a day if you didn't poop. That's true. Yeah, yeah. I would get a lot. Well, yeah. I wouldn't get as much I wouldn't get as far in my my uh games on my phone. I enjoy pooping though.",
    "timestamp" : "01:00:31-01:00:46"
  },
  {
    "timestamp" : "01:00:47-01:00:53",
    "text" : "Yeah. It's a nice little sanctuary. Yeah. We thought that one out.",
    "speaker" : "Greg"
  },
  {
    "text" : "Thanks.",
    "speaker" : "Steve",
    "timestamp" : "01:00:53-01:00:53"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:00:54-01:01:01",
    "text" : "I haven't even thought that one up. That's the real one. Yeah. Well you just go crazy if you don't sleep. That's ridiculous."
  },
  {
    "text" : "Ridiculous.",
    "timestamp" : "01:01:02-01:01:02",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:01:02-01:01:05",
    "speaker" : "Greg",
    "text" : "Like what how do we function like this?"
  },
  {
    "timestamp" : "01:01:05-01:01:13",
    "speaker" : "Steve",
    "text" : "The brain is gonna drag what if you're pooping because you're sleeping? When you're sleeping you're making Yeah, so maybe you should I wanna see And if you can eliminate sleep, you eliminate poop."
  },
  {
    "text" : "How long do you think you can go without sleeping and or pooping?",
    "speaker" : "Andy",
    "timestamp" : "01:01:13-01:01:16"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:01:17-01:01:18",
    "text" : "I don't know, six hours?"
  },
  {
    "timestamp" : "01:01:20-01:01:38",
    "text" : "Definitely go a long time. 45 minutes. I I've always wanted to do that, to push the limits of sleeping and see how weird it gets. You should talk to uh Mr. Mello. No one's stopping you, Greg. You did that with your beat. That's the thing. No one's stopping you. Yes. Except for yourself.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "And your wife. Yeah, well, yeah. Yeah, you'd be miserable. No, Mike Mello has done that and he uh talks about after I think he did f like 30 something hours or forty something hours and he started like hallucinating and shit",
    "timestamp" : "01:01:39-01:01:54"
  },
  {
    "text" : "That's not good. Often like just miss one night of sleep. Yeah, no, but road trips and shit. Missing like two nights of sleep. Two nights of sleep would probably be crazy.",
    "timestamp" : "01:01:54-01:02:04",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Go to Iraq. Join ISIS. Get captured. And you'll find out.",
    "timestamp" : "01:02:04-01:02:09"
  },
  {
    "text" : "Yeah. Jesus. And I bet it's different when you got that adrenaline going, you know? Yeah, maybe. That natural adrenaline. Keep you up longer.",
    "timestamp" : "01:02:10-01:02:18",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:02:19-01:02:21",
    "text" : "They'll inject you with adrenaline, bro.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:02:21-01:02:22",
    "text" : "Hell yeah, dude."
  },
  {
    "text" : "That'll be fun. And we get I you can buy adrenaline. You can buy synthetic adrenaline. Also, it's it's called ISIL, Steve, okay.",
    "timestamp" : "01:02:22-01:02:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:02:31-01:02:44",
    "text" : "Uh I just know things. Okay, this is very quickly. We'll just ship it to Peyton Man who's wife's house. It's how you bring it back to podcasts."
  },
  {
    "text" : "I was gonna say speaking of people who didn't give a fuck. Um We'll end on the quote from Bill Balichek when asked about what he thought about matching the 18 win record. Anybody have a guess? Do you think you thought this was important? No, you don't.",
    "timestamp" : "01:02:48-01:03:02",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:03:03-01:03:09",
    "speaker" : "Greg",
    "text" : "I don't know. He's kind of like a historian of the game, so it could go either way. Quote, we don't care about that."
  },
  {
    "timestamp" : "01:03:10-01:03:14",
    "speaker" : "Andy",
    "text" : "I care about this season and that this is a divisional game. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Come on.",
    "timestamp" : "01:03:14-01:03:14"
  },
  {
    "speaker" : "Andy",
    "text" : "See that's that's where that's where Bullch Belchik's full of shit, dude.",
    "timestamp" : "01:03:14-01:03:18"
  },
  {
    "speaker" : "Steve",
    "text" : "Yes, he does care about it.",
    "timestamp" : "01:03:18-01:03:19"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he claims to be like a historian of the game and respect history and shit like that. Well I think he knows. And then when you break a record, like shouldn't you acknowledge that? He's not breaking.",
    "timestamp" : "01:03:22-01:03:30"
  },
  {
    "speaker" : "Steve",
    "text" : "He's just talking about he's never gonna do it in the moment.",
    "timestamp" : "01:03:30-01:03:33"
  },
  {
    "timestamp" : "01:03:33-01:03:40",
    "speaker" : "Greg",
    "text" : "He's never gonna do it to the media. He might do that in like team meetings or something, but which means he's just feeding you bullshit."
  },
  {
    "timestamp" : "01:03:40-01:03:45",
    "speaker" : "Steve",
    "text" : "That's fine. It's all on act. Yeah. And like this podcast isn't doing the same exact thing."
  },
  {
    "text" : "Feeding people bullshit. These are my most authentic Takes Steve.",
    "timestamp" : "01:03:46-01:03:50",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:03:50-01:03:51",
    "speaker" : "Steve",
    "text" : "Yeah, which are bullshit."
  },
  {
    "text" : "I'm not saying, but that's how you know they're authentic, is because I they're clearly not thought out, they're just like off what my emotions are telling me at this current moment.",
    "speaker" : "Greg",
    "timestamp" : "01:03:51-01:04:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh all right, so what do you have to look forward to next week?",
    "timestamp" : "01:04:04-01:04:06"
  },
  {
    "text" : "Well, do we have any quotes from Belt Bledsoe after the game?",
    "timestamp" : "01:04:07-01:04:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh yeah, he ran the wrong way. That was during the game, but Yeah, well, you know, close enough.",
    "timestamp" : "01:04:10-01:04:15"
  },
  {
    "speaker" : "Greg",
    "text" : "Here we go. I got one. And in the shower trying to figure it out. What could what can I do to make a change? We're making mistakes at the wrong time and especially against the defending world champs. You can't make mistakes like that.",
    "timestamp" : "01:04:15-01:04:36"
  },
  {
    "text" : "I do a lot of my thinking in the shower too. Like I think. So I come up with a lot of these stupid ideas for this podcast in the shower. So I'm thinking about you boys while I'm naked And wet, just so you know.",
    "speaker" : "Andy",
    "timestamp" : "01:04:36-01:04:49"
  },
  {
    "timestamp" : "01:04:49-01:04:53",
    "text" : "Oh you're welcome. Play that naughty boy thing, maybe friends.",
    "speaker" : "Steve"
  },
  {
    "text" : "Sometimes a naughty boy. Very naughty. Yes.",
    "speaker" : "Mom",
    "timestamp" : "01:04:54-01:04:58"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh you're welcome. And then is this Satramone?",
    "timestamp" : "01:04:59-01:05:02"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:05:02-01:05:03",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:05:06-01:05:07",
    "speaker" : "Andy",
    "text" : "All those feel appropriate for that."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:05:07-01:05:12",
    "text" : "I need a door closing one so I quit this podcast again every episode."
  },
  {
    "text" : "Oh my goodness. All right. So next week, Patriots will be playing uh so they have the chance to break the record. Of the 1972 Dolphins against the 2004 Dolphins. I don't know if the game is home or away because I don't have that in front of me. But it doesn't really matter because who the fuck cares? It's the Miami fucking Dolphins.",
    "timestamp" : "01:05:14-01:05:40",
    "speaker" : "Andy"
  },
  {
    "text" : "Unless we win. Yeah.",
    "timestamp" : "01:05:40-01:05:42",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:42-01:06:09",
    "text" : "It is at home against the Dolphins. The 0-4 Miami Dolphins. This is not a good year for the uh AFC East, it doesn't seem like, except for these New England Patriots. Um I'm curious to know actually how the 2004 AFC East did. Not bad. The Bills. The Bills, uh the Bills, and I'll just tell you this. The Bills this season finish nine and seven. Nine and seven. Nine and seven."
  },
  {
    "text" : "So they just so we're to turn it around. They went nine and four from here on out.",
    "timestamp" : "01:06:09-01:06:16",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:06:16-01:06:17",
    "text" : "Yeah."
  },
  {
    "text" : "And Bledzo starred every game.",
    "timestamp" : "01:06:18-01:06:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Better than last year. They could have been uh ten and six if they hadn't gone off sides on a field goal attempt. Stumbled in the hole on third and two, it called a timeout and then not blocked Mike Crabell.",
    "timestamp" : "01:06:20-01:06:34"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm just looking at their Wikipedia from 04 Uh Buffalo needed a win in the final game of the season against the Steelers to qualify for the players playoffs, however, despite the Steelers playing their third stringers. Yeah. Buffalo lost and subsequently missed the playoffs. Darn it! Darn it, Buffalo.",
    "timestamp" : "01:06:36-01:06:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, let's go, Buffalo. So close, as always. So close.",
    "timestamp" : "01:06:56-01:07:04"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh according to Football Outsiders, who has tracked every play in the NFL since the early nineteen nineties. The 2004 Bills are statistically the best NFL team in their record keeping history to have failed to qualify for the playoffs. That's a fucking bill stat right there, baby. That is the ultimate bills being bills.",
    "timestamp" : "01:07:04-01:07:27"
  },
  {
    "timestamp" : "01:07:28-01:07:31",
    "text" : "It really is. God Not bad.",
    "speaker" : "Andy"
  },
  {
    "text" : "Well, I can't wait to see him again this year. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:07:32-01:07:34"
  },
  {
    "timestamp" : "01:07:35-01:07:46",
    "speaker" : "Andy",
    "text" : "I think we'll yeah. That's very true because they'll they'll get better. We'll see what happens uh in Gillette. They were one in five. Yeah, and then they were five."
  },
  {
    "text" : "And then they would they would win every game except for the one against the Patriots. And so week 17 and uh oh it's to the Steelers who were fifty, yeah, 14-1 at that point. They were on a 16 or six-game win streak going to that game in week 17.",
    "timestamp" : "01:07:47-01:08:04",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "What where was it?",
    "timestamp" : "01:08:05-01:08:06"
  },
  {
    "text" : "In Pittsburgh or uh no, in Buffalo.",
    "timestamp" : "01:08:06-01:08:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that's even worse. Losing that game at home? Yeah.",
    "timestamp" : "01:08:10-01:08:13"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:08:15-01:08:20",
    "text" : "I can't wait. I can't wait. I'm gonna go down that rabbit hole."
  },
  {
    "timestamp" : "01:08:21-01:08:26",
    "speaker" : "Andy",
    "text" : "This is gonna be a great season, I can feel. This is one of I think this is the best season that I don't remember."
  },
  {
    "timestamp" : "01:08:26-01:08:26",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:08:26-01:09:19",
    "speaker" : "Andy",
    "text" : "I feel like I remember all the other two, but this one like because they just kept winning so much, it just kind of got like, oh yeah, this is just what happens now. You're fatigued. This is our life, yeah. Which uh it's probably like the it's probably similar to um Like a Cleveland Browns team going four and twelve, you know? Like, oh yeah, this is just our life now. This is what you we always lose. And so they all kind of blend together. And this one's blended over the years into the other seasons. But all right. Um boys have anything else for this? No? All right. Check out the new website. Yeah, that's all I got. We'll see you next week as the Patriots try to break the uh the record for most wins in a row. arguably the the hardest record in the NFL to break. So until then, we will see you later."
  },
  {
    "timestamp" : "01:09:19-01:09:20",
    "speaker" : "Steve",
    "text" : "See you later."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:09:21-01:09:27",
    "text" : "See you later. Well, I don't know how that walk up"
  }
]