[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17"
  },
  {
    "timestamp" : "00:22-00:37",
    "text" : "Alright, welcome back to the Patriots Dynasty podcast. I'm your host, Andy Brown. With me today is middle brother Steve Brown, he of who gets no respect. Have you gotten any respect lately, Steve?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I get more respect than the goddamn Jets do, but they don't deserve it.",
    "timestamp" : "00:37-00:42"
  },
  {
    "speaker" : "Andy",
    "text" : "This is true. They don't deserve it. Um We are for those who are new listeners, if there are any, we are the Brown brothers.",
    "timestamp" : "00:42-00:53"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "00:53-00:54",
    "text" : "Oh, which game should I start with?"
  },
  {
    "text" : "You never know. Maybe they just discovered us. Maybe Maybe someone, I don't know, found a tweet.",
    "timestamp" : "00:56-01:02",
    "speaker" : "Andy"
  },
  {
    "text" : "They were listening to that first fucking Bengals game, which was just a disaster.",
    "timestamp" : "01:02-01:06",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that was a rough one. We may have to redo that. But if you if you were smart enough and you started at this one, um Well, I don't know how smart that is either. I would go back and listen to the playoff ones because those are the games that matter. It was. It's a it's a typical AFC East battle. But what we do is we re-watch, we're re-watching every game of the Dynasty era. We started in 2001. And we're halfway through 2004 at this point. This is 2004 week seven. Patriots playing at home versus the Jets. This is their third home game in a row, I believe. Weirdly. Yeah, it's one of those like strange streaks where they had three home memes in a row. Um speaking of streaks. Speaking of streaks, absolutely. What is the win streak up to at this point, Steve?",
    "timestamp" : "01:06-01:56"
  },
  {
    "timestamp" : "01:56-01:57",
    "text" : "I don't know.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:57-02:19",
    "speaker" : "Andy",
    "text" : "21? Coming into this game, it is 20, so they will leave. Spoiler alert with 21 wins most ever. Um and it also breaks the regular season win streak at 18, I believe. Is how that works. Breaking the record of, do you remember the"
  },
  {
    "text" : "The team is something with the Bears.",
    "speaker" : "Steve",
    "timestamp" : "02:20-02:22"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:22-02:42",
    "text" : "Yes. As they know. The Bears from 1933 and 34 Which doesn't really count because they're playing against like mechanics and shit. So Yeah, that's not real football. But the re the NFL only recognizes the regular season one and not the one with the playoffs."
  },
  {
    "timestamp" : "02:42-02:45",
    "speaker" : "Steve",
    "text" : "I mean let's think it's in between World War I and World War Two."
  },
  {
    "text" : "This is true, yeah.",
    "speaker" : "Andy",
    "timestamp" : "02:45-02:46"
  },
  {
    "text" : "Like I don't even know if planes were a thing then.",
    "timestamp" : "02:47-02:49",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "They were close.",
    "timestamp" : "02:51-02:53"
  },
  {
    "text" : "Yeah, but they were like blimps were the way to go.",
    "timestamp" : "02:53-02:56",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:56-02:57",
    "speaker" : "Andy",
    "text" : "Yeah, yeah."
  },
  {
    "timestamp" : "02:57-02:59",
    "speaker" : "Steve",
    "text" : "The blimps were the new hotness."
  },
  {
    "text" : "Ships. Ships is how you got around. That's how you got to the new world.",
    "timestamp" : "02:59-03:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, how do you did you play at like different cities? Did you fucking train horse-strong carriage?",
    "timestamp" : "03:03-03:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Sure. We're gonna need two weeks. We gotta go to the west coast. They might have had buses. Well, they probably didn't also have that many teams back in the 30s. That was before the AFL and NFL merged. So it's probably only like six teams back then. So winning a bunch of games against the same team. It's like it's like playing like rec soccer. like the men's over thirty league and and going on a win streak there. You're playing the same like six teams anyway.",
    "timestamp" : "03:10-03:36"
  },
  {
    "text" : "That's true.",
    "timestamp" : "03:36-03:37",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:37-03:44",
    "text" : "So it's not not as impressive as doing it in the age of salary cap and All of this.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "03:44-03:52",
    "speaker" : "Steve",
    "text" : "Do you think this record will ever be broken because they lose next week and this is the last game they win, which I'm grateful for because it's against the Jets."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:53-04:13",
    "text" : "Correct. Uh yeah, I feel like we've we've talked about this before, and I think it was a split decision between you, me, and Greg. Who's not here this week? Um How could there be a split decision if there's three people? Well, we weren't unanimous, is what I'm saying."
  },
  {
    "text" : "So, when are we ever unanimous?",
    "speaker" : "Steve",
    "timestamp" : "04:13-04:15"
  },
  {
    "timestamp" : "04:16-04:27",
    "speaker" : "Andy",
    "text" : "Well, I think it was Uh I was hard against saying this will ever get broken. And I was saying it'll never be broken. Greg was this will definitely get broken and you were somewhere in the middle. So split decision."
  },
  {
    "speaker" : "Steve",
    "text" : "I think well I'm gonna switch firmly to Greg's side. You're outnumbered, outvoted. You think so?",
    "timestamp" : "04:28-04:33"
  },
  {
    "speaker" : "Andy",
    "text" : "I I just think because it's any given Sunday",
    "timestamp" : "04:35-04:39"
  },
  {
    "speaker" : "Steve",
    "text" : "That being able to win broken than like Tom Brady's Super Bowl championships and that those records that he's setting.",
    "timestamp" : "04:39-04:46"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:46-04:52",
    "text" : "There are definitely records that will not be broken, yeah. Um I think, you know, passing, well, even passing records."
  },
  {
    "timestamp" : "04:52-04:59",
    "speaker" : "Steve",
    "text" : "If you look up whatever, but like the winning of titles for one player, Umbre's kind of got that locked up."
  },
  {
    "timestamp" : "04:59-05:14",
    "text" : "Especially since he recently, I think it maybe even been today. Talking about how he thinks he can play till fifty. I believe it. Yeah, I would too. I mean Until he until he shows signs of slowing down, I'm just gonna trust whatever he says.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I have him on my fantasy team now. I I bet on because sports betting is legal in Virginia now.",
    "timestamp" : "05:14-05:19"
  },
  {
    "text" : "Oh yeah.",
    "timestamp" : "05:19-05:19",
    "speaker" : "Andy"
  },
  {
    "text" : "So I can put money on Tom Brady. I never did that. I should put on the Patriots because I'm already like emotionally invested. I don't need to be financial as well.",
    "timestamp" : "05:20-05:29",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "See, when I was doing like pick'ems and stuff, I would always pick against the Patriots every week. Um that way I either uh got the pick right or the Patriots won.",
    "timestamp" : "05:29-05:40"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I feel like I remember that being a strategy.",
    "timestamp" : "05:40-05:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, just just for self-preservation more than I didn't win many leagues.",
    "timestamp" : "05:43-05:48"
  },
  {
    "timestamp" : "05:48-05:58",
    "speaker" : "Steve",
    "text" : "I'm actually gonna have a 150 NFL shop gift card. Damn. From one of the betting apps that you just sign up and they give it to you pretty much."
  },
  {
    "timestamp" : "05:58-06:00",
    "speaker" : "Andy",
    "text" : "Okay. What are you gonna get with it?"
  },
  {
    "timestamp" : "06:00-06:02",
    "text" : "Yeah, I don't know. We gotta help me figure that out.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "06:02-06:28",
    "speaker" : "Andy",
    "text" : "So this was a question that I I actually had too before we get in this game. Um only because I was back at our parents' house this weekend, or this week, um, helping dad hang drywall on the ceiling, which good times. Um but I was in the basement and I stumbled across Greg's box of Patriots memorabilia. So I found, remember we talked ages ago about the Drew Bledsoe poster? Yes, he sent it. The 10 ways Drew Bledsoe will kick your butt."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:28-06:30",
    "text" : "So you have the original poster."
  },
  {
    "timestamp" : "06:30-06:32",
    "text" : "So I now have it. Yeah. It's an image on the internet.",
    "speaker" : "Andy"
  },
  {
    "text" : "I didn't know that was the OG poster.",
    "speaker" : "Steve",
    "timestamp" : "06:33-06:34"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:35-06:37",
    "text" : "Oh yes. That is the poster."
  },
  {
    "speaker" : "Steve",
    "text" : "From the shrine room.",
    "timestamp" : "06:37-06:38"
  },
  {
    "text" : "Yep. So I found that. So it got me thinking all day today. Um Do you have a favorite piece of and we'll probably have to ask Greg this next week when he's here.",
    "timestamp" : "06:38-06:50",
    "speaker" : "Andy"
  },
  {
    "text" : "I'll definitely have a favorite piece.",
    "timestamp" : "06:50-06:51",
    "speaker" : "Steve"
  },
  {
    "text" : "A favorite piece of Paige's memorabilia.",
    "speaker" : "Andy",
    "timestamp" : "06:51-06:54"
  },
  {
    "timestamp" : "06:56-07:01",
    "text" : "No, I have one of hockey memorabilia though.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, okay. I think I know which one this is.",
    "timestamp" : "07:01-07:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I won an essay writing contest in fourth grade and the prize was Meet Bobby Ore.",
    "timestamp" : "07:05-07:09"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:10-07:13",
    "text" : "I mean, that's good motivation right now, isn't it?"
  },
  {
    "text" : "I don't even remember what I wrote.",
    "timestamp" : "07:13-07:15",
    "speaker" : "Steve"
  },
  {
    "text" : "Doesn't matter.",
    "timestamp" : "07:15-07:16",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Doesn't didn't matter.",
    "timestamp" : "07:16-07:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Good enough to meet Bobby Or. Yeah, I don't know if I have one. I I think I had Oh, I had a um a signed Patriots hat that was signed by a bunch of players because they came and like some of the like you know all the the backups came and played basketball at the high school. Against like all the the athletes of the high school and they just mop the floor with them.",
    "timestamp" : "07:18-07:40"
  },
  {
    "text" : "Right, of course.",
    "speaker" : "Steve",
    "timestamp" : "07:40-07:41"
  },
  {
    "timestamp" : "07:41-07:51",
    "speaker" : "Andy",
    "text" : "But I won the raffle where I got to, you know, shoot from half court for like a thousand bucks. Uh which I obviously missed because I was like 10."
  },
  {
    "speaker" : "Steve",
    "text" : "And you're not even good at basketball now, and you probably weren't ever.",
    "timestamp" : "07:52-07:55"
  },
  {
    "timestamp" : "07:55-08:08",
    "speaker" : "Andy",
    "text" : "Right. Yeah, I still couldn't hit that. But I mean at least I would have made it competitive now. But that yeah, but that I got a hat signed by all of them. And I think um the most famous guy was Scott Sequels at the time, the backup cornerback, Did you Bledsoe."
  },
  {
    "text" : "Sweet.",
    "timestamp" : "08:08-08:09",
    "speaker" : "Steve"
  },
  {
    "text" : "So, but I lost that. the that hat and then I got a Patriot Shark tooth hat. You remember those? Those things are they're back. I got Greg one for Christmas a couple years ago. Yeah. And then that got stolen like the third day I wore to school. I was heartbroken.",
    "timestamp" : "08:09-08:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:24-08:32",
    "text" : "I still have Greg's starter jacket. I wear it all the time in the winter. From when he was a little kid. This thing is ridiculous."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:32-08:33",
    "text" : "Still fits you?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:34-08:41",
    "text" : "Yeah, it it's a maybe a touch short on the sleeves on me, but is it that like poofy one? Dude, I have right here."
  },
  {
    "timestamp" : "08:41-08:56",
    "text" : "Show me. You can see this. Because I used to have I used to have one like way back in the day, back in the Parcells era, like the pullover starter jacket. And I now have acquired something similar, but it has Drew Bledsoe on the back of it, which is pretty legit.",
    "speaker" : "Andy"
  },
  {
    "text" : "I'll send you a picture of a Red Sox game.",
    "timestamp" : "08:57-09:00",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "09:01-09:04",
    "speaker" : "Andy",
    "text" : "Yeah, send me the picture and we'll post it on Twitter. See if anybody else has any questions."
  },
  {
    "speaker" : "Steve",
    "text" : "And then ask for suggestions on what we should spend this gift card on.",
    "timestamp" : "09:05-09:08"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:09-09:12",
    "text" : "Alright, yeah, we'll do that. All right. I looked for Troy Brown jersey."
  },
  {
    "timestamp" : "09:12-09:13",
    "text" : "There was not one.",
    "speaker" : "Steve"
  },
  {
    "text" : "No, yeah. That's a shame. But they do have the the retro jerseys though don't they?",
    "timestamp" : "09:13-09:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "It has to be NFL shop, like NFL Yeah yeah yeah.",
    "timestamp" : "09:17-09:21"
  },
  {
    "timestamp" : "09:21-09:34",
    "text" : "But don't they but I thought the NFL shop had I know the Pages Pro Shop has like the the old like light blue with the stripes and the I thought they had like uh it was like a Brewski and someone else, maybe McGuinness?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "09:34-09:36",
    "text" : "There was a Brewski one I think I saw.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "09:36-09:38",
    "speaker" : "Andy",
    "text" : "Vinateri, something like that, yeah."
  },
  {
    "text" : "After Troy Brown I know, yeah. Or you can get like a cuss of one for 360 bucks.",
    "speaker" : "Steve",
    "timestamp" : "09:38-09:45"
  },
  {
    "speaker" : "Andy",
    "text" : "That's a lot of money. No, I'm not about that life. All right. Well we'll find we'll we'll ask our listeners if you have any any ideas you can text the Dynasty Hotline 603-505-8043 and tell Steve what to spend his money on. Or if you have any bets that you think he should pick. Um, you know, a Mac Jones prop bet perhaps. Uh text us. All right. Bet on Zach Wilson then. That's not the Patriots. How many interceptions will Zach Wilson throw?",
    "timestamp" : "09:47-10:21"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, over under Sam Darnold. I am about to fuck the Jets life. They'll ruin him just like they did Sam.",
    "timestamp" : "10:21-10:31"
  },
  {
    "text" : "I love it.",
    "timestamp" : "10:31-10:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "10:32-10:34",
    "text" : "So the quarterbacks before him."
  },
  {
    "text" : "So kind of like a mirror image of This current week's matchup where both the Patriots and the Jets are winless at 0-1. Um back in 2004, week seven This was actually the opposite. This was a battle of the unbeaten, both Pats and Jets at 5-0 coming into this. Two of the last three undefeated teams in the league. Did you catch who the third one was?",
    "speaker" : "Andy",
    "timestamp" : "10:34-10:58"
  },
  {
    "timestamp" : "10:58-10:59",
    "text" : "No, I did not.",
    "speaker" : "Steve"
  },
  {
    "text" : "I believe the Philadelphia Eagles had won today. Oh yeah. The actual opponent in the Super Bowl. Correct. So Some uh some high flying teams and also the other team that we will see in the next episode uh are on their bye week this week, the Pittsburgh Steelers with rookie Ben Rothelsberger. are sitting at four and one. So not bad either. Yeah, big bounce got out the gates. Yeah. Um They a bit more about this streak. They were talking about it had been 391 days since the Patriots had lost to the Redskins back in 2002. Um no, 2000 beginning of 2003.",
    "speaker" : "Andy",
    "timestamp" : "10:59-11:43"
  },
  {
    "text" : "Yes.",
    "speaker" : "Steve",
    "timestamp" : "11:44-11:44"
  },
  {
    "timestamp" : "11:44-12:22",
    "speaker" : "Andy",
    "text" : "Um the last time they lost at home was the end of 2002. That's why I got that confused. To Chad Pennington and the Jets. Yeah. Some more things that have changed. Like this was kind of peak Boston sports weekend. Because last episode we talked about how the Red Sox were down three games to nothing to the Yankees. Um things have changed since then in a week. And the Red Sox are now currently one game up. Um in the World Series after having completed their comeback four games to three."
  },
  {
    "timestamp" : "12:22-12:23",
    "speaker" : "Steve",
    "text" : "What a wild week."
  },
  {
    "timestamp" : "12:23-12:23",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "12:23-12:30",
    "speaker" : "Steve",
    "text" : "And they actually posted uh the Patriots set the record for the most wins in a row that weekend. It's nice. Yep."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:30-13:22",
    "text" : "Yeah, so they they showed a uh a stat thing before the game uh titled Good Times in Beantown this weekend in New England sports, the New England Patriots 20-game winning streak, defending Super Bowl champions. Boston Red Sox World Series versus the St. Louis Cardinals lead the series 1-0, game two tonight. And Boston College had just defeated Notre Dame the day before, 24-23 in a big upset. I think Notre Dame was ranked or something. So good day to be a sports fan in New England. Which is a little ridiculous. It's a good week. We're spoiled for sport uh professional sports in New England. Um well you wanna we haven't done this in a while. You want to give this game a watchability score?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. It wasn't a very watchable game. No, it was not. Two, maybe two and a half Lombardies. Maybe, yeah, that's two and a half.",
    "timestamp" : "13:22-13:32"
  },
  {
    "timestamp" : "13:32-13:47",
    "text" : "Solid out of six. Yeah, I think two is probably as high as I would go. Two Lombardi does. He does, yeah. He he does ball out. He finished with over 100 receiving yards, I believe.",
    "speaker" : "Andy"
  },
  {
    "text" : "He had 107, five catches, all for first downs.",
    "timestamp" : "13:47-13:51",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "It's not too shabby.",
    "timestamp" : "13:51-13:52"
  },
  {
    "speaker" : "Steve",
    "text" : "And they were talking about how every single catch he's had this year has been for first down.",
    "timestamp" : "13:52-13:56"
  },
  {
    "text" : "Yeah, and it was, I think, uh by the end of the game, it was because he did it in this game too. Every catch was a first down. So he ended I think he's at like twenty-two or twenty-three on the season. Something like that.",
    "speaker" : "Andy",
    "timestamp" : "13:56-14:07"
  },
  {
    "text" : "They said that at the beginning. He's at twenty this year.",
    "speaker" : "Steve",
    "timestamp" : "14:08-14:11"
  },
  {
    "timestamp" : "14:11-14:11",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "Then he got five more in this game.",
    "speaker" : "Steve",
    "timestamp" : "14:11-14:13"
  },
  {
    "timestamp" : "14:13-14:33",
    "speaker" : "Andy",
    "text" : "Oh, I swear. So, and I actually tried to look it up, but it's ungoogleable, I guess. I don't know. Um, but I'm wondering how many the longest streak is of catches that go for first down. That could be a record that you're not going to break either, right?"
  },
  {
    "speaker" : "Steve",
    "text" : "Need a tucker or something.",
    "timestamp" : "14:33-14:34"
  },
  {
    "text" : "Oh, that's a good idea.",
    "timestamp" : "14:35-14:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "14:37-14:37"
  },
  {
    "text" : "Oh, I like that. Full of good ideas today, Steve.",
    "speaker" : "Andy",
    "timestamp" : "14:38-14:40"
  },
  {
    "text" : "Got them all. It's all that barbecue dude. Just, you know, the meaty goodness.",
    "speaker" : "Steve",
    "timestamp" : "14:41-14:46"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:46-14:49",
    "text" : "There's nothing better than just like a slab of meat that you can eat."
  },
  {
    "timestamp" : "14:50-14:51",
    "text" : "Just as much as you want, yep.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "14:51-14:57",
    "speaker" : "Andy",
    "text" : "Yeah, just house and house and uh yeah. Dead animal."
  },
  {
    "timestamp" : "14:58-15:00",
    "speaker" : "Steve",
    "text" : "Gibbons is what I hope McKeel will be."
  },
  {
    "timestamp" : "15:01-15:22",
    "text" : "Yeah. He's just When he catches the ball, he his fight for the extra yards reminds me of like a big Edelman. It's that same like I'm gonna get this extra yard every time. I'm gonna carry two die two guys to do it. Yeah. Yep. But he's also a physical specimen too in David Gibbons. It's a big dude.",
    "speaker" : "Andy"
  },
  {
    "text" : "I loved him.",
    "timestamp" : "15:25-15:26",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh yeah. Yeah. He was your favorite guy for a while, wasn't he?",
    "timestamp" : "15:26-15:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yeah, by far. Yeah, that's the best time of year when I was watching this and that's a little kid.",
    "timestamp" : "15:30-15:34"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh god, yeah. Yeah, because how old would you have been in 2004?",
    "timestamp" : "15:34-15:39"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "15:40-15:41",
    "text" : "Don't make me do math."
  },
  {
    "text" : "I think I was 21.",
    "speaker" : "Andy",
    "timestamp" : "15:41-15:43"
  },
  {
    "timestamp" : "15:43-15:46",
    "speaker" : "Steve",
    "text" : "And we're like six years apart. There you go."
  },
  {
    "timestamp" : "15:47-15:53",
    "speaker" : "Andy",
    "text" : "So yeah, mid-teenager. Perfect time. Of course."
  },
  {
    "text" : "But that was really the only like watchable part of this game.",
    "speaker" : "Steve",
    "timestamp" : "15:55-15:58"
  },
  {
    "timestamp" : "15:58-16:56",
    "speaker" : "Andy",
    "text" : "Yeah. Uh I mean you could watch the first half because it takes about uh thirty minutes. Yeah, super because the clock didn't stop. There was They actually showed a stat right before the Patriots got the ball and were like running no huddle uh inside two minutes left in the half. Um Where is it? Uh both teams uh had had two drives each in the first half, and they were averaging seven minutes per drive. And the score b before that was uh seven six jets. Um But uh then at the end of the half, Patriots in no huddle just go straight down the field and score uh a touchdown, Barry DePatton, five seconds left in the half. And that was all this. There was. There wasn't any more."
  },
  {
    "text" : "I mean the second half just it was a slog. Yeah, lots of three and outs. People fucking not running the ball anywhere. Either running back was having a great game.",
    "timestamp" : "16:56-17:07",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "17:07-17:56",
    "speaker" : "Andy",
    "text" : "Yeah, the only drive that had any promise was um The one long one at the end of the third quarter where um the Pats started at their own nine and then Dillon had that huge run to end the quarter. And then Brady hit Patton to the 20, but then Patton got up and just like tossed the ball to the guy who's covering him. And they called taunting on him, so it brought the play all the way back. And I think it was like the next play. They tried to run a screen, and here's something we should talk about. They tried to run a screenplay to the fullback. Only the fullback wasn't Patrick Pass like it normally is because he was hurt. So the backup fullback, who was a C Brown? Dan Klecco. He's Dan Klecco, your nose tackle, number 90. He actually that the first play from scrimmage was a throw to Clecko out of the backfield."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "17:56-17:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Like they just love throwing to him. And then this was his second Well, it's the second reception of the game. They ran a screen, a screen, a full back screen to Dan Clecko, who got hit hard, fumbled the ball, and left the game and didn't come back.",
    "timestamp" : "17:56-18:12"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "18:13-18:18",
    "text" : "Yeah. He was big in this like featured, I guess, there's a lot of things."
  },
  {
    "timestamp" : "18:18-18:18",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "And he can move for a big man, but he just didn't have like He's not used to carrying the ball, I think.",
    "speaker" : "Steve",
    "timestamp" : "18:21-18:25"
  },
  {
    "text" : "No, yeah, well there was also one play. Yeah, yeah, there was one play, the the deep shot to um to Gibbons. I don't remember what it was. Um tie on the sideline. Like he was lined up in the backfield as a fullback and then he motioned out to like be a tight end. But then he obviously didn't know what to do on the play. So he just kind of like stood around like looking for somebody to block. Like first he turned around and looked at Brady's like, oh shit, it's a it's a passing play. And then just kind of like ran around trying to find somebody to block and there wasn't anybody. It's hysterical.",
    "speaker" : "Andy",
    "timestamp" : "18:26-18:56"
  },
  {
    "text" : "Alright, I missed that. You gotta put that on the site.",
    "timestamp" : "18:57-18:58",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "18:59-20:06",
    "text" : "Yeah, I I I think it's the the big the deep pass play. So if you find the deep pass play to to Gibbons, you'll you'll keep an eye on the fullback on that play. Because it was Dan Cleco's before he got hurt. Um But yeah, it was uh it was rough, but you're now down to a third fullback, and at the end of the game The Patriots are milking a 13-7 lead still with two minutes left in the game. The defense has just held us, held uh the Jets to a stop on fourth down. Uh in your own territory. Yeah, and they need a first down to be able to just kneel because the uh jets are out of timeouts. And so it's third and one, I think it was. And so they're they're in run heavy. And so now the third string fullback is who was it, Steve? I didn't know. Richard Seymour. Yeah. Yeah. So they they run like a like a Seymour in there. They run an off-tackle with Seymour as the lead blocker, and they pick up the first down. By a couple yards with Seymour laying the the critical block to spring Corey Dillon to get the first down.",
    "speaker" : "Andy"
  },
  {
    "text" : "Corey Dillon would have been denied even if he had missed his block.",
    "speaker" : "Steve",
    "timestamp" : "20:07-20:10"
  },
  {
    "text" : "It's probably true. Uh Dylan struggled, I think.",
    "speaker" : "Andy",
    "timestamp" : "20:09-20:12"
  },
  {
    "speaker" : "Steve",
    "text" : "He got better the game went on, though. That was one of those games.",
    "timestamp" : "20:12-20:15"
  },
  {
    "timestamp" : "20:15-20:27",
    "text" : "Well he did, yeah. He ran for over a hundred yards in this game, but they showed the stats at the half. And he had uh 11 carries, 23 yards. Rough first half.",
    "speaker" : "Andy"
  },
  {
    "text" : "Those big backs though, you know, as the game goes on.",
    "speaker" : "Steve",
    "timestamp" : "20:27-20:29"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:30-20:32",
    "text" : "Oh yeah, they Page was definitely warm."
  },
  {
    "text" : "It was one of those type of games though. Then those can be a slog to watch.",
    "timestamp" : "20:32-20:35",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:35-20:36",
    "text" : "Yeah."
  },
  {
    "text" : "It was it was close though, score-wise, right? Jets had a chance. They had the ball inside the 20-ish, right around there, fourth and ten. And Chadwick just forced it to win Corbett and double coverage like an idiot.",
    "speaker" : "Steve",
    "timestamp" : "20:37-20:52"
  },
  {
    "timestamp" : "20:52-21:21",
    "text" : "Yeah. Yeah. Well that was the thing. The the Patriots, I mean, the commentators, who were they? Um, Jim Nance and Phil Sims. And they were mediocre. I didn't really listen to them. Um no complaints specifically. But they actually they actually called out the fact that the Patriots on these critical third and fourth downs were double covering Wayne Corbet on all those like important plays because they knew that's where Pennington was going to go. And it worked.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:21-21:23",
    "text" : "Yeah, Wayne Krebett was sweet.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:23-21:25",
    "text" : "I think uh yeah, I think he had one catch in this game."
  },
  {
    "timestamp" : "21:25-21:26",
    "speaker" : "Steve",
    "text" : "Yeah, they doubled the shit out of him."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:26-21:32",
    "text" : "Yeah, and they'll like to the point where they were leaving other guys open and Pennington just like You couldn't get off Crobat."
  },
  {
    "speaker" : "Steve",
    "text" : "Well, you didn't see any of Rodney Harris in this game because he's doubling Quebec and they're not throwing a Crobat, so Right, because of that.",
    "timestamp" : "21:32-21:39"
  },
  {
    "text" : "Just another one of those Bill Belichick. uh underestimated genius things that you just take for granted after 20 years, you know?",
    "timestamp" : "21:41-21:51",
    "speaker" : "Andy"
  },
  {
    "text" : "I agree.",
    "timestamp" : "21:51-21:51",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "21:52-22:04",
    "speaker" : "Andy",
    "text" : "Like of course he does that. But it's like, yeah, but Yeah, he's he's going to sell out to take away the one thing that makes you comfortable. And if you beat him with something else, congrats. Yep. But most of the time you don't."
  },
  {
    "timestamp" : "22:05-22:10",
    "speaker" : "Steve",
    "text" : "like one hand tied behind your back sort of thing. He just figures out whatever you do the best and tries to take that away."
  },
  {
    "text" : "Yep. So that and the the next man up philosophy too you saw in this with the fullbacks, you know? You've got two defensive guys playing fullback. And contributing. Like they're not just in there as filler. They're actually like a part of the game.",
    "timestamp" : "22:10-22:23",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:23-22:25",
    "text" : "Yeah. I love a good fullback.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "22:25-22:25",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "And I'm seeing more of that in football.",
    "timestamp" : "22:25-22:27",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. And I'm pretty sure this is the game, the season where You'll have Troy Brown playing defensive back too.",
    "timestamp" : "22:27-22:33",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:33-22:34",
    "speaker" : "Steve",
    "text" : "Yeah, you're right."
  },
  {
    "timestamp" : "22:34-22:44",
    "speaker" : "Andy",
    "text" : "So they just like this is being able to save those roster spots by having guys play both sides of the ball. Love it. That's awesome."
  },
  {
    "speaker" : "Steve",
    "text" : "I'm excited to watch that actually. Troy Brown is DB. He gets too.",
    "timestamp" : "22:44-22:48"
  },
  {
    "text" : "Yeah. Yeah. I think he ends the season second on the team in the interceptions. man. Yeah, it's like two or three. So it's like not even just yeah yeah it's like one lucky one.",
    "timestamp" : "22:48-22:57",
    "speaker" : "Andy"
  },
  {
    "text" : "That chargers game is this here too.",
    "timestamp" : "22:57-22:59",
    "speaker" : "Steve"
  },
  {
    "text" : "Which chargers",
    "timestamp" : "23:01-23:01",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "The one where you strips Marlon McCree?",
    "timestamp" : "23:02-23:03"
  },
  {
    "speaker" : "Andy",
    "text" : "No, no, that's not for I think 2006, I want to say.",
    "timestamp" : "23:04-23:08"
  },
  {
    "text" : "Oh.",
    "timestamp" : "23:08-23:08",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That's right be that's yeah, that's right before uh Two thousand the two thousand seven when they go in a tear because that's still with the uh Roche Caldwell and everybody. Um",
    "timestamp" : "23:09-23:21"
  },
  {
    "speaker" : "Steve",
    "text" : "All right, you want to do uh best and worse?",
    "timestamp" : "23:25-23:27"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:28-23:35",
    "text" : "All right, yeah. Uh well uh did you want to talk about Curtis Martin first? Because he's he's your boy again, right?"
  },
  {
    "speaker" : "Steve",
    "text" : "No, I don't really I don't need to go all the way. We've I we see so many Jets games.",
    "timestamp" : "23:35-23:40"
  },
  {
    "text" : "Yeah, but this is the game where he broke a bunch of records. He leads the league in rushing. Yeah. He went he's gone over a hundred yards in four of the first five games of the season. Doesn't do it this game.",
    "speaker" : "Andy",
    "timestamp" : "23:41-23:53"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "23:54-23:54"
  },
  {
    "text" : "But he moves to fourth all-time in rush attempts in this game. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "23:55-24:00"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "24:00-24:10",
    "text" : "Which is where he would actually. Those records aren't nearly as impressive to me because they're going to be broken and they and they have been, right? Where the 21-0 win streak is much more impressive."
  },
  {
    "timestamp" : "24:10-25:02",
    "speaker" : "Andy",
    "text" : "I think you're less likely to see those. I don't think you'll see those running rec rushing records broke anytime soon. Because the the NFL is so pass first now. You're not going to see a back run of the record. Uh he's actually still I looked it up because I knew you'd say that. He is well I th I figured Greg would say that. He's fourth in attempts all time still. I think he moved up to third, but then somebody passed him. I can't remember who it was. It might have been Frank Gore recently. He is sixth in rushing yards, total rushing yards, and 13th in rushing touchdowns. It's pretty legit. Never legit never didn't have a thousand yard season. Always had a thousand at least a thousand yards rushing. for the however many years he played. It was fucking ridiculous. Plug and play. Yep. Yep."
  },
  {
    "timestamp" : "25:02-25:08",
    "speaker" : "Steve",
    "text" : "And they they were talking about him in this in this game where he that sucked the entire time he was there too."
  },
  {
    "text" : "They did. Yeah.",
    "timestamp" : "25:08-25:09",
    "speaker" : "Andy"
  },
  {
    "text" : "He like I don't even think he went to the playoffs. Maybe he did a couple of times, but I don't know. They went three when then when Pennington was lit. And then they put him out there in the fourth preseason game and fucked up his hand.",
    "timestamp" : "25:09-25:21",
    "speaker" : "Steve"
  },
  {
    "text" : "Yep.",
    "timestamp" : "25:21-25:21",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:22-25:25",
    "text" : "Yeah. This is him back from that surgery now.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "25:25-26:14",
    "speaker" : "Andy",
    "text" : "Oops. Actually I wonder if the oh no the Jets went to the playoffs this season. Cause they would finish ten and six. So they were the the other team from the AFC East that would go to the playoffs. And they beat the Chargers. They upset the Chargers in the wildcard, 20 to 17 in overtime, and then lost to the Chiefs. Uh not the Chiefs, the Steelers. In overtime, 17 and 20, uh, which was f one of two of the four overtime games that they would play this season. And what happens to the Steelers? Uh, I think we'll probably find out. I don't remember off the top of my head, but I bet we'll find out. We'll find out. Yeah, yeah, yeah. Uh all right, yeah, so uh give me your best and worst then."
  },
  {
    "timestamp" : "26:15-26:22",
    "speaker" : "Steve",
    "text" : "All right. I'm I have a couple of bests."
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "26:22-26:22"
  },
  {
    "timestamp" : "26:23-26:32",
    "speaker" : "Steve",
    "text" : "One being Tom Brady screaming for a timeout right in the ref's face. Yeah, because the ref wasn't giving it to him quick enough. Yeah."
  },
  {
    "text" : "He was like screaming at him.",
    "timestamp" : "26:32-26:34",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Screaming.",
    "timestamp" : "26:34-26:35"
  },
  {
    "text" : "The ref didn't give a shit though, did he? He's like, yeah, whatever, I'll get to it",
    "timestamp" : "26:35-26:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:39-26:42",
    "text" : "All of mine are referee themed for you, Andy.",
    "speaker" : "Steve"
  },
  {
    "text" : "Love it.",
    "timestamp" : "26:43-26:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "26:44-26:44",
    "text" : "Okay."
  },
  {
    "text" : "Okay.",
    "timestamp" : "26:45-26:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:46-26:57",
    "speaker" : "Steve",
    "text" : "My Worst before my best best. All right. Is there's just a blatant hold on the touchdown for the Jets like an end around run."
  },
  {
    "text" : "Oh yeah, yeah.",
    "speaker" : "Andy",
    "timestamp" : "26:58-26:58"
  },
  {
    "timestamp" : "26:58-27:11",
    "speaker" : "Steve",
    "text" : "And is like just blatant feels like, oh what a good block. And then because they're showing it over and over as a touchdown. And like it's just so clear. And like they have chances to be like, ooh, actually I don't know."
  },
  {
    "text" : "And they're just like, what a great that was uh that was Chad Pennington running it in.",
    "timestamp" : "27:11-27:16",
    "speaker" : "Andy"
  },
  {
    "text" : "Yes, yes.",
    "timestamp" : "27:16-27:17",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Who they they said um that was his fifth career rushing touchdown, of which three had come against the Patriots.",
    "timestamp" : "27:18-27:25"
  },
  {
    "speaker" : "Steve",
    "text" : "Which is James Chadon III.",
    "timestamp" : "27:25-27:28"
  },
  {
    "text" : "Correct. Yes. Not a real Chad.",
    "speaker" : "Andy",
    "timestamp" : "27:29-27:32"
  },
  {
    "text" : "You're right, Andy. And then the best call the referees made all night was the 12 men on the field penalty for the Jets when the Patriots are punting. Oh my god.",
    "timestamp" : "27:32-27:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That was so bad. Yeah.",
    "timestamp" : "27:47-27:50"
  },
  {
    "timestamp" : "27:50-27:58",
    "speaker" : "Steve",
    "text" : "It's fourth and four, and they're putting small guys on the field and the putting on a punt. Yeah. It was early too. It was like first quarter."
  },
  {
    "speaker" : "Andy",
    "text" : "It was the like the second play of the second quarter. And we definitely scored on that drive too. Uh yeah, because the next play I think was the deep shot to Gibbons that we talked about. Oh, is this the one where Yeah. And then Brady got sacked on third and goal in the kick to field goal. Yeah, that's the one where Cleco didn't know what he was doing. But yeah, that was so Jetsy and Yeah, yeah, just uh Harm Edwards was not pleased",
    "timestamp" : "27:59-28:28"
  },
  {
    "timestamp" : "28:28-28:33",
    "text" : "Those moments of the that I watch these games are I'm just like, you fucking idiots.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "28:34-28:42",
    "speaker" : "Andy",
    "text" : "Of course you do that, you stupid jets. You'd never see that. Like Of all the penalties on a punt, that's the one you never see. The 12 men on the field."
  },
  {
    "speaker" : "Steve",
    "text" : "Even if you see it, you know, do it when you have 10 yards to go. So it doesn't actually matter. And even better, definitely don't do it if there's less than five yards.",
    "timestamp" : "28:42-28:50"
  },
  {
    "timestamp" : "28:51-28:55",
    "speaker" : "Andy",
    "text" : "Correct. But even better was the punt return wasn't that good, even with the extra blocker."
  },
  {
    "text" : "No.",
    "speaker" : "Steve",
    "timestamp" : "28:55-28:55"
  },
  {
    "timestamp" : "28:55-29:55",
    "speaker" : "Andy",
    "text" : "It was only like four or five yards. Fantastic. All right. So those are your best and worst then, huh? Yep. All right. Um here's a best. Uh the who's your daddy chant at the end of the the game by the the fans. Oh I I didn't hear that. That was pretty good, yeah. uh you could hear it you can hear it in the background like right in the fourth quarter because like there's nothing going on. Like you said that's an excellent time to be a sports fan there. Yep and there was a bunch of uh bunch of fans holding signs that were red sox related we still believe I remember that. That was my favorite. Yep. Um another good one is uh they were talking about how do the patients feel about the wind streak. Which I think we all know the answer to that. Um they asked Teddy Bruski, I don't care, I just want to beat the Jets divisional game. But they were talking about how they see it as 21-game win streaks"
  },
  {
    "speaker" : "Steve",
    "text" : "Yes.",
    "timestamp" : "29:55-29:55"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:55-30:10",
    "text" : "That's so patriot, so Belichekian. Silly. Um is that your best or your worst, and how do you which category are you putting that in? Um Ah, I'm gonna put in the best, more so to annoy Greg uh if he listens to it."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "30:11-30:12",
    "text" : "Yeah, you debated that one though."
  },
  {
    "text" : "Yeah, yeah, yeah, yeah. Uh it's it's a silly thing, but it works So you gotta get that's like it's like Rodney Harrison at this point, be like, oh nobody believes in us, even though they've won two out of the last three Super Bowls, yeah. It's like yeah, I I don't know if you believe that, but if it gets you to the next Super Bowl, I'm all for it. Right. Um And my worst is going to be Chad Pennington having all of his uh rushing touchdowns against the Pats. We already discovered that. So I'm going to give you another best. Just for you, Steve.",
    "timestamp" : "30:12-30:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh.",
    "timestamp" : "30:42-30:42"
  },
  {
    "timestamp" : "30:42-30:59",
    "speaker" : "Andy",
    "text" : "Well, actually no, here's a good worst. Uh the Jets. It's a Jets-related worst. Um, this was the one chance that the Jets had to start six and oh in franchise history because it had never happened before. They have never started the season winning six games in a row."
  },
  {
    "timestamp" : "30:59-31:00",
    "text" : "They still haven't.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "31:00-31:02",
    "speaker" : "Andy",
    "text" : "Right. Correct."
  },
  {
    "speaker" : "Steve",
    "text" : "Nice.",
    "timestamp" : "31:02-31:03"
  },
  {
    "text" : "So that was fun. And they're not gonna do it this year either. I don't nope, they are not. Lost. So yeah. So I'll give you one more one more best. And it was just Watching Ty Law come in and make a tackle on a tight end who's like catching the ball in the flat is just He breaks down real well. It's just it, yeah, because the guys are always bigger than him and he comes in like a friggin' missile and just absolutely obliterates the guy. Doesn't matter how big they doesn't matter. I mean, because I think he did it last time we saw them play the Jets. We did the Curtis Martin who caught a ball of the flat and he just like crushes the guy every time.",
    "timestamp" : "31:03-31:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:44-31:44",
    "speaker" : "Steve",
    "text" : "Yep."
  },
  {
    "timestamp" : "31:44-31:49",
    "speaker" : "Andy",
    "text" : "And you always think of Ty Law as this like ball hawking interception guy, you know?"
  },
  {
    "timestamp" : "31:50-31:54",
    "text" : "Well he could that both he could he could run force and he could have awesome ball skills.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah he he could lay the lumber when he needed to do a pretty good job with it too. Yeah, but it's not it's not the same level as Tyler, I don't think.",
    "timestamp" : "31:54-32:03"
  },
  {
    "timestamp" : "32:03-32:05",
    "speaker" : "Steve",
    "text" : "Oh. Tyler's and beasts."
  },
  {
    "timestamp" : "32:05-32:12",
    "text" : "Yep. So Yeah, I think that was uh that pretty much covers this game.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "32:12-32:13",
    "speaker" : "Steve",
    "text" : "I have a history note for you."
  },
  {
    "text" : "Ooh, okay.",
    "timestamp" : "32:14-32:14",
    "speaker" : "Andy"
  },
  {
    "text" : "Actually, all right, a trivia question. Who was the coach of that Bears team? that previously held the regular season win straight from Dick Buckis. Oh no. No. George Hallis.",
    "speaker" : "Steve",
    "timestamp" : "32:14-32:27"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, okay. Yeah, I sure got that.",
    "timestamp" : "32:28-32:29"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "32:29-32:35",
    "text" : "Then they told that story about Belichick meeting him in the locker room with a little kid."
  },
  {
    "timestamp" : "32:35-32:35",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "32:35-32:42",
    "text" : "and congratulating him on his win and he gave him a signed dollar bill to the little Bill Belichick as well."
  },
  {
    "timestamp" : "32:42-32:51",
    "speaker" : "Andy",
    "text" : "Because because that's what he would do to the first person who congratulated him on a win, he would give that person a signed dollar bill. Which is fucking baller."
  },
  {
    "speaker" : "Steve",
    "text" : "Let us see.",
    "timestamp" : "32:51-32:52"
  },
  {
    "timestamp" : "32:53-33:17",
    "text" : "I'm gonna start doing that. I'm gonna start carrying dollar bills around. And the first time somebody congratulates me on something. Or sometimes the first time somebody's like, oh, this is your podcast. The first person I I ever see who's like, oh, congrats on your podcast. I listened to it. I love that thing. I'm gonna give him the sign dollar bill. Okay. So I don't expect to be sp spending much money on that. Okay.",
    "speaker" : "Andy"
  },
  {
    "text" : "Okay. Yeah. We'll see in a couple of months.",
    "timestamp" : "33:18-33:20",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, well, you know. Turn in next week to see how much of a blubbering little bitch Greg is on the Patriots Dynasty Podcast.",
    "timestamp" : "33:20-33:29"
  },
  {
    "timestamp" : "33:33-33:34",
    "text" : "Gotta get it out at least once.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:34-34:06",
    "text" : "Got her. Yeah. So yeah, so uh hopefully Greg joins us next week. If not, we might have a guest. Um But yeah, so we will ask if you if you know what Steve should spend his 150 bucks on, you can text us or hit us up on Twitter. Or if you know who holds the longest streak of receptions for first downs consecutively. Actually, I don't even know how to word it to be able to Google that, you know what I mean?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "34:06-34:12",
    "text" : "Yeah, yeah. So it's a tough start to also first downs in a row."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, consecutive first down receptions, I get I guess.",
    "timestamp" : "34:12-34:15"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "34:16-34:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but it's but it's more than that. It's like, yeah. No, it is that consecutive receptions that are first go for are first downs. Yeah. Yeah, that's tough.",
    "timestamp" : "34:17-34:26"
  },
  {
    "text" : "But yeah, so if you if you have You're the biggest chain mover, dude.",
    "speaker" : "Steve",
    "timestamp" : "34:26-34:30"
  },
  {
    "text" : "If you have any information on either of those things, you can text the Dynasty Hotline again. 603-505-8043. Get at us and we will. I don't know, we'll respond. That's what we do We love talking this shit, don't we, Steve?",
    "timestamp" : "34:31-34:50",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:50-34:51",
    "speaker" : "Steve",
    "text" : "You do."
  },
  {
    "text" : "I love it.",
    "speaker" : "Andy",
    "timestamp" : "34:51-34:52"
  },
  {
    "text" : "You do.",
    "speaker" : "Steve",
    "timestamp" : "34:52-34:53"
  },
  {
    "timestamp" : "34:53-34:54",
    "speaker" : "Andy",
    "text" : "You love it too."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. You do all the effort. I'm just a talent.",
    "timestamp" : "34:54-34:58"
  },
  {
    "timestamp" : "35:01-35:10",
    "speaker" : "Andy",
    "text" : "Whatever helps you sleep a night, Steve. The down, Jesus Christ. You're the humble one too, apparently. Oh no, you know what you are?"
  },
  {
    "timestamp" : "35:11-35:12",
    "text" : "Sometimes a naughty boy.",
    "speaker" : "Mom"
  },
  {
    "text" : "We all are ready. Come on. This is true. All right. Until next week. Uh what is next week, Steve?",
    "speaker" : "Andy",
    "timestamp" : "35:14-35:22"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:23-35:24",
    "text" : "Uh Steelers game."
  },
  {
    "timestamp" : "35:24-35:49",
    "speaker" : "Andy",
    "text" : "It's the end of the streak, isn't it? Yep. Spoiler alert. Uh yeah. So I'm not gonna say I'm looking forward to it, but we'll get through it. We'll get through it together, Steve. It's the first loss they've had in like I know, so I've forgotten how to deal with these. I've forgotten how to watch a game where they lose. It's fine. You'll make it. We'll see. I might just not watch it. I'll make you watch it instead. I'll make Greg watch. He hasn't watched a game in a while."
  },
  {
    "timestamp" : "35:49-35:49",
    "speaker" : "Steve",
    "text" : "Greg will watch it."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:51-36:01",
    "text" : "Sure he will. Yes, I start sometime. All right. We will see you next week on the Patriots Dynasty podcast."
  }
]