[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Welcome back to the Patriots Dynasty Podcast. One of the only podcasts dedicated to re-watching every game. of the Pagers Dynasty Era. I'm your host, Any Brown. With me tonight, as always, are my trusty brothers. Not trustworthy, but trusty.",
    "timestamp" : "00:22-00:39"
  },
  {
    "timestamp" : "00:40-00:47",
    "speaker" : "Steve",
    "text" : "Especially that Greg Brown. What's the difference? How did you say as always, as if like Greg is here all the time?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:47-00:49",
    "text" : "I mean has been lately."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "00:49-00:50"
  },
  {
    "text" : "This season, I don't think either of you have missed a game, right? I'm not gonna fact check that. I didn't because we don't do that anymore either.",
    "timestamp" : "00:50-00:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "00:56-01:00",
    "speaker" : "Steve",
    "text" : "I didn't watch last week for the first time in forever. I did watch this one though. Most of it."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but you've you've both been here for all of these, at least.",
    "timestamp" : "01:02-01:05"
  },
  {
    "speaker" : "Steve",
    "text" : "Guess I have a PTSD for when Greg would only show up once every five times. That was years ago.",
    "timestamp" : "01:06-01:12"
  },
  {
    "speaker" : "Greg",
    "text" : "This whole lenient scheduling has been uh it's been a godsend.",
    "timestamp" : "01:12-01:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it has. Because we've only we're only showing up now when all of us can actually do it.",
    "timestamp" : "01:16-01:20"
  },
  {
    "speaker" : "Greg",
    "text" : "That's a good point. Thank God for that baby.",
    "timestamp" : "01:21-01:24"
  },
  {
    "text" : "Kid's really saving my ass. Uh-huh. Yeah, he's put he's putting a crimp on my style, but I didn't have much style to begin with, so it's all good.",
    "timestamp" : "01:26-01:34",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:35-01:42",
    "text" : "Speaking of babies, huh, Steve? What? Andy's being a baby. Please complain about me."
  },
  {
    "speaker" : "Andy",
    "text" : "Nice stressful. Got it. Speaking of babies, this week we are talking about uh the Cleveland Browns. And their front office being big old babies, firing their head coach midway through the season. Uh Butch something or other. What the fuck was his name?",
    "timestamp" : "01:43-02:01"
  },
  {
    "timestamp" : "02:01-02:02",
    "speaker" : "Steve",
    "text" : "Cassidy."
  },
  {
    "speaker" : "Andy",
    "text" : "That's that that's that's what I thought though I didn't say it. Yeah, butch Davis got fired uh midweek this week before uh the game So Terry Rabisky is in his um he's getting his second shot at being an interim head coach, which You don't often hear people getting more than one shot at that.",
    "timestamp" : "02:02-02:23"
  },
  {
    "timestamp" : "02:23-02:31",
    "speaker" : "Steve",
    "text" : "Never heard of it. Carrie Roker guys passed on by the commentators. This will be a winning team in fairly short order."
  },
  {
    "text" : "I I wrote the exact same thing. Yeah, this will be a winning team in fairly short order. They're gonna do this right. They're gonna do this the right way. And this is 2004. So uh it'll happen soon, I'm sure.",
    "timestamp" : "02:33-02:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:47-02:49",
    "text" : "Well, what are their records like"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:50-02:53",
    "text" : "Uh coming into this game, they are three and eight."
  },
  {
    "text" : "Oh, I meant out seasons here.",
    "speaker" : "Steve",
    "timestamp" : "02:53-02:56"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:56-03:01",
    "text" : "The season they will finish four and twelve on this season. In 2004."
  },
  {
    "text" : "Six and ten, four and twelve. Ten and six.",
    "timestamp" : "03:01-03:05",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:05-03:06",
    "speaker" : "Greg",
    "text" : "Ooh."
  },
  {
    "text" : "Four and twelve, five and eleven, five and eleven, four and twelve, five and eleven, four and tw Seven nine Three and thirteen, one and fifteen, oh and sixteen. So short order. Getting there.",
    "speaker" : "Steve",
    "timestamp" : "03:06-03:18"
  },
  {
    "speaker" : "Andy",
    "text" : "So well the Browns just won a playoff game, right? This last year? It's all a blur.",
    "timestamp" : "03:18-03:26"
  },
  {
    "text" : "I thought they lost the playoff game.",
    "timestamp" : "03:26-03:28",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I thought they won one to the to Pittsburgh, right?",
    "timestamp" : "03:28-03:32"
  },
  {
    "text" : "With Kelly Holcomb.",
    "timestamp" : "03:32-03:34",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:34-03:39",
    "text" : "No, I mean like the this past year they they won a playoff game. No."
  },
  {
    "speaker" : "Steve",
    "text" : "2020 they uh lost in the divisional round.",
    "timestamp" : "03:39-03:41"
  },
  {
    "text" : "So Yeah, so so they won their wild card game, I think, against somebody. Um and that was their first win since um Bill Belchak was their head coach back in the past.",
    "timestamp" : "03:41-03:54",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "In fact, this is Terry's only shot at it. He gets replaced next year by who?",
    "timestamp" : "03:54-03:59"
  },
  {
    "speaker" : "Greg",
    "text" : "Well he's the Patriots coach in this game.",
    "timestamp" : "04:04-04:07"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, um uh Romeo Cornell? Yeah. Yeah. And he doesn't last for long either. Yeah after the same season I thought, yeah. Um but they actually showed the stat at the beginning of this that's a good ide Cleveland led the series uh 12 games to seven.",
    "timestamp" : "04:07-04:26"
  },
  {
    "timestamp" : "04:26-04:26",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Um, but uh as it stands now, they are currently tied at 13 to 13.",
    "timestamp" : "04:27-04:31"
  },
  {
    "text" : "No way.",
    "timestamp" : "04:31-04:32",
    "speaker" : "Greg"
  },
  {
    "text" : "Because um yes, the Browns have only won one game.",
    "timestamp" : "04:32-04:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Peyton Hillis.",
    "timestamp" : "04:36-04:37"
  },
  {
    "text" : "That is correct. Who was the head coach?",
    "timestamp" : "04:37-04:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "04:40-04:43",
    "speaker" : "Greg",
    "text" : "Uh uh Man Gini. Correct."
  },
  {
    "timestamp" : "04:45-04:45",
    "text" : "Yep.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I can barely remember that game.",
    "timestamp" : "04:45-04:47"
  },
  {
    "speaker" : "Andy",
    "text" : "And I believe that game Um the Patriots kicker was injured. And so do you know who kicked the extra points?",
    "timestamp" : "04:48-04:56"
  },
  {
    "timestamp" : "04:56-04:58",
    "speaker" : "Steve",
    "text" : "That was West Walker."
  },
  {
    "speaker" : "Andy",
    "text" : "Correct. Nicely done.",
    "timestamp" : "04:58-04:59"
  },
  {
    "text" : "2010. I just looked it up. Remember that. It's on patsdynasty. com.",
    "timestamp" : "05:00-05:05",
    "speaker" : "Steve"
  },
  {
    "text" : "That is correct. You can you can look at all this stuff. There's actually um I did a solo episode when you two weren't here. about West Welker's on the Dolphins. I need to listen to that thing. It went way better than having you here, I'm not gonna lie.",
    "speaker" : "Andy",
    "timestamp" : "05:05-05:21"
  },
  {
    "text" : "It was also like you or for everybody listening?",
    "speaker" : "Steve",
    "timestamp" : "05:22-05:25"
  },
  {
    "text" : "Uh it was actually one of the more popular ones that we put out. So both.",
    "timestamp" : "05:25-05:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "05:29-05:31",
    "text" : "Was it on a game?"
  },
  {
    "text" : "Yeah. Yeah. It was about um when the Patriots it was 2003 when the Patriots played the Dolphins. um to set the streak of most wins in a row that they broke the dolphin streak from. But the story of the game was Wes Welker was um their full-time kicker because their kicker pulled a hammy in uh warm-ups. So yeah, yeah.",
    "timestamp" : "05:31-05:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "05:54-05:55",
    "text" : "When he was on the Dolphins."
  },
  {
    "text" : "Yeah, yeah, yeah. So he was doing kickoffs. He was doing uh extra points. And I don't think he kicked the field, but yeah. So his first ever point scored in the NFL was an extra point in that game.",
    "speaker" : "Andy",
    "timestamp" : "05:55-06:05"
  },
  {
    "text" : "So how so how did this you're you're doing it yourself and you're just talking into the US?",
    "timestamp" : "06:05-06:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I never really asked a bunch of questions.",
    "timestamp" : "06:12-06:13"
  },
  {
    "speaker" : "Greg",
    "text" : "How long is it?",
    "timestamp" : "06:13-06:14"
  },
  {
    "text" : "Uh it's a lot shorter than these ones that we do because I don't have to put up a U fucker.",
    "timestamp" : "06:14-06:18",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "06:19-06:23",
    "text" : "But like I can see you just droning on for like 45 minutes and saying that's a lot shorter.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "06:23-06:30",
    "speaker" : "Andy",
    "text" : "I mean yeah, it went it went for uh it was over half an hour. It was like 35, 40 minutes after I took out all the silence."
  },
  {
    "timestamp" : "06:32-06:44",
    "speaker" : "Greg",
    "text" : "Sociopath shit right there. God damn right. Andy just like in a fucking in a basement just Talking to himself about a 2004 Patriots game."
  },
  {
    "speaker" : "Andy",
    "text" : "Hey, I did it in my bedroom thing. Fucking great.",
    "timestamp" : "06:44-06:49"
  },
  {
    "text" : "Crazy dude. Crazy. You're a nutcase.",
    "timestamp" : "06:50-06:54",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "06:54-07:03",
    "speaker" : "Andy",
    "text" : "You're welcome. All right. So, uh a little bit more about this Cleveland Browns football team. I will do the talking about it."
  },
  {
    "timestamp" : "07:03-07:06",
    "speaker" : "Greg",
    "text" : "Because I got notes."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh all right, so Steve, uh do you think Gregory watched the game? Absolutely not. Do you think you wash the highlights? Um probably. All right, Greggs, let's hear your notes.",
    "timestamp" : "07:06-07:21"
  },
  {
    "text" : "I watched the highlights.",
    "timestamp" : "07:21-07:23",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "07:24-07:24",
    "speaker" : "Andy",
    "text" : "Okay."
  },
  {
    "timestamp" : "07:25-07:31",
    "speaker" : "Greg",
    "text" : "I looked at uh Luke McCown. I just am digging about him."
  },
  {
    "speaker" : "Andy",
    "text" : "This is the first ever NFL start in this game.",
    "timestamp" : "07:31-07:34"
  },
  {
    "text" : "The the lesser of the McCown brothers, if you can believe that.",
    "timestamp" : "07:35-07:39",
    "speaker" : "Greg"
  },
  {
    "text" : "Every time I hear McCount, I just think of apples.",
    "timestamp" : "07:40-07:43",
    "speaker" : "Andy"
  },
  {
    "text" : "And he still played till 34 years old. Goodness. Dude, he played 13 seasons in the NFL. He only started 10 games in his whole career. Oh, he's one of those. Okay. He played for 13 seasons and threw nine total touchdowns. All nine of them were in his first two years. Holy shit.",
    "speaker" : "Greg",
    "timestamp" : "07:43-08:05"
  },
  {
    "timestamp" : "08:06-08:06",
    "text" : "No way.",
    "speaker" : "Andy"
  },
  {
    "text" : "And he made $17 million over his career.",
    "speaker" : "Greg",
    "timestamp" : "08:08-08:12"
  },
  {
    "text" : "So more than a million dollars touchdown.",
    "timestamp" : "08:12-08:15",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "08:15-08:19",
    "text" : "Yeah. That ain't bad. Yeah, this guy's living the fucking dream."
  },
  {
    "timestamp" : "08:19-08:22",
    "speaker" : "Steve",
    "text" : "How much per like pass attempt is he making?"
  },
  {
    "timestamp" : "08:22-08:25",
    "speaker" : "Greg",
    "text" : "It's a good question. I'm sure we can figure it out. I bet it's more than your yearly sales."
  },
  {
    "speaker" : "Steve",
    "text" : "Tens of thousands of dollars for sure. 356 passing attempts. You said 17 million.",
    "timestamp" : "08:26-08:31"
  },
  {
    "timestamp" : "08:32-08:33",
    "speaker" : "Andy",
    "text" : "Do the math, Steve."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:34-08:44",
    "text" : "Uh no, I got a calculator for that. Yeah, well that's what I meant. That's theory. What? I'm gonna call 365. 46K each."
  },
  {
    "speaker" : "Andy",
    "text" : "That's not bad.",
    "timestamp" : "08:48-08:49"
  },
  {
    "text" : "I mean in this game, how many attempts did he have?",
    "timestamp" : "08:49-08:52",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh too many and also not enough. We'll just get this out of the so the the Browns team coming in. The bro the Browns coming in this game. Damn, that's not too bad. I love that. I mean in this game he probably earned it. Um Your first game ever going against the 2004 New England Pagers defense with an interim head coach is uh a tough ask. He did okay. He hung in there. He actually had better numbers than Brady at the half.",
    "timestamp" : "08:53-09:28",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Brady did not play very well.",
    "timestamp" : "09:28-09:29"
  },
  {
    "timestamp" : "09:29-09:34",
    "speaker" : "Andy",
    "text" : "He was also losing 21-7 at the half."
  },
  {
    "text" : "But it felt closer than that. I felt like the game I thought the game sort of turned on that scoop and score to make it 28-7. So the first play.",
    "timestamp" : "09:35-09:45",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "09:45-10:04",
    "text" : "So yeah, so here let's let's just run down this real quick. Um, so but before we get to that, the the I think we talked about it last week because the highlights were part of the the game that we watched, the video. Um where it was that shootout was the second highest scoring game ever in NFL history.",
    "speaker" : "Andy"
  },
  {
    "text" : "All right.",
    "timestamp" : "10:04-10:04",
    "speaker" : "Mom"
  },
  {
    "timestamp" : "10:04-10:22",
    "speaker" : "Andy",
    "text" : "Between these Cleveland Browns and the Sesanne Bengals. And the Browns scored 48 points and got outscored by two scores and lost 58-48. I watched the 15-minute extended highlights of that game. The Browns did not look like they are a team that scored 48 points. They were awful."
  },
  {
    "text" : "Was it um it wasn't McCown though, right? It was Holcomb.",
    "timestamp" : "10:23-10:26",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. Yeah, yeah. It wasn't McCown. I think McCown ended up in there like at the end of it or someone. They had somebody else in at the end. I can't remember who it was.",
    "timestamp" : "10:27-10:34"
  },
  {
    "timestamp" : "10:34-10:44",
    "text" : "Was this his first touchdown? Yeah. He was a fourth round pick. They're saying he was like uh as high as a number two quarterback in the country coming out of high school.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "10:45-10:46",
    "text" : "Who was McCown?",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. Luke McCown. Jesus.",
    "timestamp" : "10:46-10:48",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "10:48-10:53",
    "text" : "He played a hot channel. He had like a bunch of NCAA like top five records or yards.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "10:53-11:07",
    "speaker" : "Greg",
    "text" : "And yeah, he would. He didn't wanna he got recruited by Oklahoma and Florida State, but he ended up at Louisiana Tech. Which like it's not even that local for him. He's from Texas. So I don't know if you understand that. It's like"
  },
  {
    "text" : "Maybe maybe it's fair.",
    "speaker" : "Andy",
    "timestamp" : "11:07-11:08"
  },
  {
    "timestamp" : "11:08-11:15",
    "speaker" : "Greg",
    "text" : "I think it might be a Christian thing. Oh. Another big uh God squatter, so that might have had something to do with it. That could be it, yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Like Texas isn't or Oklahoma isn't But Greg, you you touched on something here about the the Browns quarterback situation this year",
    "timestamp" : "11:15-11:25"
  },
  {
    "timestamp" : "11:26-11:28",
    "speaker" : "Greg",
    "text" : "Yeah, they started a bunch of guys, right?"
  },
  {
    "text" : "They started three players. Jeff Garcia started the most games, started ten games, went three and seven.",
    "timestamp" : "11:28-11:33",
    "speaker" : "Andy"
  },
  {
    "text" : "Notable gay athlete, one of the best ever. Really?",
    "timestamp" : "11:33-11:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "11:36-11:37",
    "text" : "Jeff Garcia?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "11:38-11:47",
    "text" : "No, remember Tyrell Owens? No, no. So like start started a rumor that Jeff Garcia was gay even though he wasn't, just because he liked Jeff Garcia. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh man. Was this when he was on the 49ers or after?",
    "timestamp" : "11:48-11:51"
  },
  {
    "timestamp" : "11:51-11:54",
    "text" : "I think it was like as he was pushing his way out the door. Oh yeah, yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "11:54-11:56",
    "speaker" : "Steve",
    "text" : "What a way to get your way out the door."
  },
  {
    "timestamp" : "11:56-11:57",
    "speaker" : "Greg",
    "text" : "Ridiculous, dude."
  },
  {
    "timestamp" : "11:57-12:57",
    "speaker" : "Andy",
    "text" : "And Jeff Garcia was like, what the fuck? Right? Yeah. Oh man. Yeah, so he he was the main starter. Um I don't know if he was battled inju injuries or what, but he also only threw ten touchdowns and nine interceptions in ten games. Um and then Luke McCown was their second leading quarterback. Started four games, including this one, went 0-4. Four touchdowns, seven interceptions. And then Kelly Holcomb is the wild card. He started two games, went one and one. One of those games was the game against the Bengals way through for 413 yards, five touchdowns, and two picks. And he ended the season with um seven touchdowns and five interceptions. So that second game didn't go so great. Two two D, three interceptions, nothing. Yeah. Um, so not a great look when you're starting three quarterbacks who all have similar numbers. Um This is just a bad team."
  },
  {
    "speaker" : "Steve",
    "text" : "And nobody I know on their defense, the whole roster, except for Ebenezer Ecuban.",
    "timestamp" : "12:57-13:03"
  },
  {
    "timestamp" : "13:03-13:04",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "He barely played. He wouldn't even have starter at this point.",
    "timestamp" : "13:04-13:06",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "13:06-13:10",
    "text" : "I recognize Robert Griffith, but I always picture him as a Viking. I didn't know he played on the Browns.",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh yeah, okay.",
    "speaker" : "Steve",
    "timestamp" : "13:10-13:11"
  },
  {
    "timestamp" : "13:11-13:20",
    "speaker" : "Andy",
    "text" : "The third? No, the first. Oh god. But the their leading rusher was um somebody named Lee Suggs."
  },
  {
    "timestamp" : "13:21-13:48",
    "text" : "Sorry to interrupt. Can I I looked up the statements from Terrell Owens? Oh, okay. It's bad. Is it? First of all, it's in an interview with Playboy. Oh, of course it is. And he said Like my boy tells me, if it looks like a rat and smells like a rat, by golly, it's a rat when discussing his sexual when discussing Garcia's sexuality. Oh boy.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yikes, dude. Yikes, rat.",
    "timestamp" : "13:48-13:51"
  },
  {
    "speaker" : "Steve",
    "text" : "It could be taken out of context, but so I'd like to see the whole like isn't this supposed to be a discussing his sexuality?",
    "timestamp" : "13:52-13:58"
  },
  {
    "speaker" : "Andy",
    "text" : "If it looks like a duck and quacks like a duck, like why are you going with rat, man?",
    "timestamp" : "13:58-14:00"
  },
  {
    "text" : "Yeah, rat, I don't even think. Yeah. And do like rats have a distinct smell?",
    "timestamp" : "14:01-14:05",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "14:07-14:14",
    "text" : "I couldn't tell you what a rat smells like. If And it's not even smell, right? If it looks like a duck, if it quacks like a duck like a duck, it's a duck.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Yeah, that's a weird one there. Yeah. All right. Imagine if someone did that in today's day and age. Oh my God. When I'm Playboy and touted a straight guy as a quarterback.",
    "timestamp" : "14:14-14:25"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "14:25-14:26"
  },
  {
    "text" : "And comparing it to a rat? Yeah, that would still work.",
    "timestamp" : "14:26-14:29",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Winner would have a meltdown.",
    "timestamp" : "14:30-14:32"
  },
  {
    "timestamp" : "14:33-14:37",
    "speaker" : "Greg",
    "text" : "It's ridiculous. Apparently Garcia is just taking the eye red the whole time though."
  },
  {
    "speaker" : "Andy",
    "text" : "Good for him.",
    "timestamp" : "14:37-14:37"
  },
  {
    "timestamp" : "14:41-14:43",
    "text" : "Did you hear he got in trouble? No.",
    "speaker" : "Greg"
  },
  {
    "text" : "Doug Garcia?",
    "timestamp" : "14:43-14:44",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. For what? He got he got mad at uh Mina Kim's ESPN. Oh yeah, yeah. And he like made that argument of like, I forget who she was criticizing, but he was like, if you've never played the sport.",
    "timestamp" : "14:44-14:58",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "14:59-15:00",
    "speaker" : "Andy",
    "text" : "Oh, that was him."
  },
  {
    "text" : "Yeah. Yeah.",
    "timestamp" : "15:00-15:01",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "15:01-15:02",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "And then everybody just came for uh came for a stroke. Oh, they piled on, yeah.",
    "timestamp" : "15:02-15:07"
  },
  {
    "text" : "Yeah. He's like, I'm getting canceled for this shit Tio called me gay and Playboy.",
    "timestamp" : "15:07-15:13",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:15-15:16",
    "text" : "Oh, too true."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "15:17-15:19",
    "text" : "I'm married, I got kids. This is bullshit."
  },
  {
    "text" : "Hey, what do you want to tell you, Jeff? It looks like a rat. Smells like a rat. Hey Jeff, you know what a rat smells like? Oh man. Yeah, so uh the only the only name I did recognize on this team was William Green. The running back because he played the B legend. Exactly.",
    "speaker" : "Andy",
    "timestamp" : "15:21-15:38"
  },
  {
    "speaker" : "Steve",
    "text" : "Actually we talked about him last week.",
    "timestamp" : "15:38-15:40"
  },
  {
    "text" : "Oh, that's right, we did.",
    "speaker" : "Andy",
    "timestamp" : "15:40-15:41"
  },
  {
    "text" : "He was a bust. He was a first round pick. Was he really? Yep, 16th overall. I think he",
    "speaker" : "Greg",
    "timestamp" : "15:42-15:48"
  },
  {
    "timestamp" : "15:49-15:51",
    "text" : "I mean he might have been good. He was just stuck on the Browns.",
    "speaker" : "Steve"
  },
  {
    "text" : "Well. Yeah, I mean pretty crazy stats in college. Yeah, he was.",
    "timestamp" : "15:51-15:57",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:58-16:01",
    "text" : "Like the only BC name I I remember knowing growing up."
  },
  {
    "speaker" : "Greg",
    "text" : "In ten games, he had almost sixteen hundred yards and fifteen touchdowns. That's not bad.",
    "timestamp" : "16:01-16:09"
  },
  {
    "timestamp" : "16:09-16:10",
    "text" : "Pretty decent.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "He averaged 2. 7 yards per carry. Yeah. 17 carries, 46 yards.",
    "timestamp" : "16:11-16:16"
  },
  {
    "timestamp" : "16:16-16:33",
    "speaker" : "Andy",
    "text" : "As opposed to Corey Dillon who rushed for 100 yards in the first half. No, excuse me, he ran for 98 yards in the first half. Um, and then you didn't see him at all in the third quarter. They had somebody named um well Uh Cedric Cobbs?"
  },
  {
    "text" : "Yeah, who the fuck was that?",
    "timestamp" : "16:34-16:34",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "16:35-16:39",
    "text" : "I remember that. Yeah, I don't remember."
  },
  {
    "speaker" : "Andy",
    "text" : "I don't remember uh Cedric Cobbs.",
    "timestamp" : "16:41-16:43"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "16:43-16:48",
    "text" : "Neither. But so so back to William Green real quick."
  },
  {
    "text" : "Okay",
    "speaker" : "Andy",
    "timestamp" : "16:48-16:49"
  },
  {
    "timestamp" : "16:50-17:24",
    "text" : "So this is last season during his 2000 his 2003 season was fraught with turmoil. After a good start uh to the year, he was arrested for drunk driving and marijuana possession and notoriously seen wearing one shoe and one sock during the arrest. And then he got a four-game suspension for that. While under suspension, Green's fiance, Asia Gray, stabbed him in the back during a domestic dispute. The league extended his suspension through the end of the season for treatment purposes.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "17:26-17:26",
    "speaker" : "Steve",
    "text" : "Get out of here."
  },
  {
    "text" : "So he's coming off that year. All right.",
    "timestamp" : "17:28-17:31",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:32-17:39",
    "text" : "So you can see how it would take him a little while to like get ramped back up. You know, they're only 13 games into this season. It's no big deal."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "17:39-17:45",
    "text" : "He ran a 485 40 yard dash. That guy's not making the NFL in today's league."
  },
  {
    "text" : "No.",
    "speaker" : "Andy",
    "timestamp" : "17:45-17:45"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "17:45-17:47",
    "text" : "He's a first round pick."
  },
  {
    "text" : "Well, he wouldn't be a first round pick in today's league, that's for sure.",
    "timestamp" : "17:47-17:49",
    "speaker" : "Andy"
  },
  {
    "text" : "No, no, no. Pat's had 50 carries in this game, four and a half yards of carry.",
    "timestamp" : "17:50-17:55",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "17:55-18:19",
    "text" : "Oh yeah. This was This was the epitome of like a pat's beating up on a bad team. Like they didn't look like they even had to break a sweat Because this game literally started. I'm telling you, played pretty good at the beginning. It was over. No, it was over 30 seconds in. The Patriots, Bethel Johnson returned the opening kickoff for touchdown. And the game was over. Like that was it. Brady.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Well take out the kick return touchdown. After that one play, it was 14-7. 5.",
    "timestamp" : "18:22-18:26"
  },
  {
    "text" : "Yeah, except like you can say that, but yeah, it was a ninety what three, ninety-five yard kickoff return, and then their next Um Paige's next scoring drive was a 96-yard scoring drive where they just like ran it at will. And then they did it again and started it was like a 78-yard scoring drive. And it's just like they were just doing kind of what they wanted. And then there was a few like random mistakes. Like uh Corey Dillon had a fumble.",
    "timestamp" : "18:27-18:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:59-18:59",
    "speaker" : "Steve",
    "text" : "Yep."
  },
  {
    "speaker" : "Andy",
    "text" : "On one of the drives.",
    "timestamp" : "18:59-19:00"
  },
  {
    "timestamp" : "19:02-19:03",
    "speaker" : "Steve",
    "text" : "I've thrown a couple interceptions in there."
  },
  {
    "text" : "Yeah. But it was just like what I mean the the interception was just like you know garbage time. Yeah. Trying to get in a in a field goal range and whatever. Didn't really matter.",
    "speaker" : "Andy",
    "timestamp" : "19:04-19:13"
  },
  {
    "timestamp" : "19:13-19:18",
    "speaker" : "Steve",
    "text" : "But they went for it on fourth and down with a Patrick Pass fucking run."
  },
  {
    "text" : "Oh yeah. Yeah. And they didn't run it with Corey Dillon randomly.",
    "timestamp" : "19:19-19:23",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, they're from the 30, and I think Corey Dylan's hurt in this game because",
    "timestamp" : "19:23-19:26"
  },
  {
    "timestamp" : "19:27-19:27",
    "speaker" : "Andy",
    "text" : "That's what he said."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:28-19:31",
    "text" : "Last carry and he doesn't come back for the whole rest of the thing."
  },
  {
    "timestamp" : "19:31-19:43",
    "speaker" : "Andy",
    "text" : "That's what I'm saying. He didn't come back for second half. Well, he came back to get his two yards. Because he finished a half at 98. And so we had like one run to start the fourth quarter to make sure he got his hundred-yard game and then he they pulled him again."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "19:44-19:46",
    "text" : "It's probably a bonus for that."
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly. Yeah. So he'd probably lobbying Bill Belichick to get back in there just so we can get the boy Kevin Falk at 87 yards, pretty close to 100. Kevin Falk has some good runs in this game. Cedric Cobb, not so much.",
    "timestamp" : "19:46-19:58"
  },
  {
    "timestamp" : "19:59-20:01",
    "text" : "29 on 16 carries though.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:01-20:05",
    "text" : "That's what I'm saying. He looks like a poor man's Corey Dillon."
  },
  {
    "text" : "Yeah, he was not very Very good.",
    "timestamp" : "20:05-20:07",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "20:08-20:28",
    "speaker" : "Andy",
    "text" : "Yeah, but this is, you know, this is uh a great three phases game for you, Greg. I know you're a big fan of that. Well I am They had the kickoff return, start the game for a touchdown. Corey Dillon had a couple of touchdown runs. Falk had a touchdown run. Brady had a beautiful deep shot to Patton on third and 22 for 44-yard touchdown."
  },
  {
    "text" : "That was this they ran in the play before he missed it. Brady missed it. Run it again. Exactly. Fuck it.",
    "timestamp" : "20:28-20:34",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "20:34-20:56",
    "speaker" : "Andy",
    "text" : "Do it again. Yeah. And uh and that was definitely just that as soon as that happened, uh, I stopped keeping track of drives and stuff. I just wrote garbage time because that was literally the beginning of garbage time. Yeah. Um and then the pages also started the second half with William Green fumbling and uh Randall Gay returning it for touchdown to start the blowout"
  },
  {
    "text" : "That's what I'm saying. Yeah. That's sweet.",
    "speaker" : "Greg",
    "timestamp" : "20:57-21:01"
  },
  {
    "text" : "Commentators are shitting on McGinnis for like holding. Commentators were.",
    "speaker" : "Steve",
    "timestamp" : "21:02-21:05"
  },
  {
    "timestamp" : "21:05-21:06",
    "text" : "All over it.",
    "speaker" : "Andy"
  },
  {
    "text" : "That Explain what happened first.",
    "speaker" : "Steve",
    "timestamp" : "21:07-21:09"
  },
  {
    "text" : "Well Greg, explain what happened. Yeah. So Who Randall Gay picks up the fumble and like McGuinness is like two yards behind him. And he grabs Randall Gay by the jersey and kind of like yanks behanks him back behind Willie so he can get in front and lead block. And he does a good job, he blocks some and Randall Gay then scores. So it's kind of like it looked weird, but I think Yeah, but the c the commentators were basically",
    "speaker" : "Greg",
    "timestamp" : "21:13-21:38"
  },
  {
    "text" : "Ripping on McGinnis saying, you know, if he hadn't done that, Randall Gay would have been able to just like outrun everybody anyway. And it would have been a whole lot. It's a 30-yard return instead of a 50-yard return. Because Kay has to cut it back all the way across the field.",
    "timestamp" : "21:38-21:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Like, okay, rookie, I want you to run 50 yards instead of 30 yeah, it's like that now is his way of hazing.",
    "timestamp" : "21:50-21:55"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:56-22:00",
    "text" : "It's like I I don't think I don't think you haze in the middle of a football game, bud."
  },
  {
    "text" : "Yeah",
    "speaker" : "Steve",
    "timestamp" : "22:00-22:01"
  },
  {
    "text" : "That's a dumb take.",
    "speaker" : "Mom",
    "timestamp" : "22:02-22:03"
  },
  {
    "text" : "Oh, very dumb.",
    "timestamp" : "22:03-22:04",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "22:04-22:15",
    "text" : "This was also the same commentator that said, if the patrons were a Swiss army knife, do you know how many attachments they'd have? Hmm. Twitchy other guy said, a lot. So riveting stuff from these guys."
  },
  {
    "text" : "They also said here's Don Davis at safety, and they're talking about the Patriots.",
    "speaker" : "Steve",
    "timestamp" : "22:15-22:20"
  },
  {
    "text" : "Yeah. No, it no that that was legit.",
    "speaker" : "Andy",
    "timestamp" : "22:21-22:23"
  },
  {
    "timestamp" : "22:24-22:30",
    "text" : "No. The amount of no-name defensive backs on this 2004 team is ridiculous.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, well that's because Don Davis is a linebacker. But the Patriots came up and this is what something I want to touch on too is the versatility.",
    "timestamp" : "22:30-22:36"
  },
  {
    "text" : "I don't even know who Don Davis is.",
    "speaker" : "Steve",
    "timestamp" : "22:38-22:39"
  },
  {
    "timestamp" : "22:39-23:15",
    "speaker" : "Andy",
    "text" : "Right. And he's not a small linebacker. He was a big dude. Because they were all big linebackers back then. But they decided he's number 51. And he's starting at deep safety because the Patriots decided You know, uh Luke McCown starting in his first game with the interim coach, all the turmoil happening, and the uh Browns Can't throw it deep over the middle. So like, you know what? We're gonna put a linebacker back there. Cause then he can step up to stop the run game because we have literally zero fear of this Browns team throwing it deep down the middle."
  },
  {
    "timestamp" : "23:15-23:28",
    "speaker" : "Steve",
    "text" : "And it worked perfectly. Counterpoint. His other option was Dexter Reed. And he says, wow, these guys both fucking suck. Who cares? Dexter Reed. Well, Dexter Reed had a uh force fumble in this game. He did uh that was a good strip."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah fun. Yeah.",
    "timestamp" : "23:28-23:29"
  },
  {
    "timestamp" : "23:29-23:31",
    "speaker" : "Steve",
    "text" : "Earthwin Moreland's out there."
  },
  {
    "timestamp" : "23:31-23:32",
    "text" : "Oh yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "23:32-23:35",
    "text" : "Troy Brown Gay making plays.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "23:35-23:35"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "23:35-23:37",
    "text" : "Troy Brown plays a lot out there."
  },
  {
    "speaker" : "Andy",
    "text" : "Troy Brown, I think, probably played more defensive back in this game.",
    "timestamp" : "23:37-23:41"
  },
  {
    "timestamp" : "23:41-23:42",
    "speaker" : "Steve",
    "text" : "Got an interception, right?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "23:43-23:44",
    "text" : "Not in this game."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:44-23:49",
    "text" : "Not in this game. No. He did have he did have a uh a big big time play though."
  },
  {
    "timestamp" : "23:49-23:56",
    "speaker" : "Greg",
    "text" : "That was gonna be sure? I'm pretty sure he has an interception in this game. Trey Brown. Did you guys miss that one?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "23:56-23:57",
    "text" : "Yes, yeah."
  },
  {
    "timestamp" : "23:57-23:59",
    "speaker" : "Greg",
    "text" : "You're right. Must admit."
  },
  {
    "timestamp" : "23:59-24:01",
    "speaker" : "Steve",
    "text" : "Did he really look at this?"
  },
  {
    "text" : "Motherfucker. Well, well.",
    "speaker" : "Greg",
    "timestamp" : "24:01-24:03"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "24:05-24:07",
    "text" : "Yeah, I didn't watch the fourth quarter."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, fourth quarter.",
    "timestamp" : "24:07-24:09"
  },
  {
    "timestamp" : "24:09-24:11",
    "text" : "Now I have to go back and watch it. I gotta see that Troy Brown interest.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "24:12-24:13",
    "speaker" : "Andy",
    "text" : "And a fumble recovery?"
  },
  {
    "speaker" : "Steve",
    "text" : "That was on the punt.",
    "timestamp" : "24:13-24:14"
  },
  {
    "text" : "Oh yeah, on the punt. That's right. Yeah. Yeah, no, I I even I turned this game off. It was such a blow-up. So we're gonna have to go back and watch that and make sure we get that because Troy Brad Interceptions are a big fucking deal. Old Uncle Greg Oh, you don't watch the game, Greg? You didn't watch the game, Greg. You never watched the game, Greg. But he also uh made the tackle on the fourth down play.",
    "speaker" : "Andy",
    "timestamp" : "24:14-24:40"
  },
  {
    "speaker" : "Steve",
    "text" : "That was uh inside the red zone.",
    "timestamp" : "24:40-24:43"
  },
  {
    "timestamp" : "24:43-24:44",
    "speaker" : "Andy",
    "text" : "Yeah, in the second quarter."
  },
  {
    "speaker" : "Steve",
    "text" : "It was a classic Troy Brown game. He he crushes it.",
    "timestamp" : "24:44-24:47"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:47-25:12",
    "text" : "Yeah. And he had some punt returns, you know, a couple catches. No big deal, just Troy Brown being Troy Brown. And uh yeah, and there was a punt that uh it bounced short and hit Randall Gay in the back of the legs that he recovered as well. Nice heads up play. You know, typical Troy Brown shit. That's why he's uh that's why we're the Troy Brown fan club on this this podcast. Very good. T-shirts and everything lightly."
  },
  {
    "text" : "Where the Troy Browner stands. Try brown stands. I don't know. Isn't that like a thing they call someone a stan of when they're very k-pop thing, right? Uh I don't know. I don't know either. It seems like it would be a K-pop sort of thing.",
    "speaker" : "Steve",
    "timestamp" : "25:13-25:34"
  },
  {
    "speaker" : "Greg",
    "text" : "Have you seen K-pop?",
    "timestamp" : "25:34-25:36"
  },
  {
    "timestamp" : "25:36-25:39",
    "text" : "Not really. More than like five seconds.",
    "speaker" : "Steve"
  },
  {
    "text" : "It's crazy.",
    "speaker" : "Greg",
    "timestamp" : "25:39-25:40"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "25:41-25:43",
    "text" : "How much K-pop have you watched?"
  },
  {
    "timestamp" : "25:43-26:02",
    "speaker" : "Greg",
    "text" : "I watched like a performance. I came across one of that really popular group. How B BTS. Oh, I've heard. There's like twelve of them. They're a huge group. And they all Sound like they're like pre-pubescent boys."
  },
  {
    "timestamp" : "26:02-26:05",
    "speaker" : "Steve",
    "text" : "Are they pre-pubescent boys? Are they actually singing?"
  },
  {
    "speaker" : "Greg",
    "text" : "It's hard to tell because you know how Asian people always look younger. Not to generalize, but yeah. Yeah. They age well. But they're incredible singers. They're voices and they're like great performers. It's not really my type of music, but like I'm like, okay, I could see why people like this, but it's entertaining. It's like it's out there.",
    "timestamp" : "26:05-26:24"
  },
  {
    "timestamp" : "26:24-26:30",
    "speaker" : "Steve",
    "text" : "How else I would think it's similar to like original InSync and Yeah, 98 degrees."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:30-26:53",
    "text" : "No, way more skilled, way more talented than that. Yeah. It's I would put it on par with like uh a glee performance, right? Like those high school musical where it's like, yeah, they're really good singers and they're good performers. But it's very campy and very like, I don't know. It's like very scripted, very too cheery for me. Way too cheery. That's what it is. Yeah. They're all like smiling and like in a good mood."
  },
  {
    "timestamp" : "26:53-26:56",
    "speaker" : "Steve",
    "text" : "It's like way too much fun right now. I'm not about that."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:56-27:09",
    "text" : "There is a uh a artist band, I'm not sure, called Baby Metal, which is K-pop K-pop and heavy metal put together, yeah. Yes. Interesting."
  },
  {
    "speaker" : "Steve",
    "text" : "I saw the internet was upset that Rob Zombie posted a picture with them.",
    "timestamp" : "27:09-27:13"
  },
  {
    "timestamp" : "27:13-27:14",
    "speaker" : "Andy",
    "text" : "Really?"
  },
  {
    "speaker" : "Steve",
    "text" : "A lot of people were saying they're not metal.",
    "timestamp" : "27:15-27:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:17-27:20",
    "text" : "Rob Zombie, local, local guy, Carpon Haveral."
  },
  {
    "timestamp" : "27:21-27:24",
    "text" : "Really? God snack was local.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:24-27:33",
    "text" : "Yep. Uh yeah. No, they uh him and his brother, who is the lead singer of lead vocalist, I should say, singer's a strong word, of Powerman 5000."
  },
  {
    "speaker" : "Greg",
    "text" : "That's right.",
    "timestamp" : "27:33-27:34"
  },
  {
    "speaker" : "Steve",
    "text" : "I thought it was called Haverhill.",
    "timestamp" : "27:34-27:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Shut up, Steve. Avery. Twixberry. Twixberry.",
    "timestamp" : "27:37-27:46"
  },
  {
    "text" : "It's always the best one. Worcester.",
    "timestamp" : "27:47-27:50",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "27:51-28:47",
    "speaker" : "Andy",
    "text" : "Yep. Gloucester. Yeah, so these commentators, I don't know who was it see it was Randy Cross and somebody else. Don Cricky maybe? I don't know. I would call this the B team. Kevin Harlan. Kevin Harlan, okay. But they were amazed at the versatility of the Patriots. Um Troy Brown playing defensive back. They literally called it out every time he was out there, which is good on them. The Don Davis playing free safety. And also he lined up at defensive end of 1. 2 as a linebacker. So he just didn't play linebacker. Um there was one play where both Richard Seymour and Mike Vrabel reported as eligible. um on one of the Corey Dillon touchdowns. And then Christian Fourier knocked down the Hail Mary at the end of the first half. And they were ecstatic about this."
  },
  {
    "text" : "That's a good point. That's a lot of players playing cross positions. Way more than you see. Very often, this especially this day and age, you know.",
    "timestamp" : "28:48-28:58",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, when's the last time you've seen somebody play both sides of the ball?",
    "timestamp" : "28:58-29:01"
  },
  {
    "timestamp" : "29:01-29:10",
    "speaker" : "Steve",
    "text" : "Seymour was plowing people on that goal line. He was he just he made that touchdown. Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "29:10-29:50",
    "text" : "Did you hear Belichick talk about the someone asked him about the long snapper and whether you needed a roster spot for a long snapper? Oh. He's like, couldn't you just train like a regular offensive lineman to do that job? No. And he and he gave him like a like 10-minute response. And it was actually pretty interesting. Always is. He talked about how like the league has evolved and that people have tried that. And then they ultimately, you know, came down how decisions got made and which players like set precedence and that everyone kind of followed those. It was It was pretty cool. I love that shit. He's a smart son of a bitch when he gets going. Oh, I love when he gets going on something like that."
  },
  {
    "text" : "Because he does. He talks like 10-15 minutes.",
    "speaker" : "Andy",
    "timestamp" : "29:50-29:52"
  },
  {
    "text" : "And I just wish he would do that more often. Because like I feel like it's like a mood thing where sometimes people ask him my questions, I'll be like, oh, that's an interesting question. And he'll still just shut it down. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "29:52-30:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:03-30:09",
    "text" : "So it's he's he's he's more open to answering them lately. Past few seasons."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "30:12-30:19",
    "text" : "Okay, more case and Lolly. Mm, Stevie. You like that? It's an S T word. Yeah, I went to school."
  },
  {
    "text" : "But if you were like, hey, Bill, what's the what's the Patriots theory in offseason here like compared to last year? Because obviously there's a big difference.",
    "timestamp" : "30:19-30:27",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "He's not going to answer that question. Well, no, because there's a competitive advantage to be gained, right?",
    "timestamp" : "30:28-30:32"
  },
  {
    "timestamp" : "30:32-30:34",
    "speaker" : "Steve",
    "text" : "Yeah. He doesn't want to understand what his strategy is."
  },
  {
    "timestamp" : "30:34-30:36",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. It's all like strategy and you know."
  },
  {
    "timestamp" : "30:37-30:42",
    "speaker" : "Steve",
    "text" : "He's got but when you're saying oh in the context of NFL history, why do you like left-footed punters more?"
  },
  {
    "text" : "Right.",
    "timestamp" : "30:43-30:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, there we go, you know.",
    "timestamp" : "30:43-30:45"
  },
  {
    "text" : "Yeah, and you go off about spin rate and people catching it aren't used to it coming at the Does that not give someone else a competitive advantage if they then",
    "speaker" : "Andy",
    "timestamp" : "30:45-30:54"
  },
  {
    "speaker" : "Greg",
    "text" : "Go after left, you know?",
    "timestamp" : "30:54-30:56"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "30:56-31:03",
    "text" : "At that point when he answered that, that's pretty no no, everyone knew he loves left-footed punters. So they all started copying him anyways."
  },
  {
    "text" : "And also I don't think there's enough left-footed punters for it to make that much of a difference. I think it's left-footed punters are like it's another like checkbox to tick off. I don't think it's like He's only looking for left-footed punters, you know.",
    "speaker" : "Andy",
    "timestamp" : "31:03-31:15"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh speaking of that, how did Johnny Hecker not end up on the Patriots?",
    "timestamp" : "31:15-31:19"
  },
  {
    "timestamp" : "31:20-31:21",
    "speaker" : "Andy",
    "text" : "Has he been signed?"
  },
  {
    "text" : "Yes.",
    "timestamp" : "31:22-31:22",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "31:23-31:24",
    "text" : "By whom?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:24-31:25",
    "speaker" : "Steve",
    "text" : "I don't remember."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "31:26-31:30",
    "text" : "Well, did you hear about this kid from college? Yes. Punt God."
  },
  {
    "speaker" : "Andy",
    "text" : "Punt God, that's right. Who just basically has said fuck everything except for distance. And punts at 80 yards every time.",
    "timestamp" : "31:30-31:39"
  },
  {
    "text" : "No. Yeah.",
    "timestamp" : "31:39-31:40",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:40-31:41",
    "text" : "That's his main thing."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, but he's he's good at everything.",
    "timestamp" : "31:41-31:43"
  },
  {
    "speaker" : "Steve",
    "text" : "Hecker to the Panthers.",
    "timestamp" : "31:44-31:45"
  },
  {
    "speaker" : "Greg",
    "text" : "Like his like pin-down punts are like really good too. He's like way above the percentile for that stuff. He's just like the best punter that's ever punted by any like metric or you know it's crazy.",
    "timestamp" : "31:45-31:59"
  },
  {
    "timestamp" : "31:59-32:03",
    "speaker" : "Steve",
    "text" : "That's why we're gonna get Jack Mason for a fifth round pick so we can go get this guy."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:04-32:28",
    "text" : "Is he gonna be available in the fifth round? Yeah, I think people are gonna take him before that. I think so too I mean, if you think about Hecker, Hecker is where like fifth-round pick is got like might make your team. Johnny Hecker is more important to the Rams the past decade than you know their backup. guard or whatever. You know, like the pinter is kind of important."
  },
  {
    "text" : "Oh Greg, you're sounding a lot like Bill Belichick right now. Are you sure I'm all right, buddy? I thought you don't give a shit about specialties.",
    "timestamp" : "32:28-32:35",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:35-32:39",
    "text" : "It's true. I'm really drinking the Kool-Aid right now. I'm just hyped about Punt God."
  },
  {
    "timestamp" : "32:40-32:44",
    "text" : "Oh yeah. So what are the odds that he he ends up on the Patriots?",
    "speaker" : "Andy"
  },
  {
    "text" : "I think Again, if we draft him with the pick we traded Shaq Mason for, it's gonna get a rose hitter. You gave up a guard for a punter.",
    "speaker" : "Steve",
    "timestamp" : "32:44-32:54"
  },
  {
    "speaker" : "Andy",
    "text" : "Fucking right.",
    "timestamp" : "32:54-32:55"
  },
  {
    "speaker" : "Steve",
    "text" : "But Greg's right.",
    "timestamp" : "32:55-32:56"
  },
  {
    "text" : "Can you name projecting him?",
    "timestamp" : "32:58-33:01",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Can you name the punter who was drafting the first round?",
    "timestamp" : "33:01-33:04"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "33:05-33:06",
    "text" : "Tom Tupa."
  },
  {
    "speaker" : "Andy",
    "text" : "He's a first-round pick. Tom Tupa?",
    "timestamp" : "33:06-33:09"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "33:10-33:10"
  },
  {
    "timestamp" : "33:11-33:15",
    "text" : "Was he drafted as a punter? I thought he was drafted as a quarterback, but then he converted.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "But he's a punter too. Tom Tupper can do everything.",
    "timestamp" : "33:15-33:19"
  },
  {
    "speaker" : "Andy",
    "text" : "Tom Trooper did do everything. Tom wasn't Tom Trooper the first player ever to score a two-point conversion, I think.",
    "timestamp" : "33:19-33:25"
  },
  {
    "speaker" : "Steve",
    "text" : "You might be right.",
    "timestamp" : "33:25-33:26"
  },
  {
    "timestamp" : "33:26-33:29",
    "text" : "As a holder for the Cleveland Browns under Bill Belichick.",
    "speaker" : "Andy"
  },
  {
    "text" : "How about that for some who drafted a punter first round?",
    "speaker" : "Steve",
    "timestamp" : "33:30-33:33"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh, Oakland Raiders. I drafted Ray Guy, 23rd player chosen, 1973.",
    "timestamp" : "33:34-33:39"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, 73.",
    "timestamp" : "33:39-33:40"
  },
  {
    "text" : "Remember Ray Guy?",
    "timestamp" : "33:40-33:41",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:42-33:42",
    "speaker" : "Steve",
    "text" : "Yep."
  },
  {
    "timestamp" : "33:43-33:44",
    "speaker" : "Andy",
    "text" : "Dude was a fucking punter."
  },
  {
    "timestamp" : "33:45-33:46",
    "speaker" : "Steve",
    "text" : "He was the original punk god."
  },
  {
    "timestamp" : "33:47-33:50",
    "text" : "Punk god rena of four seven two forty. Okay",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Let's fast with Tom Brady.",
    "timestamp" : "33:51-33:53"
  },
  {
    "timestamp" : "33:53-33:55",
    "text" : "He's projected fifth round.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "33:55-34:02",
    "text" : "Oh, so that Shaq Marison pick is definitely going to the punk on. Let's go, baby.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:04-34:06",
    "speaker" : "Steve",
    "text" : "Let's mess with Willie Green, right?"
  },
  {
    "timestamp" : "34:07-34:10",
    "text" : "I think it is. Oh man.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:10-34:20",
    "speaker" : "Greg",
    "text" : "There's only been one punt in the NFL since 2014 that has traveled 80 yards. Ariza did it twice last season."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "34:22-34:23",
    "text" : "I know who that is."
  },
  {
    "text" : "That's the the punt god. He put 39 punts inside the opponent's 20-yard line. Average 52 yards per punt and set pretty much every record you can imagine.",
    "timestamp" : "34:24-34:35",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "34:36-34:41",
    "speaker" : "Andy",
    "text" : "Yeah He's kind of watching his college games just to see him punt."
  },
  {
    "speaker" : "Steve",
    "text" : "He's going to the Jets then. That's where he can really fucking shine.",
    "timestamp" : "34:41-34:45"
  },
  {
    "text" : "Oh man.",
    "timestamp" : "34:47-34:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:48-34:54",
    "speaker" : "Greg",
    "text" : "No, he's going to Jacksonville. Oh um from Florida State."
  },
  {
    "text" : "Roberto was another.",
    "speaker" : "Andy",
    "timestamp" : "34:55-34:56"
  },
  {
    "text" : "Yeah, yeah. And they had uh they had the HBO show that year, and we just watched him like just mentally collapse in front of our eyes every week. It's crazy. It's crazy.",
    "timestamp" : "34:56-35:08",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "35:08-35:14",
    "speaker" : "Andy",
    "text" : "Just yeah. And he was like a second round pick or something, right? And everybody roasted him like on draft day for it."
  },
  {
    "text" : "Well he was also like legit in college in the big moments too.",
    "speaker" : "Steve",
    "timestamp" : "35:14-35:17"
  },
  {
    "text" : "Yeah, he was like one of the best college kickers ever. And then he did absolutely nothing in NFL.",
    "timestamp" : "35:17-35:21",
    "speaker" : "Greg"
  },
  {
    "text" : "I think he came back. I think he feel like he bounced back.",
    "timestamp" : "35:22-35:24",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "He did, but I don't think he ever like stuck.",
    "timestamp" : "35:24-35:26"
  },
  {
    "speaker" : "Andy",
    "text" : "No, he was more of a journeyman. Yeah. I think the pages tried him out uh before they settled on Nick Folk.",
    "timestamp" : "35:26-35:32"
  },
  {
    "timestamp" : "35:32-35:35",
    "speaker" : "Steve",
    "text" : "I would have known because I wanted him bad."
  },
  {
    "timestamp" : "35:37-35:37",
    "speaker" : "Andy",
    "text" : "Why?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "35:38-35:38",
    "text" : "Why?"
  },
  {
    "timestamp" : "35:38-35:42",
    "speaker" : "Steve",
    "text" : "Because he's got the sick Rex specs dude. That guy is the fucking ship. Oh blankenship."
  },
  {
    "timestamp" : "35:44-35:44",
    "speaker" : "Andy",
    "text" : "No, we're not talking about it."
  },
  {
    "text" : "Oh damn. I want to ask you.",
    "timestamp" : "35:44-35:46",
    "speaker" : "Steve"
  },
  {
    "text" : "Blink is the man. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "35:46-35:47"
  },
  {
    "speaker" : "Steve",
    "text" : "He is the fucking man. Sucks the Colts got him. They got some good kickers. Venateri and then blanket shit.",
    "timestamp" : "35:48-35:55"
  },
  {
    "timestamp" : "35:56-35:58",
    "speaker" : "Greg",
    "text" : "And uh what's his name? Oh yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh uh Vanigerk. Vanagerk. Oh man. Speaking of which, this is the year that um Manning is on pace to break Dan Marino's uh touchdown pass record. That's right.",
    "timestamp" : "35:59-36:13"
  },
  {
    "timestamp" : "36:13-36:16",
    "speaker" : "Steve",
    "text" : "They have a little graphic in this game about it because they don't give a shit about that, I guess."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I think he was four behind or something. Does he break it in 2004?",
    "timestamp" : "36:16-36:20"
  },
  {
    "text" : "That's a good question. Reno's record was 48 and Brady got 50 in 07.",
    "speaker" : "Steve",
    "timestamp" : "36:20-36:25"
  },
  {
    "text" : "Yeah, but then Manning got 50. Five?",
    "timestamp" : "36:25-36:29",
    "speaker" : "Andy"
  },
  {
    "text" : "One?",
    "timestamp" : "36:29-36:30",
    "speaker" : "Steve"
  },
  {
    "text" : "A couple years later? Ten or eleven.",
    "timestamp" : "36:30-36:34",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:34-36:35",
    "speaker" : "Steve",
    "text" : "Is that still the record?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, Manning still has that record. Let's see. 55 in 2013. Um Peyton Manning, the Denver Broncos.",
    "timestamp" : "36:35-36:46"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "36:46-36:50",
    "text" : "What do you get in 04? Did he actually break Marinos or that's what I'm trying to find?"
  },
  {
    "speaker" : "Andy",
    "text" : "2004. Peyton Manning threw 49, which was the most.",
    "timestamp" : "36:50-36:54"
  },
  {
    "timestamp" : "36:55-36:55",
    "speaker" : "Steve",
    "text" : "Yep, that's that."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:55-36:58",
    "text" : "Beating uh Marino by one. He threw 48."
  },
  {
    "speaker" : "Steve",
    "text" : "And then Brady beat him by one.",
    "timestamp" : "36:58-36:59"
  },
  {
    "text" : "And then 07, Brady threw 50. Then 2013, Manning threw 55.",
    "timestamp" : "37:00-37:04",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:04-37:11",
    "text" : "That 50th touchdown pass from Brady will ever will always stick in my mind. Oh yeah. That was another run it again."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:11-37:12",
    "text" : "It really was, yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "37:12-37:13"
  },
  {
    "speaker" : "Andy",
    "text" : "It's kind of crazy to see these like the most touchdown passes in a year. Um Jesus, the lowest. Wow. The lowest since 19. No, that's still lower than that. How far back are we? We have to go back to 1992. Steve Young led the league. With 25 touchdown passes for the 49ers. Did it again in 93 with 29. The next time somebody would win it with less than 30 was Tom Brady in 2002 with 28. Kind of a long time.",
    "timestamp" : "37:13-37:42"
  },
  {
    "timestamp" : "37:42-37:43",
    "text" : "You went the league in touchdowns?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:44-37:52",
    "text" : "2002, yeah. With twenty eight touches. Missed the playoffs. But Yeah, Tom said."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:52-37:55",
    "text" : "I don't care about individual stats. All I give a shit about is winning."
  },
  {
    "text" : "That's crazy.",
    "speaker" : "Andy",
    "timestamp" : "37:56-37:57"
  },
  {
    "speaker" : "Steve",
    "text" : "Now he's like, I don't care about retirement. All I care about is Winning. Do you want to talk about this NFL offseason? Yep.",
    "timestamp" : "37:58-38:05"
  },
  {
    "timestamp" : "38:06-38:07",
    "text" : "The current one?",
    "speaker" : "Andy"
  },
  {
    "text" : "It's been ridiculous. Yeah.",
    "timestamp" : "38:07-38:08",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "38:08-38:10",
    "text" : "We probably should touch on it. Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "38:10-38:14",
    "text" : "It has been there's there ain't no more meat on this Brownsbone. It's",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, no, there's I mean if you want to if you like watching patients blowouts, this is the one for you because it it is literally over 30 seconds in.",
    "timestamp" : "38:15-38:25"
  },
  {
    "text" : "Three quarters and then you gotta fast forward the trade round interception and apparently yeah you're gonna go find that.",
    "timestamp" : "38:25-38:29",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "38:29-38:43",
    "text" : "But we'll we'll put the highlight on the website so you can watch it there. Obviously. Patstynacy. com But yeah, so Greg, do you wanna you wanna touch on uh what are your thoughts on this free agency period of 2022?",
    "speaker" : "Andy"
  },
  {
    "text" : "I say we power rank the moves.",
    "speaker" : "Steve",
    "timestamp" : "38:43-38:46"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "38:46-38:55",
    "text" : "Yep. I think that's a good idea because there's so many that it's like, yeah. Okay. What do you want to power rank them by? Most shocking?"
  },
  {
    "text" : "Yes. The ones you didn't you were just like, what?",
    "timestamp" : "38:55-38:57",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "38:58-38:58",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "38:59-39:01",
    "speaker" : "Andy",
    "text" : "Number one, Russell Wilson."
  },
  {
    "text" : "Russ of the Broncos.",
    "speaker" : "Greg",
    "timestamp" : "39:02-39:03"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "39:04-39:07",
    "text" : "Let's just put them out. Let's just put them out there. Russ of the Broncos."
  },
  {
    "timestamp" : "39:07-39:08",
    "text" : "Watson to the Browns.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Watson to the Browns",
    "timestamp" : "39:09-39:10"
  },
  {
    "text" : "That's for sure. Roger is staying in Green Bay",
    "timestamp" : "39:10-39:12",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "And then his wide receivers leaving.",
    "timestamp" : "39:13-39:15"
  },
  {
    "text" : "Devante.",
    "timestamp" : "39:15-39:16",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "39:16-39:20",
    "text" : "Adams. And MVS just left too. Hill leaving.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "39:20-39:29",
    "text" : "Hill leaving. Both of the Finns, yeah. That's a big one. Matt Ryan to the Colts. Yep. Carson Wentz to the Reds, to the commanders."
  },
  {
    "text" : "Mariota to the Falcons. Mariota to the Falcons.",
    "timestamp" : "39:30-39:34",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "39:34-39:39",
    "text" : "That doesn't that's not even a register on the Victor scale Uh Malcolm Butler back in the Patriots."
  },
  {
    "text" : "Quick question. Who do you think any more former Patriots come back? Trey Flowers, perhaps, someone like that.",
    "timestamp" : "39:43-39:48",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "39:48-39:50",
    "speaker" : "Steve",
    "text" : "Oh yeah, yeah. Flowers for sure."
  },
  {
    "timestamp" : "39:50-39:51",
    "speaker" : "Andy",
    "text" : "KBN already done."
  },
  {
    "speaker" : "Steve",
    "text" : "I wouldn't call it Van Noy coming back since he I thought Van Noy got cut.",
    "timestamp" : "39:54-39:57"
  },
  {
    "speaker" : "Andy",
    "text" : "He did.",
    "timestamp" : "39:58-39:58"
  },
  {
    "speaker" : "Greg",
    "text" : "He did.",
    "timestamp" : "39:58-39:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Do you see him coming back?",
    "timestamp" : "39:59-40:00"
  },
  {
    "speaker" : "Steve",
    "text" : "Maybe We'll find out next week.",
    "timestamp" : "40:01-40:05"
  },
  {
    "timestamp" : "40:05-40:05",
    "speaker" : "Greg",
    "text" : "Gilmore?"
  },
  {
    "timestamp" : "40:06-40:07",
    "speaker" : "Andy",
    "text" : "Gilmore, yeah, that was Gilmore."
  },
  {
    "text" : "I could see Gilmore coming back. I can see Gilmore coming back too. Maybe.",
    "timestamp" : "40:08-40:11",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "40:11-40:13",
    "speaker" : "Mom",
    "text" : "I think Gilmore wants a bag though."
  },
  {
    "text" : "I don't think he's gonna get a bag. That's the problem.",
    "speaker" : "Greg",
    "timestamp" : "40:14-40:16"
  },
  {
    "speaker" : "Steve",
    "text" : "That's that pretty much covers it, right, Greg?",
    "timestamp" : "40:18-40:20"
  },
  {
    "text" : "Yeah, I mean uh Khalil Mack to the Chargers, that one like is a huge move. JC Jackson. To the charges Jackson Von Miller to the Bills. Oh yeah. That happened.",
    "timestamp" : "40:21-40:32",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "That's a shit ton of money too for an aging von Miller. But yeah.",
    "timestamp" : "40:33-40:38"
  },
  {
    "speaker" : "Steve",
    "text" : "What else?",
    "timestamp" : "40:38-40:39"
  },
  {
    "text" : "Um so to me I think the the best off season is the Bengals. You seen what they did? They stacked up their offensive line. Dude, they stacked it. Yeah. L Collins, Ted Karras, and that guy Kappa from Tampa Bay. That center, that's a fucking beast.",
    "speaker" : "Greg",
    "timestamp" : "40:39-40:59"
  },
  {
    "timestamp" : "40:59-41:03",
    "text" : "Oh, we need one more in this. I already mentioned it though, Brady, unretirant.",
    "speaker" : "Steve"
  },
  {
    "text" : "Ray on retiring. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "41:02-41:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. Retired for 40 days.",
    "timestamp" : "41:04-41:07"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "41:07-41:13",
    "text" : "So which one do you think, which one do you have the highest expectations of? And which one do you think is gonna be?"
  },
  {
    "timestamp" : "41:13-41:17",
    "speaker" : "Steve",
    "text" : "Let's go shocking. Which one was the most shocking to you and least shocking?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "41:18-41:26",
    "text" : "I think Wilson to the Broncos. Yeah, that was my biggest one. I don't know about that one. Because Watson, you kind of knew was coming back."
  },
  {
    "text" : "Yeah, yeah, you knew Watson was going somewhere. The fact they went to the Browns was pretty shocking.",
    "timestamp" : "41:27-41:32",
    "speaker" : "Andy"
  },
  {
    "text" : "Right. Yeah. But you also knew Wilson was sort of going somewhere too. Well if there's been a lot of smoke around that. There has been.",
    "timestamp" : "41:32-41:39",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:39-41:44",
    "text" : "Yeah, but it was it felt like similar smoke to Aaron Rodgers where he just wanted more of a say."
  },
  {
    "text" : "Mine is hill to the Dolphins. Yeah, that was a pretty huge one because I didn't see that. Yeah. You didn't think he was like bitching about his contract. I think he's under contract for a couple more years, like they did no need to move him. Then all of a sudden it's like, oh yeah, it's between the dolphins and the jets.",
    "timestamp" : "41:44-41:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "41:59-42:04",
    "text" : "And then like half an hour later, they're like, yep, done. Yeah. It happened really quick. Yeah."
  },
  {
    "text" : "It really did. And just when you're like, you're just like, maybe it's settling down too. It's like. JK.",
    "timestamp" : "42:04-42:11",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "So let's talk about that one. What is the reason for the Chiefs to do that? Because they don't want to pay him when he comes due?",
    "timestamp" : "42:12-42:24"
  },
  {
    "speaker" : "Andy",
    "text" : "I think because they can't really pay him when he comes due because of how much money they're paying Mahomes is what I'm I don't know, but that doesn't make any sense because none of these contracts",
    "timestamp" : "42:25-42:34"
  },
  {
    "speaker" : "Greg",
    "text" : "appear to hit a salary cap in any way. Like I uh that I looked up Hill and what he what kind of hit he has for the Dolphins. It told me that he's a 3% cap hit this year. He's like 10th in the team. And you just signed it.",
    "timestamp" : "42:35-42:50"
  },
  {
    "speaker" : "Steve",
    "text" : "Exactly.",
    "timestamp" : "42:53-42:54"
  },
  {
    "timestamp" : "42:54-43:07",
    "text" : "Yeah. Because I think he had like 50 million or something guaranteed at as a signing bonus. But you can spread that signing bonus over the course of the contract, which is why you always see it get converted to a bonus.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:07-43:29",
    "speaker" : "Steve",
    "text" : "Because then you can just like in our group chat, Matt Ryan's cap hit this year combined across both his teams is like 75 million. Yeah. But yeah. The Falcons are playing paying him 40 million to play for the Colts. They're playing Julio still 16 million to not play. It's a ridiculous amount of cap that kept it. And the Saints are just as bad."
  },
  {
    "speaker" : "Andy",
    "text" : "But the Saints did the whole the same thing, but they just kicked all of that can down the road to where they have like like only a handful of dollars left like next year already without having re-signed anybody. No, they're because they kicked everything down the road so that they could actually make room enough to sign um Deshaun Watson.",
    "timestamp" : "43:29-43:48"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "43:49-43:49"
  },
  {
    "text" : "Then he decided to go with the Browns anyway.",
    "timestamp" : "43:49-43:51",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:51-43:55",
    "speaker" : "Steve",
    "text" : "They created a bunch of space for Watson and all of a sudden he was like, nah, Browns."
  },
  {
    "timestamp" : "43:55-44:02",
    "speaker" : "Andy",
    "text" : "So I it almost feels like there's gonna be a year where they just can't afford to pay 53 players to roster."
  },
  {
    "text" : "Well that's why they had to let their left tackle go.",
    "speaker" : "Steve",
    "timestamp" : "44:02-44:04"
  },
  {
    "text" : "But people say that about the Rams, and they're just like, oh yeah, they're just kicking the can down on the salary cap. And they re-sign Matt Stafford. They're talking about re-signing Aaron Donald. Yeah, but the We're talking about resigning Beckham. How can they afford that? I don't understand. The other the other thing They're mortgaging the future. That the Patriots Do the They already did mortgage a future. It it is the future now from when they first started mortgaging it and they're re-signing all their best players.",
    "timestamp" : "44:05-44:29",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't understand. Shit.",
    "timestamp" : "44:29-44:37"
  },
  {
    "speaker" : "Andy",
    "text" : "Nothing. Right. I think that I think that's part of it is that they don't have they don't have the depth. So if they suffer from injuries, they're they're fucked.",
    "timestamp" : "44:37-44:45"
  },
  {
    "timestamp" : "44:45-44:45",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:46-44:49",
    "speaker" : "Andy",
    "text" : "Right. But that's that's sort of the opposite."
  },
  {
    "speaker" : "Steve",
    "text" : "It's worked for a ton of money to be to the top guys, but they have a a bunch of guys making six million.",
    "timestamp" : "44:49-44:55"
  },
  {
    "text" : "Yeah. Yeah, they have the biggest middle class.",
    "timestamp" : "44:55-44:58",
    "speaker" : "Andy"
  },
  {
    "text" : "And they had a lot of Rex Burkeheads on their team.",
    "speaker" : "Steve",
    "timestamp" : "44:58-45:00"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:00-45:01",
    "text" : "Right, exactly."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "45:01-45:01"
  },
  {
    "timestamp" : "45:01-45:11",
    "speaker" : "Andy",
    "text" : "A lot of special teamers, right? The Justin Bethels and the Matthew Slaters and special teams guys. Because all three phases, right, Greg?"
  },
  {
    "timestamp" : "45:11-45:14",
    "speaker" : "Greg",
    "text" : "You think Hill's gonna be good on the Dolphins? It's a good question."
  },
  {
    "text" : "It depends on what you feel about Tua. I don't know. I'm not super sold on them.",
    "timestamp" : "45:15-45:17",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "45:17-45:20",
    "text" : "Yeah, me either. At least you get to find out now."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "45:20-45:31",
    "text" : "Yeah, no excuses at this point. So given the model. So well here's a question."
  },
  {
    "timestamp" : "45:31-45:38",
    "speaker" : "Greg",
    "text" : "Who has it who has a better statistical season, Hill or Devontae Adams? Adams. Adams."
  },
  {
    "speaker" : "Steve",
    "text" : "Okay. He's probably getting better balls, more target share.",
    "timestamp" : "45:39-45:44"
  },
  {
    "speaker" : "Andy",
    "text" : "And I I like well I I think the uh I just think the Raiders are a more complete offense because they have running back.",
    "timestamp" : "45:44-45:49"
  },
  {
    "timestamp" : "45:49-45:54",
    "speaker" : "Greg",
    "text" : "I think Derek Carr can sling too. I think people underestimate how much he can actually gun sling."
  },
  {
    "text" : "I think Josh is gonna do well second time around.",
    "timestamp" : "45:54-45:56",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. It's also yeah, if somebody can get the best out of a quarterback, it's probably me. Yeah.",
    "timestamp" : "45:57-46:02"
  },
  {
    "timestamp" : "46:03-46:08",
    "speaker" : "Steve",
    "text" : "Oh yeah, Mike Daniel And who's their OC? I don't even know their OC is either."
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know. I don't care. But so I I made the mistake today because I I I've actually been driving to work, so I've run out of podcasts. So I just had a quick drive to do this afternoon. So I turned on sports talk radio.",
    "timestamp" : "46:08-46:22"
  },
  {
    "text" : "Of course I do. Your solo podcast? I don't listen to our podcast. I've heard it once. That's more than enough. You don't have to listen, plus if you listen to the solo one end, you can just listen to yourself.",
    "speaker" : "Steve",
    "timestamp" : "46:24-46:33"
  },
  {
    "speaker" : "Andy",
    "text" : "I do that a lot. I just have that on repeat. Yeah. But yes, I I made the mistake of turning on Sports Talk Radio. And they were talking about um How it's a given that Tom Brady is going to be traded to Miami.",
    "timestamp" : "46:34-46:48"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "46:48-46:50",
    "text" : "Miami. Miami is enough."
  },
  {
    "timestamp" : "46:52-47:10",
    "speaker" : "Andy",
    "text" : "Because there's rumors that Tom Brady is going to buy ownership stake in the Dolphins. Or has already or something. And there was all that smoke around him, uh like Brian Flores was supposed to be like trying to tamper to get him to come."
  },
  {
    "text" : "I take that as truth verbatim. That they're trying to recruit Brady and Flores said, no, fuck this.",
    "timestamp" : "47:10-47:17",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "47:17-47:18",
    "text" : "Yeah, probably.",
    "speaker" : "Andy"
  },
  {
    "text" : "Flores, Brady probably would have been on the Dolphins and they would have made all these moves and he'd be on there.",
    "timestamp" : "47:19-47:22",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "47:23-47:32",
    "text" : "Maybe. But they're saying now that Brady doesn't want to play for Arians. And so it's basically a done deal that he's going to Miami. And how does Patriots fans think of that?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:32-47:42",
    "text" : "So I will put Brady unretiring at the bottom of my surprise list. That and JC Jackson going somewhere and getting a bunch of money.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:42-47:47",
    "text" : "Yeah, I wouldn't say it's the bottom. I was pretty surprised. I was a little surprised. I don't know."
  },
  {
    "timestamp" : "47:48-47:49",
    "speaker" : "Andy",
    "text" : "But not I wasn't shocked."
  },
  {
    "text" : "I was uninterested as far as the word I would use.",
    "speaker" : "Greg",
    "timestamp" : "47:50-47:52"
  },
  {
    "text" : "Yeah, I'm I'm just happy that I'm not going through the Izzy Izzyny, you know? Oh yeah. That's nice to not be a part of it.",
    "speaker" : "Steve",
    "timestamp" : "47:53-47:59"
  },
  {
    "speaker" : "Andy",
    "text" : "It just sucks that he's under the Brett Favre phase of his career, you know? Yeah. Tough. I always thought he's better than that, but I'm a little to the Bills did surprise me too.",
    "timestamp" : "47:59-48:08"
  },
  {
    "speaker" : "Steve",
    "text" : "They usually don't make big signings like that.",
    "timestamp" : "48:08-48:10"
  },
  {
    "timestamp" : "48:11-48:23",
    "text" : "Well, this is their window, right? Yeah. Yep. This is this is their chance. They got the AFC on the ropes, although This is gonna be a tough year for any team to come out of the AFC.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:23-48:24",
    "speaker" : "Steve",
    "text" : "Oh yeah."
  },
  {
    "timestamp" : "48:24-48:31",
    "speaker" : "Andy",
    "text" : "Which is another reason why I think Brady stays in the NFC because who's he gotta go through? Aaron Rodgers with no weapons?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah that receiving card sucks now.",
    "timestamp" : "48:31-48:34"
  },
  {
    "speaker" : "Andy",
    "text" : "The Falcons with no quarter. I mean say no quarterback.",
    "timestamp" : "48:34-48:38"
  },
  {
    "timestamp" : "48:38-48:39",
    "text" : "Marcus Mariota.",
    "speaker" : "Steve"
  },
  {
    "text" : "The the Saints with no quarterback. Jameis. I'll stand by that.",
    "timestamp" : "48:39-48:45",
    "speaker" : "Andy"
  },
  {
    "text" : "Panthers with Sam Darnold and Johnny Hecker.",
    "timestamp" : "48:45-48:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "48:49-48:55",
    "text" : "The Giants. Right. With no quarterback. Carson Wentz on the Commanders?",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "48:56-48:56"
  },
  {
    "timestamp" : "48:57-49:09",
    "text" : "That one is a guaranteed disaster. I can't wait. To watch it because it's gonna be a disaster from day one and everybody knows it. Very good. And we're all gonna sit there and be like, Yes, we're all wicked smart because we knew this was not gonna work.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I bet Eagles fans are ecstatic about that.",
    "timestamp" : "49:10-49:13"
  },
  {
    "text" : "Oh imagine if he turns out to be awesome on the commanders. How fucking ridiculous that would be.",
    "timestamp" : "49:13-49:19",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "49:19-49:22",
    "speaker" : "Andy",
    "text" : "I would hate that. That would be the most shocking thing of the season."
  },
  {
    "speaker" : "Greg",
    "text" : "It'd be Christoph Porzingis all over again. We're like, oh the Knicks just drafted this fucking seven foot Latvian guy that we've only seen playing against like folding chairs. He's gonna be fucking awful. And then he came in with dominant slaves. And we're like, what the hell?",
    "timestamp" : "49:22-49:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:41-49:41",
    "text" : "This is the Knicks."
  },
  {
    "speaker" : "Steve",
    "text" : "This is the goddamn Knicks. Well who does better? Matt Ryan or Carson Wentz? Matt Ryan.",
    "timestamp" : "49:43-49:49"
  },
  {
    "speaker" : "Greg",
    "text" : "Matt Ryan, without a doubt. I think Matt Ryan could have a good year.",
    "timestamp" : "49:49-49:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Matt Ryan's. Yeah, fantasy sleeper. Matt Ryan's making the playoffs with that team. Yep. Their offense is sneaky good.",
    "timestamp" : "49:52-49:59"
  },
  {
    "timestamp" : "49:59-50:02",
    "speaker" : "Steve",
    "text" : "AFC though. It's gonna be tight in the AFC. It is."
  },
  {
    "text" : "Not in the AFC South though. Yeah.",
    "timestamp" : "50:02-50:05",
    "speaker" : "Andy"
  },
  {
    "text" : "I mean they're in Jacksonville. Jacksonville could turn around. They signed uh Christian Kirk to a fucking $20 million a year contract. 84 million. Dumbest shit ever.",
    "timestamp" : "50:05-50:17",
    "speaker" : "Greg"
  },
  {
    "text" : "They said they basically tried to do what the Patriots did, but just signed a whole bunch of mediocre guys for the Patriots money.",
    "timestamp" : "50:17-50:22",
    "speaker" : "Andy"
  },
  {
    "text" : "Dude, I looked up that that Christian contract deal looks like he has like dirt on the owner or something because it there's no way anybody that knows anything about sports looks at that and goes, yeah, this makes sense. He has this he has like He's like a top 10 paid uh receiver in the league now. Yeah.",
    "timestamp" : "50:22-50:43",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "50:43-50:45",
    "text" : "Where did he used to play?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "50:45-50:46",
    "speaker" : "Greg",
    "text" : "Cardinals. Exactly."
  },
  {
    "timestamp" : "50:47-50:49",
    "speaker" : "Andy",
    "text" : "Exactly. Where did he use to play?"
  },
  {
    "text" : "He's never had a fucking thousand yard season in his career. To be fair, I like Christian Kirk. I would have loved him in the past. He would have been good, but not anywhere.",
    "speaker" : "Steve",
    "timestamp" : "50:49-50:56"
  },
  {
    "timestamp" : "50:56-51:03",
    "text" : "I mean, having said that, the didn't the Jaguars have like stupid amounts of money? So you mean you gotta you gotta sign it somewhere, right?",
    "speaker" : "Andy"
  },
  {
    "text" : "That's the only thing that makes sense to me is that like no one wants to go there because they're in such shambles that they have to like super overpay to get anybody to sign.",
    "speaker" : "Greg",
    "timestamp" : "51:03-51:11"
  },
  {
    "text" : "Yeah. Well does trade for Tyreek Hill and throw him even more than that.",
    "speaker" : "Steve",
    "timestamp" : "51:11-51:16"
  },
  {
    "speaker" : "Andy",
    "text" : "That's what I'm saying. I'm sure you've got the draft capital and the money. You obviously have the money. Who's their coach? Oh fuck, um Urban Meyer",
    "timestamp" : "51:17-51:32"
  },
  {
    "speaker" : "Greg",
    "text" : "There's some awesome stories about Urban Meyer this week. Did you see those? Yes. Doug Peterson. Didn't know who uh Aaron Donald was.",
    "timestamp" : "51:34-51:42"
  },
  {
    "timestamp" : "51:43-51:44",
    "speaker" : "Andy",
    "text" : "Who's this 99 guy?"
  },
  {
    "speaker" : "Greg",
    "text" : "It has to be, but I just I really want it to be true, so I'm believing it. I'm going with it.",
    "timestamp" : "51:47-51:52"
  },
  {
    "text" : "Jack's coach is Doug Peterson, by the way.",
    "timestamp" : "51:52-51:54",
    "speaker" : "Andy"
  },
  {
    "text" : "Really? Yeah. Doug.",
    "speaker" : "Greg",
    "timestamp" : "51:55-51:56"
  },
  {
    "timestamp" : "51:57-51:58",
    "speaker" : "Andy",
    "text" : "Mm-hmm."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "51:58-52:14",
    "text" : "So he'll be one of those, you know. They also signed Zay Jones for 10 million per. Oh. That guy's never been. Nope. He averaged 32 yards a game. It was best season."
  },
  {
    "text" : "Yeah, this is this will be good.",
    "speaker" : "Andy",
    "timestamp" : "52:15-52:16"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm uh I think the Chargers can be sneaky good. I like their moves.",
    "timestamp" : "52:16-52:19"
  },
  {
    "text" : "Oh yeah. Yeah, oh yeah. There's something wrong there though, that they it's a couple years in a row now that they've had like a really good team on paper, and there's something that's not working coaches kicked out of him by the Patriots but Stalek is like kind of I mean he's yeah he's supposed to be a he's got a vision he seems like he's like a the players like him Right. He's pretty forward thinking.",
    "timestamp" : "52:20-52:46",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes. Right at the end of the season to not make the playoffs. Wasn't that him? Yeah. Where all he had to play for a tie to make the playoffs, him and whoever they were playing. Yes. The Raiders, maybe?",
    "timestamp" : "52:53-53:03"
  },
  {
    "timestamp" : "53:03-53:04",
    "speaker" : "Greg",
    "text" : "The Raiders, yeah."
  },
  {
    "timestamp" : "53:04-53:08",
    "speaker" : "Andy",
    "text" : "And if they tied that. All that time out. The Steelers would miss the playoffs."
  },
  {
    "text" : "That game was awesome.",
    "timestamp" : "53:10-53:11",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "53:11-53:15",
    "speaker" : "Andy",
    "text" : "Three quarters of the way through overtime. And he's stupid."
  },
  {
    "speaker" : "Steve",
    "text" : "Do the Chiefs make the playoffs? Yeah. Yes. Why are you so confident? They have like the hardest division in football.",
    "timestamp" : "53:17-53:25"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "53:26-53:27",
    "text" : "It's true."
  },
  {
    "text" : "Yeah. Rasta the Broncos now.",
    "timestamp" : "53:28-53:30",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "And if they start out like they did start this year, we kind of just say the Chiefs are the Chiefs.",
    "timestamp" : "53:30-53:34"
  },
  {
    "timestamp" : "53:34-53:36",
    "text" : "They have no receivers really.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. I don't know. I think they have a really good coach and a really good quarterback. And to me, that means playoffs.",
    "speaker" : "Greg",
    "timestamp" : "53:37-53:42"
  },
  {
    "speaker" : "Steve",
    "text" : "Like it's gonna be hard for the you're gonna have to have two wild cards come out of there. They have to get all the other",
    "timestamp" : "53:43-53:49"
  },
  {
    "timestamp" : "53:50-53:52",
    "text" : "That division's gonna be so sick. I can't wait to watch that.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "53:53-53:55",
    "speaker" : "Andy",
    "text" : "Yeah, those division games are gonna be worth watching."
  },
  {
    "timestamp" : "53:55-53:56",
    "text" : "I hope they get like every Sunday night game.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:57-53:59",
    "text" : "Yeah, yeah, absolutely. It really should be primetime."
  },
  {
    "timestamp" : "54:00-54:01",
    "text" : "Juju to the Chiefs, right?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:01-54:02",
    "text" : "Yes."
  },
  {
    "speaker" : "Greg",
    "text" : "I think that might be a sneaky good one. That's a good uh fantasy sleeper pick there.",
    "timestamp" : "54:03-54:08"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:08-54:11",
    "text" : "Yeah, him in uh Valdez Scanling too."
  },
  {
    "timestamp" : "54:11-54:13",
    "text" : "Oh, he sucks.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "54:13-54:17",
    "text" : "He's just fast. But now the Packers won't have him, so it's gonna be fun.",
    "speaker" : "Andy"
  },
  {
    "text" : "Have you heard um the USFL uh rule chain or I guess rules? That are different. You know how they like try them out in USFL?",
    "timestamp" : "54:17-54:28",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, yeah. Like they did with XFL, right?",
    "speaker" : "Andy",
    "timestamp" : "54:28-54:31"
  },
  {
    "text" : "Yeah, I wrote a couple down because I thought they were pretty interesting. I'm gonna say so one of them is the onside kick thing option that we've talked about where it's the fourth and twelve from your own 33.",
    "speaker" : "Greg",
    "timestamp" : "54:31-54:42"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh interesting.",
    "timestamp" : "54:42-54:43"
  },
  {
    "speaker" : "Greg",
    "text" : "You can do that in lieu of a onside kick.",
    "timestamp" : "54:43-54:46"
  },
  {
    "text" : "Okay.",
    "speaker" : "Andy",
    "timestamp" : "54:46-54:47"
  },
  {
    "speaker" : "Greg",
    "text" : "I personally love that one. I think that's a great idea. I just feel like you take it every time, but okay.",
    "timestamp" : "54:48-54:52"
  },
  {
    "timestamp" : "54:53-54:54",
    "text" : "Fourth and twelve from your own.",
    "speaker" : "Andy"
  },
  {
    "text" : "If you give if you don't get it, they get the ball on your 33-yard line.",
    "timestamp" : "54:54-54:57",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, twelve, twelve yards is long.",
    "speaker" : "Steve",
    "timestamp" : "54:57-54:58"
  },
  {
    "timestamp" : "55:00-55:01",
    "speaker" : "Greg",
    "text" : "All right."
  },
  {
    "text" : "Less chance you even get that the onside kick chances are so low.",
    "timestamp" : "55:01-55:04",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Well they're they've they've done the math and it's done the math. That's why it's that's why it's fourth and twelve and not fourteen. Exactly. Yeah. Um a three point conversion. How's that work? From the ten yard line",
    "timestamp" : "55:04-55:20"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "55:21-55:29",
    "text" : "That should be from the twelve yard line too. If you're gonna do twelve, right, you may as well just even it up. Yeah, ten seems a little close."
  },
  {
    "speaker" : "Greg",
    "text" : "I feel like I would just go for that every time. When you're in when you're going into the end zone, ten is more than like that's Harder to get than a fourth and ten from your own 30, you know, whatever. Right. Because you don't have to cover as much of the field. But in concept, do you like that one?",
    "timestamp" : "55:29-55:42"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "55:42-55:44",
    "text" : "I don't know. That'd be too much. That's a field goal, you know?"
  },
  {
    "speaker" : "Greg",
    "text" : "I feel like it changes the dynamic of strategy way too much. Cause right now, like having those like it's a two-score game. Those things like are hugely impactful to games. And if you change that one rule, you're going to change all sorts of strategy.",
    "timestamp" : "55:44-55:59"
  },
  {
    "timestamp" : "55:59-55:59",
    "speaker" : "Andy",
    "text" : "Yeah. Yep."
  },
  {
    "timestamp" : "56:00-56:02",
    "text" : "Which I kind of like that strategy as it is now.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, yeah, yeah.",
    "timestamp" : "56:03-56:03",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:04-56:07",
    "text" : "And you're not really solving a problem. You're just adding kind of a gimmick rule to it.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:07-56:09",
    "text" : "And it's like a field goal too, you know."
  },
  {
    "text" : "It's it's I mean if it was like uh a 50-yard field goal for three points, I'd be like, okay, let's try that. That was from midfield. Right, yeah, yeah.",
    "speaker" : "Andy",
    "timestamp" : "56:09-56:19"
  },
  {
    "timestamp" : "56:20-56:22",
    "text" : "Justin Tucker would be the fucking MVP.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, exactly. Hit three pointers every time. Didn't they have uh a rule change about um overtime as well? What's their overtime?",
    "timestamp" : "56:22-56:31"
  },
  {
    "text" : "So the overtime one is overtime shootout. So it's similar to like a penalty kick in soccer where each team gets three two-point conversion attempts. Okay. And then whoever has more successful ones. I see. And then you go one for one. And then you do sudden death. Yeah. Interesting.",
    "timestamp" : "56:31-56:51",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "That's not too bad. Yeah, it's better than what they got. Yeah. I mean it's not funny. I think you just follow college, but and just tweak maybe tweak that too. But it's kind of is fallen college. Oh yeah, it's definitely similar.",
    "timestamp" : "56:51-57:01"
  },
  {
    "text" : "It's kind of hokey that you don't actually play. Right.",
    "timestamp" : "57:01-57:06",
    "speaker" : "Greg"
  },
  {
    "text" : "Like yes, it's like one play to win.",
    "speaker" : "Andy",
    "timestamp" : "57:06-57:08"
  },
  {
    "text" : "Which you could say about soccer or hockey, to be fair too, right? That's a pretty hokey way to Finish the game.",
    "timestamp" : "57:09-57:14",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I've always made a penalty. College college has got it. I don't know why you need to rethink it.",
    "timestamp" : "57:14-57:20",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Just fucking keep playing quarters until somebody leaves at the end, right?",
    "timestamp" : "57:21-57:24"
  },
  {
    "speaker" : "Steve",
    "text" : "Fuck it. No.",
    "timestamp" : "57:25-57:26"
  },
  {
    "timestamp" : "57:26-57:28",
    "text" : "Make them make him play for fucking three days at a time.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "57:29-57:31",
    "speaker" : "Steve",
    "text" : "College overtime is the best."
  },
  {
    "speaker" : "Greg",
    "text" : "Gambling. It affects the point spreads. Yeah. Overs hit way more. Yeah.",
    "timestamp" : "57:32-57:38"
  },
  {
    "timestamp" : "57:39-57:43",
    "speaker" : "Steve",
    "text" : "Well then just make the winning team only score by seven or whatever it is. Whatever the last score is."
  },
  {
    "speaker" : "Andy",
    "text" : "I saw something.",
    "timestamp" : "57:44-57:45"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "57:45-57:48",
    "text" : "I agree. I think that's a good way to do it. Yeah."
  },
  {
    "text" : "Whatever the difference in overtime is, is what's added to the winning team regular season score.",
    "speaker" : "Steve",
    "timestamp" : "57:49-57:54"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, it's like bag toss. Okay. Or if you both score, they cancel each other out.",
    "timestamp" : "57:55-58:01"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:01-58:05",
    "text" : "Oh yeah, yeah. All right. Yeah. Yeah. So it's just the whatever the plus-minus."
  },
  {
    "text" : "You're playing football bag toss in time.",
    "speaker" : "Steve",
    "timestamp" : "58:05-58:07"
  },
  {
    "timestamp" : "58:07-58:09",
    "text" : "Football bag toss. That's not bad.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "58:09-58:10",
    "speaker" : "Steve",
    "text" : "That's not bad."
  },
  {
    "speaker" : "Greg",
    "text" : "Punter punter bag toss would be sick too.",
    "timestamp" : "58:10-58:13"
  },
  {
    "timestamp" : "58:14-58:16",
    "speaker" : "Steve",
    "text" : "My deckers get a lot more than what he makes."
  },
  {
    "text" : "Draft punt god and just have him fucking drop the second.",
    "speaker" : "Greg",
    "timestamp" : "58:16-58:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, so here's what you do, right? You get um You get kiddie pools, right? You put them on the corner of each end zone and you have the punters punt from midfield and whoever hits whoever hits the kiddie pool.",
    "timestamp" : "58:21-58:30"
  },
  {
    "timestamp" : "58:30-58:49",
    "text" : "I love this idea. See? Yeah. What about what about a what about a punt pass kick? But the same thing where it's a kiddie pool and they have to throw it, they have to punt it, and you have to have kickers. You have three separate position. Do the challenge.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yep. And then and then it's it's the bag toss scores. So it's yeah, whatever plus minus you get. Yeah. That's your final score. Love it. Three rounds. So each no, it should just be, I think we've already solved this. It should be um a sumo wrestling match between the two fattest um assistant coaches. Isn't that what we said? KY Jelly, though. And who and whichever coach pushes the other coach, uh like they started the 50, and whichever one pushes the other coach to the other opposite team's 40-yard line wins the game. Fucking Andy Reed did. He's going to the fucking That's what I mean. Yeah.",
    "timestamp" : "58:49-59:23",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Belchak's gotta bulk up for the shit. But they're tied together because they we don't want him like",
    "timestamp" : "59:23-59:28"
  },
  {
    "timestamp" : "59:28-59:30",
    "text" : "Oh yeah, yeah. Oh the velcro together or something.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, whatever. Yeah. Or uh remember the challenge? MTVs of the challenge where they tied each other back to back. Yes, yes. And they had to like Go it was like a boar and CT just picked that dude up on his back and he was like danger and then he like threw him into the thing. Yeah Classic C T. Classic CJ. That was a psycho. I don't know. You don't remember CT from Boston?",
    "timestamp" : "59:30-01:00:03"
  },
  {
    "timestamp" : "01:00:04-01:00:04",
    "text" : "Mm-hmm.",
    "speaker" : "Andy"
  },
  {
    "text" : "He was like the most stereotypical Boston guy ever. Just loves starting fights and being immediately.",
    "speaker" : "Greg",
    "timestamp" : "01:00:05-01:00:10"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:13-01:00:17",
    "text" : "It's because they were from Real World, right?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:00:17-01:00:23",
    "text" : "Yeah, I think so. Originally or Road Rules. Right. It was Real World Road Rules Challenge."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. You really should rewatch Real World because that shit was Wild West back in the day. Yeah.",
    "timestamp" : "01:00:23-01:00:28"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "01:00:28-01:00:28"
  },
  {
    "text" : "The original ones are fucking crazy. Oh yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:00:28-01:00:31"
  },
  {
    "timestamp" : "01:00:31-01:01:07",
    "speaker" : "Andy",
    "text" : "So with all of these free agent moves, um which Patriots game are you most looking forward to this year? I'll give you a quick rundown. Okay. At Cleveland, at Green Bay, at uh obviously Home and Way Miami, at Minnesota, Home in Way Buffalo, Homeway Jets. Home vs the Ravens, home vs Bengals, home vs Bears, Home vs Lions at Pittsburgh At Arizona, at Vegas, home versus the Colts. At Vegas. Yeah. At Vegas will be a good one."
  },
  {
    "text" : "Josh McDaniels, a Raiders resurgent. Second would be the I can't believe I'm saying this with the Browns.",
    "speaker" : "Steve",
    "timestamp" : "01:01:09-01:01:14"
  },
  {
    "text" : "I was thinking at Cleveland against uh Deshaun Watson.",
    "speaker" : "Andy",
    "timestamp" : "01:01:14-01:01:19"
  },
  {
    "timestamp" : "01:01:19-01:01:31",
    "text" : "Where does Baker go? You still need support. Seattle? Who's left? Yeah, who's left? The Lions? I've heard that throwing around.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:01:31-01:01:38",
    "text" : "No, Lions are Seattle sign in Colin Capran and then draft next year."
  },
  {
    "text" : "Hmm.",
    "speaker" : "Greg",
    "timestamp" : "01:01:41-01:01:42"
  },
  {
    "speaker" : "Steve",
    "text" : "I think Seattle's gotta be, right?",
    "timestamp" : "01:01:42-01:01:44"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh he's signing Kaepernick, Steve. You haven't heard this? No.",
    "timestamp" : "01:01:45-01:01:49"
  },
  {
    "timestamp" : "01:01:49-01:01:52",
    "text" : "Uh Pittsburgh. Sign on Pittsburgh.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01:52-01:02:02",
    "speaker" : "Greg",
    "text" : "Kaepernick is still getting floated as a I did he did one of his little thirst traps online where you did a workout with uh some Seattle wider Tier."
  },
  {
    "speaker" : "Andy",
    "text" : "I don't remember which one it was. Yeah.",
    "timestamp" : "01:02:02-01:02:03"
  },
  {
    "speaker" : "Greg",
    "text" : "Tyler Lockett.",
    "timestamp" : "01:02:03-01:02:04"
  },
  {
    "timestamp" : "01:02:05-01:02:08",
    "text" : "Was it? Okay. I think so. There's some rumors that he's not gonna be.",
    "speaker" : "Andy"
  },
  {
    "text" : "Well if he if that happens, then we have a new number one most unexpected.",
    "timestamp" : "01:02:09-01:02:13",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:02:14-01:02:15",
    "speaker" : "Andy",
    "text" : "This is true. This is true."
  },
  {
    "text" : "Cavernick coming out of retirement after like what five fucking years. It's ever being blackballed. Yeah, I'll put that atop the list for sure that'd be dope.",
    "speaker" : "Steve",
    "timestamp" : "01:02:16-01:02:23"
  },
  {
    "timestamp" : "01:02:23-01:02:37",
    "text" : "I'd love it. No, it wouldn't. It would be awful. It'd be it'd be great because we'd have to listen to sports analysts talk about like politics and you'd want to shoot yourself and you'd be like, God, just talk about sports for me once, please.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Why are you listening to people talk about sports crack?",
    "timestamp" : "01:02:37-01:02:39"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's that's your first problem.",
    "timestamp" : "01:02:39-01:02:41"
  },
  {
    "timestamp" : "01:02:42-01:02:56",
    "speaker" : "Steve",
    "text" : "That's why I don't listen to our podcast. Imagine if he's just wicked good too. That'd be amazing. Uh if he comes back and he just lights up the wild. It's just like two pictures."
  },
  {
    "speaker" : "Andy",
    "text" : "Fucking amazing. It's Brady versus Kaepernick in the NFC Championship.",
    "timestamp" : "01:02:56-01:03:01"
  },
  {
    "text" : "No, it's Robert Griffin the third versus Kaepernick.",
    "timestamp" : "01:03:01-01:03:04",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "No, have you seen RG3 lately?",
    "timestamp" : "01:03:06-01:03:07"
  },
  {
    "speaker" : "Andy",
    "text" : "Super Bowl. Did you see uh it was like RG3 and um Andrew Luck? I was at Super Bowl or something, or maybe oh maybe it was like um a college playoff football game or something. They were like commentators or something. There's a picture of them. Yeah. Andrew looks rough. Does he? Um looked ugly. He had the Greg Brown mustache though and he's lost like a shit ton of weight and he's just like all head now. He looks really good. Good for him. Let me see if I can. Yeah, let me see if I can share this.",
    "timestamp" : "01:03:09-01:03:44"
  },
  {
    "timestamp" : "01:03:44-01:03:48",
    "text" : "Oh, speaking of your mustache, Greg, I heard that you dyed it.",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh yeah, I tried.",
    "timestamp" : "01:03:48-01:03:50",
    "speaker" : "Greg"
  },
  {
    "text" : "What do you mean you tried?",
    "timestamp" : "01:03:51-01:03:53",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I well I got the um what whatever for men, the one you get the gray. Yeah, yep. And I did that. And it kind of worked, but not really. Robert Griffin III looking like a snack. Yeah.",
    "timestamp" : "01:03:53-01:04:09"
  },
  {
    "text" : "He looks like looking very well put together. Right.",
    "speaker" : "Andy",
    "timestamp" : "01:04:10-01:04:14"
  },
  {
    "text" : "Lost a lot of that football weight.",
    "timestamp" : "01:04:15-01:04:16",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:04:16-01:04:20",
    "text" : "He's lost a lot of weight. RG3 is looking real good though. Look at that man.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:04:20-01:04:21",
    "text" : "Wait, stress nuts.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:21-01:04:23",
    "text" : "That's a nice fitting suit."
  },
  {
    "text" : "Andy Luck looks like he's just like me. Not like he's going on national TV. Yeah.",
    "timestamp" : "01:04:23-01:04:31",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:04:31-01:04:33",
    "text" : "Well that's always been his thing, right?"
  },
  {
    "timestamp" : "01:04:33-01:04:46",
    "text" : "Andrew Luck looks looks like he didn't realize he was going on television that day. Like somebody so he's got like the uh the collared shirt on, but then like a jacket that's probably not his over it.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:04:47-01:04:47",
    "text" : "Yeah, I guess."
  },
  {
    "speaker" : "Andy",
    "text" : "And so someone's like, you should probably go, you sh like everybody else wearing a jacket. He's like, I don't have one. Can I borrow yours? And just like Chuck.",
    "timestamp" : "01:04:47-01:04:55"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:04:57-01:04:57",
    "text" : "Exactly."
  },
  {
    "timestamp" : "01:04:59-01:05:12",
    "text" : "I thought this was just like a casual thing. It's like no, this is like I love it. Do you give a shit? This is college playoffs for national television. You're going on ESPN. It's like, oh, oh, oh, okay. Can I borrow your jacket?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:13-01:05:16",
    "text" : "No, they're probably like, you need to wear jack. He's like, I do.",
    "speaker" : "Steve"
  },
  {
    "text" : "What?",
    "speaker" : "Greg",
    "timestamp" : "01:05:16-01:05:17"
  },
  {
    "text" : "His shirt's comfortable.",
    "timestamp" : "01:05:17-01:05:19",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:05:20-01:05:20",
    "text" : "And he's right."
  },
  {
    "text" : "Oh yeah. Fuck it. Spending an hour, you're looking like a snack. These classes or these glasses? Whatever floats your boat, you know, like I bet RG3 likes that shit.",
    "timestamp" : "01:05:21-01:05:34",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "And Andrew Luck doesn't.",
    "timestamp" : "01:05:34-01:05:36"
  },
  {
    "text" : "So let them dress how they want.",
    "speaker" : "Steve",
    "timestamp" : "01:05:36-01:05:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:37-01:05:38",
    "text" : "Correct."
  },
  {
    "timestamp" : "01:05:38-01:05:40",
    "speaker" : "Steve",
    "text" : "That's very understanding of you."
  },
  {
    "timestamp" : "01:05:40-01:05:41",
    "speaker" : "Greg",
    "text" : "Thanks, Steve."
  },
  {
    "speaker" : "Steve",
    "text" : "Especially for you.",
    "timestamp" : "01:05:42-01:05:43"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:44-01:05:45",
    "text" : "That look at that mustache."
  },
  {
    "timestamp" : "01:05:46-01:05:47",
    "speaker" : "Greg",
    "text" : "Yes, mustache is pretty sweet. Oof."
  },
  {
    "timestamp" : "01:05:48-01:05:56",
    "text" : "I had the five o'clock chat. How's he doing? Do we know what he's doing? How long did you have it dyed for? Did you dye it and it came out bad and you immediately shaved it off? Because you don't have it anymore.",
    "speaker" : "Steve"
  },
  {
    "text" : "See what the quote says there from RG3, Steve? Let's use words to build bridges, not walls. Okay. Steve, thank you very much. Look at me, I'm a bummer. You're just trying to deflect from your mustache, Greg.",
    "timestamp" : "01:05:57-01:06:09",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I know your fucking moves. Answer my question.",
    "timestamp" : "01:06:09-01:06:12"
  },
  {
    "text" : "What?",
    "timestamp" : "01:06:12-01:06:13",
    "speaker" : "Greg"
  },
  {
    "text" : "What give me more about the dying situation?",
    "timestamp" : "01:06:14-01:06:17",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I tried to dye it using the the old man gray beard shit.",
    "timestamp" : "01:06:17-01:06:23"
  },
  {
    "speaker" : "Steve",
    "text" : "And how did you not take photos of this and send it to the kids? Because it didn't really work.",
    "timestamp" : "01:06:22-01:06:26"
  },
  {
    "speaker" : "Greg",
    "text" : "It didn't like make it very dark. You didn't double down like that and get some pink? No, it's a whole process. You gotta like Do you gotta put the paint together, mix it, and then you paint your shit and then you gotta like ex at exactly five minutes wash it off. So it was this whole thing, and I was like, it didn't work, fuck it. And I threw it all away and then I shaved it the next day.",
    "timestamp" : "01:06:26-01:06:46"
  },
  {
    "text" : "Oh, it's typical.",
    "speaker" : "Andy",
    "timestamp" : "01:06:48-01:06:50"
  },
  {
    "speaker" : "Steve",
    "text" : "So who's paying the mortgage now?",
    "timestamp" : "01:06:50-01:06:52"
  },
  {
    "timestamp" : "01:06:52-01:06:54",
    "text" : "It's a good question. That's fair.",
    "speaker" : "Andy"
  },
  {
    "text" : "Stocks are going down. Yeah. The shareholders are very disappointing. Yeah. Didn't feel threatened anymore.",
    "speaker" : "Greg",
    "timestamp" : "01:06:57-01:07:10"
  },
  {
    "speaker" : "Andy",
    "text" : "In an unrelated note, Kelly now has an OnlyFans where she takes pictures of her feet. So if you're a foot guy. Only at onlyfans. com slash Kelly's Kelly Brown's feet.",
    "timestamp" : "01:07:10-01:07:27"
  },
  {
    "text" : "I have very delicate feet. Not a chip.",
    "timestamp" : "01:07:32-01:07:34",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:07:34-01:07:36",
    "speaker" : "Steve",
    "text" : "Disgusting feet, Greg. Your feet are gross."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:07:37-01:07:37",
    "text" : "No, they're not."
  },
  {
    "timestamp" : "01:07:40-01:08:01",
    "speaker" : "Steve",
    "text" : "She just got a digital camera. And you had this gigantic patch of dead skin on the ball of your foot. And you took a color pencil, put it through one end, slid it under and poked it out the other end, and then took a picture of it. Yeah. Is that what like the whole found out later when she was going through her photos of like her time at our house and was like, what the fuck is this?"
  },
  {
    "speaker" : "Andy",
    "text" : "Is that what like the whole like The skin on the entire ball of foot comes loose? Yeah. Yeah. I've had that. That shit's kind of sketched. It's awful. Yeah. I've had it a few times. Indoor soccer is what does it.",
    "timestamp" : "01:08:01-01:08:11"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:12-01:08:12",
    "text" : "Never had it."
  },
  {
    "text" : "Fucking shitty turf.",
    "speaker" : "Andy",
    "timestamp" : "01:08:12-01:08:14"
  },
  {
    "timestamp" : "01:08:14-01:08:18",
    "speaker" : "Steve",
    "text" : "Yeah, I don't get that anymore. I've seen it. Because I saw that picture."
  },
  {
    "text" : "It's awful.",
    "timestamp" : "01:08:18-01:08:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Well apparently you can put a colored pencil through it, so that's cool.",
    "timestamp" : "01:08:20-01:08:23"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh you definitely could. Uh usually you have to drain it too, which is also a good time.",
    "timestamp" : "01:08:23-01:08:27"
  },
  {
    "text" : "Maybe that's why Greg had the colored pencil in the first place.",
    "timestamp" : "01:08:27-01:08:30",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Could be. Yeah, pop it.",
    "timestamp" : "01:08:30-01:08:31"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:08:31-01:08:48",
    "text" : "There's another video out there where it's like there was a flap coming off of it and I drew a little smiley face under the flaps in this video where it's like Peekaboo, Peekaboo with a smiley face. Just a dead skin peekaboo bummer."
  },
  {
    "timestamp" : "01:08:48-01:08:51",
    "speaker" : "Steve",
    "text" : "You're just fucking a weird dude, Greg."
  },
  {
    "text" : "That one was cool. All right. Okay. On that note, I think I think we've we've driven this into the ground. Give me your best and worst. Four. 2004, week 13. The blowout in Cleveland. The blowout by the bay. I don't know. Is there a bay in Cleveland? I'll go with it. The blowout in the browns. The browns blowout? Yeah. So the brown out. The brown out.",
    "timestamp" : "01:08:52-01:09:19",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:09:20-01:09:22",
    "speaker" : "Greg",
    "text" : "I'm just going to give you my best and worst from free agency."
  },
  {
    "timestamp" : "01:09:22-01:09:25",
    "text" : "I figured. That's why that's why you're going first.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "All right. I'll go first. Oh, of course. All right. My best Jacoby Myers re-signing with the Pats. That's my dude. Has he? Yeah.",
    "timestamp" : "01:09:25-01:09:36"
  },
  {
    "timestamp" : "01:09:36-01:09:38",
    "speaker" : "Steve",
    "text" : "That was a remote official assigned as tender."
  },
  {
    "timestamp" : "01:09:39-01:09:48",
    "speaker" : "Greg",
    "text" : "Oh okay. Beautiful. Yeah, when you deal. Love it He's the fucking man NC State product. Okay. Does the dirty work. I'm his big."
  },
  {
    "timestamp" : "01:09:48-01:09:50",
    "text" : "Even though you're a big Jacobis stand.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh yeah, I am a Jacobist stan. Gotta be You don't have to just like make it one word. You know that, right? Steve?",
    "timestamp" : "01:09:50-01:09:58",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I know. I like that.",
    "timestamp" : "01:09:58-01:09:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay, all right.",
    "timestamp" : "01:09:59-01:10:00"
  },
  {
    "timestamp" : "01:10:00-01:10:01",
    "speaker" : "Andy",
    "text" : "You do realize every time you say it's like."
  },
  {
    "speaker" : "Greg",
    "text" : "It sounds like a country this way. It sounds like Afghanistan, exactly.",
    "timestamp" : "01:10:01-01:10:04"
  },
  {
    "text" : "Cooler. All like the cutting-edge k-poppers are doing it.",
    "speaker" : "Steve",
    "timestamp" : "01:10:05-01:10:09"
  },
  {
    "timestamp" : "01:10:08-01:10:10",
    "speaker" : "Greg",
    "text" : "Can you name all the stands, Steve?"
  },
  {
    "timestamp" : "01:10:11-01:10:14",
    "text" : "Uh Stan Van Gundy? Afghanistan?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh-huh.",
    "timestamp" : "01:10:15-01:10:15"
  },
  {
    "text" : "Stan van Gundy.",
    "timestamp" : "01:10:15-01:10:17",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Stan from South Park. Stan that MM song.",
    "timestamp" : "01:10:18-01:10:23"
  },
  {
    "text" : "All right, what's your worst, Greg?",
    "timestamp" : "01:10:26-01:10:27",
    "speaker" : "Steve"
  },
  {
    "text" : "Well, I one more thing about like fans being names and stuff. Did you ever hear when uh Justin Bieber visited Ann Frank's house and he wrote in the guest book? I would have liked to think that Anne Frank would be a believer. Like about tough luck.",
    "speaker" : "Greg",
    "timestamp" : "01:10:28-01:10:44"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:10:46-01:10:50",
    "text" : "I mean she was probably I mean in his defense she's right in his demographic wheelhouse."
  },
  {
    "text" : "Yeah, oh yeah. And he was like thirteen at the time, so it's like I'll give him a break.",
    "timestamp" : "01:10:51-01:10:54",
    "speaker" : "Greg"
  },
  {
    "text" : "I think Kim Kardashian talking about how people need to work harder. probably more of a bigger balance stuff.",
    "speaker" : "Andy",
    "timestamp" : "01:10:54-01:11:01"
  },
  {
    "text" : "Yeah. Carter, make more sex tapes. Come on, people. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:11:01-01:11:04"
  },
  {
    "timestamp" : "01:11:06-01:11:12",
    "speaker" : "Greg",
    "text" : "All right. My worst is Aaron Rodgers putting us through all this crap just to stay where he is."
  },
  {
    "speaker" : "Andy",
    "text" : "And sign a massive fucking contract when he says all he wants to do is win.",
    "timestamp" : "01:11:13-01:11:16"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:11:16-01:11:17",
    "text" : "Yeah, oh yeah."
  },
  {
    "timestamp" : "01:11:17-01:11:18",
    "text" : "Yeah and it's not about the money.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:11:19-01:11:26",
    "text" : "And apparently he knew about Devontae Adams before he signed the deal, too. So like, okay, dude. What happened to this whole like I want to like"
  },
  {
    "text" : "Yeah, keep the team together.",
    "timestamp" : "01:11:27-01:11:28",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:28-01:11:33",
    "speaker" : "Greg",
    "text" : "Yeah, run it back. Yeah. Oops. Dude, he's a he's a dumbass."
  },
  {
    "text" : "What happens with Jordan Love? Yeah, they're gonna trade him, I think. He's still there.",
    "timestamp" : "01:11:33-01:11:39",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:11:40-01:11:41",
    "speaker" : "Greg",
    "text" : "Jordan Love to the Seahawks."
  },
  {
    "timestamp" : "01:11:41-01:11:43",
    "text" : "Wow. Grapple of two points.",
    "speaker" : "Steve"
  },
  {
    "text" : "There's an idea. Jordan Love, where does he go? Seahawks.",
    "speaker" : "Greg",
    "timestamp" : "01:11:43-01:11:46"
  },
  {
    "text" : "Seahawks. 49ers. No, they're got Kyle and Kaepernick. Buccaneer Buccaneers. And the Bucs trade Brady to the 49ers. See, that's what I thought.",
    "speaker" : "Andy",
    "timestamp" : "01:11:47-01:11:57"
  },
  {
    "speaker" : "Greg",
    "text" : "I had heard that that Brady was wanted to sneak back into San Francisco and the Gronk where he's like fake retirement and then get leverage to trade him.",
    "timestamp" : "01:11:57-01:12:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. I mean it might still happen. That'd be cool.",
    "timestamp" : "01:12:08-01:12:11"
  },
  {
    "text" : "I I I would much rather for San Francisco.",
    "speaker" : "Greg",
    "timestamp" : "01:12:12-01:12:16"
  },
  {
    "text" : "I'd much rather Tom Brady come back and play for a different team than Run it back with the d with the bucks. Like I don't give a fuck about the bucks anymore. Like he d he's done that. I don't think he does either. And Arians is a garbage coach.",
    "timestamp" : "01:12:16-01:12:27",
    "speaker" : "Andy"
  },
  {
    "text" : "And if you get rid of if you trade Jimmy, you give Trey Lance another year because it sounds like he's still pretty raw. And then you give Brady a chance to play in front of his His hometown. Like that seems like a win-win-win.",
    "timestamp" : "01:12:27-01:12:41",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:12:41-01:12:42",
    "speaker" : "Andy"
  },
  {
    "text" : "When make it happen. And then Jordan Love to the Bucks with Baker Mayfield backing him up. It's QB competition, Greg. I want Baker to go to Detroit because I think they just fit from a personality standpoint.",
    "timestamp" : "01:12:43-01:12:58",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:12:58-01:13:05",
    "speaker" : "Andy",
    "text" : "That feels right actually. Yeah, with the Fuck you tour and like it's the name Dan Williams or something as a as the head coach there. Dan Quinn."
  },
  {
    "speaker" : "Greg",
    "text" : "Dan Quinn my chin kneecaps off. That's exactly he'd probably love them too. Oh yeah. Yeah Oh yeah, the whole state of Michigan would love him. It's Dan Campbell, though. Dan Quinn's a guy from the Falcon. That's Dan Campbell.",
    "timestamp" : "01:13:06-01:13:17"
  },
  {
    "timestamp" : "01:13:17-01:13:30",
    "speaker" : "Steve",
    "text" : "All right, Steve, give me your best and worst. My worst is Dylan's fumble where he like got brushed by one guy's index finger and fumbled it. Yeah, it was tough look. Super soft for such a Hard runner."
  },
  {
    "timestamp" : "01:13:31-01:13:38",
    "speaker" : "Andy",
    "text" : "It happened it happens every once in a while. Like we've I've seen more fumbles this season from Corey Dillon, I remember. Like he's put the ball on the ground a few times."
  },
  {
    "timestamp" : "01:13:39-01:13:43",
    "speaker" : "Steve",
    "text" : "Is at one point Josh McCown had no Luke McCown."
  },
  {
    "text" : "Luke. Luke.",
    "speaker" : "Andy",
    "timestamp" : "01:13:43-01:13:45"
  },
  {
    "speaker" : "Steve",
    "text" : "Had one completion to each team.",
    "timestamp" : "01:13:45-01:13:47"
  },
  {
    "text" : "I am your father.",
    "speaker" : "Andy",
    "timestamp" : "01:13:47-01:13:48"
  },
  {
    "timestamp" : "01:13:48-01:13:51",
    "text" : "His first two completions, he's really spreading the ball around the whole time.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, speaking of spreading the ball around, um This isn't my best, it's just a stat. Uh they showed a picture of um the receivers for the Patriots this season. Um any guesses on who the leading receiver is so far this year? I was a little surprised. I saw this guy. David Patton. No, he is number two. 31 catches, 556 yards.",
    "timestamp" : "01:13:53-01:14:20"
  },
  {
    "timestamp" : "01:14:20-01:14:22",
    "speaker" : "Steve",
    "text" : "The Ombranch."
  },
  {
    "text" : "He is two, three, four, fifth with nineteen catch, two sixty two yards, because he's been hurt for a few weeks. Daniel Graham this week. Daniel Graham is third, 24 catches, 296. Kevin Falk. Fourth, 23 catches, 200 yards even.",
    "timestamp" : "01:14:22-01:14:36",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Givens.",
    "timestamp" : "01:14:38-01:14:38"
  },
  {
    "timestamp" : "01:14:38-01:14:49",
    "text" : "Givens is number one, 50 catches, 760 yards so far in the season. I think Dion Branch makes a comeback. But 50 catches already on the season. From 60?",
    "speaker" : "Andy"
  },
  {
    "text" : "From Louis.",
    "speaker" : "Greg",
    "timestamp" : "01:14:49-01:14:50"
  },
  {
    "timestamp" : "01:14:51-01:14:53",
    "speaker" : "Andy",
    "text" : "Notre Dame. Givens? He's from Notre Dame."
  },
  {
    "text" : "I was thinking Branch.",
    "speaker" : "Greg",
    "timestamp" : "01:14:53-01:14:54"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, Branch from Louis. Troy Brown from Renown. From Marshall. Marshall. Same as uh so what I I've decided I'm gonna do I'm gonna try our damnedest to get Troy Brown on the podcast by the end of this season. Which is probably gonna be like 2026. 2026 by the time that this this season ends, by the way that we're losing episodes. But Yeah. So uh and I want to ask him if he had anything to do with uh Randy Moss coming to New England because they both went to Marshall.",
    "timestamp" : "01:14:54-01:15:32"
  },
  {
    "timestamp" : "01:15:33-01:15:37",
    "speaker" : "Steve",
    "text" : "Well obviously you want Troy Brown. I thought that's the whole point of this thing was get Troy Brown on."
  },
  {
    "text" : "Yeah, but I I'm putting a concerted effort into like actually making this happen instead of the thing. Yeah, well I'm all the people that we've talked to be like, oh yeah, I I talk to Raven once a while. I'm gonna hound them until they actually reach out to them. Well it's gonna be impossible.",
    "timestamp" : "01:15:38-01:15:53",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:15:53-01:15:57",
    "speaker" : "Greg",
    "text" : "You know what they say, Andy? It's not who you know, it's who you blow."
  },
  {
    "speaker" : "Andy",
    "text" : "Well, you'll be back at some point, Craig. So I'll uh I'll just coordinate that with you.",
    "timestamp" : "01:15:59-01:16:03"
  },
  {
    "speaker" : "Greg",
    "text" : "Is that why you had to get rid of the mustache? Hey, this is my joke. Let's not turn this around, okay?",
    "timestamp" : "01:16:04-01:16:11"
  },
  {
    "timestamp" : "01:16:12-01:16:24",
    "text" : "Too late. Oh, and just to round out the the the um rest of the receivers after De'An Branch, Troy Brown, 13 catches, 145. Patrick passed the fullback, 11 catches, 103 yards.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Ten yards a catch. Patrick Passwell's legit.",
    "timestamp" : "01:16:24-01:16:27"
  },
  {
    "timestamp" : "01:16:28-01:16:39",
    "speaker" : "Andy",
    "text" : "He's not too shabby. So my best is Troy Brown had an interception this game. My worst is that I didn't watch long enough to see it. So I'm gonna have to go back and finish watching this game. Stupid fucking blow up."
  },
  {
    "text" : "So it was a punt return. You know, one of those ones where the guy just throws a straight up and he just like Oh yeah. Fuck his lap. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:16:40-01:16:46"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:16:47-01:16:50",
    "text" : "Hey, interceptions inception. And who better to catch a punt return?"
  },
  {
    "text" : "Exactly. That's a good point.",
    "timestamp" : "01:16:50-01:16:52",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Than Troy Brown. Am I right? You're right. You're right. Then Troy Fitzgerald Brown.",
    "timestamp" : "01:16:52-01:17:03"
  },
  {
    "timestamp" : "01:17:04-01:17:10",
    "speaker" : "Steve",
    "text" : "Oh, also Andy, you really missed an opportunity in not naming your son Chadwick Pennington Brown."
  },
  {
    "speaker" : "Andy",
    "text" : "Why would I name him after Chad Bennington?",
    "timestamp" : "01:17:10-01:17:12"
  },
  {
    "text" : "Because the Chad Pennington was legit. We've talked about this all.",
    "speaker" : "Steve",
    "timestamp" : "01:17:12-01:17:15"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but I'm not naming my kid after Chad Pennington I'm not naming my kid after a jet. That's fucked up. I'm so I am I am not a big I'm offended. He is the reason The pages missed the playoffs those two those two years. The only time the pages have missed the playoffs is because of It's out of respect. Nope. That's fucked up Steven. I may as well name him Adolf Hitler out of respect because fucking I don't know. Like that's just stupid. Because he was such a good foe in World War II.",
    "timestamp" : "01:17:15-01:17:45"
  },
  {
    "speaker" : "Steve",
    "text" : "Okay, so now Chad Pennington is all pillar for me.",
    "timestamp" : "01:17:46-01:17:49"
  },
  {
    "timestamp" : "01:17:52-01:18:03",
    "text" : "I will say I did fight hard for I did fight hard for Troy is at least a middle name, but Didn't happen. So it's tough.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yes. I'm naming my kid Genghis Khan. Brown.",
    "timestamp" : "01:18:04-01:18:08",
    "speaker" : "Greg"
  },
  {
    "text" : "You gotta use my middle name idea. Rice Pilaff? What is it? What's your middle name? What? You make their middle name, what's your middle name? So then when the kid is in elementary school and gets asked, what's your middle name? They say, What's your middle name? And they say my middle name is David, what's your middle name? He goes, what's your middle name? They go, I know. I just told you my middle name.",
    "timestamp" : "01:18:10-01:18:32",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:18:33-01:18:37",
    "speaker" : "Greg",
    "text" : "What about if it was just like who? Yeah. What's your middle name? Who?"
  },
  {
    "timestamp" : "01:18:37-01:18:42",
    "speaker" : "Steve",
    "text" : "I also thought about shades of brown like nut, hazel, light, or dark."
  },
  {
    "speaker" : "Andy",
    "text" : "Poopy.",
    "timestamp" : "01:18:43-01:18:44"
  },
  {
    "timestamp" : "01:18:44-01:18:45",
    "speaker" : "Steve",
    "text" : "Yeah"
  },
  {
    "speaker" : "Andy",
    "text" : "Gerald Poopy Brown. Oak. Uh all right. Do you guys have any other uh anything else you'd like to talk about?",
    "timestamp" : "01:18:46-01:18:55"
  },
  {
    "text" : "Yeah, go uh US men watch them tonight, 10 p. m.",
    "timestamp" : "01:18:55-01:18:58",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:18:59-01:18:59",
    "speaker" : "Andy",
    "text" : "Yeah, yeah."
  },
  {
    "text" : "All right.",
    "timestamp" : "01:18:59-01:19:00",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "01:19:00-01:19:01"
  },
  {
    "timestamp" : "01:19:01-01:19:04",
    "text" : "I accidentally ate tacos for dinner. I fucking blew it.",
    "speaker" : "Greg"
  },
  {
    "text" : "Craig. So then it's your fault. But Italy's out of the World Cup 'cause they lost the North Macedonia. Correct. So there's your soccer talk for the day.",
    "speaker" : "Andy",
    "timestamp" : "01:19:04-01:19:13"
  },
  {
    "speaker" : "Greg",
    "text" : "Yep. All right, next week. So much better than South Macedonia. Oh fuck South Macedonia. Worst. Why would you call your team why your country North Macedonia? There's no There's no south. There's no east and the west. Right? Yeah, just like West Virginian. Idiots, dude",
    "timestamp" : "01:19:14-01:19:33"
  },
  {
    "text" : "Not only not only Virginia's at least got Virginia. But yeah, but you don't name a whole nother state West Virginia. Because it's not like there's an East Virginia. It's just Virginia. But you need to distinguish it from Virginia. But Virginia already has a West. So what if you're in Western Virginia and then you cross the border to West Virginia? That's fucking confusing. And there's not enough schools in either of those states for that to that to work at all. Their their educational funding is horrible.",
    "timestamp" : "01:19:34-01:20:02",
    "speaker" : "Andy"
  },
  {
    "text" : "How do you know that?",
    "speaker" : "Greg",
    "timestamp" : "01:20:03-01:20:04"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, what do you mean? What Northern Virginia has like one of the richest zip codes in the entire country.",
    "timestamp" : "01:20:04-01:20:09"
  },
  {
    "timestamp" : "01:20:09-01:20:15",
    "speaker" : "Greg",
    "text" : "And Western Virginia. I'm talking West Virginia. One of the highest drug overdoses. Exactly."
  },
  {
    "speaker" : "Andy",
    "text" : "The highest, the highest methamphetamine use per capita in the country. No, no. No, that's Manchester Hampshire. That's Manchester. Manchester has the myth. No, we have uh Methcester? No, what's the Manchester hair? What's the hairy like animal?",
    "timestamp" : "01:20:16-01:20:39"
  },
  {
    "speaker" : "Steve",
    "text" : "I know what it is, Andy. You're talking about Manchganistan?",
    "timestamp" : "01:20:40-01:20:42"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm actually talking about Manchester Vegas, thank you very much, but yes.",
    "timestamp" : "01:20:44-01:20:47"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:20:47-01:20:49",
    "text" : "Oh no, it is not a good idea."
  },
  {
    "speaker" : "Andy",
    "text" : "Fentanyl. Fentanyl.",
    "timestamp" : "01:20:55-01:20:56"
  },
  {
    "speaker" : "Greg",
    "text" : "Fentanyl, same thing.",
    "timestamp" : "01:20:56-01:20:57"
  },
  {
    "text" : "Yeah, we're the highest fentanyl overdose per capita.",
    "timestamp" : "01:20:57-01:21:00",
    "speaker" : "Andy"
  },
  {
    "text" : "Thanks a lot, Sacklers. Yeah, fucking fentanyls.",
    "timestamp" : "01:21:00-01:21:03",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:21:03-01:21:07",
    "text" : "Yeah. At least they get to keep their money though, huh?",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:21:07-01:21:07"
  },
  {
    "timestamp" : "01:21:08-01:21:13",
    "speaker" : "Andy",
    "text" : "Speaking of keeping their money, uh Page is playing with house money. They're now 11 and 1."
  },
  {
    "text" : "Next week they are gonna make a free agency joke. That would have been where it was at. Yeah, well I should have.",
    "timestamp" : "01:21:13-01:21:18",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm trying to bring it back to 2004 because we haven't talked much about that this week. And our our listener is going to be pissed all one of the we talked about the Browns for a good bit. We did a little bit. But uh that blowout, that uh shootout win, Cincinnati Bengals winners of that, come to Foxboro. To play the New England Patriots. So we'll see we get both teams back to back and we'll see if they can fare better than the Cleveland Browns, who brown themselves. Right, Greg? Brown their pants.",
    "timestamp" : "01:21:20-01:21:47"
  },
  {
    "text" : "What's the receiver's name?",
    "timestamp" : "01:21:47-01:21:49",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oshosinko?",
    "timestamp" : "01:21:49-01:21:50"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:21:51-01:21:56",
    "text" : "No, the other guy there. Marshall. Ush Mizou."
  },
  {
    "timestamp" : "01:21:57-01:21:58",
    "speaker" : "Andy",
    "text" : "Ush Mizou."
  },
  {
    "timestamp" : "01:21:59-01:22:01",
    "text" : "This is the call. Who's your mama?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:22:01-01:22:05",
    "speaker" : "Andy",
    "text" : "Corey Dylan's revenge game. Oh, this is a Corey Dylan revenge game."
  },
  {
    "timestamp" : "01:22:05-01:22:05",
    "speaker" : "Steve",
    "text" : "Yep."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:22:05-01:22:16",
    "text" : "So we'll see how that works out next week on the The Patriots Dynasty Podcast. TJ Mazoo. Who's your mama?"
  }
]