[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom"
  },
  {
    "text" : "Welcome back to the Pages Fantasy Podcast, where we are going back and re-watching every game. of the Patriots dynasty era starting 2001. This week we are up to 2000 season 2004, week 12. The Patriots at home against the Baltimore Ravens in uh neck deep in mud. Nice and rainy and muddy and gross. So speaking of muddy and gross, uh with me today, I'm your host, Andy Brown. With me today are both my brothers, Steve Brown, who is feeling uh muddy in the butt area, I think. My butt's variety, yes, yes. Not feeling my best, but I'm here. And uh and Greg Brown as well, who is uh muddy in the upper lip area at the moment.",
    "timestamp" : "00:22-01:10",
    "speaker" : "Andy"
  },
  {
    "text" : "That's right. That is also true.",
    "speaker" : "Greg",
    "timestamp" : "01:10-01:12"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Quite a mustache. Dgusting mustache. But Greg's like a blonde mud. I don't know if that's a thing.",
    "timestamp" : "01:12-01:17"
  },
  {
    "text" : "Yeah, let's be clear. This mud on my mustache is not the same as the mud from Steve's butt. I want that on the record. Noted.",
    "timestamp" : "01:18-01:29",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, yeah. All right. Um, but before we get into the game, I think we should address the elephant in the room. Uh we actually got a review of the podcast from somebody we do not know. Uh from Brion P, user. Um Titled Enjoyable But Needs to Focus on Pats More or Patriots More. And so I quote, this podcast is enjoyable, but has a lot of random rambling, which I think has been proven true already. It would be so much better if the host could focus on the game and Patriots. For example, I'm not very interested in what they are having for dinner or references from their past. If they can focus on the past, it would be so much better. So I, being the eldest brother and the one who likes to please people, will be focusing more on the game. Greg, the youngest brother. We'll be doing the exact opposite. So you can expect to hear more of the game from me and more of what Greg had for dinner, I think, going forward.",
    "speaker" : "Andy",
    "timestamp" : "01:32-02:35"
  },
  {
    "speaker" : "Steve",
    "text" : "See, I as the middle brother agree with both sides, this guy's points. Some I disagree with. I too don't want to hear what Greg says for dinner.",
    "timestamp" : "02:36-02:44"
  },
  {
    "timestamp" : "02:44-02:45",
    "speaker" : "Andy",
    "text" : "Fair."
  },
  {
    "timestamp" : "02:45-02:46",
    "speaker" : "Steve",
    "text" : "Why are you eating on the podcast, Greg?"
  },
  {
    "text" : "Yeah, that's a dick move, Greg.",
    "timestamp" : "02:47-02:48",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "02:48-03:01",
    "text" : "Because it's during dinner time. I ate I ate a nice big plate full of China food. Shout out Eddie Lacey. What about that? You know, mix in a little retro football reference.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "But yes, that's the other part I disagree with. Not talking about our past. The whole point of doing this podcast is to bullshit with you guys.",
    "timestamp" : "03:01-03:07"
  },
  {
    "speaker" : "Andy",
    "text" : "I agree. I I think I think we have to talk about. our past because our past is tied into these these football games. So you'll probably hear more of that as well. But we will talk about it.",
    "timestamp" : "03:07-03:18"
  },
  {
    "text" : "Also sometimes like football's boring. You know? I get bored. Like I want to talk about other things sometimes. What's on your mind, Greg? I don't know.",
    "speaker" : "Greg",
    "timestamp" : "03:18-03:28"
  },
  {
    "text" : "It's just like have you ever tried HD medication or football's awesome, right?",
    "timestamp" : "03:28-03:33",
    "speaker" : "Steve"
  },
  {
    "text" : "Everybody loves football. Sometimes football can be boring.",
    "timestamp" : "03:33-03:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I agree. Uh speaking of which, the second half of this game, if you're going to find it and watch it, don't watch, well, watch the third quarter. Actually, I would just watch the third quarter of this game. The Mud Bowl. Yeah. This was uh this was a game that uh they actually had a a shot, which I've sent you two in the chat. of um a literal um wooden ruler stuck in the mud. And I believe it is at Up to two inches.",
    "timestamp" : "03:36-04:09"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "04:10-04:10",
    "text" : "Yes."
  },
  {
    "timestamp" : "04:10-04:12",
    "speaker" : "Andy",
    "text" : "Closing it on two and a half."
  },
  {
    "timestamp" : "04:12-04:13",
    "speaker" : "Greg",
    "text" : "It's a stick in the in the mud."
  },
  {
    "timestamp" : "04:14-04:14",
    "speaker" : "Andy",
    "text" : "Yeah. Literally."
  },
  {
    "timestamp" : "04:15-04:17",
    "text" : "Literally a stick in the mud. Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "It's the photo representation of uh your role in this podcast.",
    "timestamp" : "04:18-04:22"
  },
  {
    "timestamp" : "04:23-04:32",
    "speaker" : "Greg",
    "text" : "So what you're telling me is if Steve tried to bang the field, his pants would just about be touching the feet."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "04:33-04:36",
    "text" : "Fun fact you can see that ruler on the primetime highlights."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh really? They show up. That's right. So we will link the we'll link the primetime highlights.",
    "timestamp" : "04:36-04:41"
  },
  {
    "speaker" : "Steve",
    "text" : "And I'm glad I only watched the primetime highlights. Mostly because I've been sick, but also this looked like a super boring game.",
    "timestamp" : "04:41-04:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I I did watch this whole thing. Um I finished it today. Yep. I had to get back in the style. It's been a while because of um the new addition to my family, but Uh it was nice to watch old school football again. And there's nothing more old school than the 7-3 Ravens visiting the 9-1 Patriots on Sunday night. in the rain, in the mud. Went back when they still had like actual grass fields, which was nice. But if you take a look at some of the shots of this this game, literally the between the hashes, the entire field is just brown. like browner than you know our reunions.",
    "timestamp" : "04:47-05:26"
  },
  {
    "speaker" : "Steve",
    "text" : "Again, really glad I didn't watch it considering I've been sick all week.",
    "timestamp" : "05:26-05:29"
  },
  {
    "timestamp" : "05:29-05:50",
    "speaker" : "Andy",
    "text" : "Yeah. Um and The I don't know if this game in the first half or second half, but um one of the stats they put up, I believe it was the second half when the Patriots started running away with it, because the at halftime it was 3-3. So again, didn't miss anything in the first half. Unless you like unless you like defensive battles. Greg, are you a defensive battles kind of guy?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, it depends. Sometimes I like them. All right.",
    "timestamp" : "05:50-05:53"
  },
  {
    "text" : "Because I mean this is this is the Ray Lewis.",
    "speaker" : "Andy",
    "timestamp" : "05:53-05:54"
  },
  {
    "text" : "Yeah, they're two good defenses though, so that's basically kind of enticing.",
    "timestamp" : "05:55-05:58",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Ed Reed on this, like early Ed Reed. Literally that there's one play where he takes on Corey Dillon head to head in open field. And wins that battle, which I don't think happens very often.",
    "timestamp" : "05:58-06:09"
  },
  {
    "text" : "Not this year.",
    "timestamp" : "06:09-06:10",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "06:10-06:10",
    "speaker" : "Andy",
    "text" : "No."
  },
  {
    "timestamp" : "06:11-06:24",
    "speaker" : "Greg",
    "text" : "So. I remember Ed Reed at uh Miami. That was my first memory because it I think he had a big play against Boston College where he like Scooped and scored when Boston College was good."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, yeah. The last time they were good. Yeah, wasn't that that uh William Green year?",
    "timestamp" : "06:24-06:33"
  },
  {
    "text" : "Remember that guy was in the Heisman running?",
    "timestamp" : "06:33-06:36",
    "speaker" : "Greg"
  },
  {
    "text" : "Vaguely, yeah. Yes. The running.",
    "timestamp" : "06:37-06:38",
    "speaker" : "Andy"
  },
  {
    "text" : "He was a beast.",
    "timestamp" : "06:39-06:39",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:39-06:43",
    "text" : "Wasn't Miami good that year though? Yeah, 2001. Weren't they good that year?"
  },
  {
    "timestamp" : "06:43-06:49",
    "text" : "Yeah, they were ranked. No.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, the uh the Hurricanes were the 2001 national championship game. Yeah. And then I think there was like a bunch of good players on that team as well. Yeah. Indianapolis Colts wide receiver Reggie Wayne and Ed Reed were roommates during their time at U Miami.",
    "timestamp" : "06:50-07:07"
  },
  {
    "speaker" : "Steve",
    "text" : "Didn't they say they're gonna make or they made a 30 for 30 about that team?",
    "timestamp" : "07:07-07:11"
  },
  {
    "timestamp" : "07:11-07:12",
    "speaker" : "Andy",
    "text" : "Was it that team?"
  },
  {
    "text" : "I know there was Yeah, someone with Vince Bulfork and Tom.",
    "speaker" : "Steve",
    "timestamp" : "07:12-07:15"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:15-07:28",
    "text" : "Uh you don't Right. I don't think Vince Woolfork overlapped. I think I looked that up and they missed by like a year or or so. Really? But yeah, I think that team was uh pretty stacked."
  },
  {
    "text" : "There is one uh Miami team that had like across three different years or something, they had like 27 first round picks or something that were all yeah on like one roster. That's insane.",
    "speaker" : "Greg",
    "timestamp" : "07:28-07:42"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Ed Reed set uh several records during his time at the University of Miami, holds the record for career interceptions with 21 as a safety. Career interception return yards was 389 and interceptions return for touchdowns with five. He also blocked four punts during his four-year career. He was also a member of the track and field team. That was a big East champion in the javelin. Jesus, can you imagine Ed Reed chucking a javelin at you? That's some scary shit.",
    "timestamp" : "07:42-08:09"
  },
  {
    "text" : "Oh, here we go. Ed Reed.",
    "speaker" : "Greg",
    "timestamp" : "08:10-08:11"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:11-08:12",
    "text" : "What?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "08:13-08:20",
    "text" : "They are. They're why 2001 University of Miami is the best team ever. Okay."
  },
  {
    "speaker" : "Andy",
    "text" : "Is that the 30 for 30 or",
    "timestamp" : "08:21-08:23"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:23-08:25",
    "text" : "I don't know if they actually made that or not."
  },
  {
    "timestamp" : "08:25-08:39",
    "speaker" : "Andy",
    "text" : "Reading an article should. No, yeah, I feel like there was one for some team of that era. Maybe it wasn't the Florida team with um Tim Thibault and Aaron Hernandez on it. No. I thought they made a 30 for 30 about that team. I don't know."
  },
  {
    "timestamp" : "08:39-08:43",
    "text" : "I haven't seen it. Okay, here we go. You want to hear these draft picks? Yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "Let's go, stat check boy.",
    "timestamp" : "08:43-08:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay. This is all in one roster. We have Andre Johnson, third overall, Sean Taylor, fifth overall, Kellen Winslow, sixth overall, Bryant McKinney, seventh overall, intro role, eighth, Jonathan Vilmouth, twelfth, Jeremy Shockey, 14th. Jerome McDougal 15th, Philip Buchanan, 17th, DJ Williams, 18th, Vernon Carey, 19th, Vince Wolfort, 21st, Willis McGahey, 23rd, Ed Reed, 24th. William Joseph, 25th, Mike Rumpf, 27th, and Kelly Jennings, 31st. That's crazy. 38 players went to the NFL. 17 picked in the first round of the draft. Oh.",
    "timestamp" : "08:45-09:28"
  },
  {
    "speaker" : "Andy",
    "text" : "Over how many years?",
    "timestamp" : "09:29-09:30"
  },
  {
    "text" : "All on this one roster, right? So they got in the same year, but yeah. Good lord. I mean it's a quarter of the draft for and also Clinton Portis and Frank Gore were on those teams. They just weren't high draft. What the hell?",
    "speaker" : "Greg",
    "timestamp" : "09:32-09:48"
  },
  {
    "text" : "Unbelievable. Who picked Jonathan Villman? The Jets?",
    "timestamp" : "09:49-09:53",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I think so.",
    "timestamp" : "09:53-09:54"
  },
  {
    "speaker" : "Steve",
    "text" : "He was like the worst of that list when you started it too, you know?",
    "timestamp" : "09:54-09:57"
  },
  {
    "timestamp" : "09:57-10:02",
    "text" : "Yeah, yeah. And I don't think he was great on the Jets, but I think it more because it was the Jets than anything.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "10:02-10:03",
    "speaker" : "Steve",
    "text" : "Yep."
  },
  {
    "speaker" : "Andy",
    "text" : "That's right. Yeah. Yeah, we know. Um, so as good as this Baltimore Ravens defense was. I just want to read you the offensive leaders of this team. They ranked sixth in the league on defense and 20th on offense. And the fact that they were 20th, I think is going to be a shock to you. Quarterback Kyle Bowler, who I believe was a rookie this year, or maybe it was his second, it was his first year starting, threw 13 touchdowns, 11 interceptions all season. Uh Jamal Lewis was running back who I believe was injured in this game. So didn't play much, if at all. Had just over a thousand yards and seven touchdowns. And they're top two wide receivers, top two. Uh Travis Taylor, ever heard of him? Nope. Nope. That's because he he led the team with 421 yards and zero touchdowns.",
    "timestamp" : "10:06-10:57"
  },
  {
    "text" : "Oh.",
    "timestamp" : "10:58-10:58",
    "speaker" : "Greg"
  },
  {
    "text" : "And the other wide receiver, Clarence Moore. Ever heard of him?",
    "timestamp" : "10:58-11:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "11:01-11:02",
    "text" : "Nope.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "11:02-11:07",
    "speaker" : "Andy",
    "text" : "Nope. You know why? Because uh he was second on the team, 293 receiving yards and four touchdowns."
  },
  {
    "timestamp" : "11:07-11:09",
    "speaker" : "Greg",
    "text" : "So throw the ball?"
  },
  {
    "timestamp" : "11:09-11:14",
    "text" : "They just they didn't move the ball. They were just that battle off.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "11:14-11:16",
    "speaker" : "Steve",
    "text" : "How many yards did Bowler Fult throw for?"
  },
  {
    "timestamp" : "11:16-11:18",
    "speaker" : "Andy",
    "text" : "Uh 2559. Wow."
  },
  {
    "speaker" : "Steve",
    "text" : "And those guys combined like 700 of it? Six.",
    "timestamp" : "11:19-11:23"
  },
  {
    "timestamp" : "11:23-11:23",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "11:28-11:28"
  },
  {
    "text" : "It was not it's not a good list. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "11:28-11:30"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "11:32-11:35",
    "text" : "That's tough. The thirty-first in the NFL in yards."
  },
  {
    "text" : "Uh probably. Yeah.",
    "timestamp" : "11:36-11:37",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "11:37-11:38",
    "text" : "Is that what you're saying?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "11:38-11:38"
  },
  {
    "timestamp" : "11:38-11:39",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "11:39-11:39",
    "text" : "Oh yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "11:39-11:39",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "text" : "Yeah. Oh yeah. The points four, they were 20th. Points, they were okay. It was probably defense scoring all the points. Right, yeah. And they're giving them short fields and stuff and they're kicking field goals. But yeah, they did they uh let's see. It was it was not a good team. Let's see. They scored one Two, three times under double digits.",
    "timestamp" : "11:40-11:58",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "11:59-12:00",
    "speaker" : "Greg",
    "text" : "They're bad."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, not not a good team.",
    "timestamp" : "12:00-12:02"
  },
  {
    "timestamp" : "12:02-12:18",
    "text" : "And like their their passing offense is horrific. Horrendous. Like they were ninth in the NFL in rushing. Yeah. And they still were 31st in the NFL in yards. This is probably like a historically bad passing offense.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "They were 31st uh in passing yards and 30th in passing touchdowns. Hell yeah, dude.",
    "timestamp" : "12:18-12:24"
  },
  {
    "speaker" : "Steve",
    "text" : "Who's got worse passing yards?",
    "timestamp" : "12:24-12:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Who else is like That's a great question. I don't know. Like uh could because that Kyle Bowler, usually when you hear numbers like that, you're like, oh, you know, he uh he split time, he missed some games.",
    "timestamp" : "12:26-12:35"
  },
  {
    "text" : "Yeah, he got injured.",
    "timestamp" : "12:35-12:36",
    "speaker" : "Steve"
  },
  {
    "text" : "He started all 16. And went nine and seven. Like I think they just missed the playoffs. Who is the coach? Uh this is Brian Billick. Which because it was a blowout at the end, uh, who were the commentators? This was Uh where are my notes? Oh, Jim, Jim Nance and Phil Sims.",
    "timestamp" : "12:36-12:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "12:56-12:58",
    "text" : "Oh yeah, TV.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. So at the end of it, they were talking about how um Brian Billock's name is very close to Bill Belichick and people always get the too confused. And Brian Billock ordered some really nice suits and then they showed up and he tried them on and the sleeves were really short. And then he looked inside and the name inside was Bill Belichick. So they sent him Bill Belichick suits instead of Brian Billick. That's kind of funny. That is so funny. Yeah, so that's that's the uh that's what that's what we ended up with.",
    "timestamp" : "12:58-13:25",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "13:26-13:28",
    "text" : "That shit don't happen anymore.",
    "speaker" : "Steve"
  },
  {
    "text" : "No, no, I don't think it does. Um, but yeah, this was uh this was a very uh stereotypical game for the Baltimore Ravens. Where I guess they just like are good at keeping it close because of their defense and hope to like score a random touchdown here and there and win.",
    "timestamp" : "13:28-13:47",
    "speaker" : "Andy"
  },
  {
    "text" : "By a couple of points, but and then Kyle Bowler gets sacked on one play and the next play gets sacked fumble. Yeah. Turn over for a touchdown the next play.",
    "speaker" : "Steve",
    "timestamp" : "13:48-13:57"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. So I mean you you want to hear their uh their two-minute offense? Uh it was Oh, where is it? Oh yeah. So the pages punted and down at the Baltimore 2. So first of all, there's like seven minutes left. They're down 24 to 3, which is what the game would end up being. And so they ran it tw twice to get to third down. Um managed to get a a first down, but then uh on Second down, the ball got snapped over Bowler's head into the end zone. So he picked it up and threw an incompletion. And then on third down, another bad snap, which he made like the center just threw it basically straight up behind him. So Kyle Baller had to catch the the uh the fair ball and was immediately sacked. And that was that was third down. So that was their that was their uh seven-minute offense. The old grunt snap. Yeah, yeah, it was he literally snapped it like straight up instead of at Kyle Baller. Corral the fly ball. I was immediately sacked by whoever was coming off the edge. I think it's Vrabel.",
    "timestamp" : "13:57-15:06"
  },
  {
    "timestamp" : "15:06-15:23",
    "speaker" : "Greg",
    "text" : "Maybe it could be. Did uh Deion Sanders is on this team? Deion Sanders on this team? He's on this team. There was no mention of him whatsoever. I think, yeah, I don't know if he played. I don't think this is one of them. Is he really on the same? Neon Neon."
  },
  {
    "timestamp" : "15:23-15:25",
    "text" : "I don't remember him being on the Ravens.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, right at the end. Oh Deon Sanders, look at that. One more, actually one more year after this.",
    "timestamp" : "15:26-15:33"
  },
  {
    "timestamp" : "15:34-16:21",
    "speaker" : "Andy",
    "text" : "He had five punt returns for 41 yards. Um and three interceptions on this team. He was he was second he was tied for second on this team with uh three interceptions. Did not hear his name once in this game. Fascinating. Yeah, uh if he yeah he must have been heard or something, but But this was uh so yeah, so that was the offense and on the defense on this team though. Uh Ed Reed led the team with nine interceptions, 17 pass defended, and a touchdown. Pick six. Terrell Suggs led the team with uh 10 and a half sacks. Ray Lewis, 101 solo tackles, and then uh Adalis Thomas, those are your three linebackers, with four force fumbles and eight sacks. So it's pretty good."
  },
  {
    "speaker" : "Greg",
    "text" : "Well uh Ed Reed is defensive player of the year this year, right?",
    "timestamp" : "16:23-16:27"
  },
  {
    "speaker" : "Andy",
    "text" : "I believe that was this year, yeah. And Ray Lewis won it just before this. Was it 2000? Wasn't that him when they went to the Super Bowl and he killed the man?",
    "timestamp" : "16:28-16:38"
  },
  {
    "timestamp" : "16:38-16:54",
    "text" : "He did not kill a man. I looked this up in preparation for the podcast. Okay. Talk to me, Greg. He was there when somebody got killed. Right. And then Um and then he ratted him out.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:54-17:01",
    "text" : "Oh, I thought he didn't. I thought he they all jumped in his limo and and took off and dumped everything in a dumpster somewhere."
  },
  {
    "timestamp" : "17:01-17:09",
    "speaker" : "Greg",
    "text" : "Yeah, that happened. And then they were like, they charged him with murder because they were like, well, we don't know who fucking did this and you were in the limo. And then he was like, oh."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:10-17:13",
    "text" : "And there's wasn't his blood in the limo too? The the dead guy's blood?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah So then as part of the plea deal to get it pled down to just like uh whatever obstructive justice, yeah, he pled uh Or he ratted out his two buddies. But then they didn't even get convicted. What? Yeah, they got self-defense. Oh shit So no one got Ray Lewis is the only one that spent any time in jail for this. How long do you spend in jail? Like a week? A couple of nights? I don't know. Yeah. A little between when it happened and then when he got the plea deal, so Jesus.",
    "timestamp" : "17:13-17:47"
  },
  {
    "text" : "Cause it was it was the night before the Super Bowl or something, right?",
    "timestamp" : "17:47-17:50",
    "speaker" : "Andy"
  },
  {
    "text" : "It w yeah, well I think it was the night of the Super Bowl. Yeah. Not the one he not the one he was in. It was in the the Rams Titans Super Bowl.",
    "timestamp" : "17:50-17:57",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "17:57-18:02",
    "text" : "Oh When did they kill him over? A fight in a bar, apparently. Ye",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Some guy like smashed a bottle over one of their heads. So his two buddies just fucking stabbed him to death.",
    "speaker" : "Greg",
    "timestamp" : "18:04-18:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "18:10-18:10"
  },
  {
    "text" : "And then they're like, yo, let's get the fuck out of here. And unfortunately, Raywis was wearing a fucking cream white suit and a Stetson hat. Almost like innocuous shit to be trying to get away with murder and so Ray Lewis too, right?",
    "speaker" : "Greg",
    "timestamp" : "18:11-18:25"
  },
  {
    "timestamp" : "18:26-18:28",
    "speaker" : "Steve",
    "text" : "Or to like not get blood on you."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Right, yeah, that's the thing. Yeah, that shit'll stand out real quick. Although you'll know immediately if you have blood on you.",
    "timestamp" : "18:28-18:34"
  },
  {
    "timestamp" : "18:34-18:43",
    "text" : "I'm telling you, dude, I could get away with murder. You just don't be an idiot. Like Aaron Hernandez, his own fucking security system, caught him. That's true.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "18:43-18:45",
    "text" : "Don't get a real record system.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "18:46-18:50",
    "text" : "Yeah, just if you're gonna kill someone, just cover your tracks. Just it's that easy."
  },
  {
    "text" : "Oh boy. Um speaking of easy, uh the reason it was so easy to build such a good defense for these Baltimore Ravens, uh, listen to the coaching staff that was on the defensive side of the ball. You had the defensive coordinator. Well, obviously you had Brian Bellick, who was pretty good, just not against the Patriots. Um, they won this game. Do you do can you name the other game that the Patriots beat the Ravens with Brian Bellick? The head coach. That's a bull one. Is this a trick question? Nope.",
    "speaker" : "Andy",
    "timestamp" : "18:53-19:28"
  },
  {
    "text" : "It's gotta be the next time they play, right? 1999. We've seen the Ravens.",
    "speaker" : "Steve",
    "timestamp" : "19:29-19:32"
  },
  {
    "timestamp" : "19:33-19:49",
    "speaker" : "Andy",
    "text" : "Yeah, it's the next one, the next time they play. In three years. Six. I don't know. I mean two thousand four plus three. It's that nail biter in two thousand seven. to keep the uh undefeated game alive. Oh yeah, yeah, yeah, yeah, yeah. That one."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "19:49-19:54",
    "text" : "So that's that's the only two times you've got sides or the fourth down where you called timeout on a lot of crap."
  },
  {
    "text" : "Where who called timeout? Rex Ryan, right? Yeah exactly. So Rex Ryan is the defensive line coach on this team. Oh, Rex Ryan's on his team? He is, yeah. Defensive coordinator Mike Nolan, the Fortis coach. Defensive line assistant to Rex Ryan is Mike Petine. Pettine?",
    "speaker" : "Andy",
    "timestamp" : "19:54-20:12"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "20:12-20:13",
    "text" : "Mike Patton?"
  },
  {
    "text" : "Pettin? However you pronounce that. Yeah. Who was the uh head coach of the Browns for two years, went 10 and 22. Yeah. And then linebackers coach Mike Singletary. The famous Bears linebacker who was also a Fort Niners.",
    "timestamp" : "20:14-20:26",
    "speaker" : "Andy"
  },
  {
    "text" : "Can't win with him.",
    "speaker" : "Greg",
    "timestamp" : "20:26-20:27"
  },
  {
    "text" : "Can't do it. Won't do it. Who was 18 and 22 as the head coach of Fort Niners over three years?",
    "speaker" : "Andy",
    "timestamp" : "20:27-20:33"
  },
  {
    "text" : "Can't win with them. Won't do it.",
    "timestamp" : "20:34-20:36",
    "speaker" : "Greg"
  },
  {
    "text" : "I remember that.",
    "timestamp" : "20:36-20:37",
    "speaker" : "Andy"
  },
  {
    "text" : "You don't remember that? Not such a good coach. I think he was calling out Vernon Davis, if I remember correctly. That feels right. That's hilarious. Andy, can we get some audio of that? Yeah. Um let me see if I can find it. Let's get a little stat check. Steve, let's uh discuss while he does this. Oh God, we have to carry it. You remember Mike Singletary though, right? From the Bears?",
    "speaker" : "Greg",
    "timestamp" : "20:37-21:04"
  },
  {
    "timestamp" : "21:05-21:06",
    "text" : "Yeah, yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "21:06-21:07",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "21:07-21:10",
    "speaker" : "Steve",
    "text" : "And then he coached with the Niners. I remember that I just don't remember this."
  },
  {
    "timestamp" : "21:10-21:22",
    "speaker" : "Greg",
    "text" : "And then I think they like the coach left mid-year something, so he he was like the interim coach. And he was trying to do like the culture change thing where he's like, I'm just gonna be a fucking huge hard ass."
  },
  {
    "timestamp" : "21:22-21:22",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "21:22-21:26",
    "speaker" : "Greg",
    "text" : "And all the players are like, this sucks. We're three and eight."
  },
  {
    "text" : "Yeah, they were not good. Um All right, let me see what I can do. Okay. Let's see if this works. Oh, god damn it. Ready?",
    "timestamp" : "21:27-21:41",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:41-21:42",
    "speaker" : "Greg",
    "text" : "Mm-hmm. Come on."
  },
  {
    "text" : "Why is there no sound?",
    "timestamp" : "21:45-21:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Volumes.",
    "timestamp" : "21:47-21:47"
  },
  {
    "text" : "Volume's up.",
    "timestamp" : "21:48-21:49",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:51-21:53",
    "speaker" : "Speaker 5",
    "text" : "Just gave you three hundred dollars for some weed."
  },
  {
    "text" : "And just get penalized all the way. There we go. All right. This is how I believe, okay? I'm from the old school. I believe this. I would rather play with ten people. And just get penalized all the way until we got to do something else. Rather than play with 11 when I know that right now that person is not sold out to be a part of this team It is more about them than it is about the team. I cannot play with them. Cannot win with them. Cannot coach with them. Can't do it. I want winners. I want people that want to win. That's great.",
    "timestamp" : "21:55-22:31",
    "speaker" : "Speaker 6"
  },
  {
    "timestamp" : "22:32-22:45",
    "speaker" : "Greg",
    "text" : "So awesome. Great speech. Just the cadence and everything is just time. Perfect. Wow. It's electric. That's up there with you know as he's saying that he's like I'm nailing this."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "22:46-23:16",
    "text" : "You can see it on his face. He's just like, yeah, he's like he's been practicing this in the shower for like two weeks. Yep. Can't coach with him. Can't do it. Can't do it. Can't do it. Can't coach with him. Can't play with him. Can't win with him. Vernon Davis, too. So that that's that's who uh that's that's who's running this defense. And you have Ray Lewis and you have Ed Reed and you have Adelius Thomas Oh yeah. So absolutely. And Deion Sanders."
  },
  {
    "speaker" : "Greg",
    "text" : "Don't forget Dion.",
    "timestamp" : "23:16-23:17"
  },
  {
    "text" : "Deion Sanders.",
    "speaker" : "Andy",
    "timestamp" : "23:17-23:18"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "23:18-23:20",
    "text" : "Neon Dion. That is correct."
  },
  {
    "text" : "Um and so the Patriots put up 24 points on this offense on this defense, which is pretty impressive. On a soggy surface too.",
    "timestamp" : "23:21-23:28",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, some of them was where the strip sack on the front deep.",
    "timestamp" : "23:28-23:31"
  },
  {
    "speaker" : "Andy",
    "text" : "But this was all Corey Dillon. 30 carries, 123 yards, and a touchdown.",
    "timestamp" : "23:32-23:35"
  },
  {
    "text" : "Oh, it was one of those. Once he gets you worn down in the end, I feel like he was probably punishing him. It was it was demoralizing.",
    "speaker" : "Steve",
    "timestamp" : "23:35-23:41"
  },
  {
    "text" : "Oh yeah.",
    "timestamp" : "23:45-23:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "23:45-23:46",
    "speaker" : "Steve",
    "text" : "That thing was vicious."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that'll be on the website. Um it was uh A solid. But I mean, this is just one of those like stupid, sloppy games that you have like that you used to pray for whenever the Patriots play the Colts, you know? Yeah. Where everything would just be a sloppy mess. Um And then you kind of had to waste it on the Baltimore offense instead.",
    "timestamp" : "23:47-24:07"
  },
  {
    "timestamp" : "24:08-24:11",
    "text" : "But um This is just not an enjoyable game to watch, though.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Not particularly. No.",
    "timestamp" : "24:11-24:12"
  },
  {
    "timestamp" : "24:12-24:21",
    "speaker" : "Steve",
    "text" : "Dylan, four yards, Dylan four yards, Dylan 13 yards. Patrick passed seven yards. No gain. Incomplete. One yard. Delay of game. Punter punts."
  },
  {
    "text" : "Yeah. Oh yeah. It's it's all just A whole lot of punts. Let's see. One, two, um, three, four, five, six, seven, eight, nine, ten, eleven. That's in the first half.",
    "timestamp" : "24:21-24:35",
    "speaker" : "Andy"
  },
  {
    "text" : "Well give us the uh watchability score of it.",
    "speaker" : "Steve",
    "timestamp" : "24:36-24:38"
  },
  {
    "timestamp" : "24:39-24:45",
    "text" : "Uh out of six lumbardies, I give this one and a half.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "The mud novelty probably wears off pretty fast.",
    "timestamp" : "24:47-24:49"
  },
  {
    "timestamp" : "24:49-25:10",
    "speaker" : "Andy",
    "text" : "Yeah, yeah. Literally just watch the highlights of this one. They're easy enough to find on YouTube. And uh it's you know, it's nothing great. Although the Patriots do set uh a record for being the 19th straight game in a row, scoring first. Cool."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "25:10-25:12",
    "text" : "Pretty impressive. It is a pretty impressive."
  },
  {
    "text" : "Do that record still stand? That's like a record. I believe it does. Um",
    "timestamp" : "25:13-25:17",
    "speaker" : "Greg"
  },
  {
    "text" : "Just because I mean how can you it's it's almost like a matter of luck, you know?",
    "speaker" : "Andy",
    "timestamp" : "25:18-25:21"
  },
  {
    "text" : "It's a coach's wet dream. Scoring first. Oh yeah. Gotta score first, you know, really set the tall. It's like, yeah, no, no shit, dude. What do you think we're trying to do here? Fucking give up points first?",
    "speaker" : "Greg",
    "timestamp" : "25:21-25:32"
  },
  {
    "timestamp" : "25:36-25:40",
    "text" : "We gotta score first, you know, it really sets the toe. Of course, yeah. Fucking shit, Bill.",
    "speaker" : "Steve"
  },
  {
    "text" : "And my guess is they score first in a few of their next games because on the rest of the season they only have one game left versus a team with a winning record, and that is the Jets. Who are at eight and three in second in the AFC East behind the 10 and 1 Patriots after this. So there were also two other 10 and 1 teams this week. The Pittsburgh Steelers are one of them, and the Philadelphia Eagles are the other. Both the Eagles and the Patriots have sold loss to those Pittsburgh Steelers. I believe they cause they ended both undefeated streaks back-to-back weeks. This Steelers team is a goddamn wagon right now.",
    "timestamp" : "25:41-26:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yes, they are riding high because this is Ben's rookie year too, right?",
    "timestamp" : "26:25-26:27"
  },
  {
    "speaker" : "Andy",
    "text" : "He's on some",
    "timestamp" : "26:27-26:28"
  },
  {
    "timestamp" : "26:28-26:29",
    "speaker" : "Steve",
    "text" : "Crazy streak."
  },
  {
    "timestamp" : "26:29-26:41",
    "text" : "He's never lost because that first game was, I think, Tommy Maddox or something ended up with the loss and he got hurt. And so Rothesbury's come in. He hasn't lost the football game. He's playing, you know, like Big Ben of old.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Man, um that L's gonna hurt them pretty hard then.",
    "timestamp" : "26:41-26:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I know. Uh but uh the thing I found interesting was uh week 11 and the Philadelphia Eagles at 10 and 1. Have already clinched the division. Which is fucking early. Eleven weeks in. Because uh the Giants, Cowboys, and Redskins would all finish sixth and ten this season. And the Eagles.",
    "timestamp" : "26:45-27:08"
  },
  {
    "text" : "But did you see the uh did you see the game of the week this week? What was the game of the week this week? It was the four and six Bengals versus the two and eight Browns.",
    "timestamp" : "27:08-27:20",
    "speaker" : "Greg"
  },
  {
    "text" : "It sure was. I remember this video.",
    "timestamp" : "27:20-27:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:22-27:25",
    "speaker" : "Greg",
    "text" : "58 to 48 Bengals."
  },
  {
    "timestamp" : "27:26-27:42",
    "speaker" : "Andy",
    "text" : "This is the second highest game scoring game to not go into overtime. Crazy. Fucking banana. I remember this because that was uh who was that Bengals quarterback at the time? Oh no, not Beggar, the Browns quarterback, the old guy. No, the old rookie. Remember him?"
  },
  {
    "speaker" : "Greg",
    "text" : "Like a 38-year-old rookie. Yeah, this is Kelly Holcomb though.",
    "timestamp" : "27:42-27:46"
  },
  {
    "timestamp" : "27:46-27:48",
    "speaker" : "Andy",
    "text" : "Are you sure? Yeah. Motherfucker. All right."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "27:48-27:50",
    "text" : "Because I have a soft spot for Kelly Holcomb."
  },
  {
    "timestamp" : "27:51-27:52",
    "text" : "Don't you have a Kelly Holcomb jersey?",
    "speaker" : "Andy"
  },
  {
    "text" : "Why do you have a jersey? Was that a bet you lost? I have no idea, to be honest. No idea.",
    "timestamp" : "27:55-28:01",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "28:02-28:10",
    "text" : "Speaking of jersey, Beths. I believe you owe me a jersey. That's true. For your on the 2021 Newcastle.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay, let's circle back on that. Okay. Let's put a pin in that one. We'll circle back later. Okay. We'll we'll uh we'll put something on the calendar for that, shall we? Okay. Yeah. All right. Let's take this one offline, Andy.",
    "timestamp" : "28:10-28:26"
  },
  {
    "text" : "Uh so yeah the the number one highest scoring football game to not go into overtime at this point. Was it a 1966 Redskins Giants game, apparently. But what was the Chiefs-Rams game of a couple years ago? What did that end up being?",
    "timestamp" : "28:29-28:49",
    "speaker" : "Andy"
  },
  {
    "text" : "Bajillion to a bajillion.",
    "timestamp" : "28:49-28:50",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:51-28:51",
    "text" : "Yeah, bajillion."
  },
  {
    "timestamp" : "28:51-28:52",
    "text" : "I can't remember.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:52-28:58",
    "text" : "Because wasn't both games in the fifth wasn't both scores in the fifty? It was like fifty-eight-fifty-four or something. Or fifty-four-fifty one bananas."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "28:59-29:29",
    "text" : "So over 100 points, which is scoring 48 points and losing by 10? Right. Yeah, that's by two scores. It's crazy. TJ Hoosh Mazu. TJ, who's your mama? Have you ever seen that video? What's that from? It's uh It's uh Marshawn Lynch mic'd up when he was on the Bills and they announced TJ Hushmazada and he turns to a teammate and he goes, TJ Hushmazou."
  },
  {
    "text" : "Never seen that.",
    "timestamp" : "29:31-29:32",
    "speaker" : "Steve"
  },
  {
    "text" : "No, dude, you got that his mic'd up moments from when he's on the bills are just like charisma at its finest. He's so funny. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "29:32-29:43"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:43-29:44",
    "text" : "What am I googling?"
  },
  {
    "text" : "Say it again.",
    "timestamp" : "29:45-29:46",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:46-29:47",
    "text" : "What am I googling?"
  },
  {
    "timestamp" : "29:48-29:52",
    "text" : "Uh uh beast mode, mic'd up bills.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Got it. See if we can find this. Marshall Lynch mic'd up. Here we go. TJ, who's your mama? All right, let me Let me share this. What is this? Marshawn Lynch. Marshawn, Marshawn, Marshawn, Marshall.",
    "timestamp" : "29:55-30:20"
  },
  {
    "text" : "I'm in baseball. You saying they had that fine up there? Yeah. It is. Arshawan Lynch shaking the tackle with a forty-five topic.",
    "speaker" : "Speaker 6",
    "timestamp" : "30:21-30:31"
  },
  {
    "text" : "He's so good back then.",
    "timestamp" : "30:33-30:34",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "30:37-30:44",
    "speaker" : "Speaker 6",
    "text" : "I got a little bit of speed on them though. They can't tackle. I see that. They can't tackle. Even when they're friends, they can't tackle."
  },
  {
    "text" : "I see that.",
    "speaker" : "Andy",
    "timestamp" : "30:45-30:46"
  },
  {
    "speaker" : "Speaker 6",
    "timestamp" : "30:49-30:53",
    "text" : "Hey, I got at least some pancakes today. Hell yeah."
  },
  {
    "timestamp" : "30:56-30:59",
    "text" : "He's such a goofy dude. He's the best.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Speaker 6",
    "text" : "Drops to throw. Five steps drops.",
    "timestamp" : "31:02-31:04"
  },
  {
    "speaker" : "Greg",
    "text" : "Throws towards the end zone.",
    "timestamp" : "31:04-31:05"
  },
  {
    "speaker" : "Speaker 6",
    "text" : "It is caught by Hochschmidt. for the touchdown. TJ who shmazou. TJ who's your mama? Number 90? Yeah, hey, he he told me right. He say, I'm gonna come and steal them teeth from you after the game.",
    "timestamp" : "31:05-31:20"
  },
  {
    "timestamp" : "31:24-31:29",
    "speaker" : "Greg",
    "text" : "What a joyous person. That was so much fun to play with."
  },
  {
    "timestamp" : "31:31-31:39",
    "speaker" : "Speaker 6",
    "text" : "Damn, you back over here. Hey, I like you. you a lot. Yeah bowl down here don't you? Hell yeah."
  },
  {
    "text" : "Oh he's throwing passes.",
    "timestamp" : "31:43-31:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:46-31:59",
    "text" : "Marshawn Lynch's first NFL career touchdown pass. Threw a touchdown. Oh mamas, I'm trying to get like LT. I'm only 21, but I live my life like I'm grown.",
    "speaker" : "Speaker 6"
  },
  {
    "timestamp" : "32:02-32:14",
    "speaker" : "Steve",
    "text" : "TJ Hooshlazu. He's not even talking to anybody. He just stand on the side. 2600 pound double-sided magnet. Let's go ahead and see what we can find here."
  },
  {
    "text" : "Ooh, double-sided magnet, Andy. Magnet fishing.",
    "timestamp" : "32:14-32:17",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "32:19-32:23",
    "text" : "Oh boy. He is such a joyous individual."
  },
  {
    "speaker" : "Greg",
    "text" : "He's just so charismatic. He is. Just and not even on purpose. Yeah. Just naturally. Yeah. Exactly.",
    "timestamp" : "32:23-32:31"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "32:32-32:33",
    "text" : "Just like you, Greg."
  },
  {
    "timestamp" : "32:34-32:35",
    "text" : "That's right.",
    "speaker" : "Greg"
  },
  {
    "text" : "No comment.",
    "timestamp" : "32:36-32:37",
    "speaker" : "Steve"
  },
  {
    "text" : "All right. Should we do best and worse for this thing? You got anything else you want to you want to bring up about the uh 2004 Baltimore Ravens or Patriots?",
    "speaker" : "Andy",
    "timestamp" : "32:39-32:47"
  },
  {
    "text" : "Uh no.",
    "timestamp" : "32:48-32:50",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "32:51-33:45",
    "speaker" : "Andy",
    "text" : "Okay. Oh boy. All right. Um let's see Any good stats in this? Uh two is a good number for inches of mud. Um Also, let's see. Combined stats, possessions 11, punts nine, first downs eleven. Great. The New England Patriots 41 points in the final two minutes of the first half. On the season, most in the NFL, of course. So this is just like typical Patriots 2004. How would you rank the 2004 teams in uh like Patriots Dynasty? uh team rankings if you could rank each season. Because I've heard some people say that 2014 is the best team or the best defense ever."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "33:47-33:51",
    "text" : "They're the best. Someone else has said that they were the final form of the offense, you know?"
  },
  {
    "speaker" : "Andy",
    "text" : "That's what I've heard. Because this is kind of where Tom Brady turns into like A full fledged quarterback and isn't just like a elite running back too.",
    "timestamp" : "33:52-34:00"
  },
  {
    "text" : "And elite defense.",
    "speaker" : "Steve",
    "timestamp" : "34:00-34:01"
  },
  {
    "text" : "Exactly. You got Corey Dillon as well You've got um I guess he didn't rookie rookie um Dion Branch and uh David Givens, Troy Brown.",
    "timestamp" : "34:02-34:12",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "It indicates that they're not neither of those guys sort of like elite, right? That we've had better receivers over the dynasty. but never had a better running back. This is probably the best iteration of the defense of all time. Tom Brady's Tom Brady.",
    "timestamp" : "34:12-34:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:24-34:30",
    "text" : "Yeah, Tom Brady's officially Tom Brady at this point. Uh Adam and Atari making clutch kicks."
  },
  {
    "timestamp" : "34:30-34:34",
    "speaker" : "Steve",
    "text" : "Because that was always a problem with the 2007 offense, you know, they couldn't get the hand ones."
  },
  {
    "speaker" : "Andy",
    "text" : "True. Well, they had no defense too. Um, but yeah, they didn't have much of a running game. To be fair, they didn't need it for most of it. But Greg, thoughts?",
    "timestamp" : "34:35-34:47"
  },
  {
    "timestamp" : "34:47-35:08",
    "speaker" : "Greg",
    "text" : "Yeah, I mean it's tough, it's tough to say. So my instinct is to say that no, this is not the best defense that they've had. Same. What would you rank better? The 2001 defense? Or last year's 2003. Interesting. Yeah. Shutting down Peyton Manning like that in the playoffs, that was pretty big. Fair, fair."
  },
  {
    "speaker" : "Andy",
    "text" : "That's true. Um yeah, I would I would say 2003 defense stacks up because I mean also the 2003 defense doesn't have Troy Brown playing cornerback. Uh-huh.",
    "timestamp" : "35:09-35:19"
  },
  {
    "timestamp" : "35:19-35:21",
    "text" : "So secondary was definitely better.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, this secondary is beat up. They're talking about uh Earthwind Moreland in this game.",
    "timestamp" : "35:22-35:26"
  },
  {
    "timestamp" : "35:26-35:36",
    "speaker" : "Steve",
    "text" : "That being said, this is the only Super Bowl where it wasn't super close right at the end. True. It's the only kind of game and sort of hand they've ever played in the Super Bowl."
  },
  {
    "speaker" : "Andy",
    "text" : "That they didn't like win, yeah.",
    "timestamp" : "35:36-35:37"
  },
  {
    "text" : "Like right at the end.",
    "speaker" : "Steve",
    "timestamp" : "35:37-35:38"
  },
  {
    "timestamp" : "35:42-35:55",
    "text" : "That's true. Although wasn't the second Rams Super Bowl their biggest martial victory? 10 points. Yeah. Two scores. But yes.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "But that team was nowhere near as good as this team.",
    "timestamp" : "35:55-35:57"
  },
  {
    "speaker" : "Andy",
    "text" : "I think defensively they were on par.",
    "timestamp" : "35:58-36:01"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "36:02-36:02"
  },
  {
    "timestamp" : "36:03-36:24",
    "text" : "Um just because what they did to the Rams, who I think if if you look at that season The Rams and the Chiefs were both top 10 all-time offensives. And they shut them both down. Enough. Like they they held the Chiefs scorers through a half and basically through three quarters.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, that defense is",
    "timestamp" : "36:24-36:26",
    "speaker" : "Steve"
  },
  {
    "text" : "Legit. Yeah. So I th I think there's some similarities between those two. But offensively, I think this teams, yeah, like you said, better, much more well-rounded with Corey Dillon.",
    "timestamp" : "36:27-36:39",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "36:40-36:42",
    "text" : "So it's the best running back we've ever had."
  },
  {
    "timestamp" : "36:42-36:46",
    "speaker" : "Andy",
    "text" : "Yeah. No disrespect to Kevin Falk or Sweetfeet."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, no, but like a true running back, you know.",
    "timestamp" : "36:47-36:49"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true.",
    "timestamp" : "36:50-36:50"
  },
  {
    "text" : "Harrison Mondre into.",
    "timestamp" : "36:50-36:52",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "36:53-36:55",
    "text" : "Yeah, well maybe they'll turn into that, right?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:55-36:56",
    "speaker" : "Steve",
    "text" : "That's the hope."
  },
  {
    "text" : "Although, will the Patriots still keep them on the roster at that point?",
    "timestamp" : "36:56-36:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "No, they'll just keep them split in time.",
    "timestamp" : "37:00-37:02"
  },
  {
    "timestamp" : "37:03-37:57",
    "speaker" : "Andy",
    "text" : "But I'm no, I'm saying like will they uh will they re-sign them after their rookie contract? Uh probably not. I think I think they've proven that they just don't do that anymore. It's not their thing. Let's see what else we got. Yeah, so uh speaking of that running game, the Patriots uh running uh comparisons from 2003 to 2004, 2003 they averaged just over 100 yards a game. And in this season, they're averaging 120, almost 122. Um, they have seven rushing touchdowns this season. They had two rushing touchdowns last season. In 2003. Two. Not great. And then last in 2003, their rushing offense was 27th in the league this year. They're only 12th, surprisingly. Um, even though Corey Dillon, the only game he hasn't rushed for 100 yards was the one he didn't play in when he was hurt against the Steelers. And that's the only game they've lost, funnily enough."
  },
  {
    "timestamp" : "37:57-37:58",
    "speaker" : "Steve",
    "text" : "There you go."
  },
  {
    "text" : "Um But of all the like there was some big moves uh running back wise uh in free agency this this offseason. So Eddie George went to the Cowboys. Thomas Jones went to the Bears. Deuce Staley on the Steelers. Clinton Portis went to the Redskins, who are now the commanders. Thoughts on the name, Commanders?",
    "timestamp" : "37:58-38:23",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "38:23-38:30",
    "text" : "Stupid. Awful name. Should have done Greg's idea. As much as that pains me to say."
  },
  {
    "timestamp" : "38:30-38:37",
    "speaker" : "Greg",
    "text" : "Well, it was Greg's idea. The hogs, yeah. The red hogs. Command is dumb, but we knew it was going to be dumb, didn't we?"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, yeah. 100%. Um so out of all of those, all those guys changed teams. Um And the player with the most rushing yards by a player acquired last offseason, Corey Dillon, who was already over a thousand yards in this game, because we're a thousand yards in week 11, game 11. 11, 12, week 12. So not too bad. He's outrushing Clinton Portis who has 945 yards on the season.",
    "timestamp" : "38:37-39:04"
  },
  {
    "timestamp" : "39:06-39:09",
    "text" : "Yeah, traded for a first round pick. We got Corey Dillon for a third.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yep.",
    "timestamp" : "39:09-39:09",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "39:09-39:10",
    "speaker" : "Steve",
    "text" : "Fourth."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:10-40:03",
    "text" : "Eddie George for the Florida uh for the uh Cowboys, 416 yards of the season. Good trade. But do Staley 700 yards on that uh Steelers offense, which is impressive. See him later. Sure will. Kyle Bowler uh has not played well He's been sacked at least once every game, which seems about right. And then, of course, uh Phil Sims was talking about how great he's playing in this game. Um, Cowboy is playing so much better. Literally as he throws an interception. His first interception in 124 pass attempts. So so close. And actually we also found out because both these quarterbacks were wearing gloves in this game because of how putrid the weather was. It turns out Phil Sims was the one who started that wearing uh gloves on his throwing hand. And he was mocked mercifully, apparently, back in whenever he played, the 70s, 80s, whenever that was."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:03-40:05",
    "text" : "Oh yeah, I'm sure he's called the little bitch boy."
  },
  {
    "timestamp" : "40:05-40:14",
    "speaker" : "Andy",
    "text" : "Oh, I'm sure he was. I mean, it fits. But uh yeah, so he he claimed to fame is he's he was the first quarterback to be wearing gloves on strong hand."
  },
  {
    "text" : "He normalized it. He came out of the I don't know where you keep your gloves, the drawer.",
    "speaker" : "Steve",
    "timestamp" : "40:15-40:19"
  },
  {
    "timestamp" : "40:19-40:23",
    "text" : "Yeah. Your glove compartment. Glove compartment.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "He came out of the compartment and really, you know, made the NFL accept it. And now look how much better we are. Yeah. Tom Bank without fear of ridicule.",
    "timestamp" : "40:23-40:31"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "40:32-40:36",
    "text" : "Bowler was a first round draft pick. Yes. Did not know that."
  },
  {
    "timestamp" : "40:37-41:07",
    "speaker" : "Andy",
    "text" : "Where did he play college? Right. Cal. That's right. Yeah. Yeah, I think he was pretty uh like relatively uh highly hyped. Like all first round quarterback draft picks, right? But he was never any good No, no. No, he never panned out into anything. Um, which is, you know, pretty par for the course for the Ravens. I mean, Lamar Jackson is probably the best quarterback they've ever had. It's a good thing. Who who's been better than him?"
  },
  {
    "text" : "He's gonna say Flacco. Flacco.",
    "speaker" : "Steve",
    "timestamp" : "41:08-41:10"
  },
  {
    "text" : "He had one good postseason. And got paid a shit ton and and dragged that team back to mediocrity immediately. Is he better than Lamar Super Bowls. He's reached the pinnacle. Is Eli Manning better than Aaron Rodgers?",
    "timestamp" : "41:10-41:29",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "41:30-41:49",
    "text" : "Yes. Eli Manning's better on record. I would like to be on record saying that. You're saying Eli Manning is better than Aaron Rodgers. Okay. Yes, please, please put that in the log. March third, twenty twenty-two, seven fifty PM Greg Brown.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "On the record saying Eli Manning is a better quarterback than Aaron Rodgers. You care to expand?",
    "timestamp" : "41:49-41:54"
  },
  {
    "timestamp" : "41:56-42:01",
    "speaker" : "Greg",
    "text" : "Yeah, Rogers is a beta cuck soy boy. Yeah."
  },
  {
    "timestamp" : "42:01-42:14",
    "text" : "As opposed to the alpha male Eli Manny is a male chat. You're supposed to be a little bit more than a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little Well you sold me. Similarities. Oh geez.",
    "speaker" : "Andy"
  },
  {
    "text" : "Craig. How did our Super Bowl predictions go? We haven't talked about the Super Bowl since it happened, right? Uh I don't believe so. Yeah, I think we got it all wrong. Things have been a bit of a blur. Did we? Yeah, thoughts on the champion rants?",
    "timestamp" : "42:16-42:34",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh no, I I think uh my heart was with the Bengals, but my Uh gut was with uh the Rams. Yeah, you might be right.",
    "timestamp" : "42:34-42:41"
  },
  {
    "text" : "I think I said Rams too, Greg, and you said Bengals.",
    "speaker" : "Steve",
    "timestamp" : "42:41-42:44"
  },
  {
    "timestamp" : "42:44-43:00",
    "text" : "Yeah. We were all wrong, yeah. We're all wrong for listening to Greg in the first place. So I guess you just don't need an offensive line to get the Super Bowl. Is that what we're learning?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Mm-hmm. I still think Aaron Donald sucks.",
    "timestamp" : "43:00-43:03"
  },
  {
    "timestamp" : "43:04-43:07",
    "speaker" : "Andy",
    "text" : "Oh, that's right. You did say that. Even though he ended that Super Bowl."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:07-43:08",
    "text" : "He almost won MVP, Greg."
  },
  {
    "timestamp" : "43:09-43:12",
    "speaker" : "Greg",
    "text" : "If he had won MVP, I would have been so pissed off."
  },
  {
    "speaker" : "Steve",
    "text" : "I think he would have won it.",
    "timestamp" : "43:12-43:13"
  },
  {
    "speaker" : "Greg",
    "text" : "Except that the voting happens before.",
    "timestamp" : "43:14-43:16"
  },
  {
    "text" : "Isn't it like the voting happens in the third quarter or something? Yeah",
    "timestamp" : "43:17-43:20",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:21-43:38",
    "speaker" : "Greg",
    "text" : "So, but just like the the fellatio after that game of him is just unbearable. I can't tell you how many different people I heard say, maybe not the best, he's the best player of all time. Like, what are you talking about?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:38-43:41",
    "text" : "He's not even the best defensive player of all time."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "43:41-43:41",
    "text" : "Yeah."
  },
  {
    "timestamp" : "43:42-43:46",
    "speaker" : "Andy",
    "text" : "Lawrence Taylor. Yeah, yeah, these people haven't seen Lawrence Taylor play."
  },
  {
    "text" : "Yeah. I love that you're getting so worked up about it, Greg.",
    "timestamp" : "43:46-43:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "43:48-43:49",
    "speaker" : "Andy",
    "text" : "This is the best."
  },
  {
    "text" : "I thought that is the end of the game. I'll be like, oh man, Greg, it's not gonna like this.",
    "timestamp" : "43:49-43:53",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:53-43:55",
    "text" : "You don't even need to."
  },
  {
    "speaker" : "Steve",
    "text" : "Look what look what Dave Andrews did too.",
    "timestamp" : "43:54-43:56"
  },
  {
    "text" : "He didn't do it, he didn't do anything.",
    "speaker" : "Andy",
    "timestamp" : "43:57-43:58"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:59-44:04",
    "text" : "David Andrews was like not that he ended the game, but the associated dick sucking that was going to come with it."
  },
  {
    "text" : "Oh yeah. All riled up. Oh yeah. Cause everyone has like the same take too. It's all like regurgitated t regurgitated takes of like Which is like he might be the best player in the NFL, period. Like that's such a that's such a take that like I don't know who started it, but now everyone just says it. Like you watch ESPN, his name comes up, and they just say that as like It's just the thing. Right. You know? Yeah, it's like that. Yeah. But that's that's sports media. That's what they do. And no one actually grabs onto it. Is there any nuance to this or like why anything is anything? They're just like, yeah, just state this as a fact.",
    "speaker" : "Greg",
    "timestamp" : "44:04-44:44"
  },
  {
    "speaker" : "Andy",
    "text" : "But that's not what sports talk, sports TV, sports media is anymore. It's just throw out uh uh some sort of opinion and then have two people yell at each other about how the other one's completely wrong and how they're an asshole for believing what they believe. You know That's literally all that's literally like every one of these shows now, so I don't watch anymore. Yeah. That's what sports talk radio is. Except sports talk radio is that, except it's the uh the the radio broadcasters putting out their thing and then people calling in to tell them they're wrong and then them shitting it on those people instead.",
    "timestamp" : "44:44-45:20"
  },
  {
    "timestamp" : "45:20-45:25",
    "text" : "Yo, I heard a rumor that Tony Mass is gonna be calling Red Sox games this year.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "45:26-45:26",
    "text" : "Uh-huh.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:28-45:29",
    "speaker" : "Greg",
    "text" : "What do you mean there's no games?"
  },
  {
    "speaker" : "Andy",
    "text" : "Right, yeah. Yeah. Well it's one of the few times I'm rooting for the uh the strike to happen. Jackie Bradley sucks. He sucks.",
    "timestamp" : "45:29-45:39"
  },
  {
    "timestamp" : "45:40-45:45",
    "speaker" : "Greg",
    "text" : "Imagine like Jackie Bradley's coming with the bat and he's just getting fucking trashed by Tony Maz."
  },
  {
    "speaker" : "Andy",
    "text" : "Right. But uh the um the play-by-play gays travel on the same team plane. Yeah. So that could be interesting. Wouldn't mind seeing Tony Maz with a black eye walking off one of those planes.",
    "timestamp" : "45:45-46:02"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "46:02-46:07",
    "text" : "Yeah, uh uh and I'm just gonna venture a guess that he's not the most physically imposing human, Tony Maz."
  },
  {
    "speaker" : "Andy",
    "text" : "No, no, you haven't you haven't ever seen him? Yeah. Oh boy. Yeah. Uh he looks like um a bald Steve Brown. Uh at the age of like 60. Whoa. Ricochet shot, Steve. No, Steve, no, it looks is that there you go, Tony Mass.",
    "timestamp" : "46:07-46:28"
  },
  {
    "text" : "If I was bald, I would be d ugly. Look at this.",
    "speaker" : "Steve",
    "timestamp" : "46:28-46:33"
  },
  {
    "timestamp" : "46:33-46:35",
    "speaker" : "Andy",
    "text" : "Yeah, see, this is what I'm saying."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "46:36-46:37",
    "text" : "Leave that one alone."
  },
  {
    "timestamp" : "46:37-46:38",
    "speaker" : "Andy",
    "text" : "That's a tough look."
  },
  {
    "text" : "It's just a lot. A lot of real estate there.",
    "speaker" : "Steve",
    "timestamp" : "46:39-46:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:42-46:44",
    "text" : "Dude, you can start a drive-in theater."
  },
  {
    "text" : "Exactly. It's fucking Too much.",
    "speaker" : "Steve",
    "timestamp" : "46:44-46:47"
  },
  {
    "timestamp" : "46:48-46:58",
    "text" : "Beautiful. Oh god. All right. Any other any other uh comments, Greg? Anybody else you want to shit on before we call this?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:01-47:02",
    "speaker" : "Steve",
    "text" : "Anyone you want to compare to Hitler?"
  },
  {
    "speaker" : "Greg",
    "text" : "That game still is the second highest score. Game in NFL history. Holy shit, really? Rams Chiefs one was one point less. Wow. 54 to 51.",
    "timestamp" : "47:06-47:18"
  },
  {
    "timestamp" : "47:18-47:22",
    "speaker" : "Andy",
    "text" : "Oh, wow. That's crazy. It was 5451. Okay."
  },
  {
    "speaker" : "Greg",
    "text" : "I was trying to find like what the highest scoring Patriots game is and they don't really they're not really showing up on any of these lists.",
    "timestamp" : "47:22-47:29"
  },
  {
    "timestamp" : "47:30-47:42",
    "speaker" : "Andy",
    "text" : "Uh if I had to guess, I would say it's the uh the route of the um Titans? Titans Yeah, because they did that by themselves."
  },
  {
    "text" : "Yeah, yeah, that team score.",
    "timestamp" : "47:43-47:44",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "47:44-47:46",
    "text" : "That's true. Um, let's see.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "There's a couple like 59 to 31s in there.",
    "timestamp" : "47:46-47:50"
  },
  {
    "text" : "Gotta be 2007. Yeah, I mean the pages and the team scores a couple of them.",
    "timestamp" : "47:52-47:58",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "47:58-48:24",
    "speaker" : "Andy",
    "text" : "So let's see. Um I'll tell you the highest scoring Pats game. So obviously 59-0 against Titans. 59-24 against the Colts in 2012. 56-10. 59-24 so far is the biggest one. 55-31 against the Steelers. Let's see. Oh, where's the 35-35 against Cowboys? That doesn't seem right."
  },
  {
    "timestamp" : "48:25-48:31",
    "speaker" : "Greg",
    "text" : "Uh there's a tie. Yeah, there is no there. Can't tie in the NFL. Nope."
  },
  {
    "text" : "I don't think your pitches are ever tied either.",
    "speaker" : "Steve",
    "timestamp" : "48:31-48:33"
  },
  {
    "speaker" : "Andy",
    "text" : "Say 59-24 against the Colts in 2012. Looks like that might be the highest scoring pass game, because what's that? Should go to uh That's eighty three points, that's pretty good.",
    "timestamp" : "48:34-48:45"
  },
  {
    "timestamp" : "48:46-48:48",
    "text" : "com and see what's on there.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:48-48:49",
    "text" : "That's what I'm looking at, yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "info. org resource site out there. Only there's some sort of site that chronicled all of the Patriots achievements over the last 20 years. And then had a bunch of idiots go through and watch each game and record hours of content for each game.",
    "timestamp" : "48:50-49:03"
  },
  {
    "speaker" : "Andy",
    "text" : "2013 week nine against the Steels, 5531. That's a good one. That is 86 combined total. 86. That's pretty good. I think that's as high as I can get you.",
    "timestamp" : "49:04-49:19"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:20-49:22",
    "text" : "Just can't keep up with our defense."
  },
  {
    "timestamp" : "49:24-49:31",
    "speaker" : "Andy",
    "text" : "Well, that's the thing is the Patriots have a good defense when they blow teams out. So yeah. How about that? Damn."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "49:32-49:58",
    "text" : "What'd you guys think of the uh the halftime show at the Super Bowl? It was good. I liked it. I liked it. It was good. It only got thirty-three complaints, right Yeah, that's pretty good. Which is which is crazy when you think of it of like what who those artists are historically. Yes. The fact that they are like the least problematic of artists is just mind-boggling. It's bananas."
  },
  {
    "text" : "They literally went from the most to the least.",
    "timestamp" : "49:58-50:00",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "50:01-50:11",
    "text" : "I like I like that the the only scandal was uh the fact that somebody caught Snoop Dogg um smoking a J beforehand. Yeah. I got all round up about that.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "50:11-50:39",
    "text" : "Like, do you know who he is? They they kind of they they kind of avoided who they are though, you know. You think dog wasn't smoking weed on stage. The MM and Dre song, where Eminem's verse is all about Killing his wife and where he would stash the body. Oh, that's true. Yeah, they didn't go with that one. Yeah, instead he plays the fucking one from Eight Mile, right? Which isn't even a Dre song. It was just, I just, you know, I was kind of disappointed.",
    "speaker" : "Greg"
  },
  {
    "text" : "And it wasn't forgot about Dre either, which was still Yeah.",
    "speaker" : "Andy",
    "timestamp" : "50:40-50:42"
  },
  {
    "speaker" : "Greg",
    "text" : "I wanted it to be like that. The point of those guys has always been like the fuck you to everything and everybody. And it just doesn't feel right watching them like dance through the hoops to be like, you know, good corporate guys that they're old. I mean I don't know. I thought pretty deeply about this of like what they would do if they really wanted to like pull one. Yeah. Yeah. And you know, hit him up by Tupac, where it's just like, you know, the lights dim and everybody's quiet and it's like completely silent in the state of me. He goes, That's why fuck your bitch you bat motherfucker. That would have got me so hyped. Fuck your bitch in the clique you climb.",
    "timestamp" : "50:43-51:30"
  },
  {
    "speaker" : "Steve",
    "text" : "Is that the one that starts with gunfire too?",
    "timestamp" : "51:36-51:38"
  },
  {
    "text" : "Yeah. Yeah.",
    "timestamp" : "51:38-51:39",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. That'd be great to just play Dark Stadium.",
    "timestamp" : "51:39-51:43",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "51:43-51:44",
    "text" : "Yeah."
  },
  {
    "text" : "I'll get him screaming. Oh well.",
    "timestamp" : "51:46-51:50",
    "speaker" : "Steve"
  },
  {
    "text" : "Next year.",
    "speaker" : "Andy",
    "timestamp" : "51:51-51:52"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "51:52-52:16",
    "text" : "Next year. Yeah. We'll have the uh holographic but of like how far we've gone in like progressive terms of to like, you know. what we're allowed to say. No one cares to think about like what Dr. Dre and Eminem used to say in their first album. He used to talk about hate gay people and like There was a lot of shit. It's rife with the most inappropriate Ranchi shit you could ever imagine. Oh yeah."
  },
  {
    "text" : "Which is why it's awesome.",
    "timestamp" : "52:16-52:17",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "52:18-52:18",
    "text" : "On purpose too.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Like, yeah, that's why it got popular.",
    "timestamp" : "52:18-52:20"
  },
  {
    "text" : "But this like selective is very perplexing.",
    "speaker" : "Greg",
    "timestamp" : "52:20-52:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:24-52:25",
    "text" : "Yeah, well, you know."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:26-52:27",
    "text" : "Yeah, I know."
  },
  {
    "timestamp" : "52:28-52:30",
    "speaker" : "Andy",
    "text" : "You get you get soft as you get older, Greg. Trust me."
  },
  {
    "text" : "Yeah, once Ice Cube did uh Are We There Yet, I think That was kind of a nail in the coffin.",
    "speaker" : "Greg",
    "timestamp" : "52:30-52:35"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "52:39-52:39",
    "text" : "Yeah."
  },
  {
    "timestamp" : "52:39-52:47",
    "speaker" : "Greg",
    "text" : "Yeah, it's game over. Yeah, once he was voicing the fucking animal in Shrek 4. Well this co-star with Adam Sandler."
  },
  {
    "text" : "Yeah, exactly.",
    "timestamp" : "52:47-52:48",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "52:49-52:51",
    "speaker" : "Steve",
    "text" : "There was an RU we there yet, too, maybe even three."
  },
  {
    "text" : "No, there wasn't.",
    "timestamp" : "52:51-52:52",
    "speaker" : "Andy"
  },
  {
    "text" : "There's definitely two.",
    "timestamp" : "52:52-52:53",
    "speaker" : "Steve"
  },
  {
    "text" : "Why was there one?",
    "timestamp" : "52:54-52:55",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "52:55-52:56",
    "speaker" : "Steve",
    "text" : "There's three."
  },
  {
    "text" : "Alright.",
    "speaker" : "Andy",
    "timestamp" : "52:58-52:59"
  },
  {
    "speaker" : "Steve",
    "text" : "Ice Cube's gotta be in this. Oh, he's not.",
    "timestamp" : "52:59-53:01"
  },
  {
    "timestamp" : "53:01-53:03",
    "speaker" : "Andy",
    "text" : "Alright, so I got I gotta I got a football question for you."
  },
  {
    "speaker" : "Steve",
    "text" : "It's Derry Cruz instead of Ice Cube. Who?",
    "timestamp" : "53:03-53:06"
  },
  {
    "timestamp" : "53:06-53:36",
    "speaker" : "Andy",
    "text" : "Terry Cruz, the office linebacker. That guy's we should probably watch that. Do you see the the commercial um where Gerard Mayo is the new like Uh yeah. Terry Cruz and he is uh off the people yeah tackling people about mayonnaise. It was like a woman's mail thing. I like that. I don't really like mail and then all of a sudden comes in and just like tackles them and like force feeds the mayonnaise. That's awesome. Which you know Oh, I misspoke."
  },
  {
    "timestamp" : "53:36-53:46",
    "speaker" : "Greg",
    "text" : "That's good. That's good. That's not bad, right? Yeah, it's pretty good. They got a guy whose name is Mayo. Yeah. Because you know they work backwards from that where they were like, all right, we got drive mayo."
  },
  {
    "timestamp" : "53:46-53:54",
    "text" : "Well no, they're like we're we're we're Hellman's we're Hellmans. There's a guy named Mayo, what can we do with him? Yeah, he was a linebacker. Wasn't there a linebacker commercial? Yes, exactly.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Let's bring that back. Yeah, it all f it all tracks there. Yeah.",
    "timestamp" : "53:54-53:57"
  },
  {
    "timestamp" : "53:58-54:05",
    "speaker" : "Steve",
    "text" : "It took him so long. Yeah. The Are We There Yet is not a third movie. It's a sitcom."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "54:06-54:06",
    "text" : "Oh."
  },
  {
    "text" : "With three seasons.",
    "timestamp" : "54:07-54:08",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "54:08-54:17",
    "speaker" : "Greg",
    "text" : "That's worse. That's worse. Oh, shoot. That's worse. What's worse that or uh little Sheldon or whatever the hell young Sheldon?"
  },
  {
    "timestamp" : "54:18-54:20",
    "speaker" : "Steve",
    "text" : "I'll watch this over Little Sheldon all day."
  },
  {
    "speaker" : "Greg",
    "text" : "Sometimes I'll watch like five minutes of that as just like uh What's it, self-masochism? Where I just like because I hate myself.",
    "timestamp" : "54:20-54:28"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm feel- I'm feeling a little too joyous right now. So let's uh I've watched too many beast mode compilations, so let's uh let's balance this out.",
    "timestamp" : "54:28-54:36"
  },
  {
    "text" : "That's the opposite of a beast mode.",
    "timestamp" : "54:36-54:38",
    "speaker" : "Greg"
  },
  {
    "text" : "Let's balance this out with some awful television. 74 episodes.",
    "speaker" : "Steve",
    "timestamp" : "54:38-54:42"
  },
  {
    "speaker" : "Greg",
    "text" : "All right. So here's a you want to do a homework assignment here for the next podcast? Um we each need to come up with a NFL player related commercial branding deal, co-op deal. Okay. No. So we'll come up with like the premise for a commercial.",
    "timestamp" : "54:43-55:00"
  },
  {
    "timestamp" : "55:00-55:13",
    "speaker" : "Andy",
    "text" : "I feel like I already did this on the first episode because I was gonna do uh that we were not sponsored by. Um and mine was uh something to do with Warren Sapp's um female vibrators."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "55:17-55:23",
    "text" : "Yes, and then I remember saying I don't get it and then you went in this long explanation, which I've since forgotten."
  },
  {
    "timestamp" : "55:23-55:30",
    "speaker" : "Andy",
    "text" : "Uh he that's what he would gift his female co-workers when he was uh an anchor at Fox Sports."
  },
  {
    "text" : "Yes.",
    "timestamp" : "55:31-55:31",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "55:32-55:45",
    "text" : "I believe it may have even been his own brand. I don't I don't know. Or a brand that he uh enjoyed. Pre-used, yeah. Perhaps, yeah. Um, so that's what he would just give his Platonic female co-workers."
  },
  {
    "timestamp" : "55:45-56:04",
    "text" : "Just off the top of my head here, like a Cam Newton insurance one where he uh in the Super Bowl he doesn't dive on the fumble. I asked him after the game. He's like, you know, I got a long career ahead of me. Yeah. Safety is the right decision. State farm.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:04-56:14",
    "text" : "Wanna get away? Yeah. Oh, with uh with Leon Let? Um where he's returning the fumble. I guess. Yeah, exactly. And Don B runs him down."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "56:15-56:15"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:15-56:18",
    "text" : "And then it cuts to a southwest commercial. Want to go to Witch."
  },
  {
    "timestamp" : "56:18-56:20",
    "text" : "All right. Homework assignment, come up with your best.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "56:20-56:20",
    "text" : "We just did it.",
    "speaker" : "Andy"
  },
  {
    "text" : "We just did it. I know, but if we really think it through, we'll have some funny ones. All right, fine.",
    "speaker" : "Greg",
    "timestamp" : "56:20-56:25"
  },
  {
    "text" : "I don't think we will, but I appreciate you guys. I appreciate your confidence in us. That'll be your homework because you're not gonna watch the game next week anyway. So that'll be your homework. You come up with your top ten, and then we'll watch it. Oh boy. Alright, let's do best and worst. You don't have neither of you have best or worst. Yeah, I got nothing. Alright, I'll get I'll give you some I'll give you some best and worst. The best is the uh defensive package that the pages are rolling out in the red zone, where you have Richard Seymour playing fullback and Mike Vrabel playing um tight end. And that scored two touchdowns in this game.",
    "timestamp" : "56:25-57:08",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "57:08-57:14",
    "text" : "Oh yeah. And it is a Corey Dillon uh truck stick on Ray Lewis there."
  },
  {
    "text" : "Yeah, yeah, to get in the end zone.",
    "timestamp" : "57:14-57:15",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Exactly. Seymour buckled him too.",
    "timestamp" : "57:16-57:18"
  },
  {
    "text" : "Yep. Yep.",
    "speaker" : "Andy",
    "timestamp" : "57:18-57:19"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "57:19-57:20",
    "text" : "So that uh Seymour in this game."
  },
  {
    "timestamp" : "57:22-57:40",
    "speaker" : "Andy",
    "text" : "That's a great one. Seymour erasing the list. Yeah. So in in this game though, um Richard Seymour was in on all short yardage things as as like the starting fullback. Um could not find anybody to block because the holes were so wide open. So he's he's just running through open Corey Dillon's running around behind him. Dick Seymour Yeah."
  },
  {
    "timestamp" : "57:40-57:43",
    "speaker" : "Greg",
    "text" : "Could not find a hard time handling holes that are too open."
  },
  {
    "speaker" : "Andy",
    "text" : "Just wide open holes that you that you're running dick somewhere.",
    "timestamp" : "57:44-57:46"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "57:46-58:04",
    "text" : "Mom told me this this weekend that um she can't call people dick. I was like, what? Like she was like, people like Richard, I can't call him Dick. And I was like, why not? She goes, oh well in England, that's like A slang for penis. And I was like, there's a slang for penis everywhere."
  },
  {
    "timestamp" : "58:06-58:08",
    "speaker" : "Mom",
    "text" : "Very naughty."
  },
  {
    "timestamp" : "58:08-58:17",
    "text" : "Oh God. I said we're all we're just not all like five-year-olds that can't, you know. Say a word without fucking giggling to ourselves.",
    "speaker" : "Greg"
  },
  {
    "text" : "Sometimes a naughty boy.",
    "timestamp" : "58:17-58:19",
    "speaker" : "Mom"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh my goodness. You can't take those people anywhere. Oh fuck. Oh, all right. So that's good. Um another quality note for this 2004 Patriots off the Patriots team in general is they have more college graduates than any other team. Which apparently makes them smarter. And the entire team loves learning the new game plan every week because it's different every week. And Phil Sims went into a long rant where He would always be excited to get the game plan. And it was all and you know, if it was the same as last week, he'd get all pissed off. He's like, oh, we're running the same plays as we did last week. That's not gonna work. So this team, full of smart guys.",
    "timestamp" : "58:21-59:00"
  },
  {
    "text" : "We could see that.",
    "timestamp" : "59:01-59:02",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Did you know uh Ryan Fitzpatrick went to Havid?",
    "timestamp" : "59:02-59:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, I didn't know Havid.",
    "timestamp" : "59:05-59:07"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "59:07-59:07"
  },
  {
    "speaker" : "Greg",
    "text" : "Cool.",
    "timestamp" : "59:08-59:09"
  },
  {
    "text" : "Also a nice uh fun stat for um what's his face if he still listens, the uh Adam Vinitary apologist. Corey was his face? I don't think it's Connor. Connor. Whatever the hell's name is. Yeah, if he's not too busy um mangling stakes on his Facebook page. Ooh, trigger Adam. Adam and Atari, uh four of New England's six playoff games, one by Adam and Atari kicks. It's pretty impressive. That's pretty good. It's not bad. It's a pretty good average. So uh don't tell him. Uh also Richard Seymour in uh fullback position, actually pass blocking, which is impressive. Although I feel like it's kind of defeating the purpose because isn't he like almost seven feet tall? So you're not gonna throw the football over.",
    "speaker" : "Andy",
    "timestamp" : "59:11-59:58"
  },
  {
    "speaker" : "Greg",
    "text" : "I got some best here. Okay, give me some best. We got a lot of funny names on this team, this Ravens team. Give me some funny names. Darnell Dinkins. Yeah. TJ Slaughter. This is my favorite name.",
    "timestamp" : "01:00:01-01:00:15"
  },
  {
    "timestamp" : "01:00:15-01:00:16",
    "text" : "He's a linebacker too.",
    "speaker" : "Steve"
  },
  {
    "text" : "That's a solid linebacker name.",
    "speaker" : "Andy",
    "timestamp" : "01:00:17-01:00:18"
  },
  {
    "speaker" : "Greg",
    "text" : "BJ Sam's Club, which is like a combination of BJ's and Sam's Club. Um, and then my personal favorite, Kelly Gregg. Me and my laugh.",
    "timestamp" : "01:00:18-01:00:33"
  },
  {
    "text" : "Yeah. That's uh very similar to uh Steve Gregory.",
    "timestamp" : "01:00:33-01:00:37",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:00:37-01:01:02",
    "speaker" : "Greg",
    "text" : "Two G's though, which early never trust a Greg with two G's. Oh you gotta see this guy too. Oh boy. Boy got a neck on him. He's also like go to his fall reference picture. Oh god. Looks like he's like biting his lip too. What? What position?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:01:02-01:01:05",
    "text" : "Oh, dude, his neck is as wide as his head."
  },
  {
    "timestamp" : "01:01:05-01:01:05",
    "speaker" : "Greg",
    "text" : "Uh-huh."
  },
  {
    "speaker" : "Steve",
    "text" : "Holy shit.",
    "timestamp" : "01:01:06-01:01:07"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:01:07-01:02:06",
    "text" : "Kelly Greg. Oh yeah. Oh boy. Is he on the toilet while this picture's been taken? He looks like my my six-week old who's when he's filling his diaper. He's got that look to him. Yeesh, bud. You should send you to your wife. Greg, you should send it to your wife. Yeah. See what see what she has to say. My wife I'm sure she'll uh she'll be very appreciative of that. All right. Uh Troy Brown. Another uh Another best, I would say. Uh playing slot cornerback, making a tackle in the fourth quarter on whoever the running back was, Chester Taylor, I think it was. That's hard to do when you're Troy Brown size. Make it a in in the uh in the open field, preventing a first down. Also playing cornerback, Eugene Wilson has shifted from safety because they just don't have enough cornerbacks. So he's not playing cornerback, Greg Brown. That was just for you. Yeah."
  },
  {
    "text" : "I didn't know we went back.",
    "speaker" : "Steve",
    "timestamp" : "01:02:06-01:02:07"
  },
  {
    "timestamp" : "01:02:08-01:02:10",
    "speaker" : "Andy",
    "text" : "And that's kind of all I have."
  },
  {
    "text" : "Thoughts on uh Russia and Ukraine real quick. The false flag, Greg geopolitical podcast now. The false flag.",
    "timestamp" : "01:02:12-01:02:22",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "They're just trying to get rid of the Nazis.",
    "timestamp" : "01:02:23-01:02:25"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, it's a peacekeeping mission.",
    "timestamp" : "01:02:26-01:02:28"
  },
  {
    "text" : "That's a special operation to remove the Nazis. Yeah, denazification.",
    "timestamp" : "01:02:29-01:02:33",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. By bombing Holocaust museums.",
    "timestamp" : "01:02:33-01:02:36"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:02:36-01:02:36",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:02:37-01:02:37",
    "speaker" : "Andy",
    "text" : "Fuck yeah."
  },
  {
    "text" : "And assassinating.",
    "timestamp" : "01:02:37-01:02:38",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:02:40-01:02:41",
    "speaker" : "Steve",
    "text" : "That's a false. Okay."
  },
  {
    "timestamp" : "01:02:43-01:02:45",
    "text" : "What is uh Steve? Have you heard anything from Ovechkin?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:02:46-01:02:50",
    "text" : "Uh I think he's like anti-to it, but a lot of sponsors are dropping him.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:02:50-01:03:07",
    "speaker" : "Greg",
    "text" : "We're talking about dropping. Interesting. Well, New Hampshire has taken the bold, courageous step of not selling Russian vodka at their liquor stores. They're state run liquor stores. Correct. Problem solved. Yeah. Virginia too, baby."
  },
  {
    "speaker" : "Andy",
    "text" : "There'll be there'll be peace in no time.",
    "timestamp" : "01:03:07-01:03:09"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Really putting the pressure on.",
    "timestamp" : "01:03:09-01:03:11"
  },
  {
    "text" : "Live free or die.",
    "timestamp" : "01:03:12-01:03:13",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:03:13-01:03:14",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:03:16-01:03:35",
    "speaker" : "Andy",
    "text" : "Economic sanctions, baby. Speaking of taking it easy, Bill Belichick. Uh basically just did walkthroughs in this this the week prior to this because he knew this would be such a physical game because it's the Baltimore Ravens. That's a good smart. Greg, is that a sign of his genius or him going soft?"
  },
  {
    "text" : "I think it's him going soft.",
    "speaker" : "Greg",
    "timestamp" : "01:03:36-01:03:38"
  },
  {
    "text" : "I am shocked that you would think that.",
    "timestamp" : "01:03:39-01:03:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm on team Belichick here.",
    "timestamp" : "01:03:41-01:03:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Me too. Just another sign of him being ahead of the curve.",
    "timestamp" : "01:03:43-01:03:48"
  },
  {
    "timestamp" : "01:03:48-01:03:50",
    "text" : "Got his finger on the pulse of the team.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:03:50-01:03:53",
    "speaker" : "Andy",
    "text" : "Yep. Absolute genius. I think they should do that every week."
  },
  {
    "speaker" : "Greg",
    "text" : "Just walkthroughs.",
    "timestamp" : "01:03:53-01:03:54"
  },
  {
    "text" : "Walkthroughs.",
    "timestamp" : "01:03:54-01:03:55",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, players players don't need to practice.",
    "speaker" : "Greg",
    "timestamp" : "01:03:56-01:03:59"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:04-01:04:07",
    "text" : "That sounds like some Jacksonville Jaguar shit right there, Craig."
  },
  {
    "text" : "Is that your strategy on the golf course, Craig? At some point when they're pro, they don't need to practice. I don't think I agree with that, Greg. I don't think a lot of players agree with that either. A lot of pro players are probably talking about it.",
    "speaker" : "Greg",
    "timestamp" : "01:04:07-01:04:21"
  },
  {
    "timestamp" : "01:04:21-01:04:24",
    "speaker" : "Andy",
    "text" : "I think Urban Meyer would probably agree with you."
  },
  {
    "timestamp" : "01:04:24-01:04:27",
    "speaker" : "Greg",
    "text" : "Andrew Whitworth, that guy hasn't practiced in like four years."
  },
  {
    "text" : "I I'm sure there are some people who don't need to practice. Yeah.",
    "timestamp" : "01:04:27-01:04:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:04:31-01:04:34",
    "text" : "Tom Black might need to practice anymore either, but."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:34-01:04:34",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:04:35-01:04:37",
    "speaker" : "Steve",
    "text" : "Players. Yeah, it's a fair practice."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. It's it's more situational.",
    "timestamp" : "01:04:37-01:04:38"
  },
  {
    "speaker" : "Greg",
    "text" : "Younger you are, maybe you need it.",
    "timestamp" : "01:04:39-01:04:40"
  },
  {
    "timestamp" : "01:04:41-01:04:48",
    "speaker" : "Andy",
    "text" : "I I think I think the Patriots way of of practicing situational football is probably more useful to professionals than"
  },
  {
    "text" : "But just like hitting each other all the time, that's like not really helping you. I don't think so.",
    "timestamp" : "01:04:49-01:04:55",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Maybe at the beginning of the season to knock the rust off and all that jazz, but you know, preseason shit. And you get in the season, you just want to be healthy, man. Football's a brutal sport.",
    "timestamp" : "01:04:55-01:05:06"
  },
  {
    "timestamp" : "01:05:06-01:05:09",
    "speaker" : "Greg",
    "text" : "That's right. So we should be coaches."
  },
  {
    "speaker" : "Andy",
    "text" : "We should. Let's all uh player coaches. When y'all move back up here, we'll we'll coach a uh pee-wee team and we'll just fucking stomp people.",
    "timestamp" : "01:05:11-01:05:19"
  },
  {
    "text" : "Then we'll just are we're having no practice policy. We'll just practice touchdown celebrations. That's all we practice.",
    "speaker" : "Greg",
    "timestamp" : "01:05:19-01:05:26"
  },
  {
    "speaker" : "Andy",
    "text" : "And Hail Marys. Hail Marys and touchdown celebrations. Everybody go along. All right, week one.",
    "timestamp" : "01:05:28-01:05:35"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:05:36-01:05:47",
    "text" : "NFL Blitz. What was it? The one where the bomb? NFL Street. What's the matter? Is that what it was? It was something like that, yeah. We just everyone was just go routes. I used to run every play."
  },
  {
    "timestamp" : "01:05:47-01:06:05",
    "speaker" : "Andy",
    "text" : "Of course. That's literally every Madden game. Fucking love that shit. It should be fun. Football should be fun. Everybody should have as much fun as Beast Mode. That's right. As Junior now look at him, giggling and he gets tackled."
  },
  {
    "text" : "See what happens to him? He they like they beat it out of him",
    "timestamp" : "01:06:05-01:06:09",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:06:09-01:06:11",
    "text" : "Yeah. I'm only here, so I don't get fined.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. They beat it out of them, dude.",
    "timestamp" : "01:06:11-01:06:13",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:06:13-01:06:20",
    "text" : "It's crazy to watch that. Yeah, but then corporate culture steps in and says, hey, we're Skittles, we'll give you millions of dollars.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:06:22-01:06:29",
    "text" : "Yeah. So yeah, he's probably doing all right now. But that's because he's out of the league, right? He's out of the league. He's able to be himself again.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:06:29-01:07:09",
    "text" : "Remember when he got kicked out of the game and then he just went up and sat in the stands? No. Yeah, you got ejected. This is when he was on the Raiders right at the end. He got ejected. And he had some street clothes and he just went and watched the rest of the game from with the fans. The guy is just he You know, there's like some players that like once they get famous, you get like annoyed with them because you're like, all right, they're like self-aware now and they're like playing into it. He just always struck me as the most authentic Even though he is popular guy, you know? Kind of like Ricky Williams. Yeah, Ricky was very similar. Yep. Like where it's just too strange to be put on. Yeah."
  },
  {
    "timestamp" : "01:07:09-01:07:15",
    "speaker" : "Andy",
    "text" : "Yeah. Anybody else in that list? I can't think of it."
  },
  {
    "text" : "Aaron Donald. Football player.",
    "speaker" : "Steve",
    "timestamp" : "01:07:15-01:07:23"
  },
  {
    "text" : "You gotta stress the player. Uh Steven Adams, the guy the big center guy from New Zealand, the Kiwi. He's pretty awesome. Okay.",
    "speaker" : "Greg",
    "timestamp" : "01:07:24-01:07:34"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, and the MBA?",
    "timestamp" : "01:07:34-01:07:36"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Oh. He's probably just because he has a New Zealand accent though.",
    "timestamp" : "01:07:36-01:07:41"
  },
  {
    "timestamp" : "01:07:42-01:07:49",
    "text" : "Probably. Um where uh where would you fit Tom Brady on that scale?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07:50-01:07:52",
    "speaker" : "Greg",
    "text" : "He's pretty self-aware now, isn't he?"
  },
  {
    "timestamp" : "01:07:52-01:07:54",
    "speaker" : "Steve",
    "text" : "Oh yeah, he is a crafted image."
  },
  {
    "speaker" : "Greg",
    "text" : "That's true.",
    "timestamp" : "01:07:54-01:07:55"
  },
  {
    "speaker" : "Steve",
    "text" : "You saw him transition it, honestly. Back and now you see the fame changes.",
    "timestamp" : "01:07:55-01:07:59"
  },
  {
    "timestamp" : "01:08:00-01:08:01",
    "text" : "Steve's right. Yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "But his his uh His social media accounts are still pretty like I I think self-aware of like not being Too big. He's still got a good sense of humor about it, no?",
    "speaker" : "Andy",
    "timestamp" : "01:08:02-01:08:16"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:17-01:08:19",
    "text" : "He's got a very carefully crafted public image, Andy."
  },
  {
    "text" : "That's probably true.",
    "timestamp" : "01:08:20-01:08:21",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:08:21-01:08:33",
    "speaker" : "Greg",
    "text" : "Yeah, I don't think the image is like True. Bad or annoying or anything. It's just it's not. I don't get the vibe that it's him being his true self and not being Marshaw Lynch out there and everyone thinking it's funny."
  },
  {
    "timestamp" : "01:08:33-01:08:37",
    "speaker" : "Steve",
    "text" : "He's in got a bunch of people helping him be funny. Yeah, maybe, maybe."
  },
  {
    "text" : "I feel like less so now that he's on the box, I feel like you kind of saw a bit more of who he actually was. I don't know.",
    "speaker" : "Andy",
    "timestamp" : "01:08:38-01:08:46"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:46-01:08:47",
    "text" : "I don't think so."
  },
  {
    "timestamp" : "01:08:47-01:08:49",
    "text" : "What about the Manning brothers?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Here's the thing. The bigger the buttons, the more authentic Tom Brady was. Once that butt chin went away, so did the authenticity.",
    "timestamp" : "01:08:49-01:08:57"
  },
  {
    "text" : "What about uh Eli Manning talking shit to his brother on uh That feels authentic.",
    "timestamp" : "01:08:57-01:09:01",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Again, he feels like an autist that doesn't know how to do it, you know, like how to be like sort of so when he comes out of his mouth, you're like, well, that's real.",
    "timestamp" : "01:09:02-01:09:11"
  },
  {
    "text" : "Yeah, well that's a good. Oh, he's he's he's flipping the birds on national television. Yep.",
    "timestamp" : "01:09:11-01:09:15",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:09:15-01:09:21",
    "text" : "Where Peyton very much is aware he has those social skills. He knows what plays and what doesn't.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:09:21-01:09:29",
    "text" : "Very Tom Brady esque. Yeah. Yeah. But charming about it. Right. Yeah, that's fair. All right."
  },
  {
    "text" : "All right, I gotta go to bed.",
    "timestamp" : "01:09:30-01:09:31",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:09:31-01:09:34",
    "text" : "Yes. Oh, you pull your tank."
  },
  {
    "text" : "Yeah. You're lucky if you talk to you, Greg.",
    "timestamp" : "01:09:34-01:09:37",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:09:37-01:09:39",
    "speaker" : "Greg",
    "text" : "Montezuma's revenge."
  },
  {
    "timestamp" : "01:09:41-01:09:46",
    "speaker" : "Steve",
    "text" : "The doctor called it uh traveler's diarrhea. That's the medical term."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, you try sticking a finger up there, Steve, see what happens. No, I haven't. I'll go do that though. Well, don't do it because you may never uh You m once you pop, you just can't stop, as they say in the commercials.",
    "timestamp" : "01:09:46-01:09:59"
  },
  {
    "speaker" : "Andy",
    "text" : "That's terrible. All right. Speaking of poop, uh next week. We are in Cleveland to visit the three and eight Cleveland Browns. Who's that starting quarterback, Greg? Coming off a huge game.",
    "timestamp" : "01:10:02-01:10:18"
  },
  {
    "speaker" : "Steve",
    "text" : "Coming off a huge game.",
    "timestamp" : "01:10:18-01:10:19"
  },
  {
    "speaker" : "Andy",
    "text" : "Carson Palmer. That they lost. For the Browns? Carson Palmer?",
    "timestamp" : "01:10:19-01:10:25"
  },
  {
    "speaker" : "Greg",
    "text" : "No.",
    "timestamp" : "01:10:25-01:10:25"
  },
  {
    "timestamp" : "01:10:26-01:10:26",
    "speaker" : "Andy",
    "text" : "The Bengals."
  },
  {
    "timestamp" : "01:10:27-01:10:29",
    "speaker" : "Greg",
    "text" : "Wait, are we playing the Browns or the Bengals?"
  },
  {
    "text" : "Browns. Cleveland.",
    "timestamp" : "01:10:29-01:10:30",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:10:30-01:10:31",
    "speaker" : "Greg",
    "text" : "Browns."
  },
  {
    "text" : "That's Kelly Holcomb. Talking of poop. Right. Yeah. So your boy Kelly Holcomb.",
    "speaker" : "Andy",
    "timestamp" : "01:10:31-01:10:34"
  },
  {
    "speaker" : "Steve",
    "text" : "Talking poop, nice handy.",
    "timestamp" : "01:10:35-01:10:36"
  },
  {
    "text" : "In Cleveland. Pat's going for, I don't know, another win. They're 11th on the season.",
    "timestamp" : "01:10:36-01:10:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "William Green, just the guy we were talking about.",
    "timestamp" : "01:10:43-01:10:46"
  },
  {
    "speaker" : "Andy",
    "text" : "William Green. There you go. Boston calls. So maybe this will be another barn burner. Or maybe only one team will score a lot of points. We shall find out next week. TJ Hoosh Mazoo, the Patriots Dynasty Podcast. See you later.",
    "timestamp" : "01:10:47-01:11:04"
  },
  {
    "text" : "See you later. Yep later.",
    "speaker" : "Greg",
    "timestamp" : "01:11:04-01:11:06"
  }
]