[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen?",
    "timestamp" : "00:00-00:14"
  },
  {
    "text" : "Welcome back to the Pagers Dynasty Podcast. The podcast where we're going back. My brothers and I are re-watching every game. of the Pagers Dynasty era, including this one, unfortunately. Uh I'm your host, Andy Brown. With me are the aforementioned brothers. Steven, how are you?",
    "speaker" : "Andy",
    "timestamp" : "00:22-00:40"
  },
  {
    "text" : "Good. Do you ever get weird looks when you tell people about this podcast and what you're doing?",
    "timestamp" : "00:40-00:44",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, I just don't tell them.",
    "timestamp" : "00:44-00:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Really? Me neither. This is a secret podcast for you guys. You don't tell people in your lives that you do this?",
    "timestamp" : "00:47-00:52"
  },
  {
    "speaker" : "Andy",
    "text" : "I tell some people. I only tell people if they ask.",
    "timestamp" : "00:52-00:55"
  },
  {
    "timestamp" : "00:55-01:11",
    "speaker" : "Steve",
    "text" : "Oh, I tell people. And then I know. They go every game? And they go, yeah. Do you watch the whole game? Mostly. I did not watch all of this game though. I watched until about 11 minutes left and then I turned it off."
  },
  {
    "timestamp" : "01:11-01:23",
    "speaker" : "Andy",
    "text" : "Yeah, well see I I have limited time these days and I was a little angry by the end of watching this one that we actually Decided to watch this whole fucking game and did this episode. Boo hoo, Andy."
  },
  {
    "speaker" : "Greg",
    "text" : "They lose one game in like 35 and 10.",
    "timestamp" : "01:23-01:26"
  },
  {
    "text" : "This is what I'm saying. I forget I forgot how to do it. Forgot how to watch Patriots losses. The good game along. Did you it was until the end?",
    "speaker" : "Andy",
    "timestamp" : "01:26-01:35"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:36-01:44",
    "text" : "I did not watch it, no. But there was a a good highlight package, like a good 13-minute highlight package. The"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, the extended one. Yeah, yeah.",
    "timestamp" : "01:44-01:45"
  },
  {
    "timestamp" : "01:45-01:47",
    "speaker" : "Greg",
    "text" : "Yeah. Where you get a good flow of the game."
  },
  {
    "timestamp" : "01:48-01:57",
    "speaker" : "Andy",
    "text" : "Yeah. All right. We'll we'll link all those. Because we've had people asking for where to watch these. So this would the the game is on YouTube. Highlights are on YouTube and the extended highlights also on YouTube."
  },
  {
    "speaker" : "Steve",
    "text" : "Well, let's put a watchability score on it right away.",
    "timestamp" : "01:57-01:59"
  },
  {
    "timestamp" : "02:00-02:12",
    "speaker" : "Andy",
    "text" : "Well, it's a name game. They this game legit well is it wasn't named by the Patriots. No. But when you're uh a Miami franchise who hasn't won anything since the 1970s."
  },
  {
    "speaker" : "Greg",
    "text" : "Let's see if Steve can name it. Because he clearly by his face I can tell he doesn't understand his game as a nickname. And it's the most douchey nickname You could ever name a game.",
    "timestamp" : "02:13-02:25"
  },
  {
    "speaker" : "Steve",
    "text" : "The touchy feely game.",
    "timestamp" : "02:25-02:26"
  },
  {
    "timestamp" : "02:28-02:29",
    "text" : "It's not bad, but no.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "02:30-02:34",
    "text" : "AJ Feely is a quarterback, and that's so fucking sad for this defense.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Well I don't think it was the defense that really did anything.",
    "timestamp" : "02:35-02:37"
  },
  {
    "text" : "Monday night football comeback game?",
    "speaker" : "Steve",
    "timestamp" : "02:37-02:40"
  },
  {
    "speaker" : "Andy",
    "text" : "That's not very douchey. That's just boring.",
    "timestamp" : "02:40-02:42"
  },
  {
    "timestamp" : "02:42-02:55",
    "text" : "It was called the night that courage wore orange. Which for the record, courage, orange, don't rhyme. They don't. Like the joke is that orange doesn't rhyme with anything, right? Remember?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "02:56-02:56",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "When you're like a kid.",
    "speaker" : "Greg",
    "timestamp" : "02:56-02:58"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:58-03:00",
    "text" : "Didn't MM rhyme it with doorhing?"
  },
  {
    "timestamp" : "03:02-03:06",
    "speaker" : "Greg",
    "text" : "Courageous. Some writer for the bleacher report."
  },
  {
    "text" : "Yeah, oh yeah, definitely a definitely a dolphin story.",
    "speaker" : "Andy",
    "timestamp" : "03:06-03:08"
  },
  {
    "text" : "It's a journalist that obviously. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "03:09-03:11"
  },
  {
    "timestamp" : "03:11-03:14",
    "text" : "Well, obviously. I don't know about obviously.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "03:15-03:16",
    "speaker" : "Steve",
    "text" : "That's so sad."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:16-03:18",
    "text" : "Could you could you give it a better name, Greg?"
  },
  {
    "text" : "Courageous. I don't get the courage part.",
    "timestamp" : "03:18-03:20",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Well will they will they So the idea was that uh the dolphins came in at 2 and 11. Uh Patriots are what eleven and one, twelve and one?",
    "timestamp" : "03:20-03:31"
  },
  {
    "text" : "Yeah. Yeah.",
    "timestamp" : "03:31-03:32",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:32-03:44",
    "speaker" : "Andy",
    "text" : "And uh the Dolphins, the wheels fell off earlier this season when Uh Ricky Williams retired like the day before training camp so he could go to Europe and smoke a bunch of weed."
  },
  {
    "timestamp" : "03:46-03:49",
    "text" : "That's not weed shame on 421, Andy, okay?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:49-03:57",
    "text" : "I'm not weed shaming. I'm just saying that that that was his reason for quitting, right? Because the league wouldn't let him smoke weed. So he just said, fuck it, I'm gonna go do it myself then."
  },
  {
    "timestamp" : "03:57-03:58",
    "speaker" : "Steve",
    "text" : "Now look at him."
  },
  {
    "timestamp" : "03:58-04:16",
    "text" : "Right. Yeah. Um and so they actually had two of their games postponed due to hurricanes as well. Uh so they came in, this is a Monday night game, you know, supposed to be highly taken. And their coach retired. Well yeah, well did he retire or did he get fired?",
    "speaker" : "Andy"
  },
  {
    "text" : "I think he got fired.",
    "timestamp" : "04:16-04:18",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, because they were talking about the interim head coach, whoever the fuck he was. Um was in this game. He was Jim Bates. Interim head coach.",
    "speaker" : "Andy",
    "timestamp" : "04:18-04:31"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "04:32-04:34",
    "text" : "Dolicek in Cleveland too, in Saban."
  },
  {
    "speaker" : "Andy",
    "text" : "Did he? I saw I know the I saw the saving piece, but Jim Bates. Huh. Well, Jim Bates claimed to fame. He's 1-0 against Bill Belichick. Because as Steve alluded to, um they would not rehire him at the end of this the season, even though there was a lot of talk about how he would get an interview. But they would instead go with uh then LSU head coach Nick Saban. And there was a lot of excitement around that because Nick Saban, hadn't he just won the championship? uh football college football championship.",
    "timestamp" : "04:34-05:14"
  },
  {
    "speaker" : "Greg",
    "text" : "Probably he wins it every other year.",
    "timestamp" : "05:14-05:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. But I mean even back in two thousand four. LSU?",
    "timestamp" : "05:16-05:20"
  },
  {
    "timestamp" : "05:20-05:21",
    "speaker" : "Steve",
    "text" : "He wouldn't shut the fuck up about it in this game though."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:22-05:51",
    "text" : "Yeah, he was winning LSU too. Yeah. So constantly. But yeah, basically, and the Pats went up. They're up 28-17 in the fourth. Uh, with like four minutes left, Pages scored to make it 28-17. And so everybody's like, oh, well, you know, most teams, you know, two and eleven. You're down. You don't have any of your players. And they were actually missing uh Zach Thomas as well in this game from injury. So they're just like down a bunch of players, down late."
  },
  {
    "speaker" : "Steve",
    "text" : "Spread was ten and a half points too.",
    "timestamp" : "05:52-05:54"
  },
  {
    "timestamp" : "05:54-05:56",
    "speaker" : "Andy",
    "text" : "Yeah, and they still came back."
  },
  {
    "speaker" : "Steve",
    "text" : "We must have been feeling pretty good. Patriots up 11, four minutes left. Spread ten and a half.",
    "timestamp" : "05:56-06:01"
  },
  {
    "timestamp" : "06:01-06:41",
    "text" : "Happening as it always did, you know, all season. Yeah. And then uh for some reason Tom Brady turned back into true blood so sorry mom, but it's true. throwing the back breaking interception as he's falling over, throwing it basically over his shoulder. Gets intercepted and returned to like the 10-yard line. To set up a touchdown and bring it within a couple of points, 28-23, uh, because they tried the two-point conversion and failed. Um, and then A few. Hmm. I'm not sure if that's right.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, you got it wrong. They scored a touchdown, missed two-point conversion, then he threw the pick. And then two minutes left. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "06:41-06:47"
  },
  {
    "text" : "How courageous of them.",
    "timestamp" : "06:47-06:48",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "So courageous, dude. Yeah. We're talking about professional athletes here. It's not some fucking like scrub YMCA team. They're getting paid millions of dollars to play these games. Like what else are they gonna do? Not show up?",
    "timestamp" : "06:49-07:01"
  },
  {
    "text" : "And it's not like if you lose, they're gonna fucking kill you.",
    "timestamp" : "07:01-07:04",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Right. And Tom Brady threw four interceptions.",
    "timestamp" : "07:04-07:06"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, this isn't collaborative.",
    "timestamp" : "07:07-07:08"
  },
  {
    "timestamp" : "07:08-07:09",
    "speaker" : "Greg",
    "text" : "Brady melted down."
  },
  {
    "text" : "Yeah, that's what I'm saying. He turned into uh Drew Bledsoe at the end there, throwing interceptions all over the place.",
    "timestamp" : "07:09-07:14",
    "speaker" : "Andy"
  },
  {
    "text" : "And this is what the second time that they wore orange. That's the other part of that statement, right? Exactly.",
    "timestamp" : "07:15-07:19",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean to be fair, the orange jerseys were sweet. Yeah.",
    "timestamp" : "07:22-07:24"
  },
  {
    "text" : "Creamsicles.",
    "speaker" : "Andy",
    "timestamp" : "07:24-07:25"
  },
  {
    "text" : "Yeah. Orange, orange, like Florida orange, you know.",
    "timestamp" : "07:25-07:30",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Like traffic cone orange?",
    "timestamp" : "07:30-07:32"
  },
  {
    "timestamp" : "07:32-07:35",
    "text" : "Like halftime orange is orange. Yes.",
    "speaker" : "Greg"
  },
  {
    "text" : "Those are more yellow.",
    "timestamp" : "07:35-07:36",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:36-07:39",
    "speaker" : "Steve",
    "text" : "Dude halftime oranges are the shit."
  },
  {
    "text" : "Yep.",
    "speaker" : "Greg",
    "timestamp" : "07:39-07:39"
  },
  {
    "text" : "When I coach soccer, I'd always make the parents bring those and I'd eat like half of them.",
    "timestamp" : "07:40-07:44",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "You put it in your mouth, like a whole orange mouth card?",
    "timestamp" : "07:44-07:46"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "07:47-07:49",
    "text" : "Yeah, 100% every single time."
  },
  {
    "speaker" : "Greg",
    "text" : "That's true. I might start bringing them to my over 30s. Do it.",
    "timestamp" : "07:50-07:54"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:54-07:58",
    "text" : "Oh, that's not bad. That's a strong play. That's a strong play."
  },
  {
    "speaker" : "Greg",
    "text" : "Especially for the over 30s. Orange slices, yeah, because that generation was fucking with oranges.",
    "timestamp" : "07:58-08:03"
  },
  {
    "text" : "Parents would be bringing like snacks like caprice sons and like it would fruit snacks and stuff and I'm like no no fruit snacks we need again oranges oranges I'm only doing this for the oranges so maybe I'll accept the go-gurt Well, can I bring oranges and snacks? Shit, I don't give a shit as long as there's orange here. You guys come on, you know, figure it out amongst yourselves who's bringing oranges which week. Right?",
    "timestamp" : "08:04-08:33",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "08:34-08:54",
    "text" : "Oh yeah. Okay then. Oranges. But yeah, so that that's that's the where the name came from. So this is now two games, two regular season games. In seasons where the Dolphins have not made the playoffs that they have named just from beating the Patriots. Right.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "08:54-08:55",
    "text" : "What was the other game?"
  },
  {
    "speaker" : "Andy",
    "text" : "Miami Miracle.",
    "timestamp" : "08:56-08:57"
  },
  {
    "text" : "I mean, you know, you gotta take what you get. Colts are in there hanging banners for just making the playoffs. So",
    "timestamp" : "08:59-09:03",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. But this is why nobody's doing a podcast about old Dolphins games, I think. Yeah. Cause that's shit.",
    "timestamp" : "09:04-09:10",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know. There's I feel like as New England fans, we don't really see the other side of it. Of like when your team sucks and you have nothing to root for and then the big bad team comes into town and you beat them, like that is a very satisfying win. Cause it's really one of the only reasons you have to celebrate. So it's like I can see like that's corny courage wearing orange, that's corny as shit. But from a fan base, I would never be like, you're not allowed to celebrate this because you're still too, you know, like if you win and your team has nothing to hold on to and they still win, like that's fucking worth celebrating for sure.",
    "timestamp" : "09:12-09:54",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. No, feel free to celebrate it. But naming it, that's uh like all the Bills fans naming the um the wildcard win over the Patriots the perfect game.",
    "timestamp" : "09:53-10:05"
  },
  {
    "timestamp" : "10:05-10:06",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "Because they scored touchdowns.",
    "speaker" : "Andy",
    "timestamp" : "10:06-10:07"
  },
  {
    "speaker" : "Greg",
    "text" : "And now you just say 13 seconds.",
    "timestamp" : "10:08-10:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly.",
    "timestamp" : "10:09-10:10"
  },
  {
    "speaker" : "Greg",
    "text" : "13 seconds is fucking two words that just made my summer so much better. Yeah. Oh yeah. Because anytime I talk to my Bills friends, friends, they can't say a goddamn word. I'll just say thirteen seconds.",
    "timestamp" : "10:11-10:26"
  },
  {
    "text" : "It's gotta hurt so bad.",
    "timestamp" : "10:27-10:28",
    "speaker" : "Steve"
  },
  {
    "text" : "It does. It's gotta fucking break their tiny little hearts.",
    "timestamp" : "10:28-10:31",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's that's tough. Oh man.",
    "timestamp" : "10:35-10:38"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:39-10:43",
    "text" : "Also one of the coldest games in pro player stadium history."
  },
  {
    "speaker" : "Andy",
    "text" : "Really?",
    "timestamp" : "10:43-10:43"
  },
  {
    "speaker" : "Greg",
    "text" : "Really? 52 degrees of kickoff. It got into the 40s.",
    "timestamp" : "10:43-10:47"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "10:47-10:51",
    "text" : "God damn. And the patriots should be in their element."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "10:51-10:51"
  },
  {
    "speaker" : "Andy",
    "text" : "So that that brings me to um my point that the Patriots Fucking struggle in Miami, right? Just generally.",
    "timestamp" : "10:52-11:02"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, we've talked about it on this podcast before.",
    "timestamp" : "11:02-11:04"
  },
  {
    "timestamp" : "11:04-11:08",
    "text" : "We have, but I just wanted to revisit it just how bad it is.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, because I forgot.",
    "timestamp" : "11:08-11:09"
  },
  {
    "timestamp" : "11:09-11:19",
    "speaker" : "Andy",
    "text" : "Right. So the Patriots. Um, under Bill Balichek, uh out of 22 games, how many of those games in Miami do you think the pages have won?"
  },
  {
    "text" : "Ten. Yes, less than half. It might even be like seven.",
    "speaker" : "Steve",
    "timestamp" : "11:19-11:24"
  },
  {
    "timestamp" : "11:26-11:43",
    "speaker" : "Andy",
    "text" : "It was nine. So you're you're not far off. Nine and thirteen in Miami under Bell Check. So 409 win percentage. All time. Belichick actually has more than half of the wins in Miami for the Patriots because they are 17 and 40 all time in Miami."
  },
  {
    "timestamp" : "11:44-11:45",
    "speaker" : "Steve",
    "text" : "That's So brutal."
  },
  {
    "timestamp" : "11:45-11:47",
    "speaker" : "Andy",
    "text" : "That's really that's rough."
  },
  {
    "speaker" : "Steve",
    "text" : "That's bad.",
    "timestamp" : "11:47-11:48"
  },
  {
    "timestamp" : "11:49-12:39",
    "speaker" : "Andy",
    "text" : "And like there doesn't seem to be a reason. It's not like the dolphins ever give them trouble at home because at home the Patriots um have like the opposite uh record. Whoops. I had it too. They are 17 and 5 at home against the Dolphins under Belichick. But for some some reason in Miami every year, you know, I I feel like The media has started to blow it out of proportion a bit, where it's this house of horrors and they've never won there, you know, but I think there's definitely something happening in Miami where the Patriots just cannot win there. Even when you're going up against a two-in-11 Miami team who lost Ricky Williams and is now starting A. J. Feely, their backup quarterback. Yeah, this is a this is a"
  },
  {
    "timestamp" : "12:40-13:11",
    "speaker" : "Greg",
    "text" : "It's the bug a boot, you know? Those things are real. Where it's like players thinking, like they can say, yeah, we don't listen to that shit. We don't care about whatever. We just take it one game at a time, yada yada, yada. But they think about that shit, you know, like like any human does, where it's like, oh, we always lose here, and then like maybe you play a little more tense. Or the other team being like Oh, we always play him pretty well at home. Yeah. And they come in with a little more belief and they, you know, like they're a little more like organized or cookies."
  },
  {
    "text" : "You know, it's like If it's still close down the stretch, you're like fuck here we go again.",
    "speaker" : "Andy",
    "timestamp" : "13:11-13:17"
  },
  {
    "timestamp" : "13:17-13:36",
    "speaker" : "Greg",
    "text" : "If you're always losing and we've all played in those games too where you're like, we should be fucking winning this game. Yeah. And you start getting frustrated, and then you make decisions you wouldn't normally make Maybe you're trying to stack and throw the ball straight up, you know? Like that's not a brief like play. No. Maybe he's not in Miami and maybe he doesn't make that, you know? I don't know."
  },
  {
    "text" : "You can line these teams up. They're probably gonna win 99 out of 100. This is just the one in a hundred. They're the Patriots are a wagon this year and the Dolphins are a mess.",
    "timestamp" : "13:37-13:47",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "13:47-14:11",
    "speaker" : "Andy",
    "text" : "I mean to that point, yeah. The um when the Patriots lost the lead in the third quarter or something. Um because yeah, the no right at the end, yeah. 123 left. The pages lost the lead at the end. And it was the third time this season they have trailed in a football game. That's pretty good. Trailed the Colts and the Steelers, which they eventually lost."
  },
  {
    "timestamp" : "14:11-14:16",
    "speaker" : "Greg",
    "text" : "The Dolphins improved to one and nine when trailing to start the fourth quarter."
  },
  {
    "speaker" : "Andy",
    "text" : "I mean, I I don't think we can overstate how bad this dolphins team was. Um can we not? In week six, let's try our best. Their game with the Buffalo Bills was the only time in the NFL since 1968 that the last two winless teams met each other. They didn't",
    "timestamp" : "14:19-14:34"
  },
  {
    "text" : "He said the Bills.",
    "speaker" : "Steve",
    "timestamp" : "14:36-14:37"
  },
  {
    "speaker" : "Andy",
    "text" : "The Bills.",
    "timestamp" : "14:38-14:38"
  },
  {
    "text" : "Oh. Both in the same division too. That's tough.",
    "timestamp" : "14:39-14:41",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. This is really uh the Bills recovered though, I think.",
    "timestamp" : "14:42-14:45"
  },
  {
    "timestamp" : "14:45-14:50",
    "text" : "I feel this is the beginning of because do you know who won that game?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "The Bills.",
    "timestamp" : "14:51-14:52"
  },
  {
    "speaker" : "Steve",
    "text" : "Right? This is where the Dolphins and Jets and the Bills all go downhill pretty consistently.",
    "timestamp" : "14:53-14:59"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:00-15:08",
    "text" : "Um well the Bills finished nine and seven on the season. They they reeled off a bunch of wins toward the end."
  },
  {
    "text" : "But like 505678910, you know, this is like the malaise of the AFC East era about to begin right now.",
    "timestamp" : "15:09-15:16",
    "speaker" : "Steve"
  },
  {
    "text" : "I mean it wasn't it wasn't great. Um, but the Jets were good this year. No, they finished ten and six. Is this still, I think, isn't this still the end of the uh Chad Pennington era when he was still And Curtis Martin and all that, basically the the team that Belichick and Parcells built over there still going to be.",
    "speaker" : "Andy",
    "timestamp" : "15:17-15:34"
  },
  {
    "speaker" : "Steve",
    "text" : "This is like the end of that team though. I don't think Pennington plays within the end.",
    "timestamp" : "15:34-15:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:37-15:47",
    "text" : "It's true. But I mean Paige finished 14 and 2, and the Jets still finished 10 and 6, and the Bills finished 9 and 7 in a team with a wagon or in a uh division with a wagon. So"
  },
  {
    "speaker" : "Steve",
    "text" : "What did the Dolphins finish? Did they get another?",
    "timestamp" : "15:48-15:50"
  },
  {
    "timestamp" : "15:51-15:52",
    "speaker" : "Andy",
    "text" : "Four and twelve."
  },
  {
    "speaker" : "Greg",
    "text" : "They had a decent defense though. They were eighth in the NFL in defense.",
    "timestamp" : "15:52-15:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "15:56-15:56"
  },
  {
    "text" : "For yards. Yeah, I mean this was a I mean it's a typical Taylor, Patrick Sertan, Zach Thomas, like there's some names back there. Sammy Knight.",
    "speaker" : "Greg",
    "timestamp" : "15:57-16:07"
  },
  {
    "text" : "Yeah. Is this Sammy Knight?",
    "timestamp" : "16:07-16:09",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "16:09-16:11",
    "speaker" : "Greg",
    "text" : "I don't know if I'd throw him in that conversation."
  },
  {
    "text" : "I would. He had a hundred tackles in the season. Four picks, two force fumbles. Maybe. He's up there.",
    "timestamp" : "16:11-16:18",
    "speaker" : "Andy"
  },
  {
    "text" : "Jason Taylor is their best player though.",
    "speaker" : "Steve",
    "timestamp" : "16:19-16:21"
  },
  {
    "timestamp" : "16:21-16:23",
    "speaker" : "Andy",
    "text" : "Yeah. Absolutely disruptive."
  },
  {
    "speaker" : "Steve",
    "text" : "He was so hard to hate.",
    "timestamp" : "16:25-16:26"
  },
  {
    "speaker" : "Andy",
    "text" : "It's true. No problem hating them.",
    "timestamp" : "16:26-16:28"
  },
  {
    "speaker" : "Steve",
    "text" : "Junior Sailor.",
    "timestamp" : "16:28-16:29"
  },
  {
    "speaker" : "Andy",
    "text" : "It comes easy to me though, so I understand what you're saying. But yeah, so the Miami Dolphins beat one team.",
    "timestamp" : "16:29-16:35"
  },
  {
    "text" : "Taylor. You know, Taylor seemed like a better football player. Freene was just a pass rusher.",
    "speaker" : "Steve",
    "timestamp" : "16:35-16:40"
  },
  {
    "timestamp" : "16:39-16:49",
    "speaker" : "Andy",
    "text" : "Yeah, Freeney was and Freene was um, I think he depended on his speed so much so that he was a lot better when you played him in Indianapolis than when he came to New England."
  },
  {
    "timestamp" : "16:51-16:56",
    "text" : "I don't know. I thought that too, but then Freeney was pretty good at the end of his career when he wasn't as fast.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true. Well, I I think he kind of changed his game towards the end of the career.",
    "timestamp" : "16:57-17:00"
  },
  {
    "timestamp" : "17:00-17:22",
    "speaker" : "Greg",
    "text" : "Yeah. But yeah, no, it's like a that that spin move from Vrene was just it was like it must have been so good because like everyone knew it was coming and still there wasn't a man in the league that could stop it. And it's like, how? Yeah. It must have been just impossible to defend because it just seemed like it always."
  },
  {
    "text" : "it he coupled it with his speed move that you had to and his speed was so fast off that corner you had to basically almost cheat to make sure you stopped that. And if you're cheating to stop that, he can then just be with that spin move.",
    "timestamp" : "17:24-17:37",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "17:37-17:56",
    "speaker" : "Greg",
    "text" : "Yeah. Jason Taylor, we're in the thick of his prime too. 2002, he had 18 and a half sacks. Oh boy. That's a lot. 2003, he had 13, 2004, 9. 5, then 12, 13 and a half, and 11. So we're in like the meat, his down year in the meat of his prime."
  },
  {
    "timestamp" : "17:57-18:04",
    "text" : "Right. But he still had what one sack in this game? Two sacks? Something like that? He definitely got to Brady a bunch. I don't know.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:04-18:08",
    "text" : "Kevin Fall got nine yards and he still chased him down.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "18:08-18:08"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "18:08-18:12",
    "text" : "Strip the ball after Kevin Ball was on the ground, you know, just playing all the way through."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "18:12-18:13"
  },
  {
    "timestamp" : "18:13-18:17",
    "text" : "Where Freeni would be like 20 yards in the, you know, backfield.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "18:17-18:19",
    "speaker" : "Andy",
    "text" : "Yeah, that's true. Yeah, free would overrun things a lot."
  },
  {
    "text" : "That on the screen super hard. Yep.",
    "timestamp" : "18:20-18:22",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "18:23-18:31",
    "text" : "Here's a question. A little theoretical question. Who's the Patriots dynasty best ever past rusher?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Best ever pass rusher?",
    "timestamp" : "18:32-18:33"
  },
  {
    "speaker" : "Greg",
    "text" : "Mm-hmm. Just pure rushing the quarterback.",
    "timestamp" : "18:34-18:36"
  },
  {
    "timestamp" : "18:37-18:38",
    "speaker" : "Andy",
    "text" : "Uh Willie McGuinness."
  },
  {
    "timestamp" : "18:39-18:42",
    "speaker" : "Greg",
    "text" : "Ooh. Okay. You guys had different answers. Please discuss."
  },
  {
    "text" : "Steve, who did you say?",
    "speaker" : "Andy",
    "timestamp" : "18:42-18:44"
  },
  {
    "timestamp" : "18:44-18:45",
    "speaker" : "Steve",
    "text" : "Chandler Jones."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:45-18:47",
    "text" : "That's a pretty good one too. Yeah."
  },
  {
    "text" : "You're pure pass rusher, he was the best.",
    "timestamp" : "18:47-18:49",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh Willie McGuinness set the record the NFL record for sacks in a postseason. So I think he I think he I don't know if he still has it, but he has the most ever sacks the NFL in the postseason. That's true. But I don't think he played on the pages long enough for him to be like.",
    "timestamp" : "18:49-19:10"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:10-19:19",
    "text" : "But if you're saying who was our best pass rusher for whatever period of time they're on the team, it's definitely Chandler. I can't think of anyone who is just a pure pass rusher like he was."
  },
  {
    "speaker" : "Greg",
    "text" : "Most talented, I would say, is probably Chandler Jones from purely past rushing. Best or most legendary, Willie's probably Yeah, person.",
    "timestamp" : "19:20-19:29"
  },
  {
    "text" : "I mean they've rented a few of them.",
    "timestamp" : "19:30-19:32",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "19:32-19:34",
    "speaker" : "Greg",
    "text" : "Um I feel like they mow through them all the time."
  },
  {
    "text" : "Yeah. They they usually do like one-year rentals of some elite pass rusher off the end. Um Like who is that guy from the Browns they had uh around the Falcon Super Bowl era? Oh, and they had um Kyle Long as well. Dreads. Yeah. Yeah, yeah, yeah. Uh Jabal Sheard, wasn't that him?",
    "speaker" : "Andy",
    "timestamp" : "19:35-19:53"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "19:53-19:54"
  },
  {
    "text" : "So they they've always kind of rented them, the the high-end guys, but I think like if you're talking about guys that they've drafted, I think Chandler Jones and or William McGinnis.",
    "timestamp" : "19:54-20:03",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "20:03-20:13",
    "text" : "My favorite are the scrub guys who get a bunch of sacks and then make a shitload of money. Tell you Benton Kane. What's his name? Like Mark Anderson or something.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:13-20:14",
    "text" : "Oh yes, that's right."
  },
  {
    "text" : "Mark Anderson.",
    "timestamp" : "20:14-20:14",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "20:17-20:36",
    "text" : "Wow, that's a pull, Steve. That is a pull. That's not bad though. I mean you could say the you could almost say the same about uh Trey Flowers. Not that he got the sacks, but the pages put him in such a good position that he went off and got a big old payday from Um Detroit and now might come back this year is the rumor.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "20:36-20:38",
    "text" : "But that deal's not done yet."
  },
  {
    "speaker" : "Andy",
    "text" : "Same with Jamie Collins too, right? Yeah.",
    "timestamp" : "20:38-20:40"
  },
  {
    "timestamp" : "20:40-20:42",
    "speaker" : "Steve",
    "text" : "Hakeem Hicks."
  },
  {
    "timestamp" : "20:42-20:43",
    "speaker" : "Andy",
    "text" : "Yeah, yeah."
  },
  {
    "text" : "A lot of Calvin Noi.",
    "speaker" : "Steve",
    "timestamp" : "20:43-20:44"
  },
  {
    "text" : "Calvan Noy, yeah, it's Bowser. Uh all right. Um What about this? Who is the best um project that the Patriots have ever like converted into a legitimate football player. I know where you're going with this. Yeah. Because they would they would talk about this incessantly. Constantly, yeah. Um but are there any others?",
    "timestamp" : "20:45-21:10",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:10-21:14",
    "speaker" : "Greg",
    "text" : "Project as in had no name recognition prior to getting to anymore."
  },
  {
    "speaker" : "Andy",
    "text" : "Or even just like, yeah, or just um",
    "timestamp" : "21:14-21:16"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:17-21:19",
    "text" : "Because Randy Moss is the easiest answer."
  },
  {
    "timestamp" : "21:19-21:33",
    "text" : "Oh, Randy Moss is a pretty good one. I was thinking um because they they talk constantly about Stephen Neal, about how he's a converted wrestler. So kind of like somebody who had some sort of raw talent that they molded into something else. I think you can throw Edelman in that list.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "21:34-21:34"
  },
  {
    "speaker" : "Andy",
    "text" : "A Wildcat quarterback who Turned into one of the best slot receivers in the NFL history.",
    "timestamp" : "21:34-21:40"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "21:41-21:42",
    "text" : "Um Sebastian Vollmer."
  },
  {
    "text" : "Vollmer's a good one, I think. Okay. I think there's a decent amount of alignment probably.",
    "speaker" : "Andy",
    "timestamp" : "21:43-21:47"
  },
  {
    "timestamp" : "21:47-21:48",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Um anybody else?",
    "timestamp" : "21:48-21:50"
  },
  {
    "speaker" : "Greg",
    "text" : "Any basketball players? You can even say Jacob Johnson. Yacob.",
    "timestamp" : "21:50-21:55"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:55-21:56",
    "text" : "Jakob Johnson, I put him in there. Yeah."
  },
  {
    "text" : "NFL Europe. Yakob Janssen.",
    "speaker" : "Steve",
    "timestamp" : "21:57-21:59"
  },
  {
    "text" : "Yeah. Yeah. Is there anybody else? I feel like there's been some other converted players.",
    "timestamp" : "22:00-22:07",
    "speaker" : "Andy"
  },
  {
    "text" : "Tom Tupper.",
    "timestamp" : "22:07-22:08",
    "speaker" : "Greg"
  },
  {
    "text" : "Tom Tupper, yeah, yeah. I don't I don't know if he he was more converted by uh parcels back in the day, I think.",
    "speaker" : "Andy",
    "timestamp" : "22:08-22:15"
  },
  {
    "text" : "Maybe you can say the guys from Navy, Court Cardona, you know.",
    "timestamp" : "22:16-22:20",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh yeah, yeah.",
    "speaker" : "Andy",
    "timestamp" : "22:20-22:21"
  },
  {
    "text" : "Mike Vrabel.",
    "speaker" : "Steve",
    "timestamp" : "22:21-22:23"
  },
  {
    "speaker" : "Andy",
    "text" : "Prable oh yeah. Anybody any bell, yeah, but uh if you're able to shit even Wes Volker",
    "timestamp" : "22:23-22:30"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "22:31-22:33",
    "text" : "Oh, West Welker is the one I thought you were thinking of."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "22:34-22:35",
    "text" : "Oh, no."
  },
  {
    "timestamp" : "22:35-22:35",
    "text" : "No?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "22:36-22:43",
    "speaker" : "Andy",
    "text" : "No, I was thinking of Steven, yeah. Who didn't play football in interceptions in this game was on third and ten."
  },
  {
    "text" : "He threw a huge deep ball all the way down to the 20-yard line, and I have a note says Probably better than kicking at the West Walker again. Right.",
    "speaker" : "Steve",
    "timestamp" : "22:43-22:51"
  },
  {
    "text" : "Yes. I mean, even the last game that um I did the episode by myself with when we saw Welker.",
    "timestamp" : "22:52-22:58",
    "speaker" : "Andy"
  },
  {
    "text" : "They'll have to listen to that one.",
    "timestamp" : "23:01-23:02",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:02-23:47",
    "text" : "Yeah, you should. It's great. It's fascinating. You'll learn something, I promise, Steve. Um Yeah, but do I want to know this? Uh I don't care. Uh yeah, no, he he was I think even more effective in this. His kick I think every kick return was well past the 30. He was doing kick returns, he's doing punt returns as well. Um, at which he returned. His first punt return returned all the way down to the New England two, three-yard line, something like that, to set up the first touchdown score. Um, so I think at the end of the first quarter, they showed some stat where The Dolphins had negative nine total offensive yards and the game was tied at seven. Yeah. Basically because Wes Walker and his kick returns and his punt returns and all of it. And Tom Brady throwing interceptions."
  },
  {
    "speaker" : "Steve",
    "text" : "I mean, they're trotting out there. Marty Booker, tight end, Darius Thompson.",
    "timestamp" : "23:47-23:52"
  },
  {
    "text" : "Yeah, I'd never heard of that guy.",
    "timestamp" : "23:53-23:54",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "23:55-24:02",
    "text" : "Randy McMichael, Brian Gilmore, Chris Chambers, Donald Lee. These are all the people who are playing over West Walker at this point."
  },
  {
    "speaker" : "Andy",
    "text" : "Right. Yeah. No, West Weckle well Weckler. West Welker didn't have a reception this season, I don't believe. Correct.",
    "timestamp" : "24:02-24:10"
  },
  {
    "speaker" : "Greg",
    "text" : "He's nobody at this point.",
    "timestamp" : "24:10-24:11"
  },
  {
    "text" : "You didn't get a shot on a two and fourteen or a four and twelve or whatever they ended up, team. That's crazy.",
    "speaker" : "Steve",
    "timestamp" : "24:12-24:17"
  },
  {
    "text" : "Right. And yet, well, I mean, he's returning kicks and stuff, but yeah. Makes you wonder how many guys are out there. Right. You would think they at least try with some like wide receiver screens or like having them on reverses and things like that. Basically what the pages do with, you know, Troy Brown and such.",
    "speaker" : "Andy",
    "timestamp" : "24:17-24:37"
  },
  {
    "speaker" : "Steve",
    "text" : "Wait, did he get traded to Sandy Eight? No.",
    "timestamp" : "24:37-24:40"
  },
  {
    "text" : "He got drafted by San Diego, but I think didn't stick with the team. And then you'll have to listen to the the episode to you. I went into all of it.",
    "timestamp" : "24:41-24:48",
    "speaker" : "Andy"
  },
  {
    "text" : "Go learn something, Steve. Yeah, right, Steve. Did you guys watch the um the the Brady documentary with Welker in it. It's the one where he drops the pass in the Super Bowl against the second one against the Giants.",
    "timestamp" : "24:52-25:08",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I know I know the pass.",
    "timestamp" : "25:09-25:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, it was it was heart-wrenching, man. Was it? Dude, he's still like beat up about it. I would be. I dude, I almost fucking because he was like, I feel like it like canceled out everything I had done for the Patriots at that point. And like I felt like the whole fame base like didn't respect me anymore and stuff like that. And I I actually almost like looked up his whatever Twitter to send him a message and be like, no, dude, we still love you. Damn right. I just like, I don't know, it it really like almost wrenched my heart apart hearing this guy that like clearly put everything he could have into it and like that's a catchy mix nine, nine times out of a hundred. Yep. And it's just football that sometimes it just doesn't Doesn't happen. Yeah, it's not like he did anything wrong. He just dropped a pass.",
    "timestamp" : "25:10-25:56"
  },
  {
    "timestamp" : "25:56-25:57",
    "speaker" : "Andy",
    "text" : "Yep."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "25:57-26:00",
    "text" : "And that like kind of defines his Patriots' legacy to a degree."
  },
  {
    "timestamp" : "26:00-26:04",
    "text" : "Yeah. At the end of the day, that wasn't like the reason they lost the game either, right?",
    "speaker" : "Andy"
  },
  {
    "text" : "Right. And it's like those kind of things are like whatever. You know, it's like things where it's you make a dumb mistake or you know, you you do something stupid. That's where it's like, all right, you know, you could have made a different decision. He didn't make a decision. It just ball hit him in the hands, bounced off.",
    "timestamp" : "26:04-26:21",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "You know? This is what it is.",
    "timestamp" : "26:21-26:23"
  },
  {
    "text" : "It's fucking nightmare fuel. Imagine. Nope. Imagine, dude, imagine like the whole like off season for West Welker after that. Just being like every night just thinking it over, being like, what the fuck? Yep. He's like, and there's nothing you can be like, I wish I did this different. Because he You can't do anything different. No, you know.",
    "timestamp" : "26:23-26:42",
    "speaker" : "Greg"
  },
  {
    "text" : "No, there's no different.",
    "timestamp" : "26:43-26:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:43-26:48",
    "text" : "It's gotta be fucking terrible to deal with. That's rough. Yep."
  },
  {
    "speaker" : "Steve",
    "text" : "I too was lying in bed a lot saying, what the fuck? Yeah, that's that's right. Yeah, it was a long time.",
    "timestamp" : "26:49-26:54"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:56-27:16",
    "text" : "Oh god. Well, I have a story. I have a similar story. Maybe this is why it resonated with me. Is because at UNH, right? So I was on the soccer team and they I never played anything like that. So I didn't have any goals, you know, throughout my whole career. But senior day, they'd have to start all the seniors."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "27:16-27:16"
  },
  {
    "text" : "And there's like they'll put you in there for like your 15, 20 minutes, and then they yank you for the the real guys. And like five minutes into that game, like a ball came across, and I had like a gaping net and I pushed it wide. And like, you know, mom was there. You know, this whole like performance beforehand. Like if I had netted that, it would have been such like a fuck you. You know, it would have been so like",
    "speaker" : "Greg",
    "timestamp" : "27:17-27:42"
  },
  {
    "timestamp" : "27:43-27:44",
    "speaker" : "Andy",
    "text" : "Liberating."
  },
  {
    "timestamp" : "27:44-27:44",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "27:44-27:46",
    "speaker" : "Andy",
    "text" : "The redeeming. Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "27:46-27:59",
    "text" : "I fucking missed it. And then like, and then like I'm like, well, that's why I don't play. You know, like you go through all these things in your head of like, yeah, no wonder you missed it because you fucking suck. You know, it's like Yeah. It was it took me a while to like get over it."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "27:59-28:00"
  },
  {
    "text" : "It's like you're playing at you know pro player stadium. Yeah.",
    "timestamp" : "28:00-28:04",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "28:04-28:26",
    "speaker" : "Andy",
    "text" : "But I I've missed so many penalty kicks. Dinged him off the post, keeper makes a good save, whatever it is, push it just wide. That uh I just don't take him anymore. And I'm talking like, you know, middle school, high school. Like college rec sports. I just I can't do it."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "28:27-28:27"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:27-28:31",
    "text" : "It's just in my head. I just I know I'm gonna miss as soon as I get it."
  },
  {
    "timestamp" : "28:31-28:34",
    "speaker" : "Greg",
    "text" : "And we're playing in front of nobody. These guys are playing in front of millions. Yeah."
  },
  {
    "timestamp" : "28:34-28:36",
    "text" : "You're on primetime television.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "28:36-28:38",
    "speaker" : "Greg",
    "text" : "Getting hate messages after."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:38-28:39",
    "text" : "Oh, undoubtedly."
  },
  {
    "speaker" : "Greg",
    "text" : "Which is fucking threatening your family. Anybody fucking people. I I support heckling players, but anybody that like sends threat messages on the e, you know, like that is the most ridiculous shit. So here's the speaking to you if you've ever done that. You're a fucking idiot. Exactly. Grow up. You could say funny shit. I'm an idiot. Trust me. I'm an idiot. So I know idiots If you you can heckle all you want as long as it's in good nature, but you're threatening people's families, you're a fucking jackass.",
    "timestamp" : "28:39-29:10"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:13-29:14",
    "text" : "Well, there's a fucking ton of jackasses."
  },
  {
    "timestamp" : "29:15-29:16",
    "speaker" : "Greg",
    "text" : "Getting on my fucking pedestal here."
  },
  {
    "text" : "You are. You're getting all worked up.",
    "timestamp" : "29:16-29:18",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "29:18-29:18",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "29:18-29:21",
    "speaker" : "Steve",
    "text" : "So you're just replaying that missed goal in your head over and over again."
  },
  {
    "text" : "I feel bad for him.",
    "speaker" : "Greg",
    "timestamp" : "29:23-29:24"
  },
  {
    "text" : "Yeah. Did he ever win a Super Bowl? No. Do you not win with the Broncos? That's what I was wondering.",
    "timestamp" : "29:25-29:31",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:32-29:34",
    "speaker" : "Steve",
    "text" : "The Broncos 13-14."
  },
  {
    "timestamp" : "29:35-29:59",
    "speaker" : "Andy",
    "text" : "I know they lost to the um They lost to the Seahawks when he was part of that team where Manning was just chucking touchdowns for fun and broke Brady's record, right? Wasn't that year? Yeah. I don't know if he was still on the team in the city. He was there on in 13 and 14. Okay, so he probably did win in the fourteen. Cause that was"
  },
  {
    "speaker" : "Greg",
    "text" : "24 Oh wait, 14 they lost. Yeah, he was on that one with the B2C. No, he was on the one that lost the Seahawks.",
    "timestamp" : "30:01-30:10"
  },
  {
    "text" : "Right.",
    "timestamp" : "30:10-30:10",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I think it's like Super Bowl.",
    "speaker" : "Greg",
    "timestamp" : "30:11-30:13"
  },
  {
    "speaker" : "Andy",
    "text" : "He never won Super Bowl.",
    "timestamp" : "30:13-30:14"
  },
  {
    "speaker" : "Greg",
    "text" : "Poor bastard.",
    "timestamp" : "30:14-30:15"
  },
  {
    "text" : "He went he went to the Super Bowl with two of the best offenses in NFL history and has zero Super Bowls to show for it. It was a big part, both of them, too.",
    "timestamp" : "30:15-30:25",
    "speaker" : "Andy"
  },
  {
    "text" : "Maybe it's maybe he's the problem.",
    "speaker" : "Steve",
    "timestamp" : "30:24-30:26"
  },
  {
    "timestamp" : "30:27-30:32",
    "speaker" : "Greg",
    "text" : "Seems like it. He had five seasons with more than 110 catches. That's crazy."
  },
  {
    "text" : "Yeah. 10,000 combined yards rushing receiving on his career.",
    "speaker" : "Steve",
    "timestamp" : "30:32-30:36"
  },
  {
    "speaker" : "Greg",
    "text" : "Unbelievable. Pro bowler? I mean uh Hall of Famer?",
    "timestamp" : "30:36-30:40"
  },
  {
    "timestamp" : "30:40-30:41",
    "speaker" : "Andy",
    "text" : "I would say so."
  },
  {
    "timestamp" : "30:42-30:45",
    "speaker" : "Greg",
    "text" : "He's married to a swimsuit model in 2005, Mrs."
  },
  {
    "text" : "Hooters, pageant winner.",
    "timestamp" : "30:46-30:48",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "30:50-30:51",
    "text" : "I don't feel bad for him anymore.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "30:51-30:57",
    "speaker" : "Andy",
    "text" : "No, going down that rabbit hole. Oh, and he's uh he coaches on the 49ers now too, right?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yes, he's.",
    "timestamp" : "30:58-30:58"
  },
  {
    "text" : "So he's lost another Super Bowl as a coach.",
    "speaker" : "Andy",
    "timestamp" : "30:58-31:00"
  },
  {
    "timestamp" : "31:01-31:01",
    "text" : "That's right.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "That's tough. Yeah. So don't hire West Walker if you want to win. If you want to go to the Super Bowl, all right. Uh what else? Tom Brady, not so good. Oh, this is a meltdown game. Yeah, this is. It's just that that one game that he just struggled. Although to be fair, they did post that um the last time they met, these two teams met. Uh Brady had season lows in pretty much every category, including um finishing the game with seven completions for 69 passing yards. Nice. To be fair, two of those completions were touchdowns. But uh not great. They only had 204 total yards. So, I mean, he struggled last time, but they still got the win, but this was like a legit meltdown. To even uh they mentioned that Tom Brady, this is what, week 15, had a couple passes batted down in this game. They were the first passes he had batted or tipped the entire season. Which is weird because I feel like it happens like at least once a game.",
    "timestamp" : "31:04-32:12"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, that that's that was crazy.",
    "timestamp" : "32:13-32:14"
  },
  {
    "timestamp" : "32:15-32:17",
    "speaker" : "Andy",
    "text" : "He gets passes battle all the time."
  },
  {
    "speaker" : "Steve",
    "text" : "He was 18 for 29, 171 yards, three touchdowns, four interceptions, sacked twice. That's rough. His touchdowns are sick, though. Yeah. Some good touchdowns. Money. Yep. This is the, I think the only receiving touchdown Corey Dillon ever gets from Brady.",
    "timestamp" : "32:18-32:36"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "32:36-32:44",
    "text" : "Yep, it is. Um and it's his the first time he had a touchdown catch since 2001 with the Bengals. Yeah. I don't think he finishes with many."
  },
  {
    "text" : "I you know, that's always like a great trivia question or whatever. And the dangogram one was pretty good. It was all right. So I don't know if he had like a he wasn't like Terrible, but it wasn't very good either. It seemed like the Dolphins defense was giving him problems more than he was just being really bad, you know.",
    "speaker" : "Steve",
    "timestamp" : "32:44-33:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah. He just I mean, he's only 18 for 29, so not great. If you if you just look at passer rating, uh he was outplayed by AJ Feely, which not not great.",
    "timestamp" : "33:02-33:13"
  },
  {
    "text" : "Like, yeah, any any person who's in that statement opposite AJ Feely should feel bad.",
    "speaker" : "Steve",
    "timestamp" : "33:14-33:19"
  },
  {
    "text" : "Yeah. Um, I mean, it's also not great when uh I think Troy Brown on defense got a bit exposed in this game too. He got picked on a little bit.",
    "speaker" : "Andy",
    "timestamp" : "33:19-33:29"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, how dare you!",
    "timestamp" : "33:29-33:30"
  },
  {
    "speaker" : "Andy",
    "text" : "I know it's tough to say. But he also was tied for second in the team in tackles with five. Um and three other people had six, including, you know, the the usual sp suspects, McGinnis, Pfeiffer. And Asante Samuel, sadly. So it was just uh one of those games, you know, not great.",
    "timestamp" : "33:30-33:51"
  },
  {
    "timestamp" : "33:52-33:55",
    "speaker" : "Steve",
    "text" : "Like Feely had like three near picks dropped too."
  },
  {
    "text" : "Oh yeah. Asante Samuel should have had at least two.",
    "speaker" : "Andy",
    "timestamp" : "33:55-33:58"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "33:58-33:58",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So it's just one of those games where the bounces just didn't go your way.",
    "timestamp" : "33:59-34:02"
  },
  {
    "speaker" : "Steve",
    "text" : "Really kind of coming on these read these games where you're going to be.",
    "timestamp" : "34:03-34:05"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah.",
    "timestamp" : "34:05-34:06"
  },
  {
    "timestamp" : "34:06-34:13",
    "speaker" : "Greg",
    "text" : "Yeah. I bet there's some interesting uh statistics you could do about Brady's meltdown games."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:13-34:14",
    "text" : "In what way?"
  },
  {
    "text" : "In like interceptions average per game compared to like how much of uh deviation those ones are when he like goes crazy and melts down. Because it feels like it's either zero or four, you know? Yeah, yeah, yeah. There's like no in between. Cause I've just been going through his game logs.",
    "timestamp" : "34:14-34:34",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "34:34-34:35"
  },
  {
    "timestamp" : "34:35-34:52",
    "text" : "And there seems to be about the same amount of like two to four game picks as there are one game, one interception games, right? Which I would think is probably not true for most quarterbacks. Yeah, probably spread him up, print it kind of evenly.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "34:52-34:52"
  },
  {
    "text" : "So And there's quite a few like four interceptions, which is why considering who Brady is.",
    "speaker" : "Greg",
    "timestamp" : "34:53-34:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Six games with four interceptions. Which is the most he's ever th uh thrown. He hasn't thrown more than four.",
    "timestamp" : "35:00-35:07"
  },
  {
    "speaker" : "Steve",
    "text" : "I feel like it was more Remember when Nathan Piederman came in for the Bills and threw like five interceptions in the half? Yeah, that was awesome. And then everyone started comparing him to how last time Brady has thrown with like five interceptions like total. And it's been like two and a half years.",
    "timestamp" : "35:09-35:24"
  },
  {
    "speaker" : "Andy",
    "text" : "All right, so here we go. So Brady is 0-6 when he throws four interceptions, which makes sense. Um He did almost win. Let's see. One of those games was against the Bills. I think that was I think it's Fitz Magic in 2011, where they lost 31-34 right at the end. Um kept it close with the Colts when he threw zero touchdowns, four interceptions in 2006, and they lost by 20 to 27. Uh 2005 he threw four against the Chiefs with a touchdown. That wasn't that close, lost by 10. This game, three touchdowns, four interceptions, lost by a point. Uh 2003, week one, where they lost 31-0. And then 2001, week seven, where he threw four interceptions. I think in the second half, remember we saw they eventually got blown out by the Broncos. So those are the six games. Um between two and three interceptions, he is 24 and 19. So however many games that is. 43 games where he's thrown two or three interceptions. That's pretty good. Uh 0 or 1 interceptions, he has 275 games.",
    "timestamp" : "35:25-36:42"
  },
  {
    "speaker" : "Steve",
    "text" : "So I found that tweet that I was thinking of. Nathan Peterman, five interceptions since four o'clock Eastern Time. Tom Brady, five interceptions since January 4th, 2016. This is November 19, 2017.",
    "timestamp" : "36:43-36:55"
  },
  {
    "text" : "That's tough. That is tough.",
    "timestamp" : "36:58-37:00",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "That's tough.",
    "timestamp" : "37:00-37:01"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Brutal.",
    "timestamp" : "37:01-37:03"
  },
  {
    "speaker" : "Steve",
    "text" : "It's got touch of Brett Favre in him. That's just the quickest way to ruin that guy's confidence. He was never the same after that either.",
    "timestamp" : "37:03-37:11"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Well, I mean he keeps around. Yeah. Well there there was talk that he might get another shot at a starting job. Because he's back he was backing up um Uh he's in Buffalo right now, right? Backing up um what's his face?",
    "timestamp" : "37:12-37:25"
  },
  {
    "text" : "You're thinking of Mitch I love kissing titties, Trubisky.",
    "timestamp" : "37:26-37:29",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "37:29-37:30",
    "speaker" : "Andy",
    "text" : "Oh yeah. Oh maybe."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:31-37:34",
    "text" : "Yeah, that's Mitch. He is getting a shot. He's getting a shot in the Steelers."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that's right. Right, right.",
    "timestamp" : "37:35-37:36"
  },
  {
    "speaker" : "Greg",
    "text" : "Calling Kaepernick, baby. He's coming back.",
    "timestamp" : "37:37-37:40"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "37:40-37:40"
  },
  {
    "speaker" : "Greg",
    "text" : "I hope it happens. Me too.",
    "timestamp" : "37:44-37:46"
  },
  {
    "speaker" : "Steve",
    "text" : "100%.",
    "timestamp" : "37:47-37:47"
  },
  {
    "speaker" : "Greg",
    "text" : "I want to watch it and I want to turn it into a motherfucking circus. Oh gosh. That's exactly what I need to do. It'd be interesting. It'd be an interesting, I don't know, just like, I don't know. Has anyone ever taken like four years off as a quarterback and then come back and play? Yeah. Yeah.",
    "timestamp" : "37:48-38:08"
  },
  {
    "timestamp" : "38:08-38:15",
    "text" : "That's a quarterback? I don't think so. I mean, who's the one that came out of retirement for the Rams this year? The safety. What's his name?",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh yeah. The guy used to have the beard.",
    "timestamp" : "38:15-38:18",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "38:18-38:21",
    "text" : "Yep. Yep. So it's been done.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "38:21-38:25",
    "text" : "Four years though. I feel like it's even a long time, yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, it might even be longer.",
    "timestamp" : "38:25-38:27"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I don't know. Straight up blackballed. And there's no way you can say he wasn't because the quality quarterbacks that are out there are just there's a bunch of AJ Feely's out there",
    "timestamp" : "38:27-38:38"
  },
  {
    "text" : "Yeah, he's not a starter. That's the problem. If he was starter talent, I bet he would have got a job. But no one wants to deal with the shit that comes with it for a backup. You know? Oh yeah. It's like Tim Tebow, except the opposite end of that spectrum. I would put him on par with like Robert Griffin. Where he showed like flashes of brilliance, but then by the you know a couple years later you're like, I'm not so sure this guy really has it anymore. But Griffin stalked around for a while as a backup service little backup, right?",
    "timestamp" : "38:38-39:14",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. He's in the Ravens for a while.",
    "timestamp" : "39:15-39:17"
  },
  {
    "speaker" : "Greg",
    "text" : "Kaepernick probably could have done that. Maybe you still can.",
    "timestamp" : "39:17-39:21"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:22-39:30",
    "text" : "Maybe last season. Ooh, he was one and ten. Sixteen touchdowns, four interceptions, though. That's not horrible."
  },
  {
    "text" : "I remember thinking he didn't have the athleticism though. Really? Because they played the Patriots that year. And I remember there's like one play where he was like turning the corner. Where early in his career he would have just like started striding away from everybody and like someone caught him from behind and I was like, if he loses that piece of his game, this is like a completely different player we're looking at.",
    "speaker" : "Greg",
    "timestamp" : "39:30-39:55"
  },
  {
    "timestamp" : "39:55-40:22",
    "speaker" : "Andy",
    "text" : "I mean you say 2012 was his breakout year, right? Uh sixty-three carries, four hundred and fifteen yards, five touchdowns. Twenty sixteen in his last season, sixty-nine carries, four sixty-eight yards, and two touchdowns. So he was actually pretty similar. Um in 2015 he struggled, but that may have been a season when he was hurt."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:23-40:26",
    "text" : "Hard to tell. When was that when's the last time you played?"
  },
  {
    "timestamp" : "40:26-40:27",
    "speaker" : "Andy",
    "text" : "2016."
  },
  {
    "text" : "So we're talking 60 years, dude.",
    "timestamp" : "40:27-40:31",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "40:31-40:32",
    "speaker" : "Andy",
    "text" : "Yeah, it's a long time."
  },
  {
    "text" : "And he's a vegan now. Ancient.",
    "timestamp" : "40:33-40:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Hey, wasn't uh isn't there a patriot that's a vegan?",
    "timestamp" : "40:37-40:40"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:40-40:46",
    "text" : "TO is still playing though, so you know, I mean it's possible. TOGIN plays in this Super Bowl."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:47-40:48",
    "text" : "That's true. He does."
  },
  {
    "text" : "But what does that have to do with anything Dio is literally playing right now. He plays in that fan control football tech week.",
    "speaker" : "Steve",
    "timestamp" : "40:49-40:54"
  },
  {
    "text" : "Oh right. Well does that doesn't quite count.",
    "speaker" : "Andy",
    "timestamp" : "40:55-40:57"
  },
  {
    "text" : "Well yeah, he scored a touchdown last week.",
    "timestamp" : "40:57-40:59",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "41:00-41:02",
    "text" : "I feel like we should get into that. That seems like our job.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "41:04-41:06",
    "speaker" : "Steve",
    "text" : "Yeah, we all pick teams."
  },
  {
    "timestamp" : "41:06-41:09",
    "speaker" : "Andy",
    "text" : "Okay. Do you control the do you control the teams?"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know how it works. I just said, sure, I'll put a bet down on this with you guys.",
    "timestamp" : "41:09-41:14"
  },
  {
    "speaker" : "Andy",
    "text" : "Well that's that's not being into it. That's just being a degenerate gambler. Yeah. Have you watched any of the games? No. Well I'm into it. Relax. I will do no such thing. I will do a fucking deep dive into this. And I will get way too involved.",
    "timestamp" : "41:14-41:34"
  },
  {
    "timestamp" : "41:34-41:48",
    "speaker" : "Steve",
    "text" : "Is this gonna become another fourth loud or whatever it was? The kiss football. Oh, that was great too. That's what I'm saying. Maybe, maybe it'll have to be. Okay, you how about you come each week with an update on on how that's how this league is going?"
  },
  {
    "text" : "I can't promise that will happen.",
    "timestamp" : "41:48-41:50",
    "speaker" : "Andy"
  },
  {
    "text" : "You didn't even know TO was playing.",
    "speaker" : "Steve",
    "timestamp" : "41:50-41:52"
  },
  {
    "text" : "That's right, yeah, because I'm not into it. You're the one that said you were into it.",
    "timestamp" : "41:52-41:55",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "41:55-41:57",
    "text" : "I don't know if China for Boss Playing.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "41:57-42:00",
    "speaker" : "Andy",
    "text" : "Oh, they have collective NFTs. That's good."
  },
  {
    "timestamp" : "42:00-42:03",
    "text" : "Dude, tell me NFTs aren't the dumbest shit in the world.",
    "speaker" : "Greg"
  },
  {
    "text" : "Dumbest shit in the world. Dumbest shit in the world. I'm a nerd and I I am into crypto and even I think NFTs are dumb shit. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "42:03-42:11"
  },
  {
    "timestamp" : "42:13-42:27",
    "speaker" : "Greg",
    "text" : "Yeah, when when fucking Paris Sultan's on TV trying to talk so cons condescendingly to me about fucking NFTs, dude. Oh man. Yes now. What a woo what a world."
  },
  {
    "timestamp" : "42:28-42:31",
    "speaker" : "Steve",
    "text" : "Here the uh cash me outside girls big into NFTs."
  },
  {
    "text" : "Say what you will. I don't have that.",
    "speaker" : "Andy",
    "timestamp" : "42:39-42:41"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "42:42-42:48",
    "text" : "These are the people who's who made that girl rich are also the ones sending death threats to their favorite players fanning."
  },
  {
    "text" : "I think that's true. They also watch the Kardashians uh on a regular basis.",
    "speaker" : "Andy",
    "timestamp" : "42:49-42:54"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I found the original Real World on streaming.",
    "timestamp" : "42:54-42:59"
  },
  {
    "timestamp" : "42:59-42:59",
    "speaker" : "Andy",
    "text" : "Oh yeah."
  },
  {
    "timestamp" : "43:00-43:27",
    "speaker" : "Steve",
    "text" : "Like season one, episode one. Yeah. It's wild. Yeah. Being like blatantly racist. Yeah. Yeah, there is a bossing guy. There's no there's no concept that I could get free. Which is what the idea was originally. It's difficult to do that. This is before that, though. It's the best."
  },
  {
    "timestamp" : "43:28-43:38",
    "speaker" : "Greg",
    "text" : "Doesn't some dude slap a chick? Yeah, I think so. He like stops her in the car and like opens the door and just slaps her in the face and then closes the car door again."
  },
  {
    "speaker" : "Andy",
    "text" : "Well I I think wasn't it uh there was a gay guy and then he's the one that that did it because she was like being super homophobic or something. Yeah.",
    "timestamp" : "43:38-43:44"
  },
  {
    "timestamp" : "43:45-44:42",
    "text" : "He just like fucking slaps the shit out of her. Yep. Pretty sick, man. I was at the park on Easter. Shit went down. Apparently some guy slapped a girl. The whole park was abuzz with it. Cops came and everything, dude. And I was like, it was getting pretty testy. So I started to leave. And I'm like walking out the exit of the park and a car pulls up. And the guy fucking opens his door and I can see the barrel of a gun, like a long barrel gun in it, and he's like yelling at some people. And then he like closes his door and speeds off. And I was like, what the fuck is going on? What? On the Lord's Day, no less. I'm like trying to watch the Celtics. It was unbelievable. Just trying to eat my chocolate bunnies. Yeah. Have a little nap in the sun and people are fucking bringing guns to the park. Acting up. That's not cool.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "44:42-44:46",
    "text" : "Those people are also sending death threats to players."
  },
  {
    "speaker" : "Andy",
    "text" : "Ridiculous. Knock it off. That's you. I mean, what do you think mom would say?",
    "timestamp" : "44:47-44:52"
  },
  {
    "speaker" : "Mom",
    "text" : "Sometimes a naughty boy. No, my bad.",
    "timestamp" : "44:52-44:55"
  },
  {
    "timestamp" : "44:55-44:59",
    "speaker" : "Steve",
    "text" : "Very naughty. I'm excited for you to get new soundbites, Andy. You keep talking about it."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "44:59-45:00"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah",
    "timestamp" : "45:00-45:00"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:01-45:08",
    "text" : "Well, I mean you keep making me do episodes and watching fucking pages losing to Miami in Miami. Awful."
  },
  {
    "timestamp" : "45:08-45:12",
    "speaker" : "Steve",
    "text" : "Well, spoiler alert, Andy, the Pages don't lose another game for the rest of the season."
  },
  {
    "speaker" : "Andy",
    "text" : "Luckily, that is true. Yeah. That's awesome. I wonder how long their uh cons their uh scoring streak will go. Because they have now scored first in 19 consecutive games, including this one, where these ran down and scored a touchdown immediately Where it looked like this game was over.",
    "timestamp" : "45:12-45:26"
  },
  {
    "timestamp" : "45:26-45:31",
    "speaker" : "Steve",
    "text" : "And then immediately got the dolphins to go three and out by absolutely stifling them. And you say, this game's over."
  },
  {
    "speaker" : "Andy",
    "text" : "Right. It felt over from the beginning. And then it just wasn't. Which I I think it was the Welker punt return that kind of jumpstarted things and got the the dolphins back into it, which is brutal. Fucking welcome.",
    "timestamp" : "45:31-45:46"
  },
  {
    "text" : "Do we got any uh any current news to discuss about the NFL?",
    "speaker" : "Greg",
    "timestamp" : "45:46-45:50"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "45:51-45:57",
    "text" : "Ooh, I was thinking we should make some draft predictions since it is a week from today. Okay."
  },
  {
    "text" : "What what position do the pages draft in round one?",
    "timestamp" : "45:58-46:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "46:02-46:11",
    "text" : "Or let's What position is the Patriots' first draft pick play? Because a very good chance it's not in round one."
  },
  {
    "text" : "Fair enough. Fair enough.",
    "timestamp" : "46:11-46:12",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:12-46:19",
    "text" : "Well, no, let's no, let's leave it as what's their first round pick with an option being NA. That they trade out.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "46:19-46:28",
    "speaker" : "Andy",
    "text" : "I don't think they trade out. I think they trade out. I don't. They might trade back, but I think they'll still pick in the first round because you have that fifth year option. It's much more valuable."
  },
  {
    "timestamp" : "46:29-46:33",
    "speaker" : "Steve",
    "text" : "I think they trade up and go get that fat boy from Georgia."
  },
  {
    "text" : "Oh, the defensive lineman?",
    "timestamp" : "46:33-46:34",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:34-46:45",
    "speaker" : "Steve",
    "text" : "Yep. Yeah. That guy's awesome. He is awesome. What a fucking freak, dude. And they can't stop the run. That was their when they're when they play shit on defense is because they can't stop the run."
  },
  {
    "text" : "It's a bugaboo. That's true. That's uh yeah. And uh team him up with Barmore in the middle. Yeah. Yeah.",
    "timestamp" : "46:46-46:54",
    "speaker" : "Andy"
  },
  {
    "text" : "And then you can you can dedicate the rest of the defense to just stopping the pass.",
    "timestamp" : "46:54-46:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "The pass, right.",
    "timestamp" : "46:59-47:00"
  },
  {
    "text" : "Yeah, while still getting pressure on the quarterback. If Belcheck thinks that guy's the near next Vincible Fork, then I think they do it.",
    "speaker" : "Steve",
    "timestamp" : "47:01-47:07"
  },
  {
    "timestamp" : "47:08-47:10",
    "text" : "Yeah, I wouldn't be surprised. Craig?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:11-47:27",
    "text" : "I'm going uh wide receiver. Okay. The guy from Bama. You know Belichick loves his little boy crush on Nick Saban. Which one? Mechie? Uh the guy that no. Jamison, the guy that fucked up his leg, yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "47:27-47:29",
    "text" : "Oh yeah. That makes sense because then",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:30-47:37",
    "text" : "And there's a value pick, you know. I don't I don't I don't know if he'll fall. I don't haven't been reading enough about that, but I've heard he's a late first rounder"
  },
  {
    "speaker" : "Andy",
    "text" : "Right, because of the injury. And because he won't be back till later of the season. Yeah. Which would make sense with this team too, because they already have a stable of wide receivers. So if you can kind of bring him along slowly, that makes sense. Yeah. I can see that. And and they're they've never really been afraid to draft guys with injury concerns. I mean Julie Gronk. They've done that all the time. Yep. I think I feel like they've kind of almost had to just because they usually pick in the 30s. So they're the bottom end of every round. Um, so they kind of have to take those flyers, but yeah, I can see that. Um Well, since that's the way you guys are going, I have to be different. So I think I will do the safe bet and he will draft a tackle or a guard. An offensive. Why is that safe, but because it just it just feels so Belichekian. Everybody's getting all worked up about weapons or loading up on the defensive line. He's gonna be like, no. I like this guard out of Purdue or something, you know?",
    "timestamp" : "47:38-48:38"
  },
  {
    "timestamp" : "48:39-48:47",
    "speaker" : "Greg",
    "text" : "Yeah. I think the whole like mock draft thing is is literally people just like shooting in the dark. I hate mock trafts."
  },
  {
    "speaker" : "Steve",
    "text" : "Well they can't they never predict the trade, so it's like it's immediately impossible. Yeah. I was thinking though, you know how like Certain like during March Madness, they say, Oh, if you get a perfect bracket, we'll give you $10 million. Yeah. They should do it if you get the perfect first round. We'll give you ten million dollars because that's gotta be harder to predict. I think they do do that, yeah.",
    "timestamp" : "48:47-49:07"
  },
  {
    "text" : "They do I think they I saw something this year for the first time and I was like, oh that's kinda interesting. Yeah.",
    "timestamp" : "49:07-49:12",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "49:13-49:17",
    "speaker" : "Steve",
    "text" : "Because you have you'd have to predict the trades. It's literally impossible to pick that."
  },
  {
    "text" : "Yeah. But everybody reads mock drafts and gets themselves hyped up about this like They're not talking of GMs or anything, right? These guys are just guessing.",
    "speaker" : "Greg",
    "timestamp" : "49:18-49:29"
  },
  {
    "text" : "Yeah. But everybody does it. Because you can there's some tool out there now, right? That I don't even know which site that does it. But you can just do your own. And Twitter all of April is just full of people. Like, oh, what do you think of this mock draft? What do you think of this mock draft? Hey guys, look, I did a mock draft.",
    "timestamp" : "49:29-49:46",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "49:47-49:57",
    "speaker" : "Greg",
    "text" : "And it's the team they root for is like, oh yeah, this guy just dropped for no reason down to fucking 25th pick. Projected top five. Right. Snipe. Yeah."
  },
  {
    "text" : "I saw one where they just every single Paige's pick was a trade. Oh yes. All their picks are like future picks.",
    "speaker" : "Steve",
    "timestamp" : "49:58-50:05"
  },
  {
    "text" : "Yes, my friend, my friend Brian does it and tries to break the uh tries to break the the draft the the mock draft system and his draft that he did uh where he traded every time that he could Um he ended up making 89 picks and 41 trades. He ended up with nine tackles, five guards, five centers, five quarterbacks, seven wide receivers, nine running backs, seven tight ends, six ends. Six defensive linemen, eight linebackers, six quarterbacks, eight safeties, three punches, three kickers, and two long snappers. It's a whole team. Technically feasible. Yeah. That's 89, 89 picks.",
    "timestamp" : "50:06-50:47",
    "speaker" : "Andy"
  },
  {
    "text" : "Invade France with that.",
    "timestamp" : "50:48-50:49",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. You would actually have to make cuts on your draft picks to get down to the 53.",
    "timestamp" : "50:50-50:55"
  },
  {
    "speaker" : "Steve",
    "text" : "That's ridiculous.",
    "timestamp" : "50:56-50:57"
  },
  {
    "timestamp" : "50:59-51:04",
    "speaker" : "Andy",
    "text" : "So that that's your team plus your uh your whole team plus a um"
  },
  {
    "timestamp" : "51:05-51:06",
    "speaker" : "Steve",
    "text" : "Practice squad."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:06-51:08",
    "text" : "Practice squad plus cuts."
  },
  {
    "timestamp" : "51:08-51:10",
    "speaker" : "Steve",
    "text" : "You can invade Ukraine with that."
  },
  {
    "timestamp" : "51:10-51:32",
    "speaker" : "Andy",
    "text" : "You could, yeah. Well, apparently you couldn't. Yeah. You could defend Ukraine with that. So do the Patriots draft that punter, the punk god, Greg? I fucking hope so I think everybody in New England is hoping that he goes. Like they just like I don't think anybody would be mad if a page like in the fifth round be like what a draftly punter."
  },
  {
    "text" : "Fifth round.",
    "timestamp" : "51:32-51:33",
    "speaker" : "Greg"
  },
  {
    "text" : "Third round. I have seen him go fourth round in a bunch of mock drafts, Greg.",
    "speaker" : "Andy",
    "timestamp" : "51:33-51:37"
  },
  {
    "speaker" : "Greg",
    "text" : "First round. Did there's not a round high enough. That I would get mad. It's like drafts and crapshoot anyways. Anyone that grades drafts, there's another thing that's completely fucked. Oh god. Bullshit. It's like grade your draft. No one knows anyway. So we might as well get the guys that I want to root for. Yeah.",
    "timestamp" : "51:38-51:57"
  },
  {
    "timestamp" : "51:57-51:58",
    "speaker" : "Andy",
    "text" : "Fair."
  },
  {
    "speaker" : "Greg",
    "text" : "And one of those guys is this fucking punter that booms them. Let's let's do it. First round pick. I don't care.",
    "timestamp" : "51:58-52:05"
  },
  {
    "timestamp" : "52:05-52:07",
    "speaker" : "Andy",
    "text" : "Let's go. Let's go."
  },
  {
    "speaker" : "Steve",
    "text" : "I love it. Jets always get great draft grades, but that's because they're picking at the top of the draft every time.",
    "timestamp" : "52:07-52:12"
  },
  {
    "text" : "Yeah. Right, yeah. Yeah. Yeah. Them and the Jaguars nail it every year. A plus. It's like, well, you have the first overall pick. I should fucking hope so.",
    "speaker" : "Andy",
    "timestamp" : "52:12-52:22"
  },
  {
    "text" : "Do you think Debo Samuel gets traded? No. Oh, yeah. Or Debo, what is it? Uh DK and AJ, they're all and Terry McLaren are all sort of in that.",
    "timestamp" : "52:23-52:33",
    "speaker" : "Steve"
  },
  {
    "text" : "I can see DK and Matt Calf getting traded because I think the Seahawks are blowing shit up. But I don't know about the other ones. They're all in the rookie contract.",
    "timestamp" : "52:33-52:42",
    "speaker" : "Andy"
  },
  {
    "text" : "Who's the best? Who's the best out of that group? Debo?",
    "timestamp" : "52:43-52:46",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "52:47-52:47",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Debo. Debo. Would be awesome on the Patriots. Talk about a guy you want to root for. AJ would be good too, though. Yeah. Because I mean he wanted to judge by the Patriots.",
    "timestamp" : "52:47-52:58"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:59-52:59",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "That's true.",
    "timestamp" : "52:59-53:00"
  },
  {
    "timestamp" : "53:00-53:02",
    "speaker" : "Andy",
    "text" : "Where he's got that mean stretch, I think."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "53:02-53:17",
    "text" : "He's such a little bulldog, and like he it's in Troy Brown too, where it's like he's always like doing a little bit more than you would have hoped, like would be best, you know? Yeah. Guys, on he was unbelievable in the playoffs. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "53:17-53:18"
  },
  {
    "text" : "I'll give you that. But he'll probably break down in like two years. The way he plays. Yeah. Yeah. I feel like he's gonna have a short career.",
    "timestamp" : "53:19-53:26",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:26-53:33",
    "text" : "Yeah. Yeah, kind of like Ellen and Walker. Just no regard for their their safety whatsoever."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "53:33-53:45",
    "text" : "And they give them snaps at running back. I don't blame them for one and uh Yeah, that's an interesting dynamic to that, right? Is like they're they're giving them snaps at running back, which we know like shortest."
  },
  {
    "speaker" : "Andy",
    "text" : "Running backs have the shortest careers. Yeah.",
    "timestamp" : "53:45-53:47"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. Yeah. And he's probably just going along with it because he wants to win, but at some point that needs to be a consideration.",
    "timestamp" : "53:47-53:56"
  },
  {
    "timestamp" : "53:58-54:09",
    "text" : "Yeah, it's true. So Steve, last week, Greg, you weren't here for this. Um we saw Tom Brady throw a completion to. Do you remember who it was, Steve?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "54:10-54:11",
    "text" : "Patrick Bass."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:11-54:14",
    "text" : "No, it was the the backup tight end."
  },
  {
    "text" : "Oh uh Jed Weaver.",
    "speaker" : "Steve",
    "timestamp" : "54:15-54:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, I think that's who it was. So some somebody named Jed Weaver.",
    "timestamp" : "54:18-54:22"
  },
  {
    "timestamp" : "54:23-54:26",
    "text" : "Oh that's a that's a pitcher. It's also a good idea.",
    "speaker" : "Greg"
  },
  {
    "text" : "That guy supplied for the angels. Tom Weaver, isn't it?",
    "timestamp" : "54:26-54:30",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:30-54:31",
    "text" : "That's a different picture.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "54:32-55:25",
    "text" : "Jed Weaver is a picture? All right. Jed apparently. Jed with a D. For dumbass. Uh Jared Weaver. I'm thinking of Jared Weaver. There you go. Um, yeah, so he made a reception. I'd never heard of him. Anyway, I've been doing a lot of work with Tom Brady touchdown pass and stuff. I'm like one of the few people who have caught a touchdown pass from Tom Brady who did not catch a touchdown. So I got um curious to see how many people have caught a pass from Tom Brady, but have not caught a touchdown pass from Tom Brady. Until I found the list of it. So a couple questions for you. The first question is which do you think is higher? The amount of people who have caught a pass from Tom Brady who have not scored a touchdown or who have scored a touchdown. Not scored a touchdown, Steve.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I think I'd say scored a touchdown.",
    "timestamp" : "55:25-55:28"
  },
  {
    "text" : "He has thrown more touchdowns to he has thrown more passes to people who have scored a touchdown than not. By how many? Uh he has thrown uh to 49 players who have not scored a touchdown. That's super low.",
    "timestamp" : "55:28-55:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Right. Can I name one?",
    "timestamp" : "55:42-55:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Um I bet you're probably Stephen Ridley is on that list, yes. Look at your boy. Look at",
    "timestamp" : "55:45-55:53"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "55:53-55:56",
    "text" : "Get your boy. Can you name that on this podcast guard?"
  },
  {
    "timestamp" : "55:56-56:12",
    "speaker" : "Andy",
    "text" : "So Tom Brady has um thrown touchdown passes to ninety-two different receivers at the moment. And he has thrown. Yeah, I've done the sporkle. So can but can you name the person who has the most uh receptions without a touchdown pass from Tom Brady?"
  },
  {
    "text" : "Isn't it Savon Ridley?",
    "speaker" : "Steve",
    "timestamp" : "56:13-56:14"
  },
  {
    "timestamp" : "56:14-56:18",
    "speaker" : "Andy",
    "text" : "It is not Steven Ridley. He is fourth on the list."
  },
  {
    "speaker" : "Greg",
    "text" : "What position does this person play?",
    "timestamp" : "56:19-56:21"
  },
  {
    "timestamp" : "56:22-56:28",
    "speaker" : "Andy",
    "text" : "Um, I will for the top three, two of them play running back and one of them is actually a wide receiver."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "56:28-56:29",
    "text" : "Lawrence Moroni."
  },
  {
    "speaker" : "Andy",
    "text" : "Lawrence Moroni has I think he caught one touchdown pass.",
    "timestamp" : "56:30-56:34"
  },
  {
    "text" : "Patrick Passy didn't fumble it.",
    "timestamp" : "56:36-56:37",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "56:38-56:40",
    "speaker" : "Andy",
    "text" : "Patrick Pass has caught a touchdown pass."
  },
  {
    "timestamp" : "56:41-56:44",
    "text" : "Keith Evans, we count playoffs. Yep.",
    "speaker" : "Greg"
  },
  {
    "text" : "I believe so. I believe I checked it for playoffs. Yeah.",
    "timestamp" : "56:45-56:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm pretty sure Heath Evans only has a playoff touchdown.",
    "timestamp" : "56:47-56:50"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Heath Evans is not on this list.",
    "timestamp" : "56:51-56:53"
  },
  {
    "speaker" : "Steve",
    "text" : "Antoine Smith?",
    "timestamp" : "56:56-56:57"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh he's got one. Yeah, I'm pretty sure he's got one. Oh yeah, he he had one uh on screenplay against the Saints in 2001. Sammy Morris. Sammy Morris is number one.",
    "timestamp" : "56:58-57:10"
  },
  {
    "speaker" : "Greg",
    "text" : "Taha.",
    "timestamp" : "57:11-57:11"
  },
  {
    "timestamp" : "57:12-57:24",
    "speaker" : "Andy",
    "text" : "Thirty-six receptions. Thirty-six receptions. No touchdowns. Because he was the running back on that 2007 team, right? So he caught a bunch of balls, but he never actually scored a touchdown."
  },
  {
    "text" : "Wasn't Moroni on that team too?",
    "timestamp" : "57:24-57:26",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh yes, I believe he was, yeah. Yes. Uh number two. Uh Fred. Yeah, Fred Taylor's on there, but he's number 16. Got four balls. Nice. Number two. Oh. Law firm. Ben Jarvis Green Elves. 28 catches, 290 yards, zero touchdowns.",
    "timestamp" : "57:27-57:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "57:52-57:56",
    "text" : "And number three. Is he on there?"
  },
  {
    "text" : "The Sony Gray.",
    "speaker" : "Steve",
    "timestamp" : "57:57-57:58"
  },
  {
    "timestamp" : "57:58-58:01",
    "speaker" : "Andy",
    "text" : "Oh, um. Yeah, what was the name?"
  },
  {
    "timestamp" : "58:01-58:02",
    "text" : "Sony Gray.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:02-58:06",
    "text" : "Jonas Gray. One catch. Seven yards. Jonas Gray."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "58:06-58:10",
    "text" : "Jonas. The lost Jonas brother."
  },
  {
    "text" : "Right. So number three. A recent guy who only caught a touchdown well into his NFL career.",
    "timestamp" : "58:10-58:20",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:21-58:21",
    "speaker" : "Steve",
    "text" : "Jacoby."
  },
  {
    "speaker" : "Andy",
    "text" : "Jacoby Myers, 25 catches. I believe he has the most yards. Yeah, Jacoby Myers has most yards without catching a touchdown. Yo, hot take.",
    "timestamp" : "58:21-58:30"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "58:30-58:33",
    "text" : "Jacoby Myers is gonna have a hundred catch season this year."
  },
  {
    "text" : "Well Jacoby has didn't he have like the NFL record for most yards before catching a touchdown?",
    "timestamp" : "58:34-58:38",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "58:39-58:42",
    "speaker" : "Andy",
    "text" : "Oh yeah, I believe he did. Yeah. And the most receptions are something as well. Yeah."
  },
  {
    "timestamp" : "58:43-58:48",
    "text" : "And that other dude came in and caught like two in his first game. Shut the fuck, dude.",
    "speaker" : "Greg"
  },
  {
    "text" : "Chill out. Also.",
    "timestamp" : "58:48-58:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, there's a funny funny story about that too is back to that story of me missing that goal in that soccer game. You are just reliving the kid on the team who had played a ton. But had never scored. And he came up after me, after the game, was like, dude, if you had scored that after I've played all these years and not scored, I would have been so pissed.",
    "timestamp" : "58:52-59:13"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I understand that.",
    "timestamp" : "59:14-59:16"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "59:16-59:16"
  },
  {
    "text" : "Yeah. I feel that. What a guy, Greg.",
    "timestamp" : "59:17-59:20",
    "speaker" : "Andy"
  },
  {
    "text" : "Missing that on purpose. Yep. I'm just a good teammate, a great locker room guy. They're the glue.",
    "speaker" : "Steve",
    "timestamp" : "59:20-59:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Mm-hmm. That's true. Also on this list, uh Sonny Michelle, J. R. Redman, LaShawn McCoy. Next top ones.",
    "timestamp" : "59:26-59:33"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "59:34-59:37",
    "text" : "And uh Lash McCoy was on the Patriots?"
  },
  {
    "speaker" : "Andy",
    "text" : "No. Differently Buccaneers. But so caught a bunch of balls, but never caught a touchdown. 14 catches. Also, I think the the longest, the person who played with Tom Brady, the longest to never catch a touchdown. Would be Matthew Slater. Caught one ball, 46 yarder. Bomb.",
    "timestamp" : "59:37-59:58"
  },
  {
    "speaker" : "Steve",
    "text" : "What year was that?",
    "timestamp" : "59:58-59:59"
  },
  {
    "text" : "Uh that's a great question. Let me see if I can find it.",
    "speaker" : "Andy",
    "timestamp" : "01:00:00-01:00:02"
  },
  {
    "text" : "Um I remember I'm pretty sure we have the highlight in the Was it against Denver in that playoff game?",
    "timestamp" : "01:00:02-01:00:07",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:00:07-01:00:24",
    "speaker" : "Andy",
    "text" : "No. Uh 2011. I believe it was against Miami. Um Oh wait, that's a defensive play. His receiving isn't listed until way down list. Okay. Games receiving one catch, 46 yards, 2011."
  },
  {
    "text" : "Well I'm excited for that.",
    "timestamp" : "01:00:25-01:00:26",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, so we'll get to that eventually. It was quite a catch, I will say. Target. One catch. 2011 at Miami. I believe it was the same game with Wes Welker's 99-yard touchdown. It was that game. So not too, not too bad.",
    "timestamp" : "01:00:27-01:00:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Another name game in Miami.",
    "timestamp" : "01:00:48-01:00:50"
  },
  {
    "text" : "Yeah, I suppose that's true. Was that in Miami? Yes. I think so. So not too bad. All right, anything else on this game, boys? Let's do the best and worst. I got a lot. All right. Then I think Steve, you should go first. Well, let me go first, because I only have one. Greg, you go first.",
    "speaker" : "Andy",
    "timestamp" : "01:00:51-01:01:07"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:01:08-01:01:16",
    "text" : "All right. Alright, my worst is uh Harrison spearing that dude. Yeah. See that play? That was pretty dirty."
  },
  {
    "timestamp" : "01:01:16-01:01:16",
    "text" : "It was.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It was like although",
    "timestamp" : "01:01:17-01:01:19"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:01:19-01:01:34",
    "text" : "To be fair, uh in the previous game against the Bengals, he did almost the exact same thing except the guy wasn't ruled down, um, caused a fumble, which the Patriots recovered, and then turned it into a touchdown as the Bengals were driving into The red zone."
  },
  {
    "speaker" : "Greg",
    "text" : "Well in that case, perfectly justified. Throwing his sword out of his helmet into a man's back as he's lying face down on the ground.",
    "timestamp" : "01:01:34-01:01:42"
  },
  {
    "text" : "Yeah. Yeah, that one was little.",
    "timestamp" : "01:01:43-01:01:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01:46-01:02:13",
    "speaker" : "Greg",
    "text" : "Jesus, dude, chill. Yeah. Bear off. Um my best was I don't know if you guys saw this, but Falk got like Absolutely blasted. Just running a little bubble screen thing. Yeah. Drop the ball. It was like a you know blind side thing. And then he just like popped up quickly and like dapped the guy up. I just thought it was pretty good. Yeah, he did it. Falk's the man. Yeah, Kevin Fogg is awesome."
  },
  {
    "speaker" : "Andy",
    "text" : "WD33.",
    "timestamp" : "01:02:13-01:02:15"
  },
  {
    "timestamp" : "01:02:15-01:02:16",
    "speaker" : "Greg",
    "text" : "That's right."
  },
  {
    "timestamp" : "01:02:16-01:02:21",
    "speaker" : "Andy",
    "text" : "Keeping that offense matriculating down the field. All right, Steve, what's your best and worst?"
  },
  {
    "speaker" : "Steve",
    "text" : "I have a lot.",
    "timestamp" : "01:02:21-01:02:22"
  },
  {
    "text" : "Okay. Okay.",
    "timestamp" : "01:02:23-01:02:24",
    "speaker" : "Andy"
  },
  {
    "text" : "Do you want me to go first? You better get started then.",
    "timestamp" : "01:02:24-01:02:27",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Right? All right. I'll go.",
    "timestamp" : "01:02:27-01:02:29"
  },
  {
    "text" : "All right.",
    "timestamp" : "01:02:29-01:02:30",
    "speaker" : "Andy"
  },
  {
    "text" : "The worst was the Brady Pick break. Not even the last one. The number two or whatever it was. Where you just didn't throw it right to the safety and then they got a personal file on top of that. Oh yeah, they'll try on the return on MATLIP. Not great. I get a lot of bests.",
    "speaker" : "Steve",
    "timestamp" : "01:02:32-01:02:50"
  },
  {
    "text" : "Oh, okay.",
    "timestamp" : "01:02:50-01:02:52",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:52-01:02:54",
    "speaker" : "Steve",
    "text" : "Uh we talked about Steven Neal."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep.",
    "timestamp" : "01:02:54-01:02:55"
  },
  {
    "text" : "He wreck wrestled Ricky Williams in college.",
    "timestamp" : "01:02:55-01:02:58",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And beat him.",
    "timestamp" : "01:02:58-01:03:00"
  },
  {
    "text" : "Well yeah, the did won two NCAA championships in fact.",
    "timestamp" : "01:03:00-01:03:03",
    "speaker" : "Steve"
  },
  {
    "text" : "I think he was undefeated in college as well. Like he just never lost.",
    "timestamp" : "01:03:03-01:03:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:03:06-01:03:08",
    "speaker" : "Steve",
    "text" : "He's an absolute beast wrestler."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:03:08-01:03:08"
  },
  {
    "timestamp" : "01:03:09-01:03:14",
    "speaker" : "Steve",
    "text" : "Andy waited three years after college to go. Get an agent and try and go to the NFL."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:15-01:03:17",
    "text" : "Yeah, that's right. Yeah. Three years."
  },
  {
    "timestamp" : "01:03:17-01:03:17",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:03:17-01:03:19",
    "text" : "And there's like, you know what?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:03:19-01:03:21",
    "speaker" : "Steve",
    "text" : "You gotta be like, I wanna play, I wanna play football."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:21-01:03:26",
    "text" : "So there you go. There's a there's an instance of somebody taking a few years off."
  },
  {
    "timestamp" : "01:03:26-01:03:29",
    "speaker" : "Steve",
    "text" : "Yeah, not six from Kaepernick, but three."
  },
  {
    "text" : "Three, yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:03:29-01:03:30"
  },
  {
    "text" : "But I guess he had zero NFL playing experience before that too. Exactly. Uh the another best was the Dolphins sweet, sweet double reverse pass and their execution on that one.",
    "timestamp" : "01:03:30-01:03:46",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, they uh What is uh because the commentators, uh spoiler alert, my best commentators, Al Michaels, John Madden. Another fucking John Madden game. I love John Madden now.",
    "speaker" : "Andy",
    "timestamp" : "01:03:46-01:03:57"
  },
  {
    "text" : "Um wow, how far you've come in. You're welcome. I know.",
    "timestamp" : "01:03:58-01:04:02",
    "speaker" : "Greg"
  },
  {
    "text" : "Well just for you guys. I mean it's gotten on the praise. John man is great. Um, but yeah, so he was talking about how uh you shouldn't be having uh players who don't do handoffs making handoffs because this isn't what happens and they fumbled the handoff.",
    "speaker" : "Andy",
    "timestamp" : "01:04:02-01:04:19"
  },
  {
    "text" : "Yeah. On the uh players who are not used to receiving handoffs, receiving handoffs, especially from players who are not used to handing it off. So now you get a double.",
    "timestamp" : "01:04:20-01:04:26",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:04:27-01:04:28",
    "text" : "Exactly. That's what he was saying.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Yeah. John Madison, man.",
    "timestamp" : "01:04:28-01:04:30"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:31-01:04:34",
    "text" : "Vince Wilfork just belly flopped on that football too is amazing."
  },
  {
    "speaker" : "Steve",
    "text" : "The Dolphins at this point has scored. 13 points in the third quarter.",
    "timestamp" : "01:04:35-01:04:40"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:44-01:04:50",
    "text" : "Not not their best quarter, um, historically. And to be fair, they scored a touchdown in the third quarter."
  },
  {
    "speaker" : "Steve",
    "text" : "Week fifteen, and you got 14 or 13 for them. This is week 14 and yeah, 13 points in the third. So they're good. Mm-hmm And then my two best bests are the videos they had of both Mike Vrabel. For some reason they're featuring him.",
    "timestamp" : "01:04:50-01:05:14"
  },
  {
    "timestamp" : "01:05:14-01:05:19",
    "text" : "Yeah. Oh, because he went back to college to get his degree because he had one class he had to take.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yes. And they said, if you can have one nickname, what's it gonna be? And he said, I'm gonna be called Money Mike Drabel. Which That's ridiculous and corny out of that love.",
    "speaker" : "Steve",
    "timestamp" : "01:05:19-01:05:30"
  },
  {
    "speaker" : "Andy",
    "text" : "It's so bad.",
    "timestamp" : "01:05:30-01:05:31"
  },
  {
    "text" : "It's like uh fast Willie Parker.",
    "timestamp" : "01:05:31-01:05:34",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:05:34-01:05:40",
    "text" : "Yeah, yeah, yeah. To be fair, he was fast. I don't know if Ravel was money.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "So money, dude.",
    "timestamp" : "01:05:40-01:05:41"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:05:41-01:05:42",
    "text" : "Money Mike."
  },
  {
    "text" : "Money Mike.",
    "timestamp" : "01:05:43-01:05:44",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And then the one with uh Jason Taylor.",
    "timestamp" : "01:05:44-01:05:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Talking about how great Tom Brady was?",
    "timestamp" : "01:05:49-01:05:50"
  },
  {
    "text" : "Yeah, he's like, I know Manning's got all the stats, but Brady's a winner. So if I had to start a team, I'm definitely picking Brady.",
    "speaker" : "Steve",
    "timestamp" : "01:05:50-01:05:56"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:56-01:05:59",
    "text" : "Yeah. Did you say like I would just throw a bunch of money at Tom Brady?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, he was the man. He's all about Tom Brady. And I have I love secretly love him, so.",
    "timestamp" : "01:05:59-01:06:06"
  },
  {
    "text" : "Fair enough. All right. Um I will do this because my best Of this New England team, more on Troy.",
    "speaker" : "Andy",
    "timestamp" : "01:06:06-01:06:19"
  },
  {
    "timestamp" : "01:06:19-01:06:49",
    "speaker" : "Announcer",
    "text" : "Let's go down to the field and Michelle Tefoya. Michelle. Yeah, Al, the Patriots team philosophy is simple. Each player knows his role and nobody cares who gets the credit. But Troy Brown is getting a little extra credit from his teammates this year. For contributing in every phase of the game. He is the team's third all-time leading receiver, and yet he's tied for the team lead in interceptions this season. Not only that, he's a regular on special teams. No one has been better than Brown."
  },
  {
    "speaker" : "Tom Brady",
    "text" : "It's fun for us to watch him because to to think that a Pro Bowl receiver could go over and play defense and play the way he's played Uh what a lift it's provided. What it shows is that nobody is afraid to do anything, nobody is afraid to try to help the team, nobody's afraid to go out there and do anything they can to contribute. I mean he's been the best player on this team for a long time. It's still the same way it is.",
    "timestamp" : "01:06:52-01:07:16"
  },
  {
    "timestamp" : "01:07:17-01:07:45",
    "text" : "I asked Brown which is the tougher position to play, wide receiver or cornerback. He said cornerback by far. And he said he thought Al that it would get easier over the course of the season, but it's only getting tougher as teams Continue to collect tape and figure out how he's playing. Troy Brown, he has been, as I say, the embodiment very much so of this New England Patriot team. Whatever you need, somebody seems to step up, and New England will get the ball first, or Lindo Murray will kick off the ball. For Miami.",
    "speaker" : "Announcer"
  },
  {
    "timestamp" : "01:07:45-01:08:01",
    "text" : "So, I mean, uh maybe that should just be the intro of our podcast. Just the Monday night crew talking about how great Tom Brady is, or uh Troy Brown is, and with Tom Brady talking about how Troy Brown is the best player on the Patriots.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I agree with that.",
    "timestamp" : "01:08:01-01:08:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Phenomenal way to start a football game.",
    "timestamp" : "01:08:02-01:08:04"
  },
  {
    "timestamp" : "01:08:04-01:08:04",
    "text" : "That is nice.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:08:05-01:08:43",
    "speaker" : "Andy",
    "text" : "Yeah. So that was that was my best by far. Um also I like the fact that we had uh Sammy Morris sighting, who would eventually, as we know, play for those Patriots, but not catch a touchdown from Tom Brady. But he would rush for a few. I was always a big Sammy Morris fan when he came to the Pats. I felt like he was underrated. And I f I feel, hot take alert, Greg. This one's for you. Okay. The Patriots, the reason that they didn't win the Super Bowl in 2007 is because Sammy Morris got hurt. And they just lost all semblance of a ground game. I think if they were able to still have Sammy Morrison there, he was super effective, they would have won that Super Bowl."
  },
  {
    "speaker" : "Greg",
    "text" : "It's a pretty hot take.",
    "timestamp" : "01:08:43-01:08:44"
  },
  {
    "text" : "There you go.",
    "speaker" : "Andy",
    "timestamp" : "01:08:44-01:08:45"
  },
  {
    "timestamp" : "01:08:45-01:08:46",
    "text" : "But it's hot.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:08:46-01:08:59",
    "speaker" : "Andy",
    "text" : "Yeah. So don't at me, as they say. And also, I feel like we're doing this. That take was mid, bro. I feel like we're doing this on a regular basis. So I think this is gonna be a segment."
  },
  {
    "timestamp" : "01:09:00-01:09:15",
    "speaker" : "Greg",
    "text" : "Um Steve didn't understand that, did you, Steve? I didn't get it at all. Mid. That's it. That's like the new way kids are calling things like mediocre. Shitty are lame. Something is mid."
  },
  {
    "text" : "I'm more of a bussin guy. I've been using that one.",
    "speaker" : "Steve",
    "timestamp" : "01:09:16-01:09:18"
  },
  {
    "text" : "Busting. Busting rules, dude. I gotta give you that one.",
    "speaker" : "Greg",
    "timestamp" : "01:09:19-01:09:23"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:09:23-01:09:37",
    "text" : "I use it incorrectly, but I like it. No kidding Like I like it if something's busy, like oh this place is bussing, you know? It's like it's the lock of twisting at the seams, yes. Not unexpectedly good."
  },
  {
    "timestamp" : "01:09:38-01:09:39",
    "speaker" : "Greg",
    "text" : "Typical"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:09:39-01:09:44",
    "text" : "All right, but yeah, I wanted to uh busting with the boys, me and the dogs hanging out while busting around."
  },
  {
    "timestamp" : "01:09:44-01:09:49",
    "speaker" : "Greg",
    "text" : "Food can be busting, you know. Oh yeah, anything can be busting. Fucking burger is busting."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:09:50-01:10:05",
    "text" : "God damn it. We were in New York and Ellie didn't even know what it meant. It's getting old. And I was like, come on, Ellie. And then like a couple days later, she sends me a screenshot from one of her teachers saying, oh, there's three coffee places giving out coffee. It's busted."
  },
  {
    "text" : "And Steve's like, it means busy.",
    "speaker" : "Greg",
    "timestamp" : "01:10:07-01:10:09"
  },
  {
    "text" : "That's when I realized that it was wrong. Oh shit, that's that's how you're supposed to use it.",
    "timestamp" : "01:10:11-01:10:16",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:17-01:10:27",
    "text" : "Oh shit, that's awesome. Yeah. So well speaking of business, I I want to do a new segment. Um it's we call it Bussin with the Browns. Sure."
  },
  {
    "timestamp" : "01:10:28-01:10:31",
    "speaker" : "Greg",
    "text" : "Yeah. Like let's get a jangle for that."
  },
  {
    "timestamp" : "01:10:31-01:11:40",
    "speaker" : "Andy",
    "text" : "Or Billy Bussin. Um, because it's Basically, how was Bill Belichick a genius in this game? So it's gonna be Greg's favorite. Yeah. Because we had something last week. I don't remember what it was. Do you, Steve? Something last week. Yeah, but something about Bill Belichick being a genius. So this this week, um Bill Belichick rolled out something that John Madden had never seen before. And when you've done that to John Madden, I think you can qualify that as something that's genius. In this case, he rolled out a defense with zero defensive linemen because the Dolphins decided that they weren't going to run the ball. Um probably maybe because they had Sammy Morris and who was the other guy? Travis Minor, I believe, were the two running backs. Yep. Um so the Pages were just not going to respect the because they they weren't throwing the ball on or they weren't running the ball on first down. So they put out six linebackers and five defensive backs and going off the field every single time that they they rolled that out. So and it was one of those things where they had, you know, nobody um In a three-point position, like everybody was standing around milling around like they do. The uh the Amoeba defense, but also with no linemen, which"
  },
  {
    "timestamp" : "01:11:41-01:11:45",
    "speaker" : "Steve",
    "text" : "John Madden for the day's day and age is not that uncommon, but right."
  },
  {
    "timestamp" : "01:11:45-01:12:18",
    "text" : "I I would kind of expect to see that in today's day and age because nobody runs a ball anyway. So there's gets some pass rush specialists out there. But I think Belichick's kind of going the other way, where he is phasing out linebackers altogether. And I think he's going to do what the Dutch did in the 70s and play total football. And have a positionless defense and everybody's going to be a safety. An oversized safety who can cover and also tackle. And also Russ Apasha. So how's that for hot take, Greg? Positionless defense. Stop listening.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:12:20-01:12:31",
    "speaker" : "Steve",
    "text" : "Once you hear the doll check genius, see how much of a blubbering little bitch Greg is. Dolphins, 20 carries, 52 yards."
  },
  {
    "timestamp" : "01:12:32-01:12:33",
    "speaker" : "Greg",
    "text" : "Not great. That's what I mean."
  },
  {
    "timestamp" : "01:12:33-01:12:34",
    "speaker" : "Steve",
    "text" : "Three touchdowns though."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:12:35-01:12:42",
    "text" : "Did you know that uh Jason Taylor married Zach Thomas' wife? Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Wait, his wife?",
    "timestamp" : "01:12:43-01:12:44"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:12:44-01:12:46",
    "text" : "Sister. Sorry."
  },
  {
    "speaker" : "Andy",
    "text" : "I was gonna say. And didn't didn't Zach Thomas and uh Kevin Euclid have A family member in common or something like that?",
    "timestamp" : "01:12:46-01:12:54"
  },
  {
    "text" : "Brady. Brady. You both married Brady's sister. Yeah. Oh, that's what it was. All right. Also, Jason Taylor's sister is Joy Taylor from the Colin Coward show.",
    "timestamp" : "01:12:54-01:13:05",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:13:05-01:13:05"
  },
  {
    "text" : "You don't know that? No.",
    "timestamp" : "01:13:05-01:13:07",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:13:07-01:13:07",
    "speaker" : "Andy",
    "text" : "Oh, yeah."
  },
  {
    "timestamp" : "01:13:08-01:13:09",
    "speaker" : "Steve",
    "text" : "I don't know who that is."
  },
  {
    "timestamp" : "01:13:10-01:13:23",
    "speaker" : "Greg",
    "text" : "It's like the the second host. Yeah. The coward where he's always tell you he's always like joy joy I got something to say, joy. Yeah. No, I was calling coward. Don't don't play dumb like me."
  },
  {
    "timestamp" : "01:13:24-01:13:35",
    "speaker" : "Andy",
    "text" : "We know Sia because we had um oh wait no does she work? We we had uh that guest on who worked for Colin Coward. Really? Manufacture the hot takes for him, yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Yep.",
    "timestamp" : "01:13:35-01:13:35"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:36-01:13:37",
    "text" : "Oh, cool. What did you say?"
  },
  {
    "timestamp" : "01:13:38-01:13:46",
    "text" : "We were just like, how the hell do you like, do you actually believe these hot takes? And they said, no, they don't. Right. All they care about is getting people riled up.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Tanya Ray Fox, that's who it was.",
    "timestamp" : "01:13:47-01:13:48"
  },
  {
    "timestamp" : "01:13:49-01:13:52",
    "speaker" : "Steve",
    "text" : "That's right. Yep. That's interesting."
  },
  {
    "text" : "She also shared Steve's hate for Brett Farb, though, so they bonded on that. Yes. And she relayed a story of Brett Favre not knowing what a cover two defense was. He didn't understand the idea of cover two.",
    "timestamp" : "01:13:52-01:14:04",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That was one of the playoff episodes, I feel like. Of the 2000 No, uh I don't remember.",
    "timestamp" : "01:14:05-01:14:10"
  },
  {
    "timestamp" : "01:14:11-01:14:13",
    "speaker" : "Andy",
    "text" : "I thought it was the Green Bay episode. That's why we're talking about Brad Five."
  },
  {
    "text" : "Maybe. Yeah. There's in so many fucking episodes I can't keep them straight. There have been a lot of episodes, this is correct. How many are we on right now?",
    "speaker" : "Steve",
    "timestamp" : "01:14:16-01:14:23"
  },
  {
    "timestamp" : "01:14:24-01:14:27",
    "text" : "Uh 84, something like that, mid-80s.",
    "speaker" : "Andy"
  },
  {
    "text" : "Hey Kelly, you're live on the pod. Okay. I was just telling you to say hi. You don't want to go on and say anything for the fans?",
    "timestamp" : "01:14:28-01:14:37",
    "speaker" : "Greg"
  },
  {
    "text" : "I love you, I miss you so much.",
    "speaker" : "Kelly",
    "timestamp" : "01:14:38-01:14:40"
  },
  {
    "speaker" : "Greg",
    "text" : "Kelly, what'd you have for dinner tonight? Alright, bye Kelly.",
    "timestamp" : "01:14:40-01:14:44"
  },
  {
    "speaker" : "Kelly",
    "text" : "Bye",
    "timestamp" : "01:14:44-01:14:45"
  },
  {
    "timestamp" : "01:14:46-01:15:09",
    "speaker" : "Andy",
    "text" : "Oh goodness. All right. I think on that note, yeah, we we hard. Appreciate that. Mm-hmm. On that note, do you have anything else you'd like to talk about in this game? What's next week? Next week. Pages travel to Giant Stadium To play the New York football Jets."
  },
  {
    "speaker" : "Greg",
    "text" : "Yo, next week is gonna be Boston.",
    "timestamp" : "01:15:09-01:15:11"
  },
  {
    "text" : "Boston. The 10 and 4 New York Jets coming in. Ooh. Yeah. Four o'clock game. Sunday. It's the day after Christmas. Boxing day.",
    "speaker" : "Andy",
    "timestamp" : "01:15:11-01:15:21"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, that's pretty mid.",
    "timestamp" : "01:15:21-01:15:22"
  },
  {
    "text" : "Two thousand four. You're pretty mid, you fucking Goober.",
    "speaker" : "Andy",
    "timestamp" : "01:15:22-01:15:27"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, let's make an effort for for next week to to see if we can get a little younger demo going here and start using some fucking slang. All right, some TikTok slang.",
    "timestamp" : "01:15:27-01:15:36"
  },
  {
    "text" : "Yeah, I'm all over it.",
    "timestamp" : "01:15:37-01:15:39",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:15:39-01:15:39"
  },
  {
    "speaker" : "Andy",
    "text" : "Steve's busting all over it. It's spicy. This is gonna go well. I can feel it. My boy be bussing.",
    "timestamp" : "01:15:40-01:15:49"
  },
  {
    "speaker" : "Steve",
    "text" : "I'd be busting every day.",
    "timestamp" : "01:15:50-01:15:52"
  },
  {
    "timestamp" : "01:15:52-01:16:02",
    "speaker" : "Andy",
    "text" : "Goodness. And on that note, until we see you next week or whenever we record another episode. We will see you later."
  }
]