[
  {
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:24-00:41",
    "text" : "Welcome back to the Pagents Diocese Podcast. The podcast where we're going back and re-watching every game of the dynasty era. Uh we haven't actually done that in a while. Uh but we are back at it today. And with me, Are the trusty brothers Brown, Steve and Greg. Boys, how you doing?"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm doing great and full of piss and vinegar for this playoff. All right.",
    "timestamp" : "00:41-00:45"
  },
  {
    "timestamp" : "00:46-00:57",
    "speaker" : "Greg",
    "text" : "It's all that at this point, you know? Oh um beating the Colts again. Another minute. Yeah. Wake me up in the Super Bowl."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:59-01:46",
    "text" : "Well, all right. Uh so yeah, if you hadn't uh if you weren't aware, if you've forgotten, because it's been so long since we've done one of these, we are starting the 2004 playoffs. with the AFC divisional round where the Colts would come to Foxboro Stadium. No, Foxboro, Massachusetts, Gillette Stadium. No longer Foxboro Stadium. To play the New England Patriots, who uh came into the game at 14-2. No big deal. Colts would finish their season 12 and 4. One of those losses was to this New England Patriots. The first week of the season. And after that game, they mentioned in the in this the the announcers were saying that Tony Dungey said uh because we lost that, we'll be playing them in January at their place."
  },
  {
    "text" : "That's right. He foreshadowed this.",
    "speaker" : "Steve",
    "timestamp" : "01:46-01:48"
  },
  {
    "timestamp" : "01:48-01:54",
    "speaker" : "Andy",
    "text" : "He sure did. Mm-hmm. He was correct. But this was done something about it."
  },
  {
    "speaker" : "Steve",
    "text" : "That game was at Indianapolis too, right?",
    "timestamp" : "01:55-01:57"
  },
  {
    "speaker" : "Greg",
    "text" : "No, it was Banner Night, Stevie. Come on. It was what? It was Banner Night, baby. You're thinking of the the goal line stock game. That was last year.",
    "timestamp" : "01:57-02:05"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:05-02:27",
    "text" : "Yeah, that was 2003. Yeah, this year was um peak Peyton Manning. This was uh what Uh all the the kids have forgotten when they say that um the whoever their favorite current quarterback is is the best quarterback ever. The scariest quarterback ever."
  },
  {
    "speaker" : "Greg",
    "text" : "GOAT. Can I get that off my chest? GOAT, that whole acronym is the most overused thing in not even just sports, but in everything. I feel like it wasn't really a thing before Brady though. It was. It wasn't. Maybe Jordan started it. And then I think it came it came around at like the same time. People started calling Brady the goat, and then they're like, well, Jordan's the GOAT. And then next thing you know, everybody under the sun is the goddamn goat.",
    "timestamp" : "02:28-02:55"
  },
  {
    "text" : "It's true, yeah.",
    "speaker" : "Andy",
    "timestamp" : "02:55-02:56"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:57-03:08",
    "text" : "Look at this little goat I have from Chewy still. Remember this thing guy, Craig? What? Why do you have that? Because you know me, I like keeping old shit for way too long."
  },
  {
    "timestamp" : "03:09-03:11",
    "speaker" : "Greg",
    "text" : "What significance did that have though?"
  },
  {
    "timestamp" : "03:11-03:15",
    "text" : "That was before this was the Tom Brady goat that we had in the minivan.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't know, I would have thought the minivan outdated that. Oh no, this thing is definitely chewy.",
    "timestamp" : "03:16-03:21"
  },
  {
    "speaker" : "Andy",
    "text" : "For those that don't know, we used to have a uh Plymouth Grand Voyager that was originally purple until we rattle canned it uh four, five, six times. uh into different things. I think the little when it died, was it still the uh the green monster phenomenon?",
    "timestamp" : "03:22-03:37"
  },
  {
    "text" : "Yeah we we redid the green monster one time.",
    "timestamp" : "03:37-03:39",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:39-03:42",
    "text" : "Yeah we do yeah we did that one twice I think um"
  },
  {
    "speaker" : "Steve",
    "text" : "Why do we never do a Patriots a GOAT version, you know? Yeah, we're gonna change the license plate to goat.",
    "timestamp" : "03:42-03:50"
  },
  {
    "speaker" : "Andy",
    "text" : "We could have. We could have done it like the uh dumb and dumber. Did you say that's too gauche, Andy? Yeah. Jesus Christ. Actually, no what you know why? Is because uh I could only do straight lines with the tape. So I could I could do the boxes for Family Park, but I couldn't do like I I wasn't able to freehand the Patriots logo. It's free paint.",
    "timestamp" : "03:51-04:15"
  },
  {
    "text" : "How do we do those silver flames then? Because those things are tits. Those were awful. Bad flame.",
    "timestamp" : "04:17-04:22",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "04:24-04:30",
    "text" : "We just spray paint. We just got spray paint from the store. Well that was when Pimp and my ride was was hot in the streets."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:31-04:37",
    "text" : "That's true. So you bought those spinning hubcaps that would helicopter off the side of the van if you were on highway speeds."
  },
  {
    "timestamp" : "04:37-04:52",
    "speaker" : "Greg",
    "text" : "And if you remember the first iteration, we just literally wrote pimped my ride in spray paint, and mom was like, you will not be driving a car that's just Bimp around on her. To be fair, that's yeah, that's kind of legit."
  },
  {
    "timestamp" : "04:53-05:18",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, that that was a wise decision by her. But uh speaking of of pimping pimping rides, this Colts offense was was big pimping in the exhibit of the NFL at that point. 100%, yeah. Cause uh if you like uh thousand yard receivers, they'll give you Not one, not two, but three one thousand yard receivers in the same season. Can you name them?"
  },
  {
    "timestamp" : "05:18-05:27",
    "speaker" : "Greg",
    "text" : "Yep, Harrison Wayne Stokely. You're reading my notes, aren't you? No, I'm reading my own notes. Look who came preparing for the playoffs."
  },
  {
    "timestamp" : "05:28-05:32",
    "speaker" : "Andy",
    "text" : "Holy shit. Uh-huh. You got it. You didn't get it in order, but that's close enough."
  },
  {
    "text" : "They had ru rookie Dallas Clark, too, the tight end.",
    "timestamp" : "05:32-05:35",
    "speaker" : "Steve"
  },
  {
    "text" : "I don't know if it was rookie, but it was early Dallas Clark. Yeah.",
    "timestamp" : "05:35-05:37",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "05:38-05:38",
    "speaker" : "Steve",
    "text" : "Zap early."
  },
  {
    "text" : "Yeah. And he went for, I don't know, like close to a thousand yards. And then the only real players they had on defense was Dwight Freeney and Robert Mathis. who were sack specialists, especially in the dome, um, on that that turf. Uh I think Freen actually led the league with 16 sacks. Mathis had 10 and a half himself. And then they also had um rookie Bob Sanders, their first pick of the 2004 draft, which came in round two. I don't really have the first round draft. Um so with this offense, you you know, you'd think they would go pretty heavy in the draft, the Colts So 2004, I'm just gonna give you the positions that they drafted. Um safety, tight end linebacker, linebacker, cornerback, guard, cornerback, quarterback, kicker. Um all of those players except the kicker actually made the roster and this this defense was garbage. Like there's no names on here that are actually worth",
    "speaker" : "Andy",
    "timestamp" : "05:39-06:35"
  },
  {
    "timestamp" : "06:36-06:43",
    "text" : "Like middle of the road though, weren't they? Uh 17th or something in points. It was one of those things, yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "It was one of those things where um the Other teams, the powerhouses in the AFC were like the first and second scoring defenses. And then it was the Colts who just decided we're not doing defense this year. Uh and they just they just won games on on offense alone.",
    "timestamp" : "06:43-07:01",
    "speaker" : "Andy"
  },
  {
    "text" : "But I mean their offense is historically good. Like we talked about it last year about how hot they were coming into that AFC championship game, but this team was Arguably a better offense than the Colts team last year. This was on record too. Yeah.",
    "timestamp" : "07:02-07:19",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Uh 'cause this is the year that Peyton Manning broke Marino's touchdown record where they threw 49 touchdowns in the season. Um and was and man it was named MVP, of course. And they actually the Colts themselves threw 51 total touchdown passes because Jim Sorgi. Played he didn't actually start the last game of the season, but he played, you know, most of it with the starters and threw a couple touchdown passes. Um And actually the the Colts were, you know, again, one of the hottest teams in the league. The Pages haven't lost since week eight to the Steelers still. Um no, that's not right. They lost uh They lost that two random game to Miami, yeah. The night cards wore orange, dude. That's right. Exactly, right. Um Colts also nine and one in their last ten games. The only game they lost was They played Denver last week of the season in Denver. And then I think Denver like had to win to get in the playoffs. And if Denver won, they would play the Colts in Indianapolis. So the cultures like trotted out the second team and and lost. Yep. Shut up. But then they smoked the Broncos the next week at home. They scored five touchdowns in the first half.",
    "timestamp" : "07:19-08:33"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, it was 49, 49, 24, 35 to 1 at halftime. Yeah. Manning through for He was twenty si twenty-seven to thirty-three for four fifty-seven four touchdowns, which was the second highest passing total in a playoff game up to that point.",
    "timestamp" : "08:33-08:48"
  },
  {
    "timestamp" : "08:48-09:18",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, Reggie Wayne had uh 10 catches, 221 yards, and two touchdowns in that game. Because they were picking on I actually found, for some reason, there's no video of that game. Like I even found the uh the primetime like uh like post-game highlights clip of like all the games and for some reason that game had been cut out. So I don't know why, but I admit you know I have nerd connections as I do. And I found the extended highlights. And it was basically, do you remember Rock Alexander?"
  },
  {
    "speaker" : "Steve",
    "text" : "No. No.",
    "timestamp" : "09:19-09:19"
  },
  {
    "speaker" : "Andy",
    "text" : "I only remember him for the name, but he was a defensive back on the the Broncos and he had a bad day covering Reggie Wayne.",
    "timestamp" : "09:19-09:25"
  },
  {
    "text" : "So he just got torched the. I don't think you needed to watch the highlights to to gather that, Andy.",
    "timestamp" : "09:25-09:31",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Temp it was literally just Peyton Manning picking on this one defensive back for five touchdowns four touchdowns and four hundred yards. Ridiculous.",
    "timestamp" : "09:31-09:40"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "09:40-09:43",
    "text" : "Well, and then the Patriots don't have Tylaw or Tyrone Poole."
  },
  {
    "text" : "Yeah. The Patriots are starting uh, you know, Brandon Soakley, a thousand-yard receiver in the slot, is going up against Troy Brown. As the defensive back.",
    "timestamp" : "09:44-09:53",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, it's crazy. What was the what was the line on this game? Who's favored?",
    "timestamp" : "09:53-09:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Patriots by one. So secondly the Colts, because you get three points at home.",
    "timestamp" : "09:59-10:04"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "10:04-10:04"
  },
  {
    "timestamp" : "10:05-10:07",
    "speaker" : "Andy",
    "text" : "Um wait what uh what I'm gonna do."
  },
  {
    "speaker" : "Steve",
    "text" : "Vegas General's by pages by four, you mean? Or play in by home.",
    "timestamp" : "10:07-10:11"
  },
  {
    "speaker" : "Andy",
    "text" : "No, it's pages by one.",
    "timestamp" : "10:11-10:13"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, so Patriots by four. Well no, if it was on a neutral field, it'd be Colts by two.",
    "timestamp" : "10:13-10:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Right, exactly. So here, I'm gonna play the intro to this though. Because it was pretty legit. Intro to the game right now? Yeah. Yeah, to the game. How long is it? A minute.",
    "timestamp" : "10:17-10:32"
  },
  {
    "timestamp" : "10:35-12:00",
    "text" : "They are the talk of the National Football League and everyone is asking the same question. Three words defense defense defense Bill Belvachek's Patriots had the answer a year ago, stifling Peyton Manning and Indianapolis. was his attempt to go to the Super Bowl. This season they met again with the same result. Willie McGill back a jick is up the deep is no good, no good. A win today would advance the Patriots' place in history and add to the talk of their modern day dynasty. They haven't lost at home in over two years, and the same question applies. Discipline, perseverance, commitment, teamwork. Here we go. Back to back. Touchdown, three touchdown. Indianapolis. The Colts are on a roll and focused on finally winning in Boxboro. New England, Indianapolis, two teams with the same question. Which team will have the answer today? It's game time, baby.",
    "speaker" : "Announcer"
  },
  {
    "speaker" : "Steve",
    "text" : "How hard are your nipples, Andy?",
    "timestamp" : "12:05-12:07"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah. I guess we need to fucking stop the podcast. Yeah, if I can't be on it, no one can be on it.",
    "timestamp" : "12:10-12:15"
  },
  {
    "text" : "This is my thing. I'm gonna stop recording Satan Manning over here. That's that's I you're right. How the fuck did we not think of that? Yeah.",
    "timestamp" : "12:15-12:28",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "12:30-12:36",
    "speaker" : "Greg",
    "text" : "That's pretty clever. It's perfect. Yeah, that's fantastic. Even though he's kind of a lovable guy at this point."
  },
  {
    "speaker" : "Steve",
    "text" : "But that's how Satan, you know, gets you to drop your guard.",
    "timestamp" : "12:36-12:40"
  },
  {
    "timestamp" : "12:40-12:41",
    "speaker" : "Andy",
    "text" : "That's true."
  },
  {
    "timestamp" : "12:41-12:59",
    "text" : "Tell us more about that, Steve. You don't always see his horns. Sometimes he looks real friendly, but then He gets in there and he's a real piece of shit and he makes his wife buy his HGH. Is that why sins feel so good? Yes. Okay. Uh-oh. Since you were doing on your little hiatus there, Andy.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "13:00-13:08",
    "speaker" : "Andy",
    "text" : "I don't know what the hell happened there. You mean covetous, Andy? Not being on the podcast."
  },
  {
    "text" : "I believe it. We'll let you back in, I guess.",
    "speaker" : "Greg",
    "timestamp" : "13:08-13:11"
  },
  {
    "speaker" : "Andy",
    "text" : "Speaking of covetous, uh Patriots haven't lost at home in two years. Did you hear that part?",
    "timestamp" : "13:12-13:17"
  },
  {
    "text" : "I did. Did he hear that part?",
    "speaker" : "Greg",
    "timestamp" : "13:17-13:19"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's pretty awesome. Um, but uh I think uh if we're if we're talking covetous, we should talk about the Boston Globe. Um Because we have we actually have a new intern who will join us at some point. Um our buddy Tim, who is helping out. And so we cut up some of the Boston Globe articles And uh my favorite are the staff picks because all of them have scores in the 30s. Uh except for Ron Borges, where he only gave the Colts uh 28 points to beating the Patriots. Um and uh Bob Ryan was probably the the your typical Bob Ryan Boston sports Media negativity. Pick Colts 31 pages twenty eight. A game I've been dreading for two months.",
    "timestamp" : "13:19-14:11"
  },
  {
    "speaker" : "Greg",
    "text" : "Fucking sound that negative it's a don't stank yourself. Bob Ryan, what a how can you get mad about that, Andy? You Watch me.",
    "timestamp" : "14:12-14:21"
  },
  {
    "text" : "Is that a real question, girl?",
    "speaker" : "Steve",
    "timestamp" : "14:22-14:24"
  },
  {
    "timestamp" : "14:24-14:28",
    "speaker" : "Greg",
    "text" : "Every day with how like cynical you can actually be."
  },
  {
    "text" : "How about this Dan Shaughnessy? Patriots 35, Colts 34. Patriots get break when Vanderjack misses extra point as Walt Coleman erroneously rules wide right.",
    "speaker" : "Andy",
    "timestamp" : "14:30-14:39"
  },
  {
    "text" : "I like that.",
    "speaker" : "Greg",
    "timestamp" : "14:39-14:40"
  },
  {
    "timestamp" : "14:40-14:42",
    "speaker" : "Andy",
    "text" : "Wait to take that seriously, Dan Shaughnessy."
  },
  {
    "text" : "Like we take this seriously? I get why they're picking high scores though. I mean I think it was supposed to the they're saying the weather was supposed to miss.",
    "timestamp" : "14:44-14:53",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, it wasn't supposed to come till later. Yeah, which would have made a lot more sense. But I mean, even having said that though, the Colts just came out like running the ball. Which kind of made sense because they they had a lot of success in week one with running the ball against the Patriots. They ran for like almost 200 yards, I think. Is that right? Um like their scoring drives were mostly like run based. But still, like they just came out trying to run the ball and it wasn't working early and they didn't really get away from it very quickly. They uh like they went three and out the first few drives and then back to it. Uh like their the only real drive they had was Uh when they they scored their only points in the game, a field goal right before half. They got the ball back with a minute 52 left. 11 plays, minute 52, and and kicked a field goal.",
    "speaker" : "Andy",
    "timestamp" : "14:53-15:43"
  },
  {
    "speaker" : "Greg",
    "text" : "Your gunshot guy. They're gun shy. They they don't know what to do. They're owing six in New England with Manny. So they're like, we gotta try something different because what we've been doing does not work.",
    "timestamp" : "15:43-15:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, gotten their own. And we talked to Flop the other day. He he was saying the other he was saying the same thing. Like we asked him about Miami. He's like, we just get in our own heads. That's all it is. That's the reason we lose Miami all the time because we just get in our own heads.",
    "timestamp" : "15:55-16:08"
  },
  {
    "speaker" : "Steve",
    "text" : "That being said, taking the ball out of the MVP who just set the touchdown record is a bold strategy.",
    "timestamp" : "16:08-16:14"
  },
  {
    "speaker" : "Andy",
    "text" : "It is.",
    "timestamp" : "16:15-16:16"
  },
  {
    "timestamp" : "16:16-16:18",
    "text" : "But I guess Edrin James is pretty good too, though.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "16:18-16:36",
    "text" : "You know, you can argue that. He was a thousand-yard rusher. But Manning was 27 of 42, 238, no touchdowns, one interception. Sacked once for 18 yards. But I mean 42 attempts. How many attempts did you have the week before, Craig?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "16:37-16:38",
    "speaker" : "Greg",
    "text" : "33."
  },
  {
    "timestamp" : "16:38-16:53",
    "speaker" : "Andy",
    "text" : "33. So you had less attempts technically the week before. And at 458 yards. And this one he had four 42 attempts. A lot of those were like at the end of the game, they're just like trying to chuck it around. But it was too late at that point."
  },
  {
    "timestamp" : "16:53-17:00",
    "speaker" : "Greg",
    "text" : "I mean you build your team to play on turf. You can't really uh you can't really bitch and moan when you when you lose on grass."
  },
  {
    "timestamp" : "17:01-17:55",
    "speaker" : "Andy",
    "text" : "That's true. And there was some uh there was some controversy about that too, about how The uh the Patriots were letting the field get sloppy, like they didn't cover it or something in time. Um Let's see, it's I think that was in the globe too. It was uh yeah, basically the the field was was uh because of the weather, like oh yeah, they they let it uh they didn't cover it overnight, and so it was supposed to be bad. Um but it turns off turns out that uh that wasn't the case. Um they uh covered it when they were supposed to be covered and you know it's it's all just garbage but it was I remember that being brought up after the game by a lot of you know Colts fans and Colts media and stuff like that about uh you know patrons cheating again and all of that jazz. Which uh Greg thoughts."
  },
  {
    "speaker" : "Greg",
    "text" : "Have you seen the Vic documentary on ESPN?",
    "timestamp" : "17:57-18:00"
  },
  {
    "timestamp" : "18:00-18:01",
    "text" : "No.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "18:01-18:52",
    "text" : "Dude, first of all, you should watch it. Vic? Michael Vic is the fucking man. Like he's he's exactly what you would want a like how like putting someone in jail should work of like Yeah, he got caught up with his childhood friends. He really wasn't like a terrible person. They put him in jail and he was like, came out a changed man and has been great ever since. But the point being he was talking about when he gets on the turf and he's like, boy, you put me on that turf, ain't nobody stopping me. Which I think it's fair. You get like these crazy athletes. That is like a really big factor in games like this. We saw with Freeni on the turf, like how much faster he looks. You build your team. I mean, greatest show on turf is another good example. You have a team that's built around speed and quickness and athleticism."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "18:52-18:52"
  },
  {
    "speaker" : "Greg",
    "text" : "I think that is worth like 10 points.",
    "timestamp" : "18:53-18:57"
  },
  {
    "timestamp" : "18:58-19:00",
    "speaker" : "Andy",
    "text" : "Per game or just generally?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "19:01-19:01",
    "text" : "Per game."
  },
  {
    "speaker" : "Andy",
    "text" : "Jesus, okay.",
    "timestamp" : "19:02-19:03"
  },
  {
    "text" : "Yeah, I mean So do you think maybe the move from natural grass to synthetic turf? has increased the speed of the NFL, right?",
    "timestamp" : "19:03-19:13",
    "speaker" : "Steve"
  },
  {
    "text" : "I would say it slows it down. It's more, it's turf is I think the synthetic stuff is closer to grass than turf.",
    "speaker" : "Greg",
    "timestamp" : "19:13-19:21"
  },
  {
    "text" : "But they've gone away from both, right? There's no more like the old school turf, the greatest show on turf, turf. That shit was awesome. They should bring no more like sloppy. Oh, they should.",
    "speaker" : "Steve",
    "timestamp" : "19:21-19:30"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:30-19:35",
    "text" : "It was literally carpet on on concrete. Oh, dude. That's just destroyed people."
  },
  {
    "speaker" : "Steve",
    "text" : "So it was the opposite end of the spectrum of the just absolute slop, grass, mud. And in and its place is pretty much this shit everywhere.",
    "timestamp" : "19:35-19:44"
  },
  {
    "speaker" : "Andy",
    "text" : "But this game, like the the feel wasn't really that bad because I think it was so cold that it was kind of frozen. So there wasn't A lot of because I mean we watched earlier in the season the uh the Ravens game, which they reference in this. And that was remember there was like mud up to their ankles and stuff and Whoever the commentator was, Randy Cross, whoever was like they had the measuring stick in the in the mud to show how deep it was. And like yeah, that was a slot fest. Oh yeah. And that was two teams just like heavy weights just slugging it out. But this wasn't that. This like every there was no like lost footing. There was no people slipping around. It was just like it was a little cold and snowing a bit, but it wasn't like outrageous weather. No. In fact, I think uh uh it was uh almost shades of the fur the week one because the pages came out uh five wide in the first half. Like they did. Remember they they had all this uh Hullabaloo about getting uh Corey Dillon, right? And then they they started the game five wide, no huddle, and he wasn't even on the field for the first like drive, drive and a half.",
    "timestamp" : "19:44-20:48"
  },
  {
    "text" : "I remember that.",
    "timestamp" : "20:48-20:49",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So and it was kind of similar to this. Um, Bray's slinging around, he hit nine different receivers on the day. Um 1827 144. So he didn't have a big numbers. But he completed when he needed to. And it wasn't like lighten it up. I I think I think the biggest issue in this game was This is a running game, right?",
    "timestamp" : "20:49-21:10"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:10-21:20",
    "text" : "Let's This was not a throw of the ball around the park game from the Patriots. He had twenty seven pass attempts to what? Thirty Eight rushes."
  },
  {
    "timestamp" : "21:20-21:41",
    "speaker" : "Andy",
    "text" : "But this wasn't like pass attempts that we saw in the snowball or anything where people like slipping around like the balls all all over the place and you know. It wasn't like it wasn't a hot mess. It was every they were still playing their passing game. They just didn't need it as much because Corey Dillon ran for a hundred something yards and 144. Yeah. And Kevin Falk ran for another 56."
  },
  {
    "speaker" : "Greg",
    "text" : "So I mean Dylan had as many rushing yards as Brady had passing yards. I think that kind of tells the story, right?",
    "timestamp" : "21:42-21:50"
  },
  {
    "text" : "Yeah, but I'm saying it wasn't like it wasn't Cory Dylan had a longer run than Brady had uh a longest completion by like 17-yard log versus Corey Dylan at a 42-yard run.",
    "timestamp" : "21:51-22:03",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I think Corey had a couple of them too, didn't he?",
    "timestamp" : "22:03-22:05"
  },
  {
    "text" : "Shig Bate and Manny had a longest pass of 18 yards. Corey Dillon had the biggest play of the day.",
    "timestamp" : "22:06-22:12",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean, yeah, I th I think the biggest detriment in the passing game was wide receivers dropping balls. My guess is because their hands were cold. Because you know I think I can't remember if it was Dallas Clark or Brandon Stofley out there with no gloves.",
    "timestamp" : "22:12-22:24"
  },
  {
    "timestamp" : "22:25-22:27",
    "text" : "Maybe the balls were deflated.",
    "speaker" : "Greg"
  },
  {
    "text" : "Maybe they were overinflated.",
    "timestamp" : "22:27-22:28",
    "speaker" : "Andy"
  },
  {
    "text" : "Well the Patriots' balls are deflated, but the Colts balls were not. I've heard of rumors out there that that could be a thing.",
    "timestamp" : "22:31-22:39",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "What deflated balls?",
    "timestamp" : "22:39-22:41"
  },
  {
    "timestamp" : "22:41-22:45",
    "text" : "Andy, what's the ideal gas law off the top of your head? Don't look it up.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "22:45-22:50",
    "text" : "Um I don't know. I actually used to know it, so I'm disappointed in myself.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:51-22:55",
    "speaker" : "Greg",
    "text" : "Yeah, I figured you were being a fucking hard on nerd."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, who's the nerd now?",
    "timestamp" : "22:56-22:58"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "22:58-23:11",
    "text" : "Well, I spent like however many dollars going to college for it, so I probably should know that. Outside of the Patriots Deflate Gate. Big dick dummies."
  },
  {
    "speaker" : "Andy",
    "text" : "Right, exactly. Craig's got that tiny dick energy right now.",
    "timestamp" : "23:11-23:16"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, tiny dick energy. Dude, that's equal to RT squared. Yeah, that's a buddy dirty bad.",
    "timestamp" : "23:16-23:24"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "23:25-23:32",
    "text" : "I'm like a Roman statue over here. Just fucking tiny dick swinging, dude. Just using all my brain power in my head."
  },
  {
    "text" : "Doesn't even get past the balls. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "23:33-23:35"
  },
  {
    "timestamp" : "23:36-23:52",
    "speaker" : "Andy",
    "text" : "Jesus. So I mean I I guess uh it didn't feel to me I don't know how it felt to you guys, but like it didn't feel to me like this was like Corey Dillon running wild."
  },
  {
    "text" : "Well Steve didn't watch the game. Let's put that up up front. That's not true. I watched the first half of the game. He said, okay, we're busy we cool. And while let's get something on the air while we're on the fucking while we're alive here. I got some grievances to air against you, Steve. Oh boy. We were supposed to record last night. And Steve texted last minute. I'm gonna be late, you guys do it alone. And I didn't want to do it alone because I love you so much, Steve. But I had Cooked pizzas in the oven and I was shoveling them down my gullet to get ready for seven. I burnt the living hell out of the top of my mouth. Dude, I haven't been able to t taste anything for fucking 24 hours. And then you just go. I will push it to tomorrow. And every time I think about it, Steve, I'm like that son of a bitch, Steve Brown. Do you don't you don't think this wasn't planned?",
    "speaker" : "Greg",
    "timestamp" : "23:53-24:46"
  },
  {
    "timestamp" : "24:47-24:53",
    "speaker" : "Steve",
    "text" : "Do you know this was part of my master plan? You think I didn't know that you were having pizza for dinner? Check your wife's phone, Greg. She's a rat"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, well jokes on you. Even if I didn't have a deadline to admit, I still would have crammed it down my gullet and burned to talk about nets.",
    "timestamp" : "24:55-25:02"
  },
  {
    "text" : "This is how you eat. Oh, Jesus Christ. I'm not even gonna go there because uh Greg, I don't th I don't think you're uh blameless in this at all. Why? That's all Um, because you're the one that made us change the date the the day of the week to do this because you had soccer on Thursdays when we normally record my failed to mention. You're injured.",
    "timestamp" : "25:03-25:31",
    "speaker" : "Andy"
  },
  {
    "text" : "I am injured.",
    "speaker" : "Greg",
    "timestamp" : "25:31-25:32"
  },
  {
    "timestamp" : "25:32-26:33",
    "speaker" : "Andy",
    "text" : "Mm-hmm. So I was also cramming food down my gullet. You guys eat? I'm just so busy I can't even eat, you know? Oh. Um speaking too busy, how about that Tony Dungey? Um, you seemed like a busy guy on this day. Um The he he seemed pretty excited that um for the first time in I think the last four games uh he won the the coin toss against the Patriots, so he was able to put his high octane offense on the field because the last I think the last four games, last three games, the Pagers won the toss and gone down and scored the opening points. Um so You would think that this was like the perfect start for the Colts. They get the ball first. That you had a decent kick return too. Um start at like the 35, almost 40. And then three and out immediately. Running the ball. That's garbage. Can't do that."
  },
  {
    "text" : "Let's let's let's read out uh Edge's stat line for the game. Give it to me. Uh he has like fourteen carries, thirty-nine yards along of seven.",
    "speaker" : "Steve",
    "timestamp" : "26:33-26:48"
  },
  {
    "speaker" : "Greg",
    "text" : "Long of seven Did we say the score? Did we already mention the score? We have not mentioned the score. The final score is Patriots 20, Colts three. Yeah. So not great from the offensive standpoint for the Colts. Generally, yeah. Uh let's see. But we didn't completely shut them down. It was kind of like odds and ends on how they got stopped. I mean they had 230 passing yards. Didn't run the ball well but They had a bunch of drops. There's only one interception. Should have been two though. But there's only one, right? There's three turnovers, I guess.",
    "timestamp" : "26:48-27:23"
  },
  {
    "text" : "You that you can many hit Eugene Wilson between the two and the nine in the end zone on their field goal, on the only points they scored in the field goal. Yeah. The play before. Should have been a shutout. Should have been a shutout. But I mean, yeah, I mean holding this team of three points.",
    "speaker" : "Andy",
    "timestamp" : "27:23-27:37"
  },
  {
    "text" : "You know what it is. It's time of possession. That to me, that's the takeaway from this entire game is complete domination in time of possession.",
    "speaker" : "Greg",
    "timestamp" : "27:38-27:47"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:47-27:55",
    "text" : "Well this is where you get the nickname clock killing Cory Dylan, right? That was a nickname? Yeah."
  },
  {
    "text" : "I like it.",
    "timestamp" : "27:56-27:57",
    "speaker" : "Steve"
  },
  {
    "text" : "I didn't make that up. I ain't I ain't that clever. I didn't know that either. Really? You've never heard clock killing Corey Dylan? No. Man, I thought I was doing a podcast with Pat's fans. What the fuck happened? But yeah, no, I think it it basically came from this game where 'cause like Greg says, the Patriots had almost thirty eight minutes of possession of the the Colts 22.",
    "timestamp" : "27:57-28:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "28:21-28:25",
    "text" : "21 plus minutes in the second half. Yeah. Cool."
  },
  {
    "timestamp" : "28:25-29:00",
    "text" : "It was 6-3. Their second half was you got super quiet all of a sudden, Greg. But their second half drives were let's see. Um third quarter, they got the ball with 946 left, 15 plays. Eight minutes, 16 seconds, 87 yards, ended in a touchdown. The next drive, they got the ball in the fourth quarter. Uh just started 14 minutes and 34 seconds left in the fourth quarter. 14 plays, starting their own six. Fourteen plays, seven and a half minutes, ninety-four yards, another touchdown. That's basically a quarter right there in two drives.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:04-29:06",
    "text" : "One quarter, two touchdowns.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, and they had a 16 place 78 yard drive in the first half, too. That ended in a field goal.",
    "timestamp" : "29:07-29:12"
  },
  {
    "text" : "That ending in a field goal is bullshit.",
    "speaker" : "Steve",
    "timestamp" : "29:13-29:15"
  },
  {
    "timestamp" : "29:16-30:02",
    "speaker" : "Greg",
    "text" : "So their seven season averages less than six plays, twenty-five yards, uh drive and two and a half minutes. So you get drives of sixteen, fifteen, and fourteen, eight over eight minutes twice and over seven minutes another time. That's It's pretty dominant. Guess the Colts longest drive. Oh, I actually wrote this down. This is funny. Because it's it's funny in both terms of plays and time. All right, give it to me. If for plays, it's 12 plays, 59 yards, 2 and a half minutes, and it ended an interception. And for time, it's eight plays, thirty yards, four and a half minutes, and it ends in a fumble."
  },
  {
    "speaker" : "Andy",
    "text" : "Jesus. Yeah, and their one scoring drive was 11 plays, minute 52, 67 yards, and a field goal. It's garbage time, right? It's fucking end of the game. Well, that was the end of the half, yeah. So Yeah, definitely definitely a rough one. Um but uh also I don't know if you guys caught this, but um they were talking about Rodney Harrison and obviously, you know, in typical Rodney fashion, he was irritated to hear all the talk about the Colts offense, so he obviously had a chip on his shoulder. Which, you know, shop harp for the course. Um, but he was also saying that even with like Missing Tylaw and everybody, he was more confident in the defense this year compared to last year's playoffs against the Colts. Um because he said they had found some new wrinkles this time. Miss And also they mentioned something he about how he was saying that they found some tells on Manning's play action, which they felt like they could use to their advantage, which I think probably worked because I don't remember any play action play working. But I was kind of shocked that like there was no more talk about that because I feel like finding a tell on Peyton Manning is especially in a year that he threw 49 touchdowns is kind of a big deal, no?",
    "timestamp" : "30:05-31:17"
  },
  {
    "timestamp" : "31:18-31:31",
    "text" : "Yeah, I don't know. I feel like Harrison kind of talks out of his ass sometimes. I mean that's feeling more confident this year than last year. Like uh I don't know about that, dude. Just in their approach.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "31:31-31:38",
    "speaker" : "Andy",
    "text" : "Well, they held him to three points, which is better than they did last year, right? I felt like this was a more dominant defensive play, you think?"
  },
  {
    "text" : "Yeah. I don't know. I felt like they were hanging on at the end of the last year's game. Yeah, because the offense was horrendous, if you remember.",
    "timestamp" : "31:38-31:45",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Was it? Yeah.",
    "timestamp" : "31:46-31:46"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Remember Brady had that chance like kill the game and he threw an interception. That's right. There was like Ty Law and Harrison were like pissed on the sidelines.",
    "timestamp" : "31:47-31:55"
  },
  {
    "timestamp" : "31:57-31:58",
    "speaker" : "Andy",
    "text" : "That's right, yeah."
  },
  {
    "text" : "I do remember.",
    "timestamp" : "31:58-31:58",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I argue with the results though.",
    "speaker" : "Steve",
    "timestamp" : "31:58-32:00"
  },
  {
    "text" : "I suppose, yeah, but still. Um I mean that team is you lose Ty Lion Richard Seymour. I don't care how good your scheme is.",
    "timestamp" : "32:01-32:10",
    "speaker" : "Greg"
  },
  {
    "text" : "You know. That's true, but you also gain um Vince Wilfork in the middle, which probably single-handedly helped slow down that rushing game. Oh yeah.",
    "timestamp" : "32:12-32:21",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:21-32:25",
    "text" : "I mean Vince Wolfwark's not as good as Richard Seymour though. That's a step down."
  },
  {
    "text" : "At at run defense? Mm-hmm. I don't know. I'd probably give the slight edge to Will Fork. I mean also it's rookie Will Fork, so maybe not at this point, but yeah. I understand where you're coming from. Um let's see. What else we got? Yeah. Oh, did did you catch that Peyton Manning had the fourth longest run against the Pages defense this year? It's a 19-yard scramble in week one.",
    "speaker" : "Andy",
    "timestamp" : "32:25-32:52"
  },
  {
    "text" : "No shit.",
    "speaker" : "Steve",
    "timestamp" : "32:52-32:53"
  },
  {
    "speaker" : "Andy",
    "text" : "The fourth longest run against the Page defense, which uh I wouldn't mind seeing again come back because I feel like the Pages run defense as of late has been suspect. Would you agree?",
    "timestamp" : "32:53-33:06"
  },
  {
    "timestamp" : "33:06-33:12",
    "speaker" : "Steve",
    "text" : "Yeah, that's where it all starts too, right? If you stop the run, then everything else you can kind of scheme around. If you stop the run, you're cooked."
  },
  {
    "text" : "I mean less so nowadays, because nobody's uh run first team, are they? Like they were back in the early 2000s.",
    "speaker" : "Andy",
    "timestamp" : "33:12-33:18"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "33:18-33:27",
    "text" : "Dude, I want to see Mac Jones run. He had the same 40 time as Patrick Mahomes. Really? I don't believe that. Steve Stat check that Stat check it, Steve."
  },
  {
    "timestamp" : "33:28-33:34",
    "text" : "I'm not the stat check guy. I am not you are now. You just cut off of work. You're still in work mode. Stat check it.",
    "speaker" : "Andy"
  },
  {
    "text" : "Damn. Absolutely not.",
    "timestamp" : "33:34-33:36",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "33:38-33:39",
    "text" : "Steve.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "33:40-33:45",
    "text" : "Useless. Why would the internet lie to me? I sa I unless I'm an idiot and I read it incorrectly."
  },
  {
    "text" : "Greg, have you never been on the internet before?",
    "timestamp" : "33:48-33:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, but why would you lie about something stupid like that, you know?",
    "timestamp" : "33:51-33:54"
  },
  {
    "timestamp" : "33:55-34:16",
    "text" : "Have you never been on the internet before? Have you not been following the uh the account of I believe it's Balsack Sports on Twitter who just posts um made up Quotes about basketball players and they they got covered by ESPN as if is it correct? Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "I mean that's ESPN for you though. Right.",
    "timestamp" : "34:17-34:19",
    "speaker" : "Greg"
  },
  {
    "text" : "So we we like to hold ourselves to a higher standard, Greg. So if you would fact check that for us, I don't want to be He's faster. He's faster?",
    "speaker" : "Andy",
    "timestamp" : "34:19-34:27"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. What's it Mahomes? Mahomes ran 4-8. Mac Jones ran a 4-6-7. Mac Jones ran a 4-6-7. But it says, dude, unofficial. I think that's from his pro day. No, we are going to be able to do that.",
    "timestamp" : "34:28-34:42"
  },
  {
    "text" : "472 and 468.",
    "speaker" : "Andy",
    "timestamp" : "34:43-34:45"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "34:45-34:47",
    "text" : "Brady was a 528."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:48-34:50",
    "text" : "Brady was slower than Wilfork, remember?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "34:51-34:53",
    "text" : "I need video this fucking 40."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh god. So what was Josh Allen's 40-yard dash? 476. So Josh Allen and Mac Jones have basically the same 40 yard dash.",
    "timestamp" : "34:55-35:06"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he watch a video that's like 30 seconds and you get a 30 second ad to watch it. It's like God damn it, dude. Oh yeah, Greg. Tell me how much you hate advertising. I can't wait for an commentators. They're gonna put advertisers to like turn my car on. You know, all those like subscription things. We could fucking give it to you for free if you just accept these ads shoved up your ass.",
    "timestamp" : "35:06-35:29"
  },
  {
    "text" : "Ooh, ad suppositories coming next.",
    "timestamp" : "35:31-35:34",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "35:37-35:50",
    "text" : "I I'll I'll admit it. I just watched it. It didn't look very athletic. But it was it it it was effective though. Yes, clearly fast, but And he kind of runs like with the chicken wing arms."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:52-36:07",
    "text" : "So he's awkwardly efficient. Awkwardly I don't know. What am I looking for? Can't argue with the results. Right. That's what I'm saying. That's how I play sports. Awkward as fuck, but uh it works in the end."
  },
  {
    "timestamp" : "36:07-36:30",
    "text" : "Saw the profile view, it looked pretty good. Oh, alright. Guy looks good in shorts, you know? I do. Mac Jones. Let's get him on the run. All right. Let's do it. Roll him out, put him on the move. I think yeah, this is a hot take, but I think the offense is gonna be better without McDaniels. I don't think that's much of a hot take.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "36:31-36:31",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh I don't know. McDaniels is like taking this team to the Super Bowl a bunch of times.",
    "timestamp" : "36:31-36:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Was it him or was it Brady?",
    "timestamp" : "36:37-36:38"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "36:39-36:43",
    "text" : "How did he do without Brady? Dude, so many times I've been frustrated by McDaniels."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, same. Third and long draw plays.",
    "timestamp" : "36:43-36:46"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, dude.",
    "timestamp" : "36:47-36:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Although having said that, they ran out in this game. Kevin Falk picked up the first down. No big deal. And be like a like a third and eight or something ridiculous. That was gonna be one of my best. Um But speaking of of people who shouldn't be running it, I would uh put Donic Rhodes in that category. He had one carry. I technically was a screen pass. One catch. Um Negative two yards and uh he basically gave the ball to Teddy Bruski, which I think is the play that you remember?",
    "timestamp" : "36:48-37:20"
  },
  {
    "text" : "That's unfair. He did not give the ball to Teddy Bruski. Teddy Bruski took the ball from him. He didn't stop Teddy Bruce from taking it. I don't think he had a choice. Teddy Brisky was taking that fucking ball.",
    "speaker" : "Steve",
    "timestamp" : "37:20-37:34"
  },
  {
    "timestamp" : "37:35-38:12",
    "speaker" : "Andy",
    "text" : "I mean Teddy Bruski asked nicely first, no? You don't think? Okay. He was rude, came out of nowhere. So give me that. I suppose he did. I would say. But uh yeah, I mean I think that's the The defining play. Like you remember la the two thousand three Colts game, playoff game with Ty Law's interceptions, right Um at least one of them. And I think this the the defining play of this game is Teddy Brusque ripping the ball out of Dominic Rhodes' hands Which I believe, Greg, wasn't that their their longest drive in in some fashion that ended in a fumble?"
  },
  {
    "text" : "Yeah, the longest amount of time they held the ball. Yeah. Yeah.",
    "timestamp" : "38:12-38:16",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "38:18-38:25",
    "speaker" : "Andy",
    "text" : "For a whole four minutes and forty-seven seconds before they fumbled it. But that it was they were like in New England territory, I think."
  },
  {
    "speaker" : "Steve",
    "text" : "Uh yeah, they're on the patriot's 39-yard line.",
    "timestamp" : "38:25-38:27"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. So They were driving to score and they just couldn't do it. And then also there was another fumble that he recovered. Bruske had himself a game in this, I thought. Kind of quietly. 'Cause he didn't do much outside of the two fumble recoveries and one was I think it was Rodney Harrison stripped Marvin Harrison. Um they they tried a screen pass which And the wildcard game worked for like a 40-yard touchdown, like one of those wide receiver screens that Harrison took to the house. Try it again. You got picked up like 10-15 yards, but then Met the other Harrison and popped the ball out. Brewski just fell on it. But I don't know if you also noticed he Bruce also opened the second half with a nice kick return to the 45. When the Colts were kicking it in the wind. So that was pretty dope. So MVP of this game? Teddy Bruski.",
    "timestamp" : "38:27-39:20"
  },
  {
    "speaker" : "Greg",
    "text" : "Corey Dillon. Corey. Yeah.",
    "timestamp" : "39:22-39:26"
  },
  {
    "timestamp" : "39:26-39:32",
    "text" : "Boys just don't think outside the box every yeah. You learn a new nickname.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "39:32-39:34",
    "speaker" : "Steve",
    "text" : "Yeah, if you get a nickname in a game, you gotta be MVP."
  },
  {
    "text" : "Yeah, that's fair. All right.",
    "timestamp" : "39:34-39:35",
    "speaker" : "Andy"
  },
  {
    "text" : "Certainly wasn't the MVP.",
    "timestamp" : "39:36-39:37",
    "speaker" : "Steve"
  },
  {
    "text" : "No, that was that was Manning. And this was also, uh, I realized towards the end of the game that this was uh the Peyton Manning, uh commercial Peyton Manning. Uh, because there was a cut that meat sign. And I believe it was also a chant. Oh, is that old? Yeah.",
    "speaker" : "Andy",
    "timestamp" : "39:37-39:53"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "39:54-39:57",
    "text" : "Oh, I thought it was way later in his career. No, no, no."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:57-40:26",
    "text" : "Accord or I mean according to I think it was in the Boston Globe articles. There was something about uh the cut that meat. chant, which I didn't I didn't I didn't pick up in the when I was listening to the game, but um I definitely saw a sign that said cut that meat. There was also a couple other signs. Um one that was MVP, but it stood for make vacation plans, which was pretty clever. That is nice. That's not bad. Um there was also Greg, I think you might like this one, uh, Vandershank, open foot, open mouth insert foot."
  },
  {
    "text" : "Stupid.",
    "speaker" : "Greg",
    "timestamp" : "40:28-40:28"
  },
  {
    "timestamp" : "40:30-40:33",
    "speaker" : "Andy",
    "text" : "Well, what was your name for him before we started?"
  },
  {
    "speaker" : "Greg",
    "text" : "Nothing.",
    "timestamp" : "40:33-40:34"
  },
  {
    "text" : "Oh now you're all shy? Alright. Now he decides to censor himself. Three years into the podcast.",
    "speaker" : "Andy",
    "timestamp" : "40:36-40:42"
  },
  {
    "text" : "Mom, earmuffs. Mike Vander jerked me off.",
    "speaker" : "Greg",
    "timestamp" : "40:42-40:48"
  },
  {
    "speaker" : "Mom",
    "text" : "Very naughty. Sometimes a naughty boy.",
    "timestamp" : "40:50-40:54"
  },
  {
    "text" : "Oh, Gregory. Can't take you anywhere. You just. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "40:54-40:58"
  },
  {
    "speaker" : "Greg",
    "text" : "Tommy Longcock. That's right, yeah. James Mungrow, there's another good name. The second, no no less. The second? James Mungro the second.",
    "timestamp" : "40:59-41:12"
  },
  {
    "text" : "So he's not a junior, he's a second. Yeah, we looked this up. Yeah, with um Garden Minshew, because he's a second.",
    "timestamp" : "41:12-41:19",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. It's whether it's Juniors if it's your father's name, second is if it's your grandfather. That's right. Yeah. But your father isn't that same name.",
    "timestamp" : "41:19-41:28",
    "speaker" : "Greg"
  },
  {
    "text" : "Correct.",
    "speaker" : "Andy",
    "timestamp" : "41:28-41:29"
  },
  {
    "text" : "Yeah. Right.",
    "speaker" : "Greg",
    "timestamp" : "41:29-41:29"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "41:30-41:30"
  },
  {
    "speaker" : "Greg",
    "text" : "You want to take a are we done with the game? We could take a around the league wrap-up. I got a lot of notes.",
    "timestamp" : "41:30-41:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay, yeah. I mean I think Steve, do you have any other notes on the game you didn't watch?",
    "timestamp" : "41:36-41:40"
  },
  {
    "text" : "I got some best and worst, but nothing All right. We can go to the recap.",
    "timestamp" : "41:41-41:45",
    "speaker" : "Steve"
  },
  {
    "text" : "All right, great. Give me s give me some around the league. What was going on 2004, January 2000? January 2005, technically.",
    "timestamp" : "41:45-41:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, so I mean this is obvious divisional pets how to buy, right? Right. Yeah. Right. Yeah. So the the one notable wildcard game that I that I found was the Vikings Packers. Randy Moss mooning this year.",
    "timestamp" : "41:52-42:09"
  },
  {
    "text" : "I love that.",
    "speaker" : "Steve",
    "timestamp" : "42:10-42:11"
  },
  {
    "speaker" : "Greg",
    "text" : "Which turned out to be one of I think it was Moss's last touchdown as a Viking, if I remember correctly. Oh damn. Yeah. Also in that game, you guys with the announcer of that game that was just disgusted by it. Yeah. Yeah, Joe Buck said, um It was a disgusting act which has gone down an infamy. Actually, and I looked up a bunch of like articles around that time and It was actually Joe Buck that was getting the majority of the hate rather than Randy Moss. Like I thought there'd be like randy people pissed at Randy, but no one really was.",
    "timestamp" : "42:11-42:46"
  },
  {
    "timestamp" : "42:46-43:03",
    "speaker" : "Andy",
    "text" : "I bet the if Twitter was around at that point they would have been. But you know, you're right. I think because The the whole thing was that um in Green Bay, the fans would moon the player the opposing players as they came and went. So this was him kind of like Yeah, he was kind of giving it back to him."
  },
  {
    "speaker" : "Greg",
    "text" : "What a sweet football. Well his quote after the game was He was just having a little fun with the boys. Yeah. It was the most rainy mod shit ever.",
    "timestamp" : "43:04-43:13"
  },
  {
    "text" : "And Greg, you are correct. Uh this is his last season in Minnesota. You get trained to Oakland in 2005.",
    "timestamp" : "43:14-43:20",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "43:20-43:56",
    "speaker" : "Greg",
    "text" : "So I think it's his last touchdown as uh as a Viking. Lose the next week. That's the way to go out, isn't it? Dude, so but there was an overreaction of people waiting on Buck, the Vikings owner. So Buck had the the Vikings game in the division around. And he wanted them to remove Buck for quote, a prejudice that surpassed objective reporting. like dear Jesus get fucked dude i just had a gut reaction watching this fucking play and you're over here fucking prejudice Surpassing objective reporting."
  },
  {
    "text" : "Like, dude, you kidding me? That's a dude who's never listened to Boston sports talk. Right. Yeah.",
    "timestamp" : "43:56-44:02",
    "speaker" : "Steve"
  },
  {
    "text" : "That's a Bill Poley move right there. That's what that is.",
    "timestamp" : "44:02-44:04",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Um I saw an interview with Joe Buck too. He seems pretty like self-aware of it. He's like, listen, I called it, you know, it was one of those things that happens in the moment. I didn't know the context, yada yada. Yeah. But you know how Moss does the come on man segment? Yeah. Yeah. Apparently there was a play uh recently where someone was tackling Joe Burrow and they like. Tackle him by the pants and it like pulled his pants down and ready moffs was like that's a disgusting act.",
    "timestamp" : "44:04-44:33"
  },
  {
    "speaker" : "Andy",
    "text" : "Amazing.",
    "timestamp" : "44:36-44:36"
  },
  {
    "text" : "So that also shows. Like Buck Buck said that like Randy Moss has been super chill about it. Like never got mad once. Like next time he gapped him up, he's like, well, I don't care.",
    "timestamp" : "44:37-44:46",
    "speaker" : "Greg"
  },
  {
    "text" : "It's Randy Moss. That's how he is. Yeah, I think he's one of the more uh most misunderstood players in the league, Randy Moss.",
    "timestamp" : "44:46-44:54",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I think now people kind of come around on him. I think at the time probably. Oh, for sure. Yeah. But now he's like on Sunday night countdown, people kind of get it. Not anymore, I don't think, but yes. What?",
    "timestamp" : "44:54-45:05"
  },
  {
    "timestamp" : "45:05-45:07",
    "speaker" : "Andy",
    "text" : "I don't think his contract was removed this year."
  },
  {
    "text" : "Oh, he's off.",
    "timestamp" : "45:07-45:08",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "45:08-45:08"
  },
  {
    "text" : "I bet. Let's get him on the pod. Yeah. Yup. All right, so that was the only that was the only wildcard game that I thought had any note. So the um other than the Colts one. Yeah. Oh, one other note from that game that you guys would probably like. Five through four interceptions. Shocking. Dude, he had this one fucking touchdown. He's like It's like they're at like the 10-yard line. He's like rolling out and he's like running out of space to throw it. And he literally does this no-look like underhand shovel pass across his body. That like just lands in this dude's lap. It was the most ridiculous, awesome play from VARV, but he'd already crossed the line of scrimmage. By like three or four yards. Not like he steps. He's the fucking man. He's a fucking tool. And they he almost brought him back. Even after throwing four picks.",
    "timestamp" : "45:08-46:06",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:06-46:19",
    "text" : "But of course. Four interceptions is too tough to overcome. So I I think that's one of the uh did you see one of the the um the records that will never be broken is Brett Favre's inception record."
  },
  {
    "text" : "Yeah, yeah, we talked about that. No one will ever break that. Yeah Overall turnover record because he had a fuck ton of fumbles.",
    "speaker" : "Greg",
    "timestamp" : "46:19-46:25"
  },
  {
    "speaker" : "Andy",
    "text" : "As you do.",
    "timestamp" : "46:35-46:36"
  },
  {
    "timestamp" : "46:36-47:03",
    "speaker" : "Greg",
    "text" : "Yeah. Um, so then the the Eagles would get a bye, right? They played the Vikings in the next round. Eagles win. The only thing I note there was Fred X, Freddie Mitchell has caught two touchdowns. And when he caught his first one, he did the pulling the pants up. Yeah. Celebration, which fair play. That's fucking funny. Not too bad. Not too bad. Yeah, pretty funny. So yeah, 27-14, Eagles won at home."
  },
  {
    "speaker" : "Andy",
    "text" : "And I think speaking of the Eagles, I believe when we were talking about The uh Steelers and how they how much of a wagon they were. Uh they beat the only two undefeated teams in the league back-to-back weeks. It was the Patriots and the Eagles. The only two remaining undefeated teams, and the Steelers just stomped them both.",
    "timestamp" : "47:04-47:24"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:24-47:29",
    "text" : "Yeah. Eagles going into their fourth straight NFC title game."
  },
  {
    "timestamp" : "47:29-47:35",
    "speaker" : "Andy",
    "text" : "Yeah. Based on that win. So the uh the Buffalo Bill style thing. Because they hadn't won one yet. They had lost all three."
  },
  {
    "timestamp" : "47:35-47:50",
    "speaker" : "Greg",
    "text" : "Yep. And they will be playing the Michael Vick Atlanta Falcons. Oh damn. This is also, I believe, Vic's last year till the incident Oh really? Yes."
  },
  {
    "timestamp" : "47:50-48:12",
    "speaker" : "Andy",
    "text" : "What incident was that, Craig? Uh it actually was not. Um he played 2005, 2006, and then according to profootball. Maybe it's 2007, 2008. Missseason violation of league personal conduct policy. It was The nicest way you can put that. Fuck me. Roger Godell dog died."
  },
  {
    "text" : "Who did they who did Vic beat?",
    "speaker" : "Steve",
    "timestamp" : "48:13-48:15"
  },
  {
    "timestamp" : "48:15-49:09",
    "speaker" : "Greg",
    "text" : "They beat the Rams to the end of the greatest show on turf, the Bulgers. The Bulger Rams, yeah. Yeah. So they just fucking they stomped him went crazy running on them. Yeah. It was these are the first half records that they sent that game. They had 239 rushing yards. Oh just in the first half. Oh Done uh work done had 126 rushing yards in the first half. Um they finished with 327. Vic had one nineteen. Yep. Um and then Vic set the the record for the longest playoff run by a Falcon with forty-seven in the first half and then Dunn broke that record in the second half with a sixty-two yard. Yeah. Jesus. So yeah, 47 17 without barely even throwing the ball. And they they kicked the shit out of him. I think they had like a Seventy passing yards."
  },
  {
    "timestamp" : "49:10-49:12",
    "speaker" : "Andy",
    "text" : "They have 70 passing yards and one."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh my god.",
    "timestamp" : "49:12-49:13"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "49:13-49:24",
    "text" : "4717. It might be worth looking at the highlights just to remember how awesome Vic was too because he's Still, I think I think he's more athletic than Lamar Jackson."
  },
  {
    "timestamp" : "49:25-49:44",
    "text" : "Michael Vick was the best video game character of all time in Madden 2004. Like you weren't allowed to play him if you were playing a friend or somebody. Like you couldn't you couldn't pick the Falcons because it was cheating. Because he was so overpowered. He was pretty sweet. Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "And a absolute cannon of an arm too. Oh yeah, he would just flick the ball. Uh-huh.",
    "timestamp" : "49:44-49:50"
  },
  {
    "text" : "Which I I think yeah, Lamar Jackson kind of similar.",
    "timestamp" : "49:51-49:53",
    "speaker" : "Andy"
  },
  {
    "text" : "He doesn't look like he puts much effort into it. I think Vic is A little better. Like I I think running the ball.",
    "timestamp" : "49:53-50:00",
    "speaker" : "Greg"
  },
  {
    "text" : "Lamar Jackson is a better thrower of a football.",
    "timestamp" : "50:01-50:03",
    "speaker" : "Andy"
  },
  {
    "text" : "Maybe.",
    "speaker" : "Greg",
    "timestamp" : "50:03-50:04"
  },
  {
    "timestamp" : "50:05-50:05",
    "text" : "I think.",
    "speaker" : "Andy"
  },
  {
    "text" : "You gotta you gotta think about era too, right? They're playing against 2004 guys who are wearing gigantic shoulder pads. Lamar's doing it against super athletic. Sideline to sideline linebackers.",
    "timestamp" : "50:06-50:18",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's a good point.",
    "timestamp" : "50:18-50:19"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, maybe we'll get into that thing at some point and go down the whole Vic rabbit hole because it's definitely an interesting story. Like how he grew up and how that all all that stuff ended up going down was Yeah. There's some weird shit about him getting like In trouble too. That was super shady about like he didn't actually do very much wrong.",
    "timestamp" : "50:19-50:39"
  },
  {
    "timestamp" : "50:39-50:40",
    "text" : "Oh, interesting.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "50:40-51:21",
    "speaker" : "Greg",
    "text" : "Yeah. Yeah, but he was the name, right? Yeah. Yeah. So yeah, so it's gonna be Falcons, Eagles, and the NFC Championship, the AFC Championship. Steve, you're gonna love this. The fucking Steelers, Jets, the Steelers win 20 to 17. In overtime. Yes. The Jets had the the ball with two minutes left kicking a field goal. Uh doinked it. From 47 yards. Big Ben throws a pick on the very next drive. They get in uh range again and then pushed one uh wide left from 43 yards. So they missed two game-winning field goals in the last two minutes. And then promptly lost immediately in overtime."
  },
  {
    "timestamp" : "51:21-51:23",
    "speaker" : "Steve",
    "text" : "I love you right. I do love that. Yeah."
  },
  {
    "timestamp" : "51:23-51:34",
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. So Steelers, Patriots. Two best teams in the uh AFC meeting in Pittsburgh, right? Oh yeah, they are correct."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "51:34-51:34",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:36-51:37",
    "text" : "Rookie Big Ben.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "51:37-52:06",
    "speaker" : "Andy",
    "text" : "Yeah. And the Steelers have fifteen consecutive wins coming in this game. Their last home loss was in two thousand three. Which is fucking forever ago because we're in 2000 January 2005 at this point. Um they are first in the NFL in total defense with the fewest points allowed. And they are second in the NFL in rush offense, which is even with Ben Rothesberger, he is not the the main attraction, the main drama."
  },
  {
    "text" : "I can't wait to watch Troy Palomalu. He's one of the forgotten awesome players.",
    "timestamp" : "52:07-52:13",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "52:13-52:14",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "52:14-52:18",
    "text" : "Like generation defining players that people don't talk about enough. You think he's forgotten?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "52:19-52:21",
    "speaker" : "Andy",
    "text" : "I don't think so. I see highlights of him all the time. Do you?"
  },
  {
    "text" : "I felt like him and Bob Sanders were very similar. Yeah, Bob Sanders people don't talk about either. Well Bob Sanders like Ed Reed, you know, fucking Sean Taylor. What about my boy Troy? Troy Brown?",
    "timestamp" : "52:22-52:37",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "52:38-52:41",
    "speaker" : "Andy",
    "text" : "No. Yes. Troy Brown. Speaking of Troy Brown, it's getting best and worse."
  },
  {
    "timestamp" : "52:42-52:49",
    "speaker" : "Steve",
    "text" : "Yeah. Steve, you want to go first? Yeah, a lot of Troy Brown bests. Should I just go right into those? Yeah, let's do right into those."
  },
  {
    "speaker" : "Greg",
    "text" : "Just go right into them, Steve. Just do what feels right.",
    "timestamp" : "52:50-52:52"
  },
  {
    "timestamp" : "52:52-53:01",
    "speaker" : "Steve",
    "text" : "Yeah, I just like I don't know what's going on with the Pro football reference page that doesn't have all the defensive stats for the Patriots."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah. Indianapolis, right?",
    "timestamp" : "53:02-53:07"
  },
  {
    "text" : "Yeah, it's all the India. It's only three players.",
    "timestamp" : "53:07-53:09",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, it's only got three players? What the hell is going on here? I don't know. Triple Tri played a fucking great game. Dude, this is the most picking up. This is the first time I've ever seen pro football reference be missing something. Yeah, same.",
    "timestamp" : "53:09-53:20"
  },
  {
    "timestamp" : "53:21-53:49",
    "speaker" : "Steve",
    "text" : "We use this shit religiously. Wow. But Triple had a great game because Peyton was picking on him. As he should, right? The Patriots secondary is absolute Bunch of scrubs and a wide receiver playing cornerback. And he's got Brandon Stokely, thousand yards. He was a great slot receiver, might be the best in the NFL against Troy Brown. And he was deaf again B a little bit, but then Troyfa can dattle back, had some sick third down stops. Had a ball or punt return"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that was sweet.",
    "timestamp" : "53:49-53:50"
  },
  {
    "timestamp" : "53:50-53:51",
    "text" : "Yep.",
    "speaker" : "Steve"
  },
  {
    "text" : "When he had like he he knocked that pass down, then returned the kick. Yep. And then he was out there on offense in the next play. It's like, God damn, dude. How old is this dude? Yeah. This is like peak Troy Brown just playing all phases of the game. It was sick. It's like not peak Troy Brown, but it is in some ways too. Like certainly not, yeah, it's not like his how good he was, but just how versatile he was.",
    "speaker" : "Greg",
    "timestamp" : "53:51-54:15"
  },
  {
    "timestamp" : "54:16-54:21",
    "speaker" : "Andy",
    "text" : "Yeah, he was it's like pro how it's prototypical Troy Brown. Peak prototype Troy Brown."
  },
  {
    "speaker" : "Greg",
    "text" : "Which I guess you could call peak Troy Brown because that's what made him good is",
    "timestamp" : "54:21-54:25"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "54:26-54:47",
    "text" : "Well, we were talking to Kevin Falk about his ability to like return kicks and how he's like the leading yard. He's like, my only job, well there was just Secure the ball, right? Yeah. Play often to get your most important guy out there. So it's Troy Brown. Like, hey Troy, I know you're playing offense and defense, but like we really can't afford a fumble on a kick return. It's gonna blow this game open. So get out there, buddy."
  },
  {
    "text" : "Yeah, that was that was gonna be my best was like there was literally one long highlight of Troy Brown break up the pass on third down. And then as they're like, you know, they're talking about it, they're watching him, and you can see him running back to go get the punt, which he does, and then he returns the punt. And then he just like stands there on the field and waits for the offense to come to. And then he's out there as a slot receiver. Yeah. Like, damn, Dude just doesn't take a break. Mm-hmm. Love to know how many plays he actually played. Yeah, it's not Pop Warner.",
    "speaker" : "Andy",
    "timestamp" : "54:49-55:16"
  },
  {
    "text" : "This is fucking NFL division playoff game.",
    "timestamp" : "55:16-55:19",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, and this isn't like the 1930s where you're playing against, you know, like mechanics and stuff, and this is your your side job.",
    "timestamp" : "55:19-55:25",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "55:25-55:49",
    "text" : "Where guys can play both sides, but I think this is it's gotta be it it's gotta be kind of obnoxious to be like uh like a practice squad cornerback And Troy Brown like picks it up in the middle of a season is like better than you, and you're like, damn it, dude. I've spent my entire life dedicating myself to this craft, and this fucking asshole just picks it up halfway through.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I would agree with you if the Pagers actually had any practice squad cornerbacks left. I think they were starting them all. I guess where Randall gets. Or you're a street free agent. Like, dude, it's I can do that. Just give me the give me a spot.",
    "timestamp" : "55:49-56:04"
  },
  {
    "speaker" : "Greg",
    "text" : "And then you watch and you're probably like, God, no, he was pretty good.",
    "timestamp" : "56:04-56:07"
  },
  {
    "timestamp" : "56:07-56:13",
    "speaker" : "Andy",
    "text" : "Yeah. So he's he's second on the team in interceptions, he kind of knows what he's doing. He's a slot receiver."
  },
  {
    "speaker" : "Steve",
    "text" : "He also plays the first six plays of the game, including a three and out by the Colts, the kick return, the first two Patriots games, the first two offensive snaps. He's just like, all right, try just get out there. I think on this game he has T Brown on his jersey though. Uh did he? Yeah. Interesting. Is there another brown? I I don't I like Can never remember Troy Brown ever having T Brown on his jersey.",
    "timestamp" : "56:13-56:43"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:43-56:47",
    "text" : "I'm trying to think if there's another Brown on defense maybe that we've missed. But they're not sure."
  },
  {
    "timestamp" : "56:47-56:54",
    "text" : "But like why would it be just this playoff game? They must have signed somebody for just the playoff. It seems crazy because he hasn't had it all year.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Maybe they're like special jerseys because it's the playoffs and they have like patches.",
    "timestamp" : "56:55-56:58"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know. So the game is either way. Now I want a T Brown jersey. God damn right. She had T Brown, baby. Yeah, 2004. T Brown. Get the Super Bowl patch on it or something.",
    "timestamp" : "56:58-57:08"
  },
  {
    "timestamp" : "57:08-57:16",
    "speaker" : "Andy",
    "text" : "Did you know? Here's a fun fact. Troy Brown for one year was number 86. When? Yeah, he was not always Ember 80."
  },
  {
    "speaker" : "Steve",
    "text" : "No way. What like when he first started or what?",
    "timestamp" : "57:16-57:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:18-57:21",
    "text" : "Yeah, it was like it was like his second year in the NFL."
  },
  {
    "text" : "So who knew? I was a little upset button there bitching about his they said, oh he he fair caught it. He didn't That's such bullshit. Oh yeah. On the punt return. Yeah. He never got it above his head. You gotta get it above your head. And he's like he started his close. I'm gonna get it. You didn't even get above his shoulder.",
    "speaker" : "Steve",
    "timestamp" : "57:22-57:40"
  },
  {
    "timestamp" : "57:41-58:27",
    "text" : "It's fucking Tony Denji. Although I I want to give you this is kind of my best and worst. Um it's all in one. It's topical. Tony Dungey. Uh We've talked a lot about the pages doing the direct strap snap to Kevin Falk and how they've like mastered that play. And we talked with Kevin Falk about it. But the the Colts tried to do it in this game and they got called for a false start because Manning lined up under center and then moved away. And because he lined up under center. uh you're not allowed to basically go in motion from under center for I don't know it's some arcane rule that whoever the commentator was like knew immediately which shocked me because it's fucking football commentators still have it. Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I have some other kudos for the commentators too. Andy, you want it you want me to share those with you? Uh yeah, because I have one too, believe it or not. So you go first. Wow. Give me uh Phil was pointing out Patrick Pass's great block on the punt return by Troy. And uh, you know, that's great. I didn't even see the first time. Went back and watched it, and I was like, wow, that's that's a great Great. And then they're like talking about how good the field is, and then immediately Corey Dillon rifts off that big run.",
    "timestamp" : "58:28-58:55"
  },
  {
    "text" : "Yeah. They also had that highlight package of um how great of a blocker uh Daniel Graham was. They're showing like all the like the complicated blocks that he was having to do. Like he had to go pick up the the weak side middle linebacker on one play so that um Kevin Falk could make the cutback on the drop lines, like shit like that.",
    "timestamp" : "58:55-59:16",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And then I found it interesting where Phil was like outraged about a hit. And I was like, I think it was the first time I've seen a commentator be like, oh my God, look at that hit. What a When it's like those ones that were previously celebrated as on Brandon Stokely from I think Eugene Wilson, you know. Samuels, yeah.",
    "timestamp" : "59:16-59:33"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "59:33-59:40",
    "text" : "Yeah, Samuel's anti. That's my best. Was that it? Yeah, fucking decapitated him. It was sick."
  },
  {
    "timestamp" : "59:41-59:44",
    "speaker" : "Steve",
    "text" : "Phil Phil disagreed with you"
  },
  {
    "timestamp" : "59:44-59:56",
    "text" : "Well, you can get fucked, dude. It's a man's sport. Maybe Shafi'll go play like fucking golf or tennis or something. He's doing his best Eugene Wilson impersonation.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Uh uh Samuel had some some comments uh after the game about that hit. Okay. Um let's see Quote, I was hoping the flags wouldn't come out, said Samuel, who knew how his hit might have been interpreted by the officials in yesterday's twenty to three playoff win over the Colts. Hopefully I won't get a FedEx letter on Wednesday. Uh notifying him of a league imposed fine. I mean, I think I got a lot of shoulder on him. I didn't leave with my helmet. Odds odds on the fact that he had a FedEx letter in his locker the next day? I'm a goal. I don't know. I don't know if he did or not, but I have to imagine he did because that I was like textbook, helmet to helmet. It was brutal. And then",
    "timestamp" : "59:56-01:00:39"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:40-01:01:23",
    "text" : "Oh, really smart timeout by Belichick, you know, and saved uh a guy being wide open. Oh yep. Smartly called a timeout to save a wide open, you know. He saw the confusion on defense and what a heads up. coaching play to genius maybe time out there. Yeah. Yeah. Yeah. Yeah. Uh and then my negative, probably my actually one more fun fact, two fun facts. There was a week three bye for us. Seems fucking crazy. Super stay and age, right? Right. At this point they've been playing football for like three, four months straight. And the Patriots went from 27th in rushing to seventh just by adding Corey Dillon."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's all it took. That's pretty good. Yeah, that's that's not a bad uh not a bad stat. I'll give you some more fun stats if you want. Yes real quick. Hit them with hit me with them. Um This is where they showed up with uh a minute 23 left in the first half. The last first half shutout of the Indianapolis Colts 2003 in the AFC Championship game at New England. They would eventually kick a field goal here, so they would they would just escape. But um Also, another Peyton Manning stat for you. In 2004 regular season, Peyton Manning had 68 20 plus yard completions. 68. The week before in against Denver, he had 11. Cool. In this game?",
    "timestamp" : "01:01:23-01:02:10"
  },
  {
    "text" : "He didn't even break like 18 yards.",
    "timestamp" : "01:02:12-01:02:13",
    "speaker" : "Steve"
  },
  {
    "text" : "18 yards. Not too bad. And also the Colts postseason turnovers, last one here. Um in 2002, last two years, uh the postseason turnovers Colts have had. Versus any other team in three games, they had two. Versus the Patriots in two games, eight turnovers. They just cannot solve the genius that is Bill Belichick's defense. Would you agree, Greg?",
    "speaker" : "Andy",
    "timestamp" : "01:02:14-01:02:40"
  },
  {
    "text" : "No, I think it's snow. And Tylaw. There is no Tyler in this game. Well, Sante Samuel played pretty well, I thought. How do you know you don't talk about some dude's head off?",
    "timestamp" : "01:02:40-01:02:54",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:02:55-01:02:56",
    "text" : "That's all that matters.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:02:56-01:02:58",
    "text" : "Eugene Wilson played well too."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:02:59-01:03:11",
    "text" : "Who didn't play well is my biggest negative is the fucking punter, dude, Josh Miller. Who gives a shit? Two touchbacks, his first two punts, and then Punting from the 43 gets only 29 yards."
  },
  {
    "speaker" : "Greg",
    "text" : "Dude. Fucking punter, Steve.",
    "timestamp" : "01:03:11-01:03:15"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:03:15-01:03:17",
    "text" : "Greg, you know who cares? Belichick cares about that."
  },
  {
    "speaker" : "Greg",
    "text" : "That's exactly right. Yeah. That's why he's never gonna win in this league. Oh good Lord.",
    "timestamp" : "01:03:18-01:03:26"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:28-01:03:30",
    "text" : "Uh Greg, you got any best and worse for us?"
  },
  {
    "timestamp" : "01:03:30-01:04:26",
    "speaker" : "Greg",
    "text" : "Um my worst has probably got to be the feeling of like Colts fans after this game of You have you're like, oh fuck. Do we have Dan Marino? You know, like well, you just broke Dan Marino's touchdown record. He's putting up these like this was the fifth at the time the fifth ranked offense in NFL history And he goes in and puts up another stinker after doing it last year. And he's fucking 0-7 in Foxboro, right? He's like. They've lost what six straight cause lost six straight to New England and nine straight in Fox Barrow. So you gotta be like, Jesus. Is this what is this what we have? Like, is this and They kind of did. You know, I mean they did they do win that one, but to some degree he is like a regular season hero that yeah could never quite get over that hump in the playoffs."
  },
  {
    "timestamp" : "01:04:26-01:04:34",
    "speaker" : "Andy",
    "text" : "Doesn't he have the most ever one and done's in the playoffs? Had it any quarterback? Yeah, I believe so. I believe so. But it's a lot."
  },
  {
    "text" : "Yeah. But yeah, I mean, that's gotta be a tough realization to come to because at this point point he's what what six years in the league something like that you're probably like all right we kind of know we have he's not gonna like he's he's already basically peaked as what a regular season quarterback we know he can be So now all it comes down to is can you win these big games and win Super Bowls and like build on a legacy, which the answer so far is uh resounding no. Resounding no. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:04:34-01:05:01"
  },
  {
    "text" : "Not if Tom Brady's still playing. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:05:01-01:05:03"
  },
  {
    "text" : "Or so now Bill Belichick is a good idea.",
    "timestamp" : "01:05:04-01:05:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:07-01:05:09",
    "speaker" : "Steve",
    "text" : "Yeah, and not a BB is still coaching."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:09-01:05:23",
    "text" : "Right. Well let's let's let's go into it. Bill Belichick's more genius in this game. Um Messing with Satan Manning's head with how many down linemen he played. Um there was certain situations."
  },
  {
    "timestamp" : "01:05:24-01:05:29",
    "text" : "Let's not pretend that fucking uh Manning hasn't seen this shit before He's seen zero Don Lyon.",
    "speaker" : "Greg"
  },
  {
    "text" : "Guaranteed he hasn't.",
    "timestamp" : "01:05:30-01:05:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I bet he has. That just came out. That just started this year. Or if he like, do you think that's why Manning was sucking dick? You know? Yep. They threw an inception on that draft.",
    "timestamp" : "01:05:30-01:05:40"
  },
  {
    "text" : "It was in his head.",
    "speaker" : "Steve",
    "timestamp" : "01:05:40-01:05:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:42-01:05:42",
    "text" : "Yeah."
  },
  {
    "text" : "I think it's the players on the field. I think it's Harrison. I think it's Law. I think it's guys like that that just make plays. And the calls for dropping a ton of passes. Like even that first drive, they're like three drops and it's like, okay, these guys aren't these guys don't have the mental like fortitude to get through this game. Yeah, because Bella checks in their head.",
    "timestamp" : "01:05:43-01:06:04",
    "speaker" : "Greg"
  },
  {
    "text" : "Steve, did you know that Greg was a Colts fan? Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:06:05-01:06:07"
  },
  {
    "speaker" : "Greg",
    "text" : "But if they don't cover the field, if they cover the field, it'd be better. I'm shitting on Manny and you guys are trying to blow Belichick. Did you see there's nobody down on the line? It must have been so confusing for this guy who's a fucking Hall of Famer. Yeah, you can confirm. Fucking Peyton Manny. He's like the most cerebral quarterback that's ever lived. Wow. Yeah, he just choked some big games.",
    "timestamp" : "01:06:10-01:06:35"
  },
  {
    "text" : "That's all. A quote from Tony Dungey. Quote, you know, I pride myself in knowing the rule rules, said coach Colt's coach, Tony Dungey. That rule I didn't know. What they say is once you go under center, if you move away from the center, you have to be set for a second. A fairly obscure rule, but it's in there somewhere, I guess. You know who knows that rule, Greg?",
    "timestamp" : "01:06:35-01:06:54",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:06:55-01:07:08",
    "speaker" : "Greg",
    "text" : "Oh, sick, dude. That was the turning point of the game, man. He was at five-yard penalty. Hey, it worked. Actually, you you can't. You Belcheck butt boys, dude. That's how I'm gonna start calling you guys Bell check butt boys because it it's it's incredible."
  },
  {
    "speaker" : "Andy",
    "text" : "You want you want to hear so some penalties that did affect the game on that last uh scoring drive for the Patriots? Two defensive holding penalties called on the Colts. Whose fault was that?",
    "timestamp" : "01:07:09-01:07:19"
  },
  {
    "timestamp" : "01:07:19-01:07:22",
    "speaker" : "Greg",
    "text" : "The players for it both Lipolian."
  },
  {
    "text" : "Yeah. Why? Because he's the one that got that rule instituted And now I came back to bite him on that last 94, 96 yard drive, whatever it was.",
    "timestamp" : "01:07:23-01:07:32",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07:32-01:07:34",
    "speaker" : "Greg",
    "text" : "Oh, Andy's spin zone, dude."
  },
  {
    "speaker" : "Steve",
    "text" : "I love how triggered Greg is right now. This is the best.",
    "timestamp" : "01:07:35-01:07:38"
  },
  {
    "text" : "Dude, it's like watching like fucking CNN or Fox News.",
    "speaker" : "Greg",
    "timestamp" : "01:07:38-01:07:41"
  },
  {
    "text" : "But that will do little to help man and cope with another thing.",
    "speaker" : "Andy",
    "timestamp" : "01:07:42-01:07:44"
  },
  {
    "timestamp" : "01:07:45-01:07:51",
    "speaker" : "Steve",
    "text" : "That's what I feel like I'm doing when I watch you guys. That will do better."
  },
  {
    "text" : "I can talk at the same time and then talk over Greg. What anybody's saying, but if I just talk the loudest, then people think I'm fucking right. Wrong. Wrong. Greg's wife is a dog. Wrong. You got a dog wife, Greg. Dog wife.",
    "speaker" : "Greg",
    "timestamp" : "01:07:52-01:08:09"
  },
  {
    "timestamp" : "01:08:09-01:08:10",
    "text" : "Steve.",
    "speaker" : "Andy"
  },
  {
    "text" : "And your mom's is oh yeah, killer, Greg. Yeah.",
    "timestamp" : "01:08:10-01:08:13",
    "speaker" : "Greg"
  },
  {
    "text" : "But that'll do little to help Manning cope with another clunker. He is a visible superstar who is a developing a reputation as a guy who can't get it done when it matters. The only time I think about my history is when I walk into this interview room, said Manning. It's a lot of the same song as last year. I hope we could talk about something different, like a win. There's a lot of pressure to see signs all week with my name on it. It's my name versus the Patriots. I never play that way or feel that way. I knew it was the Colts versus the Patriots, but I wanted to do my job and I didn't do that well today. He didn't. God damn I didn't.",
    "speaker" : "Andy",
    "timestamp" : "01:08:14-01:08:45"
  },
  {
    "text" : "Gotta suck to be a fucking Colts fan, I tell ya. Oh yeah. You just get so excited every year like crescendo is in this like, oh, here's our chance. We're gonna do it this year and then just fucking get your shit pushed in in the snow like two years in a row and your fucking your stud quarterback just crass his pants on live television. Oh, here's here's some more uh aftermath, Greg. Yeah, that's depressing.",
    "speaker" : "Greg",
    "timestamp" : "01:08:45-01:09:16"
  },
  {
    "timestamp" : "01:09:16-01:09:46",
    "speaker" : "Andy",
    "text" : "Greg, this is for you. You'll like this. Gumble, Dan Reno, Boomer's Eisen, I'll pick the Patriots to win with Shannon Sharp going for the Colts. After the game, as I said, Manning might be, quote, this generation's Dan Marino, a great football player, but he's not going to get to a Super Bowl, like you said. At which point Marino interjected, Hey, I got to a Super Bowl and a siason finished. Not with that defense. You know what I mean. There's too much pressure on him to be perfect every week, just like you, Marino, had to be. It was a discussion that seemed guaranteed to be continued once the studio lights went off."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I mean it sucks. And there's a difference between there's a difference between like your team losing and you playing well and your team losing and like You playing terrible. Like when the Pats beat the Chiefs and Mahomes like had that really good game. You're like, at least Chiefs fans can go home being like, we got a guy. You know? He put his nuts on the table, he played his dick off, he just lost to a better team. But these games are so like must be so disheartening. To be a fan of the team because you're like, what happened to him? Like I watched this guy for like 17 games and he was he's unstoppable. And then he for some reason he just gets this game and he's just horrific. To Three points. He just fucking lays an egg. Yeah. that. Oh Peyton. Satan Manning. Satan Manning.",
    "timestamp" : "01:09:47-01:10:36"
  },
  {
    "text" : "Can only hide the horn so long, Greg.",
    "speaker" : "Steve",
    "timestamp" : "01:10:38-01:10:40"
  },
  {
    "speaker" : "Greg",
    "text" : "That's okay. He made a deal with the devil, I guess.",
    "timestamp" : "01:10:40-01:10:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:43-01:11:03",
    "text" : "I found I found the quote about uh the the the fans chanting It's also about like the signs that they had. Well, after the game, you will get your ring. Suffer ring, red one. The crowd was yelling, cut that meat, cut that meat, in reference to Manning's ad campaign in which he cheers for her. the common folk while they're performing their jobs. Brutal."
  },
  {
    "timestamp" : "01:11:04-01:11:44",
    "text" : "You see LeBron? LeBron would have called that racist. You see that? He was on his TV show, whatever shows that Barbershop was. Yeah. Yeah, Boston's racist. Why? And he was like, they're like, why do you say that? He's like, dude, whenever I go up there, they're always chanting like fuck LeBron. It's like dude, we've been saying fuck everybody for like 30 years. It's not special, dude. It's not about you. We'll say that to Peyton Manny, we'll say it to Braun James. We'll say it to your mother. I don't give a damn. To be fair, that commercial was sweet. Yeah. And the one where the kids and you throwing the football at them. Yeah, I remember that one. Like make a wish, I think it was.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "It was uh an SNL skate, yeah. Uh SNL, yeah. Yes. Yeah, hucking the footballs at him. Yeah, it was funny. That was a good one. What else do we got here?",
    "timestamp" : "01:11:45-01:11:53"
  },
  {
    "speaker" : "Greg",
    "text" : "He's on uh isn't he doing commentating this year?",
    "timestamp" : "01:11:53-01:11:56"
  },
  {
    "timestamp" : "01:11:57-01:12:00",
    "speaker" : "Andy",
    "text" : "He was doing that thing with his brother on what was it, Amazon or something?"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh who'd they just give a huge oh Brady, right?",
    "timestamp" : "01:12:00-01:12:03"
  },
  {
    "timestamp" : "01:12:04-01:12:06",
    "text" : "No, but he signed a deal when he's done. Yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:12:06-01:12:09",
    "text" : "For like for like ten years or something. Yeah."
  },
  {
    "timestamp" : "01:12:09-01:12:10",
    "speaker" : "Andy",
    "text" : "Ridiculous."
  },
  {
    "speaker" : "Greg",
    "text" : "He's gonna be terrible. You think?",
    "timestamp" : "01:12:11-01:12:14"
  },
  {
    "timestamp" : "01:12:14-01:12:16",
    "speaker" : "Andy",
    "text" : "Yeah. I think it's gonna be a smarter Tony Romo."
  },
  {
    "text" : "Greg's not negative as charismatic as Tony Romo. He's such a negative bitch, Greg. Dude, you give the they gave him like a $300 million contract for a guy that like has someone run his social media for him. Like, come on. I can't wait for him to get dragged for calling something disgusting. Yeah, that disgusting act. Yeah. It's a prejudice that surpasses objective reporting, is what it is.",
    "speaker" : "Greg",
    "timestamp" : "01:12:17-01:12:45"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:12:48-01:12:52",
    "text" : "Oh, good lord. All right, boys, you got anything else?"
  },
  {
    "timestamp" : "01:12:53-01:13:00",
    "speaker" : "Greg",
    "text" : "Nope. All right. That's it. Where are we off to next week? The Steel City, the Three Rivers. Three River Stadium."
  },
  {
    "speaker" : "Andy",
    "text" : "A rematch of 2001.",
    "timestamp" : "01:13:01-01:13:02"
  },
  {
    "timestamp" : "01:13:03-01:13:10",
    "text" : "Smogsville US championship game. But this time with the Heinz Ward, Troy Palomalo.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:13:10-01:13:12",
    "speaker" : "Andy",
    "text" : "The new queen of the NFL."
  },
  {
    "text" : "Bettis? Is Bettis still kicking?",
    "speaker" : "Greg",
    "timestamp" : "01:13:12-01:13:14"
  },
  {
    "text" : "Don't believe it.",
    "timestamp" : "01:13:14-01:13:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:13:15-01:13:19",
    "text" : "God, I hate the Steelers, dude. I don't know if I hate them."
  },
  {
    "timestamp" : "01:13:19-01:13:24",
    "speaker" : "Andy",
    "text" : "No, he's still there. Yeah. I I don't I I have a hard time hating because they never win."
  },
  {
    "timestamp" : "01:13:25-01:13:27",
    "text" : "Yeah, they have as many Super Bowls as the Patriots did, dude.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:27-01:13:31",
    "text" : "Greg, you don't understand what is yeah, but none of those counted because they were before any of us were born."
  },
  {
    "timestamp" : "01:13:31-01:13:43",
    "text" : "So Yeah, that's true. And he's right. Andy fucking classic dude spin zone guy. Tonight on Fox News, we have Andy defending the Patriots in any way he can possible.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:45-01:14:03",
    "text" : "Well, I I just got f uh fresh of reading um a book. Well, the excerpts of the book called The Asterisk. Uh-huh. Written by Ed Starrett. No, it it's written by a um uh Steelers fan. And um"
  },
  {
    "speaker" : "Steve",
    "text" : "Spit it out, Andy. What is it? It's all about how the Steelers Super Bowls don't count because they're before this guy was born.",
    "timestamp" : "01:14:05-01:14:11"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:14:11-01:14:24",
    "text" : "Before Andy, it's how the Super Bowls don't count because um Roger Goodell and the Patriots have colluded to cheat the Patriots into uh six Super Bowl wins."
  },
  {
    "timestamp" : "01:14:25-01:14:32",
    "text" : "That's that's I'm not gonna say the R-word, but that's R-worded. Racist?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:14:35-01:14:45",
    "text" : "Oh here oh here's the full name of the book. The asterisk, a fan's grievance on cheating and rule manipulation in the NFL. $4 paperback if you want it.",
    "speaker" : "Andy"
  },
  {
    "text" : "So it's more than just the Patriots stuff?",
    "timestamp" : "01:14:45-01:14:47",
    "speaker" : "Greg"
  },
  {
    "text" : "And got so sick of arguing with Patriots fans that they weren't cheaters, uh the Patriots were cheaters and should have all their Super Bowl stripped from them. Uh that He wrote a book.",
    "speaker" : "Andy",
    "timestamp" : "01:14:58-01:15:10"
  },
  {
    "text" : "Dude, the cheater thing and like the the referees thing is just such sour grapes bullshit, you know? Oh yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:15:11-01:15:20"
  },
  {
    "speaker" : "Andy",
    "text" : "But this is like next level sour grain.",
    "timestamp" : "01:15:21-01:15:23"
  },
  {
    "speaker" : "Greg",
    "text" : "So many fans do that too, of like their immediate reaction after teams lose is, yo, you cheated or the riffs, dude.",
    "timestamp" : "01:15:23-01:15:31"
  },
  {
    "text" : "Yeah. Jaguars fans I think were are the worst at the moment in that AFC Championship game where Miles Jack wasn't down.",
    "speaker" : "Andy",
    "timestamp" : "01:15:31-01:15:38"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh yes I mean to be fair, it's all they got to hang their hat on.",
    "timestamp" : "01:15:38-01:15:42"
  },
  {
    "timestamp" : "01:15:42-01:15:59",
    "text" : "Yeah, I mean you can complain about calls, but they go either way. And like the one people that think it's like, the NFL wants these teams in the Super Bowl. It's like they don't give a shit. They're making money, so much money they don't have to do with. They'd rather not fuck with the the golden pig. Yeah. Golden goose.",
    "speaker" : "Greg"
  },
  {
    "text" : "And actually, I think it it Super Bowls are probably more watched now if the pages aren't in it.",
    "timestamp" : "01:15:59-01:16:05",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I mean they don't I don't think they fuck around with any of that shit. They just try and call them the best they can. And sometimes they do a better job than other times. Yeah, this isn't the NBA.",
    "speaker" : "Greg",
    "timestamp" : "01:16:06-01:16:15"
  },
  {
    "timestamp" : "01:16:15-01:16:20",
    "speaker" : "Andy",
    "text" : "I also think the referees aren't like it should probably be full-time employees and not have side. jobs."
  },
  {
    "text" : "I think it's a very hard thing to do to referee a game. So I I think this is about as good as you get. Yeah.",
    "timestamp" : "01:16:20-01:16:26",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean it can be Andy, care to comment? Yeah. I think they could have more help, like put more replay cameras around so you get better angle things. But yeah.",
    "timestamp" : "01:16:27-01:16:35"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:16:36-01:16:41",
    "text" : "I think it could be sp sped up. Yep. Like the replay is obnoxious that it takes that long."
  },
  {
    "speaker" : "Andy",
    "text" : "Right. Like they w what's is it hockey where they have the the replay guy in the booth? Or soccer actually now, right? Dude, go to V AR and the fucking Wheels calls it.",
    "timestamp" : "01:16:41-01:16:50"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:16:50-01:17:09",
    "text" : "Hockey does awesome is if you don't get a call, you challenge and you miss it. Take a penalty. Yeah. Really? I love it. Or delay a game. Yeah. That's fucking kick ass, dude. So they only challenge things that they're like, uh we're fucking I think we're gonna get this. Yeah. This is like an obvious overturn."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I mean, I in this game even, um Tony Dungey challenged the obvious fumble by uh Harrison at the end of the game.",
    "timestamp" : "01:17:10-01:17:19"
  },
  {
    "timestamp" : "01:17:19-01:17:33",
    "speaker" : "Greg",
    "text" : "game because it was like a Hail Mary that maybe I'll get overturned, but it was blatantly fucking penalizing 15 yarder if you get 15 yards on sports money conduct delay game. No you have to play with 10 men making us all watch extra commercials."
  },
  {
    "timestamp" : "01:17:32-01:17:34",
    "text" : "Definitely ten ten men for the rest of the drive.",
    "speaker" : "Andy"
  },
  {
    "text" : "See, Steve, now now you talk my language here. Steve. Yeah.",
    "timestamp" : "01:17:34-01:17:42",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:17:43-01:17:48",
    "text" : "All right, boys. So we will see you next week. In Three River Stadium.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:17:48-01:17:56",
    "text" : "What jersey we wearing? I don't know who's the hero. Tom Brady. I got a Harrison. Harrison probably deserves a jersey wear at some point."
  },
  {
    "text" : "I'd say probably uh Dion Branch has himself a branch. Save that one for the Super Bowl.",
    "speaker" : "Andy",
    "timestamp" : "01:17:56-01:18:02"
  },
  {
    "timestamp" : "01:18:03-01:18:04",
    "text" : "Yeah, good point, Steve.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Fair, fair, fair.",
    "timestamp" : "01:18:04-01:18:05"
  },
  {
    "text" : "Good point.",
    "timestamp" : "01:18:06-01:18:06",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Steve Brown. Yeah, Rodney Harrison is probably 101A. All right. Well, I think that's it for this week. So until next week.",
    "timestamp" : "01:18:07-01:18:17"
  },
  {
    "text" : "Good. I'm getting sick, you guys, anyways. Especially you, Andy.",
    "timestamp" : "01:18:17-01:18:20",
    "speaker" : "Greg"
  },
  {
    "text" : "Says the guy who hasn't showed up in a month. Yeah, do we wanna do we wanna do you wanna uh do you have anything to say about why you weren't there last week or do you are you good?",
    "speaker" : "Andy",
    "timestamp" : "01:18:20-01:18:29"
  },
  {
    "text" : "Yeah, I always say that. That four people is too many.",
    "timestamp" : "01:18:30-01:18:34",
    "speaker" : "Greg"
  },
  {
    "text" : "Okay.",
    "timestamp" : "01:18:34-01:18:34",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I do it for the fans. Yeah.",
    "timestamp" : "01:18:35-01:18:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, all right.",
    "timestamp" : "01:18:36-01:18:37"
  },
  {
    "timestamp" : "01:18:37-01:19:23",
    "text" : "So this is the people talking over each other. It gets like it's just doesn't feel like a conversation. It feels like an interview when you have like four people I don't join this podcast to interview people. I have enough fucking shit like that at work. I don't need to come here and be like, well excuse me, sir. Like what How did it feel on the first time you stepped onto the field? Tommy Longcock. Yeah, Tommy Longcock. I'm trying to fuck around with my brothers. No. Talk to famous people. Let's go eat with them and bang their mouths. That's wrong. What Bang their mouths. Let's go eat with them and bang their mouths. Hopefully mom's turned the podcast off at this point.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:19:25-01:19:33",
    "speaker" : "Andy",
    "text" : "What the fuck is that from? Hang on, hang on, one more. I knew I'd be shitting pancakes. Oh yeah, I know that one."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. But no, you oh you don't remember the uh Let's go eat with them and bang their mouths. Is that from the Cam Newton episode? No. No.",
    "timestamp" : "01:19:34-01:19:42"
  },
  {
    "timestamp" : "01:19:44-01:19:45",
    "speaker" : "Andy",
    "text" : "I think I have a full story."
  },
  {
    "speaker" : "Greg",
    "text" : "Yo, I got those chicks from last night lined up. Let's go eat with them and bang their mouths. Oh, I know what that's from. I know what that's from. That's incognito. That's a fucking direct quote from incognito.",
    "timestamp" : "01:19:45-01:20:02"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:20:05-01:20:07",
    "text" : "That one the wolf the I don't know."
  },
  {
    "text" : "I feel like that might be our sign-off. No, wait a minute. Just don't what about like for Thanks for listening. Don't bang their mouths. And we had said that a while ago that we had a new sign-off. So send us out, Andy.",
    "speaker" : "Andy",
    "timestamp" : "01:20:08-01:20:24"
  },
  {
    "speaker" : "Greg",
    "text" : "What does that mean? Send us out. That means you write it. I will do a lot! See you later. See you later.",
    "timestamp" : "01:20:25-01:20:36"
  }
]