[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "speaker" : "Mom",
    "timestamp" : "00:00-00:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:21-11:55",
    "text" : "Alright, welcome back to the Patriots Dynasty Podcast. I'm your host Andy Brown. With me today is Nobody. The Brown brothers are off gallivanting on vacation. Um in the sticks of Maine for the most part, but I got too excited. to be able to wait for them because uh this next game that we're going to talk about is kind of the reason that I started this podcast in the first place. Not this game specifically, but the games just like this, because Uh most people when you talk about the 2004 week five game, three-o Patriots at home versus the 0-4 dolphins. You don't really think about it much. Even though this was the game that the Patriots would, spoiler alert, break the all-time win streak record. It was 18 games coming in, which the Patriots shared with a bunch of teams, including the 72 Dolphins, funnily enough. on their way to the Patriots on their way to setting this for I think it was 21 or 22 games. Most people still don't necessarily remember this game because it wasn't in all fairness a a great game. But the Patriots will go on to win this in kind of a bit of a snooze fest, 24-10. So they're one by two touchdowns. Not a big deal. But the reason that it's worth re-watching really doesn't have a lot to do with the game itself. But it has to do with kind of one of the small stories in here that only really makes sense looking back. And I'll get into that in a sec, but first I'm just gonna set the scene a bit. This 2004 Miami Dollar. I already talked to the Patriots there on their way to, you know, 4-0 start at this point, and they will win a bunch of games in a row. I haven't lost in a lot of episodes. Uh since the beginning of the two thousand three season against Steve Sparrier's Redskins, believe it or not. And then so they've come off the two thousand three Super Bowl. Rebooted with pretty much the same roster, except they traded for Corey Dillon as their workhorse running back, and he is putting up uh great numbers. And also they've drafted Vince Wilfork, who, rookie Vince Wilfork in this season is an absolute gem to watch. And no there's nothing like seeing somebody that big and that much of a mountain of a man be able to move that quickly. It's it's something else. But the Dolphins are kind of on the other end of the spectrum. Last time we saw them last year, their team, their offense was They had a great defense with, let's see, Patrick Sertain, Sammy Knight, Jason Taylor, and Zach Thomas, that kind of core, especially the Jason Taylor, Zach Thomas in the middle there. They they are one of the again top-ranked defenses. They have been for a few years now, but their offense was built around Ricky Williams. He was their, you know, high pick. He has been running for, you know, over a thousand yards, like over fifteen hundred yards here and there. But this was the season where Ricky Williams announced his retirement kind of the week before the season started. And so the Dolphins were kind of left holding the bag. They because they had built this team around him offensively and now they had nothing. So their starting quarterback was Jay Fiedler, who actually got hurt in this game towards the end. And was removed. And then A. J. Feely came in in relief. And two plays later he was also hurt and removed. But the Dolphins didn't get the ball back to see who the third string was. But both of those quarterbacks would finish the season at about the same, both less than 2,000 yards passing, both with more interceptions and touchdowns. Not great. The top running back on the team was Sammy Morris who we will also see. And they also had uh why does their top wide receivers are Chris James and Marty Booker. But there was one other wide receiver on this team who it was his rookie year and is a name that Patriots fans might recognize. He's a shifty little slot wide receiver by the name of Wes Walker. And this is Wes Walker's rookie season. He was, I believe, an undrafted or a late draft pick by the Chargers originally. Was he drafted? I don't think he no, it doesn't I don't think he was drafted. And they they talked about it in the in the game. Fucking Dan Diddle for game, but we're not gonna get into that because I don't need to get myself angered. But yeah, so he he spent a lot of time in their camp and like made it through all the cuts. But then the Dolphins signed him after that. And so he was basically just like a punt and kick return specialist at this point. I think he finished 2004 with, did he have any receiving yards? He did not. Nope. Zero catches. But he did, he did return kicks and punts. But weirdly enough, in this football game, he did a bit more than that because before opening kickoff in warm-ups, Dolphins kicker, Alindo Mare. who, you know, is kind of a longstanding kicker, really good, really accurate guy. Been there kind of stalwart for ages. Re-injured his, I think it was his hamstring or his calf or something like that in the he had heard it in the game before. four and managed to get through it but then like re-aggravated it in warm-ups of this game. So they found out that Wes Walker had kicked in college. He had attempted one I think extra point Which according to Weswalker was tipped and sent wide. But they're like, all right, well, that's uh good enough. That's all we got. So they sent him out there for kickoffs. And there's actually a blog post on the Pats Dynasty website, the new one, that you can read about this. But basically, this was the intro to the NFL of Weswelker and probably more specifically intro to Bill Belichick of Weswelker, which makes a lot of sense that you would see the Patriots spend the capital that they did. I think it was a second and a seventh round pick, something like that. in uh before the 2007 season, which was actually more than they spent on getting Randy Moss to the pages that same year. And everybody was like, why would you spend more on this, you know, little short white J-scrappy gym rat sort of guy who hasn't put up great numbers for the Dolphins. I think. Let's see. What do you do for the Dolphins? Three years with the Dolphins. He had three starts, 96 catches in three years, and one touchdown. In New England, he would put up more numbers than that. 37 touchdowns. in seventy-eight games and thousands of yards receiving. And I think let's see, in New England he averaged more than a hundred catches per season for all five seasons that he was there, which is bananas. Including oh Jesus, 123 in 09 and 122 in 2011 before moving to Denver. But yeah, so he it was kind of an unknown, but in this game he showed that he was a prototypical patriot. We talk a lot about Troy Brown on this podcast, about how he, you know, did everything he asked. He played wide receiver, he returned punts, he's returned a couple of kicks before, but he also played defense uh and in one preseason game, he lined up as the emergency quarterback and handed it off only for the whoever the running back was to fumble it. I don't know why I remember that, but I think it's just because of Troy Brown. And he played all the positions. So we're no stranger to this, but in this game, the opening kickoff was by was Welker. And then The Patriots would score on the opening touchdown of the game, and then the ensuing kickoff was returned by none other than Weswalker for 27 yards, so not too bad. And then Not much would happen generally in this first half. Uh the Patriots would score a couple touchdowns. off of Miami issues. There was an interception by Randall Gay that uh the Patriots turned into uh Brady DeGram touchdown. And then the in the second quarter Miami accidentally tried a fake punt because the the long snapper snapped it too far to the left of the punter and he decided he wasn't gonna be able to kick it in time so he tried to but did not get anywhere close to the first down. So Page turned that into a touchdown. But in between those, Miami did actually put one drive together, which was a surprise because this Miami offense was one of the worst in the league. They finished 28th in points four and twenty-ninth in yards four. So like this team literally was built around Ricky Williams. It's like taking the engine out of a car and like they were just pushing it everywhere. It was that and so They managed they did manage to actually score one touchdown where who was it? Chris Chambers actually juked Ty Law out of his pants, surprisingly. Um so they managed to score a touchdown and out comes our own Wes Welker. to kick the extra point. And strangely enough, this is uh you know something you can take to parties with all the other Pat Snares that I'm sure you know because you listen to this podcast. But that extra point Of all the points Wes Welker scored in the NFL, that was his first, was kicking an extra point in this game. He had never scored before this on any, you know, kick return, pen return. Reception, because he didn't have any of those because he wasn't seeing the field. So yeah. And then of course he's kicks the ensuing kickoff. Returning punts, and then towards the end of the game. Wes Welker, Dolphins trailing 24-7, and they drove again down it's like end of the third quarter. It's like two minutes left. They drive down the Patriots 11 line 11 yard line and it's fourth and long-ish. So they actually send Weswalker out for I think like a 28-yard field goal, something like that. Which is pretty impressive. He kicks it just barely, squeaks it through, which for somebody who hasn't kicked since, I think, like legitimately kicked since high school is what he said. And side note, there was actually more words written about Wes Welker in this than I think any actual patriot in the the Boston Globe the next day. There's a whole like section and a whole article about him. But he was talking about he the only reason he like really knew what he was doing is because he played soccer growing up. And then kicked for his high school team and once in college. So, but yeah, they sent him out there and he kicked the field goal to you know bring the Dolphins within two touchdowns-ish. Then went out, kicked the ensuing kickoff, and also on that ensuing kickoff was involved in making the tackle on the kick returner. So this was more than anything, more than, you know, the Patriots setting the record was actually kind of the Wes Welker game, believe it or not. Even though he wasn't yet playing for the Patriots. But I remember this was kind of a similar time. This is October 2004. So similar time with the Red Sox doing their comeback with against the Yankees in the ALCS, I think it was. Uh I'm down three games to nothing, and you know how it all ended with that. So I think they were actually down three nothing. And I come home from college to hang out with the family, and it's just me and my dad sitting around and he turned to me and he was talking about the The Yankees. This is his claim to fame. He was talking about the Red Sox Yankees game. And he turned to me and said, if the Red Sox are going to break an eighty-six year curse, what better way to do it than coming back three games down to the Yankees in something that's never been done before? And of course that happened. And so we're watching this game too. It I don't know if it was the same weekend or it was around the same time. But then I turned to him and this was Walker. It's a matter of time before he's on the Patriots because this is like a Bill Belichick person. And two years later, that's exactly what happened. So Me and dad, Nostradamus, I guess it runs in the family, and as long as you exclude my brothers, because according to mom, they are very naughty."
  },
  {
    "speaker" : "Mom",
    "text" : "That's right. Thanks, Mom.",
    "timestamp" : "11:55-11:56"
  },
  {
    "timestamp" : "11:59-25:08",
    "text" : "But as good as Wes Walker was in this game, both offenses weren't. You could watch this game. I might just watch the highlights if I were you, because it'll probably be mostly about Wes Walker. Because there wasn't much else going on. Brady was, I believe this was the first time in his career that he had thrown for less than a hundred yards. He was seven of 19 for 76 yards, two touchdowns, and an inception as well. So just not great. Having said that, Jay Fiedler was Perhaps worse. I think he went into halftime, they said four of eleven for not very many yards. He he did uh I mean they had to start slinging at the end uh because they were down two touchdowns and they were Trying to move the ball and the pages were trying to grind clock, you know, as they do in these AFC East divisional battles, typical game. So we ended up with 250 yards, but did not look great. Had the one reception, three sacks, and just not making great decisions. Like none of the plays looked like even when it was successful, it looked like it probably shouldn't have been. Strangely. So yeah, I I would probably skip this one personally. It's nice to watch Wes Welker before he became Wes Welker. And also it's nice that the Patriots broke the record set by the 72 Dolphins of 18 wins in a row by winning their 19th. But also the fact that this isn't an NFL record, I'm going to bring it up again, is garbage. The NFL does not consider this an official record because it includes playoff games. So something else that we can rail on Goodell for because fuck that dude. Yeah, but this it was not great. I try I try to keep track of how all the the drives ended. And there are a lot of turnovers. Brady threw a pick on the third play of the game to start the game. Miami started the 50 and they went three and out immediately punted. And it just and that was it. And then Miami threw a pick and it was just like this all the way down. There was the fake punt fail. There was a trying to scramble on third down and getting popped and fumbling it by Rodney Harrison and Pat recovered. There was some I think the a lot of the reason for this the Patriots side of things not performing was because they didn't have any wide receiver that were healthy for this game. They Of their top three, Troy Brown, Dion Branch, and let's call him David Patton top three. Troy Brown was out with a shoulder injury, Dion Branch out with a knee injury. Bethel Johnson out was just inactive. They didn't actually say why, which has happened before where I think he just maybe doesn't particularly practice well or something like that. So they were left with David Givens, who was the only one who actually really caught anything, David Patton, who missed a bunch of deep balls, and Of all people, Kevin Casper, if you remember him, number 10, who was kind of the epitome of a street-free agent, was out there as a bit of a warm body. But didn't seem to know which routes to run. Brady threw to him a couple times and he was just like in the wrong spot every time. Just a tough and also Daniel Graham was kind of the only other person that Brady was even trying to target. And in true Dan Deirdre fashion, because Daniel Graham has actually caught a few touchdowns to start the season. He had four touchdowns in in the first three games. And he caught another one in this one, like a short play action one that they always run. Dan Diodorf decided to say that he Daniel Graham is being compared to Shannon Sharp and Tony Gonzalez because of his prowess, and we haven't seen the best of them because He can really split a defense running seam routes down the middle because of his speed. But as we all know, that didn't quite work out because he had hands of stone Which is a shame because I think if he was able to catch the ball, he might have been the original Gronk before Gronk, but did not happen. Other Dan Deerdorfisms, since we're gonna get into it, I'm gonna try to restrain myself because there's nobody to calm me down. You did say Charlie Weiss is the Mike Marts of the AFC, which I think had to do with play calling and not belt size, but I don't quite understand that because I don't think we've seen a lot of trickery lately out of Charlie Weiss. So for him to be able to say that with such a vanilla game plan lately, especially because since it's give it to Corey Dillon and watch him run for 100 yards a game was a little out of left field. And I think I finally figured this out, and you'll probably hear me say it again once the brothers are back, but I finally figured out what it is about Dan Deerdorf that bothers me so much. And it's almost like he's never watched a football game before because even simple things surprise him and he's Like there was one where I think it was Kevin Falk was returning a punt and he and the punt was short, so he was waving off the the gunners and stuff to get to get away from it. And Dan Diedorf couldn't recognize that that wasn't a fair catch call. So he assumed it was a fair catch call, commented it as a fair catch call. And then Kevin Falk took off with the ball and he got all upset that you can't run with it. And then the replay clearly showed it wasn't a fair catch call. And it's just those sorts of things. They all surprise him. And he gets things so Blatantly wrong like that? Like just the little simple things. That's what bothers me And I I I can't explain why that bothers me. Well I'll have to think about that until next week. So but yes, so uh I'm gonna stop talking about Dan Dudorf because I can't. But New England Patriots I'm going to keep this short because it is just me. We'll do best and worse real quick. Patriots have now scored first in 12 straight games and have won all 12 of them, which is great. And they've also now, this is their 24th straight game that they won while leading at the half. So basically don't let them take a lead at all or you're not gonna you're not gonna win this game. This is a a good game to watch for any um Of the Brady is soft crowd because he got absolutely battered in this game and just popped up every single time. None of this, you know, looking for flags everybody complains about just popped back up. getting hit at the knees, getting thrown in the ground, took a beating, didn't didn't really throw the ball well because he had nobody to throw it to. Even when he had time to throw it, there was just literally nobody open. had to try forcings in there and it didn't work. But, you know, never really got fired up like you see him do now. Just kind of like took on the chin and kept on going. And literally actually he took one on the chin and was bleeding and they had to like get him cleaned up before they could send him back in the game. See David Gibbons again also, this is I think why Steve Brown started to love him. This is probably the season where He uh crept into C Brown's heart because uh he was the only one. I think today and probably for the next few weeks and the past couple of weeks, who's actually catching anything? becomes Brady's kind of favorite. Kind of like a a security blanket, like he always tends to find somebody, you know, it's the if it's not the Weswalker or the the Julian Elman. Before it was Troy Brown and Kevin Falk, that guy that can just like keep the chains moving until you can find your playmakers towards the end zone. This this 2004 season, that was David Gibbons. All he does is catch first downs. And on the Dolphins side, I think the Dolphins are probably the worst. The Patriots were like those were the best of this game, the but the Dolphins. Like this is uh an abysmal season, I think, to be a Dolphins. The only bright spot they went four and twelve. I think I forgot to mention that earlier. They beat one team with a winning record. And as a spoil spoiler alert, we will actually see that game because it is coming up this season against the Patriots. But this was kind of a season of futility a couple weeks from now in week six. It might be next week actually. In week six. Yeah, because this is week five. The next week the Dolphins will play the Bills, and it will be the the only time the NFL since 1968. The last two winless teams will meet. So the last two teams winless in this 2004 season, both in the AFC East. Tough look, but this is what happens when you build an offense around one guy and he decides to retire to go smoke weed around the world, which you know, can't really blame him for. The Dolphins did their defense. Stellar, they've allowed 17 points against all season. Or they haven't allowed that many points in a game per season, all season. And again, this was the most they allowed was a 24. Uh but on the other side, the offense has been shut out in the third quarter. This entire season up until Wes Walker's field goal in this game. So that was the first third quarter points they had scored all season. So that's uh not great. They've been outscored 37 to nothing up until then. And this team also finished this game with more penalty yards than rushing yards by a decent margin, like almost 20 yards. So not not a good offense. And I don't think it would get any better. Except for Weswalker, who actually was on the field offensively. He was only there during kickoffs and uh field goals. And that was about it. Yeah, this was a decent game for Corey Dillon. He had 90-something yards, but kind of didn't really see the field in the second half. Oh, there was one thing Towards the end of the game that they showed one of those screens when they're coming back from commercial. And they call a portrait of a quarterback for the Patriots. And this is what they look for, which I think might come in uh Uh it might make a a bit more sense now as to the Patriots uh draft class this year with Mac Jones. But it was kind of what the Pages look for in a quarterback when when they're trying to find one and and why it's kind of why they drafted Tom Brady. And those four points to it. Point number one is mentally toughest. He has to be the hardest worker on the team, which obviously Tom Brady was. We've seen that for 20 years and he's still doing it in Tampa Bay. And it sounds like from uh all accounts so far early that Mac Jones is very similar. A lot of coaches waking up at 6. 30 with texts from him. uh and other quarterbacks as well with questions about certain things. He has to be able to take a big hit and call the next play. So he has to kind of be not just mentally tough but physically tough. We haven't really seen Mac Jones take any hits yet because it's still training camp, but I think we'll see that pretty quick if that's the case. But from what I understand, he was doing that in college, so perhaps that will carry over. He is kind of scrawny, but as was Tom Brady to start. And number three, he has to be able to handle pressure and kind of because that's what this position is. And again, you know, Mac Jones has seen a lot of big games. in his college career. Like Tom Brady always performed well in bowl games. And so I think a lot of that is what the page is looking for. You know, have you played in a bowl game? Did you play well? Were you able to handle the pressure? And a number four, this one was kind of interesting because the other three is kind of that makes a lot of sense. But number four was complete passes under a heavy rush. Which I don't really know how you grade that. I guess you could see that. I mean, maybe less so with Mac Jones because he was on such a a high-end team in Alabama. where they had kind of a s a m a stellar offensive line where maybe at Michigan back in 2000 wasn't necessarily the case, or ninety nine I suppose. But I think again, that's something we'll see pretty early too, especially in these as these preseason games come along. But Yeah, I just thought it was interesting that that is what the Patriots look for in a quarterback are those top four things. That's why they drafted Tom Brady, and it sounds like that's what they were looking for in Mac Jones. So we'll see if he works out the same way that that Brady did based on those criteria. We can kind of keep those in mind as this 2021 season takes off. And maybe you can listen back to this if you If you're chiming in after the 21, 2021 season and let us know what we thought. All right. So that is about it for me. Hopefully next week it won't be just me. Uh because it w it might be a little bit funnier if it's everybody else. Telling jokes to yourself sitting in a bedroom doesn't really have the same effect, I'm afraid. So uh yeah, until then, if you got any comments, you can text me. On the Dynasty Hotline, 603-505-8043. And we'll get back to you. If you got anything to say, if you liked it without the brothers, if you Need the brothers next week. Either way, just let me know. Also, you can check out the new site, patspod. com. Whole lot of new work going on there. And yeah, I think that's it. So until next week, we will actually what is next week? Patriots have broken the record, so now it's all gravy. But next week we have Mike Holmgren and the Seattle Seahawks coming to town. Wow. I do not remember this game at all. But all right, apparently it happened, and we will s we'll see what that looks like next week on the Patriots Sciencey Podcast. See you later.",
    "speaker" : "Andy"
  }
]