[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Welcome back to the Pages Dynasty Podcast. The only podcast I would have to assume. Where the the we are going back and re-watching every game of the Patriots dynasty starting in 2001. We have finished the 2004 regular season. So if you want to listen to those, you can go back and listen to that. But since the babes have a bye week, we thought we would kind of take like we do traditionally our bye week and do something a little bit different. Uh so this time Greg has convinced us to watch a random game that is important to him and really only him.",
    "timestamp" : "00:21-00:58"
  },
  {
    "text" : "That's not true. That's not true at all.",
    "timestamp" : "00:58-01:01",
    "speaker" : "Greg"
  },
  {
    "text" : "In this family? A legendary game. Oh, this no, it's important to dad. He was there too.",
    "timestamp" : "01:01-01:06",
    "speaker" : "Steve"
  },
  {
    "text" : "That might be. And sour grapes. That's exactly important to me because I was first on the list to go to this game, but I was overruled by McBrown. Um and he brought Greg instead and it turned out to be an instant classic. So Greg, what game are we talking about?",
    "speaker" : "Andy",
    "timestamp" : "01:06-01:23"
  },
  {
    "speaker" : "Greg",
    "text" : "1998 week 13 Patriots versus Bills, also known as the Terry Glenn Hail Mary Interference Game, Ben Coase, touchdown, Vinateri, two-point conversion game.",
    "timestamp" : "01:24-01:36"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:36-01:37",
    "text" : "Spoiler."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, that's the game.",
    "timestamp" : "01:39-01:41"
  },
  {
    "timestamp" : "01:41-01:44",
    "text" : "Yeah, all right. Well. I don't know if anyone calls it that though.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:44-01:54",
    "speaker" : "Steve",
    "text" : "I feel like the name is generally a little shorter. What's a bit old would you call it, Steve? I don't know. I don't remember this game that much. I remember being sort of excited, but this is also pretty young."
  },
  {
    "text" : "Yeah, I remember being super fucking salty. I think it's a good scene.",
    "timestamp" : "01:54-01:58",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I'll bad Andy.",
    "timestamp" : "01:58-01:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:00-02:09",
    "text" : "There was definitely a reason why though. Uh I believe the reason why is because I had been to dad had taken me to a Red Sox game and that was the last game that anybody had gone to."
  },
  {
    "text" : "So well you're probably the first one to go to a Red Sox game too.",
    "speaker" : "Steve",
    "timestamp" : "02:09-02:13"
  },
  {
    "speaker" : "Andy",
    "text" : "Well yes, I went to Red Sox games before you guys were born. So yes, that is correct.",
    "timestamp" : "02:14-02:18"
  },
  {
    "text" : "There you go. And Craig was the first to go to a Patriots game?",
    "timestamp" : "02:18-02:22",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:22-02:23",
    "text" : "Probably.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "This is your first game, right?",
    "timestamp" : "02:24-02:25"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh technically I went to a Patriots game as an infant.",
    "timestamp" : "02:26-02:30"
  },
  {
    "timestamp" : "02:30-02:32",
    "speaker" : "Steve",
    "text" : "Oh yeah, that's great."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:32-03:27",
    "text" : "In the early 80s. When uh grandma our grandmother came over, mom's mom. And uh from what I understand, this was the time when the Patriots were an absolute shit show. And they uh like you know early 80s. So it was a whole bunch of controversy going around. I think there was something to do with one of the uh like female reporters getting harassed in the locker room. Yes. And so the fans were passing around um like blow-up dolls, like inflatable sex dolls around the crowd, like you do with beach balls. And so my our parents decided that was a good idea to bring grandma to, um, very religious uh woman. From English. Very British. Yeah. And so I think uh me and grandma ended up in the car in the parking lot, and grandma got to see uh a handful of people just peeing in between cars. Uh while the game was happening."
  },
  {
    "timestamp" : "03:27-03:30",
    "speaker" : "Steve",
    "text" : "Well they brought not just grandma to that game, they also brought an infant."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:30-03:39",
    "text" : "Right, yeah, I was there as well, apparently. So a nice family outing. Which I think kind of says a lot about the fact that we're doing this podcast now, maybe."
  },
  {
    "timestamp" : "03:39-03:45",
    "speaker" : "Greg",
    "text" : "It can't be worse than an English soccer game, which I'm sure grandma went to. That's actually a good point, Greg."
  },
  {
    "timestamp" : "03:45-03:50",
    "speaker" : "Steve",
    "text" : "Yeah. I heard way ruder and see way more gross stuff at any soccer game growing up."
  },
  {
    "text" : "You might be right, yeah. Yeah. Yeah. It's definitely less violent.",
    "speaker" : "Andy",
    "timestamp" : "03:51-03:53"
  },
  {
    "text" : "And like, you know, World War II.",
    "speaker" : "Steve",
    "timestamp" : "03:53-03:55"
  },
  {
    "text" : "Yeah. And also, I I I think the one thing that um American sports is missing are are the the chants. Oh yeah. Americans are not good at chanting.",
    "speaker" : "Andy",
    "timestamp" : "03:56-04:05"
  },
  {
    "text" : "That whole section was in that Patriots Dynasty book you sent me, Andy. From the guy who did the Tiger Was One. I forget his name.",
    "timestamp" : "04:05-04:12",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "04:13-04:14",
    "text" : "Something super generic.",
    "speaker" : "Andy"
  },
  {
    "text" : "Jeff?",
    "timestamp" : "04:15-04:15",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "04:16-04:38",
    "speaker" : "Andy",
    "text" : "Uh yes, it was. Um Jeff Howell's I don't know. I'm so bad at it. Uh Jeff Benedict. That book was sweet. Yeah, yeah, yeah. If you don't, if you haven't read it yet, uh highly recommend it. Although I had a hard time getting through the 2007 season part of it. Oh yeah. But read it just for like the opening is there. The opening is about uh Drew Bloodsoe and his injury."
  },
  {
    "timestamp" : "04:38-04:43",
    "text" : "Um and it's it's a fascinating read. Which is good context for this game because he has an injury in this game too.",
    "speaker" : "Steve"
  },
  {
    "text" : "Correct. Yeah. So Greg, tell tell us about uh what we got going on here in two in 1998. Uh the scene for us.",
    "speaker" : "Andy",
    "timestamp" : "04:44-04:51"
  },
  {
    "timestamp" : "04:51-05:11",
    "text" : "Paint us a picture. Seven six and five Patriots versus seven and four Bills. Yes. Coming down the the playoff scenario stretch here. Correct. Pat's trying to make the playoffs. I guess they had a super dramatic win on the Monday night rolling into this game.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Yeah. Does that game have a name?",
    "timestamp" : "05:11-05:14"
  },
  {
    "timestamp" : "05:14-05:44",
    "speaker" : "Andy",
    "text" : "Yeah, remember that game. The Drew Bledsoe finger game. Um Yeah. This was uh the game where Drew Bledsoe engineered a last minute come from behind uh touchdown drive. Uh while in the middle of the drive breaking his index finger in two places on the helmet of his uh somebody, uh they're not quite sure who. Um and still managed to throw a game winning like 20 something yard touchdown uh right at the end of the game."
  },
  {
    "text" : "Sean Jefferson",
    "timestamp" : "05:45-05:46",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, we'll post the um the highlights of that.",
    "timestamp" : "05:46-05:51"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "05:51-05:54",
    "text" : "This whole game was on YouTube, right? Sure."
  },
  {
    "text" : "This whole game this whole game was on YouTube.",
    "speaker" : "Andy",
    "timestamp" : "05:54-05:56"
  },
  {
    "timestamp" : "05:56-06:04",
    "text" : "Did you not watch it? I did. I watched it in two two different YouTubes. One was a little more stretched out.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, but it had the whole game and the one that was normal size didn't have the fourth quarter, which is what I think.",
    "timestamp" : "06:04-06:09"
  },
  {
    "text" : "Idiots.",
    "timestamp" : "06:11-06:12",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Should we talk about some names? Because there's a whole shitload of throwback names. Can we just rattle some off here?",
    "timestamp" : "06:13-06:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Hang on, hang on. Before you do that, I just wanna I just want to touch on um a bit more of the context. Um this was when the AFC East still had the Colts in it. And so there are one, two, three, four, five teams in the AFC East. Four of them would make the playoffs this year. The Patriots were the four seed in, or sixth seed in the AFC. At nine and seven. Bills were the fifth seed at 10-6. Miami Dolphins fourth seed, also ten and six. And the New York Jets, the second seed in the AFC at 12-4.",
    "timestamp" : "06:18-06:48"
  },
  {
    "text" : "So this is like the last time the Jets are actually good.",
    "timestamp" : "06:49-06:51",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Mm-hmm.",
    "timestamp" : "06:51-06:52"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:53-06:59",
    "text" : "This is probably the last time the Jets Yeah, because they have Curtis Martin who's just running over everybody and just being an absolute beast for them."
  },
  {
    "text" : "Correct.",
    "speaker" : "Andy",
    "timestamp" : "06:59-07:00"
  },
  {
    "timestamp" : "07:00-07:06",
    "speaker" : "Steve",
    "text" : "That is absolutely showed highlights of of the Jets game earlier the day during the broadcast, and he has like 140 yards."
  },
  {
    "timestamp" : "07:06-07:07",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "Had some sick runs where he just runs away from everybody.",
    "timestamp" : "07:07-07:10",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, that was peak Curtis Martin in 1998. So I believe that was the year that he left, correct? Yeah, it's gotta be right around there, yeah. It was. No, this was the year. This is the year after. Yes. And then they drafted Robert Edwards, who also was having himself a year.",
    "speaker" : "Andy",
    "timestamp" : "07:10-07:25"
  },
  {
    "speaker" : "Steve",
    "text" : "This might be Pete Carroll's second to last year, right? Because it's Pete Carroll the coach.",
    "timestamp" : "07:25-07:30"
  },
  {
    "timestamp" : "07:31-07:36",
    "speaker" : "Andy",
    "text" : "Pete Carroll is the coach. I don't remember exactly when he left, but yes, we can Google that."
  },
  {
    "text" : "Fact check it, bro.",
    "speaker" : "Steve",
    "timestamp" : "07:37-07:38"
  },
  {
    "text" : "All right, Greg, give me some names. All right. Drew Bledsoe, Robert Edwards, Sean Jefferson, Terry Glenn, Ben Coates, Bruce Armstrong, Dave Wallabaugh. Oh yeah. Chris Slade, uh a bunch of guys you've already heard of before. Willie Clay, Chad Eaton, Bucky Jones, Chad Eaton. And then the Bills, Doug Flutie, Antoine Smith, Sam Gash, Andre Reid, Eric Molds, Ted Washington, Bruce Smith, Sam Cowart, Thurman Thomas is on this team. Yeah. So this is like the sum of the remnants of those four Super Bowl Bills teams. Yep. I thought it was crazy.",
    "timestamp" : "07:38-08:21",
    "speaker" : "Greg"
  },
  {
    "text" : "How many players In this game and also in a lot of the games like we're watching this year.",
    "timestamp" : "08:22-08:28",
    "speaker" : "Steve"
  },
  {
    "text" : "Really? I mean it's not that crazy.",
    "speaker" : "Greg",
    "timestamp" : "08:29-08:31"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, yeah, it's amazing how much overlap there is with um you know Doug Flutie play for the Pats, uh Sam Gash also play for the Pats, Ted Washington and Antoine Smith would go on to play for the Pats. Doug Flutie.",
    "timestamp" : "08:35-08:47"
  },
  {
    "text" : "Yeah, he'd come for the Pats. He actually was already on the Pats once, right?",
    "timestamp" : "08:48-08:52",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "08:52-08:54",
    "text" : "Yes, he had played for the Pats already.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:54-08:58",
    "text" : "They showed that clip of him with the sick flow. He had a fucking Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "They actually they actually showed a stat. Where Doug Flutie was undefeated at Foxboro Stadium coming into this game. Yes. He was 3-0 at Boston College in 1983, 2-0 Boston College in 84. 4-0 with New England in 88 and 1-0 in New England in 89.",
    "timestamp" : "08:58-09:16"
  },
  {
    "timestamp" : "09:17-09:19",
    "text" : "And this is Undefeated 10-0.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "09:19-09:24",
    "speaker" : "Andy",
    "text" : "10 years later, yeah. So 10-0. So this would be his first loss in Foxboro Stadium."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I mean Doug Floody's a shit. Everyone loves him. Doesn't get no damn respect. This game was very watchable because you were like Rooting for Doug Flutie a ton, even though he's the Bills quarterback.",
    "timestamp" : "09:24-09:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "09:36-09:36"
  },
  {
    "timestamp" : "09:36-09:40",
    "speaker" : "Steve",
    "text" : "It's one of those things where he's like I can't be mad at him, even though he's he plays out of his mind in this game, too."
  },
  {
    "timestamp" : "09:41-09:42",
    "speaker" : "Andy",
    "text" : "He does, yeah."
  },
  {
    "text" : "He throws for like three hundred and forty yards, three hundred and fifty.",
    "timestamp" : "09:42-09:44",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "09:44-09:49",
    "speaker" : "Andy",
    "text" : "Well we say this is yeah, this is week thirteen, and they said he's been sacked five times on the season."
  },
  {
    "speaker" : "Greg",
    "text" : "He's also thirty-six. Yeah. Yeah, he's not a spring chicken.",
    "timestamp" : "09:49-09:54"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "09:54-10:06",
    "text" : "In this game he's thirty six years old. Oh that's right 'cause he spent all that time in uh Canadian football. CFL right yeah. He must have been lit in the CFL, right? Just running around people."
  },
  {
    "timestamp" : "10:06-10:08",
    "text" : "I believe he was like their Michael Vick.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, for sure. He won the comeback player of the year this year.",
    "speaker" : "Greg",
    "timestamp" : "10:09-10:12"
  },
  {
    "timestamp" : "10:12-10:13",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:13-10:14",
    "text" : "No way."
  },
  {
    "text" : "And then wait, was this the year that or was this later on where No, it must have been later on where they had the Brad Johnson stuff and like they kept trying to start Brad Johnson.",
    "timestamp" : "10:15-10:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "The loss of Tennessee at the Music City Miracle.",
    "timestamp" : "10:28-10:31"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh right. So this is the last time the Bills are good too.",
    "timestamp" : "10:32-10:35"
  },
  {
    "timestamp" : "10:35-10:36",
    "speaker" : "Greg",
    "text" : "Yes."
  },
  {
    "timestamp" : "10:36-10:41",
    "text" : "Until very recently, yes, yes. That's tough.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "All right, so uh the other couple names for you, the commentators, Vern Lundquist and Randy Cross.",
    "timestamp" : "10:42-10:47"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "10:48-10:49",
    "text" : "Did you hate them, Andy?"
  },
  {
    "timestamp" : "10:50-11:04",
    "text" : "Of course I did. Um but speaking of commentators, I would just like to um share something for you boys that I think you might like. Oh jeez. We have a birthday today.",
    "speaker" : "Andy"
  },
  {
    "text" : "1971, the St. Louis Cardinals drafted a fierce 290-pound competitor named Dan Deerdorf. Deerdorf headed an offensive line that yielded the fewest sacks. In the NFL for five straight years during the 70s. This relentless right tackle punished would-be defenders, whether the Cardinals chose to run or pass.",
    "timestamp" : "11:06-11:33",
    "speaker" : "Announcer"
  },
  {
    "text" : "I always thought that I went through my years in the NFL like I had blinders on, like I was a racehorse. I I saw nothing but the upcoming game and my upcoming opponent. I really had the ability to rule everything else out and make it inconsequential.",
    "speaker" : "Dan Dierdorf",
    "timestamp" : "11:35-11:49"
  },
  {
    "speaker" : "Announcer",
    "text" : "Deerdorf would be denied only one Pro Bowl appearance from 1974 through 1980, securing his place in Pro Football history.",
    "timestamp" : "11:50-12:01"
  },
  {
    "speaker" : "Andy",
    "text" : "So there you go. Happy birthday to the legend who is Dan Deerdorf.",
    "timestamp" : "12:03-12:09"
  },
  {
    "speaker" : "Greg",
    "text" : "Is he in the Pro Bowl? Uh the Hall of Fame? No.",
    "timestamp" : "12:09-12:13"
  },
  {
    "text" : "Uh I think we talked about season the Hall of Fame for broadcasting, right? Broadcasting Hall of Fame. Yes. Which is even worse. Andy it's way worse.",
    "timestamp" : "12:14-12:24",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I guess he kept those blinders on while he was watching these games that he's commentating. I love it. So yeah That was just for you boys. I knew you'd like that. That's such bullshit too.",
    "timestamp" : "12:25-12:35"
  },
  {
    "text" : "Keep the blinders on. Like, give me a break, dude. He was clearing some holes in that highlight clip though.",
    "timestamp" : "12:35-12:42",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "12:42-12:46",
    "text" : "They were okay. I mean people 70s football. Oh 70s football, yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "12:46-12:51",
    "speaker" : "Greg",
    "text" : "They probably didn't even let black people play back then, Steve. Jesus Christ."
  },
  {
    "timestamp" : "12:56-13:03",
    "text" : "All right. Let's talk about this game then. Greg, uh actually I I I need to ask you this. Did you watch the game?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "13:03-13:19",
    "text" : "Uh parts of it. I watched the the beginning and then the la well I obviously watched the game live, so no big deal. That little fucking TV. Fifty yard line, no big deal.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "So he didn't watch it is the short answer. He watched the highlights and and then",
    "timestamp" : "13:22-13:26"
  },
  {
    "text" : "I don't need to watch it again. Once you've seen it live, nothing compares.",
    "speaker" : "Greg",
    "timestamp" : "13:26-13:29"
  },
  {
    "timestamp" : "13:29-13:32",
    "speaker" : "Steve",
    "text" : "What do you remember? What do you remember actually from this game? Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "From the highest. Oh my god, Andy, you should have this crowd just you think you TV doesn't do it justice, what it was like being there.",
    "timestamp" : "13:33-13:40"
  },
  {
    "timestamp" : "13:40-13:41",
    "text" : "They were allowed.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "13:41-13:42",
    "speaker" : "Greg",
    "text" : "It was incredible."
  },
  {
    "speaker" : "Andy",
    "text" : "Foxbro old Foxbro. They got wrapped up.",
    "timestamp" : "13:42-13:44"
  },
  {
    "text" : "I don't know where we got the tickets from, but how far up were you? Oh no shit. So they're like really good. It was just really good seats.",
    "timestamp" : "13:46-13:58",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I mean, yeah. I feel like I sat in those same seats for the Cardinals game, my first Patriots game. Yeah.",
    "timestamp" : "13:58-14:04",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:05-14:07",
    "text" : "In two thousand and like two thousand and what?"
  },
  {
    "text" : "Eight.",
    "speaker" : "Steve",
    "timestamp" : "14:08-14:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it was the Matt Castle season.",
    "timestamp" : "14:09-14:11"
  },
  {
    "speaker" : "Steve",
    "text" : "Dad went a decade before taking me to a Patriots game. I mean that feels about right too. Yeah, oh yeah. Middle middle son. Who cares? I took him to a Bruins game, that's fine.",
    "timestamp" : "14:12-14:22"
  },
  {
    "speaker" : "Greg",
    "text" : "Well you were you weren't as as emotionally invested as I was though, Steve.",
    "timestamp" : "14:22-14:25"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "14:26-14:35",
    "text" : "For sure. Yeah, you were you were way into it. Oh yeah. I was at that point. Yeah. Because I went to the game in '97 as my first Bruins game. That's a fleet center."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "14:35-14:35",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:36-14:42",
    "speaker" : "Steve",
    "text" : "Makes sense. And Andy was a Red Sox son. Andy is a Red Sox son. I was a Bruin son. You were the Patriots son."
  },
  {
    "timestamp" : "14:42-14:48",
    "text" : "This is true, yeah. Yeah, I got pulled out of dad told me fifth grade. He took me to a a Red Sox game.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That's sweet. Taking you out of school?",
    "timestamp" : "14:48-14:50"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Like three three C three rows up from like just behind home plate, like where the um the the netting is, just outside the netting. I think you got him from a guy at work. I'm gonna do that one.",
    "timestamp" : "14:50-15:00"
  },
  {
    "speaker" : "Greg",
    "text" : "And he still remembers that and brings it up. I used to say that too. I used to say this was the best day of my life.",
    "timestamp" : "15:04-15:10"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "15:10-15:18",
    "text" : "No, I was like, yeah, that's fine I did write a book about it though. I have a book I wrote about the trip to and I have to still tick I still have the ticket."
  },
  {
    "speaker" : "Andy",
    "text" : "Hell yeah. The things you remember. So take your children to sporting events, even if they're the 83 Patriots and they're fussing around. Uh yes.",
    "timestamp" : "15:19-15:30"
  },
  {
    "text" : "Blow up dolls. Yep. Then your conservative British grandmother has to sleep with the infant and go sit in the car while your parents finish the game and has to watch people just take pisses around around her.",
    "speaker" : "Steve",
    "timestamp" : "15:30-15:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Tough life.",
    "timestamp" : "15:43-15:44"
  },
  {
    "timestamp" : "15:46-15:51",
    "speaker" : "Steve",
    "text" : "Speaking of football. The game was sweet though. I don't blame mom and dad for not leaving because this game was awesome."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:52-15:54",
    "text" : "Yeah, that well, yeah, this isn't the one that's."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, never mind.",
    "timestamp" : "15:54-15:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so this game, um It was kind of the peak Drew Bletto, I would say. Um, this is where he kind of made his name as the Patriots savior at the time. Uh because he was that larger than life. Playing with, I think, pins in his finger at this point. Had it bandaged up and the commentators were talking about how he didn't even Uh like keep his hand warm cuz it was getting cold during the the game. Greg, how cold was it?",
    "timestamp" : "15:56-16:25"
  },
  {
    "timestamp" : "16:26-16:27",
    "speaker" : "Greg",
    "text" : "43 degrees"
  },
  {
    "text" : "How how cold did it feel?",
    "speaker" : "Andy",
    "timestamp" : "16:28-16:30"
  },
  {
    "timestamp" : "16:30-16:30",
    "text" : "Mmm.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Mmm.",
    "timestamp" : "16:31-16:31"
  },
  {
    "timestamp" : "16:32-16:33",
    "speaker" : "Steve",
    "text" : "Do you remember being cold?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "16:34-16:37",
    "text" : "No. I was shit based drunk though."
  },
  {
    "text" : "You were like seven. You're thinking about the Denver game.",
    "speaker" : "Andy",
    "timestamp" : "16:38-16:44"
  },
  {
    "speaker" : "Greg",
    "text" : "I was drunk on love of the game, Andy. Of course.",
    "timestamp" : "16:44-16:47"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "16:47-16:47",
    "speaker" : "Andy"
  },
  {
    "text" : "Nothing could have made me cold.",
    "timestamp" : "16:48-16:49",
    "speaker" : "Greg"
  },
  {
    "text" : "But yeah, so and like I said, last week the he had on Monday night against the Dan Marino Dolphins, he had engineered a comeback. Uh With a broken finger and um Pete Carroll tried to call a timeout and Drew Bledsoe didn't even notice and he kept on going and threw the winning touchdown.",
    "speaker" : "Andy",
    "timestamp" : "16:50-17:08"
  },
  {
    "speaker" : "Greg",
    "text" : "Or ignored him. That's what they said in the broadcast, which I really appreciated. I hope he ignored him.",
    "timestamp" : "17:08-17:14"
  },
  {
    "speaker" : "Andy",
    "text" : "So do I. If we ever have Drew Blood Solan, we'll ask him if he ignored Pete Carroll on that play. Um uh yeah, and threw a touchdown to Sean Jefferson, some great names. Uh and then uh did not practice this entire week, they said. Uh threw some warm-up passes just to see if he could in the pregame warm-ups. And what did they say? Steve, do you remember what they said about it? Um, about how they were watching it",
    "timestamp" : "17:14-17:44"
  },
  {
    "speaker" : "Steve",
    "text" : "No, I said they I heard they didn't take a snap all week, but not what they said.",
    "timestamp" : "17:45-17:48"
  },
  {
    "text" : "Yeah, but then they're like, oh, uh everybody was watching his pregame warm-ups like I don't even remember what it was. Oh yeah, yeah. Awful analogy, but whatever.",
    "timestamp" : "17:48-17:57",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "17:59-18:01",
    "text" : "They broadcast it on Instagram.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Everyone was very I'm trying I'm trying to set Steve up for like some interesting knowledge, but apparently he didn't fucking watch the game either.",
    "timestamp" : "18:01-18:06"
  },
  {
    "timestamp" : "18:06-18:15",
    "speaker" : "Steve",
    "text" : "So I did watch the game. I watched most of it. I watched until that YouTube video ran out and then I watched the last two drives. Oh, that's where the Bills scored and the Pitches scored. Yeah, that's my third cool."
  },
  {
    "speaker" : "Greg",
    "text" : "If my first game I had to watch Scott Zolak play, I probably wouldn't be here on this podcast right now",
    "timestamp" : "18:15-18:21"
  },
  {
    "speaker" : "Andy",
    "text" : "So that's not true. So I went back and looked at the um at at the uh Boston Globe for for the day before and the day after the game. Oh the day of the day after the game. Sweet. And um there was uh an article about like is this Scott Zolak's time to shine? Because he's this was his contract year. Um his contract is gonna run out at the end of this year. And um he's gonna be a free agent and you know he's had like zero starts basically up until this. He's just played like mop-up duty. And so, you know, is this his time to to show that he can be a starting quarterback and go make some starting quarterback money in free agency?",
    "timestamp" : "18:21-19:04"
  },
  {
    "timestamp" : "19:04-19:19",
    "speaker" : "Greg",
    "text" : "Um Spoiler alert, the answer was no. It was not his time to shine. Correct. Well, he does come 30 years later when he's someone caught him snorting lines on fucking Live radio. What?"
  },
  {
    "speaker" : "Andy",
    "text" : "I did not hear about this.",
    "timestamp" : "19:20-19:21"
  },
  {
    "text" : "Oh well.",
    "timestamp" : "19:22-19:22",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "How long ago is this? I don't remember either. Don't allow it leave this bug. We'll bleep that out. Bleep that out. Sure we will. And he only plays one more year after this, so maybe there's something to that.",
    "timestamp" : "19:23-19:34"
  },
  {
    "text" : "Yeah. I think Greg just cracked the case. Um But in true Drew Bledsoe fashion, his first pass of this game, deep bomb floated to the uh the free safety, picked up. Oh yeah. It was like two on one. He threw it to the one guy. Yeah, bro. Yeah. Can of coral with that.",
    "speaker" : "Andy",
    "timestamp" : "19:35-19:51"
  },
  {
    "text" : "I mean he's got a broken finger. You really can't.",
    "speaker" : "Steve",
    "timestamp" : "19:51-19:53"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it it floated on him, and the second one probably should have been picked off, but that floated on him too, so it ended up out of a few.",
    "timestamp" : "19:54-19:58"
  },
  {
    "timestamp" : "19:58-20:01",
    "speaker" : "Steve",
    "text" : "It took him a little while to find the touch, but he found the touch perfectly."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:03-20:31",
    "text" : "Absolutely. So uh yeah, they this was a uh a quality game. It's kind of started off a little slow. It was all Bills early, and apparently these two teams have played two weeks before. And the Bills basically just stomp the Patriots. They rush for 213 yards or something ridiculous. Once everybody's like, oh, they're gonna do it again. There's Thurman Thomas and I don't know if he's a rookie, but a young Antoine Smith, like prime Antoine."
  },
  {
    "speaker" : "Steve",
    "text" : "He was awesome.",
    "timestamp" : "20:32-20:33"
  },
  {
    "timestamp" : "20:33-20:39",
    "speaker" : "Andy",
    "text" : "Yeah, and he was he was your typical Antoine that you would expect. That you probably remember from 2001, right?"
  },
  {
    "text" : "Yeah, exactly. He's the same guy except faster.",
    "speaker" : "Steve",
    "timestamp" : "20:40-20:42"
  },
  {
    "timestamp" : "20:42-20:50",
    "speaker" : "Andy",
    "text" : "Yeah, yeah. But you know, he's the one he he was the kind of their short yardage back and At this point they're using Thurman Thomas as like the third down back kind of guy."
  },
  {
    "text" : "Thurman Thomas is like this is gonna be like one of his last seasons.",
    "speaker" : "Steve",
    "timestamp" : "20:50-20:53"
  },
  {
    "timestamp" : "20:53-20:59",
    "text" : "Yeah, I think he he goes one more season with the Dolphins after this. His last season with the Bills, and then he's done",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I did not know Thurman Thomas played for the Dolphins.",
    "timestamp" : "20:59-21:01"
  },
  {
    "timestamp" : "21:02-21:21",
    "text" : "One year he did, yes. Where else did Ben Coates play? Trivia. Ooh, I don't know. Uh hint, he won a Super Bowl with his team. What? The Broncos? Nope. Oh, uh the Ravens. The Ravens. Also, Sam Gash won a Super Bowl on that same team.",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh shit.",
    "speaker" : "Andy",
    "timestamp" : "21:21-21:22"
  },
  {
    "speaker" : "Greg",
    "text" : "No shit. Good trivia.",
    "timestamp" : "21:22-21:24"
  },
  {
    "text" : "That is great trivia.",
    "speaker" : "Steve",
    "timestamp" : "21:25-21:26"
  },
  {
    "timestamp" : "21:26-21:29",
    "speaker" : "Andy",
    "text" : "I like that. Nicely done. Speaking of Ben Coats in this game though."
  },
  {
    "timestamp" : "21:29-21:33",
    "speaker" : "Steve",
    "text" : "Wait, so how many rings does Ben Coates have? He has just the one the one."
  },
  {
    "speaker" : "Greg",
    "text" : "Just the one with the Ravens? Wow. Did the old Ray Bork spend a shit ton of time in New England and then leave and immediately win a championship? Yes.",
    "timestamp" : "21:34-21:41"
  },
  {
    "speaker" : "Andy",
    "text" : "Hey. I mean I'm sure everybody was happy for him at the time.",
    "timestamp" : "21:42-21:45"
  },
  {
    "timestamp" : "21:45-21:46",
    "speaker" : "Greg",
    "text" : "Well deserved."
  },
  {
    "timestamp" : "21:46-22:02",
    "speaker" : "Andy",
    "text" : "Yeah, you gotta do it. For sure. Uh speaking of Ben Coats though, he had uh himself a game in this. This was, you know, pre-gronk and he looked like it. But the commentators were all about how much he pushed off."
  },
  {
    "timestamp" : "22:02-22:02",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Talking about how the defensive backs don't know if they need to like train in Taekwondo or lift weights or whatever to be able to cover bank coats because All he does is run at defenders, hit him, bounce off, and then turn around because he's open.",
    "timestamp" : "22:02-22:15"
  },
  {
    "timestamp" : "22:15-22:43",
    "speaker" : "Greg",
    "text" : "Yeah. I have a take on tight end names. Okay. Best best names in football, no? I got a couple written down here before you answer. Single syllable, sick last name, okay? Ben Coates. Yeah. Jay Remersma. That's the one I was going with. Rob Gronkowski. Pat Fryermouth. Gary the Barnyard Dog Barnage."
  },
  {
    "text" : "Who the fuck is that? Okay.",
    "timestamp" : "22:44-22:46",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "22:47-22:53",
    "text" : "Played for Cleveland for like he had one good fantasy year and everybody I just love the name the barnyard dog."
  },
  {
    "timestamp" : "22:53-23:08",
    "speaker" : "Andy",
    "text" : "That's really good. Ron Rutledge Yeah, dude. Jermaine Wiggins. I still yeah, I still think uh fullbacks have better names. Zach Strong, Sam Gash."
  },
  {
    "text" : "Natron Means Natron Means went to the same college as Ben Coates. What college did I go to? Livingstone College. All right. Where's that? North Carolina. It's H B C U.",
    "speaker" : "Greg",
    "timestamp" : "23:08-23:23"
  },
  {
    "text" : "Alright. Where in North Carolina is it?",
    "timestamp" : "23:24-23:26",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh don't know. Don't you live in North Carolina, Greg? Yeah, I never heard of it. I read it, but I didn't it was it did not I didn't even know Livingstone was a college year. I don't even know if it still is a college year, if I'm being honest. Sounds like it'd be a stat check then. He's from Hendersonville, though, which is a pretty popular place. I've been there.",
    "timestamp" : "23:27-23:50"
  },
  {
    "timestamp" : "23:50-23:57",
    "speaker" : "Andy",
    "text" : "All all our all our New England um pages fans will know all about Henderson. North Carolina."
  },
  {
    "timestamp" : "23:57-24:00",
    "text" : "Was that uh Pages fans got fans everywhere?",
    "speaker" : "Steve"
  },
  {
    "text" : "Hey, do you know how many Patriots fans are in North Carolina, Andy?",
    "speaker" : "Greg",
    "timestamp" : "24:01-24:04"
  },
  {
    "timestamp" : "24:04-24:06",
    "text" : "Yeah, like seven.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "24:06-24:09",
    "speaker" : "Greg",
    "text" : "No. Dude, we have a bar."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh my god.",
    "timestamp" : "24:09-24:10"
  },
  {
    "speaker" : "Steve",
    "text" : "Who's the uh Patriots player that lives that there all the time, Greg?",
    "timestamp" : "24:10-24:14"
  },
  {
    "timestamp" : "24:14-24:14",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "24:15-24:16",
    "speaker" : "Andy",
    "text" : "Antoine Harris."
  },
  {
    "text" : "Yeah. Yes. NFL legend.",
    "timestamp" : "24:16-24:20",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh yeah, if he wants to come on the pod, we will definitely have Antoine Harris on the pod.",
    "speaker" : "Andy",
    "timestamp" : "24:20-24:24"
  },
  {
    "speaker" : "Greg",
    "text" : "No, you just fucking slam North Carolina like that.",
    "timestamp" : "24:24-24:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, you're from there. I'm slamming you, not North Carolina.",
    "timestamp" : "24:27-24:31"
  },
  {
    "text" : "Fuck you, Andy.",
    "speaker" : "Greg",
    "timestamp" : "24:32-24:32"
  },
  {
    "speaker" : "Andy",
    "text" : "Natron means. Natron means business. Natron re-fried means. That's a good one.",
    "timestamp" : "24:33-24:39"
  },
  {
    "speaker" : "Greg",
    "text" : "That is good one.",
    "timestamp" : "24:39-24:40"
  },
  {
    "timestamp" : "24:40-24:43",
    "speaker" : "Andy",
    "text" : "Then when I prefer that over nature means business."
  },
  {
    "timestamp" : "24:43-24:55",
    "speaker" : "Greg",
    "text" : "And all-time Burmanism. Yeah. Also I tried to look up the VI one for Sam Gash. Oh no. And nothing out there."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:58-25:24",
    "text" : "So what'd you come up with then, Greg? I need a list. Uh all right. Uh speaking of running backs, uh let's talk a bit about Robert Edwards. Because he was supposed to be an at I think this specific year, 1998, he was. The second coming of uh Curtis Martin."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. 1500 yards, 13 touchdowns. I thought that's I thought that Robert Edwards was my original David Gibbons.",
    "timestamp" : "25:24-25:33"
  },
  {
    "text" : "Hmm. Yeah, I can see that.",
    "speaker" : "Andy",
    "timestamp" : "25:33-25:34"
  },
  {
    "speaker" : "Steve",
    "text" : "I was trying to find the guys that I everybody loved, but that were like up and coming. And I was those really in on both those guys.",
    "timestamp" : "25:37-25:43"
  },
  {
    "timestamp" : "25:43-25:44",
    "speaker" : "Andy",
    "text" : "Yeah, that would have done it."
  },
  {
    "speaker" : "Steve",
    "text" : "Because he was good this year. He was Okay in this game, but like if Robert Edwards had played in today's game, he'd be really good. You know? He'd catch the ball. He could catch the ball. He's pretty shaky in the hole. He didn't have that like Antoine Smith type power. That's true. Which Curtis Martin sort of did. Yeah. The first round draft pick out of Georgia.",
    "timestamp" : "25:44-26:06"
  },
  {
    "text" : "Yeah. He also started uh his career with a touchdown in six straight games. His first six games you scored a rushing touchdown.",
    "timestamp" : "26:06-26:13",
    "speaker" : "Andy"
  },
  {
    "text" : "Thirteen touchdowns for rookies, no joke. No joke. Well he's clearly Pro Bowl because he went to the Pro Bowl.",
    "timestamp" : "26:13-26:21",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Right, that just didn't go to the Pro Bowl.",
    "timestamp" : "26:21-26:23"
  },
  {
    "speaker" : "Steve",
    "text" : "Wait, how'd he shred his knee? Yeah.",
    "timestamp" : "26:24-26:25"
  },
  {
    "speaker" : "Greg",
    "text" : "It was like some fucking event. Like he wasn't actually on the Pro Bowl roster. He just went to this fucking Beach party Pro Bowl thing that they were doing.",
    "timestamp" : "26:26-26:35"
  },
  {
    "timestamp" : "26:35-26:36",
    "speaker" : "Andy",
    "text" : "No shit. Oh no."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:40-26:44",
    "text" : "Makes it even worse. He didn't even make it. That makes it way worse. Oh, that's tough."
  },
  {
    "timestamp" : "26:44-26:44",
    "text" : "That is tough.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:45-26:48",
    "speaker" : "Greg",
    "text" : "Do you want to hear what his injury was? Uh I doubt it, but okay."
  },
  {
    "timestamp" : "26:49-26:50",
    "speaker" : "Andy",
    "text" : "How gross is it?"
  },
  {
    "speaker" : "Greg",
    "text" : "So there's also some interesting names. So the guy that threw him the ball was noted dickhead Charlie Batch.",
    "timestamp" : "26:51-26:59"
  },
  {
    "timestamp" : "27:01-27:03",
    "speaker" : "Steve",
    "text" : "Threw a fucking So it's his fucking fault."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "27:03-27:04",
    "text" : "Yeah, a joke."
  },
  {
    "timestamp" : "27:04-27:06",
    "speaker" : "Steve",
    "text" : "If he threw him a better ball, he probably doesn't"
  },
  {
    "timestamp" : "27:08-27:23",
    "text" : "And Charles Woodson went up for it. It was like he got tangled up with Charles Woodson on a beach, obviously. We all know the story. Came down, hyperextended his knee. He tore his ACL, his MCL, and his PCL and partially tore his LCL.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "27:23-27:27",
    "text" : "What the fuck? I didn't know there was that many ligaments in there. Yeah, what is the what are those?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "27:27-27:51",
    "text" : "That's basically every limb, every ligament in your knee. Oh he had major ner nerve damage and the the worst part was that he sliced an artery in his knee. So they were talking about uh amputation. Yeah Yeah. So they said if the sutures hadn't held on the way to the hospital, they cause they sutured it up, that they would have amputated and he never would have walked again.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "27:51-27:56",
    "text" : "Holy fuck. We see him again in the Chiefs. Yeah."
  },
  {
    "text" : "No, uh, with the dolphins. I think it was like oh two maybe.",
    "speaker" : "Andy",
    "timestamp" : "27:56-28:00"
  },
  {
    "timestamp" : "28:00-28:10",
    "speaker" : "Greg",
    "text" : "Dude, he came back played a couple seasons in the NFL, didn't really catch on, then went to Canada and 2,000 yard seasons for Montreal Argonauts."
  },
  {
    "timestamp" : "28:10-28:11",
    "speaker" : "Andy",
    "text" : "Fuck yeah. Good for him."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "28:11-28:12",
    "text" : "No way."
  },
  {
    "timestamp" : "28:12-28:14",
    "speaker" : "Andy",
    "text" : "That's exciting."
  },
  {
    "text" : "Oh, came back on the patch and then they immediately cut him.",
    "speaker" : "Greg",
    "timestamp" : "28:14-28:17"
  },
  {
    "text" : "You gotta give him another look. Yeah, well, you know. If going through that rehab, that's gotta be an absolutely insane rehab. I mean that was yeah yeah. I mean that's gotta be so painful like oh well in the book that C was talking about they're talking about the Drew Bledsoe injury and it was",
    "timestamp" : "28:19-28:35",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh he basically had blood in his lungs.",
    "timestamp" : "28:36-28:39"
  },
  {
    "timestamp" : "28:39-28:40",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "28:40-29:14",
    "speaker" : "Andy",
    "text" : "And so they they may have like uh usually when things like this happen, you have to like cut open the the pec muscle to go in and like kind of clean things up. Um or it what maybe wasn't in the lung, but it was like around the lung, so it was like collapsing the lung. And so what they try to do is basically just like They they put a tube in and pump the blood out of his lungs and back into like where it was supposed to be. And basically if that didn't work, they would have had to like cut in and like Go get it, but then that would basically be the muscles that you use to throw football and he never would have played again."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:14-29:14",
    "text" : "Yep."
  },
  {
    "text" : "So he was like Inches away from never playing football again.",
    "timestamp" : "29:14-29:18",
    "speaker" : "Andy"
  },
  {
    "text" : "That's not that fucking open. Kyrie Irvin's taking like six to seven maintenance days a season. It's like, Jesus Christ. You're just gonna not get vaccinated so it's to play half the games.",
    "timestamp" : "29:18-29:29",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "29:29-29:32",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, he doesn't even get to play games in Brooklyn anyway."
  },
  {
    "speaker" : "Steve",
    "text" : "That's why he's doing it. Jesus Christ. Yeah, true buds have gutted this game out though.",
    "timestamp" : "29:32-29:39"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "29:39-29:40",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:40-29:50",
    "speaker" : "Steve",
    "text" : "And that's like that was his no one ever said Drew Bledsoe is not tough. That guy was a tough motherfucker. He really was. He just took too many shots. Like Ben Rothesberger."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, he was just uh one of those guys who Yeah, he he could he just I I feel like his pocket awareness always let him down. Um that's a good point. And then he would try to do two. I mean how many he took a a couple of sacks. He took four sacks in this game. And I'd say at least two, maybe three of them were preventable. Where you could have just thrown the ball away, but he's like waiting for something to happen, waiting for something to happen takes a second. Oh, come on, man.",
    "timestamp" : "29:50-30:19"
  },
  {
    "text" : "Their offensive line wasn't great besides Dave Wallabaugh. All time New England name right there.",
    "speaker" : "Steve",
    "timestamp" : "30:19-30:27"
  },
  {
    "speaker" : "Andy",
    "text" : "Dave Wallaba. Let's take a look.",
    "timestamp" : "30:27-30:29"
  },
  {
    "timestamp" : "30:31-30:40",
    "speaker" : "Steve",
    "text" : "Yeah, Bruce is he's also on the private. They've been going at it for fucking decades."
  },
  {
    "text" : "Oh yeah, exactly. Damien Denson, who I believe was starting his first ever game at left guard, Dave Wallabaugh, Todd Rucci and Max Lane. You remember Max Lane?",
    "timestamp" : "30:40-30:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "30:50-30:50"
  },
  {
    "text" : "Also a great name for uh uh an offensive lineman, Max Lane. No, not you don't want to run behind a guy that's Max Lane. Fuck yeah.",
    "timestamp" : "30:51-30:57",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "30:58-31:02",
    "speaker" : "Steve",
    "text" : "No, you want pass rush against a guy who's Max Lane. Exactly, right to the quarterback."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "31:02-31:03"
  },
  {
    "text" : "You want to run behind that.",
    "timestamp" : "31:03-31:04",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Maximum lane.",
    "timestamp" : "31:04-31:05"
  },
  {
    "timestamp" : "31:05-31:16",
    "speaker" : "Andy",
    "text" : "But Drew Bledsoe in this game, 28 of 43, 246, three touchdowns, one pick for sex. Not too shabby. Outplayed by Doug Floody, though."
  },
  {
    "timestamp" : "31:16-31:21",
    "speaker" : "Steve",
    "text" : "How many rushing yards did uh Robert Davids have? Because it was pretty much on Drew, I feel like."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh 13 carries, 40 yards.",
    "timestamp" : "31:22-31:23"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:24-31:30",
    "text" : "Yeah. Yeah, it's all Drew. They had Sam Adams, who's an absolutely massive Ted Washington."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "31:32-31:32",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "31:32-31:33"
  },
  {
    "text" : "But I mean, even Armstrong though, versus Bruce Smith Yeah. Because this is the peak of their battles. Is it? Yeah. Bruce Armstrong made the Pro Bowl in ninety, ninety one, ninety-four, ninety-five, ninety-six, and ninety-seven. Okay. And we're currently in ninety-eight. Bruce Smith, his fucking career is insanity. He made the Pro Bowl in 87, 88, 89, 90, 92, 93, 94, 95, 96, 97, 98. And first team all pro in 87, 88, 90, 93, 94, 95, 96, 97.",
    "timestamp" : "31:33-32:11",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Bruce Smith was outright.",
    "timestamp" : "32:12-32:15"
  },
  {
    "timestamp" : "32:15-32:19",
    "text" : "So this is on the back side, the back nine of their careers, though.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "32:19-32:28",
    "speaker" : "Greg",
    "text" : "Like not both of them really like coming in. They're about to go into their back nine, but they both have made the Pro Bowl the last four years. Yeah. For both of them."
  },
  {
    "timestamp" : "32:28-32:40",
    "speaker" : "Andy",
    "text" : "Bruce Smith from '86. To 98. Uh there was one year where he didn't top double-digit sacks."
  },
  {
    "text" : "All time leading sack leader. 200 sacks.",
    "timestamp" : "32:40-32:43",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "32:43-32:45",
    "text" : "He wasn't that big in this game though, right?"
  },
  {
    "speaker" : "Andy",
    "text" : "No, he didn't do a lot. Bruce Armshell?",
    "timestamp" : "32:46-32:47"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, he got he got us one half a sack. Our Bruce got him on this one. Yeah.",
    "timestamp" : "32:47-32:53"
  },
  {
    "timestamp" : "32:53-32:56",
    "speaker" : "Andy",
    "text" : "In 1990 he had 19 sacks. 19."
  },
  {
    "timestamp" : "32:57-33:17",
    "speaker" : "Greg",
    "text" : "He had an even 200 for his career. And to put it in reference of like a player, a modern day player that you'd recognize, Dwight Freeni had 126 and a half. Who yeah. Yeah. So two hundred experts a fucking ridiculous number. Yeah. Unbelievable."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. The Bills always had good players. I mean their receivers in this game were so good. You know, they had so many awesome names in their receiver. It was like Andre Reed's 200th catch? Some shit like that. Something like that. No, 220 games for Andre Reed. Oh yeah.",
    "timestamp" : "33:17-33:34"
  },
  {
    "text" : "And had Arnold Molds on your other side, who was being covered by Ty Law. And on the first play of the game, Ty Law went over and uh dapped him up. And we saw him kind of like shake hands before the first play, just kind of, you know.",
    "timestamp" : "33:35-33:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:47-33:56",
    "speaker" : "Steve",
    "text" : "He had that absolutely sick catch. Yeah. So that was that was an amazing ground."
  },
  {
    "text" : "Yeah, the the eighty-five yard touchdown where he kind of One hand snagged it between Ty Law and the safety and outran the other safety for an 85-yard touchdown.",
    "speaker" : "Andy",
    "timestamp" : "33:57-34:07"
  },
  {
    "text" : "But he caught it like it wasn't like the tip of the ball hit his palm. It was like the flat part of the ball hit his palm. He just kind of like grabs it like a bunch of bananas and then just runs.",
    "timestamp" : "34:07-34:16",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "34:16-34:17",
    "speaker" : "Andy",
    "text" : "Just snagged it one yeah."
  },
  {
    "text" : "Just and then he's just gone. Yeah. Just outruns everybody. Tylaw's busts an ass, can't catch him. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "34:18-34:24"
  },
  {
    "text" : "Which I mean Tylaw, this is I think Greg peaked Ty Law as well. Yeah. Tylaw's absolutely seven picks coming into this game already, and it's week 13 Yeah, so you're gonna pick every other game. Did not have their D one.",
    "timestamp" : "34:24-34:36",
    "speaker" : "Andy"
  },
  {
    "text" : "Their D-line was kind of nobody's the linebackers they had some names. Secondary had two Hall of Famers. Yeah. And then some no names. Steve Israel. Don't remember him at all. I don't remember the guy in a minute. He was all over this broadcast.",
    "timestamp" : "34:36-34:53",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, you remember him, dude? He's the guy that was from uh Jerusalem.",
    "timestamp" : "34:53-34:56"
  },
  {
    "speaker" : "Steve",
    "text" : "Yes, Greg. Oh, oh yeah, now that you say that. There's also um Mike Lombardi in the halftime show.",
    "timestamp" : "34:59-35:09"
  },
  {
    "timestamp" : "35:10-35:11",
    "speaker" : "Greg",
    "text" : "Oh yeah."
  },
  {
    "timestamp" : "35:12-35:18",
    "speaker" : "Steve",
    "text" : "He is I think he's come full circle and is back in the media, but he was on the Patriots front office."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:18-35:22",
    "text" : "He was a Patriots general manager or something along those lines. Yeah."
  },
  {
    "timestamp" : "35:22-35:30",
    "speaker" : "Steve",
    "text" : "He was after the kayak in the Patriots front office. Yeah, he was. It's kind of crazy to see him on the halftime of a 1998 show."
  },
  {
    "timestamp" : "35:30-35:31",
    "speaker" : "Andy",
    "text" : "Right, I know, yeah."
  },
  {
    "text" : "And the halftime show was way better because they actually showed highlights, you know. They did. They went game by game and showed some highlights from the important ones.",
    "timestamp" : "35:31-35:39",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, we didn't have Keyshawn Johnson just running his mouth for fucking 35 minutes.",
    "speaker" : "Greg",
    "timestamp" : "35:40-35:44"
  },
  {
    "speaker" : "Steve",
    "text" : "It's not even 35 minutes. It's like 35 seconds to go right back to commercial.",
    "timestamp" : "35:44-35:47"
  },
  {
    "timestamp" : "35:48-35:50",
    "speaker" : "Greg",
    "text" : "Yeah. Just making up what he's going to say on the spot."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Oh yeah. That sounds about right. Um, one of the other big notes in this, I don't know if you guys noticed, was um there was a huge push to bring back replay.",
    "timestamp" : "35:50-36:00"
  },
  {
    "timestamp" : "36:01-36:01",
    "speaker" : "Steve",
    "text" : "Yes."
  },
  {
    "speaker" : "Andy",
    "text" : "So I looked that up real quick and apparently like instant replay had been around for a long time Um but it was disbanded in 1991 because the technology basically couldn't keep up with it. It wasn't oh great. Um, so there seemed to be a lot of push and Steve going back to your point of like they actually showed replays at halftime. Uh, the highlights, rather. Uh the highlights, a lot of them revolved around here's a play that would have been overturned if there was replay, but it wasn't, and it affected the game in this way. Um, so uh it worked out in the Patriots' favor, I would say, in this game, because the Patriots on their game-winning drive Had a borderline completion to Sean Jefferson. Greg, was he in?",
    "timestamp" : "36:02-36:49"
  },
  {
    "text" : "Borderline, you weren't even close. Question. The problem is you can't tell with such crappy video quality. Well, that's what I'm saying.",
    "speaker" : "Steve",
    "timestamp" : "36:50-36:55"
  },
  {
    "text" : "Yeah, with with the with the feed that I had, I'm like, I'm gonna look at this, I'm gonna I'm gonna bring it to Greg and be like, hey, look, you can tell that this pixel, his foot is in bounds, but um You couldn't tell because both feet were one pixel. Um, so I'm not actually sure. But there was such an uproar that I assume it looked pretty clear to me that he didn't have a speed in. Of course it didn't because you're a pessimist. Yeah. And you hate the Patriots for some reason.",
    "timestamp" : "36:56-37:21",
    "speaker" : "Andy"
  },
  {
    "text" : "I said I couldn't tell. Maybe you guys should uh get your eyesight checked because it seemed pretty obvious to me.",
    "timestamp" : "37:22-37:27",
    "speaker" : "Greg"
  },
  {
    "text" : "Not that well you were sitting at the fifty yard line, we're watching it fucking YouTube.",
    "timestamp" : "37:27-37:31",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "37:32-37:40",
    "speaker" : "Greg",
    "text" : "That's true four years later. The whole stands were a chatter about it. I bet though I could see it from my seat, dude."
  },
  {
    "speaker" : "Andy",
    "text" : "N Um so uh yeah uh instant replay will be brought back in 1999, the season after this. Probably because of I think all the focus on all the plays that would have been overturned if there was replay.",
    "timestamp" : "37:37-37:52"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:52-37:56",
    "text" : "Jokes on them. Just go watch that Saints NFC Championship game."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, doesn't fucking matter.",
    "timestamp" : "37:56-37:57"
  },
  {
    "timestamp" : "37:57-38:02",
    "speaker" : "Steve",
    "text" : "Right? Oh, if this play had gone differently, maybe the game would have d gone differently."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:03-38:09",
    "text" : "We've come full circle again. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "That was fucking crazy.",
    "timestamp" : "38:10-38:11"
  },
  {
    "text" : "That was tough. So let's talk about this fourth quarter because this is like if you're gonna watch a game uh or you're not gonna watch highlights, just watch the end of the Like the fourth quarter.",
    "timestamp" : "38:11-38:23",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "38:23-38:24",
    "text" : "Yeah, ten minutes left."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:25-38:43",
    "text" : "Yeah. Bills march down basically from the start of the fourth quarter onwards. Um Marched down on a, let's see, 14 play, 67 yard touchdown drive. Helped out by two, three defensive penalties. A couple of pass interferences that were a little ticky tack."
  },
  {
    "speaker" : "Steve",
    "text" : "And a sweet Doug Flutie scramble. Oh yeah. Yeah. On third down to like reach and stretch and just barely make the line. Yeah. On like a third and nine. Yeah.",
    "timestamp" : "38:44-38:53"
  },
  {
    "speaker" : "Andy",
    "text" : "He's the man. He can't not love to be able to do that. Stretching all five foot six of him out to get that first down. Um so and the touchdown pass to who is it to? Andre Reid, the diving catch at the back of the end zone. It was super nice.",
    "timestamp" : "38:58-39:14"
  },
  {
    "timestamp" : "39:14-39:15",
    "text" : "Yeah, it's a nice play.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:16-40:03",
    "text" : "Um Paige get the ball back and miss a field goal. Adam Vinanteri miss field goal. So if Connor you're listening, that's your boy. Um to be fair, why they're going for a field goal down four points, that's you know, Pete Carroll. Um but the Pagers managed to hold the Bills to punting at the two-minute warning. So the Pace get the ball back with uh I think a minute 52 left after the punt. And drive 10 plays, 82 yards with the play that we just mentioned, the questionable fourth down conversion. Where uh Sean Jefferson, I'm gonna say gets both feet down because I'm a Patriots fan and uh leaning out of bounds catches the ball for the first down That was a fourth down. That was fourth down, yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:03-40:12",
    "text" : "Oh, I didn't even realize. With a running clock, then Ben Coates had caught the third down. No, he missed. No, he caught the third down, got tackled in bounds."
  },
  {
    "text" : "Yep.",
    "speaker" : "Andy",
    "timestamp" : "40:12-40:12"
  },
  {
    "speaker" : "Steve",
    "text" : "And they had no timeout, so they had to run set and then run the play real quick.",
    "timestamp" : "40:12-40:16"
  },
  {
    "timestamp" : "40:16-40:23",
    "text" : "Yep. And just barely converted it. Um and then I don't know if it was next play, a couple plays later.",
    "speaker" : "Andy"
  },
  {
    "text" : "No, so there's four seconds left after that That's right, yeah.",
    "timestamp" : "40:23-40:26",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "40:26-40:36",
    "text" : "So it was exactly the next place. They had one shot at the end zone, through the end zone, and there was a pass interference call in the end zone on Terry Glenn, whoever the the defender was, doesn't matter.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "40:36-40:41",
    "text" : "He he he gave Terry Glenn had a good look at it and the dude got pushed right in the back.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah. I mean it was you think it was a keeping ball?",
    "timestamp" : "40:42-40:45"
  },
  {
    "text" : "Even on the crap fucking video, yeah.",
    "timestamp" : "40:45-40:47",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "40:47-40:51",
    "text" : "I think I think it was a blatant pass inference, but you never call that. Doesn't matter.",
    "speaker" : "Andy"
  },
  {
    "text" : "Come on. If anything, you don't think that was a passing appearance? No, I didn't think it was on a Hail Mary, dude?",
    "speaker" : "Greg",
    "timestamp" : "40:51-40:57"
  },
  {
    "timestamp" : "40:57-41:20",
    "speaker" : "Steve",
    "text" : "Dude, he's not a Hail Mary, it's from the 20-yard line. It's a 20-yard pass. Dude, look at the look at the Yeah, I get there's a shitload of people there. It's a lot of it's a lot of traffic there, but it's not like a fucking absolute bomb from midfield where it's in the air forever. It's a jump ball. It was a no blood so fucking zing that thing and it was right to Terry Glenn and he got pushed right in the lower back and just fucking and he bent out."
  },
  {
    "text" : "I love that Steve's coming to my side. He used to be like taking sides",
    "timestamp" : "41:21-41:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "You don't want to do that? Fucking play the ball. He didn't play the ball. He pushed the receiver right in the back. And the judge was right there at the end zone line, because that's where the play was, because that's where he's got to see. And he sees the guy just get pushed right in the back.",
    "timestamp" : "41:25-41:37"
  },
  {
    "text" : "Of course it's a fly. You want to hear a quote from Ty Law himself?",
    "timestamp" : "41:37-41:41",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Mm-hmm.",
    "timestamp" : "41:41-41:42"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "41:42-42:00",
    "text" : "Okay. If I was them, I'd be ticked off too. You never see that that call on a Hail Mary, which it was. I know where they're coming from. These officials are making way too many calls. It's getting worse and worse every week. Tyla compl he's on the Patriots and he's completely agreeing that that's imagine that in this day and age."
  },
  {
    "timestamp" : "42:01-42:05",
    "speaker" : "Steve",
    "text" : "Imagine the Slot Shimita Firestorm with that Kind of comment."
  },
  {
    "timestamp" : "42:05-42:06",
    "speaker" : "Andy",
    "text" : "Twitter would melt down."
  },
  {
    "timestamp" : "42:06-42:24",
    "speaker" : "Steve",
    "text" : "Well, Belcheck A would never allow that. That's a Pink Carol kind of comment. You know? Oh yeah. That's a good point. B The rules are probably different back then as well. Where they're I mean, you saw in this game just rewatching it, how much they're glorifying hits and stuff. It's just like a little bit of a out of date."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:25-42:38",
    "text" : "There was a lot more um hitting in the defensive backfield just generally. Yeah. But there was still like I think even on the the the Bill such down drive, there was still some like Are you really gonna call that? Like this late of the game, you're gonna throw the flag there."
  },
  {
    "text" : "They had been calling it tight on the Bills drive. So Yeah, I don't think I've ever seen a pass interference on it. Hail Mary though, outside of this",
    "speaker" : "Greg",
    "timestamp" : "42:39-42:46"
  },
  {
    "timestamp" : "42:46-42:49",
    "speaker" : "Steve",
    "text" : "I feel like I guess I'm saying that's not Hail Mary."
  },
  {
    "timestamp" : "42:49-42:53",
    "speaker" : "Greg",
    "text" : "And I've seen some like pretty egregious like tackling of players on Hail Mary's."
  },
  {
    "text" : "Well the Eagles Super Bowl when they tackle Grongs.",
    "speaker" : "Andy",
    "timestamp" : "42:54-42:56"
  },
  {
    "timestamp" : "42:56-42:57",
    "text" : "Yeah, exactly.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "42:58-42:58",
    "speaker" : "Andy",
    "text" : "That was one."
  },
  {
    "text" : "That one's pretty that one's like egregious. The one where they tackle Gronk in the Super Bowl. Yeah. And I I like I wasn't even that mad about that because I was like, eh, it's fucking Hail Mary, that's what you got, you know. How far was the I feel like it wasn't a Hail Mary though. It was like 30 yards. Third yards not that long. Yeah, but Steve, it's a jump ball, right? It's a throw it up and everybody jumps to try and catch it.",
    "speaker" : "Greg",
    "timestamp" : "42:59-43:20"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, every ball Bledsoe throws is a jump ball.",
    "timestamp" : "43:20-43:23"
  },
  {
    "text" : "That's true, but you just cannot call a pass interference.",
    "timestamp" : "43:23-43:25",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Bro, I've got a broken finger, of course. Uh he actually slung this one in there. He was slinging it.",
    "timestamp" : "43:26-43:31"
  },
  {
    "text" : "Either way, Bledsoe came back and fucking",
    "timestamp" : "43:32-43:36",
    "speaker" : "Steve"
  },
  {
    "text" : "You can talk all you want. And you know, this is the same goes to like listening to Chief fans talk about, oh yeah, well, you know, if you he didn't lie, if what's his face didn't line up off size and that game's over. It's like, yeah, well The game, like the Patriots didn't win it on that play. Like you can still make the stops. You can still like make the stops in the in overtime. So the Bills had one play. They all they had to do was start the patriots for one play. With this vaunted defense with, you know, Bruce Smith and all those all the players on it.",
    "timestamp" : "43:37-44:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "44:06-44:10",
    "speaker" : "Greg",
    "text" : "Well they did stop there's no other players. And then there was a flag thrown, so they had to stop for another player."
  },
  {
    "speaker" : "Steve",
    "text" : "Belichick says, Greg, you gotta play every single play. Just like you know, this same thing came to bite us in the ass and we put Gronk out there on the Squid Kit coverage and Miami returned it for a touchdown. So you gotta play every single play in the game.",
    "timestamp" : "44:12-44:25"
  },
  {
    "speaker" : "Greg",
    "text" : "Steve is absolutely correct. I don't know how these officials are allowed to make those calls. What do you mean? They get paid.",
    "timestamp" : "44:26-44:32"
  },
  {
    "timestamp" : "44:35-44:51",
    "speaker" : "Andy",
    "text" : "Imagine that. Wade Phillips on the coach Wade Phillips doesn't understand. Well let's let's talk about that because the Patriots throw uh uh it's a Ben coat a touchdown of Ben Coates in back of the end zone. Great throw by sick play."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah absolutely I mean Lensoto Coates it's a classic they play action feet foot though yeah",
    "timestamp" : "44:52-44:59"
  },
  {
    "timestamp" : "44:59-45:06",
    "text" : "With a rusher at his feet, tosses it over the over the uh into the corner of the end zone, touchdown pink coats. With a fucking fingers too.",
    "speaker" : "Andy"
  },
  {
    "text" : "What a what a what a touch pass.",
    "timestamp" : "45:06-45:08",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So it's Bills 21, Patriots 23. Game's over. No time left. The Bills just walk off the field. There's still an extra point left to do. Uh and the Bill's like, nah, we're not coming back out, so fuck it. Um so the Patriots line up to kick the the field goal. Uh but the crowd starts chanting two, like go for two, go for two. And so they snap it directly at Invinateri who walks into the end zone for the two-point conversion.",
    "timestamp" : "45:09-45:34"
  },
  {
    "text" : "Oh, you started that, Greg? I started that chant.",
    "speaker" : "Greg",
    "timestamp" : "45:34-45:36"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:36-45:52",
    "text" : "Of course you did. Good job. Patriots twenty-five, Buffalo 21. Game. Question. And now the now the Patriots and and Bills are tied at seven and five. A couple games back of uh Miami and the Jets."
  },
  {
    "text" : "What about nowadays? Do they make you still kick the extra point? I feel like it's game over when score a touchdown, right?",
    "timestamp" : "45:52-45:57",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "45:57-46:02",
    "speaker" : "Andy",
    "text" : "They do because remember the um uh playoff game between the Saints and the Vikings."
  },
  {
    "text" : "No, they don't make you kick it.",
    "timestamp" : "46:02-46:03",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "46:03-46:12",
    "text" : "They did They made them come back out. And so they just like the vi the uh saints just sent out whoever the fuck like still was partially dressed and they just like stood there and they kicked their shoulders.",
    "speaker" : "Andy"
  },
  {
    "text" : "They don't they don't make you do it anymore.",
    "speaker" : "Greg",
    "timestamp" : "46:12-46:14"
  },
  {
    "text" : "I feel like overtime I don't. But no, I it literally happened.",
    "timestamp" : "46:15-46:19",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:19-46:36",
    "speaker" : "Greg",
    "text" : "No, there's like a rule of like there's something to do with like if there's If it doesn't change the outcome of the game, you don't have to do it. But like there's games where it's like one second left or something that they I find that hard to believe only because uh of the money embedding."
  },
  {
    "text" : "I think that's why they change it. Craig's right. Having to kick a useless extra point is way harder for Vegas. Yeah. They'd rather him just win outright, you know?",
    "speaker" : "Steve",
    "timestamp" : "46:37-46:46"
  },
  {
    "text" : "Yeah, maybe. Apparently this game was a three and a half point spread for the Patriots, too.",
    "timestamp" : "46:47-46:53",
    "speaker" : "Greg"
  },
  {
    "text" : "Which is strange. Really?",
    "timestamp" : "46:53-46:55",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:55-47:17",
    "text" : "No, no, pass a favor by one and a half. No, I see. I heard I've found conflicting reports on this. Did you? Uh-huh. I found two different sources that said it was a Patriots were favored by three and a half, and that this was part of the reason that they brought back review was because All these betters were all pissed off because they lost money on this game.",
    "speaker" : "Greg"
  },
  {
    "text" : "Interesting. Well, I I don't think it would have mattered either way, right? If it's one and a half or three and a half.",
    "timestamp" : "47:17-47:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:22-47:27",
    "speaker" : "Greg",
    "text" : "Yeah. No, well, because the two-point conversion is what changed it. If they kicked the field goal, they would have won by three."
  },
  {
    "speaker" : "Andy",
    "text" : "Well, I think the touchdown, regardless, if it's one and a half, the Pats now covered because they won.",
    "timestamp" : "47:27-47:33"
  },
  {
    "text" : "Right, if it's one and a half, it doesn't matter. But if the hats are favored by three and a half, then yeah.",
    "speaker" : "Greg",
    "timestamp" : "47:33-47:37"
  },
  {
    "text" : "You also gotta think that nineteen ninety-eight Vegas lines are probably not as well set as You know, 2022 Vegas lines. Maybe. A lot more data out there for them to analyze.",
    "timestamp" : "47:38-47:49",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That's fair.",
    "timestamp" : "47:49-47:50"
  },
  {
    "speaker" : "Steve",
    "text" : "That's true.",
    "timestamp" : "47:50-47:50"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:50-47:58",
    "text" : "You make a good point. All right. You got anything else you want to do best and worst? Sure. All right. Greg, you go first. Give me your best and worst."
  },
  {
    "timestamp" : "47:58-48:09",
    "speaker" : "Greg",
    "text" : "My best was just enjoying the crowd, being there in person. You know, you can't really put a price on that. It's a memory that I'll hold forever in my life that you guys won't hold in your lives."
  },
  {
    "text" : "Well, Andy.",
    "speaker" : "Steve",
    "timestamp" : "48:10-48:10"
  },
  {
    "timestamp" : "48:18-48:22",
    "speaker" : "Greg",
    "text" : "Uh my worst is Sam Gash. He's a little baby."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah?",
    "timestamp" : "48:22-48:23"
  },
  {
    "timestamp" : "48:23-48:23",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:24-48:25",
    "text" : "I bet you wouldn't say that's his face"
  },
  {
    "speaker" : "Greg",
    "text" : "Fuck Sam Gash. Come on down here.",
    "timestamp" : "48:26-48:29"
  },
  {
    "text" : "He'd still kick your ass.",
    "timestamp" : "48:29-48:31",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:31-48:48",
    "speaker" : "Greg",
    "text" : "Am I ticked off? You bleeping bet I'm ticked off. For that official to behave like that, that's just expl expletive. They cost us the game. What it comes down to is we had something stolen from us and we're ticked off. And apparently he was a big baby about getting cut by the Pats too."
  },
  {
    "text" : "Really?",
    "timestamp" : "48:48-48:49",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:49-48:55",
    "text" : "Or he like he like dedicated the rest of his career to like making the Patriots regret cutting him or some shit.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "How long was he on the Beatrice? That sounds like something that five years. That sounds like something that Element would do, you know? Just like or or even like a uh NFL dude. Even like uh Rodney Harrison, that's something he would do. You know, anything to get up for a game. Yeah, that's very Rodney. Yeah, it does feel very Rodney, right? So All right, Steve. Best and worst.",
    "timestamp" : "48:56-49:22"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh you go, Andy. I'm still figuring out mine.",
    "timestamp" : "49:23-49:25"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, my best was that they announced that um the special team coach in this game, uh who the special teams actually I thought did quite a good job, Dante Skarnekia. And my worst outside of um Greg getting to go those games out of me, which is some bullshit, um, was your typical Pete Carroll lack of um Not focused. Well that's the word I'm looking for. Lack of uh discipline, I guess. On the last drive, the fourth quarter the Bills had on on defense, they had like They had to call a timeout one. They had to burn a timeout because they had thirteen well they had 12 men on the field plus two running off when the snap was about to happen. And then like three plays later, there was a flag for twelve men on the field again.",
    "timestamp" : "49:26-50:10"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "50:10-50:11"
  },
  {
    "speaker" : "Andy",
    "text" : "And uh on top of Like um a couple of pass interference and a couple just like bullshit like penalties at right down at the end. It was just like I can see why the patients didn't keep them. This this is the this is the type of coach that would fucking throw it from the two-yard line with Marshall Lynch, right?",
    "timestamp" : "50:11-50:27"
  },
  {
    "timestamp" : "50:27-50:30",
    "speaker" : "Greg",
    "text" : "He's gonna be a Hall Fame coach. Do you think?"
  },
  {
    "text" : "Uh with college.",
    "timestamp" : "50:30-50:32",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. Uh fantasy hawks.",
    "timestamp" : "50:32-50:34",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:34-50:40",
    "text" : "Yeah, you put him right next to Dan Diodorf would be fine. In the fucking failures wing of the Hall of Fame. Steve."
  },
  {
    "text" : "Pete Carroll's going to go into broadcasting and still and Andy.",
    "speaker" : "Steve",
    "timestamp" : "50:42-50:45"
  },
  {
    "timestamp" : "50:45-50:51",
    "speaker" : "Andy",
    "text" : "He's going to be garbage. He's going to be a great broadcaster. You already hear it now. He's going to be awful. He's going to hear his gunshu the entire fucking time."
  },
  {
    "timestamp" : "50:51-50:55",
    "text" : "He is. My my worst is actually Patriot special teams, Andy.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:56-50:57",
    "text" : "Well go fuck yourself then."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "50:58-51:11",
    "text" : "There was that absolute dime punt hit by Tom Tupa They have balanced like three times in between the goal line and the one yard line and then they downed it and then the guy who's downing it had his foot in the end zone."
  },
  {
    "text" : "Uh actually they showed the replay. The reason they call it touchback is the ball literally bounced on the goal line and then came out. They That's why it was bullshit. So it was actually almost the perfect punt. Missed it by six inches. Tom Chupa, BT dubs, punting.",
    "timestamp" : "51:11-51:27",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:27-51:30",
    "speaker" : "Steve",
    "text" : "Yes. He had that was a great punt."
  },
  {
    "speaker" : "Andy",
    "text" : "What else he got?",
    "timestamp" : "51:30-51:31"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:32-51:53",
    "text" : "Uh there was a so it's like a two-play sequence here. All right. It was Robert Edwards trying to go over the pile. Not really his strength and getting immediately the ball popped out and then the ball f falls into a nineteen ninety-eight goal line pile. You know? Oh yeah. And like that was just an absolute."
  },
  {
    "text" : "It took it took like four and a half minutes to untangle who had the balls.",
    "timestamp" : "51:54-51:57",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:57-52:15",
    "speaker" : "Steve",
    "text" : "Yeah, yeah. It was like Yeah, and they're well look at the referee trying to pull it out. They didn't even announce who had it, so or they did and I missed it."
  },
  {
    "timestamp" : "52:15-52:17",
    "text" : "They did eventually, yeah, but it took a little while.",
    "speaker" : "Andy"
  },
  {
    "text" : "Whoever that was. Props because that was an old school fumble pile.",
    "timestamp" : "52:17-52:22",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "52:22-52:23"
  },
  {
    "speaker" : "Steve",
    "text" : "And then the next play was that Robert Edwards touchdown pass, because they're like Well, we ain't gonna run it in with Robert Edwards. So try and it was actually a really nice. It's like a night, it's like a recent play design, you know? Yeah, it was well too. Have Ben Code set a little screen for the linebacker trying to cover him and then run him right across the goal line and then zip it right to him Yeah. That was pretty cool. That was awesome.",
    "timestamp" : "52:23-52:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Cool. All right. Well, that'll do it for 1998. Thanks for uh taking the trip back in time with us, except for Greg.",
    "timestamp" : "52:45-52:52"
  },
  {
    "text" : "Even further back in time.",
    "timestamp" : "52:53-52:55",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. So next week, next episode, whenever that is, might not be next week. We'll be, we'll be back tonight 2004 in the AFC divisional game. Who are they playing, Greg?",
    "speaker" : "Andy",
    "timestamp" : "52:55-53:07"
  },
  {
    "speaker" : "Greg",
    "text" : "I thought we were doing our special edition Roe v. Wade episode next week. No, we're talking playoffs. More important things to talk about. Two thousand four divisional playoff game.",
    "timestamp" : "53:07-53:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:23-53:42",
    "text" : "No Indianapolis Colts. Coming to Gillette Stadium. Ah, the Colts. Really? Yeah, the red hot record setting Indianapolis Colts. So I believe this was their season where they had Three wide receivers, all with over a thousand ru uh receiving arts."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, yes. Yeah, very good. This is Bait and Manning's record breaking freshman year, right? We've been hearing about this all year about it.",
    "timestamp" : "53:43-53:49"
  },
  {
    "speaker" : "Greg",
    "text" : "Spare me, okay? I've heard all that before. Uh-huh.",
    "timestamp" : "53:50-53:56"
  },
  {
    "text" : "Well, you'll hear it all again next time on the Patriots Dynasty. Deja vu. We'll sweep in. Hill at it.",
    "speaker" : "Andy",
    "timestamp" : "53:56-54:05"
  }
]