[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "speaker" : "Mom",
    "timestamp" : "00:00-00:17"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "00:23-00:52",
    "text" : "Welcome back to the Patriots Dynasty Podcast. I am your host, Gregory Brown. And with me today, I have the two grunts of the podcast, Andy Brown. How are you doing, bud? Doing well. How are you, Greg? I'm doing great. It feels good to be in charge. Yeah. Yeah, I I I know. Do I get a mute button to sh to shut people up?"
  },
  {
    "text" : "Yeah, you're running the show, Greg. It's Freaky Friday episode.",
    "timestamp" : "00:52-00:55",
    "speaker" : "Steve"
  },
  {
    "text" : "Freaky Friday. So today, Andy, Mr. Busy, did not watch the game. This is correct. Meanwhile, I watched the highlights. Yeah, we'll see. Meanwhile I watched all Sixty minutes of this football game. God damn. This is a first.",
    "timestamp" : "00:56-01:20",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Mm-hmm.",
    "timestamp" : "01:20-01:20"
  },
  {
    "speaker" : "Steve",
    "text" : "No, this is a first regular season game, maybe.",
    "timestamp" : "01:21-01:24"
  },
  {
    "text" : "No, that that that I have not watched in Gregory Halls.",
    "timestamp" : "01:24-01:27",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:28-01:28",
    "speaker" : "Steve",
    "text" : "Yes, for sure."
  },
  {
    "timestamp" : "01:29-01:30",
    "speaker" : "Andy",
    "text" : "That's for sure."
  },
  {
    "speaker" : "Steve",
    "text" : "Easily. How the tides have changed.",
    "timestamp" : "01:30-01:34"
  },
  {
    "timestamp" : "01:34-01:49",
    "text" : "Indeed. Yeah. So Steve, how's your New Year's going? New Year, same shit. I'm also the only non-COVID positive. That is having a podcast today. Yeah. So far.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, well, yeah. I I honestly I my odds were on Greg getting at first because he seems to be the one who does the most shit.",
    "speaker" : "Andy",
    "timestamp" : "01:50-01:57"
  },
  {
    "timestamp" : "01:57-01:58",
    "speaker" : "Steve",
    "text" : "That's true."
  },
  {
    "speaker" : "Andy",
    "text" : "Like you're always like going places and doing stuff, traveling. I I definitely thought you would have gotten it first. So I am well impressed, Greg.",
    "timestamp" : "01:58-02:07"
  },
  {
    "text" : "Yeah, I live my life a quarter mile at a time, you know? This is what I mean, yeah.",
    "timestamp" : "02:07-02:11",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "02:12-02:16",
    "speaker" : "Steve",
    "text" : "Yeah. You're also the most susceptible, dude. If you think about the summer of the itis you had."
  },
  {
    "speaker" : "Greg",
    "text" : "Mmm. But outside the i the summer of the itis, I've been pretty healthy.",
    "timestamp" : "02:16-02:21"
  },
  {
    "text" : "That's true. Yeah. Yeah, I I rarely get sick, so but I think I'm like Mick Brown. When I get sick, I get absolutely pathetic.",
    "timestamp" : "02:22-02:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, you are kind of a baby.",
    "timestamp" : "02:31-02:33"
  },
  {
    "speaker" : "Steve",
    "text" : "Also, unlike Andy, I didn't even have symptoms, so clearly I'm a better brother here.",
    "timestamp" : "02:34-02:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:40-02:58",
    "text" : "Well, I don't know about that. That just means you didn't really get it. I went whole hog. I got I got full COVID. None of this like, oh I tested positive, but I don't not show any symptoms. I got the full cold symptoms, the full flu symptoms. I was out for two days."
  },
  {
    "timestamp" : "02:58-02:59",
    "speaker" : "Greg",
    "text" : "No boo."
  },
  {
    "speaker" : "Andy",
    "text" : "But I'm back. Oh, you poor thing. Poor little Andy Pandy.",
    "timestamp" : "02:59-03:04"
  },
  {
    "text" : "I'm gonna remember this, Greg, but from you get it, because it's definitely a matter of time. My immune system, I I play in the dirt, Andy. All right. My immune system has been through hell and back.",
    "timestamp" : "03:04-03:15",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:16-03:27",
    "text" : "Have you not seen the videos of me as a child literally sitting in a puddle playing cars in it? I invented playing in the dirt. Well, the results say otherwise."
  },
  {
    "text" : "And Buffalo is playing in the dirt at Buffalo.",
    "timestamp" : "03:28-03:30",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:32-03:33",
    "speaker" : "Andy",
    "text" : "Yeah, that's pretty fucking gross."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "03:33-03:38",
    "text" : "Yeah, you only embrace the dirt, Andy. I was born into the dirt."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, here we go.",
    "timestamp" : "03:39-03:40"
  },
  {
    "timestamp" : "03:41-03:55",
    "speaker" : "Greg",
    "text" : "All right. Week 11, 2004, Monday night football. The Patriots are at Arrowhead Stadium to take on the Dick Vermeel, Kansas City Chiefs."
  },
  {
    "timestamp" : "03:56-04:06",
    "speaker" : "Steve",
    "text" : "We got some good Dick Vermeel squint in this game that, you know, when he's all flustered. Maybe a little reaping, squinting, you know. Oh shit."
  },
  {
    "timestamp" : "04:07-04:11",
    "speaker" : "Greg",
    "text" : "He's also noted crier. Dick for meal."
  },
  {
    "speaker" : "Steve",
    "text" : "When did he cry?",
    "timestamp" : "04:11-04:12"
  },
  {
    "speaker" : "Greg",
    "text" : "He cries all the time. You haven't heard it's like his reputation.",
    "timestamp" : "04:13-04:16"
  },
  {
    "timestamp" : "04:16-04:16",
    "speaker" : "Steve",
    "text" : "No."
  },
  {
    "text" : "Oh weepy vermeal. Apparently some players like it and some hate it. Which one would you be? I mean I don't want to see my coach cry. That's kind of weird.",
    "timestamp" : "04:18-04:31",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, definitely.",
    "timestamp" : "04:32-04:32",
    "speaker" : "Steve"
  },
  {
    "text" : "I'm I'm all for like crying in like situations that call for crying, you know, but if you're crying frequently, yeah, you gotta get a hold of your shit, you know",
    "timestamp" : "04:33-04:45",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Do you think Tears of Joy works?",
    "timestamp" : "04:45-04:47"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "04:47-04:49",
    "text" : "Yeah, tears of joy are always fine."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "04:49-04:50",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "But like I'm sad tears, you just gotta reserve those for the special moments. That's true.",
    "timestamp" : "04:50-04:56"
  },
  {
    "text" : "Yeah, Dick Fermill's all about the crime.",
    "speaker" : "Andy",
    "timestamp" : "04:56-04:58"
  },
  {
    "text" : "So the Patriots come into this game. They haven't won a game in Kansas City since 1964. Fuck me. That's all I talk. Apparently it's not even our head stadium either. Instead of the old stadium. What you mean the last time they won or this game? The last time the Patriots won in Kansas City. Is that like some other memorial stage?",
    "speaker" : "Greg",
    "timestamp" : "05:02-05:24"
  },
  {
    "text" : "Is there 64? Didn't like the Patriots start in the 1960s too?",
    "speaker" : "Steve",
    "timestamp" : "05:24-05:28"
  },
  {
    "text" : "Yeah, they won they won their first season and never again. So the Chiefs are three and seven though. So they had that good year last year with Priest Holmes, where they lost to the Colts, right, in the playoffs and the shootout. So they had high expectations coming to this year, but they come into this game 3-7. Playing the 9-1 Pats. Pats are three-point favorites. Which I guess is is kind of surprising given their records, but I think the Chiefs are probably better than their record suggests, right?",
    "speaker" : "Greg",
    "timestamp" : "05:28-06:01"
  },
  {
    "speaker" : "Steve",
    "text" : "I think their offense was sick.",
    "timestamp" : "06:01-06:02"
  },
  {
    "text" : "Their defense no bueno.",
    "timestamp" : "06:02-06:04",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "And that was without Priest Holmes, too. You definitely noticed him missing there.",
    "timestamp" : "06:04-06:07"
  },
  {
    "text" : "Mm-hmm. All right. So that's another headline for this game is Priest Holmes, last year's rushing leader, touchdown leader.",
    "speaker" : "Greg",
    "timestamp" : "06:07-06:15"
  },
  {
    "timestamp" : "06:16-06:18",
    "speaker" : "Steve",
    "text" : "I don't know. He set some records back then too, right?"
  },
  {
    "text" : "Most touchdowns in the season, I think it was.",
    "speaker" : "Greg",
    "timestamp" : "06:18-06:20"
  },
  {
    "speaker" : "Steve",
    "text" : "Mm-hmm.",
    "timestamp" : "06:20-06:21"
  },
  {
    "timestamp" : "06:21-06:31",
    "text" : "Yeah, so he's injured for this game. Um going against the Patriots, who obviously we've talked about their cornerback issues.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "06:32-06:35",
    "speaker" : "Steve",
    "text" : "Wow, Troy Brown this one playing corner, which is nice. Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "06:36-06:45",
    "text" : "How was the uh watchable how was the Troy Brown interception last week? Oh Orgasmic."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Absolutely orgasmic. His face. I don't think I've ever seen him more excited coming off a field than when he intercepted Drew Bledsoe.",
    "timestamp" : "06:45-06:54"
  },
  {
    "speaker" : "Steve",
    "text" : "We also calculated how many balls he caught from Drew Bledsoe. I don't remember what it was, but it was possible because I don't think they're talking that.",
    "timestamp" : "06:54-07:01"
  },
  {
    "timestamp" : "07:02-07:03",
    "speaker" : "Greg",
    "text" : "What about what about practice?"
  },
  {
    "speaker" : "Andy",
    "text" : "How'd you how'd you calculate that? We didn't even think about it. Oh, we did some rough back of the napkin math, you know. Okay. Okay. Some approximations. Uh just real quick, just to go back to your um Your Chiefs being a good offense. Uh I actually found a thing. The Chiefs scored four hundred and eighty-three points this season in two thousand four. And that was the highest total in NFL history for a team that finished the season with a losing record",
    "timestamp" : "07:04-07:32"
  },
  {
    "text" : "Yeah, that's pretty impressive. That's that's hard to do.",
    "timestamp" : "07:34-07:37",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "07:37-07:42",
    "speaker" : "Andy",
    "text" : "Scoring 483 points and and finishing with a losing record. Was their defense just that bad?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Fuck. Uh seven and nine. Seven and nine, yeah.",
    "timestamp" : "07:42-07:48"
  },
  {
    "timestamp" : "07:50-07:52",
    "text" : "So I'll lose once more the rest of the season.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "07:52-07:52"
  },
  {
    "text" : "But it wasn't the offense's fault. No.",
    "timestamp" : "07:54-07:56",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "They were first in yards and second in points for offense, and they were 31st in yards and 29th for points on defense.",
    "timestamp" : "07:56-08:05"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I mean Trent Green threw for 4,500 yards. Trent Green and 27 touchdowns. Those are Manning-S numbers back then.",
    "timestamp" : "08:06-08:14"
  },
  {
    "text" : "Trent Green sucks though.",
    "timestamp" : "08:16-08:17",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "08:18-08:24",
    "speaker" : "Andy",
    "text" : "Yeah, I know. This is what I'm saying. And even he succeeded in this Kansas City offense. Dick Fremille knows what he's doing."
  },
  {
    "timestamp" : "08:24-08:28",
    "speaker" : "Steve",
    "text" : "Where did Tony Gonzalez end up public comedy? Because this is peak him. The whole officer."
  },
  {
    "text" : "He had 1200 yards and seven touchdowns. Led the team. This is his best season.",
    "speaker" : "Andy",
    "timestamp" : "08:28-08:34"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Double check the whole game.",
    "timestamp" : "08:34-08:37"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, other notable players on this team. So obviously Bree Solms, but he's hurt.",
    "timestamp" : "08:38-08:43"
  },
  {
    "timestamp" : "08:43-08:43",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "08:44-08:57",
    "text" : "Um Dante Hall, Tony Gonzalez. Their offensive line was ridiculous, too. Well, right, yeah. You know it's good when you actually recognize the names of the players. It doesn't happen often in the offensive line."
  },
  {
    "speaker" : "Steve",
    "text" : "Willy Rofe, baby. Willy Rofe. That Chris Birdman used to call him Willie Potro, right? Something like that, yeah.",
    "timestamp" : "08:57-09:06"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "09:06-09:12",
    "text" : "Brian Waters. Will Shields. Yep, those are all names I recognize, which is impressive."
  },
  {
    "speaker" : "Steve",
    "text" : "Doesn't Brian Waters play for the Patriots later in his career? And then again the Jets?",
    "timestamp" : "09:13-09:17"
  },
  {
    "timestamp" : "09:18-09:21",
    "speaker" : "Greg",
    "text" : "Hmm. I don't know. Stat check."
  },
  {
    "timestamp" : "09:23-09:30",
    "speaker" : "Steve",
    "text" : "I'm here to take notes to ask questions to have you Andy to stat check. Question check. Andy has stat check, Greg."
  },
  {
    "timestamp" : "09:30-09:50",
    "text" : "Yeah, that's true. He played for New England 2011 and then Dallas in twenty thirteen. He does not play for the Jets. Apparently 2012 on Pro Football Reference just says missed season refused to report. Ooh, I like that. Didn't fucking show up in 2012. Like, nah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "09:50-09:52",
    "text" : "Maybe you were vaccinated."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:53-09:56",
    "text" : "In 2012. Yeah. Didn't have his T Dap."
  },
  {
    "speaker" : "Steve",
    "text" : "Yep. MMR. Get out. Nay.",
    "timestamp" : "09:57-10:02"
  },
  {
    "timestamp" : "10:04-10:11",
    "speaker" : "Greg",
    "text" : "The do you hear Rogers say calling the MVP the most valuable vaccinated player? D Yeah. Hilarious."
  },
  {
    "text" : "It would be if it was most vaccinated player. Like, like just stick with the MVP, dude. Yeah, butchering that joke. Pretty funny though. Then you call the guy a bum too. That's how he's coming back calling people bums. Yeah, that guy is a bum too. That's legit.",
    "speaker" : "Andy",
    "timestamp" : "10:12-10:28"
  },
  {
    "speaker" : "Greg",
    "text" : "So any other uh notables about the Chiefs?",
    "timestamp" : "10:28-10:31"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "10:32-10:48",
    "text" : "Uh yeah, um their special teams coach. Chad O'Shea, long time Pats wide receivers coach back then. So the Page must have seen something in their in the Chiefs special teams here because in 09 they would sign him for nine years. Hmm."
  },
  {
    "timestamp" : "10:49-11:02",
    "speaker" : "Steve",
    "text" : "Baby, you're doing a terrible job of being Greg right now. You're remembering a bunch of facts. You're coming up with, you know, deep cuts like that. All right. Here's how about this then? I'll be a Greg. You know, lead us down some weird places."
  },
  {
    "text" : "I got I got a deep dive for you, and it has nothing to do with uh any player on either of these teams but the announcer John Gruden John Madden. You told well you told me it was John Gruden, so I did a John Gruden deep dive. Oh perfect, because it was John Madden. Good. So this I'm I am I am killing it as Greg. John Green was still coaching back in, wasn't he? Yeah, that's what I figured. You told me. So Should we talk about John Gruden?",
    "speaker" : "Andy",
    "timestamp" : "11:02-11:31"
  },
  {
    "timestamp" : "11:33-11:34",
    "speaker" : "Steve",
    "text" : "You're doing a perfect job, Andy."
  },
  {
    "speaker" : "Andy",
    "text" : "I am killing the Greg roll right now. Left third.",
    "timestamp" : "11:34-11:37"
  },
  {
    "text" : "I love it. That's perfect, Greg.",
    "speaker" : "Steve",
    "timestamp" : "11:37-11:38"
  },
  {
    "timestamp" : "11:38-11:54",
    "speaker" : "Andy",
    "text" : "So Gruden, let's talk about a bit about John Gruden, because he's been in the news lately too. So we'll get to that. But first we'll start. Um born in Sandusky, Ohio, which I feel like is if you were writing a movie. Is definitely foreshadowing Sandusky."
  },
  {
    "timestamp" : "11:56-12:25",
    "speaker" : "Greg",
    "text" : "Can I butt in for a second? Because I came across this today, which I thought was hilarious. All right. Did you know that there's a biography on Sandusky? Before all the allegations came out. You want to hear what it's called? It's titled. Oh, this is gonna be great. It's called Touched, the Jerry Sandusky story. Can't make this shit up. Swear to God that So we're to God. That's that's rough. Yeah."
  },
  {
    "timestamp" : "12:26-12:26",
    "speaker" : "Andy",
    "text" : "Oh boy."
  },
  {
    "timestamp" : "12:27-12:34",
    "speaker" : "Greg",
    "text" : "Yeah, because apparently Dick Vermil wrote like uh, you know, like one of the intro quotes or whatever, like talking about what a good guy he was. Yeah."
  },
  {
    "timestamp" : "12:35-13:11",
    "speaker" : "Andy",
    "text" : "Yeah, the preface or whatever. Jesus. That's tough, yeah. Um, so it we know that um John Gruden has a brother, Jay. Did you know he has another brother, James? who is not into football. His dad was into football. Jay obviously like played football and coached um James. Radiologist at uh Cornell Medicine. So black sheep of the family. He's one of the one that did it, right? Yeah. Well, no, he's probably the one that makes the least amount of money. He's only a doctor."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "13:11-13:16",
    "text" : "Yeah, but they ain't fucking finding his emails and putting them out on ESPN, I'll tell you that much."
  },
  {
    "timestamp" : "13:16-13:42",
    "text" : "Well, speaking of which, uh, did you hear the the Jay Gruden thing recently? No. Where um they were some somebody was interviewing him about because he used to be the coach of Washington. And so uh they were interviewing him about the the Announcing the new team name. And he said, uh, I don't want to ruffle any feathers, but they should have never changed the name in the first place. Bro, of all of all the takes. That's that's not the one.",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't want to ruffle any feathers, but I'm gonna ruffle of anyways.",
    "speaker" : "Steve",
    "timestamp" : "13:42-13:45"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah. And like using the ruffle the feathers thing too.",
    "timestamp" : "13:45-13:49"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, ruffle the feathers. I don Like that's a bit of a stretch, Andy. Well hey, I'm just reporting what I have to do.",
    "timestamp" : "13:50-13:55"
  },
  {
    "speaker" : "Steve",
    "text" : "What do you think we're gonna do a bunch, you know? I think you just stay the fuck away from that. But you know, should have kept the R-word. Exactly. Okay, cool, dude.",
    "timestamp" : "13:56-14:07"
  },
  {
    "timestamp" : "14:07-14:11",
    "text" : "You want to take bets on what they're gonna call him? Admirals.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "14:11-14:13",
    "text" : "I don't even know the options either. It's gonna be the admirals."
  },
  {
    "timestamp" : "14:14-14:18",
    "speaker" : "Andy",
    "text" : "I'm going to there's a lot of smoke around Admirals."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "14:18-14:30",
    "text" : "Yeah. Yeah. Or generals. I heard it was a military related, but I'm going hog. Well, I want it to be hogs, but they're too incompetent to actually come up with it. I want to be red hogs."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "14:30-14:33",
    "text" : "They're gonna come up with something stupid or just something just really lifeless."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:33-14:44",
    "text" : "Red hogs would be good too. The hogs? Come on, man. It's it's perfect. It is perfect. Yeah. Because you can play into the history of the the hogs, the hoggets and all."
  },
  {
    "timestamp" : "14:44-14:49",
    "speaker" : "Greg",
    "text" : "It's like football being like the hog mollies, you know, just like big beefcakes, like exactly."
  },
  {
    "speaker" : "Andy",
    "text" : "It would be perfect.",
    "timestamp" : "14:50-14:51"
  },
  {
    "timestamp" : "14:51-14:51",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "You could paint your bus like a trailer, you know.",
    "timestamp" : "14:52-14:54"
  },
  {
    "timestamp" : "14:55-15:01",
    "speaker" : "Andy",
    "text" : "Yeah. Oh yeah, yeah, yeah. That'd be dope. You put just hay around everywhere."
  },
  {
    "speaker" : "Greg",
    "text" : "Just think about all like the shtick you could do with it, like the oinking for touchdowns, like everything.",
    "timestamp" : "15:02-15:09"
  },
  {
    "text" : "Yeah, 100% coming to the pig pen.",
    "speaker" : "Steve",
    "timestamp" : "15:11-15:13"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "15:13-15:15",
    "text" : "You don't want to come into the pig pen. No, you don't."
  },
  {
    "text" : "Dan Snyder and he said no. Dan Snyder's next useless piece of crap.",
    "speaker" : "Steve",
    "timestamp" : "15:16-15:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, so um the reason people were talking about how It was going to be the Washington Admirals is because if you go to WashingtonAdmirals. com, um It it redirects to the the Redskins or the Washington football team website right now. And um so you know, like like there's there's some smoke there. Um, but other people were Talking about how you know anybody can can direct any URL to anything. So I decided to uh test that out. So I registered, let me see if I can find it. Um oh boy.",
    "timestamp" : "15:20-16:03"
  },
  {
    "speaker" : "Greg",
    "text" : "Andy, can I just I want to document a quick PP slap for saying the R-word there Yes, I appreciate that.",
    "timestamp" : "16:03-16:09"
  },
  {
    "speaker" : "Steve",
    "text" : "Andy guys, thank you for me and Andy again. Greg should be registering domains right now. You're Greg. Come on.",
    "timestamp" : "16:09-16:15"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:15-16:31",
    "text" : "That's true. But it was, I believe it was uh worsenflower. com. And if you go to that, it now redirects to the Washingtonfootball. com website. So it does work. Anybody can point any website they want to. Yeah. So if you go to what is it?"
  },
  {
    "timestamp" : "16:31-16:32",
    "text" : "Let me try.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "16:32-16:57",
    "speaker" : "Andy",
    "text" : "Um worst NFL Uh nfl owner dot com. See if it works. Yeah, that's the one. Yeah, look at that. There you go. So that's a fun game that we can now play. Oh yeah. There are a lot of things that we can redirect now too. Oh wow, that yeah, that's a nice It opens up a lot, right?"
  },
  {
    "timestamp" : "16:58-16:59",
    "speaker" : "Greg",
    "text" : "It opens up a lot of avenues."
  },
  {
    "text" : "Yes. Yeah. So uh how about this? If anybody has anything. Text us on the hotline, 603-505-8043, with what you would redirect and where you would redirect it to.",
    "speaker" : "Andy",
    "timestamp" : "17:00-17:14"
  },
  {
    "timestamp" : "17:15-17:17",
    "text" : "Small Dicks Incorporated.",
    "speaker" : "Greg"
  },
  {
    "text" : "Redirects the password.",
    "speaker" : "Andy",
    "timestamp" : "17:18-17:19"
  },
  {
    "text" : "For like eight bucks. Eight bucks. It's worth it.",
    "timestamp" : "17:20-17:23",
    "speaker" : "Greg"
  },
  {
    "text" : "For the year. That's a whole year of that joke. Love it. Speaking of jokes, John, we'll go back to John Gruden. Growing up, he was a Cleveland Browns fan, which I think explains a lot. Eventually he became the head coach of not the Cleveland Browns, but the Oakland Raiders. Went in 2000, went 12-4 before losing to the eventual Super Bowl champion Ravens in the AFC Championship game. And then the year after went 10 and 6 before losing to the eventual Super Bowl champion uh New England Patriots in a game, you might remember. Oh yeah. Uh and then after I think it was after that year, he uh didn't get fired. No, he actually he got traded kind of similarly to the way Belichick was. Yep. To The Tampa Bay Buccaneers because uh Tony Dungey got fired and went obviously coached the Colts And so the Bucks the Bucks traded uh here it is. Uh High-stakes trader included Tampa Bay's 2002 and 2003 first-round draft picks, 2002 and 2004 second-round draft picks, and $8 million in cash. To acquire John Gruden. I got a Super Bowl out of it, so Yeah. So all they did was go to the Super Bowl the next year because their defense was fantastic. And then Gr John Gruden retooled the offense because you know that was his thing. Uh, you know, those high flying Oakland Raiders in the early 2000s. So they meet in the Super Bowl. It was basically called the Gruden Bowl in 2002. And uh Gruden won, making him the youngest head coach to win the Super Bowl at age 39. That would be surpassed by anybody know The younger Harbaugh, maybe? Who?",
    "speaker" : "Andy",
    "timestamp" : "17:23-19:14"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:14-19:15",
    "text" : "One of the Harbaughs?"
  },
  {
    "text" : "No. It was a coach who previously served under Gruden as the Bucks defensive backs coach, Mike Tomlin.",
    "timestamp" : "19:15-19:23",
    "speaker" : "Andy"
  },
  {
    "text" : "Mike Tom win.",
    "timestamp" : "19:24-19:24",
    "speaker" : "Greg"
  },
  {
    "text" : "Right. Mike Tom is the youngest coach to win a Super Bowl.",
    "speaker" : "Andy",
    "timestamp" : "19:25-19:28"
  },
  {
    "text" : "How old is he?",
    "speaker" : "Steve",
    "timestamp" : "19:28-19:30"
  },
  {
    "timestamp" : "19:30-20:22",
    "speaker" : "Andy",
    "text" : "I'm guessing younger than 39, so probably 38. Um, but the reason that the Bucks won Super Bowl over the Raiders, one of the main reasons, other than one of the Raiders players going A-WOL the night before the game. um was Gruden's prior knowledge of the Raiders. I quote, the most damaging piece of evidence is NFL films footage of Tampa Bay. Defensive back John Lynch telling his teammates during the game that almost all the plays ran by Oakland's offense were plays that Gruden, who that week even played the part of Rich Gannon by playing quarterback with the Scout team offense. specifically told them to look out for. Better still for the Buccaneers was that the Oakland hadn't changed their audible calling signals that Gruden himself had installed, thus tipping off plays repeatedly. That's that's bad, guys."
  },
  {
    "timestamp" : "20:22-20:26",
    "speaker" : "Steve",
    "text" : "Well yeah, that's the Raiders' fault for not changing the offense when you left. Oh yeah."
  },
  {
    "text" : "That's what I mean. That's bad. And then you're playing the same guy again. Who installed that offense of the Super Bowl, but still. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "20:26-20:35"
  },
  {
    "timestamp" : "20:35-20:38",
    "text" : "How did nobody else catch on? Is what I want to know.",
    "speaker" : "Greg"
  },
  {
    "text" : "Good question.",
    "speaker" : "Steve",
    "timestamp" : "20:38-20:39"
  },
  {
    "text" : "Because they're not taping practices. Yeah. So that's true.",
    "timestamp" : "20:40-20:44",
    "speaker" : "Greg"
  },
  {
    "text" : "Stealing playbooks. Jamin Headsets. Jamin's headsets, that's right. The Bucks will finish uh 7-9 and 5-11 the next two years because they were in cap hell because of it. And became the first team to have consecutive losing seasons after winning the Super Bowl. So John Gruden is uh the best at failing too. Um the low point was uh Monday night game against the Colts, who obviously are now coached by Tony Dungey, who was his predecessor. And that was the game where the Bucks were up uh yeah 35-14 in the fourth quarter And still managed to lose 38-35. Remember that game? Paint Manning just went the fuck off. Oh, yep. Yep. Uh so then Gruden took a whole bunch of time off. Uh Until he was lured back in the NFL with a 10-year, $100 million contract, which we all remember in 2018. Um part of that included a no-trade clause. So that he couldn't get traded like he was when he was the coach of the Raiders the first time. And then, as Greg alluded to, in October 2021 This is the juicy bit. A league investigation into the Washington football team for workplace misconduct uncovered emails Gruden sent to then Washington general manager Bruce Allen. Where Gruden used racist, misogynistic, and homophobic slurs. This is where it gets juicy. The emails were written between 2011 and 2018. So this isn't just like a one-off. This is what he does. Uh the emails referred to NFL Commissioner Roger Goodell as uh F-word, um a bundle of sticks. And Greg? An anti-football pussy. A clueless anti-football pussy. Yal said Goodell shouldn't have pressured the Rams to draft, quote, queers, referring to Michael Sam, the first openly gay player. Gruden stated that players who protest the national interest should be fired, specifically referring to former 49 safety Eric Reed. Gruden used a racist stereotype to describe NFLPA executive director Demoris Smith. Which this is such a like a boomer thing saying Dumboris Smith has lips the size of Michelin tires. Misspelling Michelin, of course, because it's you know stronger. Also Dumboris. Like really? That's that yeah. That's such like a Facebook thing you'd see. It's great, it's it's grade school level. Yeah, it is. Dumb Boris. Bruden also called then United States Vice President Joe Biden a nervous clueless pussy. So he likes clueless pussy.",
    "timestamp" : "20:48-23:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "23:27-23:29",
    "text" : "I didn't hear that one, that's sweet."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:29-24:29",
    "text" : "Yeah, that yeah, I mean that that one. That one that one tracks. Allen and others also received emails from Gruden that contained topless photos of women, including two Washington football team cheerleaders. Which when you combine that with all the Cheerleader's stuff for the the Washington football team that that went on is, you know, even worse Gruden resigned on October 11th after details were released to the New York Times or by the New York Times And then he announced his intentions to sue the NFL and Roger Goodell for exposing his scandals. And because of that, he was removed from the Buccaneer Ring of Honor. Where he'd been inducted in 2017 as a result of these emails. Gave him that What? Giving the old PP slap. Yeah, oh yeah. They gave him a big old PP slap. He's a he's a uh sometimes a naughty boy. Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "24:30-24:32",
    "text" : "He's a Patsy. He is."
  },
  {
    "speaker" : "Steve",
    "text" : "Gary won't be the only one to be smeared by that or caught up in that Redskins investigation because that's where it came from. So yeah, so my question is.",
    "timestamp" : "24:33-24:41"
  },
  {
    "timestamp" : "24:46-25:01",
    "speaker" : "Andy",
    "text" : "Right. So so why are they protecting the Washington franchise so strongly? No idea. And Dan Snyder specifically. Right. Like just boot his ass and get somebody else in there who's less of a headache."
  },
  {
    "timestamp" : "25:01-25:03",
    "speaker" : "Steve",
    "text" : "They'll make you more money even."
  },
  {
    "timestamp" : "25:03-25:10",
    "speaker" : "Greg",
    "text" : "Yeah, probably not that easy to just boot someone though. I mean the NBA did it pretty rapidly, no?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. The Carolina Panthers had to do it.",
    "timestamp" : "25:10-25:13"
  },
  {
    "text" : "Oh yeah, the Panthers too, right. I think he resigned though, didn't he? Maybe.",
    "timestamp" : "25:13-25:17",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "25:17-25:18",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "25:18-25:19",
    "text" : "Yeah, that's true. I think he means that."
  },
  {
    "text" : "Same idea.",
    "timestamp" : "25:19-25:19",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "25:23-25:27",
    "speaker" : "Greg",
    "text" : "The shit he was saying was hilarious. The Jeans Fridays."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:28-25:33",
    "text" : "Yeah. Yeah, oh yeah. You fill those genes out."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, you must have to jump and get into those genes, huh? These creepy old man shit.",
    "timestamp" : "25:34-25:39"
  },
  {
    "text" : "Terrible. Which is nowhere near as bad as anything Dan Snyder's done.",
    "timestamp" : "25:41-25:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I mean Even Gruden, it's like 2011's a different time. I mean, obviously it's awful shit, but it's like he just comes off as like a dumbass more than like a malicious.",
    "timestamp" : "25:47-25:59"
  },
  {
    "timestamp" : "26:00-26:04",
    "text" : "Oh yeah, definitely. Yeah. Like it's like a second grade insult, not like a",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah, it's like come on dude, you vugging ten year old. Yeah, exactly. So yeah, John Gruden, unrelated to the game we're uh viewing today. You're welcome. This was a John Madden game, though, so that was sweet. It is a John Madden game. Rest in peace. Yeah. It's great to hear his voice, too. Did you watch the game, Steve?",
    "timestamp" : "26:04-26:28"
  },
  {
    "timestamp" : "26:28-26:29",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "26:29-26:49",
    "speaker" : "Greg",
    "text" : "Yeah. So I don't know if you you picked up on this. That I don't know where I heard it or I might have read it in the the recap of the game, but did you hear about the Monday night controversy commercial from the week before? No with Terrell Owens and Nicole. Nicolette Sheridan?"
  },
  {
    "text" : "No.",
    "timestamp" : "26:49-26:50",
    "speaker" : "Steve"
  },
  {
    "text" : "So apparently this was like uh the when Desperate Housewives was coming out. Yep. Or just starting to get popular. So there was a commercial. Like the intro to the game where they did like a dual advert for the game and Desperate Help Housewives, where one of the housewives shows up in a towel in the in the uh locker room and TO is there and she's like, don't go on the field, come stay with me. He's like, no, no, I gotta go out. I gotta go out there. I gotta go out there. And then she like It's like a back shot and she like drops the towel and he's like, I guess I'll stay. Yeah, yeah. Wow And like people were like losing their shit about it.",
    "speaker" : "Greg",
    "timestamp" : "26:51-27:33"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean this is 2004. This is like 2000 times in two.",
    "timestamp" : "27:34-27:37"
  },
  {
    "text" : "Yeah. And it's right after the Janet Jackson Nipplegate, right?",
    "timestamp" : "27:37-27:41",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "27:41-27:42",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "That was the last Super Bowl. So people who already had their antennas up for a vogue in NFL. Yeah, I wrote down some of the quote quotes of reactions from different public figures and they're fucking hilarious.",
    "timestamp" : "27:42-27:57",
    "speaker" : "Greg"
  },
  {
    "text" : "I think I found it. Do you want to watch it first real quick? Yeah. Yeah. Let me see this thing because let me uh see this. Let me share this real quick.",
    "speaker" : "Andy",
    "timestamp" : "27:57-28:06"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:06-28:08",
    "text" : "Good job, fact check boy."
  },
  {
    "timestamp" : "28:09-28:17",
    "text" : "That's what we do. What the hell? Oh, are you still there? What am I doing? Am I sharing?",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I can see.",
    "speaker" : "Greg",
    "timestamp" : "28:18-28:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:19-28:26",
    "text" : "Yeah, we can see it. Hey look, I'm Greg. Technical difficulties. All right. Can you hear it? Maybe."
  },
  {
    "timestamp" : "28:26-28:32",
    "speaker" : "Steve",
    "text" : "Yeah. Hey there, Carol. What are you doing in Philadelphia? Then I gotta go."
  },
  {
    "speaker" : "Greg",
    "text" : "So now this is her taking off her towel.",
    "timestamp" : "28:32-28:34"
  },
  {
    "text" : "Oh he looks down and smiles.",
    "timestamp" : "28:34-28:37",
    "speaker" : "Steve"
  },
  {
    "text" : "He looks down and smiles. Like a star. Who watches this tree? Yeah, I know the cut to the other two housewives watching that. Oh my. That was spicy.",
    "speaker" : "Greg",
    "timestamp" : "28:37-28:53"
  },
  {
    "speaker" : "Steve",
    "text" : "That was a poorly done commercial and ridiculous.",
    "timestamp" : "28:54-28:58"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "28:58-29:45",
    "text" : "Mm-hmm. You want to hear some reactions? Yeah, yeah. Um John McCain. Oh, this should be disgraceful performance. By whom? Both of them. Terrible acting. Lovey Smith, head coach of the Bears. Pretty close to pornographic. I think that was the idea, Lovey. Uh Pat Buchanan noted like Southern Old Man Republican. Oh yeah. A stinking thing for ABC to do. Um, Tony Dungey missed the Christian values is pretty upset about it. He said we're negotiating a new contract, maybe we don't consider ABC."
  },
  {
    "text" : "So he's really trying to put an eyeball on this.",
    "timestamp" : "29:46-29:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "29:48-29:56",
    "speaker" : "Greg",
    "text" : "Play some hardball there. Oh girl. And Dan Rooney, owner of the of the Steelers, about the worst thing I've ever seen."
  },
  {
    "timestamp" : "29:58-29:59",
    "speaker" : "Steve",
    "text" : "Oh Dan."
  },
  {
    "text" : "I have a counterpoint. You got a lot coming to you, dude. I I have a counterpoint to that though. Terrell Owens in that game. Eight targets, six catches, 134 yards, three touchdowns. They won 49-21. Yeah, and he missed the first quarter.",
    "timestamp" : "30:00-30:17",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "30:18-30:21",
    "speaker" : "Steve",
    "text" : "Yeah. That's what I'm saying. Goes up late and balls out. Good work."
  },
  {
    "text" : "Yeah. No, he didn't. He got back uh into with the six minutes left and caught a 59-yard touchdown pass from Donovan Knab to open the scoring. Didn't even take that long.",
    "timestamp" : "30:21-30:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, also they're like, oh, he's like, the game starts in 10 minutes and you you can't see it, but every single jersey is still in the locker. Yeah.",
    "timestamp" : "30:32-30:41"
  },
  {
    "text" : "What the fuck are they gonna wear? This is a green screen of like a locker. They're both green screened in and they're trying to like mush it together. It's just poorly done too.",
    "timestamp" : "30:42-30:50",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, it had everybody in Tizzy. It had People saying it was racist because it was a trope, and then it was racist because it was a white woman and a black man. So it was like you got both angles there. It was a whole big thing. Everybody was pissed. You really hit the sweet spot. Yeah, that's how you know you did it well. Yep. So yeah, John Gruden or John. Sorry, look at this. That's probably why any John Madden. Um commentator for this game. I actually wrote down a quote here that I think would really piss you off, Andy. Yes! John Madden, talking about the referee, said Bill Lee Bill Levy, one of the best refs in the league. So not only is it a great commentator, it's a great referee. And glad I missed this game. Yeah. You would have fucking had an aneurysm. Perfect. Um, another jump or another uh madness. They were talking about Belchek's style, and I think they were probably ahead of the curve here talking about how he like always wears the sweater. Uh sweater, yeah. He said uh Belichick looks like everybody's 11th grade gym teacher, which I thought was pretty spot on.",
    "timestamp" : "30:51-32:05"
  },
  {
    "timestamp" : "32:05-32:15",
    "text" : "Oh, dad-on. Oh, speaking of which, um I've been searching the internet for a toddler-sized Belljack hoodie. Can't find one yet. So if you find one, let me know.",
    "speaker" : "Andy"
  },
  {
    "text" : "Really? Yeah. You just get a regular one and cut the sleeves off, no? Well, it's not for me, Gregory. Yeah, but you can't just find a regular toddler size sweatshirt.",
    "speaker" : "Greg",
    "timestamp" : "32:15-32:27"
  },
  {
    "timestamp" : "32:27-32:36",
    "text" : "Not the right color gray, you know, you need that like dark gray, the the original Belichick Gray. Alright, I feel you. So if you find one, let me know.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "All right. Another Maddenism. They benched Earthwind Moreland. Oh no. In the first quarter and he said Earthwind got fired. That's not bad. Why is the Hall of Famer got fire?",
    "timestamp" : "32:36-32:52"
  },
  {
    "timestamp" : "32:52-32:53",
    "speaker" : "Andy",
    "text" : "That's Burmanesque right there."
  },
  {
    "timestamp" : "32:54-32:54",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "32:54-32:56",
    "text" : "That's not too shabby.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:56-33:03",
    "text" : "Yeah, so um you want to talk about the game Steve? You wanna give me your input"
  },
  {
    "timestamp" : "33:04-33:10",
    "text" : "First play of the game or something like that. You see uh sacked by rookie Jared Allen.",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh rookie Jared Allen, Jesus.",
    "speaker" : "Andy",
    "timestamp" : "33:11-33:13"
  },
  {
    "text" : "Rookie Jared Allen. This is gonna be one of his first games. It's kind of crazy. Probably his 11th, I would think. Yeah. It's crazy to see those guys so young and you see them coming before, you know. Yeah, yeah.",
    "speaker" : "Steve",
    "timestamp" : "33:13-33:25"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "33:27-33:56",
    "text" : "Wine em 69. No. What? I guess like I opened a restaurant. I don't know. It might have been in Kansas City or Minnesota, one of the two. And he like it was like all branded like 69, because that was his number. And I guess their like logo or informal logo was wine em dynam 69. Wow. Yeah. Well so he was basically Gronk before Gronk."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. Motherfucker literally picked number 69. Uh-huh.",
    "timestamp" : "33:57-34:00"
  },
  {
    "text" : "He did the mullet.",
    "timestamp" : "34:00-34:01",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "34:02-34:02",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "34:02-34:19",
    "text" : "Yeah. I actually looked on his Wikipedia to see if he had done anything funny. And I saw legal issues and I was like, oh hell yeah. Turns out they're the most typical Jared Aaron legal issues you could imagine. He's got Three DUIs and that's it.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I was waiting for a drunk and disorderly, but yeah, that works too. That makes sense. Yeah. Uh-huh.",
    "timestamp" : "34:20-34:24"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, it's tough though.",
    "timestamp" : "34:27-34:28"
  },
  {
    "speaker" : "Andy",
    "text" : "I never remember him as a chief. I just remember him as a Viking. I remember the chief more than a Viking. No, I just remember himself. And that he was just supposed to be one of the prolific uh trash talkers, I believe, Jared Allen.",
    "timestamp" : "34:28-34:42"
  },
  {
    "timestamp" : "34:42-35:05",
    "text" : "Prolific what? Trash Talker. Oh yeah. He was always mic'd up. Do you know what his celebration was? Remember the uh oh no, what was it? Remember? He used to do that every every time he sacked? Yeah, what was it supposed to be? I thought he used to be stirring the pot and then like a hoot, but he's tying the cattle. You know what he was always doing?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I guess that guy like rolled his hands like a false start motion and then threw it over his shoulder or somehow he was doing out there",
    "timestamp" : "35:07-35:14"
  },
  {
    "speaker" : "Andy",
    "text" : "That was a dick joke, you know. Number six.",
    "timestamp" : "35:15-35:17"
  },
  {
    "timestamp" : "35:17-35:20",
    "speaker" : "Greg",
    "text" : "He's pretty sweet, though. He's got a lot of personality."
  },
  {
    "text" : "Yes, for sure.",
    "timestamp" : "35:20-35:21",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "35:21-35:37",
    "text" : "Yeah. He was good. He also had one season with 22 sacks. Yeah. So I'm saying he was definitely second. Second most in a single season behind stray hand. Also, TJ Wan might break that this year. You see that? Yeah, what's he at now?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "35:37-35:42",
    "speaker" : "Steve",
    "text" : "I think he's at like 21. He's got an extra game, doesn't even discounge his point this point."
  },
  {
    "timestamp" : "35:42-35:48",
    "speaker" : "Andy",
    "text" : "That's true, yeah. Same with uh Cooper Cup breaking The uh reception year's record."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "35:48-35:59",
    "text" : "Yo, shout out Cooper Cup. He's about to win me a thousand dollars, dude. There it is. I love that boy Tim and Jamar Chase."
  },
  {
    "text" : "I I we're not talking about fantasy football.",
    "timestamp" : "35:59-36:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:02-36:14",
    "speaker" : "Greg",
    "text" : "Come on, just let me tell you what my team is. I call them the Beatles. Cooper Cup, Devontae Adams, Jamar Chase, and Travis Kelsey. Like tell me that's not stacked."
  },
  {
    "timestamp" : "36:14-36:21",
    "speaker" : "Andy",
    "text" : "That's mine was uh Kyler Murray and CMC. Oh yeah."
  },
  {
    "timestamp" : "36:21-36:44",
    "speaker" : "Greg",
    "text" : "And the wheels fell the fuck off like weeks four. Dude, I'm in one league that's a double keeper. I've had Saquon Barkley and Christian McCaffrey for like four straight years and they both have fucked me every year. Every year. And then every offseason I'm like, well, you know, it's still them though. Yeah. Exactly. There's a lot of potential. And then they fuck me again. It's my fault now. It's my fault, you know?"
  },
  {
    "timestamp" : "36:44-36:45",
    "text" : "Officially. Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:45-37:15",
    "text" : "Yeah. All right. So Pats come into this game. So we'll give you the uh the final score. No. Probably not as close as the score indicates. It was pretty competitive through about three quarters. Um obviously the Chiefs have a great offense, so they kind of have that firepower, but they're missing priest Holmes, which I think was a Was a big part of this game and it was like a lot of the talking points from the commentators.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "So I actually did I I did a a deep dive, a little bit of a uh a shallow dive on priest home's Before I did the John Gruden thing. He's got to be the most unlucky or like underrated running back in the in the NFL, I think.",
    "timestamp" : "37:15-37:32"
  },
  {
    "timestamp" : "37:33-37:38",
    "speaker" : "Greg",
    "text" : "I got a question before you jump in. Do we know why his name's Priest? Is that his name?"
  },
  {
    "text" : "No, that the his name is Priest Anthony Holmes. He's named Priest Holmes. He used to go by Anthony early though. Like he never he didn't go by priest until like uh I think he was in college.",
    "timestamp" : "37:39-37:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "37:48-37:49"
  },
  {
    "speaker" : "Andy",
    "text" : "But he",
    "timestamp" : "37:50-37:51"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "37:51-37:52",
    "text" : "Is he religious?"
  },
  {
    "speaker" : "Andy",
    "text" : "I feel like you have to be.",
    "timestamp" : "37:52-37:53"
  },
  {
    "timestamp" : "37:53-37:58",
    "speaker" : "Greg",
    "text" : "I'm assuming his family is. Is that or they want him to grow up to be a diddler?"
  },
  {
    "text" : "Well raised in a military household, apparently. Oh, okay. Uh so yeah, a little bit. Um but in college he uh it took him a while, but eventually got the uh starting job. in uh University of Texas, the starting running back that was killing it. And then missed the 95 season with a knee injury, allowing the emergence of future Heisman Trophy winner Ricky Williams to take over the starter. And uh, you know, never recovered. Uh, then got drafted by the Ravens and started uh fourth behind Ben Morris, Ernest Biner, and Drake Graham. Uh eventually won the starting job a couple years later. Uh only and then you know had his first thousand-yard rushing yard uh season, including a 200-yard game. Um And then two years later, he was supplanted by rookie running back Jamal Williams, which is why he got traded to the Chiefs. Jamal Lewis, right? Yeah, what did I say?",
    "timestamp" : "38:00-39:04",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "39:05-39:05",
    "text" : "Williams.",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh, Jamal Lewis.",
    "timestamp" : "39:05-39:06",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, sorry. You guys are terrible with names. Got Ricky on the brain.",
    "timestamp" : "39:06-39:09",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. So so he uh gets injured in college and Ricky Williams takes over for him And then uh runs for a thousand yards in after beating out three guys. Four actually, because he's behind Eric Tourette at one point. Remember Eric Tourette? Mm-hmm. I do. Um Runs for 200 yards and then gets replaced by rookie Jamal Lewis before going to the Chiefs and setting records for touchdowns in a season and such. And then uh gets injured in 2005. Uh it was cut short by an injury to his spinal column from a tackle by Sean Merriman. Which sounds fucking terrible. Uh, replaced by Larry Johnson, who would then take over his starting spot and he would never recover.",
    "timestamp" : "39:09-39:57"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "39:57-40:09",
    "text" : "So yeah, that that was like an interesting part of this game too because Larry Johnson's on this team, but he wasn't playing. So they were starting Derek Blaylock, who sucked. Yeah, I remember Derek play."
  },
  {
    "text" : "Like he was not good.",
    "timestamp" : "40:10-40:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. He had like 10 carries for 20 yards at one point in the game.",
    "timestamp" : "40:10-40:14"
  },
  {
    "text" : "And the best part is this is peak Corey Dillon, which who is the best running back we've had in our lifetimes.",
    "speaker" : "Steve",
    "timestamp" : "40:14-40:20"
  },
  {
    "text" : "Yeah. Yeah, but apparently Cromeel hated Larry Johnson. Really? Yeah, like he didn't want to draft Larry Johnson, but he like wanted a defensive player And then they drafted him anyways. And then like he came in and um they said I saw a quote from meal said He needs to grow up and take the diapers off because he wasn't like working hard enough in practice or something. Damn. Yeah. So they show him he's like standing on the sidelines in these games and then he just like didn't get any touches. But once Blaylock gets hurt, they have to play Johnson, and then he just like tears it out. Just goes off.",
    "timestamp" : "40:20-41:00",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "41:00-41:00",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. And then Vermil has to, you know, tuck his sack and go back.",
    "timestamp" : "41:00-41:04",
    "speaker" : "Greg"
  },
  {
    "text" : "Goodness. I love that.",
    "timestamp" : "41:07-41:08",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "41:09-41:09",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "41:11-41:39",
    "speaker" : "Steve",
    "text" : "Madden had a great point, another plus for the commentators, Andy. Love it. It's Majon Madden. Talk him up. He was talking about how the Patriots have replaced that bubble screen game that they've always done, even like the screen game with just Corey Dylan. Yeah oh yeah not only you need to run it it's taking over that part of that offense and now all Tom Brady's doing is sort of throwing a deep play action. It's awesome to see. Corey Dillon's super good in this game. And recently all these games he's been playing in this year. He's just running over people."
  },
  {
    "text" : "Didn't Corey Dillon fumble in this game? Like late? Yep. Kind of kept him in it.",
    "timestamp" : "41:39-41:45",
    "speaker" : "Andy"
  },
  {
    "text" : "So yeah, he's he scored twice. So this is actually interesting. It was his first Monday night football game ever.",
    "timestamp" : "41:45-41:51",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "41:51-41:56",
    "speaker" : "Andy",
    "text" : "Yeah, because he's been on the bangle for so long they just don't play. It's awesome."
  },
  {
    "timestamp" : "41:56-41:59",
    "speaker" : "Steve",
    "text" : "That's great. And he's in his like eighth or ninth year at this point."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "41:59-42:01",
    "text" : "Yeah, probably. Yeah."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "42:01-42:01"
  },
  {
    "text" : "The Twilight of his career. It's not even shitty teams. It's just teams no one cares about because we still see the Giants that we got in the week and they're fucking terrible. At least once a year, if not twice. Yeah, so he scored twice. He had 26 carries, 98 yards, two touchdowns. He had a late fumble that like they could have put the uh Put the nail in the coffin and he and he fumbled inside the five.",
    "speaker" : "Greg",
    "timestamp" : "42:02-42:30"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. He did good on that last they had the six minute offense on there and they chewed a bunch of time up mostly through him. So like right after the fumble, I came back to him and he played pretty well in that. That's what you want to say. Last drive, kick a field goal drive.",
    "timestamp" : "42:30-42:44"
  },
  {
    "timestamp" : "42:44-43:11",
    "speaker" : "Greg",
    "text" : "But this offense is so balanced right now. Like It seems like they were getting like plays from everybody. 'Cause like David Patton's still there. He had like a couple big plays. Daniel Graham had plays. Deion Branch who came back first game since we're gonna have to get out of here. Six catches, hundred five yards. He went off like he had a sick touchdown. Yeah, I haven't seen him in ages. Oh yeah, that touchdown was getting Cory Dell and so it's like they they were kind of firing on all cylinders here."
  },
  {
    "text" : "This is some of the peak offense of Patriots, like up Brady, you know. The balance, like you said, is really the important part. They're definitely better in the past game later on, but they're never this good in the run game, you know? Like Lawrence Moroni was supposed to be this sort of back, and he's just he just never was or anything like that.",
    "timestamp" : "43:11-43:28",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "43:27-43:36",
    "speaker" : "Greg",
    "text" : "Yeah, I think it's because of Dylan. Because Dylan really like opens up a lot of things because they have to play that. Yeah. You can't just sell out for the pass or or something like that."
  },
  {
    "text" : "You can't respect that, right? He's a big boy. Yeah. He looks similar to uh Mondre, like in the building.",
    "timestamp" : "43:36-43:44",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "43:45-43:46",
    "speaker" : "Greg",
    "text" : "Mondre the giant."
  },
  {
    "timestamp" : "43:46-43:52",
    "speaker" : "Steve",
    "text" : "I think he's thicker than that. Oh yeah. I mean they all were in gigantic troller pads back then too. That's true too, yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "I love the way Ramondre Stevenson runs. Interesting he's falling down the entire run, but still ends up getting six or seven yards. Yeah. Just stumbling the entire way.",
    "timestamp" : "43:52-44:01"
  },
  {
    "timestamp" : "44:03-44:03",
    "speaker" : "Steve",
    "text" : "Man."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "44:04-44:04"
  },
  {
    "timestamp" : "44:05-44:24",
    "text" : "So defense did end up giving up 19 points, a couple big plays. I think it's probably to do with with Tylaw and Tyrone Poole being out. And then They benched Earthwind and then Randall Gay got hurt, so then they brought Earthwind back out. Oh no. No, it was Asante that got hurt. Oh, was it?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "They had the camera right next to it and you could hear him like screaming. It didn't sound good. It was bad.",
    "timestamp" : "44:24-44:28"
  },
  {
    "text" : "Oh boy. Um and then Gonzalez is kind of killing him too.",
    "timestamp" : "44:28-44:34",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "44:35-44:52",
    "text" : "Well they were like selling out to stop Tony and leaving the corners sort of on islands and they were just getting killed. He was just thrown over the top of them for big plays. And Gonzalez was still getting those too. But they couldn't run the ball at all. Like the yards per carry was super low. I remember it seemed 1. 9 yards per carry."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:53-44:55",
    "text" : "19 carries, 58 yards."
  },
  {
    "text" : "Yeah. So they're shutting the rundown.",
    "speaker" : "Steve",
    "timestamp" : "44:55-44:58"
  },
  {
    "text" : "Johnny Morton, 107 yards receiving. Eddie Kennison, 99 yards receiving, and Tony Gonzalez 86. Was there any uh Dante Hall settings in this?",
    "timestamp" : "44:59-45:09",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:10-45:16",
    "speaker" : "Steve",
    "text" : "Nah, he didn't he didn't like flash that much. They kicked it to him too. They didn't they weren't afraid of him."
  },
  {
    "timestamp" : "45:16-45:25",
    "text" : "That's surprising because I think this might have been peaked Dante Hall as well. I don't think I think that's a good thing. 2004.",
    "speaker" : "Andy"
  },
  {
    "text" : "No, they said he had three returns last year, actually.",
    "timestamp" : "45:26-45:28",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Do they yeah. 2003 he had two punt returns for touchdowns, two kick returns for touchdowns. 2004, he had another two kick returns for touchdowns. And he had the most kick return yards he's ever had. 1700.",
    "timestamp" : "45:28-45:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:44-45:46",
    "speaker" : "Greg",
    "text" : "Human joystick. Human joystick."
  },
  {
    "text" : "X factor.",
    "timestamp" : "45:46-45:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "So back to like the balance thing. I just remembered that I did take it, they had a graphic on the game. So through the nine games so far, they have 11 players with a sack. 14 players with a takeaway, 15 players with a reception, and 11 players with a touchdown.",
    "timestamp" : "45:49-46:06"
  },
  {
    "text" : "Fucking hey. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "46:06-46:07"
  },
  {
    "text" : "So the second team in the last 20 years with 10 plus players in each category.",
    "timestamp" : "46:07-46:12",
    "speaker" : "Greg"
  },
  {
    "text" : "That's crazy.",
    "timestamp" : "46:12-46:13",
    "speaker" : "Andy"
  },
  {
    "text" : "Mm-hmm. Contributions from everywhere. Literally, yeah.",
    "speaker" : "Greg",
    "timestamp" : "46:13-46:19"
  },
  {
    "speaker" : "Steve",
    "text" : "How does that stat hold up now?",
    "timestamp" : "46:19-46:21"
  },
  {
    "speaker" : "Greg",
    "text" : "It's a good question, Steve. I wish we had a stat check guy.",
    "timestamp" : "46:22-46:25"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "46:26-46:26"
  },
  {
    "timestamp" : "46:26-46:36",
    "speaker" : "Greg",
    "text" : "That's a tough stat check right there. Oh yeah. Sometimes not that easy, Andy. And people just throw shit and see what happens. Greg, ours are usually asking you to Google shit."
  },
  {
    "speaker" : "Steve",
    "text" : "That's tougher, Andy. He'll figure it out. Yeah, I'm not gonna I'm not gonna do that. Use Twitter, you Twitter shit. I'm not gonna do that. Just Twitter it. I'm not gonna do it. That's being very Good Greg, good job.",
    "timestamp" : "46:36-46:51"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "46:51-46:52",
    "text" : "Yes, here's what I'm saying."
  },
  {
    "speaker" : "Steve",
    "text" : "Thank you.",
    "timestamp" : "46:52-46:52"
  },
  {
    "timestamp" : "46:53-46:54",
    "speaker" : "Andy",
    "text" : "You're welcome"
  },
  {
    "text" : "Also, the Patriots um tie the record for um the uh consecutive games scoring first. This is the 15th straight game scoring first.",
    "timestamp" : "46:54-47:05",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "47:06-47:06",
    "speaker" : "Andy",
    "text" : "Yes."
  },
  {
    "text" : "This is pretty impressive.",
    "speaker" : "Greg",
    "timestamp" : "47:06-47:07"
  },
  {
    "speaker" : "Andy",
    "text" : "Tied the record, right?",
    "timestamp" : "47:08-47:09"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh broke the record.",
    "timestamp" : "47:10-47:11"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that broke the record? Okay. Damn. 15 games in a row.",
    "timestamp" : "47:11-47:16"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "47:16-47:16"
  },
  {
    "speaker" : "Andy",
    "text" : "Um, you guys got any other notes?",
    "timestamp" : "47:17-47:19"
  },
  {
    "text" : "Well, I mean the game ended there with uh a pretty sweet play. Their whole last drive was terrible because they did get the ball back with a couple minutes. And they had a couple of They had a first down from the 20 or so with no timeouts. And then uh they just kind of squandered it and Willie finished it with that pretty sweet sack.",
    "timestamp" : "47:20-47:40",
    "speaker" : "Steve"
  },
  {
    "text" : "Buried him. He absolutely bodied the offensive lineman too.",
    "timestamp" : "47:42-47:45",
    "speaker" : "Andy"
  },
  {
    "text" : "One of those 15 yards this day and age sort of sacks.",
    "speaker" : "Steve",
    "timestamp" : "47:46-47:49"
  },
  {
    "text" : "Oh yeah. Yeah, I definitely fell on him.",
    "timestamp" : "47:50-47:52",
    "speaker" : "Andy"
  },
  {
    "text" : "Body weight.",
    "speaker" : "Steve",
    "timestamp" : "47:52-47:53"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:53-47:59",
    "text" : "Yeah, definitely a body weight foul. Yeah. That shit's ruining the game. I tell you what."
  },
  {
    "timestamp" : "48:00-48:00",
    "speaker" : "Steve",
    "text" : "I agree."
  },
  {
    "timestamp" : "48:00-48:18",
    "speaker" : "Greg",
    "text" : "Yeah. They need to like change how many yards it is or something. Like or like give like you know how they change it from like roughing the kicker to like contact with the kick like they need to do they because they can't just keep giving away 15s for nothing, you know on a on a judgment call."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "48:18-48:20",
    "text" : "It's changing one is the worst though."
  },
  {
    "speaker" : "Andy",
    "text" : "Because they don't even know they don't they haven't even decided what taunting is. They just make it up as they go.",
    "timestamp" : "48:21-48:25"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah.",
    "timestamp" : "48:25-48:25"
  },
  {
    "speaker" : "Andy",
    "text" : "So bad.",
    "timestamp" : "48:26-48:26"
  },
  {
    "text" : "Garbage. I wouldn't be surprised if they get rid of taunting, but they're not going to get rid of rough in the pasture, so they need to figure it out. That's true. And right now they're just like they have no idea what they're doing. They're just like anything, flag. I'm sorry, are we complaining about the refs here? I'm complaining about current day refs.",
    "timestamp" : "48:26-48:42",
    "speaker" : "Greg"
  },
  {
    "text" : "You're doing a pretty good job, Greg.",
    "timestamp" : "48:43-48:44",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "48:44-48:56",
    "text" : "I like this. We're complaining about the movie, not the referees. You're doing a good job as a as DM. It's not their fault. It's the rules' fault. That's right. Not with the taunting, it's not."
  },
  {
    "speaker" : "Andy",
    "text" : "Making the episode.",
    "timestamp" : "48:58-48:59"
  },
  {
    "speaker" : "Steve",
    "text" : "They don't want to call taunting penalty, but you know, ginger street. Right, it's a hard job.",
    "timestamp" : "48:59-49:03"
  },
  {
    "timestamp" : "49:03-49:09",
    "speaker" : "Andy",
    "text" : "Cut the cut them a break. They're humans. This is part-time. They should be full-time."
  },
  {
    "speaker" : "Greg",
    "text" : "He's the best referee in the league right now. Who? Bill Levy.",
    "timestamp" : "49:09-49:15"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:15-49:16",
    "text" : "Oh, all right."
  },
  {
    "text" : "He used to be a fireman. Used to be a fireman. Well, yeah, he's good under pressure. That's what John that's so John Mann told me he used to be a fireman and then he retired and now he's a referee, which is kind of interesting.",
    "timestamp" : "49:16-49:29",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:29-49:32",
    "text" : "That's very interesting. Uh-huh. Thanks for that stat."
  },
  {
    "speaker" : "Greg",
    "text" : "All right, you want to do best of worst? Yeah. He also, he when he was talking about Larry Johnson, he said uh they haven't they haven't pulled the cork on him yet. As in like he they haven't like let him go and play yet, which I thought was like, I don't know. I've never heard anyone say that.",
    "timestamp" : "49:33-49:51"
  },
  {
    "text" : "I thought it was that that's a wine snob thing right there.",
    "timestamp" : "49:51-49:54",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "He's a pretty well spoken guy.",
    "timestamp" : "49:55-49:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, it definitely is. Yeah.",
    "timestamp" : "49:57-49:59"
  },
  {
    "timestamp" : "50:00-50:01",
    "speaker" : "Greg",
    "text" : "Have you guys watched the documentary?"
  },
  {
    "speaker" : "Andy",
    "text" : "Not yet. It's on my list though.",
    "timestamp" : "50:02-50:03"
  },
  {
    "timestamp" : "50:04-50:09",
    "speaker" : "Greg",
    "text" : "Homework for next week. We'll loop back around and talk some uh some mad and okay."
  },
  {
    "speaker" : "Steve",
    "text" : "Can do that. All right, let's start with best and worst then. I got a best on a Madden there.",
    "timestamp" : "50:10-50:15"
  },
  {
    "speaker" : "Andy",
    "text" : "Give it to me, Steve.",
    "timestamp" : "50:15-50:16"
  },
  {
    "speaker" : "Steve",
    "text" : "They're talking about what Belcheck looks at for employers. You know, it's like all like the intangible stuff. And like even on that list is how they interact with the equipment guy. And John's like, well, I never really cared about that, but all the other stuff for sure.",
    "timestamp" : "50:16-50:29"
  },
  {
    "timestamp" : "50:30-50:33",
    "text" : "Yeah, that was funny. That's awesome.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "50:34-50:41",
    "text" : "Uh one of my worst is Matt Light. He was just not good. He hasn't been good at all this his entire career up to this point.",
    "speaker" : "Steve"
  },
  {
    "text" : "He's not okay. He just struggles with speed rushers.",
    "speaker" : "Andy",
    "timestamp" : "50:42-50:45"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "50:45-50:53",
    "text" : "Always has You know how good he is? You know, just like you saw Jared Allen earlier, and you're like, wow, he's gonna be really good. And you can see that in Matt Light, but man, he sucks at the beginning of his career."
  },
  {
    "text" : "He struggled a bit. It was always against like certain people too. Like he would have just a bad game where the entire game was terrible. But then you don't hear from him for three weeks.",
    "timestamp" : "50:53-51:03",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:03-51:04",
    "speaker" : "Steve",
    "text" : "Oh, but Freene would eat him up."
  },
  {
    "timestamp" : "51:05-51:06",
    "speaker" : "Andy",
    "text" : "Oh, Freeni would eat him up all the time."
  },
  {
    "text" : "He was like so bad. Yeah, it was rough. Speed rushers. That was the thing. S best was a Tully Bentacane kick return. Oh shit. Yeah. And I said, hey, that's the that's the guy Kelly credit card swiped in the ass.",
    "speaker" : "Steve",
    "timestamp" : "51:07-51:25"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "51:26-51:26",
    "text" : "Yeah."
  },
  {
    "timestamp" : "51:29-51:34",
    "text" : "That's right. We're gonna see if we can get Talion to hear his side of that story.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, I mean he shows up to house parties in Maine, so I don't think he's like I know, I just want to hear from his perspective.",
    "timestamp" : "51:35-51:41"
  },
  {
    "text" : "That's all. Tolly. All right, great, you got you got some best and worse? Andy, Greg is driving this.",
    "timestamp" : "51:41-51:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Get off Greg. Greg is driving the bus.",
    "timestamp" : "51:53-51:54"
  },
  {
    "text" : "Alright, I'll give you some best or worst.",
    "timestamp" : "51:54-51:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:57-51:59",
    "text" : "Please learn it to one of each.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:01-52:02",
    "text" : "Uh my best is just Dante."
  },
  {
    "text" : "Greg, he doesn't even have one to give.",
    "timestamp" : "52:03-52:05",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:05-52:17",
    "text" : "My best amount some random player. That's right. My best has nothing to do with this game. It's uh Dante Hall's YouTube highlights. That's true. Those are electric."
  },
  {
    "text" : "Those are.",
    "timestamp" : "52:18-52:18",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "52:18-52:22",
    "speaker" : "Andy",
    "text" : "Yeah, we'll link them in the show notes. It's worth the watch. It's amazing."
  },
  {
    "timestamp" : "52:23-52:27",
    "speaker" : "Greg",
    "text" : "There's one particular the one where he like runs backwards. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "He has a big loop back around.",
    "timestamp" : "52:27-52:29"
  },
  {
    "speaker" : "Greg",
    "text" : "That one's so ridiculous. Who else you got on that list of like best YouTube guys? Barry Sanders for sure. Barry Sanders.",
    "timestamp" : "52:29-52:39"
  },
  {
    "speaker" : "Andy",
    "text" : "There's like a list of a hundred best Barry Sanders run, and they're all like Yes. Top runs from anybody else. It's like YouTube Island. He's got a hundred of them.",
    "timestamp" : "52:40-52:51"
  },
  {
    "speaker" : "Greg",
    "text" : "What was the guy that played for the Saints that won the Heisman at USC? Oh, Reggie Bush. Reggie Bush's college highlights are ridiculous. Absurd. Yeah, yeah, yeah, yeah. He's just making people look silly.",
    "timestamp" : "52:51-53:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Actually, Barry Sanders for that too. Uh Uh Dion Lewis's college highlights.",
    "timestamp" : "53:04-53:10"
  },
  {
    "timestamp" : "53:11-53:12",
    "speaker" : "Greg",
    "text" : "Seeing good. Yeah."
  },
  {
    "timestamp" : "53:12-53:18",
    "speaker" : "Andy",
    "text" : "Those were dirty. See that. That's a that's a bit of a deep cut. Um Randy Mossy Moss."
  },
  {
    "text" : "Anything. Randy Moss Vikings highlights are insane. Any any Randy Moss highlights.",
    "timestamp" : "53:18-53:22",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "53:22-53:24",
    "speaker" : "Andy",
    "text" : "Any Randy Moss. Even his college highlights are dirty."
  },
  {
    "text" : "But there's something about the Vikings ones where it's just so raw. Like the talent is so like. Like you it just compared to the other players in the field, you're like, this guy is not in the same week. He's not human. Yeah. Fucking so fun to watch.",
    "speaker" : "Greg",
    "timestamp" : "53:24-53:39"
  },
  {
    "speaker" : "Andy",
    "text" : "Lawrence Taylor, too, I would say. Just just throwing people around like ragdolls. Yeah. That's a good one. So who do we have? We had Dante Hall, Reggie Bush at USC, Reggie Dion Bush, USC, Deon Lewis, Dion Lewis. Randy Moss. Oh, Barry Sanders.",
    "timestamp" : "53:40-54:08"
  },
  {
    "text" : "Um McGruff, what McGuffey? Remember McGuffey?",
    "timestamp" : "54:12-54:16",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Well he had a hilarious nickname, right? The fridge guy? Isn't there like a college quarterback? That was like huge.",
    "timestamp" : "54:17-54:24"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, you're you're talking about the hefty lefty.",
    "timestamp" : "54:24-54:26"
  },
  {
    "text" : "Um that's somebody different. That's Jared Lorenz and Lorenz.",
    "speaker" : "Greg",
    "timestamp" : "54:26-54:29"
  },
  {
    "timestamp" : "54:29-54:32",
    "text" : "Put him on there because his highlights are hilarious. Yeah, they are.",
    "speaker" : "Steve"
  },
  {
    "text" : "McGuffey was like this white kid from Texas that was like it was like pee-wee football and he was just like dominant. Oh that was like right when YouTube first came out.",
    "speaker" : "Greg",
    "timestamp" : "54:34-54:45"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, yes, yeah. Super old.",
    "timestamp" : "54:45-54:47"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "54:47-54:56",
    "text" : "Yeah, yeah. Oh shit. I didn't even know that had a that he was the first guy to hurdle somebody, a defender. Sam McGuffey or something like that."
  },
  {
    "timestamp" : "54:57-55:05",
    "speaker" : "Andy",
    "text" : "Sam McGuffey. We're gonna write it down and see if we can find him. That one might not make the list of links, but we'll try."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:05-55:08",
    "text" : "Just wait. You're gonna watch it and be like, this one's top of the list."
  },
  {
    "text" : "I've never seen it.",
    "timestamp" : "55:08-55:10",
    "speaker" : "Andy"
  },
  {
    "text" : "You probably have.",
    "timestamp" : "55:10-55:12",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "55:12-55:46",
    "text" : "Alright. Not bad, right? No. My worst is uh Just the fact that these Chiefs are a losing team. They are they joined the 1975 Buffalo Bills as the only two teams in NFL history to score an average. Of at least 30 points per game and miss the playoffs. Like that's that's garbage. Hard to do. That's hard to do. Like how bad does your defense have to be? Yeah."
  },
  {
    "text" : "And they were dumb too. Madden kept saying that throughout the game. Where it'd be like he'd be like, well, that's why the Patriots are the Patriots, and that's why the Chiefs are the Chiefs. Because they like Like clearly have talent, but they're just doing dumb shit, you know, or like not tackling or whatever. Yeah.",
    "timestamp" : "55:48-56:02",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:02-56:09",
    "text" : "Well, their defense is bad, yeah. Yeah. That Dion branch run, especially like He ran through the hole. He's like, you can't let him run through your whole defense. Yeah."
  },
  {
    "text" : "Well the Daniel Graham one too. Yeah, there's a bunch of them that was like He Were those were those Greg-esque enough? That was good, Andy. Those are better. Yeah, you should do the ones like that more often. All right.",
    "timestamp" : "56:10-56:21",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm watching a McGuffey mixtape right now.",
    "timestamp" : "56:21-56:24"
  },
  {
    "speaker" : "Greg",
    "text" : "You remember him?",
    "timestamp" : "56:24-56:25"
  },
  {
    "speaker" : "Steve",
    "text" : "No, I never seen it before.",
    "timestamp" : "56:25-56:26"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay. All right, my um my worst Is the Patriots giving up the longest play of Kansas City season? Oh for Earthwin Moreland. Oh, I saw it in the highlights. That was bad. It was like a 75-yarder. Um I uh keep wanting to say Gruden Madden, another good point there too, where it was like there they were collapsing on the middle. Because they were so scared of Gonzalez, because you know Belichick's always trying to take away the best player. So he's like when you do that, you leave the sidelines open. So they threw a like a go route on the border. So that might be why so that's a good point. And my best is Earthwind Moreland's uh intro, because it's Monday Night Football, so they do the like the so-and-so from so-and-so. Yeah, yeah, yeah. He said Earthwind Moreland from One double A powerhouse Georgia Southern. Fuck yeah, dude. Repum.",
    "timestamp" : "56:27-57:28"
  },
  {
    "timestamp" : "57:29-57:31",
    "speaker" : "Andy",
    "text" : "Georgia Southern. They were uh a UNH"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Rival for a while.",
    "timestamp" : "57:32-57:33"
  },
  {
    "text" : "They're a powerhouse. There's no doubt about it. Don't they run the uh triple option, I believe? Probably. I believe that's their deal. Yeah. But they're like one of the best in the country at the triple option. Yeah.",
    "timestamp" : "57:34-57:46",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "57:46-58:02",
    "speaker" : "Greg",
    "text" : "Apparently the You know Deion Sanders is coach of Jackson State? Yeah. He just got the number one recruit in the country. I heard that. By paying them, right? Uh I don't know. I don't think so."
  },
  {
    "text" : "I thought I thought it we you can't pay him. Uh you can pay him for his likeness now, so I thought he did like some bars tools on me. School's game.",
    "speaker" : "Andy",
    "timestamp" : "58:07-58:17"
  },
  {
    "text" : "Uh COVID. Good. I'm glad they can get paid. Should be more of that in college football.",
    "timestamp" : "58:19-58:25",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "58:25-58:31",
    "speaker" : "Andy",
    "text" : "Damn right. That's right. You tell them, Stevie. Work for free. What is this bullshit? That's right."
  },
  {
    "text" : "Student athletes. Goodness.",
    "speaker" : "Greg",
    "timestamp" : "58:32-58:36"
  },
  {
    "text" : "Greg, how much do you think you would have been paid?",
    "timestamp" : "58:36-58:39",
    "speaker" : "Andy"
  },
  {
    "text" : "Me? I wasn't worth a fucking nickel, did.",
    "timestamp" : "58:39-58:43",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Greg, I had to pay them.",
    "timestamp" : "58:43-58:45"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. I was very aware self-aware that I was worth nothing to that school.",
    "timestamp" : "58:45-58:52"
  },
  {
    "timestamp" : "58:53-58:55",
    "speaker" : "Andy",
    "text" : "Oh, fair enough. Yeah."
  },
  {
    "timestamp" : "58:55-58:58",
    "speaker" : "Greg",
    "text" : "You're worth something to me though, Greg. That's all that matters, dude."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "58:59-59:00",
    "text" : "That's nice."
  },
  {
    "timestamp" : "59:00-59:01",
    "speaker" : "Greg",
    "text" : "My love is priceless."
  },
  {
    "timestamp" : "59:02-59:03",
    "speaker" : "Steve",
    "text" : "That's true."
  },
  {
    "text" : "All right, well that pretty much wraps it out, right? You guys got anything else? Any parting thoughts? How do you think the Pats are gonna uh fare this week against the Dolphins?",
    "timestamp" : "59:05-59:14",
    "speaker" : "Greg"
  },
  {
    "text" : "I have one parting thought. This McGuffey mix mixtape, not that good, Greg.",
    "speaker" : "Steve",
    "timestamp" : "59:14-59:18"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, but it's the first one, Steve. It's like uh where what is that Casablanca where the movie actually blows, but it's like the first one that was actually like modern.",
    "timestamp" : "59:18-59:26"
  },
  {
    "timestamp" : "59:27-59:32",
    "speaker" : "Steve",
    "text" : "I guess I can see that. You can see some of the VCR recording stamps in this thing. Oh yeah. Oh yeah. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, definitely hand cut. And like, you know how like when you used to watch them before you realized that like just cause you're good at like pee-wee doesn't make you good at Pro, you know? Oh yeah. So you'd be like, dude, I'm a I'm a follow this guy till he's in the league.",
    "timestamp" : "59:33-59:48"
  },
  {
    "timestamp" : "59:49-59:49",
    "speaker" : "Andy",
    "text" : "Yeah, yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "And that was the first time you were like, oh wait. No, he sucks that everybody else grew up.",
    "timestamp" : "59:50-59:55"
  },
  {
    "text" : "Yeah. They all caught up to him in size and speed. Yeah, yeah. Now he's mediocre.",
    "speaker" : "Andy",
    "timestamp" : "59:55-01:00:00"
  },
  {
    "text" : "Uh-huh.",
    "timestamp" : "01:00:00-01:00:00",
    "speaker" : "Greg"
  },
  {
    "text" : "All right, what's next week, Greg?",
    "timestamp" : "01:00:01-01:00:03",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh that's a good question. You tell me.",
    "timestamp" : "01:00:03-01:00:05",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:00:06-01:00:26",
    "speaker" : "Andy",
    "text" : "We'll statch it. Week 12. Uh Patriots hosting the Baltimore Ravens, 7 and 3. Baltimore Ravens. Ooh, that sounds like a good game. Brian Billick. Yo, buddy. That's exciting. I don't remember these games. All right, take us out, Greg."
  },
  {
    "speaker" : "Greg",
    "text" : "Well, until next time, I hope you bitches stay safe and stay clean. Unlike my two fucking dumbass brothers here, wear your mask. Get your booster. Don't be an idiot.",
    "timestamp" : "01:00:27-01:00:43"
  }
]