[
  {
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother."
  },
  {
    "text" : "Welcome back to the Patriots Dynasty Podcast. I'm your host, Andy Brown, with me today. Surprise both brothers, Steve and Greg. Greg, we knew was going to be here. Steve is a last-minute uh Decision, a game time decision, if you will. Been traveling the world. Steve, how's it going?",
    "speaker" : "Andy",
    "timestamp" : "00:21-00:47"
  },
  {
    "text" : "You know, I just just like Troy Brown, just whatever you guys ask me, I'll I'll grut it out and and make it happen.",
    "speaker" : "Steve",
    "timestamp" : "00:47-00:54"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, unlike the uh Patriots defensive backfield in this game, Steve actually showed up, so thanks for that. And we have Greg back. He haven't had uh Greg in a while. Kind of like uh Corey Dill in this game, haven't seen him in a few weeks, but uh he's back too. How you doing, Jake?",
    "timestamp" : "00:55-01:10"
  },
  {
    "text" : "That's right. Good. Summer Greg, you know? Yeah. He's out partying, living large.",
    "speaker" : "Greg",
    "timestamp" : "01:10-01:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah? So what you been doing really?",
    "timestamp" : "01:18-01:20"
  },
  {
    "text" : "You know, nothing. Yeah. Not even. There's a lot of YouTube Scrolling, you know, social media, read it for hours on end until I feel actually pain in my body. Yeah.",
    "timestamp" : "01:21-01:38",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "So the usual. Okay. Yeah, yeah. Nice. All right. So this week we're talking about 2004, week nine. Patriots headed to St. Louis, Missouri. Missouri? Yeah? That feels right. St. Louis, Missouri. To uh to take on the St. Louis at the time Rams, who are now the LA Rams. Um, this is the rematch of Super Bowl 36. These two teams haven't seen each other since then. When the Patriots beat the the Rams in that game. Uh a lot of stuff is the same. Same head coach Mike Marts. Same offensive weapons. Isaac Bruce. Who else is on that? Tori Holtz, Marshall Falk. But there's some new things. I didn't see Ricky Pearl show up. I don't think he may have been on the team, but if he was. Huh?",
    "timestamp" : "01:39-02:34"
  },
  {
    "text" : "He was on the Panthers.",
    "speaker" : "Steve",
    "timestamp" : "02:34-02:35"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:36-02:39",
    "text" : "Oh, that's right. Yeah, he was on the Panthers in 2003, yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "02:39-02:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:40-03:00",
    "text" : "Um But there were some some new names that we saw. Quarterback is no longer uh a bag a grocery bagger. It is now Mark Bulger, who coming into this game was the winning winningest quarterback by win percentage. It would start at least 10 games. I don't think that held up, but we may need to stat check that."
  },
  {
    "timestamp" : "03:00-03:06",
    "speaker" : "Greg",
    "text" : "Yo, I I was pissed about that when I saw that Kurt Warner wasn't starting, that they just threw him on the trash heap."
  },
  {
    "timestamp" : "03:07-03:17",
    "text" : "They did, yeah. Two years ago he started in the Super Bowl for him, winning MVPs. Yeah, for like the greatest show on turf, the best offense the NFL has ever seen.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "03:17-03:17",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "03:18-03:22",
    "speaker" : "Andy",
    "text" : "I think he suffered some injuries though. And he struggled a bit because of it."
  },
  {
    "timestamp" : "03:22-03:35",
    "text" : "Uh apparently he like missed a bunch of game after the Super Bowl season against the Pets, he missed a bunch of games And like only played seven games. And the next year he only played one game and he fumbled six times.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "03:36-03:38",
    "speaker" : "Andy",
    "text" : "Six times? Holy crap."
  },
  {
    "timestamp" : "03:39-03:47",
    "speaker" : "Greg",
    "text" : "I guess he had a a broken thumb so he couldn't hold the ball. But then at the end like, dude, just get off the field. If you if you're just what are you doing? Yeah."
  },
  {
    "text" : "After the first three, you gotta realize something's not not right and this isn't gonna go well. Um and also uh Steve, I'm glad you're here because this is, I think it may have been your favorite player for a while, Steven Jackson. Is that right? No, just because his name is the same as mine doesn't mean No, I really thought you were a huge Steven Jackson fan, no?",
    "timestamp" : "03:48-04:10",
    "speaker" : "Andy"
  },
  {
    "text" : "No.",
    "timestamp" : "04:10-04:10",
    "speaker" : "Steve"
  },
  {
    "text" : "All right, well fucking. Who's a big Steven Jackson fan? Then you can leave.",
    "timestamp" : "04:10-04:13",
    "speaker" : "Andy"
  },
  {
    "text" : "He's even spelled the same.",
    "timestamp" : "04:15-04:16",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, he spells with a V. What an asshole. It's like Greg with two G's. Double G Greg's the worst. Greg Berhalter. Now I'm pissed to Greg Burhalter too.",
    "speaker" : "Greg",
    "timestamp" : "04:16-04:27"
  },
  {
    "text" : "But who's the guy that used to write for or maybe still does write for ESPN? Who's like a super pedantic prick?",
    "speaker" : "Andy",
    "timestamp" : "04:27-04:33"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "04:33-04:39",
    "text" : "Yeah. I swear to God, every Greg with three G's in it is just a dickhead. I didn't even think that there's three G's."
  },
  {
    "text" : "Who was the who was the coach in the uh in the the Bills for a while too? Greg uh Greg Williams.",
    "speaker" : "Andy",
    "timestamp" : "04:39-04:43"
  },
  {
    "text" : "Greg Williams, yeah. Greg Williams. Yeah, that's a double J fame. Yeah. And the the US men's national team coach right now that's like shit in his pants every game playing like Trinidad and Tobago. He's a he's a triple G too. Triple G G is Fucking they could they they his nickname is Triple G. So everyone on Reddit calls him because they hate him so much.",
    "speaker" : "Greg",
    "timestamp" : "04:44-05:09"
  },
  {
    "timestamp" : "05:11-05:57",
    "speaker" : "Andy",
    "text" : "That feels right. Yeah. Um yeah, so um the other player who is still the same but a little bit different in this game is Grant Williams. Uh offensive lineman who started in that Super Bowl on the offensive line for the Patriots, but is now starting uh for the Rams. And uh that's also good for the pages because he was fucking terrible in this game and gave up a handful of sacks. So good for him. Uh and also I think we've already talked Well, I think we did like a bit of a deep dive last time during the Super Bowl about Leonard Little and how much of a scumbag he was. But he's an easy dude to dislike. So I just wanted that out there. Let's fuck that guy."
  },
  {
    "timestamp" : "05:57-06:03",
    "speaker" : "Greg",
    "text" : "Also, the Rams are two and a half point favorites coming into this game, which I found quite shocking. Right."
  },
  {
    "text" : "I guess you get the three points for being at home.",
    "speaker" : "Steve",
    "timestamp" : "06:04-06:06"
  },
  {
    "timestamp" : "06:07-06:23",
    "speaker" : "Greg",
    "text" : "Patriots are coming off a 20 whatever game win streak against the four and three Rams. It's like, geez. People must have been flying on Mark Bulger. I feel like I remember Mark Bulger being like a the hot ticket. Yeah."
  },
  {
    "text" : "Yeah. So Mike uh Mark Bulger, 15 and 1 at home in his career coming into this game. So he doesn't lose at home. Yeah. Uh that didn't last. None of I don't think any of these stats lasted. Do you have his his uh his numbers like career-wise? My guess is he didn't win a ton of games down the stretch. But while you're looking that up. Uh, we'll talk about the Patriots coming in this game. Last week, uh Steve, I think, may still be angry at me for continuing to talk about it. Because that was a bad game.",
    "speaker" : "Andy",
    "timestamp" : "06:23-06:55"
  },
  {
    "text" : "That was a bad episode.",
    "speaker" : "Steve",
    "timestamp" : "06:55-06:57"
  },
  {
    "speaker" : "Andy",
    "text" : "Got their doors blown off by the Steelers.",
    "timestamp" : "06:57-07:00"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "07:00-07:05",
    "text" : "Why was it a bad episode? Andy wouldn't stop talking about the Steelers."
  },
  {
    "speaker" : "Andy",
    "text" : "Steve Steven does like to talk about losses, which we I think we had all forgotten because we haven't had one in twenty-something episodes. Uh and I had other stuff I wanted to talk about because I actually watched the game and he's a good thing.",
    "timestamp" : "07:05-07:17"
  },
  {
    "text" : "You weren't there, Greg, to go on just stupid tangents and fill a bunch of time with a bunch of useless shit, so all Andy talked about was a stealer.",
    "speaker" : "Steve",
    "timestamp" : "07:17-07:23"
  },
  {
    "timestamp" : "07:24-07:25",
    "speaker" : "Andy",
    "text" : "Oh, the worst, dude."
  },
  {
    "speaker" : "Steve",
    "text" : "The worst. And like he just wouldn't shut up.",
    "timestamp" : "07:25-07:28"
  },
  {
    "timestamp" : "07:28-07:32",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, no, that's that's pretty accurate rendition of what happened last time."
  },
  {
    "timestamp" : "07:33-07:49",
    "speaker" : "Greg",
    "text" : "Um his statek, Mark Folger. Um he 2007 he went two and ten, two thousand eight, two and thirteen, two thousand nine, one and seven. So yeah. I think the wheels came off a little bit there at the end."
  },
  {
    "timestamp" : "07:50-08:13",
    "text" : "Sounds like it, yeah. Yeah. Great. Okay. Oops. But coming into this, he was he was hot. Um so maybe it was the patrons that just rattled him or maybe they showed the I don't know. Uh, 'cause he had won a bunch of games coming into this. But and the Patriots got their doors blown off in Pittsburgh last week and came into this game with Literally no defense packs. Huh?",
    "speaker" : "Andy"
  },
  {
    "text" : "Halloween, right? Yes, it goes up. Did you guys dress up? You should have dressed up for the Halloween game. I dressed up. Maybe a little spook spooky costume.",
    "speaker" : "Greg",
    "timestamp" : "08:14-08:24"
  },
  {
    "timestamp" : "08:24-08:27",
    "text" : "Spooky costume. The game was spooky enough.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Steve, what's your Halloween costume this year gonna be?",
    "timestamp" : "08:27-08:29"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh I'm gonna be in Arizona for Halloween, so I'm not gonna have a costume.",
    "timestamp" : "08:30-08:33"
  },
  {
    "speaker" : "Andy",
    "text" : "There's gonna be a cardinal.",
    "timestamp" : "08:33-08:34"
  },
  {
    "text" : "There's gonna be a cactus. Paint yourself green. Dude, that's a good one, Andy.",
    "timestamp" : "08:35-08:39",
    "speaker" : "Greg"
  },
  {
    "text" : "And just walk around with your arms up and like goalposts.",
    "timestamp" : "08:39-08:42",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "08:44-08:46",
    "text" : "Yeah. Well cacti.",
    "speaker" : "Greg"
  },
  {
    "text" : "Shave your head if you if you want to go all in.",
    "timestamp" : "08:46-08:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:49-08:52",
    "text" : "You can just tell people to shut up and get away from meeting this be Exactly."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:52-08:53",
    "text" : "Yeah, just be a complete deep people."
  },
  {
    "speaker" : "Steve",
    "text" : "Be a prick.",
    "timestamp" : "08:54-08:54"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "08:55-08:55"
  },
  {
    "text" : "That's good. I might steal that.",
    "timestamp" : "08:57-08:59",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "09:02-09:02",
    "speaker" : "Andy",
    "text" : "A lot of green paint."
  },
  {
    "timestamp" : "09:03-09:05",
    "text" : "No, Greg, you can be Greg Berhalter.",
    "speaker" : "Steve"
  },
  {
    "text" : "The same thing, right? Brickly. Greg Williams, even. Uh yeah, but uh speaking of prickly, this defensive backfield for the Patriots. Super prickly because there was nobody there.",
    "timestamp" : "09:06-09:21",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh yeah, how did we get here?",
    "speaker" : "Steve",
    "timestamp" : "09:21-09:23"
  },
  {
    "text" : "So Ty Law hurt himself last game, remember Steve?",
    "timestamp" : "09:24-09:27",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "09:28-09:29",
    "text" : "Yeah, that was his last snap.",
    "speaker" : "Steve"
  },
  {
    "text" : "Right, and that that's that's when the wheels fell off for the um Imagine that.",
    "timestamp" : "09:29-09:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "09:34-09:35",
    "text" : "Right."
  },
  {
    "speaker" : "Andy",
    "text" : "But Steve was, I think Steve Arms, that may have been his last snap as a patriot.",
    "timestamp" : "09:35-09:39"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "09:39-09:41",
    "text" : "Yeah. Pretty sure it was. That's pretty sure it was."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:42-10:12",
    "text" : "Tough way to go out. Um And then Tyrone Poole also, I think, got injured. I don't know if it was during that game or during the practice up to this, but he didn't start at all. And then on literally the second defensive play from scrimmage. Asante Samuel tried to tackle someone, and that's all all he needed to do. Um tried to tackle the tight end and I think separate his shoulder or something like that. So he was out. Which meant your defensive backs were Dexter Reed and Earthwind Moreland."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "10:12-10:12",
    "text" : "Oh."
  },
  {
    "text" : "Which Earth all-time all-time name team, I think. Uh easy.",
    "speaker" : "Andy",
    "timestamp" : "10:14-10:18"
  },
  {
    "text" : "Aaron? Have a nickname for him?",
    "timestamp" : "10:18-10:20",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "10:21-10:23",
    "text" : "Oh he's gonna be Earth Wind in Fire, right?",
    "speaker" : "Andy"
  },
  {
    "text" : "Well, do you know how he got his name? No. He's gotta be Earth Wind in Fire, right? Yeah, obviously, Steve, you're fucking idiot.",
    "timestamp" : "10:24-10:31",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "10:31-10:31",
    "speaker" : "Mom",
    "text" : "What do you mean?"
  },
  {
    "timestamp" : "10:32-10:37",
    "speaker" : "Steve",
    "text" : "You're gonna go down this 15-minute rapture. Yeah, so guy gives his whole backstory."
  },
  {
    "timestamp" : "10:37-10:42",
    "speaker" : "Greg",
    "text" : "No, his name's Earthwind. Obviously his mom's favorite band was Earthwind and Fire. Come on, dumbass."
  },
  {
    "timestamp" : "10:42-10:44",
    "text" : "No, you don't know that for sure.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "10:44-10:47",
    "speaker" : "Greg",
    "text" : "Yeah, it could have been his dad's river band. Seriously, it was on his Wikipedia."
  },
  {
    "text" : "I mean that that's gotta be like the first line of Wikipedia, right? Is why the fuck is he named Earthwind? I mean that's a pretty badass name though.",
    "timestamp" : "10:49-10:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "10:56-11:19",
    "speaker" : "Greg",
    "text" : "Earthwind Moreland is just a fucking fire name in itself. It really is. That's why they didn't put the fire in there, is because it Because you didn't. It could be his middle name, you never know. No, I looked into that. I don't know, but it starts with a C. Earth wouldn't see. Cornelius."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. It's gotta be something badass.",
    "timestamp" : "11:19-11:22"
  },
  {
    "speaker" : "Steve",
    "text" : "Chad.",
    "timestamp" : "11:22-11:22"
  },
  {
    "text" : "Chad wicket. Chad. So yeah, him and uh Dexter Reed and uh Randall Gay, I believe it was. are your three defensive backs, which means um actually that's two defensive backs, uh two cornerbacks and a safety with um your boy Greg Brown. Wilson. Yeah. Uh Eugene Wilson. So they needed a slot corner to play in the nickel. Because the Rands like to run three wide receiver sets a lot. And so this is a sneakier game because this is the First ever appearance of two-way player, wide receiver and cornerback, Troy Brown.",
    "timestamp" : "11:23-12:07",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Whoa, whoa, whoa, whoa. He's a three-way player. Wide receiver, cornerback, front returner, kick returner, everything.",
    "timestamp" : "12:08-12:14"
  },
  {
    "text" : "That's true. All right. Four-way play. He lined up a quarterback once too.",
    "speaker" : "Andy",
    "timestamp" : "12:14-12:18"
  },
  {
    "speaker" : "Greg",
    "text" : "Running back. Throw it all in. Yeah, he's he's taking some gunner. He's definitely a gunner at some point. Yeah, he must have been, yeah. uh punt block slash pitch to other guy in AFP. Yeah, whatever.",
    "timestamp" : "12:18-12:35"
  },
  {
    "timestamp" : "12:35-12:52",
    "speaker" : "Andy",
    "text" : "Whatever the hell that player was. So I think uh while obviously the AFC Championship game in a one was his like peak Troy Brown moment. This may be like number two. Peak Troy Brown. Cause he uh yeah. Because Hitler, here's his stat line in this game, right?"
  },
  {
    "text" : "Uh I have a counter argument. Go ahead.",
    "timestamp" : "12:52-12:55",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:56-13:28",
    "text" : "All right. Yeah. A couple catches. Uh one for a touchdown, not off of Tom Brady. Uh and played obvious I he wasn't actually punt returning in this game, because obviously he had other shit to do. Um, but he also was in coverage for like half the game. And actually had a pass breakup that probably would have been an interception if the ball wasn't tipped at the line of scrimmage. So pass breakups and I think he may have actually been in on one of the tackles. I don't know if you got credit for it or not, but he was definitely in the vicinity."
  },
  {
    "text" : "He has three tackles.",
    "timestamp" : "13:29-13:30",
    "speaker" : "Steve"
  },
  {
    "text" : "Three tackles?",
    "speaker" : "Andy",
    "timestamp" : "13:30-13:31"
  },
  {
    "speaker" : "Steve",
    "text" : "Three.",
    "timestamp" : "13:31-13:32"
  },
  {
    "timestamp" : "13:32-14:11",
    "speaker" : "Andy",
    "text" : "Ha! See, there you go. So, and he's covering the likes of Isaac Bruce and fucking uh not Ricky Pro, who am I thinking of? Tory Holt. I forget his name every time. Tori Holt. So it's not like he's covering scrubs either. He's uh he did get turnaround once, but that's okay. And he had a pass interference calling them, which I will say right now, absolute bullshit. It was back in the time of the league where they were doing like face guarding that they don't call anymore. And he didn't even touch the guy, but like jumped in front of him and didn't turn his head enough. You know, one of those bullshit calls. So he's a great so two pass breakups, one on the on the stat sheet."
  },
  {
    "timestamp" : "14:12-14:21",
    "text" : "Uh it kind of makes sense to me though, because it's like how much of playing cornerback is like X's and O's? I can't imagine it's that much, right?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "14:22-14:28",
    "text" : "Uh I think having watched him, the only time he got confused is when he had to play zone.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:29-14:29",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "14:30-14:36",
    "text" : "Because that's tough. But if you just line up man man to man, I think A lot of the wide receiver stuff translate because he knows what the guy in front of him is trying to do.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "14:37-14:50",
    "text" : "And it's like just be quick. You know, quick fee. You know, get your head turned around at the right time, like technique stuff more so than like, yeah, know your zone or like, you know. A Yeah, you gotta know coverage things."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah. You gotta know how to pass off the guys or whatever. So it actually it got me thinking, uh obviously we know Edelman played in a similar situation. Is there anybody on today's team that you think could do the same thing?",
    "timestamp" : "14:51-15:03"
  },
  {
    "text" : "Gunner.",
    "timestamp" : "15:03-15:04",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I I think part retard is in general.",
    "timestamp" : "15:05-15:08"
  },
  {
    "text" : "Who? Sorry. So I it's funny. Because I actually like, I was like, you know, I wonder if this has been done more often. And I looked it up and there was a Reddit thread of someone asking that question.",
    "speaker" : "Greg",
    "timestamp" : "15:09-15:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "15:20-15:20"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "15:21-15:32",
    "text" : "And it was back when Nelson Aguilar was on the Eagles. And he goes. Uh he goes, Nelson Aguilar plays defensive back right now. He's like, he's knocked out more passes than I can count."
  },
  {
    "timestamp" : "15:34-15:47",
    "speaker" : "Andy",
    "text" : "I mean that's that's a a timely throwback right there considering you can just watch the Cowboys game and him throw a pass to the ground in in overtime. That's probably if he had caught it would have gone for the distance."
  },
  {
    "speaker" : "Greg",
    "text" : "Such a such a Phillies fan joke to make though. I love that whole like making fun of Aguilar bit they do.",
    "timestamp" : "15:48-15:54"
  },
  {
    "text" : "It's so good. Oh my god.",
    "speaker" : "Andy",
    "timestamp" : "15:54-15:57"
  },
  {
    "speaker" : "Greg",
    "text" : "So do you do Can you think of anybody else that's done it in the past? To wait. In like recent history, because obviously, like, you know, the wicked old school guys all uh I know",
    "timestamp" : "15:58-16:11"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:12-16:19",
    "text" : "We saw Terrell Buckley line up as wide receiver. I'm gonna guess Deion Sanders probably did as well."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "16:20-16:20",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "16:23-16:25",
    "speaker" : "Andy",
    "text" : "Do you uh do you have a list?"
  },
  {
    "timestamp" : "16:25-16:40",
    "text" : "Yeah, yeah. I mean just from that Reddit thread. It's not like I couldn't find anything like solved, but right. Do you have any uh hints that you can give us? I mean the thing that jumped out to me is there wasn't is not a lot of people going from receiver to defensive back",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "It's the other way around.",
    "timestamp" : "16:41-16:42"
  },
  {
    "timestamp" : "16:42-16:47",
    "text" : "It's the other way around, which which I think is just like we have this really talented athletic guy. Let's try and get him involved.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:48-16:49",
    "text" : "Like a Devin Hester type of stuff."
  },
  {
    "text" : "Get him the goddamn ball. Yeah, yeah. Yeah, yeah. So there was one guy that led me down a little rabbit hole here. Have you heard the name Mike Furry?",
    "timestamp" : "16:50-16:59",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:00-17:01",
    "text" : "No. Yes."
  },
  {
    "speaker" : "Greg",
    "text" : "No.",
    "timestamp" : "17:01-17:01"
  },
  {
    "timestamp" : "17:01-17:03",
    "text" : "I don't know why. I recognize vaguely. Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Vague. Mike Furry. Listen to this guy's story. He's just he's like a white guy that's the same size and height as me. Six foot one seventy. He's like a he's like an all-state in in high school. He sets all these high school records. He go he walks on at Ohio State. But he's sitting behind Terry Glenn and Eddie George there. So he can't get any playing time. So he transfers to UNI, Northern Iowa. Okay. I think he might have played with Kurt Warner if the years lineup. No, no, he would have been after Kurt Watch. But either way, he's a he's a three-time All-American at UNI. Undrafted, goes to the XFL. Yeah. XFL disbands, goes to the arena league, sets a shitload of records in the arena league. Jesus. Eventually gets picked up by uh St. Louis. Okay. And of course it it might be now. Two thousand four-ish? Yeah, two thousand four. I think he's on this team. So but he he doesn't they can't they don't want him to play wide receiver, which is what he was playing in college. So he he's playing safety So in 2005, he has four interceptions and 58 tackles, playing free safety for the Rams. He gets traded to Detroit. And they have all these injuries on their wide receiver. So he switches sides and the very next year he catches 98 balls for 1,086 yards and six touchdowns.",
    "timestamp" : "17:03-18:37"
  },
  {
    "speaker" : "Andy",
    "text" : "I I I had him pictured as a Pacman. Yeah. Holy shit. What a fucking legend, dude. Yeah, in this, here he is, Mike Furry. Uh three targets, one catch, eight yards in 2004 with the with the Rams. Yeah. Jesus Christ. It's all over the place. And then doesn't really do much anything after that though. Like that one year was it.",
    "timestamp" : "18:37-19:03"
  },
  {
    "text" : "But imagine how gratifying that year was for him to just be like every coach that ever fucking doubted me can suck it. Thousand yards season, baby. And takes that away from him. You can't take that one.",
    "timestamp" : "19:04-19:18",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "19:20-19:21"
  },
  {
    "timestamp" : "19:21-19:21",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "19:22-19:25",
    "speaker" : "Andy",
    "text" : "Yeah, two thousand six, yeah. Woof."
  },
  {
    "timestamp" : "19:25-19:30",
    "text" : "So shout out Mike Furry if you're out there listening. I'm a Mike Furry stan.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:30-19:32",
    "text" : "He's both ways. Good friend."
  },
  {
    "text" : "Yeah. Also imagine a guy my size playing in the NFL at safety.",
    "timestamp" : "19:32-19:39",
    "speaker" : "Greg"
  },
  {
    "text" : "The quarterback was John Kitna, actually. Thank you very much, Steve. Nice. Who actually threw for 4,000 yards that year? 21 touchdowns, pretty good.",
    "timestamp" : "19:40-19:48",
    "speaker" : "Andy"
  },
  {
    "text" : "Caboodle.",
    "timestamp" : "19:49-19:49",
    "speaker" : "Greg"
  },
  {
    "text" : "22 interceptions, not so good. Wow. But yeah, that's that's fucking the paradox of Kitna right there. Yep. Yeah. Yeah. Oh, that was the Roy Williams years. Jesus. Okay. So any any other notables uh that played both ways, Greg?",
    "speaker" : "Andy",
    "timestamp" : "19:49-20:08"
  },
  {
    "speaker" : "Greg",
    "text" : "No, those are really the only names that were That jumped out. I mean, I tried to do a lot of searching on the internet, but that's all I really found.",
    "timestamp" : "20:09-20:16"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:16-20:21",
    "text" : "Well, if any listeners have any guys that we miss, let us know. Two-way players. Yeah"
  },
  {
    "timestamp" : "20:22-20:23",
    "speaker" : "Greg",
    "text" : "Gino Capoletti."
  },
  {
    "timestamp" : "20:24-20:25",
    "speaker" : "Andy",
    "text" : "Gino Capoletti. He did everything, didn't he?"
  },
  {
    "timestamp" : "20:26-20:37",
    "text" : "Oh yeah. Some of those old school guys played like fucking every play of the game. Dick Dick Buck has played like tight end and linebackers. Yeah. Or like quarterback and free safety. And it's like, geez.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "20:38-20:46",
    "speaker" : "Andy",
    "text" : "Exactly. Yeah. Well is that true? I mean that's also when they were playing part-time uh when they weren't being doing their full-time job as, you know, a plumber."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. Smoking butts at halftime.",
    "timestamp" : "20:46-20:49"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:49-20:50",
    "text" : "Exactly."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah.",
    "timestamp" : "20:50-20:51"
  },
  {
    "timestamp" : "20:52-20:59",
    "text" : "Uh all right. Um well I'm the only one that watched this game. Uh sucker.",
    "speaker" : "Andy"
  },
  {
    "text" : "Sucks to be you.",
    "timestamp" : "20:59-21:00",
    "speaker" : "Greg"
  },
  {
    "text" : "No, but I was thinking that uh Greg, your rating system, right? Uh-huh. Do you even remember what it is?",
    "timestamp" : "21:01-21:08",
    "speaker" : "Andy"
  },
  {
    "text" : "Yep.",
    "speaker" : "Greg",
    "timestamp" : "21:08-21:09"
  },
  {
    "text" : "All right. Uh give me the rundown again.",
    "timestamp" : "21:09-21:12",
    "speaker" : "Andy"
  },
  {
    "text" : "Um No, I don't remember it. I was hoping you would remember it.",
    "speaker" : "Greg",
    "timestamp" : "21:12-21:17"
  },
  {
    "text" : "I remember there's a there's a name game. Yeah, like the David Patton game or the snowball. Yeah, exactly.",
    "timestamp" : "21:18-21:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:25-21:26",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Um And then there was like the bottom was just like your your normal was a loss. And then it was like your normal like regular season jets.",
    "timestamp" : "21:26-21:35"
  },
  {
    "text" : "Slogging it basically. Yeah, slogan it. Uh hidden gems. Hidden gems. All right.",
    "speaker" : "Greg",
    "timestamp" : "21:35-21:41"
  },
  {
    "text" : "So there was a hit was there hidden gems?",
    "timestamp" : "21:41-21:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:43-21:49",
    "text" : "I couldn't remember. You wouldn't remember unless you actually looked it up again."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:49-22:04",
    "text" : "Yeah. I think this falls under the hidden gems one. Yeah. One of those ones where like You don't remember it all, but it's worth going back and rewatching because there was some great shit that happened. Um and we're not gonna go too deep into it just because again, I'm the one that watched this."
  },
  {
    "text" : "Well, I have a quote from Bill Belichick to that point. Okay. He said, uh, probably as complete a victory as I've ever been around.",
    "timestamp" : "22:04-22:12",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "22:12-22:19",
    "text" : "Wow. Okay. That's rich. Yeah, that's kind of surprising to hear from him."
  },
  {
    "timestamp" : "22:19-22:22",
    "speaker" : "Greg",
    "text" : "Defense, special teams, and offense, baby."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I mean the defense at the end of the first half uh got a strip sack of Bulger. That they turned into a field goal at the end of the at the end of the half.",
    "timestamp" : "22:22-22:31"
  },
  {
    "text" : "Yeah, five sacks, right?",
    "timestamp" : "22:31-22:33",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Put them up 19-15. Uh yep. Got a bunch of sacks on this I think it's supposed to be pretty good offense still, even in even though there's no Kurt Warner. It's not the greatest show on turf. Like there's still weapons. Um and they held him to 22 points. Pats won 40 to 22, by the way. Six in the NFL Yeah. Exactly. So this team could put it, this team could move the ball. And they did kind of move the ball. Um they just couldn't finish drives, basically. Um and that was also with Troy Brown at defensive back. So That probably added something to it. But yeah, I there was a lot of pressure. I mean, uh I think at least one or two of the sacks were on three-man rushes. It was like one of those.",
    "timestamp" : "22:33-23:16"
  },
  {
    "text" : "That's pretty bad.",
    "speaker" : "Steve",
    "timestamp" : "23:16-23:17"
  },
  {
    "text" : "Yeah. It was like it was it was pretty defensively overwhelming. Um and then you had Adam Vinateri who probably gets the game ball in this, I would think. At least shares it with Troy Brown because he went four for four on field goals, and none of them were gimme's. There were like 40 plus yarders. Uh and you also had a touchdown pass, which I'm a little surprised we haven't seen it since.",
    "timestamp" : "23:17-23:45",
    "speaker" : "Andy"
  },
  {
    "text" : "I didn't even know he had a touchdown pass.",
    "timestamp" : "23:45-23:47",
    "speaker" : "Steve"
  },
  {
    "text" : "He does, and it's right here.",
    "speaker" : "Andy",
    "timestamp" : "23:47-23:49"
  },
  {
    "speaker" : "Steve",
    "text" : "Did you see the play, Stevie? I did watch the highlight on the website, yes.",
    "timestamp" : "23:51-23:55"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:55-25:18",
    "text" : "Um it's not, yeah, it's it's actually a pretty impressive play. The CBS coverage of it leaves a lot to be desired, which uh I'll rant on in a second, but let's talk about the play first. Um basically The they send the the it's it's trying to kick a field goal from the five yard line. They've already kicked four at this point. Um And this is their first drive of the third quarter. So they're they're up like uh 1914 at this point. And they drive down to the five um pretty easily. But then stall because they've been struggling to get the ball in the end zone at the end. Um And so they send the kicking unit out. Troy Brown is part of that, goes inside the numbers, which is all you have to do, which I think we've actually seen this season. Like the the pages have got it. Yeah, the pages have got penalties called on them because the wide receiver like goes onto the field but doesn't go. You have to go like from the sideline. on the inside of the the numbers and then you can line up wherever you want. So he did that, went to the numbers, turnaround and started like walking off the field as if he wasn't going to be on the field. Um, but then just stood like on the field but at the sideline. And so the Patriots lined up for the field goal but snapped the ball directly to Adam Vinateri, like right to his hands. They turned and threw a I think it was a perfect spiral right to Troy Brown. Obviously wide open, uncovered, who just literally walked into the end zone backwards."
  },
  {
    "speaker" : "Greg",
    "text" : "Like the old hidden ball trick.",
    "timestamp" : "25:19-25:21"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah, it was perfect.",
    "timestamp" : "25:21-25:23"
  },
  {
    "text" : "The old hidden troy trick.",
    "timestamp" : "25:23-25:25",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Anybody seen that play? Elsewhere, like ever again. No, that's that's definitely happened before.",
    "timestamp" : "25:26-25:32"
  },
  {
    "text" : "Yeah, I'm sure it has, but it's it's uncommon. Yeah, but I am surprised we have to.",
    "speaker" : "Andy",
    "timestamp" : "25:32-25:37"
  },
  {
    "text" : "The punts team too, if they don't have anybody doing marking the gunner. I've seen that a couple times this year. Yeah. Yeah, yeah, yeah. You see that play by Hunter Renfro? Yes. So they do that. So Oakland's they're they're punt into Oakland and Renfro's the returner Yeah. And there's no one marking the gunner, so they just snap it and throw it to the gunner. Renfro recognized it like before it got snapped and started sprinting down the field. And just fucking unloads on their gunner like right at the right at the marker.",
    "speaker" : "Greg",
    "timestamp" : "25:38-26:09"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:10-26:17",
    "text" : "Yeah, and pops the ball loose and complete. It was perfect. Uh no, I think about basically I I thought I thought he I thought he dropped it."
  },
  {
    "text" : "But it was a turnover on downs, and it was a fucking amazing play by Red Frau. Yeah, it was fantastic.",
    "timestamp" : "26:17-26:23",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, front from the punt returner position is pretty impressive.",
    "timestamp" : "26:23-26:26"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:26-26:27",
    "text" : "Yeah."
  },
  {
    "timestamp" : "26:27-26:44",
    "speaker" : "Andy",
    "text" : "Yeah. Uh but yeah I have seen that work a few times. I think it was like last year. They it was one team Panthers or someone. Just some random NFC team. Like tried it a couple times, like more than once in a season. But yeah, we haven't seen it really on the field goal. Not like that. Yeah, especially now with Belichick, Mr."
  },
  {
    "timestamp" : "26:44-26:45",
    "speaker" : "Greg",
    "text" : "Conservative now."
  },
  {
    "speaker" : "Andy",
    "text" : "I guess so, yeah. Something's changed, but",
    "timestamp" : "26:45-26:48"
  },
  {
    "timestamp" : "26:48-26:52",
    "speaker" : "Greg",
    "text" : "Well let's let's loop back around to that because I have some thoughts."
  },
  {
    "speaker" : "Andy",
    "text" : "All right. Yeah, let me rant about CBS being fucking commentators are pretty good in this game, Andy. Commentators are fine. Commentators I actually didn't have a problem with.",
    "timestamp" : "26:53-27:04"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "27:04-27:09",
    "text" : "And I know Steve Steve just says that"
  },
  {
    "timestamp" : "27:09-27:09",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:09-27:12",
    "text" : "To start a rant because he uh yeah, I know.",
    "speaker" : "Greg"
  },
  {
    "text" : "I recognize that completely. But I'm not gonna I'm not gonna let him down, am I? I'm a good brother.",
    "speaker" : "Andy",
    "timestamp" : "27:12-27:17"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "27:18-27:24",
    "text" : "I know that he hasn't watched the game. Why the hell did we talk about the Steelers like 45 minutes last time, Andy?"
  },
  {
    "timestamp" : "27:24-27:29",
    "speaker" : "Andy",
    "text" : "Because I'm still your brother. Just because I'm a good brother doesn't mean I can't give you shit every once in a while. Yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "27:29-27:30",
    "text" : "That's not a good brother, Steve."
  },
  {
    "timestamp" : "27:30-27:31",
    "speaker" : "Andy",
    "text" : "Yes, it is."
  },
  {
    "text" : "Well, how would you know? I would never do that to you, Steve. Yeah, see that's how I know because Greg is such a good brother.",
    "speaker" : "Steve",
    "timestamp" : "27:31-27:37"
  },
  {
    "timestamp" : "27:47-27:57",
    "speaker" : "Andy",
    "text" : "CBS and I feel I still feel they're like they're kinda like this. They're probably I think they're the worst of the Um channels that that air football games."
  },
  {
    "timestamp" : "27:57-28:03",
    "speaker" : "Greg",
    "text" : "Like Fox is fine. Yeah, mom would like to have a word with you about that, the old dancing robot on football games."
  },
  {
    "speaker" : "Andy",
    "text" : "Well, that's true, yeah. But just from like a presentation standpoint, like they don't miss it. They're never egregious. And I feel like CBS always tries to get like fancy with something and they just like miss the the actual like what's going on. Like they in this game, they actually missed a kickoff. Like they didn't come back from commercial in time. And so the the announcers had to tell you what happened, like why the pages all of a sudden had the ball in the 35. And apparently it was a play that, you know, Patrick passed, fumbled the the kick return, but still like recovered and managed to like do something really impressive and get to the 35. It's like, well. Cool. And then even on this play, like they're zoomed in on Adam Vinateri's face as he's lining up the field goal. So you miss like three quarters of the actual play live. And then they don't show a replay of it.",
    "timestamp" : "28:03-28:50"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, it's live sports, Andy. You gotta cut them a break. No?",
    "timestamp" : "28:50-28:53"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:54-29:00",
    "text" : "Yeah, but it's like the other channels don't don't have these issues, I feel like."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:00-29:01",
    "text" : "Yes, they do."
  },
  {
    "timestamp" : "29:01-29:21",
    "speaker" : "Andy",
    "text" : "I feel like CBS is is the one that's the most egregious. They're the they're all like they don't other don't misplays. They don't have these awful camera angles. And it's always CBS where I'm like trying to pull the highlight. I'm just like, I can't get an actual highlight of this play because you haven't shown it correctly."
  },
  {
    "text" : "Fuck them. Fuck them. CBS, dude.",
    "speaker" : "Greg",
    "timestamp" : "29:22-29:25"
  },
  {
    "speaker" : "Andy",
    "text" : "Fuck him. What does that stand for, Greg?",
    "timestamp" : "29:26-29:27"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "29:27-29:31",
    "text" : "More like crappy broadcast system, right? Oh."
  },
  {
    "text" : "Oh. Thanks for that. See, that's that's being a good brother. Yeah. Take notes, Steve.",
    "speaker" : "Andy",
    "timestamp" : "29:31-29:38"
  },
  {
    "timestamp" : "29:38-29:41",
    "speaker" : "Greg",
    "text" : "Certified butthole suckers. I don't know."
  },
  {
    "speaker" : "Mom",
    "timestamp" : "29:44-29:45",
    "text" : "Very naughty."
  },
  {
    "timestamp" : "29:45-29:56",
    "text" : "Very naughty. I don't know, they're all the same to me. I honestly like I know they're different, but I If anybody's like Yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "If anything, Fox is the worst because they have the worst announcers.",
    "timestamp" : "29:56-29:58",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "29:59-29:59",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "text" : "I watched a game on Mute now anyway. So it's a good thing.",
    "speaker" : "Andy",
    "timestamp" : "30:02-30:04"
  },
  {
    "timestamp" : "30:04-30:07",
    "speaker" : "Greg",
    "text" : "Joe Buck and Aikman are just they've been around for too long for me."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:08-30:10",
    "text" : "Unless it's Tony Romo, I'm watching him on mute."
  },
  {
    "speaker" : "Greg",
    "text" : "I don't care. Gus Johnson.",
    "timestamp" : "30:11-30:13"
  },
  {
    "text" : "Oh yeah, Gus Johnson.",
    "timestamp" : "30:13-30:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Gus Johnson.",
    "timestamp" : "30:15-30:16"
  },
  {
    "timestamp" : "30:16-30:17",
    "speaker" : "Andy",
    "text" : "Does he still do football?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, he every now and then. I think he does some Fox stuff. Yeah, he's he's great. I love him. And he's the best for if you're watching a highlight package. Yeah. Because he goes crazy when there's crazy plays. Yeah. So if the highlight package just crazy plays, it's like four minutes of Gus Johnson just losing his mind. So awesome.",
    "timestamp" : "30:17-30:41"
  },
  {
    "text" : "Love that shit.",
    "speaker" : "Andy",
    "timestamp" : "30:41-30:42"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "30:42-30:43"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:43-30:50",
    "text" : "Yeah. So what are you gonna were did you want to uh did you have a rant, Greg? It felt like you were brewing something."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, that was more about Bill Belichick in 2021. And what a beta cuck soy boy he is.",
    "timestamp" : "30:50-30:57"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "30:57-31:00",
    "text" : "Wait, can we can we talk about how bad the referees were in this game first, though?"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah, good point, Steve.",
    "timestamp" : "31:00-31:02"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:01-31:02",
    "text" : "Yeah, we gotta talk about that."
  },
  {
    "timestamp" : "31:03-31:04",
    "speaker" : "Greg",
    "text" : "Dude, how about that call in the third quarter, Andy?"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh god, they totally missed it. And then the when they tried to show the replay, they they missed the replay on it too.",
    "timestamp" : "31:05-31:10"
  },
  {
    "timestamp" : "31:10-31:15",
    "speaker" : "Greg",
    "text" : "Yeah, they like got the number wrong when they announced it too. It was such bullshit. How dare they?"
  },
  {
    "timestamp" : "31:15-31:18",
    "speaker" : "Andy",
    "text" : "No, this was uh who's who's the one with the guns?"
  },
  {
    "text" : "Uh Ed Hockley.",
    "speaker" : "Greg",
    "timestamp" : "31:18-31:19"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:20-31:25",
    "text" : "Yes, this is an Ed Hockley Hockley game. Dude loves to explain himself some calls."
  },
  {
    "timestamp" : "31:25-31:26",
    "text" : "Fuck yeah, dude.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "But he also in this game loved to have a fucking coffee clutch about him too. Like every call took coffee clutch?",
    "timestamp" : "31:26-31:33"
  },
  {
    "text" : "What's that?",
    "timestamp" : "31:33-31:34",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "We just get together and gossip for a little while over a cup of coffee.",
    "timestamp" : "31:34-31:37"
  },
  {
    "timestamp" : "31:37-31:39",
    "text" : "Never heard it called that.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:39-31:41",
    "text" : "That's literally what's caught in Google if you're going to be able to get it. Yeah, it's funny."
  },
  {
    "text" : "I was I was I was making a joke the other day to Kelly about your kitchen is all like in between being worked on so it looks like a homeless person shelter. And I was like, I just picture Andy in there like smoking his coffee crack pipe in the corner.",
    "timestamp" : "31:42-31:56",
    "speaker" : "Greg"
  },
  {
    "text" : "Just to get a hit, man. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "31:59-32:00"
  },
  {
    "text" : "Coffee has been a struggle, I will say that. Yeah. Don't think I haven't persevered though. Gotta get six, bro. Yeah, hey, coffee's important. Coffee is culinary, baby. I got the shirt to prove it. Uh no, the the the referees were okay. There was one Uh they did take three minutes in to to go to Steve Brown's favorite rant to um validate the challenge of a fumble. Uh a literal three minutes like I was doing the fast forward and I made sure to to check for Steve.",
    "speaker" : "Andy",
    "timestamp" : "32:01-32:35"
  },
  {
    "timestamp" : "32:35-32:42",
    "text" : "Dude, I'll I'll say this. The the replay this year in the NFL is so much better with that booth.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because they they they have like a specific guy. Yeah.",
    "timestamp" : "32:42-32:45"
  },
  {
    "text" : "So it's like if it's obvious, they just knock it out.",
    "timestamp" : "32:45-32:47",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "32:48-32:49",
    "text" : "Yep. That's beautiful.",
    "speaker" : "Andy"
  },
  {
    "text" : "Dude.",
    "speaker" : "Greg",
    "timestamp" : "32:49-32:49"
  },
  {
    "timestamp" : "32:50-32:52",
    "speaker" : "Andy",
    "text" : "The fact they take them this long is garbage."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:52-33:01",
    "text" : "I know. Yeah. It's like people have been talking about it for years. Yeah. And surprise, surprise, it's working like seamlessly because there was no downside to it."
  },
  {
    "speaker" : "Andy",
    "text" : "And also like the the you because they have the pylon cams now and they've got they set the and a new one on the first down marker. Have you noticed that?",
    "timestamp" : "33:01-33:11"
  },
  {
    "text" : "Set a new one up.",
    "speaker" : "Greg",
    "timestamp" : "33:12-33:13"
  },
  {
    "text" : "So so so they've got an extra pylon that they put with the camera in it on the first L mark.",
    "speaker" : "Andy",
    "timestamp" : "33:13-33:18"
  },
  {
    "text" : "That's for the camera.",
    "speaker" : "Greg",
    "timestamp" : "33:19-33:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "33:20-33:20"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "33:21-33:21",
    "text" : "Got it."
  },
  {
    "speaker" : "Andy",
    "text" : "So because they so they you can actually have like if it's a close call and the guy's diving for the first down, you can actually have a camera angle of it. Which I think Bill Belichick has been asking for probably since 2004 here. Mm-hmm.",
    "timestamp" : "33:21-33:32"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "33:32-33:37",
    "text" : "So also asking for lasers over the the goalposts as well."
  },
  {
    "text" : "Lasers over the goalposts. That's genius. Like tracking in the ball, right? Yeah. Soccer is goal line technology. Why do we not have technology that shows if the ball crossed the plane?",
    "timestamp" : "33:37-33:47",
    "speaker" : "Greg"
  },
  {
    "text" : "Uh I think because even if it does, you still have so many other variables. Like is the knee down? Can you Yeah, I know, but you can",
    "timestamp" : "33:47-33:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Stop it at a certain place and be like at this time in the video has the ball crossed the line. Yeah. I mean that's right. The video the video changes color filter when the ball crosses the line. Boom. Problem solved, Andy. That's fair.",
    "timestamp" : "33:55-34:08"
  },
  {
    "text" : "I don't disagree. I I'm a proponent for technology.",
    "timestamp" : "34:07-34:10",
    "speaker" : "Andy"
  },
  {
    "text" : "I'm just a little surprised you are. Dude, have you seen the fucking uh tennis? They got that shit down to the millimeter.",
    "timestamp" : "34:10-34:16",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "They do, yeah.",
    "timestamp" : "34:16-34:17"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "34:17-34:18"
  },
  {
    "timestamp" : "34:18-34:22",
    "text" : "And to be fair, Greg, that's very expensive and the NFL has no money. Yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true, yeah, right. Well Bill Belichick is has uh talked about starting a bake sale to raise money for it.",
    "timestamp" : "34:22-34:28"
  },
  {
    "speaker" : "Greg",
    "text" : "So maybe maybe the Belichick humor there.",
    "timestamp" : "34:28-34:31"
  },
  {
    "timestamp" : "34:31-34:42",
    "speaker" : "Andy",
    "text" : "Yeah, oh definitely. Crouchy dad humor. Uh what about baseball? Should we get rid of umpires and just have strikes and balls called uh with a computer? Yes."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "34:42-34:48",
    "text" : "Nah, I kind of like baseball when they fuck around. Fucking Craig. Goddamn Luddite"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:52-34:55",
    "text" : "Get rid of the offsides too. No replays on offsides."
  },
  {
    "timestamp" : "34:56-34:57",
    "speaker" : "Greg",
    "text" : "No replays on offsides."
  },
  {
    "timestamp" : "34:57-34:58",
    "speaker" : "Andy",
    "text" : "Yeah, that's your that's a good idea."
  },
  {
    "text" : "I got a question. Someone asked me this last week and I didn't know the answer. When is it a false start versus a you know sometimes you just like turn around and look at the quarterback? Yeah. When is where's that line drawn?",
    "timestamp" : "34:59-35:16",
    "speaker" : "Greg"
  },
  {
    "text" : "Uh, I think once everybody is set for one second, like the the everybody, all the offensive players have to be set and not moving for one second before you can snap the ball. But you can you can move and jump around until then.",
    "speaker" : "Andy",
    "timestamp" : "35:17-35:31"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "35:32-35:41",
    "text" : "Okay. But if everybody hasn't been set for a second. Does it have anything, this might be a silly question. Does it have anything to do with when the quarterback says set hut?"
  },
  {
    "text" : "I don't believe so no.",
    "speaker" : "Andy",
    "timestamp" : "35:41-35:42"
  },
  {
    "text" : "Okay. No, he has to say that. Right?",
    "timestamp" : "35:42-35:47",
    "speaker" : "Greg"
  },
  {
    "text" : "Because they do that, like they'll run to the line and say sit hut and then nothing will happen. And then they'll they'll change the formation, right? Yeah, they re-yeah they're it'll go back to like yeah instead of being under center, they'll go to yeah. Paint manny's the all the goddamn time. Fucking pig. Ruins man uh ruined Madden for me. Because all they would do is just make him change audible every play at the line for fucking 45 minutes. Took forever to get a game through. Uh Anything else you want to complain about? Oh, oh, uh the referees. I wasn't finished. Thanks for reminding me, Steve. Appreciate it.",
    "timestamp" : "35:47-36:22",
    "speaker" : "Andy"
  },
  {
    "text" : "Thank God.",
    "speaker" : "Steve",
    "timestamp" : "36:22-36:23"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh no, there was one play where I don't think I've ever seen this before, but there was double offsetting penalties. Which is a new one. There was uh offensive and defensive holding on the same play. Then after the play was over, there was offensive and defensive taunting. Both penalties offset, replay fourth three.",
    "timestamp" : "36:23-36:42"
  },
  {
    "timestamp" : "36:42-36:48",
    "speaker" : "Greg",
    "text" : "Oh, don't get me started on taunting. Are they four players or is it the two guys?"
  },
  {
    "text" : "Uh no, different players. The the holdings were on two guys and then the taunting was on two other people at the end of the play. Both offset. Replay fourth down. That was on fourth down as well. Amazing. Edge of my seat, boys. Steve, anything you want to get off your chest? No. Okay, good.",
    "timestamp" : "36:48-37:11",
    "speaker" : "Andy"
  },
  {
    "text" : "I had another couple notes on our our good friend Marshall Falk. Yep. He's a scrub now. Just quick update on Marshall Falcon 2004. He sucks.",
    "speaker" : "Greg",
    "timestamp" : "37:12-37:23"
  },
  {
    "speaker" : "Andy",
    "text" : "He's not as good. 100%. Yeah. Well that's why they drafted um Steven Jackson, Steve's favorite player.",
    "timestamp" : "37:23-37:30"
  },
  {
    "timestamp" : "37:30-37:33",
    "speaker" : "Steve",
    "text" : "Yeah. Yeah, I love that guy back in the day."
  },
  {
    "text" : "Whereas the Patriots Patriots trending in the opposite direction. The leading rusher in 2003 was Antoine Smith, who finished the season with 642 yards. Corey Dillon halfway through this game. Six hundred and seventy six yards and we are in week nine. Sounds good.",
    "timestamp" : "37:34-37:51",
    "speaker" : "Andy"
  },
  {
    "text" : "Good stat, Andy.",
    "speaker" : "Greg",
    "timestamp" : "37:52-37:52"
  },
  {
    "timestamp" : "37:53-38:02",
    "speaker" : "Andy",
    "text" : "Yeah. So I think uh I I think Corey Dillon will finish with more rushing yards this season in 2004 than uh Antoine Smith did in 2003."
  },
  {
    "timestamp" : "38:02-38:13",
    "speaker" : "Greg",
    "text" : "You uh you want to hear my stat of the week? I do. So I was looking into that Marshall Falk thing and you know the whole like running back Cliff at 30 thing."
  },
  {
    "timestamp" : "38:14-38:14",
    "text" : "Yeah. Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "So I was looking into that.",
    "timestamp" : "38:15-38:16"
  },
  {
    "timestamp" : "38:16-38:18",
    "speaker" : "Andy",
    "text" : "Is that how old he is in this season?"
  },
  {
    "timestamp" : "38:19-38:29",
    "speaker" : "Greg",
    "text" : "Uh yeah, I think he's right about there. He's like 29, I think. So the the glyph actually s more strongly correlates with to 29 than it does 30."
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "38:29-38:29"
  },
  {
    "timestamp" : "38:29-38:42",
    "speaker" : "Greg",
    "text" : "Which is interesting. And that like there's a bunch of cool, like if you're into statistics and stuff, there's a bunch of cool articles out there in the internet you can look up. Does it I don't know it didn't really translate well into like an aud audio medium?"
  },
  {
    "speaker" : "Andy",
    "text" : "No shit.",
    "timestamp" : "38:43-38:43"
  },
  {
    "text" : "Tell me the R value, Greg. Yeah, yeah, exactly. So the one uh Stat I did get out of it. I thought it was interesting. So I was like, oh, I'll look and see this current season of like NFL rushing leaders, like how many of those guys are either 29 years or older.",
    "timestamp" : "38:44-39:02",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "39:03-39:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "39:03-39:39",
    "text" : "So I looked up the list of the top 100, and there are nine running backs in the top 100 that are 29 years or older. Jesus. And there's also nine quarterbacks in the top 100 that are 29 years or older. Tom Brady, is he on that list? Uh, don't believe Tom. He's not top hundred rusher? Yeah. He's got some rushing yards. Yeah. So there's as many 29-year-old quarterbacks rushing out there as there are running backs, which I think pretty much kind of proves the point."
  },
  {
    "timestamp" : "39:39-39:46",
    "speaker" : "Steve",
    "text" : "Yeah, I think so. Which running back has pulled like a Tom Brady where he runs really well for 40 years old."
  },
  {
    "speaker" : "Greg",
    "text" : "Uh I mean obviously Frank Gore the standard baseball. Mark Ingram is the the bet the highest rushing yards for a how old is he? Uh 30. Maybe even older. But yeah, we just saw him uh on the twenty he's twenty-six in the NFL in yards. So I mean it's not like he's like lighting the world on fire.",
    "timestamp" : "39:46-40:09"
  },
  {
    "speaker" : "Steve",
    "text" : "No, but it's also always split time too with Camara and Yeah.",
    "timestamp" : "40:09-40:15"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that's true. Cordarell Patterson was in there. David Johnson Latavius Murray. Raheem Mostert, like these are all scrubs, really. Yeah. Yeah. Let's just put it this way, they're free agents in your fantasy league. Maybe not in mine, but yes.",
    "timestamp" : "40:15-40:37"
  },
  {
    "speaker" : "Andy",
    "text" : "Who How old is Derek Henry? That's a good question. Because I feel like he might he might buck that trend too, yeah. Because Derek Henry is just he's just so big that like I I feel like it's yeah, so he's probably getting close.",
    "timestamp" : "40:37-40:56"
  },
  {
    "speaker" : "Greg",
    "text" : "So keep this in mind for uh fantasy drafting though. Two years. Yeah, Derek Henry's if he follows the trends, he's gonna fall off a couple of things. What we'll do is we'll isolate you saying this, right? Yeah, and I'll cut this. We'll give it the old Steve treatment, the Ryan Tannehill fucking uh Josh Allen. Yeah. Weekly updates.",
    "timestamp" : "40:57-41:18"
  },
  {
    "text" : "I mean Tannehill's cooled off.",
    "timestamp" : "41:19-41:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "41:21-41:28",
    "text" : "Tannehill, yeah, but Josh Allen. Josh Allen less so. Tough, tough take on that one. He's gonna win the MVP. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Well, if he can convert any more fourth downs, he will. All right, uh let's see. Speaking of football, uh you want to do best and worst in this game? Sure. Steve, you want to go first?",
    "timestamp" : "41:28-41:44"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "41:45-41:57",
    "text" : "Yeah, I didn't watch it, so I don't know if I have a best or the best is Troy Brown. Okay is um Greg Little with TVs."
  },
  {
    "timestamp" : "41:58-42:03",
    "text" : "Leonard Little. Craig Little? Fuck's Craig Little. Okay.",
    "speaker" : "Andy"
  },
  {
    "text" : "Leonard Little Craig Little. Same thing.",
    "speaker" : "Steve",
    "timestamp" : "42:04-42:06"
  },
  {
    "text" : "Well, if you hadn't realized it, he Steve's pulling this out of his ass.",
    "speaker" : "Greg",
    "timestamp" : "42:06-42:09"
  },
  {
    "speaker" : "Andy",
    "text" : "No shit. I figure you would just open up my show notes and just fucking pull something from there, but now he's just fucking doing it in the show. Love it. Greg reads them. He definitely reads them.",
    "timestamp" : "42:10-42:21"
  },
  {
    "speaker" : "Greg",
    "text" : "That's right.",
    "timestamp" : "42:22-42:22"
  },
  {
    "timestamp" : "42:23-42:30",
    "text" : "Because otherwise he wouldn't he would he wouldn't have said anything about the Rams being favored by two and a half. Mm-hmm. I highlight shit that I know.",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh no, I didn't read them.",
    "timestamp" : "42:30-42:31",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "That was from Wikipedia. The two the the two and a half? No, it wasn't. Yeah, it was.",
    "timestamp" : "42:32-42:37"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't believe you.",
    "timestamp" : "42:38-42:38"
  },
  {
    "text" : "And I credit for it.",
    "timestamp" : "42:39-42:40",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "42:40-43:02",
    "text" : "Do you know what the trick? The trick. is to put some wild boy shit in those notes to see if people bring it up during the I probably shouldn't I because that that's what I do at work when like They're like, hey, can you write up the meeting minutes from this meeting? And I know not a single fucking person's reading the meeting minutes. I'll put some wild boy shit right at the end. Oh yeah. What do you mean by wild boy shit?"
  },
  {
    "timestamp" : "43:02-43:14",
    "text" : "I don't know, just be like uh so-and-so said something ridiculous and just see if they like acknowledge that there's a 20-minute argument uh about whether a hippo would would kill a rhinoceros or vice versa.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah yeah yeah. Or be like, oh, this person said that they would take the rest of the project and do all the work for us. You know, not like fired wild boy shit, but just like, you know, like something that if someone's reading would be like, what the hell?",
    "timestamp" : "43:14-43:27",
    "speaker" : "Greg"
  },
  {
    "text" : "I used to do that with uh with my work email um footers, you know, where it was like, oh, this is private property, all that bullshit. Yeah. I think I had something where uh something along the lines of if you read this uh email you Um are it is assumed that you are agreeing to pay the sender of this email like 2. 5 billion dollars or something like that. Never saw any money.",
    "timestamp" : "43:28-43:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Classic prank right there, Andy.",
    "timestamp" : "43:53-43:55"
  },
  {
    "timestamp" : "43:55-43:56",
    "speaker" : "Andy",
    "text" : "Bit of a shit. Got um."
  },
  {
    "timestamp" : "43:57-44:04",
    "speaker" : "Greg",
    "text" : "Got him. Or like uh when they put quotes in there or like have a picture of a horse, you're like, oh, I'm not gonna like this person."
  },
  {
    "text" : "Uh yep. All right, great. You want to do your best some worst?",
    "timestamp" : "44:05-44:11",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Sure. Um my best was uh Vinateri. Four for four and a touchdown pass. Yeah. Game ball. Um game ball. My worst was Uh John Gruden.",
    "timestamp" : "44:12-44:30"
  },
  {
    "timestamp" : "44:34-44:36",
    "speaker" : "Andy",
    "text" : "Now or in two thousand four?"
  },
  {
    "text" : "Or just generally. Just you know, in general. Okay. I don't know. I love it. I think it was over multiple years.",
    "speaker" : "Greg",
    "timestamp" : "44:36-44:42"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm sure it was. Yeah, it was probably happening at this point, so that's fair.",
    "timestamp" : "44:43-44:46"
  },
  {
    "timestamp" : "44:46-44:59",
    "speaker" : "Greg",
    "text" : "Although Clueless anti-football pussy is the best. That's that's what I'm saying. I use that all the time. I must have said that like 15 times since I read it the first time."
  },
  {
    "timestamp" : "45:00-45:04",
    "text" : "I should probably be at the bottom of your next uh yeah your next meeting though.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:04-45:09",
    "speaker" : "Greg",
    "text" : "Dude, we should change the description of our podcast to a bunch of clueless anti-football pussy."
  },
  {
    "text" : "Don't tell me, Greg. Don't tell me. Exactly. That's what I'm saying. Yeah. That's gonna be my uh my f my footer of my work email.",
    "timestamp" : "45:12-45:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "45:23-45:32",
    "text" : "So what do you think there all those emails? Like I want to read them so bad. The other 650,000."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:32-45:38",
    "text" : "I want to know what Anonymous is working on right now because I I feel like they should be like finding these emails and releasing them to the public."
  },
  {
    "speaker" : "Greg",
    "text" : "Who do you think is like the craziest? Dan Snyder. Yeah, Dan Snyder. But that would be like But that would be like I'm thinking like the funniest, you know, like Rex Ryan or or like Andy Reed's emails. Imagine Andy Reid's emails.",
    "timestamp" : "45:39-45:55"
  },
  {
    "timestamp" : "45:55-46:04",
    "text" : "Like all Andy Reid's emails is is just forwarding people like barbecue recipes. That's all it is. Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "He's actually just the caterer for the Chiefs. He's just organizing post-game meals and shit.",
    "timestamp" : "46:04-46:10"
  },
  {
    "speaker" : "Andy",
    "text" : "I just have the picture of him wearing that like the face shield that was fogging up. And it's just like him thinking about food.",
    "timestamp" : "46:11-46:17"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "46:17-46:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "46:17-46:18"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "46:18-46:29",
    "text" : "Uh I'd like to see Pete Carrolls if he's just corny and email If he if if they caught Pete Carroll being like an asshole, I'd be so fucking pumped. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Well he's phony like uh he's a conspiracy theorist, isn't he? I don't know. I'm pretty sure there yeah, there was talk about him being a conspiracy theorist. Like nine like a 9-11 truther and all sorts of bullshit.",
    "timestamp" : "46:29-46:41"
  },
  {
    "speaker" : "Greg",
    "text" : "Ooh, I just watched Loose Change. Did you remember that? Yeah. Yeah. Why? Uh I don't know. I'm reading a book about 9-11 and I was like, I remember that loose change thing. How was it? Uh it's pretty dramatic. Shocking.",
    "timestamp" : "46:42-46:58"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "46:58-46:58"
  },
  {
    "speaker" : "Greg",
    "text" : "Is that uh an Alex James thing?",
    "timestamp" : "46:59-47:00"
  },
  {
    "speaker" : "Andy",
    "text" : "Loose change?",
    "timestamp" : "47:00-47:01"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:01-47:22",
    "text" : "No. No. Info Wars. It was really well produced though. They must have put some money into it, but it was clearly just like, let's throw a bunch of shit at the wall and see what sticks, you know? They were like, here's Una unanswered question one through sixty-five. That's the documentary."
  },
  {
    "timestamp" : "47:23-47:53",
    "speaker" : "Andy",
    "text" : "You know? Yep. Yeah. I listened to uh here's a here's a shout-out for a podcast called Knowledge Fight. And it's these two guys who listen to the Alex Jones show on InfoWars and uh Alex Jones is awesome. And debunk all the stuff that he says. Just like point by point. It's like actually this is what he's like, they'll play the clip of what he says. And they'll be like, so all he did was read the headline. And this is how this is what the actual article says. And here's how he's misappropriating it to get you to buy um dick pills."
  },
  {
    "text" : "So see that another line because Alex Jones can't read.",
    "timestamp" : "47:53-47:57",
    "speaker" : "Steve"
  },
  {
    "text" : "Well yeah, no, he doesn't. Alex Jones is the man. You're bag Alex Jones guy, Greg. Yeah, he's fucking hilarious. Oh, I agree. He's an afternoon. If that guy doesn't make you laugh.",
    "speaker" : "Greg",
    "timestamp" : "47:57-48:08"
  },
  {
    "timestamp" : "48:09-48:16",
    "speaker" : "Andy",
    "text" : "He's also like taking life too serious. He's also like a super racist anti-Semite, but other than that, he's funny about it."
  },
  {
    "speaker" : "Greg",
    "text" : "Ridiculous.",
    "timestamp" : "48:16-48:17"
  },
  {
    "text" : "He is, yeah.",
    "speaker" : "Andy",
    "timestamp" : "48:17-48:17"
  },
  {
    "timestamp" : "48:18-48:29",
    "speaker" : "Greg",
    "text" : "He's an absolute caricature of a person. It's not a real person, you know?"
  },
  {
    "speaker" : "Andy",
    "text" : "It's true, but then he goes on his show and like Yeah, this and that character. Yeah, it's it's a little brutal.",
    "timestamp" : "48:30-48:36"
  },
  {
    "text" : "That was the only thing that crossed the line for me. But the rest of the shit about like goblins and turning frogs, it's just fucking funny.",
    "timestamp" : "48:36-48:44",
    "speaker" : "Greg"
  },
  {
    "text" : "It's a little ridiculous.",
    "timestamp" : "48:44-48:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Lizard people, right?",
    "timestamp" : "48:46-48:47"
  },
  {
    "timestamp" : "48:47-48:52",
    "text" : "Lizard people. Yeah. Lizard people. Yeah, that's the thing. Globalists. The globalists. The globalists. Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "This stuff when he gets so worked up and it fucking goes real red.",
    "timestamp" : "48:53-48:55"
  },
  {
    "timestamp" : "48:55-48:59",
    "speaker" : "Andy",
    "text" : "Yeah. Oh he just does that as a sh as a show though."
  },
  {
    "text" : "Like he doesn't even get he's not even really getting worked up, apparently. There's someone on that on YouTube that like animates his rants and they're fucking so funny. Oh I would be sent a couple to you and they're wicked funny.",
    "speaker" : "Greg",
    "timestamp" : "48:59-49:12"
  },
  {
    "timestamp" : "49:12-50:06",
    "text" : "All right. I would definitely watch that. Oh god damn. Uh speaking of Alex Jones and uh conspiracy theories, um here's a conspiracy theory for you, Greg. Um How is it that the Patriots during these this 2004 timeframe, how did they go 26 games without allowing an opening? uh drive touchdown and they was this was their 16th consecutive game scoring first. How is that even a possibility? There's definitely some home cooking going on there, right? Good coaching. But to score first in 16 consecutive games? And they won the coin flip every single even the game that they lost last week and they got blown out, they still scored first. How? Good preparation. I don't know. A load of coins. Script in the Bro, I'm looking for a goddamn conspiracy. Work me here, you little prank.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Telling you they wait one side of the coin before they give it to the ref.",
    "timestamp" : "50:06-50:09"
  },
  {
    "text" : "Ooh, see, Steve, Steve's on the right path here. We got a correlation with the uh the coin flips there?",
    "timestamp" : "50:10-50:15",
    "speaker" : "Greg"
  },
  {
    "text" : "I don't know. I don't know who won, but but even then like the pages deferring, so how does that work They're bugging oh here you go here you go yes exactly they're bugging the locker room or they have because you know how most teams will um We'll have a script for the first for the first X amount of plays. Yeah. So the Patriots have found a way to get the opposing team's script so they know what that first drive is going to be and so they can stop it every time. Therefore, you don't allow a touchdown, an opening drive touchdown in the first 26 games. And because of that, you're able to score first. Because the team, the other team doesn't have yours. Done. Must be it.",
    "timestamp" : "50:16-50:52",
    "speaker" : "Andy"
  },
  {
    "text" : "Makes sense.",
    "speaker" : "Greg",
    "timestamp" : "50:54-50:54"
  },
  {
    "speaker" : "Andy",
    "text" : "Alex Jones, here we come.",
    "timestamp" : "50:54-50:55"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "50:56-50:56",
    "text" : "Yeah?"
  },
  {
    "text" : "Alright, that's it. Nailed it. So you have a best and worse or Oh, would you like to hear my best and worst? I can I can give you a few if you'd like.",
    "timestamp" : "50:56-51:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:06-51:07",
    "speaker" : "Greg",
    "text" : "Yeah, let me get let me get your top."
  },
  {
    "timestamp" : "51:08-51:26",
    "text" : "Oh, here's a good one. Uh my worst. I'll start off with my worst. Okay. Um They talk coming back from halftime, they talk about Mike Marts. And all he wanted to talk about at halftime was the referees and how bad they were It's a fucking loser mentality. Some bullshit. Who the fuck who the fuck complains about referees? Seriously.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:26-51:27",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "What kind of loser would complain about referees?",
    "timestamp" : "51:27-51:29"
  },
  {
    "speaker" : "Steve",
    "text" : "That is very much a loser thing.",
    "timestamp" : "51:29-51:31"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:34-51:56",
    "text" : "Uh so so that's definitely the worst. Um it's either that of the bullshit uh path interference call that they call in short brand that wasn't path interference. Because fuck those referees, right? And anybody who complains about them. Um, my best. Let's take a look. Ribbid. Um"
  },
  {
    "text" : "Commentators. Fucking professionalism, Andy. Here you go.",
    "speaker" : "Greg",
    "timestamp" : "51:58-52:01"
  },
  {
    "speaker" : "Andy",
    "text" : "Here's one. Well I was doing the gay frogs.",
    "timestamp" : "52:02-52:04"
  },
  {
    "timestamp" : "52:05-52:06",
    "speaker" : "Greg",
    "text" : "Disgusting beast over there."
  },
  {
    "timestamp" : "52:07-52:34",
    "speaker" : "Andy",
    "text" : "It was the gay frogs. They were talk uh at the beginning of the game, they were talking about Corey Dillon running and the way he runs and the Dylan uh Dylan was battering the Rams defense, which I thought was nice. Oh nice little wordplay. Right. So so shout out to I don't know who it was, Chris Collinsworth maybe? Phil Sims. It doesn't fucking matter. That wasn't bad. And then the fact that they had to talk us through the the Patrick Pass kick return since the broadcast fucking missed it."
  },
  {
    "speaker" : "Greg",
    "text" : "Do you have any uh Randall gay puns for us, Andy?",
    "timestamp" : "52:34-52:37"
  },
  {
    "timestamp" : "52:37-52:41",
    "text" : "I don't. Um something about frogs? About that.",
    "speaker" : "Andy"
  },
  {
    "text" : "Randall turning the frogs. Randall turning the frogs gay. That's a good verminism.",
    "speaker" : "Greg",
    "timestamp" : "52:41-52:49"
  },
  {
    "speaker" : "Mom",
    "timestamp" : "52:49-52:51",
    "text" : "Sometimes a naughty boy. That's right."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:52-53:16",
    "text" : "You tell him. Did I ever tell that story on the podcast of uh At college with the kid on my team, Pac A. No. And we went we went to an away game. And yeah, so there was like 10, 15, 20 kids that all showed up at one point in like while we were warming up and they must have got a hold of our roster."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh no.",
    "timestamp" : "53:16-53:17"
  },
  {
    "text" : "Because they're like walking over to the field and they're like, where's gay?",
    "timestamp" : "53:17-53:21",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "53:22-53:27",
    "speaker" : "Andy",
    "text" : "It's like raise your hand, gay. We want to know who you are, gay."
  },
  {
    "timestamp" : "53:27-53:35",
    "speaker" : "Greg",
    "text" : "And they just made gay jokes for like 90 straight minutes. Oh my god. Oh so fucking funny. Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:36-53:37",
    "text" : "That's that's brutal."
  },
  {
    "text" : "They're like six feet, a hundred sixty pounds a day. Where is he? Some of the shit they were saying was even making him laugh.",
    "speaker" : "Greg",
    "timestamp" : "53:39-53:49"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:50-53:55",
    "text" : "I imagine he's probably heard it all. If your name is Pat Gay, you've heard every single one."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. And you went to middle school at any point in your life.",
    "timestamp" : "53:55-53:58"
  },
  {
    "text" : "Exactly. Oh yeah. Especially in America.",
    "timestamp" : "53:58-54:00",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:00-54:02",
    "speaker" : "Steve",
    "text" : "It's like we've been heard all the poop jokes."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:02-54:21",
    "text" : "Oh yeah. I know all the brown ones. Yep. Taking it down to Browntown, baby. Uh oh, the one that we didn't talk about. Uh Brady did throw a touchdown. He actually threw two, one to Bethel Johnson. Other one to uh famed tight end and touchdown catcher Mike Rabel."
  },
  {
    "text" : "Yeah, it was a nice catch.",
    "speaker" : "Greg",
    "timestamp" : "54:22-54:23"
  },
  {
    "timestamp" : "54:24-54:24",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Great catch.",
    "timestamp" : "54:24-54:24"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it was like a falling down. It kind of reminded me of some of those Gronk catches in that back, like that fade to the back corner. And Gronk just kind of like grabs it and manages to hang on to it as he's falling down. Very similar.",
    "timestamp" : "54:24-54:36"
  },
  {
    "speaker" : "Greg",
    "text" : "Andy, can I uh use your professional journalism test here? Uh-oh. Remember uh Who Man? Oh my fail.",
    "timestamp" : "54:37-54:45"
  },
  {
    "timestamp" : "54:46-54:55",
    "speaker" : "Andy",
    "text" : "Uh oh Manowanui. Oh, geez. Oh pro. Is that what you were looking for? You want the pronunciation? All right."
  },
  {
    "timestamp" : "54:55-54:55",
    "text" : "Yeah. Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:55-55:18",
    "text" : "Yeah. That was really good. Not bad. There was also uh in this game the linebacker who's actually pretty good. Uh he led the team in tackles. Um and tackles for loss. Pisa Teno Isa Moia. I don't know how I did with that, but definitely an all-time name team. Pisa Tino Isa Moea."
  },
  {
    "text" : "Sounds right to me. Yeah.",
    "timestamp" : "55:20-55:22",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "And also the fullback Joey Goodspeed. Which again a perfectly named fullback because it ain't great speed, is it? It's good speed. Three carry, three career carries, six yards, one touchdown, long is it two. Good speed, not great speed.",
    "timestamp" : "55:22-55:37"
  },
  {
    "speaker" : "Greg",
    "text" : "What about their tight end, eh?",
    "timestamp" : "55:37-55:39"
  },
  {
    "text" : "Who's their tight end?",
    "speaker" : "Andy",
    "timestamp" : "55:40-55:41"
  },
  {
    "timestamp" : "55:41-55:45",
    "speaker" : "Greg",
    "text" : "Brandon. Brandon. I don't see it anywhere. Where is it?"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know. You you try it. Let me know.",
    "timestamp" : "55:45-55:47"
  },
  {
    "speaker" : "Greg",
    "text" : "Brandon Manumaliuna.",
    "timestamp" : "55:48-55:50"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yes. Okay. Yeah. I remember him. Manumaliuna. Manu Maliuna. Yeah.",
    "timestamp" : "55:51-55:55"
  },
  {
    "speaker" : "Greg",
    "text" : "That sounds right. Yeah.",
    "timestamp" : "55:55-55:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. No, you nailed it. Pronunciation. We're okay at it on this. It's good speed. It's good pronunciation.",
    "timestamp" : "55:56-56:04"
  },
  {
    "speaker" : "Greg",
    "text" : "We're a very international podcast around here, you know.",
    "timestamp" : "56:07-56:10"
  },
  {
    "speaker" : "Steve",
    "text" : "Huge and somewhere weird, Bulgaria or something.",
    "timestamp" : "56:11-56:14"
  },
  {
    "speaker" : "Andy",
    "text" : "Something like that. Yeah, it was, wasn't it? And then we were on the Mexican charts for a while. Uh I think that was thanks to KBN. Well thanks, it wasn't thanks to you. It was thanks to Pat's cap, I think it was for a little bit. All right. Anything else? Patriots. Oh, they had a goal line stand in garbage time from the three. They held the the Rams out of the end zone. Good for them.",
    "timestamp" : "56:14-56:40"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh is that noteworthy?",
    "timestamp" : "56:41-56:44"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:44-56:45",
    "text" : "I think so."
  },
  {
    "timestamp" : "56:46-56:57",
    "speaker" : "Greg",
    "text" : "Andy, let's uh break the third wall here. Okay. You know We never do that. That one shouldn't make the cut. Why not? I don't know. This was what the Steelers game was like."
  },
  {
    "text" : "So it's a garbage top. Yeah, it's garbage. It's still a goal line stand.",
    "speaker" : "Andy",
    "timestamp" : "56:57-57:00"
  },
  {
    "timestamp" : "57:02-57:09",
    "speaker" : "Greg",
    "text" : "Goal line stand after Forty to twenty-two, you know, it's like goal lines there's a goal line stand."
  },
  {
    "speaker" : "Andy",
    "text" : "I guess especially against this offense. Six ranks ranked offense.",
    "timestamp" : "57:09-57:12"
  },
  {
    "timestamp" : "57:13-57:14",
    "speaker" : "Steve",
    "text" : "Prologging our misery."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:14-57:32",
    "text" : "Yeah. What else you want to oh oh there's one more thing, and this you actually probably will like. Uh so Tom Brady in the Super Bowl, uh, because he was the MVP, he won a Cadillac. And so He decided to donate it to his high school. Um what was his high school, Greg?"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh St. Mary's Vincent.",
    "timestamp" : "57:33-57:35"
  },
  {
    "text" : "That was that is incorrect, but good for you. Eat Sam Mateo, something or other. Something Sarah. Yeah, something like that. And so they they are raffling off that car at tombradycar. com, which sadly no longer exists. But I think if it's available, we should buy tombradycar. com. And redirect it to whatever we. Whatever we want to make it, because that is a great one",
    "timestamp" : "57:36-58:05",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:06-58:08",
    "speaker" : "Greg",
    "text" : "So they were raffling it at this point?"
  },
  {
    "timestamp" : "58:08-58:15",
    "text" : "Yeah, so they they announced it during this game that they were raffling the Tom Brady's car. At Tom Bradycock.",
    "speaker" : "Andy"
  },
  {
    "text" : "com. We should fucking buy Tom Brady'scock. com. We should go buy that cock. And then just redirect it to a picture of my cock.",
    "timestamp" : "58:15-58:24",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Or the picture of you with the inflatable.",
    "timestamp" : "58:25-58:27"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, or or that. Yeah. That was the correct picture.",
    "timestamp" : "58:27-58:31"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh let's see. Let's see if it's on the Wayback Machine. Oh, no.",
    "timestamp" : "58:31-58:35"
  },
  {
    "speaker" : "Greg",
    "text" : "That was gonna be my Halloween costume this year. It was gonna be the uh a Mac Jones version of the same thing.",
    "timestamp" : "58:35-58:41"
  },
  {
    "speaker" : "Andy",
    "text" : "Do you have a Mac Jones jersey?",
    "timestamp" : "58:42-58:43"
  },
  {
    "timestamp" : "58:43-58:47",
    "speaker" : "Greg",
    "text" : "No. I didn't think so. That was where it all fell apart."
  },
  {
    "text" : "Oh, oh it's a oh man. I found it. Hang on. Let me share my screen with you boys.",
    "timestamp" : "58:48-58:56",
    "speaker" : "Andy"
  },
  {
    "text" : "Make sure you ask if we can see it once it's up there.",
    "timestamp" : "58:57-59:00",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:00-59:06",
    "text" : "I will do no such thing because I know you can, because you're not the Luddites. So this is win tombrady's car. com."
  },
  {
    "text" : "I can't see it. Yeah, it's too small.",
    "speaker" : "Greg",
    "timestamp" : "59:06-59:09"
  },
  {
    "timestamp" : "59:09-59:10",
    "speaker" : "Andy",
    "text" : "I don't care."
  },
  {
    "timestamp" : "59:10-59:14",
    "text" : "It's my pet beef at work. Can you guys see my screen? Yeah, man.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:14-59:53",
    "text" : "And then everybody's on mute so you don't hear anything. So it's like, uh And then somebody finally unmute. Yeah. So ticket $25 each or five tickets for $100. Grand Prize Tom Brady's Cadillac XLR. It's the one, it's the. Pit photos photo above not actual car, but the Cadillac XLR is the uh two seater road stair with uh Convertible. That's nice. With the trunk autographed by Brady and other Super Bowl participants to ensure authenticity. Ooh. Although they actually said in the broadcast that it was under the hood is where the entire team had signed it. So maybe that gets updated later. So Junipero Serra High School."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "59:53-01:00:00",
    "text" : "That's where he was. So he gave it to his high school and they're raffling it? Yep. Yeah."
  },
  {
    "text" : "That's why he gave it to them.",
    "timestamp" : "01:00:00-01:00:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:00:02-01:00:04",
    "speaker" : "Greg",
    "text" : "They were probably like, what the fuck am I going to do with this Cadillac?"
  },
  {
    "speaker" : "Andy",
    "text" : "If I'm the principal like, oh thanks, Tom, appreciate it. Yeah. I know how I'm gonna work tomorrow.",
    "timestamp" : "01:00:06-01:00:10"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:00:11-01:00:12",
    "text" : "$60,000 or something?"
  },
  {
    "text" : "The school bus that picks up one kid each one kid at a time.",
    "timestamp" : "01:00:12-01:00:17",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:00:17-01:00:22",
    "speaker" : "Greg",
    "text" : "Yeah, the star quarterback doesn't drive with the rest of the team. He just goes in the caddy."
  },
  {
    "timestamp" : "01:00:23-01:00:32",
    "text" : "Well, they have had some uh big alumni from this high school. Mm, so a bit of a pedigree there.",
    "speaker" : "Andy"
  },
  {
    "text" : "Same with uh Ty Law and Darrell Revis.",
    "timestamp" : "01:00:32-01:00:37",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, same high school. That's right.",
    "timestamp" : "01:00:38-01:00:39"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I think there was someone else famous too. Tony Dorset, maybe?",
    "timestamp" : "01:00:39-01:00:42"
  },
  {
    "speaker" : "Andy",
    "text" : "Something like that. Yeah, I remember I remember them. I feel like we talked about that a while. Find the what?",
    "timestamp" : "01:00:42-01:00:50"
  },
  {
    "text" : "Find the VIN?",
    "timestamp" : "01:00:51-01:00:51",
    "speaker" : "Greg"
  },
  {
    "text" : "VIN number of the car. We can go buy it.",
    "speaker" : "Steve",
    "timestamp" : "01:00:52-01:00:53"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay, just look that up real quick.",
    "timestamp" : "01:00:54-01:00:55"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:56-01:00:58",
    "text" : "Spot the kid that worked at a dealership."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, no shit, right?",
    "timestamp" : "01:00:58-01:00:59"
  },
  {
    "speaker" : "Steve",
    "text" : "We can have Tom Brady's car. I think it's quite cheap now. 20 years old.",
    "timestamp" : "01:00:59-01:01:05"
  },
  {
    "text" : "I doubt it's cheap. Okay, yeah, can we uh can we get the VIN just to make sure this is a legit place?",
    "speaker" : "Andy",
    "timestamp" : "01:01:05-01:01:13"
  },
  {
    "text" : "I want to check the car facts.",
    "timestamp" : "01:01:15-01:01:16",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:01:18-01:01:35",
    "speaker" : "Andy",
    "text" : "Well, they do have a phone number here that you can call, so I I can give you that, Steve. Moya Goddard. Let's call him on the outer. Uh I'm too busy trying to see if I can buy Tom BradyCar. com. Did you look at Tom Bradycock."
  },
  {
    "text" : "com too for Greg?",
    "timestamp" : "01:01:35-01:01:36",
    "speaker" : "Steve"
  },
  {
    "text" : "I haven't yet, but that's that's next on the list.",
    "timestamp" : "01:01:36-01:01:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "And if we don't have that, just do cock and ball.",
    "timestamp" : "01:01:39-01:01:42"
  },
  {
    "timestamp" : "01:01:44-01:01:45",
    "speaker" : "Steve",
    "text" : "That one's probably taken already."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh Tom Brady's car is available. Tom Brady car don't Tom Brady car is available.",
    "timestamp" : "01:01:46-01:01:50"
  },
  {
    "text" : "Perfect.",
    "timestamp" : "01:01:52-01:01:52",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:01:53-01:02:10",
    "speaker" : "Andy",
    "text" : "$9. 48 for the year. Steep. Actually, no, $5. 98. It's on sale, boys. I feel like this might be serendipity. The URLs do, yeah. Use coupon new com598 at checkout."
  },
  {
    "text" : "What are we gonna put on the website though?",
    "speaker" : "Greg",
    "timestamp" : "01:02:10-01:02:13"
  },
  {
    "text" : "I think we've already discussed it, haven't we?",
    "timestamp" : "01:02:13-01:02:14",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:15-01:02:16",
    "speaker" : "Greg",
    "text" : "Yeah, Tombird's cock."
  },
  {
    "text" : "There's literally just a picture of you with the iron flatable penis standing on top of RV in Buffalo Just a picture of that like full screen. Yeah? That's fair. Okay. All right. So if you go by the time this comes out, if you go to tombradycar. com You'll find out that uh it's Greg standing on top of a car uh dressed in a Tom Brady jersey with a very large inflatable penis.",
    "speaker" : "Andy",
    "timestamp" : "01:02:16-01:02:42"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:02:42-01:02:42",
    "speaker" : "Greg"
  },
  {
    "text" : "Anatomically correct? Is that what you've been telling people? Yeah.",
    "timestamp" : "01:02:43-01:02:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It was actual size. Okay. Good to know. Might appear bigger in rear view nurse.",
    "timestamp" : "01:02:46-01:02:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Jesus Christ. How did we get here? I don't I don't remember. Is this my best?",
    "timestamp" : "01:02:56-01:03:03"
  },
  {
    "timestamp" : "01:03:03-01:03:03",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:03:05-01:03:06",
    "speaker" : "Andy",
    "text" : "Feels like it is"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:03:07-01:03:11",
    "text" : "Are you guys excited to go to the Patriots Panthers game?"
  },
  {
    "timestamp" : "01:03:11-01:03:15",
    "speaker" : "Andy",
    "text" : "Oh, we should, yeah, we should announce that just in case we have any listeners in the area."
  },
  {
    "timestamp" : "01:03:15-01:03:16",
    "speaker" : "Greg",
    "text" : "That's a good point."
  },
  {
    "text" : "For Gregory's birthday. Since we're not uh going to be all together for the holidays, we've decided that we're going to go to the Panthers game. We're all going to meet down there And we will be hanging out before and after the game in Charlotte area, I guess, somewhere. We haven't figured that out yet. So, if you are going to be in the area yourself, you can hit us up at the Dynasty Hotline. Steve Brown, what's the number No fucking chance. Just look at I'm looking at the like the vacant stare in your eyes right now because you were fucking wiped.",
    "timestamp" : "01:03:17-01:03:52",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I've had a I've had a go of it.",
    "speaker" : "Steve",
    "timestamp" : "01:03:52-01:03:54"
  },
  {
    "speaker" : "Andy",
    "text" : "That hair is amazing right now. Um it is 603. 505-8043. Shoot us a text. Uh if you're going to be in the area, you can meet us up. We'll give you some free swag or some shit. I don't know. We'll find something.",
    "timestamp" : "01:03:54-01:04:08"
  },
  {
    "timestamp" : "01:04:09-01:04:11",
    "speaker" : "Greg",
    "text" : "Place play you for swag and bag toss."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh there you go. All right, Greg. Uh I feel like you said you had a condition of us coming to visit you and you wanted to save for the podcast.",
    "timestamp" : "01:04:12-01:04:19"
  },
  {
    "timestamp" : "01:04:19-01:04:24",
    "speaker" : "Greg",
    "text" : "Oh yes. This is my birthday present to me, Andy."
  },
  {
    "speaker" : "Andy",
    "text" : "From us?",
    "timestamp" : "01:04:25-01:04:26"
  },
  {
    "text" : "No, just you. Oh, from me. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:04:27-01:04:31"
  },
  {
    "text" : "I might not come.",
    "timestamp" : "01:04:31-01:04:32",
    "speaker" : "Andy"
  },
  {
    "text" : "You got On game day, tailgate in the game, post-game, you gotta wear the Dan Diadorf jersey.",
    "timestamp" : "01:04:32-01:04:41",
    "speaker" : "Greg"
  },
  {
    "text" : "Ooh, that's a good one.",
    "timestamp" : "01:04:42-01:04:44",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:04:45-01:04:47",
    "speaker" : "Andy",
    "text" : "Post-game, I gotta wear the Dan Diedorf."
  },
  {
    "speaker" : "Greg",
    "text" : "Post-game and pregame.",
    "timestamp" : "01:04:48-01:04:50"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:50-01:04:51",
    "text" : "I'll give you one."
  },
  {
    "speaker" : "Greg",
    "text" : "You can wear a Patriots, how about this? You can wear a Patriots jersey into the game. Yeah, he's letting you wear it in the stadium. But you gotta walk around You gotta walk around pregame wearing your Dan Diodor shirt.",
    "timestamp" : "01:04:51-01:05:02"
  },
  {
    "timestamp" : "01:05:03-01:05:08",
    "speaker" : "Andy",
    "text" : "I'll do it pregame. Okay. Okay. All right. As long as I remember to bring it."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:05:09-01:05:14",
    "text" : "Well well if you don't yeah you might as well stay in the fucking Airbnb because I got the tickets boy."
  },
  {
    "speaker" : "Andy",
    "text" : "We'll see. You're you're a goddamn lunette. I'm sure I can crack your password. I ain't worried about it.",
    "timestamp" : "01:05:14-01:05:22"
  },
  {
    "text" : "No, Craig's a lettuce. He has paper tickets.",
    "timestamp" : "01:05:22-01:05:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:25-01:05:46",
    "text" : "That's even easier to steal. Just don't tell him that. Uh All right. Well, I think is there anything else you want to talk about, Steve? Did you have any other notes? How do you feel about the Steven how do you feel about them drafting Steven Jackson the first round? Even though they had Marshall Falk. Oregon State, boy."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:05:47-01:05:52",
    "text" : "Should we put some uh predictions on record here for these next cup in a couple weeks?"
  },
  {
    "speaker" : "Andy",
    "text" : "I think the Patriots will win these next couple of weeks in 2004. Um I think they might lose one more game.",
    "timestamp" : "01:05:53-01:05:58"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh I think they win it they they go undefeated on the Super Bowl.",
    "timestamp" : "01:05:59-01:06:02"
  },
  {
    "timestamp" : "01:06:02-01:06:08",
    "text" : "They do not, Steve. Um but I'm gonna I I'll I'll bet you on it, Steve. I bet they don't.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:06:08-01:06:16",
    "text" : "Steve, don't do it. Steve, why you why are you so pooped? What we got going on here?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:06:17-01:06:22",
    "text" : "I was in Savannah for a bachelor party and I've been on the road for work for three days."
  },
  {
    "text" : "Whoa, we how was that?",
    "speaker" : "Greg",
    "timestamp" : "01:06:22-01:06:24"
  },
  {
    "speaker" : "Steve",
    "text" : "Lauren's been sick, gusses in heat. Just dragging that pussy all over the ground everywhere.",
    "timestamp" : "01:06:24-01:06:30"
  },
  {
    "timestamp" : "01:06:33-01:06:35",
    "text" : "Oh that's what that is? That's a diaper?",
    "speaker" : "Andy"
  },
  {
    "text" : "She's wearing diapers. Oh jumping at the wall. That's why I keep it on mute.",
    "timestamp" : "01:06:35-01:06:40",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:06:40-01:06:44",
    "text" : "Oh dude. Can't imagine why you're so tired.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:06:45-01:06:51",
    "text" : "How was the bachelor party? Did you guys get up to no good? Yeah, shitloads of no goods I'm so goddamn tired.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:06:51-01:06:51"
  },
  {
    "text" : "What happens in Savannah stays in Savannah.",
    "timestamp" : "01:06:52-01:06:55",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Unless your dog's in heat.",
    "timestamp" : "01:06:56-01:06:57"
  },
  {
    "timestamp" : "01:06:58-01:06:59",
    "speaker" : "Greg",
    "text" : "As they always say."
  },
  {
    "timestamp" : "01:06:59-01:07:01",
    "speaker" : "Andy",
    "text" : "They do. I've heard that."
  },
  {
    "timestamp" : "01:07:03-01:07:05",
    "text" : "Your hair looks your hair looks good.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I'm going long hair, Steve, for a little bit. We'll see how it goes.",
    "timestamp" : "01:07:05-01:07:08",
    "speaker" : "Steve"
  },
  {
    "text" : "All right. I was being sarcastic. I know you struggle with those things.",
    "timestamp" : "01:07:09-01:07:15",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "No. Well, I don't care. I'm gonna go long here, Steve, and see how it goes. I like how I can",
    "timestamp" : "01:07:16-01:07:21"
  },
  {
    "timestamp" : "01:07:25-01:07:32",
    "speaker" : "Andy",
    "text" : "Oh my god, you missed me. That's that's rough look. Alright, uh this is devolving very quickly."
  },
  {
    "speaker" : "Greg",
    "text" : "So most shamelessly ugly person in the world.",
    "timestamp" : "01:07:32-01:07:36"
  },
  {
    "text" : "Yeah, it's easy to be ugly when you have no shame. Yeah. That's that's fair.",
    "speaker" : "Steve",
    "timestamp" : "01:07:38-01:07:42"
  },
  {
    "timestamp" : "01:07:43-01:07:45",
    "speaker" : "Andy",
    "text" : "So uh what's next week, Steve?"
  },
  {
    "timestamp" : "01:07:46-01:07:47",
    "text" : "Dunno Bills.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Nobody circles the wagons.",
    "timestamp" : "01:07:50-01:07:53"
  },
  {
    "text" : "Like the Buffalo.",
    "timestamp" : "01:07:54-01:07:54",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Like the Buffalo Bills. So who bled so? Drew Bloodsoe. Back in back in town. Drew Bloodsoe Revenge Game.",
    "timestamp" : "01:07:54-01:08:01"
  },
  {
    "text" : "Uh is he still on the Bills? Yeah. They moved on and he's now at uh",
    "timestamp" : "01:08:01-01:08:05",
    "speaker" : "Andy"
  },
  {
    "text" : "No, we'll tease it. He's still in the bills.",
    "speaker" : "Greg",
    "timestamp" : "01:08:06-01:08:08"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:08:08-01:08:08",
    "text" : "Okay."
  },
  {
    "text" : "And and he's gonna do something embarrassing next week. Are you sure?",
    "timestamp" : "01:08:08-01:08:12",
    "speaker" : "Greg"
  },
  {
    "text" : "Are you sure that's not a game?",
    "speaker" : "Andy",
    "timestamp" : "01:08:12-01:08:13"
  },
  {
    "text" : "Yep.",
    "speaker" : "Greg",
    "timestamp" : "01:08:14-01:08:14"
  },
  {
    "timestamp" : "01:08:15-01:09:02",
    "speaker" : "Andy",
    "text" : "Are you sure that wasn't the game we made? Mm-hmm. Okay. No, I'm sure. Okay. In Gillette? Yep. Okay. All right. Well, I guess we'll we'll all find out together what that is next week. On the Patriots Dynasty podcast. So join us for that. Yeah. We'll find out what the fuck Greg's talking about and see if he's actually correct. I have no idea either. I thought he was talking about the uh the thing that happened uh already that we talked about in uh In Buffalo, where he got stripsacked at the end of the game on the fourth down that Richard Seymour recovered for a touchdown. But sounds like that's not the case. So even more embarrassing. Is it butt fall? It's obviously not butt followable embarrassing, but Andrew, you're gonna give it away if you keep guessing. I I I'm not gonna get it because I have no idea."
  },
  {
    "speaker" : "Greg",
    "text" : "All right.",
    "timestamp" : "01:09:02-01:09:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:09:03-01:09:07",
    "text" : "All right, well we'll all figure it out next week. Oh, I'm sorry, Steve."
  },
  {
    "timestamp" : "01:09:07-01:09:19",
    "text" : "Tune in next week to see how much of a blubbering little bitch Greg is on the Patriots Dynasty podcast. See you later. See you later. Bye",
    "speaker" : "Greg"
  }
]