[
  {
    "speaker" : "Andy",
    "text" : "Alright, welcome back to the Patriots Dynasty Podcast, the only podcast that is re-watching every game of the Patriots Dynasty era. And even the games that nobody remembers, even sometimes the people who play in them. This week we have uh the beginning of the Manjini Belichick rivalry, I guess you could call it. Um that might not even be strong enough.",
    "timestamp" : "00:00-00:22"
  },
  {
    "timestamp" : "00:22-00:23",
    "speaker" : "Steve",
    "text" : "Blood feud."
  },
  {
    "timestamp" : "00:23-00:31",
    "speaker" : "Andy",
    "text" : "Yeah, you could call it all sorts of things you could call it at this point. Um with me today, you heard Steve Brown. Steve, nice to see you. How are you doing?"
  },
  {
    "timestamp" : "00:31-00:34",
    "speaker" : "Steve",
    "text" : "Oh, I'm doing great. This is a real milestone for us."
  },
  {
    "text" : "Yes, I think so. Um we also have Tim Turn. Tim the intern. How you doing, bud? Doing great. Happy to be here. Nice. Um as usual, Greg is too busy. Uh um reliving his childhood dreams or something, playing uh men's open soccer three days a week. So he's not able to join us again. Uh so we decide to bring in somebody who actually knows what they're talking about. Uh so this week we have uh a special guest. Our first ever recurring guest, uh, Matt Shadow. Matt, thanks for joining.",
    "speaker" : "Andy",
    "timestamp" : "00:34-01:02"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Thanks for having me, guys.",
    "timestamp" : "01:02-01:03"
  },
  {
    "text" : "Yeah. See, Andy, I told you we're not the worst podcast. Someone came back. Have you noticed our mother hasn't come back yet though?",
    "timestamp" : "01:03-01:11",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, yeah.",
    "timestamp" : "01:11-01:12",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:12-01:19",
    "text" : "We interviewed her a long time ago and she will not come back on She actually told me uh recently she stopped listening. Oh no."
  },
  {
    "timestamp" : "01:21-01:26",
    "speaker" : "Tim",
    "text" : "That's tough and listening. That's my probably my fault. Sorry guys."
  },
  {
    "text" : "As soon as Tim joins, she's like, I'm out. So let's touch on this game a little bit before we kind of jump into things. This is 2006 week two, Patriots heading to the Meadowlands, when I believe it's still called Giant Stadium at this point. Um which is tough luck for the Jets who also play there. Patriots are facing that Jets team, and they have had a lot of turnover in the off-season. A new GM, new head coach, and a whole new roster. Um head coach is somebody you probably have heard of, Eric Mangini, the former Defensive coordinator, right? He wa he ended up at the defensive coordinator position before moving over. Um long time it was kind of a Belichick find back in the day as a uh a ball boy for the Cleveland Browns, I believe the story went. And Belichick loved his work ethic, so kind of like brought him in and he worked his way up and ended up under Belichick in a few different spots. And then went off on his own to the Jets. Also, somebody who went with him is the aforementioned Matt Chatham, who. uh in this offseason would would go over to the jets. So I guess for me since we have Matt here, I kinda wanna get the Um just kind of the the differences between those two, like not just the coaches, but like the organizations and like was was there a difference. Like a huge difference that you noted in each uh place that you played in?",
    "timestamp" : "01:27-02:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "02:52-03:52",
    "text" : "So off the top, I'm gonna absolutely answer your question, but uh I I wanna mention that uh One of Coach Belichick's big things, this is one of his like big sort of uh from the mount kind of uh suggestions, was that you never this is more when you're playing, obviously, you never uh take a comparison question amongst places you've been and places you know places you you now are. So that makes sense. And sort of the it's it was always sort of the trap thing where he's like his his old line was that like you can't win. Whatever you say, you think you're complimenting the last place, but if you make any contrast to the other and you you color it a little bit better or different or You anything in your voice that might indicate that you think that that place is doing something, that the other place wasn't doing. And next thing you know, you've pissed on someone else. So this used to be It's always hilarious to me, obviously in post-career, you know, all all all of that's over, but it's hilarious that whatever's like, compare those last two places and like every free agent that's ever left New England or come to New England has been given this speech. Never compare."
  },
  {
    "speaker" : "Steve",
    "text" : "It must have been so hard for Randy Moss in 2007.",
    "timestamp" : "03:54-03:57"
  },
  {
    "text" : "Exactly. Well imagine the stories like on both sides on you know when you're leaving or when you're coming. Um of course a lot of people when they show up to the angle the first thing they want to say is, my goodness, this is great. This winning culture. I just got here from Cleveland or Arizona or wherever wherever, name a place, right? But no, so I I would say the the the running joke from that first year, so You know, for me I it just happened to hit in free agency for me. So I'd uh I'd had uh my first original rookie contract was for three years, then I did another three with the Patriots, so then that finished me at six and it just happened to be my my unrestricted year uh uh and manjini was getting this job so I had really looked hard at staying with them anyone really wanted to uh but they loved me you know Scott Julie and I were close and uh had a ton of respect for him, you know, really still one of the playful bill and all that stuff. Uh but they they had a hardcore, you know, uh sort of set value for what they they felt about me and they appreciated me for that, but they never saw me as a future, you know, full time starter. They thought I was better as a spot starter, backup, and killer on special teams. He's like, that's who we are in the league. That's who you'll always be. And it's sort of just, you know, soul crushing to hear that. I guess you're thinking I'd love to go start someplace and you know. But the reality of my old game was You know, I was an edge setting uh defense guy, but with no pass rush. Could pass the cover a little bit if necessary and then cover kicks. You know, that's and block the hell out of people. So um that's just uh you know it's a niche kind of makeup and Bill felt that way and he was sort of ardent on that's who you are and we really value that but that's all it is. Uh Manji Manjini on the other hand was like, No, I've been around with you, worked with you for a couple years. You could absolutely be a starter in the NFL. Uh you just need your opportunity. I mean, you've you played behind Braves and Willie for all those years. So of course of course you didn't break through the starting lineup, but in a better situation you could. Um so anyway, the the that's in part when we were going through negotiation with those two guys. I did not take a trip to Houston, did not take the trip to San Francisco. Those are sort of the other alternatives uh in free agency. And you know, it it in fairness and standard it was, hey, I know this guy and he seems to like me and He seems to I can believe him that my role might actually increase. Um I went out uh so anyway, we we we start the season, uh you know, um early in that class, uh, there was uh I believe tampering charges were filed uh against the Jets early on, and I was part of that. So When you're talking about the bad blood stuff, I mean this is a this is this is part of it, right? So there's already been some some off season sort of finagling. Um it was a weird year. I don't know if you guys remember this, but um This is I think there was a just des certification or there was an an an attempt to extend the CBA or something was going on that offseason. So the start of free agency got messed up a couple different times. So You know, I'm I'm trying to be first, you know, first first hour that you, you know, it's like at midnight on whatever day it happens to be your free agency opens. I know I'm going down to see uh the Jets. Uh Chemo Van Ohoffen, I don't even remember Chemo. Chemo was a stud interior defensive lineman for Pittsburgh that we've played against for years. So he knew he was gonna be a free agent, so Eric had been targeting Chemo and myself. And Tim Dwight was a guy that had actually killed us when we were out in when he was the Chargers out in San Diego and had really given us a lot of problems. And I I I believe it was the three of us on that first opening weekend, you know, sort of being winded and dying to trying to get that done. But something about that we had gone down thinking we were good to be there and then they changed the date and I I think that I think that had something to do with it. I don't know if we did anything wrong. I don't think we did. But The the point is they they filed something that we were they had reached out to us too soon or at the wrong time or something like that. But anyway, that that kind of shows the temperature up behind the scenes a little bit. Um And anyway, so you go into the game, um, and your guys' question for my long-winded answer was basically just what's the difference between the two places. And I was just to kinda joke with a lot of my new friends at this new place that like it was sort of New England m but just in like green pajamas. Like it was weird that, you know, we I went to the first practice and you're you're giving this, you know, your sweat stuff, uh, you know, top to bottom, which I used to be in like either a gray version or a blue version, New England. And it was like logo changed, all green, but then Eh l the loom the practice schedule was the same. It was like I was in the new building but like doing all the different stuff weren't a different thing, you know.",
    "timestamp" : "03:59-08:27",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "Does that make it easier to make the change?",
    "timestamp" : "08:27-08:29",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "08:30-09:58",
    "speaker" : "Matt Chatham",
    "text" : "Super easy. And that was what the the appeal for me is I already know what I'm getting into. I know what I'm gonna be doing, I know what the scheme I'm gonna be playing in. Um this is this is that's the appeal, right, for for someone like me. And It was, hey, you're gonna come down and be a leader, you'll be a special teams, you know, kind of leadership type kind of thing and we go through the off season and I get It voted in a captain, so I kinda know that like, you know, I I'm coming down here to kind of help teach this defense and, you know, teach the whole air quote, I know it's yes, but the you know Patriot Way kind of stuff and all that. And you know, that was that was the stick. That was that was kind of what we were doing. Um So yeah, but to say, you know, yeah there's familiar faces. Remember Brian Cox was uh BC was uh a teammate of mine who's now a coach there, and um Uh you know, just there was enough uh Corwin Brown who had been a former Patriot is now like a defensive back coach there. Uh you know, there's Bob Sutton. I don't know if he ever had any connections with the guys, but Uh there there were there were enough sort of pseudo-familiar faces in the building uh that had connections either with Eric or other people that those guys had known Ronald League and We're kind of, you know, just enough of us in the room. Bobby Hamilton at one point came down. I don't remember if it was that year or maybe the next, but uh then Ty Law comes back and I was there and And TD Troy, or sorry, Tim Dwight had been in New England with us for that one season just prior to that. So just bring along as this is really common. Bring along as many familiar faces as you can and try to help uh sort of translate for the next group."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. What about the non football stuff, Matt? Like did you where'd you live? Did you move? Was the facilities any better or different?",
    "timestamp" : "09:58-10:04"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Yeah, so I remember uh Doug Gabriel, you remember that name? Uh wide response in this year this this season. So So Doug rented my condo uh in Bellingham here. So I kept my place here, not knowing, you know, this is a free year contract ended in New York, who knows what's gonna happen. I, you know, this is my first relatively large, you know, get a free, you know, get a signing bonus, get a extended deal, you're in a little bit more leadership position, you're gonna make a little bit more money. So hey, I'm gonna buy a house. Uh I bought a new construction in Long Island out in Huntington. in the middle of the island, uh but I did it sort of under the understanding that it was going to be a relatively quick flip because the jets in It was a three-year contract for me and two of the years are in Hempstead there, you know, at Hofstra. And the third season I know is gonna be over in Jersey. 'Cause they're building their brand new shiny uh trade facility, right? So yeah. So I kinda bought the house, no one was gonna flip it, and like an idiot, uh You know, I I bought this thing right in the middle of uh the real estate cra crash, right? So a new construction in two thousand six at really high dollar on the north shore of Long Island And uh whoopsie.",
    "timestamp" : "10:04-11:08"
  },
  {
    "speaker" : "Andy",
    "text" : "You're probably breaking even on that right about now, I would say.",
    "timestamp" : "11:08-11:11"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Getting getting I I I took a bath. And I haven't got it for ten years too, so that's another side story. But anyway, the the point was yes, I bought a house man island, I'm happy, uh got the big big home, I'm feeling a little bit more like a vet. And uh really nice place I live maybe an exit or two away from Bentpage Black where that where you know where the Ryder Cup was just recently. So We would go post practice, you know, a couple times uh, you know, I'd probably play there half a dozen silver times a summer and was there for three years and just Best page is down the street, but the only thing that sucked is Beth Page is uh the black horse you can't write a card on. So you gotta walk. So you can imagine So you can imagine uh you know, tired after workouts and stuff and we're trying to sneak away to to to get on a map piece and you gotta lock hold everything.",
    "timestamp" : "11:12-11:57"
  },
  {
    "timestamp" : "11:58-12:00",
    "text" : "Steve Brown would never.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I only play golf with beer and carts for sure.",
    "timestamp" : "12:00-12:03"
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "12:05-12:13",
    "text" : "It does it does complicate the decision. Of course, but uh have a walk? What is that all about?"
  },
  {
    "text" : "Uh so um just kind of bring it back to this game a little bit. Um I felt like there was uh a lot of kind of gamesmanship between Belichick and Man Gini.",
    "speaker" : "Andy",
    "timestamp" : "12:14-12:26"
  },
  {
    "timestamp" : "12:26-12:26",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:26-12:49",
    "text" : "Um was there ever like uh like when you were on the Patriots, was there ever kind of like this Um like any anything from Belichick that would give you an idea of like the fact that he really did not like the Jets at all Um because there's been kind of like a lot of talk about that, but nobody like specific has ever said, yeah, no, he told me he hates the Jets. Um it's just kind of a feeling everybody got."
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Yeah, I I don't think it was like y you just read your coach, you know. Your coach is uh that guy of course is laser focused week in, week out, but there's always a little extra juice in Jets Week and that's just Everyone knew his history. He didn't have to get up on the podium and and make a speech about it. But yeah, of course, Bill had a history with that team. It was it was the animosity for the way it ended and uh changed hands and yeah for all those the six years I wasn't knowing one of course when Jets Week came up Jets Week was a big bleep a deal and that was just kinda how it was and we always do that. So yeah now you're wearing that stuff. You're playing for the other place and you have a a a real appreciation for yeah I know. I know what you're thinking about this weekend.",
    "timestamp" : "12:49-13:26"
  },
  {
    "timestamp" : "13:26-13:26",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "Well well in in fairness it was kind of fun, you know, uh in my in my point of view. I mean, think of all the guys that have come through there. Like I mentioned, Bobby Hamilton, Roman Pfeiffer used to play there, uh Brian Cox was there, Ty Law was there, Victor Green. Bobby Hamilton, Vic Green, of course, uh Chris Martin, you know, there's Um we can go down with it. I mean there's even more. But the point of it is like there's a lot of guys that have been in both places and even other spots in the division and kind of have seen both sides of it. And you kind of from the Jets point of view it's very much little brother like so annoyed with here and all the patriots crap, right? And like it's just it's this hump we can never get over So sick of the patch crap, right?",
    "speaker" : "Matt Chatham",
    "timestamp" : "13:26-14:08"
  },
  {
    "timestamp" : "14:08-14:11",
    "text" : "Oh yeah, I'm I can relate the song to Andy all the time for sure.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "I mean that's you know I was a part of the patch crap. So like it was, you know, now I'm in here and I'm seeing the other side of it and you kinda get like okay, it's it it sucks always. always being, you know, sort of the punching bag for the other side. So it's the driving force. It's it's the as much as I you know it energizes the path locker and for the Jets, it certainly does that for the the Jets back in the other direction Yeah.",
    "timestamp" : "14:12-14:33"
  },
  {
    "text" : "But like the the Belichick and Manjini handshake, which obviously they even commented on this game, their first one, but that became like must see TV. Like why do you think like that Because Belichick never really had that kind of acrimony against any of his other assistants who went elsewhere. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "14:33-14:48"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "I I'm talking out of my ass here, so I don't think at all on this particular subject, but you know I just I Presume that maybe there's just more to it because it was New York, right? So Eric if Eric had gone to Denver, I mean I don't know what was available back then, but you know, whatever. Name a team, any team. It it's maybe just that it was that particular team, right? And that it was kind of a pick up your stuff and get it out of here now once you realize that's where you're going. Because obviously, you know, lingering and you know, getting any intel on the way out the door is probably bad ball. So yeah, I mean that's just oh, you play for them now, screw you. And and honestly, I um was a relatively insecure guy back in those days. You know, you're a team's guy and you're just happy to keep chugging away and knocking out yours. And I'm thinking, oh man. I went to here. Well I made more money here and I didn't make a ton of money prior to that. They were never gonna pay me a lot. I've got now I got a lot more money here and everyone's gonna understand that, right? And I'm like, oh man, they all hate me now. You know, it's it's that whole psychological thing. Like, but but a lot of my good friends are still back there. Obviously, uh is or Larizo and Braves and Brew and all the other linebacker guys. So you know, like Everyone understands. You gotta do what's best for your family and all that stuff. But yeah, you definitely um yeah, you definitely felt tension because it was that particular place that we went, you know.",
    "timestamp" : "14:50-16:04"
  },
  {
    "speaker" : "Tim",
    "text" : "Yeah So Matt, can you speak on like what like what are the little things that like you would say to us that like makes you feel that tension? Like What specifically like turns that up? Is it the coach? Is it what he's telling you? How they're going over film? Like what specifically like makes you feel that?",
    "timestamp" : "16:05-16:25"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "So Um, a couple things. Obviously just in the game week. I mean but I I I had to be fair here. So like even going back to like my rookie season where I I didn't play, I was cut and then came to the Patriots. I was in in St. Louis with the Rams. So when I I'm just seeing this as like a wide eyed, brand new guy in the league. The Rams got that way about the Niners. And I knew nothing of it, right? Like I don't know anything about e either team. But It just was really weird in the building, but they all got crazy excited about it. And there's just some fan from from Iowa, the general in the building without a team. I was like, why are these guys so into the Niners thing? I I don't get this, you know, but the point of it was there's like legitimately injured in energy about it and there's guys all around the building that have maybe been involved in it longer and they feel that intensity like someone might with some sort of Ohio State, Michigan thing that I'm clueless about and hey, this is their thing, whatever. I'm gonna go along with it and eventually it'll become my thing after a few years too, I guess. But I mean that's that's just that's just kind of how it is. So in in New England it's the Jets and Patriots. That's just kinda how it is. They hate each other for whatever reason, right? I don't know the history, it's not mine, but uh they they don't like each other You just gotta work.",
    "timestamp" : "16:26-17:31"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I wonder how much of that comes from like the fans and the the media and everything. Because it is it's a Boston, New York thing, right? And so how much of that feeds into like uh your side of things.",
    "timestamp" : "17:32-17:43"
  },
  {
    "timestamp" : "17:46-19:02",
    "text" : "I say this to maybe every former Patriots guy I play. Screw that. I I I bet there's a bunch of guys, and we've to we've talked about this, that actually appreciate it in other environments where it's kind of wild. Like Buffalo's an example, like They're always the opponent, right? But that's a cool place. Like when they get going, it's it's pretty sweet when, you know, it's just a fun environment to play in and you kinda like it a little while. I kind of felt felt that way about you ever playing a Monday night football game in New York in the old Meadowlands and they're doing the J E T S thing. I I know j I know it pisses off Page fan. I know it's annoying as hell, but like when you're hearing it and you are a jet it's pretty cool. It's Monday night football and the you know the fireman guy is doing his thing and they're doing the J That place is rockin', it's one of the loudest places on earth right there in that moment and it's pretty freaking cool. So uh you know, and that's it it's It's more of that when hey it's the pads in the building, right? And yeah, that's the other thing. It was new to be new to me. I mean I'd only this is my second game, I think, as a as a jet the week the week before we had traveled to Tennessee. So, you know, this is this is my first time seeing the other side of it and They were fired up, you know. Hey, we got this Pat's coach, you know, and we're playing them, and this is the whole thing. So yeah, it was it was a charged atmosphere to say the least.",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "I mean, yeah, it it definitely seemed that way for sure. Um and it was one of those games where like the Patriots went up early too. They were up twenty-four-nothing. And then kind of uh on a fluke, Jericho Cotri. Like catch where he like somehow his knees didn't go down. Yeah, that play was crazy. Wild. I watched it a bunch of times to find out how he actually didn't touch the ground.",
    "speaker" : "Andy",
    "timestamp" : "19:02-19:25"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "And then rolled over the top of them. And then it we were all big plays that game. I had to again no no recollection of it. I had to go back and watch it and go, oh yeah, oh yeah, oh yeah. I remember all these things. But there was it was Jaco's crazy play, and then there was also Liberty's Pulls. LC had the really big 40 plus yard catch and run uh in the second half. So yeah, jet Pascal up on us big in the first half, but we fought back, made close, and then lost it down the stretch. So I think one of the biggest things that stood out to me, and this is, you know, again, don't have the recollection live in my library, but when I put click on a video go, oh yeah, that's that thing. I remember obviously sort of the the energy and I'm fired up and I'm angry and I'm ready to go, you know Have an awesome game 'cause they didn't retain me and you know, offer as much as I'd wanted to, and hey the Jets did, so I appreciate that, blah blah blah. And so we go down to the opening kickoff and the one thing I did know, and this this Bill Bill did do this uh quite a bit, is he would he would he he never wanted someone who left there to come back and make plays against him H Right. So the and I knew that and we would do that to other guys that you know that we knew or that we you know there's no way uh blank who left is gonna come back and have a big game because it's not gonna happen. So I knew when I left that I'm gonna get some extra attention. You just know it. And so I come down on an opening kickoff and two guys from the wedge veer off and come towards me. It's like I just knew it wasn't gonna happen, right? And one of them was Steve Neal. And uh if you go back and sh go back and check this out, I actually gave Steve a really good pop, knocked him back pretty good But it's not it's not fair and on the guy who accepts that blow. He knows that I know. We all hate it. We'd always been talking about this for years, but Steve is a starting guard in the NFL exception. Problem is athletic guards in the NFL. And he's out there in the wedge. Like it's crazy. You know, Bill was that way. He would always use his guys, uh, you know, full roles. But you know, Steve doesn't want to get hit by some, you know, two hundred and fifty-five pound guy. Same height as him running down the field at full speed and Steve gets a ten yard run of it. Like it's not fair, right? So I know it because When we flip it around and we're on kicker turn, I'm the one that has to get hit. I hate Red Blood. You know, so but I knew I knew how much Steve hated the W DM things 'cause he'd complain about it and I complain about it and we all complain about it and I'm like, oh dude, I'm gonna go get hit him. So it was just one play, I know we hate shit, and I know we don't want to do this and and uh I'm gonna go kinda you know I saw him kinda peel off So I got a pretty good shot on them, but then somebody else picked me up and and sort of uh brush brushed me away. So I didn't get another attack on the opening kickoff. But then on the first punt, I did get the tackle on Kate Fox. You did? K Fox a buddy. And I just it was that moment where You know, you say hello in pre-game, you chit chat with a few of the guys, but it's pretty cold. You know, you're trying to go win your thing and they're trying to do their thing. But it was that moment on, you know, I'm covering a kick and Oh I'm on top of a play and oh it's Kev. Hey Kev! It's it's kind of oh hey what's up, buddy. And like you kinda get up and it's like this is so weird. This is like attacked on your brothers or something and then You know, trying to be all angry and oh I'm pissed. I'm like, oh it's kind of you know, like, oh it is and there's uh there's Tommy and Bruin. I don't know, it's just it it is kind of a weird thing. Like you wanna be focused and into it and trying to be some sort of uh menace, but yeah, they're all your old buddies.",
    "timestamp" : "19:32-22:39"
  },
  {
    "text" : "I mean that was actually the play that uh like I when I was watching this game last night, um, I saw that that happen. I thought, Oh yeah, that's right, Matt Chatham was on the jets in this one, that's what made me reach out actually was watching that play. Um and so it kind of feels like um like coaches and s like that side of things. Um And you know, the fans on the media and everything holds maybe more well animosity might be a strong word, uh, but hold more grudges than maybe the players themselves.",
    "timestamp" : "22:40-23:08",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I mean I I it's I think it's a fair point, it's just that it kinda depends on guys' situation, right? So there there are going to be people that hold grudges against teams because they don't like how they left. And blah blah blah. Like I think uh Asante Samuel is a good example. He's he's very public with it, so I'm not breaking news that Zant isn't the the biggest fan of the team or whatever. So but I mean there are certainly those situations where a person will have something out against the past. I certainly didn't. I was Super grateful for the time there. Still had tons of friends there. Like I said, kept my my place there, although I had rented out to a receiver there. But I mean I knew I was most likely coming back at some point. So it's not like you know you were trying to burn a bridge or strike that. But Yeah, the I think it's more the timelessness of it. You know, if you're you know you're up going to middle school, high school or whatever and have grown up knowing you know, that we're supposed to hate this team and we do hate this team and hate the characters that are involved with it. Yeah, of course the fans I think put a lot more stock in that than maybe players do, but Uh like we mentioned before, I think teams kind of take their guidance from the staff and if the staff has you know in Bill's situation has a really, really uh you know thing against somebody, then yeah, it's gonna reverberate and the guys will take it on and In that instance, I think it's sort of read both ways. Like everyone knows that Bill feels that way. And then your your guy's now Eric, so we gotta stand up for our guy or whatever, right? That's just kind of how the dynamic of this sort of plays out.",
    "timestamp" : "23:09-24:29",
    "speaker" : "Matt Chatham"
  },
  {
    "timestamp" : "24:30-24:37",
    "text" : "Right, I have the real question everyone's thinking. But they're too afraid to ask. When did you first hear the word spygate?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Ah so is it is that that C then or is this to di is that oh seven? This is like what's leading up to it though. Yeah. Uh okay. Did something happen in this game that's relevant to I don't think so.",
    "timestamp" : "24:38-24:49"
  },
  {
    "speaker" : "Andy",
    "text" : "I think there's just kind of that um early gamesmanship um that you'd see in oh six games, uh especially like uh in the wildcard game too, you saw that a lot of Um trying to one up each other from a coach's standpoint, I think.",
    "timestamp" : "24:49-25:01"
  },
  {
    "speaker" : "Steve",
    "text" : "But you were there in 07, right?",
    "timestamp" : "25:02-25:03"
  },
  {
    "text" : "Yeah, I was there for I was there for three of them. So the the the thing with the The the reason I know uh I I experienced spy gate from the sideline. So I had uh I had uh um sesmoid joint tear. So I had like reconstruction uh on my foot in the way someone would have it on their knee, like an HDL with Well I had my bait my big toe joint and big scar between first and second, your great toe and your next toe, model on the side and then ligaments reattached from the bottom of my foot. Yeah. It was a it was a hot mess. So I had that I had that uh from mini cam it happened. I played every single game as a Jet with that stupid thing, but I didn't have the surgery until after the season. So I had torn that in many I'd taken that new contract with the Jets And I I I tore that in minicamp and uh play played that whole first season with that stupid thing and it was driving me nuts and then didn't really get it looked at until after the year. I was like, dude, your ligaments are all torn up. And I'm like, I know, I know. So I'm getting older and I can't move and I need to get the thing fixed. So the point was I was on PUP though to start the season. So uh the the O seven season. So I actually was, you know, part of the helping get signals in kind of crew, because we know that they You know, you know how it is. Like they uh you use several guys, there's dummy signals and all that kind of stuff. And the other side the other side's doing the same thing back to you and all that. So yeah, I was directly across from the whole camera guy on the sideline thing.",
    "timestamp" : "25:04-26:25",
    "speaker" : "Matt Chatham"
  },
  {
    "timestamp" : "26:25-26:27",
    "speaker" : "Andy",
    "text" : "So I saw that tapes"
  },
  {
    "text" : "I saw that oh probably, yeah. I mean I saw that I saw that out of uniform. So it was they do this a lot in the NFL. It's like um, you know, like a veteran happens to be injured and they want him on a sideline to still coach A little bit, yeah.",
    "timestamp" : "26:27-26:38",
    "speaker" : "Matt Chatham"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "26:38-26:38"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "So I I says spy gate game or whatever right there from the side of my mountain really playing. So um yeah, it's all",
    "timestamp" : "26:41-26:48"
  },
  {
    "speaker" : "Andy",
    "text" : "Wow. So that may have been you that we saw calling the plays in the the one spy gate video that everybody just found the the like ten second clip of",
    "timestamp" : "26:50-26:58"
  },
  {
    "timestamp" : "26:57-27:53",
    "text" : "I think it was very often the dummy call, you know, the guy with the the giving the the fake signals. Like if anyone really bought what I was signaling him, I got Like it looked like a like a naked gun kind of thing. Like I was doing like crazy arms or whatever. I did you know, so that but i I'm glad we you know got the timeline right there because 06 I don't really recall so the one thing with the O six season relative sort of the game should ship and the really sort of animosity with one another We they sneak through with the win that on that opener, the the one in our place. But we did play them again in season and we we won later in the year in November there. Hard fought win, muddy day, gross day, and the the kicker from that one was I believe they had a buy the week after. And uh they tore up the turf. Um and so that was the last grass game, I believe. I hope I'm not sure.",
    "speaker" : "Matt Chatham"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:53-27:54",
    "text" : "Oh, interesting."
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "27:58-28:14",
    "text" : "Uh and I believe they cut uh uh Gabriel after that. Uh after that game because there'd been a drop or two or something or a fumble or something like that. And I know this because I was trying to collect collect rent from the dude and he When they saw them he left."
  },
  {
    "timestamp" : "28:23-28:24",
    "text" : "Oops.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "There was a whole little side story of that. But anyway, so I do know that the I they they were mad because you know it was a mud beat up game and we were, you know, they're high flying patriots and we're just kind of a grinded out Jets team, really good defensive squad there that year. Pen Pennington's playing well. Got some good a good receiver crew. The running game's kind of a mess. But uh You know, we can grind it out and went a game like that. We did, and I Bill was curious with the surface, and they if I remember right, I think it's because they had a bye week next day. We're able to tear it up in season and actually put turf down during the year.",
    "timestamp" : "28:25-28:58"
  },
  {
    "speaker" : "Andy",
    "text" : "That's funny because last week we were actually wondering when that happens. Uh yeah.",
    "timestamp" : "28:58-29:01"
  },
  {
    "timestamp" : "29:03-29:05",
    "speaker" : "Steve",
    "text" : "Week one on the field looked terrible already."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh garbage, yeah.",
    "timestamp" : "29:05-29:07"
  },
  {
    "text" : "Yeah, I'm almost positive yeah, it happened that year because w remember we play them in the first round of the playoffs in the wildcard game.",
    "timestamp" : "29:06-29:13",
    "speaker" : "Matt Chatham"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "29:13-29:13"
  },
  {
    "text" : "And and there's turf down.",
    "timestamp" : "29:13-29:15",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "Oh inter yeah. Interesting.",
    "timestamp" : "29:15-29:17",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:17-29:33",
    "speaker" : "Matt Chatham",
    "text" : "And you know, Sante has that big interception, uh the big fix on the sideline. I mean that that one's burned in my brain. But yeah, that's that was that season. So close game You know, puncher's chance kind of thing in the first one, come back, beat them in the second, and get annihilated in the playoffs."
  },
  {
    "text" : "I'm looking forward to that game. Yeah. I also hate the Jets, just to be clear.",
    "timestamp" : "29:33-29:37",
    "speaker" : "Steve"
  },
  {
    "text" : "So Matt, like in the progression like of that season, does it get uh like do the I don't know, like when you're playing against the Patriots, does it get different like as does it get a little bit colder as the season gets on or like you're seeing them again and it's still just kind of still friendly? Because it must be kind of awkward where You know, you're trying to prove yourself to like against the front office and coaching because, you know, they're not valuing you where you think you should be valued. And then you're having to take that out on like some of your former friends like on the field. You know what I mean? So does as the season goes on, does that change at all?",
    "speaker" : "Tim",
    "timestamp" : "29:39-30:18"
  },
  {
    "text" : "I remember a conversation I had with Scott Pioli and uh all all candor here. I love Scott. He's been great to me all throughout my career, first in getting me to New England and then while I was there and then in post. But uh he did make a comment to me in uh in the the free agency negotiation about concerns with durability. And, you know, like listen, I'm very open, for thread about what I'm good at, what I'm not good at, that kind of thing, and the issues I had. And I had a lot of bumps and bruises that I played through as a patriot. I was probably live in the training room guy, still played in the games, but you know That was with taking, you know, on average somewhere between ten and twenty plays of defense as a backup and then the thirtieth plays a team. And I think he had a reasonable and probably validated later on concern that giving me sixty-five plays at defense plus the teams, I'd I'd break down. And it was it ended up being true. So like I mentioned, they they go with a you know, they've gambled it, I'm not a longtime starter and uh I I blew that toe out literally a mini camping on the on the on the shitty hostra turf right uh the uh out outside outdoor turf it was horrendous uh my my fleet caught The snag and the toe turned sideways, bunny ends like a two inches out my shoe, like it was terrible. My toe was sideways. So I had to reset a tape and play through that thing for the season. But And then, you know, at that point now I'm relatively immobile and this is my big chance to say, hey, I should be a full time starter and I'm hobbly. So I'm able to still play and pulled together because I'm a vet, but now I'm still in a I'm basically down there in a rotational situation similar to what I was before Victor Hobson and Brian Thomas are there good starters themselves, but to unseat one of them I would need full speed me and I never had full speed me down there, so they're probably going, yeah, see. I'm going, yeah, you're probably right. So so no, so your your question though is you know, by is it you know, is it like that by the time you get to the second game? And by for me it's like yeah, I had cruised along doing well for them, playing well in the team's role and being a you know, valuable backup and rotating guy, but uh it was probably m not much different than the role I had when I left New England. So they're probably saying, see So uh for me personally though, um just thinking the arc of the season, you know, what are we trying to do down there, right? I'm a captain, uh we had a really good group of veterans down there. Pete um Pete Kendall, VC guy, uh absolute stud, great guy, I believe PA, smart dude. He's uh the the uh believe he's a he's a left guard, is left guard or right guard, but the guards of the team and one of the captains, him and Chad. Um Vilma, uh who the other defensive captain was, and then I was the team's captain, but Anyway, the point is we're kind of at that point where the group is trying to teach this paths thing back to the room, right? So you gotta A uh a mixed locker room with people that in part might buy into it and part are holdovers from her and you know kind of thing and they're trying to figure out if uh we really buy this many stuff or not? You know, that's just what you're fighting throughout the year. You win some, you lose some, and should we be doing the band the Belichick facsimile thing or not? And uh some guys are on board with it, some are not. So it's just sort of this tension throughout the season. But then you you you break through and you go up there and beat them there. And it's sort of that really heightened the whole man genius stuff or whatever at the time. And he's doing the appearance on Sopranos or whatever. I think uh Ben Graham was our punter at the time and uh I think some of them went on like Sesame Street or some shit during the year. I don't know. The point is it's you know, it's kinda good to be like a thing, you know. And pe people were buying in and you know the the way we played tight with the pass and then actually knocking on up later and I think we finished winning five or six or whatever. Uh in the regular season. So yeah, it was you know, people are starting to say, Oh, there's there there might be something to this.",
    "speaker" : "Matt Chatham",
    "timestamp" : "30:18-34:10"
  },
  {
    "text" : "I did not know he was on Sopranos.",
    "timestamp" : "34:11-34:12",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:13-34:15",
    "text" : "Like the second to last episode or something."
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Yeah, just like uh a cameo where they were at din they were at dinner, I think, and he called him genius. Yes, exactly. Tony Tony looks over across the room and calls him that or something and Eric waves I think the dialogue was pretty short, but yeah, I mean that's the height of the height of all that was going on in the world I think.",
    "timestamp" : "34:15-34:32"
  },
  {
    "text" : "You know, give me wrong. So one more thing to like kind of compare uh like New England to New York, the like amount of celebrities that are on the field. I Okay. Like would it w it had to have been like, you know, day and night compared to the like for home games at least, right? Thereof. Yeah. Yeah.",
    "speaker" : "Tim",
    "timestamp" : "34:32-34:52"
  },
  {
    "timestamp" : "34:52-36:05",
    "text" : "So I listen, I've had this conversation always several times so she's fully aware of this. But uh we there was a there was a particular Jets fan who was always on the field in pre-game not always but all often I'll say Um, you know, there's kind of like a little the little flagged off area where the celebrities and stuff would come down. And uh Jessica Beal. Jessica Beale was a big Jets fan, Jessica Beale was down on the sideline watching linebacker area every time and there would always be a little buzz that she's down here again. She's down here amongst the guys and We'd have uh what was my uh one linebacker which is I'm like an Adam, but he was uh he would be out doing you know, throwing the ball around for like an obnoxiously long hour that you know he's not normally doing that because like where such and such off yeah Uh but no, you there's definitely a lot more sort of peeping, I guess, uh for all the different celebrities and all that kind of stuff. And you notice it? For sure. And it like you know, it's not always like that in New York because, you know, the Jets have had some down years and they they don't show up for that stuff. But when the the Mancini stuff was going on and the you know we were kind of getting to be at the top of the town. it a lot of that came back and you know it's made made it made the fun made it interesting.",
    "speaker" : "Matt Chatham"
  },
  {
    "timestamp" : "36:06-36:14",
    "text" : "I mean that's almost the I I think outside of the Rex Ryan era, that's the last time the jets have been relevant, really Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "It was that it was that one it was it it was that one year, right? Because then the next year we had a step back and the year after that was the FARV year and you know, yeah. Okay, but didn't quite cross the line. So Yeah, and then yeah, Rex Rex uh got into the playoffs and yeah, I think it has been cold so I mean to be fair, Chad Payne think is the best quarterback in the AC East.",
    "timestamp" : "36:14-36:34",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "Until Josh Allen comes along after Brady.",
    "timestamp" : "36:33-36:36",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "So I I I I don't know if Pat's fans uh maybe I've said this at some point throughout, you know, all my post-career time, but I actually came away with you know you have a I don't know what to think of because I Chad was in Brady's class, right? Isn't Chad uh he was",
    "timestamp" : "36:36-36:51"
  },
  {
    "text" : "I remember the year after. No, I think yeah, I think he was uh he was around that time, but yeah, I think he was the crop or age though, but the point",
    "speaker" : "Andy",
    "timestamp" : "36:53-36:59"
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "37:00-37:38",
    "text" : "The point I'm getting at is, you know, uh relatively heavy. I think it was a first round pick, right, for Marshall. Um, you know, relatively well received, guy's super accurate, he's not known to have a cannon arm, but like You know, he's good, like good. And I I didn't you know, I didn't really have a strong opinion on one way or the other, but I remember arriving there and really, really being impressed with him just as like a person, as a teammate, as like a leader. like a air quote pay trick guy in a minute, right? Like he just really had incredible leadership qualities. He's a really bright guy, really sharp dude. Um he did end up winning that NFL comeback thing of the year twice because his shoulder went to crash."
  },
  {
    "text" : "Yeah, yeah.",
    "timestamp" : "37:38-37:38",
    "speaker" : "Andy"
  },
  {
    "text" : "Not as well, but he just kept having arm issues and you know how Oh, he would have I think he would be remembered and understood and appreciated much differently in the NFL uh over the course of his career if he hadn't had all those. Problems.",
    "timestamp" : "37:39-37:50",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "Yeah, I mean I remember watching one of the games earlier, like before he had those issues where he beat the Patriots, I think in New England, like at the end of the the year, one year. Um he looked like a different quarterback than even in this game that we watched. Like he just didn't have that deep ball anymore.",
    "timestamp" : "37:50-38:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "38:06-38:34",
    "speaker" : "Matt Chatham",
    "text" : "Yeah, Chad I mean Chad could groove it. Like that dude could lead a guy into a route like as as good as anyone I'd see. But you know what I mean? Like he had that anticipation throw and really w reaped the defense well and ri he's not super athletic, he's not gonna run anybody, but pocket movement was solid and Chad was a good player. He was a really good player and Um, you know, I just you know, you you you'd kinda have a view of other guys around the division and league and then you get a play with and go, oh, this guy he he's he's good"
  },
  {
    "timestamp" : "38:35-38:43",
    "text" : "Just that line in this game, yeah. Three hundred yards two for thirty-seven, three hundred and six yards, two touchdowns, and the interception, but that was Like a Hail Mary.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "38:45-38:49",
    "text" : "Bruce. Yeah, and Brugget it, right? Brug at a pick. Yeah, that was awesome.",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "That was actually Teddy's last pick of his career. Oh wow.",
    "timestamp" : "38:49-38:52",
    "speaker" : "Steve"
  },
  {
    "text" : "Wow. Um yeah, no, I mean I again I know that won't be popular, but yeah, I I have a really, really high opinion of chat. Um And we have I don't think we had a running game much then. I think Kevin Barlow was actually our back. Not knocking Kevin, but we just it was kind of a transition year where Leon Washington was was brought in and he's gonna be the the And he was a really good third bound type and kick returner. He was amazing for us and the and the team stuff. Uh but Kevin was actually his n his locker was next to mine Um, I was fifty-eight. I don't I don't know if they mixed this on numbers or whatever, but they put Kevin right next to me. I'm a size thirteen shoe. I think Kevin was a twelve, maybe even eleven and a half or something like that. But Kevin would take my shoes and wear them unbeknownst to me or him and go several practices or even games wearing the wrong size and then know it. I was like, dude, where did my left go out of my blah blah blah shoes? And then come back and look in his locker and you know we were wearing we were both Nike guys, so we had to stand with the shoe I was like dude that's how did you not know It's two sizes different. How did that happen?",
    "speaker" : "Matt Chatham",
    "timestamp" : "38:52-40:02"
  },
  {
    "text" : "That's something Greg Brown would do, but uh he would also like wear somebody else's cleats, but he would probably score two goals doing it because he's just oblivious. I Obnoxious. Yeah, just uh to go back to your point, um Leon Washington did lead this team in rushing with six hundred and fifty yards.",
    "timestamp" : "40:02-40:18",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "40:18-40:33",
    "text" : "Oh yeah. Yeah, I mean Leon, they were a brand new guy from Florida State. They were trying to figure out what to do with him. He was He's he's super high character guy. I didn't leon didn't Leon come in for a year or at least camp or something. Did he do a season with the past? I feel like he did. Leon what didn't Leon?"
  },
  {
    "speaker" : "Andy",
    "text" : "That sounds vaguely familiar actually, now you say that. Yeah.",
    "timestamp" : "40:34-40:37"
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "40:39-40:41",
    "text" : "It could be a camp thing, but I feel like he was here."
  },
  {
    "speaker" : "Andy",
    "text" : "I know I'm a small. Yeah, that sounds familiar. Um, I don't know why. Um Uh yeah, yeah. Uh twenty thirteen. Yeah. Two games. Didn't start one carry, one yard.",
    "timestamp" : "40:41-40:52"
  },
  {
    "timestamp" : "40:54-40:55",
    "speaker" : "Matt Chatham",
    "text" : "He's very much uh"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "40:55-40:57",
    "text" : "I mean he was more of a special teams guy, right?"
  },
  {
    "timestamp" : "40:57-41:05",
    "speaker" : "Matt Chatham",
    "text" : "Yeah, awesome kick returns. Yeah. I don't think as much as a punt guy, but his kick return game was was phenomenal. We I believe he made a pro bowl."
  },
  {
    "text" : "Um he did.",
    "speaker" : "Andy",
    "timestamp" : "41:05-41:06"
  },
  {
    "timestamp" : "41:06-41:32",
    "text" : "We have because we had Justin Miller. Justin Miller was one of our cornerbacks. He was a really good pump returner too. And we had gotten touchdowns with both of those guys in that season. So we our team's group was real strong. I mean that was the other part of the poll for me obviously to go there, Mike. Mike Westhoff, the teams coach, and usually within the Pets, Jets, Bills, those were three of the better teams groups across the league. So going to this next place, I knew they spent in that department and we'd always have good guys as a sector.",
    "speaker" : "Matt Chatham"
  },
  {
    "timestamp" : "41:32-41:34",
    "speaker" : "Steve",
    "text" : "Two Pro Bowls and a first team all pro."
  },
  {
    "timestamp" : "41:34-41:45",
    "text" : "Oh no man. Yeah, sounds right. I mean he he was awesome. You you give him a gash and uh you beat you get your guy beat and get him turned and he'd be right up your back and run it for space. He's great.",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "Yeah, Matt, so if you have like a top three for returners, because who who would you say your top three is?",
    "speaker" : "Tim",
    "timestamp" : "41:45-41:51"
  },
  {
    "text" : "Well Troy's obviously the best of the parts. True is just really uh there's not the for it's not the fact that we're gonna be able to do that. I like this. Yeah. But Troy was Troy was great at giving what was there, right? And nothing misses off a of a blocker and you know I took I took pride in my my punt return stuff as you know, um I was known as one of the best in the league at that thing. It's such a niche. It's niche niche. It's like sub niche. Like pump return holdups and pump return blocking was the probably the best thing I ever did in the NFL. And I was great at that and I enjoyed that part. I took it more seriously than like literally everyone else. But when I would wipe my guy off the map, I wanted the rush to go through that. Right. So like if if if I have eliminated my person and kept him at the line of scrimmage. 45 yards from everyone. I've created a hole there. You need to run through it, that kind of thing, right? And Troy was n and that's hard. I mean, it's it's hell back there when the ball's hung up. eighty yards in the air and you're waiting for it to come down and the guys are upon you and you gotta make one cut and get vertical. Um it's tough. So I know it's I really it's not easy, but you know, I I certainly have played with guys at times who would have a harder time finding the open spaces. And what was great about Troy is he made the Holy Family kind of thing, right? So y you didn't have to worry about a guy Troy wasn't gonna reverse field and run sideways and all that stuff. He was gonna hit it and get it, and that you know Bloodford's really appreciated. That makes sense, yeah. Oh, top three. Uh, you know, I'm I'm gonna get in trouble if I don't mention K Fock. K Fock was obviously great for us with kicks. Uh K Fock was actually probably very similar. Whenever you get running backs that that do the kick returns, you know, they kind of see it differently. It's like once the once they get themselves up to twenty-five or thirty things have collapsed and now you're into a run play essentially. You know, there's there's a new sort of removed and replaced offensive and defensive lines. You kind of see the holes and you get through it like you would. And then now the kicker is your free safety and you know you're playing off of safety leverage with the other guy and safety is you know it's it's it's a little bit similar, right? So the running backs tend to really see that better and they let the blocks kinda happen and develop and they they run off them and K talk is same same idea. And I think maybe that's a Belichick thing, like th he doesn't like the guy that doesn't go where you know, the blocking it and where the holes are. So Kevin was great at that. And I was just lucky. I mean, 'cause I got uh T D uh Tim was our pump returner in in New York and then Justin Miller like I mentioned and He made Pro Bowls, I believe at least one of them is a punch.",
    "speaker" : "Matt Chatham",
    "timestamp" : "41:51-44:14"
  },
  {
    "text" : "I think he made a Pro Bowl in this two thousand six season, yeah. Yeah. He was the only Jets Pro Bowl though this year.",
    "speaker" : "Andy",
    "timestamp" : "44:14-44:18"
  },
  {
    "timestamp" : "44:18-44:38",
    "text" : "Yeah, and I believe we brought one back into Cleveland games later that year. We had a huge game there at the Cleveland or I don't know if we did much offensively, but we definitely scored uh either defensively or there on teams. So yeah, I I was just lucky I played with a lot of really good players. So I I don't think we I was ever really the time where We didn't have like a pretty high end guy both the part and kick return time throughout.",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "Well that's a credit to you because of what you're doing, you know.",
    "timestamp" : "44:38-44:40",
    "speaker" : "Tim"
  },
  {
    "timestamp" : "44:46-44:48",
    "text" : "Exactly, exactly. Well that's what I've been telling.",
    "speaker" : "Andy"
  },
  {
    "text" : "Right. You know, in this day and age there's probably someone on YouTube really getting into that stuff. Dude, I'm right here.",
    "speaker" : "Steve",
    "timestamp" : "44:50-44:57"
  },
  {
    "timestamp" : "44:58-45:07",
    "text" : "The problem is they don't record it, so you could never know, right? So and that that's if you have actual the old all twenty-twos, of course you could see all that stuff and I think they exist.",
    "speaker" : "Matt Chatham"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:07-45:08",
    "text" : "I've been looking at it."
  },
  {
    "text" : "So we we there was a really funny one and I'm outing my friend here, so sorry, Rocky, but uh so Rocky Boyman, stud, real good player, Notre Dame guy. uh you know, was uh was with the Colts and with Tennessee. Um but we had a we had a rep with one another um in I believe it was a Tennessee game when they were playing us with the pass and I I got a good one against him and kind of kept him at the line of scrimmage and wiped him to the sideline. And we were maybe forty or fifty yards from everyone else and he's waving his arms out to the side. If you just see this kind of funny like you know the guy I don't know, like he's waving in an airplane or something trying to get off and and and and and I'll I'll give the good side for Rocky's story of it. Then Rocky uh Rocky got me back years later when I told him I'm gonna make an excuse for myself but when my toes jacked up I can't run anymore and Rocky was fast. He was a big guy. He was a big guy that can run and he he slipped my hold up a little bit the line so that I would just have a run straight with him and he was faster than me at that point. He smoked me down the field. So he got me back. But uh I I I actually got to be teammates there when I was at New York with uh with Brad Castle and Cody Spencer. Those are two linebackers that I Well Jeff's with me but had played with him in Tennessee and they would always climb on him about that play. How much he got he got shit for. But uh Yeah. But I just that's I I'm Clown and I guys a little good but also like really lucky to play with those guys 'cause they were all really, really, really really good.",
    "timestamp" : "45:09-46:28",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "I mean you can y you notice that sometimes though. Ye If the block is that good. I remember Troy Brown's kick return in the Two thousand one AFC championship game. I was about to bring that up. Somebody got blocked it through the back of the end zone on that kick return. I don't remember. I think it was Rodney maybe. No, obviously not Rodney because he was on a kick.",
    "timestamp" : "46:28-46:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "46:45-46:50",
    "text" : "Well me and me and me and the guy had stayed the line scrimmage whole place, so we never left."
  },
  {
    "text" : "Yeah, let the tape speak for itself. Yeah, we'll we'll go back and find that. Don't you worry.",
    "timestamp" : "46:55-46:59",
    "speaker" : "Tim"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, speaking of plugger patriots. games, man, you said you got watch on YouTube. Andy built a whole site to rewatch every game from the Patriots Dynasty.",
    "timestamp" : "47:00-47:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep, they're all on there. Patriots. games.",
    "timestamp" : "47:08-47:10"
  },
  {
    "timestamp" : "47:10-47:38",
    "text" : "I need that. Well, so I just couldn't know that exists because uh we we we have these conversations just you know, all these different tech teams with old old teenages and there's always like the one guy that remembers everything. I don't remember anything. Like I need this I need the refresher because, you know, and always um Brady's this way and some of the other, you know, guys are constantly on TV and they're like They'll be reminiscing about, well, in two thousand thirteen in the fourth week on third down, I'm like, What the hell are you fucking fucking remember any of that?",
    "speaker" : "Matt Chatham"
  },
  {
    "timestamp" : "47:38-47:44",
    "speaker" : "Andy",
    "text" : "I mean, Barry seems like he's he's just watched that tape recently, probably. That's just what he does for fun."
  },
  {
    "text" : "Maybe that's what it is. Yeah, 'cause I I too out of myself and just pretended like I remember all these accounts and I went I went back and I went back and watched it went, Oh yeah, oh yeah, oh yeah, oh yeah.",
    "speaker" : "Matt Chatham",
    "timestamp" : "47:44-47:53"
  },
  {
    "timestamp" : "47:53-48:12",
    "speaker" : "Andy",
    "text" : "Right, exactly. Yeah, it's it's wild what you actually do remember. Because this is, you know, this is our formative years as as um as fans, like growing up like middle school, early high school for me. Um And it's just like the things that you remember or even that like trigger memory too when we're going back and rewatching some of these."
  },
  {
    "timestamp" : "48:12-48:22",
    "speaker" : "Tim",
    "text" : "Yeah, like that country touchdown is like Where you would go like, oh yeah, this is the one thing that stands out from that game. Yeah. And I'm just as pissed off as I was twenty years ago."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I don't remember it, but like how could you forget that was then the same play?",
    "timestamp" : "48:23-48:26"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "I had the same reaction with the LC play. So when when Lambernius uh caught that ball and went went the whole way because Yeah. He was a huge personality, I mean, very uh gregarious guy, fun, uh kind of a shit talker in a good way. uh tough as nails kind of dude. And uh, you know, you're like you said, I'm I'm brand new to the place. This happened to pray, you see all the time. You're trying to figure out who all these people are and You kind of think this guy might be okay, this player might be good by reputation. And you know, we had our our playmakers, you know. Brad Smith was a guy who became a pro bowler later as a special kids guy. He was a rookie in that class Like I say, Chemo was a guy who, you know, was just cool towards the end of his career, but it was just you always thought this guy was just a beast, you know, from what he was like in Pittsburgh and Um Jonathan Vilma, somebody who had a high opinion of obviously is a is a sideline to sideline guy who could play over the place. I didn't know as much about Eric Barton. E B's a teammate then at the time and came to really approach me because he was he was an awful good player. But yeah, that's kind of the cool part about bouncing around a little bit, like you know, some of my old buddies were able to play in one place forever, which is which is super cool too. But um you know, kinda getting to meet other people and get a different perspective of what they're like against and then what they're like as actually your teammate. I I I I appreciate that I got the experience.",
    "timestamp" : "48:26-49:41"
  },
  {
    "timestamp" : "49:41-49:51",
    "speaker" : "Tim",
    "text" : "Yeah. And speaking of Wilbertis, what do you think he was uh probably the best receiver you played with? Because I I don't know, I think he's H his route running is just so good."
  },
  {
    "timestamp" : "49:51-49:52",
    "text" : "He played with Troy Brown.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "49:53-50:55",
    "speaker" : "Matt Chatham",
    "text" : "Jesus Christ. With Lavernis? Laverneys, yeah. I mean I guess you could probably call those guys relatively similar to one another, right? I don't think either of them are burners necessarily. LC was just uh But he was a top dude and yeah. He's kind of a little Steve Smith-ish, you know? Like I think he's got that dog in him Yeah, exactly. Exactly. They're they're they're probably very similar. But I mean remember this is like Justin McCarran's I believe was bought over from Tennessee as a free agent, I think, and McCarran's was kind of this like really athletic, smooth, route running kind of guy and like we were talking about uh uh who were we talking about had the crazy play. Um Jaco yeah Jaco had you know was this just kind of up and coming player and Yeah, it's kind of fun. Chris Baker, who actually came into the past year too, right? Towards the end of his career, he was a Mich Michigan State tight end there and he was a really good blocker, which I know is, you know, not sexy or whatever, but like he was someone that you respect it as a as an opponent and as a teammate his ability to block his tight end. And yeah, it's you know it's kind of fun seeing seeing the other side of guys, I guess."
  },
  {
    "text" : "So in the broadcast the they're talking about um the rookies on the Jess offensive line. And then they name the two names and it's Dubrika Shaw Ferguson and Nick Mangold. But you know like right away that these guys are like, oh shit, they're real good. 'Cause you're practicing against them all the time or did it take the both first rounders too.",
    "timestamp" : "50:56-51:15",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "51:15-51:28",
    "text" : "Yeah, both first rounders that was that was a really good class. I mean, if you look at uh who he got that And with we're getting we're getting uh Leon Washington and getting those two guys and I'm blanking them who the rest of the class was. Justin Miller must have been in it too, right?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:28-51:29",
    "text" : "I think"
  },
  {
    "text" : "Uh he was on here before he was Brad Smith. Brad Smith, yeah, yeah. Really high-end teams guy. Um but anyway, so Yeah, I would say um Nick, yeah, I mean he's just a huge human and y usually like centers centers and the app are usually not the biggest guys, right? So If you look like a d Dermonte Dawson kind of thing back in the day, the pulling center kind of thing with the steelers or sometimes they're the lighter, smaller guy. You think to our crew like you know, like Cope, you know, Dan Copin is like I think Danway Less of Mina. Like in Copas but he's you know, we've got heavy to play center in the FL but like C He's not a natural over 300-pound guy. He was probably playing in the two eighties or nineties or something like that and super athletic and Decent gone stick. Uh but uh yeah, that's more of like your NFL center kind of body, but Nick was more like Woody when Damian Woody was a center, right? Like he's a thick and wide. So it's it's a different kind of center. Um so yeah, I mean you could see he was gonna be an easy pro. And Brick is just different in that like, you know, there's different kinds of I I want to say Anthony Clement was there at the other end, is that right? At red tackle for us. Yeah, so Anthony is like six eight and probably three forty or thirty or something. He's huge, right? Six eight. He's like a really, really big guy. and thick and heavy and all that. Rick was like maybe six six, uh, but like really just kind of a blown up tight end. Like he's not like the heaviest, thickest, like this this is he's not the fat kid through elementary zone. Yeah. Like he's not like he's not like little giants, the chubby kid, like that's always gonna be the woman Like Brick was Brick looked like a tight end, really. He also has and look look this up, you know, if you can just do like, you know, uh AP images or something or some sort of Google image search. He had the longest wrists I've ever seen in my life. And that that sounds like a weird statement. Like I think I think his forearms end and his hand starts like further away than most people for space Like which is makes for like an incredibly strong and long punch, right? When this guy extends out to you and keeps him away from your kidding. Yeah, he's really crazy long for the book.",
    "speaker" : "Matt Chatham",
    "timestamp" : "51:28-53:40"
  },
  {
    "timestamp" : "53:41-53:43",
    "speaker" : "Steve",
    "text" : "Googled the Brigashaw Ferguson wrist, Andy."
  },
  {
    "timestamp" : "53:44-53:44",
    "text" : "I didn't even have to.",
    "speaker" : "Matt Chatham"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:45-53:47",
    "text" : "I just did uh yeah. Alright, I'm doing it now too."
  },
  {
    "text" : "But he's one of those guys that's just different. Like that's a different kind of athlete for he was from uh UVA, I believe. Um but you you know you He g he's obviously a plus plus athlete for that position. But also not the thickest, heaviest human in the world either, right? Like he's not he's not like he's got some giant ass and this is not, you know, trying to think of a um traditional big old left tackle kind of thing. He he's like this amazingly athletic, but I think it looks like Daniel Graham out there in a group. Yeah. Yeah. He's got he's got rare attributes, right? And so that length, you know, the the joke about his forums or whatever, like it was an asset once he figured out how to use it because he could just keep you away from him. Yeah, he had great reach and he talked about you know, like the the length or whatever the guys have, like he was uniquely skilled that way and you know i he had some struggles. I think his first year just kind of figuring out how to use it all Uh but man, once they got him going, he was he was he was real good. Yeah.",
    "timestamp" : "53:49-54:46",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "Yeah, his like arms go down to his knees. Yeah.",
    "timestamp" : "54:46-54:49",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "54:50-55:24",
    "text" : "So you kinda you kinda learn where I know we just got out of all the hay long while arms don't matter at tackle talk. But I'm just saying, well let's put it in this this why, right? Because uh Will Campbell has uh an ass on him and he's thick and he's strong as shit. Um Brick doesn't have that thick lower, you know, he doesn't have the anchor, so you need the length to keep people off you and to and he's super strong. Brick was strong, but I'm just saying he's not like an anchored to the ground, you know Heavy h heavy human. So Will is, so the length becomes less initiative.",
    "speaker" : "Matt Chatham"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "55:24-55:28",
    "text" : "So what you're saying is Will Campbell's gonna be the better left tackle long term over their career."
  },
  {
    "text" : "See you just you're gonna you're not gonna give me the close with a comparison because you're supposed to do that.",
    "speaker" : "Matt Chatham",
    "timestamp" : "55:28-55:33"
  },
  {
    "timestamp" : "55:39-56:04",
    "speaker" : "Andy",
    "text" : "We have had uh a hypothetical conversation um that had some disagreements. Um I think it was if we had uh I think it was five tries to uh tackle Corey Dillon once for a million dollars, could we do it? Um And I imagine you ha are someone who has seen Corey Dillon in in uh practice um back in the OCD."
  },
  {
    "timestamp" : "56:05-56:08",
    "speaker" : "Matt Chatham",
    "text" : "And you've got to pr tackle him and throw up it years."
  },
  {
    "text" : "Do you think a normal person could tackle Corey Dylan?",
    "timestamp" : "56:08-56:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:10-56:41",
    "text" : "Yeah, anyone can tackle anyone, um, in the given the right circumstance. I actually believe that because they're the really tight spaces and sort of goal line and short yardage, and if he has to plug it up in there and you guys just go over his ankles, you can trip him probably So open open field. So here's the thought. So like if you're in really extreme close spaces and he just has to shoot the hole and he's gonna be hitting and falling down anyway. Um, I think you could take I could throw you into the hole and help you tackle him, let's put it that way. We we could we could cut block Corey.",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "Literally throw you under the bus. Got it.",
    "speaker" : "Andy",
    "timestamp" : "56:42-56:43"
  },
  {
    "timestamp" : "56:43-56:45",
    "text" : "Exactly, exactly. We could cut block.",
    "speaker" : "Matt Chatham"
  },
  {
    "timestamp" : "56:45-56:57",
    "speaker" : "Andy",
    "text" : "I think that was that was gonna be my technique was just to kind of Throw my body at him and hope he goes down the first try because I'm not gonna have another four. But I think we said Oklahoma drill, Andy. I think it was Oklahoma drill, yeah."
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Well so remember here, I'm I'm being very specific. So I'm not giving I'm not giving him any wiggle room left or right. So that the hole is so tight that he apt he has to run through it and you have to run through it. And I'm not letting you hit him above his knees because he killed you But I'm just saying if you get five chances and he there's really nowhere he can go, I think if we make a pile with you, it's it's you know he's he's",
    "timestamp" : "56:57-57:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:19-57:21",
    "text" : "And he has to jump over and you manage to catch his foot or something."
  },
  {
    "text" : "Um, I think the ones would give you more well, Corey is you know, he's thick and he's heavy and he hits really hard too. He has that thing where he he turns his shoulder. Have you seen that? Where he kinda like on contact, he almost gives you his back, which is weird. Yeah.",
    "speaker" : "Matt Chatham",
    "timestamp" : "57:27-57:38"
  },
  {
    "text" : "Yeah, he looks like a bit of a brick wall.",
    "timestamp" : "57:42-57:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "57:44-58:14",
    "speaker" : "Matt Chatham",
    "text" : "Yeah. J now Jamal Lewis was really, really heavy. Brand Brand Brandon Jacobs was super heavy and tall. Um but listen, I again I I I want to game this to make you make the tackle and that means I'm gonna make this space so tight and he has to run it and you have to run it and I'm not gonna let you be up high. I think you'll be okay. You you can even just sit on your hands and knees. Right? Sideways and we could build the hole small enough to where he'd have to run into you and might break your ribs, but we we can get him."
  },
  {
    "text" : "I don't think there's a mite about that.",
    "speaker" : "Andy",
    "timestamp" : "58:15-58:17"
  },
  {
    "text" : "Yeah, I mean but we can get him to go down uh any back if we if we game the the the the drill just well enough.",
    "timestamp" : "58:19-58:25",
    "speaker" : "Matt Chatham"
  },
  {
    "speaker" : "Andy",
    "text" : "So who's the hardest person to tackle that you encountered?",
    "timestamp" : "58:26-58:29"
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "58:29-59:29",
    "text" : "Uh see. Um so most of the difficult to tackle conversations are in space. It's not really on, you know, as a running back. Running backs you know, it's you know in the half field and you're you know, it's not as not as open not as the open pastures. Uh like like catching Dante Hall out in the open or catching Steve Smith out in the open when he was a punt returner. Or catching um Charles Woodson as a palm returner was always really tough. Um those are so much more difficult than run game tackles. That makes sense, yeah. Eddie George or any of those guys Um, so it's not easy. It's it's still difficult because they're big and physical and stuff, but I'd rather do the big and physical thing than the can I even touch you kind of thing. And there's a lot of those, like Antoine Randall L was another really hard one back in the day. Basically just like the the um scatter bug or whatever the word I don't know. Scat scat bug. Yeah. The guys are tough to touch, you know, that kind of thing. So the the elusiveness in open spaces. is Hell versus just the the guy."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:29-59:34",
    "text" : "Yeah, who's who is the the human joystick uh that Greg calls? Dante Hill."
  },
  {
    "timestamp" : "59:35-59:37",
    "text" : "Yeah, yeah. I mentioned him he's he's ridiculous. Yeah.",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "So w would you say would you have like a a top three of like who you feared when it came to uh like returns?",
    "speaker" : "Tim",
    "timestamp" : "59:37-59:45"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Well so we had one that that has always bothered us for years. Um and did bothered us at the time too. This is the Patriot season. Um I think it was the the year we ended with Carolina uh in the regular season. So we it wasn't the year we played them in the playoffs.",
    "timestamp" : "59:45-01:00:00"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "01:00:01-01:00:03",
    "text" : "That was uh I think that was the one. Yeah."
  },
  {
    "timestamp" : "01:00:03-01:00:07",
    "text" : "Is that is that what it is? Okay. Yeah. Is Steve Smith on that team though? Was that red?",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "I think it was his rookie year. Yeah, I think it was in rookie. Yeah, he cause he was just doing um special teams. Yeah.",
    "timestamp" : "01:00:07-01:00:13",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:00:13-01:00:23",
    "text" : "Right. So we have this thing, obviously with, you know, is and I Larry and I and and Don Davis. Is I know Don wasn't on that first one, though. That would have been",
    "speaker" : "Matt Chatham"
  },
  {
    "timestamp" : "01:00:22-01:00:25",
    "speaker" : "Tim",
    "text" : "Yeah, I think Davis came over in 03."
  },
  {
    "text" : "Yeah, yeah. So this is more like Pfeiffer and and Burski and Rapes and Patrick Pass and uh Yeah, one oh one teams drawn cherry obviously and all those guys. Like we take such pride in that. We're the one of the best crews in the league and that we kick everyone. We don't kick touchbacks, we don't kick out of bounds, we want to cover the thing. And uh we gave up, if not one, maybe even two in that game, relatively long returns to Steve Smith. Yeah, yeah, I vaguely remember that now. And and Bill made us kick it out of bounds and we were fucking mad. But Yeah, he made Ken Kenny Walters made Kenny kick it out and we were we were we were you know we can't yell at dill hon see so we could yell at Brad to yell at Bill for us maybe and I'll oh he could play to do that. He could look at us and go, What do you want me to do? You guys didn't cover it. But that's like insulting, like we're the ones that like, you know, own we we kick the we cover everyone kinda thing. But uh he got us. So yeah, Steve was probably the one that had the most success with us in Lanny Pete in one game, but I don't think we ever really had serious problems with anyone, and that was kind of part of the pride. Um",
    "speaker" : "Matt Chatham",
    "timestamp" : "01:00:25-01:01:31"
  },
  {
    "text" : "Awesome.",
    "timestamp" : "01:01:32-01:01:32",
    "speaker" : "Tim"
  },
  {
    "timestamp" : "01:01:33-01:03:39",
    "speaker" : "Matt Chatham",
    "text" : "Oh, you know, Josh Cribs. I should have mentioned Josh. So Josh Josh was crazy in that he's the only one who would listen or you'd list in sort of this continuum or whatever of guys that was as good as the coverage guys he was the return. That never happens, right? It's not you know you couldn't see Troy Brown as good as he was if not returns out being as effective as a kick cover guy. Yeah, that's that's unusual. But Cribbs was, you know, similar to a Slater type as a coverage guy, and then also was a killer kick return pump return. So you know, so he he got out of the hard part. You know, he got the cover and then he didn't have to block for anyone. He got to actually catch the ball. I did in high school. I did in high school. That was one of my my my Iowa famous anyway plays. I had uh I we we had this uh this is so off the rails to guys how we roll. That's fine, yeah. This is against South Sioux City, which is actually in Nebraska and I'm from Sioux City on the other side of the river or Sioux City North. And uh I was the power returner, uh this big six foot four plus uh hundred and ninety pound free safety. So I actually I came, I said my first year at USD as a free safety. So my body type was way different. I didn't on the white and cup. Uh but anyway I used to I used to be the power turner in high school too, uh in kicks also I think. Um but they ran a punt page And so I'm back there, you know, it's high school, so you know maybe maybe you're only 40 yards back, right? Um, but they ran a punt paper. I'm back as the punt returner, and you know snaps to the punter and then what would have been the inline edge of the guy that's kind of like the tight end just runs a straight seat so you know they punt fake as it's a punt and then they throw sort of a down the field seam pass Well the punter the punter hung it up. So I got a twenty five yard run of this guy on a on a you know, on a hospital ball that they gave a guy and I I almost broke him in half and uh ambulance on the field, you know, take him away. That whole thing. Oh like you legit broke him in half. Oh yeah yeah. It was an outrageous hit. I mean it'd be you know this is pretty you know social media and TikToks and stuff."
  },
  {
    "text" : "Yeah, Matt Chatham attempted murder on the field. Exactly.",
    "speaker" : "Tim",
    "timestamp" : "01:03:40-01:03:44"
  },
  {
    "timestamp" : "01:03:44-01:04:30",
    "text" : "Well and the and the crazy thing is years l years later Uh I got a random phone call. So two things happened. So that's football season, right? And then by the time the guy had healed up some and we had played on the road at that place for basketball. And I was a decent basketball player and we're playing at that place. And there'd been a bunch of him and his teammates waiting out in the parking lot afterwards to try to get at me and I don't I don't think much came of it. security law stuff, whatever it was, or police officers. That much couldn't happen in that in that moment. But you know, he did kind of thing, right? And then years later, years later, I get this weird call from someone in like an un you know an unknown number or whatever saying I still haven't forgot what they",
    "speaker" : "Matt Chatham"
  },
  {
    "speaker" : "Andy",
    "text" : "That's your last summer.",
    "timestamp" : "01:04:44-01:04:47"
  },
  {
    "timestamp" : "01:04:48-01:04:48",
    "text" : "Exactly.",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "But here's the thing. Like if somebody did something to me in high school Um, and they turn out to be an NFL linebacker. I'm not threatening them. I'm just saying right now.",
    "speaker" : "Andy",
    "timestamp" : "01:04:49-01:04:58"
  },
  {
    "text" : "He was emboldened. So I mean I had found out from friends later that that was him. Um okay. Friends of friends friends of friends that knew people over across the river.",
    "speaker" : "Matt Chatham",
    "timestamp" : "01:04:58-01:05:08"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "01:05:09-01:05:15",
    "text" : "Yeah. So were you Were you in the NFL at the time that he called? Like how many years after that? I actually don't remember that."
  },
  {
    "text" : "I I can't lie on that one. I'm not sure. Okay. That's hilarious wild. Make the story better because I'm old, right? So I'm in I'm at USD ninety five ninety-five through ninety-eight. So I don't think I had a cell phone yet, so the call would have had to have been to like a landline, which would have made it even better actually.",
    "timestamp" : "01:05:15-01:05:35",
    "speaker" : "Matt Chatham"
  },
  {
    "text" : "That's sketchy as shit, yeah. He went through the phone before. Hey Matt, just so you know, you're still on my list. And then he hung up and put his lipstick on after. No, I didn't you didn't he didn't get me knocked off or marked off of us for shunno that whole time that you were telling that story I just thought of uh I don't know if you've ever seen not another teen movie. Where they the poor innocent kid just gets ripped in half. That's that was the first image that came to my mind. Yeah.",
    "timestamp" : "01:05:35-01:06:09",
    "speaker" : "Tim"
  },
  {
    "timestamp" : "01:06:09-01:06:51",
    "speaker" : "Matt Chatham",
    "text" : "I mean this is definitely one of those like It was put on a T for me and the poor kid was just laid out. Shh and uh my buddy John, John Cannon was our middle inductor middle high school team. He stood over the guy, like sort of pumping his arms up. Probably would be looked at as poor sportsmanship now, but uh y you know, now we're supposed to be concerned about the well-being of the other guy and all that, but at the time it was more of a dance and we're happy and we're celebrating us and you know somebody's parents were holding the camcorder and they're all screaming so they're you know It's on tape somewhere. Oh and and best the best twist on all this by the way, Coach Belichick showed that clip in Team Meetings one day."
  },
  {
    "speaker" : "Andy",
    "text" : "He found it?",
    "timestamp" : "01:06:51-01:06:52"
  },
  {
    "speaker" : "Matt Chatham",
    "timestamp" : "01:06:52-01:08:00",
    "text" : "Oh yeah, absolutely. Yeah, so this is awesome. This is an old thing. Like I I I many people have told this story other than me. Um but Bill was notorious at finding guys' high school clips That's and uh there was one where Wiggy, Jermaine Wiggins, uh did like a Statue of Liberty play as a quarterback kind of thing. Like he took the snap from center and He spots him wherever he was, and Winky was like bigger than all the old linemen he was taking from center. It's a really funny looking clip. Um Bill was notorious for you know, keep it light on that Saturday night, I think, or Saturday morning the game the day before the game, where he would go back to people's high schools or something and dig up a clip. I don't know that St. Bill himself didn't necessarily but having his staff go on top something. And I remember, you know, it wasn't my first year in New England, it was maybe that fourth, fifth, or sixth year a little later time. But we we sat down in on a Saturday morning and for that usually especially meeting start stuff and before the TV meeting starts and Bill pops a clip up there and Sioux City North and South Sioux City Nebraska are up on the screen in Foxboro and you're just like holy shit world colliding But the room went wild. I mean it was a it was a it was a funny clip."
  },
  {
    "speaker" : "Andy",
    "text" : "So don't let that guy find out. He's gonna start hunting down bell check now.",
    "timestamp" : "01:08:00-01:08:04"
  },
  {
    "text" : "We're improving his part of the story. He should just be happy to be a part of it.",
    "speaker" : "Matt Chatham",
    "timestamp" : "01:08:06-01:08:09"
  },
  {
    "speaker" : "Steve",
    "text" : "He's probably not listening to this podcast anyway, so no.",
    "timestamp" : "01:08:10-01:08:12"
  },
  {
    "text" : "If he is, he's going through sort of a bulk pack of that that list.",
    "speaker" : "Matt Chatham",
    "timestamp" : "01:08:16-01:08:19"
  },
  {
    "timestamp" : "01:08:22-01:08:31",
    "speaker" : "Tim",
    "text" : "Uh yeah, it's actually funny because uh you in this uh season you have uh two punt returns, I'm pretty sure when I was looking. So you kinda brought brought that back up."
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Pons or kicks. Oh no, probably kicks because you don't know. Really the next, I don't know, I don't think we did it every year I was there. But Coach Westhoff was big on um he wanted an agile web. Right. So uh which is it sounds good in theory, but like, you know, I I he's like, Yeah, I'm the captain, he's like you're gonna be the middle of the wedge and you know, that way you can set it in front of the returner, which is always an issue, the wedge having the right distance from the returner. it it it can screw up the timing and spacing and stuff like that and always had the usually had a real big effect on how how how well they went. Um but oh you're gonna be the one to set it and will be faster to box because you move better than not off and supply them blah blah blah. I'm like, yes, but I'm fifty, sixty, seventy pounders lighter than them, I'm gonna get killed. And I the only thing I kept thinking and it always stuck in my head is like, you know, I d I do this in practice and man, you're just like shortening your neck every day. You do this stuff and every week. And it's like oh this about a good you know five to eight to maybe nine times a game there's gonna be that just outrageous ENT explosion in my head and shoulders and we're gonna get through it and let's just get through this, yeah But you the way you kept thinking I kept thinking of it anyway was wonder what I what I look like to me. Like if I was covering the kick and I saw a two hundred fifty pound guy in the middle of the web Yeah. I I kill 'em, I kill me. So like they have to look at me the same way. This is this is ridiculous. Like how am I able to do that to The heavy guys are 300 pounders because you just get so much of a run at them. But man, and I'd be like, Mike, they're guy this is getting old, man. This is getting old really fast. And then and then they literally get rid of it like a year or two or three or whatever water. They drop they drop wedges altogether. I'm like, oh great, great, great.",
    "timestamp" : "01:08:31-01:10:21"
  },
  {
    "speaker" : "Andy",
    "text" : "That's always how it happens. Cool. All right, you boys have any uh any more questions for Matt or anything else burning?",
    "timestamp" : "01:10:23-01:10:30"
  },
  {
    "text" : "Well I was gonna ask uh who is your favorite teammate and why is it Troy Brown, but I think you already covered that.",
    "speaker" : "Steve",
    "timestamp" : "01:10:31-01:10:35"
  },
  {
    "timestamp" : "01:10:35-01:10:37",
    "speaker" : "Andy",
    "text" : "Yeah, I think we asked him that last time."
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Yeah yeah, favorite team it can't do that. So um there's a lot of good ones. I I'll say I I say this every time some version of that question comes up. I think my my Now old guy, kind of reflective of career sort of frame of mind. My usual answer to that is just like You know, I'm a a a kid that was seventeen when I graduated high school, desperately wanted to go to the University of Iowa. wasn't uh took an official there, took an unofficial there and was still not offered. You Broke my heart. So I ended up going to the to the slightly smaller school at the University of South Dakota. Don't get the big ten, you know, scholarship thing. So I always kinda had a chip on my shoulders, it was like really the long way in to get in the NFL. And the thing that I always kinda cling to how freaking lucky I was, just look at who I played with. Yeah as a linebacker. Like the rooms I was in are just like amazing. Like Brian Cox was kind of with the tail end of his career, but Fife had played like 1450. He's a crazy number and was just a really well-respected guy around the league. Bruski is like all time knowledge stack leader guy, and I knew all about him from you know through his days in Arizona the desert swarm stuff and Braves, uh I think it was old ninety four at Ohio State and you know, all Big Ten guys, so I'm obviously a Big Ten fan and knew very much about him and his career. And uh Willie McKinnon, you know, one of the he's basically like the Javon Kurse or, you know, name a guy, uh, you know, that's the freakish athlete of that particular class, you know, kind of a once in a generation kind of body type. Uh and then Ted Johnson is just this massive hammerhead guy. It's as hard as anyone in the whole kind of thing. And I mean just and then even Don Davis, Don's like a four guys don't know this, but Don Davis is Like was a legit sub four five uh linebacker.",
    "timestamp" : "01:10:39-01:12:28"
  },
  {
    "text" : "Don could play Don could absolutely well didn't they have him play safety um in that 2005 season when um Rodney Harrison went down.",
    "timestamp" : "01:12:28-01:12:38",
    "speaker" : "Andy"
  },
  {
    "text" : "Yep, yeah. So Don Don could could fly. Well he was a he was a Tampa linebacker. Tampa he came north from the Fox and Tam Tampa always has those smaller, quicker guys. I'm not Don but small. He's a buff guy. And then obviously Is is Iz is just like a was a legend in sort of Teams World and get him from Miami and you know get to teammates with him and become great friends and all that stuff. Like just like in in retrospect just like dude you don't realize the room I was in and you later quekos in there and and uh you know Tully later and you know just I don't know super lucky like the the room that I got to play in over all those years was just was just real really fortunate. So I I feel like I kinda hit the lottery.",
    "speaker" : "Matt Chatham",
    "timestamp" : "01:12:38-01:13:17"
  },
  {
    "text" : "Yeah, no kidding. Yeah, if I had one uh question, it would just be like uh Out of any of your teammates, like uh at least in the NFL, like does that linebacker group do you guys still kind of communicate or any special teams guys, you guys still stay in contact?",
    "timestamp" : "01:13:18-01:13:35",
    "speaker" : "Tim"
  },
  {
    "timestamp" : "01:13:35-01:13:42",
    "speaker" : "Matt Chatham",
    "text" : "Yeah, all the guys individually and then some are some uh text groups, but I'm probably not gonna I probably shouldn't say who's on."
  },
  {
    "text" : "So yeah, but yeah I get it.",
    "speaker" : "Andy",
    "timestamp" : "01:13:42-01:13:44"
  },
  {
    "text" : "I will s I will say this though, and this is uh I think a lot of the guys would echo this. Especially the ones that stayed around here.",
    "timestamp" : "01:13:44-01:13:51",
    "speaker" : "Matt Chatham"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "01:13:51-01:14:06",
    "text" : "Uh, which you know, it's like Ross Hochstein and Patrick Pass and Joe Andruzi and Yeah, they uh Linkins and Hawk Hockstein are coaches on my rival high school team. So kind of a touchy subject."
  },
  {
    "text" : "So so they're uh you know Mankin's boy now at Feehan is going to Ole Mass and his other son is at URI. They're defensive ends, which is kind of wild. Oh he didn't have well I guess I don't know Cain. I think Kane is his the name of his son uh now that's head uh to Ole Miss. But uh he plays both ways, but so I maybe shouldn't say that I'm assuming he's a defensive player, but I don't think oddly enough, and this kind of happens that, you know, they don't he doesn't have like a facsimile of himself, right? There's not like Logan another giant farmhand looking guy that's a just beast at the O line. He just he you know And McCara had different body type kids that are really good athletes and play different positions. So my son is, you know, we're going through the recruiting process right now trying to see where he's gonna go, he's a senior at KP and he's gonna be a you know, when it's all sudden done probably a six, four or three hundred plus lineman kid. Which is wild which is wild, you know.",
    "speaker" : "Matt Chatham",
    "timestamp" : "01:14:07-01:15:04"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:15:04-01:15:06",
    "text" : "Um is not my body type."
  },
  {
    "timestamp" : "01:15:06-01:15:55",
    "speaker" : "Matt Chatham",
    "text" : "He he got there by gaining something like sixteen plus pounds between December in July of his senior season. So he wasn't on anyone's map and all of a sudden he is. So I I I see that and that that's that's kind of why we cross paths, right? So Logan and I coached against each other all through youth football. So he was he was coaching on North Outerboro and his son and our son and my son would go against each other quite a bit. as in alignment guys uh both ways. So um yeah Logan and now Russ with his son who's I believe uh junior now uh maybe even a sophomore um But up and coming. So it's kinda cool that we're all around and kinda, you know, coaching our kids and having having fun with it. But uh yeah, that's there are a lot though. I think that list is probably ten or less of guys from that era that are still living in the area"
  },
  {
    "speaker" : "Steve",
    "text" : "So are you saying that you named your beefcake seasoning after your son?",
    "timestamp" : "01:15:55-01:15:59"
  },
  {
    "timestamp" : "01:16:00-01:17:39",
    "speaker" : "Matt Chatham",
    "text" : "No. You know, I'm I'm trying to think of where We have these arguments all the time, my wife and I, about uh you know, life of br life of Brian, uh, you know, our smoke salt uh line. Life of Brian is always obviously from the uh the life of Brian sort of an allusion to that. You guys are too young for that, but you know that's the thing. No, we're not. Okay, mind it. Okay, okay, there you go. Okay, so some some some Some get it, some don't. But I have that registered as a trademark. That thing's gonna kill for us. And w we're actually just put that Life of Brian just went on uh Prime uh for Amazon in the last couple of weeks. So we'll start pushing a lot of that and we're gonna start coming out with some other flavors as well. But uh I love that stuff. But no, we we my wife and I have these arguments all the time because I'm kind of a dork about uh puns, obviously. So, you know, with the with the the life of Brian thing and then we went with with Goldbark had a different name initially. I think Goldbark we nailed it. I'm glad we ended up settling there. But for a while it was my old formula and I used to call it Lina. Which I'm glad I didn't in the end. Uh 'cause it was just sort of like it's kinda like Carolina but not really, so we'll only take half of me. It was kind of stupid. But so I'm gl I'm glad that it's I did the identical formula that I had for years. So Gold bark, I'm glad that stuck. Um but uh deep cake, man, what I I don't remember who would take credit for that because my wife will again, she'll say, No, no, no, I Yeah. I added blankety blank, you know, all our ingredients are pretty pretty secretive and you know we're in sort of the Worcestershire kind of thing where it's like it's very deep and very complex and all that's in there we don't want to give up. But We'll have these arguments about hey who named this or that or hey who put such and such ingredient in or what ratio and we'll probably be having these arguments the rest of our life."
  },
  {
    "timestamp" : "01:17:39-01:17:45",
    "speaker" : "Andy",
    "text" : "And I'll die. My wife does not take credit for any of my good ideas, that's for sure."
  },
  {
    "text" : "We're not on video here, so I'll uh I'll turn I used to own a crepe restaurant. I I did this when I went to Bathson and I I was gonna start trying to start this faster crepe franchise. I had a patent for crepe fries. Any battery particular cooked cut and secondarily cooked. It's a mouthful. But I had I mean I went wild with the stupid puns. We had uh Southern PCP well this is the punt but Southern PCP Uh which each term all the time, but you know, it's sort of uh I had uh one called Lando Calryzian. I land to the I Lando Calryzian. It was like uh uh pineapple macadamia white chocolate thing was meant to be kind of the islandy version but uh we had a we had a timeshare of Maui and uh there was a place down as a version of that that we loved. But Uh George the Animal Peel. That was a Nutella caramel banana version. But no, I I this is like if I could have one job in life, it would just be naming dumb shit and come up with That's why I wouldn't you know start your own little production company. So I I am tech change going with buddies from Babson and from all walks of life where Okay, we're working on a breakfast sausage. We need a we need a name, guys. We need a name. Oh. This and it, this, and this, and it. And so these have been going on forever. Come on guys, hit me with something. I got a meeting next week. We need a we need a name for blanking blank. This is this is basically my day to day.",
    "timestamp" : "01:17:52-01:19:17",
    "speaker" : "Matt Chatham"
  },
  {
    "timestamp" : "01:19:17-01:19:20",
    "text" : "So getting them into Shaw's that's a big step for you guys.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Matt Chatham",
    "text" : "Yeah, Shaw's and and Big Y have been flowing really well here and uh we've got a lot of stuff. This is what sucks. I actually knew about the Shaw's thing a year ago. That deal was done in June of twenty twenty four and shelved in September of twenty five. So that's how this goes. So I have two other things I can announce you today, which I can't do because it won't happen for a year from now. So that's kind of how this industry goes, I'm finding. So We're having we're having fun but it's growing enough to the point where I don't have much of a social life other than the occasionally podcast.",
    "timestamp" : "01:19:20-01:19:54"
  },
  {
    "text" : "Well thanks for carving out the time to come chat again with us. Yeah, reminisce about some old football games",
    "speaker" : "Steve",
    "timestamp" : "01:19:59-01:20:06"
  },
  {
    "timestamp" : "01:20:05-01:20:11",
    "speaker" : "Matt Chatham",
    "text" : "Yeah, you guys put it on me with one that I had no recollection of, so it's kinda fun for me to go back in there and pull it pull it out of the bowl."
  },
  {
    "text" : "Yeah, glad we could uh jog your memory. Cool.",
    "timestamp" : "01:20:12-01:20:16",
    "speaker" : "Andy"
  },
  {
    "text" : "Alright, well thanks for having me on, guys. I think I got a bail.",
    "speaker" : "Matt Chatham",
    "timestamp" : "01:20:16-01:20:19"
  },
  {
    "text" : "All right. All right. You have a good one, Matt.",
    "timestamp" : "01:20:19-01:20:21",
    "speaker" : "Andy"
  },
  {
    "text" : "Thank you. All right. Take care, buddy.",
    "speaker" : "Matt Chatham",
    "timestamp" : "01:20:21-01:20:22"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:20:23-01:20:37",
    "text" : "All right, boys. Uh a unique perspective, I guess we could say. Yes. Uh kind of almost unremarkable game otherwise, really. Uh one that again, like none of us remembered and even Matt didn't remember until he watched the highlights."
  },
  {
    "timestamp" : "01:20:37-01:20:47",
    "text" : "I did have a note in here. This game is boring. There's no explosive plays. And then like right after it was that weird Jericho Country bent over in half and then bouncing back up and running for a touchdown. But",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:20:47-01:20:52",
    "text" : "Yeah. Yeah. Um what was the final score, Steve? Because we never say that."
  },
  {
    "text" : "I don't remember 24-17.",
    "timestamp" : "01:20:52-01:20:54",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh 24-17 Patriots.",
    "timestamp" : "01:20:55-01:20:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:20:57-01:21:04",
    "text" : "It should have been 27 17 and they had that field goal blocked within two minutes on the 20-yard line."
  },
  {
    "timestamp" : "01:21:04-01:21:19",
    "text" : "Yeah, real tight at the end there. Yeah But tighter than it need to be. But you know, it was a a good kind of opening salvo of the Belichick Mangini rivalry that we will continue to watch evolve on the podcast.",
    "speaker" : "Andy"
  },
  {
    "text" : "What's next week, Steve? I don't know why you keep asking me this. I never know.",
    "speaker" : "Steve",
    "timestamp" : "01:21:19-01:21:23"
  },
  {
    "timestamp" : "01:21:24-01:21:40",
    "speaker" : "Andy",
    "text" : "That's that's the joke. Uh the Denver Broncos. Um Mike Shanahan coming to town to New England and bringing his two-on-one Broncos team. So we'll see what happens. Next week on the Patriots Dynasty Podcast. Say Alana."
  },
  {
    "text" : "Hey, Anna. Turn in next week to see how much of a blubbering little bitch Greg is. On the Patriots Dynasty Podcast.",
    "timestamp" : "01:21:41-01:21:50",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:21:50-01:21:52",
    "text" : "Are we gonna have to change that since Greg never shows up?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:21:52-01:21:56",
    "text" : "Yeah, but no, it's the best part is that like he's still there every week, even though he's not.",
    "speaker" : "Andy"
  },
  {
    "text" : "That's true. Yeah.",
    "timestamp" : "01:21:56-01:22:00",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:22:00-01:22:02",
    "speaker" : "Andy",
    "text" : "It's so bad. Still fits."
  }
]