[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17"
  },
  {
    "timestamp" : "00:21-01:02",
    "text" : "Welcome back to the Patriots Dynasty Podcast. I'm your host, Andy Brown. Uh and normally here we do uh reviews of old Patriots games right now over in the middle of the 2004 season, but Uh middle brother Steve Brown is here with me and the second 2021 Pre-season game is on as we're watch, as we're recording this. So he thought it'd be a good idea to do more of a forward-looking podcast. Uh and Greg will join us at some point soon. Uh before he does, Steve, how are you?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:03-01:06",
    "text" : "I'm good. I'm watching Joe Flacco out there on the Eagles.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:06-01:07",
    "speaker" : "Andy",
    "text" : "Oh shit, is that who that is?"
  },
  {
    "timestamp" : "01:07-01:08",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:08-01:34",
    "text" : "Oh boy. Right. Wait, why is he okay. Cool. There were rumors at one point, I think. Um But similar to Pizzagate, I think that has been disproven at this point. Oh, I rest my case as literally the snap goes through his hands, over his head. Uh and then he tries to pick it up and then fumbles it again and the pages recover. That's enough.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:37-01:43",
    "speaker" : "Steve",
    "text" : "Uh Yeah. You're ahead of me too, because I haven't even seen this play. You're well ahead of me."
  },
  {
    "timestamp" : "01:43-01:44",
    "speaker" : "Andy",
    "text" : "Oh, okay."
  },
  {
    "timestamp" : "01:46-01:48",
    "speaker" : "Steve",
    "text" : "I'm getting it illegally though."
  },
  {
    "text" : "Well, all right, so we'll definitely uh I'm excited to watch this play though.",
    "speaker" : "Andy",
    "timestamp" : "01:48-01:52"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh I need memory down. Wait for the uh that was that was a catchable snap too, is right.",
    "timestamp" : "01:52-01:58"
  },
  {
    "text" : "That's why I'm saying you're trying you were You were all about uh defending Joe Flacco on that one.",
    "speaker" : "Andy",
    "timestamp" : "01:59-02:05"
  },
  {
    "speaker" : "Steve",
    "text" : "He turns the throw and he catches it on the bounce kind of turns the throw and chewed on.",
    "timestamp" : "02:06-02:09"
  },
  {
    "text" : "That was very uh Peyton Manning first snap of the Super Bowl after.",
    "timestamp" : "02:09-02:13",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "02:16-02:17",
    "speaker" : "Steve",
    "text" : "That's catchable."
  },
  {
    "timestamp" : "02:17-02:19",
    "speaker" : "Andy",
    "text" : "Yeah, it's not the center's fall out there. It was a bullet."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:19-02:21",
    "text" : "Don't get me wrong, but oh yeah."
  },
  {
    "timestamp" : "02:21-02:29",
    "speaker" : "Andy",
    "text" : "It was it was a hot one coming in there, but like get your hands on it. And then when you pick it up, hold on to it. You had two chances."
  },
  {
    "timestamp" : "02:29-02:32",
    "speaker" : "Steve",
    "text" : "Judan rushed him on that hit."
  },
  {
    "text" : "Yeah. So uh all right, so where should we start? So you want to start with this defense? Yeah. That was on the field for two plays.",
    "speaker" : "Andy",
    "timestamp" : "02:32-02:41"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:41-02:48",
    "text" : "Although we'll see who starts the Patriots actually. Let's start on the offense since they're about to take the field. Inside the red zone, inside the town line."
  },
  {
    "timestamp" : "02:48-02:52",
    "text" : "Maybe I should pause this and you let me know when that first snap happens.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh it's right. Now, Cam takes a snap, hand off to Damon Harris.",
    "timestamp" : "02:53-02:57"
  },
  {
    "text" : "Okay. Oh boy. Yeah, I think I'm well ahead of you. All right. I think I should be about the same now. So good. This offense, they have trotted out Cam Newton, who I think is a presumed starter on this team.",
    "speaker" : "Andy",
    "timestamp" : "02:58-03:13"
  },
  {
    "speaker" : "Steve",
    "text" : "How do you feel about it?",
    "timestamp" : "03:13-03:14"
  },
  {
    "text" : "I think Cam Newton's gonna start. Week one.",
    "timestamp" : "03:15-03:18",
    "speaker" : "Andy"
  },
  {
    "text" : "Mac Jones is plus 250 to start right now.",
    "timestamp" : "03:18-03:20",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:20-03:24",
    "speaker" : "Andy",
    "text" : "You you want a hot take? Mac Jones doesn't start this season. How's that for a hot take?"
  },
  {
    "text" : "Yeah, those are the hot takes I'm looking for.",
    "speaker" : "Steve",
    "timestamp" : "03:24-03:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. And you want to know why? Because uh look at the top three quarterbacks in the league right now. Name them for me.",
    "timestamp" : "03:26-03:32"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh Pat Mahomes.",
    "timestamp" : "03:32-03:34"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep.",
    "timestamp" : "03:34-03:34"
  },
  {
    "text" : "Tom Brady.",
    "speaker" : "Steve",
    "timestamp" : "03:35-03:36"
  },
  {
    "text" : "Yep.",
    "speaker" : "Andy",
    "timestamp" : "03:36-03:36"
  },
  {
    "text" : "And Tom Brady.",
    "speaker" : "Steve",
    "timestamp" : "03:36-03:38"
  },
  {
    "text" : "Okay, and give me a third name",
    "timestamp" : "03:38-03:40",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "than Tom Brady. I'm just gonna keep saying that.",
    "timestamp" : "03:40-03:42"
  },
  {
    "text" : "They're a different name. Probably Aaron Rodgers, right? Those are the three consensus, like top three. Some people might have them in different orders, but that's your top three guys. How many games combined did those three start in their rookie season?",
    "speaker" : "Andy",
    "timestamp" : "03:43-03:57"
  },
  {
    "timestamp" : "03:58-04:01",
    "text" : "Yeah, they're all played a long time ago, except for Pat Mahomes. Right.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "04:01-04:02",
    "text" : "He started one game.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "04:03-04:11",
    "text" : "We were definitely not the quarterback for the first year. That's th that's pretty gone. Pat Mahomes was the exception to the rule.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "04:11-04:27",
    "speaker" : "Andy",
    "text" : "Well, I think yes and no because I think that Uh the reason those guys sat was because they had a legit starter in front of them. So they were able to sit and learn for a year behind somebody who's already playing. Like Alex Smith was still there with the Chiefs."
  },
  {
    "text" : "What I'm saying is that Cam Newton is a legit starter and gives it the best chance to win.",
    "speaker" : "Steve",
    "timestamp" : "04:27-04:32"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:32-04:32",
    "text" : "Yes."
  },
  {
    "timestamp" : "04:32-04:36",
    "speaker" : "Steve",
    "text" : "See, I see the other way. I think he might as well just roll with the rookie."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:36-05:07",
    "text" : "Why? But what it what if he's what if the rookie starts 0-3 and then gets demolished by Brady week four? Then you can you just ride him. But what if he doesn't get better though? What if that shatters his confidence? Like the like the speaking of the Jets, like the Jets have done with all of their quarterbacks for the past 20 years. And absolutely ruined every single one of them. Like the Bills did with Josh Allen. Okay, so that's yeah, but who they got it right once in."
  },
  {
    "timestamp" : "05:07-05:11",
    "text" : "Chargers did with uh Justin Hebert. He's a beast now.",
    "speaker" : "Steve"
  },
  {
    "text" : "Okay. What about every Jaguars quarterback for the past 20 years? What about every Browns quarterback before blame the game?",
    "speaker" : "Andy",
    "timestamp" : "05:12-05:21"
  },
  {
    "text" : "Come on.",
    "timestamp" : "05:22-05:22",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. Yeah and they were all ruins because they started too soon.",
    "timestamp" : "05:23-05:28"
  },
  {
    "speaker" : "Steve",
    "text" : "So if you franchises are also trash, that's why they're picking terra high quarterbacks. It's true, but they also like so right.",
    "timestamp" : "05:28-05:33"
  },
  {
    "text" : "So they had to start. But if you don't have to start the guy",
    "speaker" : "Andy",
    "timestamp" : "05:34-05:37"
  },
  {
    "speaker" : "Steve",
    "text" : "Why?",
    "timestamp" : "05:38-05:39"
  },
  {
    "speaker" : "Andy",
    "text" : "Why do it?",
    "timestamp" : "05:39-05:39"
  },
  {
    "text" : "Well, because maybe you think you have to start it because Cam Newton can't throw a ball more than five yards.",
    "speaker" : "Steve",
    "timestamp" : "05:40-05:44"
  },
  {
    "text" : "But that's garbage. He can. He just fell behind the oven.",
    "timestamp" : "05:44-05:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "05:48-05:51",
    "text" : "Sure he did. Objectively, his passing was poor last year.",
    "speaker" : "Steve"
  },
  {
    "text" : "It was poor, especially towards the end. It was fine at the beginning. But but after after he did his uh COVID stint. And he was he fell behind the offense. And then he started getting to bad habits trying to play hero ball. And I think him having a whole offseason and preseason with this team To be on the same page with them and learn as this offense goes throughout the season. I think he'll be fine. This year.",
    "timestamp" : "05:51-06:18",
    "speaker" : "Andy"
  },
  {
    "text" : "So what you're saying is I'm ignoring all the all the recent history, which is the best predictor of future success and just going with the gut.",
    "timestamp" : "06:19-06:27",
    "speaker" : "Steve"
  },
  {
    "text" : "History is it isn't a prediction of anything. That's the that's the that's where people get in trouble.",
    "speaker" : "Andy",
    "timestamp" : "06:27-06:32"
  },
  {
    "speaker" : "Steve",
    "text" : "The best predictor of future performance is past success.",
    "timestamp" : "06:32-06:35"
  },
  {
    "text" : "Aaron Rodgers has had a lot of past success. And you think he's gonna suck this year? I think he's not gonna win a Super Bowl this year. Like how Homer do you want me to be here? And I can I can get I can get even more Homer-ish if you'd like. By the way, the Patriots have scored a touchdown. They're up 7-0. Damian Harris. Damian Harris looking solid. See, that's the thing. You don't even need a good quarterback. You just need a quarterback who can Who can complement this running game, which is like four or five running backs deep? Let's talk about that.",
    "speaker" : "Andy",
    "timestamp" : "06:38-07:12"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "07:12-07:16",
    "text" : "That's why that's why Mac can fit in though, because all he has to do is not fuck up."
  },
  {
    "timestamp" : "07:16-07:24",
    "speaker" : "Andy",
    "text" : "It's true. And I think if you look at this offense, it's built more for a Mac Jones type quarterback because that's who Tom Brady was."
  },
  {
    "speaker" : "Steve",
    "text" : "Because if you run it really well with your running backs and Cam runs it really well, now you're just running it all the time and then Right. When they snack the box, you have to throw and you can't.",
    "timestamp" : "07:24-07:31"
  },
  {
    "text" : "But you don't have to throw because Damian Harris a averaged over five yards a carry last year. And like 80% of those runs were eight-man boxes. You have to throw sometimes, Andy. Not if you're averaging five yards a run you don't.",
    "timestamp" : "07:32-07:45",
    "speaker" : "Andy"
  },
  {
    "text" : "You literally don't have to R Remember the Texans game when that we lost, that they played goal line in midfield against us? That's ridiculous. That says we don't respect your passing game at all. We're playing goal line and midfield.",
    "timestamp" : "07:45-07:58",
    "speaker" : "Steve"
  },
  {
    "text" : "But that was with an injured Cam dude at that point. So So as long as he's not injured.",
    "timestamp" : "07:59-08:04",
    "speaker" : "Andy"
  },
  {
    "text" : "What do you think happens to Sony, speaking of how many running backs they have?",
    "speaker" : "Steve",
    "timestamp" : "08:05-08:10"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, let's talk about the list. Give me the list of running backs on this team right now.",
    "timestamp" : "08:10-08:14"
  },
  {
    "timestamp" : "08:14-08:29",
    "speaker" : "Steve",
    "text" : "uh 10 or 12 Damien Harris is a presumed number one yes i would I would feel comfortable with that He got the first carry inside the goal line, they just football twice inside the ten yard line and he score touchdown, which is what you want to see."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep.",
    "timestamp" : "08:30-08:30"
  },
  {
    "text" : "Sony is the presumed number two.",
    "speaker" : "Steve",
    "timestamp" : "08:30-08:33"
  },
  {
    "text" : "Yeah, well he was the former number one. I don't know if you can presume him number two, but you would think.",
    "timestamp" : "08:33-08:37",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "08:37-08:42",
    "speaker" : "Steve",
    "text" : "He's probably he's the second best. back in that mold in this on this roster."
  },
  {
    "speaker" : "Andy",
    "text" : "Probably at the moment.",
    "timestamp" : "08:43-08:44"
  },
  {
    "text" : "You have uh Stevenson who had that 91 yard TD in the first preseason. Right.",
    "speaker" : "Steve",
    "timestamp" : "08:45-08:48"
  },
  {
    "speaker" : "Andy",
    "text" : "Right.",
    "timestamp" : "08:49-08:49"
  },
  {
    "timestamp" : "08:49-08:51",
    "text" : "And I think who looks like Garrett Blunt.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:51-09:01",
    "text" : "He looks great, but the Patriots have a very long and storied history of uh the first year running backs never seeing the field."
  },
  {
    "text" : "Never.",
    "speaker" : "Steve",
    "timestamp" : "09:01-09:02"
  },
  {
    "timestamp" : "09:02-09:04",
    "speaker" : "Andy",
    "text" : "Ever. It doesn't matter how good they were."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "09:04-09:05",
    "text" : "Including Damon Harris."
  },
  {
    "text" : "Yeah. Although Sony, he played his first year, right? He played as a rookie. He played an awesome playoffs as a because yeah, he had the most rushing playoff rushing touchdowns of any rookie ever, I think, right? Have any rookie running backs? Something like that. It was some like obscure stat like that. Yep. So yeah, I I would feel I would I would feel super confident with Those two as your as your like running back stable, uh Sony and um Damian Harris. Here's my question for both those guys.",
    "timestamp" : "09:06-09:40",
    "speaker" : "Andy"
  },
  {
    "text" : "Can either of them actually catch the ball?",
    "timestamp" : "09:40-09:42",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh I don't know, but you still have James White, right?",
    "timestamp" : "09:42-09:45"
  },
  {
    "text" : "We've never really had that player though. Who can do both? Right. Who can run like Damian Harris and catch the ball like James White? Because that player would be unstoppable in this offense.",
    "speaker" : "Steve",
    "timestamp" : "09:45-09:55"
  },
  {
    "timestamp" : "09:55-10:04",
    "text" : "That's true. Well, that's what they're saying that uh Ramon J. Stevenson is going to be. Because they say he he actually caught a lot of balls coming out of where you come from? Oklahoma?",
    "speaker" : "Andy"
  },
  {
    "text" : "Oklahoma, yeah.",
    "timestamp" : "10:04-10:05",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "10:05-10:50",
    "text" : "Yeah. I didn't know a lot of balls. Yeah, he caught he I think he did, um, because they were just kind of like a a more spread often sort of thing. But uh I think that that alone might be enough to maybe push him up the list of somebody who can do both, because you saw the Patriots last year even. Stick with uh Rex Burke before he got hurt because he could do both, even though he was not as good a runner as Sony or Damian Harris. And not as good a pass catcher as James White, but because he can do both well enough, he gives you that flexibility to just line up however you want and either run or pass from that thing.",
    "speaker" : "Andy"
  },
  {
    "text" : "Rex Burkett, I forgot about it. We gotta love Rex. Yeah, well Rex is gone.",
    "timestamp" : "10:51-10:55",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "10:55-11:02",
    "text" : "Is he playing at all this year? Uh I feel like he went to the Texans like every other expatriate.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yes. That does sound right.",
    "speaker" : "Steve",
    "timestamp" : "11:02-11:04"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "11:04-11:04"
  },
  {
    "timestamp" : "11:05-11:07",
    "speaker" : "Steve",
    "text" : "Although you can say about like you said, half the Patriots roster."
  },
  {
    "text" : "Right, exactly exactly. Yeah, they're building the Patriots South down there. Um not sure how that's gonna go. Terrible against the water. I can't imagine Deshaun Watson's gonna play, right? He can't. I don't know.",
    "timestamp" : "11:08-11:23",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "11:23-11:31",
    "speaker" : "Steve",
    "text" : "Even if he plays, that team is such a dumpster fire that it's just gonna be awful. Even Deshaun Watson's not talented enough to save that team from the U. S."
  },
  {
    "speaker" : "Andy",
    "text" : "I mean he might be, but I don't I would have a hard time figuring out how he plays.",
    "timestamp" : "11:31-11:37"
  },
  {
    "timestamp" : "11:37-11:39",
    "text" : "Can you hear these Cape Cods that I'm eating right now?",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. This is the worst fucking radio. Rule number one of radio is don't eat on the radio.",
    "timestamp" : "11:40-11:47",
    "speaker" : "Andy"
  },
  {
    "text" : "So they're the summer, the Cape Cod summer version.",
    "timestamp" : "11:47-11:51",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "They're bamboo chips. Oh oh my good. Useless All right. So running backs, deep, definitely a strong suit. Especially with this. What was the question?",
    "timestamp" : "11:52-12:07"
  },
  {
    "text" : "What do you think happens to Sony? Where you think, is he gonna be on the roster day one?",
    "timestamp" : "12:07-12:11",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "12:11-12:12",
    "speaker" : "Andy",
    "text" : "I think so."
  },
  {
    "speaker" : "Steve",
    "text" : "Caught him or they trade him.",
    "timestamp" : "12:12-12:13"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:13-12:16",
    "text" : "I think he's still I think he's still on the roster day one."
  },
  {
    "speaker" : "Steve",
    "text" : "Are you gonna keep um JJ as well?",
    "timestamp" : "12:16-12:19"
  },
  {
    "text" : "Ooh, I forgot about JJ.",
    "timestamp" : "12:19-12:21",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, because it's that's a guy that's that's a guy that's tough to figure out. You have to pick one of those two. Can he catch? We got James White. Yeah, he's a little mini Dion.",
    "speaker" : "Steve",
    "timestamp" : "12:21-12:29"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:31-12:32",
    "text" : "Can he catch though?"
  },
  {
    "text" : "Yeah, he's really good at that. He's like James White backup.",
    "speaker" : "Steve",
    "timestamp" : "12:32-12:36"
  },
  {
    "text" : "It's true, yeah. So yeah, but can you care like how many how many running backs can you conceivably carry? I guess if you're a running team and you're just like gonna say, fuck it, we're gonna just gonna carry three wide receivers on the roster and if they get hurt, fuck them. Because we're just gonna run it three out of four plays anyway.",
    "speaker" : "Andy",
    "timestamp" : "12:36-12:54"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean you can try and trade Sony.",
    "timestamp" : "12:54-12:55"
  },
  {
    "timestamp" : "12:56-13:02",
    "speaker" : "Andy",
    "text" : "Uh you could. For what though? I don't know. Better than just cutting him. It's true."
  },
  {
    "speaker" : "Steve",
    "text" : "He's not bad. He's a good player.",
    "timestamp" : "13:02-13:04"
  },
  {
    "speaker" : "Andy",
    "text" : "He is. No, he's a good runner. And I think as long as he can stay Yeah. It's just your typical New England negativity. Um, but I think that uh he the the hate that he gets is mainly due to him not being able to stay on the field more than anything. And the and like coupled with the fact that he was a first-round draft pick and everybody around here hates Bill Belichick's drafting style.",
    "timestamp" : "13:04-13:31"
  },
  {
    "timestamp" : "13:31-13:38",
    "text" : "And I also think he had a he had a shitty second year. After the first year, when he walled out in the playoffs.",
    "speaker" : "Steve"
  },
  {
    "text" : "I feel I I have a hard time blaming him for that because they were on their like third and fourth string line minute pretty much every spot. That was the year we had um what's his name at left tackle? The guy off the street. That was an absolute turnstile.",
    "speaker" : "Andy",
    "timestamp" : "13:39-13:53"
  },
  {
    "timestamp" : "13:54-13:56",
    "speaker" : "Steve",
    "text" : "Oh yeah, yeah. Cunningham or something like that."
  },
  {
    "timestamp" : "13:56-14:27",
    "speaker" : "Andy",
    "text" : "So yeah, that wasn't yeah, it was something like that though. Felt so bad for the guy. But uh yeah, I mean I think I I yeah, I I can see them keeping Sony on this roster. And maybe stashing at least one of the younger guys. Alright, Andy, do you do a roster projection for us right now? You got your file. A full roster projection? I I don't I don't have the any of these lists in front of me whatsoever. I thought you were a Patriots nerd, you nerd. I am, but I don't have this off the top of my head."
  },
  {
    "text" : "Well we'll we'll walk through it.",
    "speaker" : "Steve",
    "timestamp" : "14:27-14:29"
  },
  {
    "text" : "All right.",
    "timestamp" : "14:29-14:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "All five running backs, yes?",
    "timestamp" : "14:31-14:33"
  },
  {
    "text" : "Yeah, let's do it.",
    "timestamp" : "14:33-14:34",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Write it down. It's gonna get confusing.",
    "timestamp" : "14:34-14:35"
  },
  {
    "text" : "All right, write it down for me.",
    "timestamp" : "14:36-14:37",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:37-14:38",
    "speaker" : "Steve",
    "text" : "I don't I can't write."
  },
  {
    "text" : "I'm not writing it. I know. You can't read either, so why are we writing this down?",
    "timestamp" : "14:38-14:41",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:41-14:45",
    "text" : "You're not gonna be able to do it. I'll write it down, because I uh I believe in you, Andy.",
    "speaker" : "Steve"
  },
  {
    "text" : "Okay, all right.",
    "timestamp" : "14:45-14:46",
    "speaker" : "Andy"
  },
  {
    "text" : "You got what fifty how many I don't even know how many players you got?",
    "speaker" : "Steve",
    "timestamp" : "14:46-14:48"
  },
  {
    "timestamp" : "14:49-14:49",
    "speaker" : "Andy",
    "text" : "53"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "14:50-14:51",
    "text" : "Are you sure it's not 54?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:52-15:38",
    "text" : "Yep. Are you sure? Yeah, it's Chris Slade. Wait, say that again? That's how many, that's how many players there is. Chris Slade. That's how you know. Yeah. 53. That that that's how I remember all of my numbers between like one and a hundred is uh by old Patriot Jersey numbers. So anything 55 is William McGuinness. 54 is Brucey or, you know, whoever you want. So and any obvious, I mean, just look at the the uh the phone number we give out. It's got Troy Brown right in the middle of it, right? Troy Brown for three, right? 505, Troy Brown for three. Exactly. Only because there's no 43. There's no Patriots 43."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "15:39-15:39",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:40-15:46",
    "text" : "Right. There hasn't been. Who is it now? Is it uh Jakob Johnson? Is he 43? He's 40 something."
  },
  {
    "timestamp" : "15:46-15:47",
    "text" : "No idea.",
    "speaker" : "Steve"
  },
  {
    "text" : "40 is a that's a tough number because that's usually just like a Like fullback number? Those are the only guys that's not now. Oh yeah. Yeah, now anybody can have any fucking number it feels like. It's not a cool number. Eight. Right. Or nine. Or number one like Cam Newton. Right. See, now I got ones. Ones are all set.",
    "speaker" : "Andy",
    "timestamp" : "15:47-16:07"
  },
  {
    "speaker" : "Steve",
    "text" : "He's slinging against Easy Eagles here.",
    "timestamp" : "16:07-16:09"
  },
  {
    "text" : "Yeah, I got number three. Uh Luke Oskowski, number four is obviously Adam and Hateri. You know, and now 37's Damian Harris. We didn't have that either. 37's a random number.",
    "speaker" : "Andy",
    "timestamp" : "16:09-16:22"
  },
  {
    "text" : "That is a random number.",
    "timestamp" : "16:23-16:24",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "16:25-16:25"
  },
  {
    "text" : "So quarterbacks Andy, how many you keep in?",
    "speaker" : "Steve",
    "timestamp" : "16:25-16:28"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:29-16:30",
    "text" : "Two."
  },
  {
    "speaker" : "Steve",
    "text" : "Okay.",
    "timestamp" : "16:30-16:31"
  },
  {
    "timestamp" : "16:32-16:53",
    "text" : "It'll probably be three, but you know, whatever. The top two. Tight end. Tight end we'll probably keep about 40, I would say. That most of this roster is going to be tight end, and I'm I'm happy with that. You're going for the four tight end approach. I would like that, yes. Um if we can get At least four on the field at one time, that would be ideal.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "16:54-16:57",
    "speaker" : "Steve",
    "text" : "Okay, so you're at 47 players before the defense."
  },
  {
    "timestamp" : "16:59-17:01",
    "text" : "And you need five on that offensive line.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I think the offensive line. Yeah, I think you probably could, right? I'm not even quite sure you know what a tight end is. It's not Tim Tebow, Andy.",
    "timestamp" : "17:03-17:12",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "It's anyone well those videos of Tim Tebow attempting to block look like what what I would look like in a professional football game trying to block. You'd be like, go, go hit that guy and I would do it and I would just fall over like he did. It's amazing.",
    "timestamp" : "17:14-17:28"
  },
  {
    "timestamp" : "17:28-17:30",
    "speaker" : "Steve",
    "text" : "That guy would be able to elude me immediately."
  },
  {
    "text" : "Probably. So Yeah, I mean I think uh stack of running backs, because I think you'll rotate through them all, uh they might stash maybe one of them. Uh and like the practice squad or or you know you might get the Foxboro flu where he's you know on injured reserve for the whole season with uh a mystery illness. Yeah. Um and then yeah, I I don't I think the tight ends are pretty much set. You've got the top two, obviously, the two new guys.",
    "timestamp" : "17:31-18:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Are you worried that they're getting hurt all the time?",
    "timestamp" : "18:03-18:05"
  },
  {
    "text" : "Only because that's just kind of how uh tight the tight end position goes. Like tight ends don't often stay healthy all all season, even with a guy like Gronk or something like that. Like they they just they're always injured just because of the how that position is.",
    "speaker" : "Andy",
    "timestamp" : "18:06-18:25"
  },
  {
    "timestamp" : "18:25-18:28",
    "text" : "I feel like Conte Henry has a has a rap of being injury prone.",
    "speaker" : "Steve"
  },
  {
    "text" : "He does. I think it's a little overblown. I've seen some articles out there about how they're just, you know. He's it the lying in is this No, it's just uh it's like when everybody Sam Indola was uh injury prone, and basically it was like the same injuries that yeah. Yeah, everybody was ripping that that uh thing to shreds, the fact that they replaced Welker with Amendola because Amendola was right. But basically they had kind of the similar injury history, but Welker had his towards the end of seasons and Amandola had his like at the beginning, so he missed more games. So",
    "speaker" : "Andy",
    "timestamp" : "18:29-19:08"
  },
  {
    "speaker" : "Steve",
    "text" : "It's things like that.",
    "timestamp" : "19:09-19:10"
  },
  {
    "timestamp" : "19:13-19:13",
    "speaker" : "Andy",
    "text" : "No."
  },
  {
    "text" : "Do you think he put all right? Let's put some more hot takes down, Andy. I'm I'm putting you on the record here.",
    "timestamp" : "19:14-19:18",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "19:18-19:19",
    "text" : "All right, give it to me."
  },
  {
    "speaker" : "Steve",
    "text" : "So you're saying we keep Sony, right? Yep. I'm making notes here. Hunter Henry plays all 16. Yep. What's our record for the first four games?",
    "timestamp" : "19:19-19:31"
  },
  {
    "text" : "First four games. I don't even know who we're playing, but I'm gonna say three and one. Only because we start slow.",
    "speaker" : "Andy",
    "timestamp" : "19:32-19:39"
  },
  {
    "timestamp" : "19:40-19:42",
    "speaker" : "Steve",
    "text" : "It is home against the dolphins."
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "19:43-19:43"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:44-19:45",
    "text" : "At the Jets."
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "19:46-19:46"
  },
  {
    "text" : "Home against the Saints.",
    "speaker" : "Steve",
    "timestamp" : "19:47-19:48"
  },
  {
    "timestamp" : "19:49-19:49",
    "speaker" : "Andy",
    "text" : "Okay."
  },
  {
    "speaker" : "Steve",
    "text" : "Home against the Buccaneers",
    "timestamp" : "19:49-19:51"
  },
  {
    "timestamp" : "19:52-19:57",
    "speaker" : "Andy",
    "text" : "Okay. Yeah, three and three and one um is uh my conservative estimate. Okay."
  },
  {
    "timestamp" : "19:57-20:03",
    "speaker" : "Steve",
    "text" : "And then what's their season long record? Um keeping in mind there's an extra game this year."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:03-20:16",
    "text" : "I don't know. Uh see 12 wins and how many losses does that mean now? Five. We'll 12 and 5. 12 and 5. That accounts for the extra game, right? Yeah, because usually 12 and 4."
  },
  {
    "timestamp" : "20:16-20:21",
    "speaker" : "Steve",
    "text" : "Give them an extra L. Okay. Cam Newton plays the whole season."
  },
  {
    "timestamp" : "20:21-20:24",
    "speaker" : "Andy",
    "text" : "Yep. We've already established that. Yeah."
  },
  {
    "timestamp" : "20:24-20:24",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "text" : "What else?",
    "speaker" : "Andy",
    "timestamp" : "20:24-20:25"
  },
  {
    "timestamp" : "20:26-20:30",
    "text" : "I don't know what other bold hot takes you got, Andy. Bold hot takes.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Matt Judon, Defensive Player of the Year.",
    "timestamp" : "20:32-20:34"
  },
  {
    "text" : "I feel okay.",
    "speaker" : "Steve",
    "timestamp" : "20:36-20:38"
  },
  {
    "text" : "That that one's uh that one's a little too hot even for me.",
    "timestamp" : "20:39-20:42",
    "speaker" : "Andy"
  },
  {
    "text" : "I'll I'll put it out there though.",
    "speaker" : "Steve",
    "timestamp" : "20:42-20:43"
  },
  {
    "text" : "All right.",
    "timestamp" : "20:44-20:44",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "It's gonna be tough to beat up the likes of Aaron Donald. Right, yeah, that's exactly what I thought when I saw it.",
    "timestamp" : "20:46-20:51"
  },
  {
    "text" : "Um But I don't know. This this team's looking good and he's been an absolute wrecking ball the entire the entire game. Yeah, he uh he looks like every time he's on the field, he's just like disrupting.",
    "timestamp" : "20:53-21:05",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:05-21:09",
    "speaker" : "Steve",
    "text" : "He is the the player that I'm most excited for. Offense or defense."
  },
  {
    "timestamp" : "21:09-21:10",
    "speaker" : "Andy",
    "text" : "Oh really?"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, because the quarterback controversy is definitely entertaining.",
    "timestamp" : "21:10-21:14"
  },
  {
    "timestamp" : "21:14-21:14",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "But I think the way this this team is going to go is the way how good their defense is going to be.",
    "timestamp" : "21:15-21:19",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "21:19-21:49",
    "text" : "I think that's part of it. Uh I think uh Johnu Smith is gonna be uh and I'm not quite sure A nice way to put this I'm going to say I think John W. Smith is going to be used in a similar way that uh our old friend Aaron Hernandez was used back in the heyday of those two tight ends. And I think going back to the tight ends, uh Devin Asiasi. Is it is it Devin? I think it's Devin.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "No hopes for him.",
    "timestamp" : "21:50-21:51"
  },
  {
    "timestamp" : "21:51-22:12",
    "speaker" : "Andy",
    "text" : "I do. I think I think he showed a little bit of a flash at the end of last season. And I think because of uh how much you know wear and tear these tight ends go through, I think he's gonna be that integral second tight end guy. In some spots."
  },
  {
    "text" : "How many touchdowns or catches?",
    "timestamp" : "22:13-22:15",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, it doesn't matter. His his contributions aren't going to be on the statute like that.",
    "timestamp" : "22:15-22:19"
  },
  {
    "timestamp" : "22:20-22:25",
    "speaker" : "Steve",
    "text" : "He's going to be more of a"
  },
  {
    "text" : "So, yeah. What else do you want? I can give you hot takes all day, Steve. Like literally all day. You can just keep firing them away. This is yeah, dude. I used to work in a marketing agency. This this comes naturally to me.",
    "speaker" : "Andy",
    "timestamp" : "22:24-22:37"
  },
  {
    "timestamp" : "22:37-22:43",
    "text" : "Oh, yes, you're right. I can talk up anything. Who wins a Super Bowl and how much do the Patriots win it by?",
    "speaker" : "Steve"
  },
  {
    "text" : "Um more than they've ever won a Super Bowl with Tom Brady. So what what's the what's the biggest what's it uh 10 points against the the the last one they won? Yeah the right 13-3. Yeah so I'll say 14.",
    "timestamp" : "22:44-22:58",
    "speaker" : "Andy"
  },
  {
    "text" : "Two touchdowns, Super Bowl winners.",
    "speaker" : "Steve",
    "timestamp" : "22:58-23:00"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. Calling it now. And even it doesn't matter who it's again. I think they'll hold the uh opposing offense to their lowest output of the season too in the Super Bowl.",
    "timestamp" : "23:00-23:15"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, why not a shutout, Andy? Come on. Because shutouts are hard to do in this NFL.",
    "timestamp" : "23:15-23:20"
  },
  {
    "timestamp" : "23:21-23:21",
    "speaker" : "Andy",
    "text" : "That's why."
  },
  {
    "speaker" : "Steve",
    "text" : "Uh what about Steph Gilmore? What do you think is going to happen with him?",
    "timestamp" : "23:21-23:26"
  },
  {
    "text" : "Uh he'll get signed. It's a matter of time. Uh two or three years probably. With a bunch of guaranteed money? How many punt return touchdowns does Gunnar have, Andy? Three. Three. No, he will have at least one. He will he will definitely have a point return touchdown.",
    "speaker" : "Andy",
    "timestamp" : "23:27-23:50"
  },
  {
    "speaker" : "Steve",
    "text" : "Who uh leads the paths in receiving?",
    "timestamp" : "23:50-23:53"
  },
  {
    "text" : "Uh good question. I would say probably Jacoby Myers is the easy answer. That's not much of a hot take, is it? So I'm gonna say John W. Smith. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "23:53-24:08"
  },
  {
    "speaker" : "Steve",
    "text" : "You just you're just putting hot takes for the intent of them being hot. You don't even believe that one.",
    "timestamp" : "24:09-24:14"
  },
  {
    "text" : "Right.",
    "timestamp" : "24:14-24:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "You know it's gonna be him. I know it's gonna be him.",
    "timestamp" : "24:14-24:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it's it's gotta be Jacoby Myers.",
    "timestamp" : "24:17-24:19"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean, it's just what it is. How many wide receivers are you keeping on your roster then, Andy?",
    "timestamp" : "24:19-24:24"
  },
  {
    "timestamp" : "24:24-24:35",
    "speaker" : "Andy",
    "text" : "Uh huh. Give me some names. Well, Jacoby Myers. Right. Nikhil Harry. Nelson Aguilar. Right."
  },
  {
    "speaker" : "Steve",
    "text" : "Kendrick Bourne.",
    "timestamp" : "24:35-24:36"
  },
  {
    "text" : "Kendrick Bourne. And isn't there some other guy, like some of the Williams or something? Williamson?",
    "timestamp" : "24:36-24:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, something Wilkerson.",
    "timestamp" : "24:41-24:42"
  },
  {
    "timestamp" : "24:42-24:43",
    "speaker" : "Andy",
    "text" : "Wilkerson, yeah, yeah, yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "24:44-24:44",
    "text" : "Gunner."
  },
  {
    "text" : "Gunner.",
    "timestamp" : "24:45-24:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Matthew Slater.",
    "timestamp" : "24:46-24:47"
  },
  {
    "text" : "I don't count him as a wide receiver.",
    "timestamp" : "24:47-24:48",
    "speaker" : "Andy"
  },
  {
    "text" : "He's never played as uh sure special teams guy.",
    "speaker" : "Steve",
    "timestamp" : "24:49-24:51"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. So he'll be a special teams guy. You could probably put Gunner in that same spot. You probably won't see much of him on the field as a wide receiver. At least not yet. Okay, so you're keeping all of them? Uh I think one of those guys will go. Which one? Probably uh Wilkerson, I would think.",
    "timestamp" : "24:51-25:12"
  },
  {
    "speaker" : "Steve",
    "text" : "So you're keeping the keel?",
    "timestamp" : "25:12-25:13"
  },
  {
    "timestamp" : "25:13-25:19",
    "text" : "I think so. I unless he gets traded. That's the only way he leaves.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "So you got what four there?",
    "timestamp" : "25:19-25:21"
  },
  {
    "timestamp" : "25:21-25:23",
    "text" : "I think I had four. Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Let's talk on your special teams guys. How many special teams only guys you're keeping?",
    "timestamp" : "25:24-25:28",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh at least three.",
    "speaker" : "Andy",
    "timestamp" : "25:28-25:30"
  },
  {
    "text" : "Well you gotta keep Slater.",
    "timestamp" : "25:30-25:32",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "25:32-25:33",
    "speaker" : "Andy",
    "text" : "Right, Slater."
  },
  {
    "text" : "Sign Bethel.",
    "speaker" : "Steve",
    "timestamp" : "25:33-25:34"
  },
  {
    "text" : "Is he uh I suppose he is just uh especially in guy yeah. Yep, he's a cornerback, I think. Uh Right, yeah, yeah, yeah. But you he probably not gonna see the field. Oh Bolden too.",
    "timestamp" : "25:35-25:45",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, big old hard arm for Bolden. He got Gunner.",
    "timestamp" : "25:46-25:48",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Gunner.",
    "timestamp" : "25:49-25:49"
  },
  {
    "timestamp" : "25:50-25:53",
    "speaker" : "Steve",
    "text" : "Kicker, Hunter, Long Snapper, we're up to seven here."
  },
  {
    "text" : "Well I mean yeah okay kicker punch alongside all right it's about right seven yeah call it seven who who kicker you think they're gonna keep Uh the rookie.",
    "timestamp" : "25:54-26:05",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "26:08-26:09",
    "text" : "Did you trust him though?"
  },
  {
    "text" : "No. But whatever.",
    "timestamp" : "26:10-26:12",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:12-26:14",
    "text" : "He's gonna go use like the the shadow?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I trust him enough, I think is is where it goes.",
    "timestamp" : "26:15-26:18"
  },
  {
    "timestamp" : "26:18-26:23",
    "text" : "I feel like kickers a big a big role. Kickers can decide games.",
    "speaker" : "Steve"
  },
  {
    "text" : "That's what I mean. So I trust him enough. I don't think Nick Folk is A big enough asset that uh you let the potential of the big leg go. Right, right. So Greg has been joining for about like 10 minutes now behind the scenes here. And now he's joining twice and it's not working. So we are in mid-season form here on the podcast. No, we're in preseason form, Andy. Jesus.",
    "speaker" : "Andy",
    "timestamp" : "26:23-26:51"
  },
  {
    "text" : "No, this is mid-season form for us.",
    "speaker" : "Steve",
    "timestamp" : "26:52-26:54"
  },
  {
    "text" : "Greg not being able to get on the goddamn Zoom call. I just click the link and it works. Every time. Yeah. I've never had a problem. It just just happens.",
    "speaker" : "Andy",
    "timestamp" : "26:56-27:08"
  },
  {
    "text" : "What 58 of these that we're doing?",
    "timestamp" : "27:08-27:10",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:11-27:13",
    "text" : "Uh we're actually up to 70 something."
  },
  {
    "text" : "Jesus Christ.",
    "timestamp" : "27:14-27:15",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. So it's been a lot. All right. Yeah. So how did I do on offense? How many guys do I have? Offense special teams. How many defenders?",
    "timestamp" : "27:16-27:28"
  },
  {
    "timestamp" : "27:29-27:30",
    "speaker" : "Steve",
    "text" : "Math is not my thing."
  },
  {
    "timestamp" : "27:31-27:40",
    "speaker" : "Andy",
    "text" : "I was putting this in a spreadsheet and just fucking doing a count. Oh my god, I'm gonna open the calculator. Let's see if we can get this right."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "27:40-27:44",
    "text" : "Four is eleven plus four is fifteen plus five is twenty."
  },
  {
    "timestamp" : "27:45-27:52",
    "text" : "22. Listen to you not being good at math. So 22, I'm actually a little under. Oh, we don't have offensive line though",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "27:52-27:53",
    "text" : "Yeah, I was about to tell you that."
  },
  {
    "speaker" : "Andy",
    "text" : "Pencil in like uh probably six or seven of those, I would think. Because you can't just have the five. You need at least five.",
    "timestamp" : "27:54-28:00"
  },
  {
    "speaker" : "Steve",
    "text" : "You can't have the five. Generally you have what a backup tackle and a backup inside guy and more like a number.",
    "timestamp" : "28:01-28:07"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:08-28:10",
    "text" : "And an extra center. So you have those."
  },
  {
    "timestamp" : "28:10-28:11",
    "text" : "So what do you want?",
    "speaker" : "Steve"
  },
  {
    "text" : "Those three.",
    "speaker" : "Andy",
    "timestamp" : "28:11-28:12"
  },
  {
    "speaker" : "Steve",
    "text" : "Seven or eight, Andy. Seven. It's 29.",
    "timestamp" : "28:12-28:16"
  },
  {
    "text" : "Alright, call it eight. Give it to me. Whatever. How many defenders can you possibly need on this team? They're all rock stars.",
    "speaker" : "Andy",
    "timestamp" : "28:16-28:24"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:24-28:27",
    "text" : "Oh wow. So confident."
  },
  {
    "speaker" : "Andy",
    "text" : "This team is full of studs, dude. Name me one one spot where it's like some no-name dude",
    "timestamp" : "28:27-28:33"
  },
  {
    "timestamp" : "28:35-28:42",
    "speaker" : "Steve",
    "text" : "Spot with a no-name dude. Whoever is the corner opposite JC Jackson if we don't resign stuff"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:42-28:44",
    "text" : "Yeah, but we're I've already said we're re-signing stuff."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:44-28:47",
    "text" : "That's gonna be resigning because who the hell is gonna play the opposite side?"
  },
  {
    "text" : "Juwan Williams.",
    "speaker" : "Andy",
    "timestamp" : "28:47-28:48"
  },
  {
    "text" : "He sucks.",
    "timestamp" : "28:49-28:50",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "28:50-28:50",
    "text" : "No."
  },
  {
    "speaker" : "Steve",
    "text" : "He has shown nothing.",
    "timestamp" : "28:50-28:52"
  },
  {
    "text" : "He's he's tall. He's rangy.",
    "timestamp" : "28:53-28:54",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "28:55-29:07",
    "text" : "Oh cool, Andy. Fuck out of here. Well what play he got an interception last game, and that was because Of uh Ronnie Perkins being right in the guy's face.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "29:08-29:11",
    "speaker" : "Andy",
    "text" : "Yep. Oh. Who also looks legit."
  },
  {
    "text" : "This is the best. The season is when everybody looks good and nobody looks bad.",
    "timestamp" : "29:11-29:15",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, some people look bad, but it's it's usually not pages because I think the deal with um getting like super excited about pages preseason games is that oh good",
    "timestamp" : "29:16-29:28"
  },
  {
    "text" : "Dude, I'm having a meltdown right now, dude. Greg's here, everybody. A technological meltdown at my house.",
    "speaker" : "Greg",
    "timestamp" : "29:29-29:37"
  },
  {
    "timestamp" : "29:37-29:43",
    "speaker" : "Andy",
    "text" : "I know. We saw you try to join for about 15 minutes now, three separate times."
  },
  {
    "timestamp" : "29:44-30:01",
    "speaker" : "Greg",
    "text" : "You know, not responding and then it just shits the bed on your computer. Not only that, neither my Spectrum cable box nor the NFL network app is working. So I can't even watch the game while my Zoom shits the bed. Dude, nothing worked. Nothing."
  },
  {
    "timestamp" : "30:02-30:05",
    "speaker" : "Andy",
    "text" : "Steve, how's your how's your connection going?"
  },
  {
    "speaker" : "Steve",
    "text" : "It's pretty solid. I'm I'm right next to the routers, right? Right over here. So it's been a nice stream Oh, my computer keeps going to sleep, so keep letting it you know play.",
    "timestamp" : "30:05-30:15"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, well I I am having no issues.",
    "timestamp" : "30:15-30:18"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "30:18-30:30",
    "text" : "So well I'm glad to hear that, Andy. Andy's having issues, but his issues are his like erection is really raging right now because he's being the biggest homer."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "30:31-30:31"
  },
  {
    "text" : "It's like legit annoying, Greg.",
    "speaker" : "Steve",
    "timestamp" : "30:32-30:33"
  },
  {
    "text" : "What's the score?",
    "speaker" : "Andy",
    "timestamp" : "30:35-30:36"
  },
  {
    "text" : "Seven nine.",
    "timestamp" : "30:37-30:37",
    "speaker" : "Steve"
  },
  {
    "text" : "Seven nothing good, guys. We looking good? Yeah, on both sides of the ball, of course. But I was actually just trying to get into this before you rudely interrupted. Sorry. Uh yeah, I think the re I I I I have a hard time getting super excited about Page Pre-Season because they're Um their philosophy for making the it's 14 nothing now, 13 nothing. Um their philosophy for building a team is less like high-end guys and more spending the money on the mid-range. So the Patriots like second team is always going to be better than any other team's second team, generally? I mean not always, but as kind of a a general rule. You're gonna have that. So you can watch the first play the first and get some kind of idea of what's going on, but uh In terms of like once the second team comes on, like I I feel like the pages are gonna have a slightly higher class of of player. Andy",
    "timestamp" : "30:38-31:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Shut up.",
    "timestamp" : "31:44-31:44"
  },
  {
    "text" : "And this kicker has now missed two kicks. The guy said he was locked to make the rose.",
    "timestamp" : "31:45-31:49",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:50-32:07",
    "speaker" : "Steve",
    "text" : "We're so good. No, I'm saying you you can't everybody else. You can't even tell. It's not so good. It's just a different shit on everybody. It's a different philosophy of building a football team. But it's fun to watch those guys and you never get to see them because they don't even play. It's great. Especially this year, all the new guys Oh yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "32:07-32:31",
    "text" : "Call it draft picks. Yeah, but there's always one guy who It shines brightly, the Danny Etlings of the of the team. They're like, oh, he ran for an 88-yard touchdown again as a quarterback against the Giants. He's a lock to make this team. He's going to be the next Tom Brady. And guess what? He wasn't Steve. Wasn't there a tight end a few years ago too? That it was like, oh, he's the next Gronk. And he didn't even make the goddamn team."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "32:30-32:42",
    "text" : "No one said that, Andy. Oh, so you think Jacoby Myers, that sick ass touchdown he just had? Yeah. Come to clean him off his cleats on the five-yard line. Dope. That that's not real."
  },
  {
    "speaker" : "Andy",
    "text" : "Also, uh I'll have you notice that was a great downfield throw by none other than Cam Newton.",
    "timestamp" : "32:42-32:47"
  },
  {
    "speaker" : "Steve",
    "text" : "It was not a great downfield throw. Just a little bit to the left. It was a great throw. Don't be wrong. Downfield throw. Wide open. I would not call that downfield. That throw traveled like 10 yards in the air. That's pat that's downfield, you fucking idiot. All right, Greg, let you let me know when you're ready for some of Andy's hot takes that I've been gathering here. Let me hear 'em. Uh we're keeping Sony. Yeah. Okay. Hunter Henry plays all 16 games. Yep. We're keeping we're keeping Nikil as well. Pasco 3-1 to start, 12-5 on the season. Yep. Mac Jones doesn't see the field. Oh.",
    "timestamp" : "32:47-33:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:24-33:36",
    "text" : "Oh, I said he didn't start a game. He might see like cleanup, you know? Cleanup, yeah. Yeah. He'll take some knees. Okay. When the Pats are stomping the fucking Dolphins at the end of the year, you know?"
  },
  {
    "timestamp" : "33:36-33:39",
    "speaker" : "Steve",
    "text" : "And then uh Matt Judana is defensive player of the year."
  },
  {
    "text" : "Yeah, that one that one's just for hot take's sake. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "33:40-33:42"
  },
  {
    "timestamp" : "33:42-33:46",
    "speaker" : "Steve",
    "text" : "Yeah, that's a hot take right there. That's the one I agree the most with."
  },
  {
    "speaker" : "Andy",
    "text" : "The rest of them are like mediocre takes. They're they're lukewarm, I think. But I think this I I think this this team's gonna be a solid team. I think Cam Newton's gonna surprise a lot of people I think um the point I made at the beginning of this before you were here, Greg, was that the top three quarterbacks in the league right now. all started uh zero or one game in their rookie season. Brady didn't start any Aaron Rodgers didn't start for like three years. And Pat Mahomes started one game. And uh I think it's because all three of those teams had the luxury of having a starting quarterback. uh to be able to bench their guy. And I think the pages have that too. And giving not throwing uh Mac Jones to the Wolves week one, I think.",
    "timestamp" : "33:46-34:40"
  },
  {
    "timestamp" : "34:40-34:49",
    "speaker" : "Greg",
    "text" : "Yeah, but that doesn't support that they'll be good this year, right? I mean, those teams are bad until the star quarterback got in."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:49-34:50",
    "text" : "That's true. No."
  },
  {
    "speaker" : "Greg",
    "text" : "I I fully if Cam starts every game, this is like a ten win team. A max.",
    "timestamp" : "34:50-34:55"
  },
  {
    "text" : "Maybe. I think And and the other the other uh thing that I was saying is that I think this offense is built more for a Mac Jones style quarterback than a Cam Newton style quarterback. Because it's built it's historically been built around a Tom Brady stock quarterback, which is what Cam.",
    "timestamp" : "34:56-35:18",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:18-35:34",
    "speaker" : "Steve",
    "text" : "But Andy also thinks we're gonna win the Super Bowl with Cam Newton. He put that down there too. And we're gonna win the Super Bowl by 14 points, which is more than Tom Brady ever won it by. Right. I would venture to guess there's a 0% chance that happens. They're not even hot takes, they're homer takes."
  },
  {
    "timestamp" : "35:34-35:35",
    "text" : "Homer takes. Obviously.",
    "speaker" : "Greg"
  },
  {
    "text" : "That's why you have me here. He also wants to build a website that only has home or take content on it.",
    "timestamp" : "35:36-35:42",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Why don't you know I have? I've already done it. The pats. win. Just don't go to pagers. wing because that's a whole different that's a whole different uh uh echo chamber, if you will. Of what? of Trump supporters. Yeah, it's it's where all the Trump supporters you got kicked off of. And they started their own Brand new Reddit, yeah.",
    "timestamp" : "35:42-36:09"
  },
  {
    "speaker" : "Steve",
    "text" : "USA Patriots, not New England Patriots.",
    "timestamp" : "36:09-36:11"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, different kind of well, yeah, different kind of patriots, some would argue. Um",
    "timestamp" : "36:11-36:16"
  },
  {
    "speaker" : "Steve",
    "text" : "You should just make it Belichick. win.",
    "timestamp" : "36:17-36:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, I should. Hang on. Talk amongst yourselves.",
    "timestamp" : "36:20-36:24"
  },
  {
    "timestamp" : "36:25-36:26",
    "speaker" : "Steve",
    "text" : "You're gonna change it now."
  },
  {
    "text" : "Talk amongst yourselves. I just gotta make sure I buy that before somebody else does.",
    "timestamp" : "36:26-36:30",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh yes, yes. Spectrum. I hate spectrum.",
    "timestamp" : "36:30-36:34",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:34-36:37",
    "text" : "Do you have choices of anything else?"
  },
  {
    "text" : "Yeah. right uh do we have choices no right doubt it doubt it oh look at this what's a film network on my computer now fumble looks like there was a problem with the video I am over four. Steal it up the internet, Greg.",
    "speaker" : "Greg",
    "timestamp" : "36:37-36:52"
  },
  {
    "timestamp" : "36:52-37:00",
    "speaker" : "Steve",
    "text" : "That's what I've been doing. No, the internet's fine. Yeah, so don't even go to NFL network. NFL can of course they can't get their shit to work right."
  },
  {
    "timestamp" : "37:01-37:16",
    "text" : "Send them a link, Steve. Text it to them. I actually probably have to fucking carrier pigeon it to him right now. But can I use your computer? Except he's you can't use the chat because he's on fucking iPhone.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "37:17-37:17",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:17-37:19",
    "text" : "I can't even log into Zoom."
  },
  {
    "text" : "And now he's frozen. Yeah, it fucked him up.",
    "timestamp" : "37:20-37:24",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "37:25-37:40",
    "speaker" : "Andy",
    "text" : "Oh boy. All right. So this is this is an absolute shit show, which is perfect. Um Kind of like this Philadelphia office. I'm a little surprised they're starting um your Golden Boy."
  },
  {
    "speaker" : "Steve",
    "text" : "Well, I mean Jalen Hurts must be sitting this one out.",
    "timestamp" : "37:41-37:43"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:44-37:59",
    "text" : "Maybe. They I guess they know what they have in him. Still he's a young guy who only got the job at the end of last year. Right? So you would think you want to get him as much live reps. against uh a real defense is possible, no?"
  },
  {
    "text" : "I probably just think he's gonna get hurt. Maybe. You're right though, as loser mentality. Yeah. Jim Rachel's not good enough to be skipping preseason reps.",
    "timestamp" : "37:59-38:09",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "38:09-38:15",
    "speaker" : "Andy",
    "text" : "No, nobody is. Except Tom Brady, who will refuse to skip fucking preseason reps because he's Tom Brady."
  },
  {
    "timestamp" : "38:16-38:16",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "38:16-38:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "But you know who is gonna be a beast this year too?",
    "timestamp" : "38:18-38:21"
  },
  {
    "speaker" : "Andy",
    "text" : "Who's that?",
    "timestamp" : "38:21-38:22"
  },
  {
    "speaker" : "Steve",
    "text" : "Kyle Duggar.",
    "timestamp" : "38:22-38:23"
  },
  {
    "text" : "Yeah. Yeah, you heard uh I think it was him that last year the one of the reporters during uh training camp asked him, like, so uh how'd you grade your season last season? He said C, C<unk>. Like geez, you were the only bright spot on that defense, C plus. Right. Here I was. No, this defense I think is gonna be Like just I I don't think there's as many big name signings that you'd see on here as you would. Oh Jesus, somebody's down. Uh as you would um Like on on the offense, like the big splash they made on offense, you know, with their first round pick and the the two tight ends and all that. And Cam Newton, obviously. But this defense, like bringing back Kyle Van Nooy, I think is a huge deal. I think bringing back um Dante Hightower, another huge deal.",
    "timestamp" : "38:23-39:16",
    "speaker" : "Andy"
  },
  {
    "text" : "But they're like known quantities at this point, you know. So I'm less excited for them because I'm just assuming they're going to be as good as they were.",
    "speaker" : "Steve",
    "timestamp" : "39:18-39:24"
  },
  {
    "speaker" : "Andy",
    "text" : "Well right, you're right, right, right. That's what I'm saying though.",
    "timestamp" : "39:24-39:26"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "39:27-39:33",
    "text" : "Whereas, you know, uh Duggar knows the committee."
  },
  {
    "speaker" : "Andy",
    "text" : "Well, I mean we saw we saw what he could do last year, just kind of all by himself, right? Judon's gonna be a beast. Judon, yeah. Judon has already shown what he's gonna be and it's early.",
    "timestamp" : "39:34-39:44"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, super excited for him.",
    "timestamp" : "39:44-39:46"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "39:47-39:47"
  },
  {
    "text" : "And then up front, I really want to see Christian Barnbower title. I don't even think he's played played in the preseason yet",
    "timestamp" : "39:48-39:55",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "39:55-40:06",
    "speaker" : "Andy",
    "text" : "Uh yeah, I don't know if he's playing this because we've got this game on mute in the background. Um I thought I saw a shot of him warming up beforehand, so my guess is he may have been out there, but I don't know. We'll probably have to."
  },
  {
    "text" : "It's always tough to tell the fat boys.",
    "timestamp" : "40:06-40:08",
    "speaker" : "Steve"
  },
  {
    "text" : "Right, yeah, yeah. Cause that's the thing. I still don't like completely recognize the number because half the guys have changed their number and half of them are just new because there's so many new people on this team, even from last year.",
    "timestamp" : "40:08-40:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I like the single digit linebacker numbers too. Very confusing.",
    "timestamp" : "40:20-40:24"
  },
  {
    "speaker" : "Andy",
    "text" : "I I I haven't gotten ready for it yet. I haven't I haven't been able to get Well you you haven't been watching college which is where it's like Right Right Yeah Yeah I'm not a big college guy so",
    "timestamp" : "40:24-40:33"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:34-40:38",
    "text" : "Yeah, I know, but you went and you failed that after a semester, Andy. We remember."
  },
  {
    "timestamp" : "40:38-41:12",
    "speaker" : "Andy",
    "text" : "Yeah, yeah. But then I did it again and I eventually, you know, seven-year plan. Got through it, no big deal. But oh, oh, who is this? Who's this joining us? No, his audio's not working. So close. I was so excited. We got the headphones on, the mic's on. Yeah, right. We can see him. We can definitely hear us because he's flipping us the bird. Yeah. We just can't hear him. The best of both worlds. It's still nothing. Oh man."
  },
  {
    "timestamp" : "41:13-41:24",
    "speaker" : "Steve",
    "text" : "Oh, he's so frustrated. Yeah. When Greg gets off frustrated too, he acts like such a little bitch. There's no cheering him up. He's just, no, no. Stupid."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:26-41:39",
    "text" : "I like that he's persevering. I I uh it's very it's very do your job, very patriotesque of him. Um in the meantime, while he's figuring that out, uh I will announce that I have purchased Belichick. win."
  },
  {
    "timestamp" : "41:39-41:39",
    "speaker" : "Steve",
    "text" : "Oh, good."
  },
  {
    "timestamp" : "41:40-41:43",
    "speaker" : "Andy",
    "text" : "So that will be uh redirected to thepats. win."
  },
  {
    "text" : "Uh so the pats. win or just bellcheck. win.",
    "speaker" : "Steve",
    "timestamp" : "41:43-41:46"
  },
  {
    "text" : "Yep, yep. Either one will work.",
    "timestamp" : "41:46-41:48",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "41:48-41:54",
    "speaker" : "Steve",
    "text" : "Uh and the site is just, are you like curating Homer content or are you creating all of your Homerism content?"
  },
  {
    "timestamp" : "41:54-42:13",
    "text" : "I think I'm going to create my Homerism. It's it's a it's a it's a brand that I think uh can't really be curated. You know what I mean? Like nobody else can can give you the homerism that I will. The the fair and balanced homerism that you'll get from Annie Brown.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "42:15-42:19",
    "text" : "And this Homerism, how how much can I expect?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh it will be sporadic, I think. Um it will probably be more reactionary than anything, is gonna be my guess.",
    "timestamp" : "42:20-42:29"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "42:29-42:32",
    "text" : "Um just pure Homerism."
  },
  {
    "text" : "I don't even like it. Yeah, I think I'm gonna first I'm gonna start um at least before the season starts, just writing up uh about my favorite players. So there's a there's one post so far on there and it's all about Julian Edelman and how great he was in his uh first ever playoff game, which was the blowout against the Ravens.",
    "timestamp" : "42:32-42:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "The blowout?",
    "timestamp" : "42:54-42:54"
  },
  {
    "text" : "The blowout against the Ravens.",
    "timestamp" : "42:55-42:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "42:57-42:59",
    "text" : "They lost the when they lost the Ravens?"
  },
  {
    "speaker" : "Andy",
    "text" : "Like badly, in like 2011. When Ray Rice ran for 80 yards, first play the game.",
    "timestamp" : "42:59-43:04"
  },
  {
    "text" : "Yeah, I remember that game. That game was tough.",
    "speaker" : "Steve",
    "timestamp" : "43:04-43:06"
  },
  {
    "text" : "Yeah. You know who the only bright spot in that game was? Julian Edelman. Fucking killing it. Scored two touchdowns.",
    "speaker" : "Andy",
    "timestamp" : "43:06-43:13"
  },
  {
    "text" : "So you went deep into a game where we got the shit kicked out of us.",
    "speaker" : "Steve",
    "timestamp" : "43:14-43:17"
  },
  {
    "speaker" : "Andy",
    "text" : "All right, pull it. Yeah. And put a positive spin on it",
    "timestamp" : "43:17-43:21"
  },
  {
    "text" : "Yeah, that is some homerism.",
    "timestamp" : "43:22-43:23",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:24-43:27",
    "text" : "Like I said, it's it's it's a type of homerism that I don't think can be outsourced."
  },
  {
    "timestamp" : "43:27-43:33",
    "speaker" : "Steve",
    "text" : "See, that's the homerism I can get behind. Your other homerism that's just stupid. I don't know if I can get behind that."
  },
  {
    "timestamp" : "43:33-43:34",
    "speaker" : "Andy",
    "text" : "Which homerism is that?"
  },
  {
    "speaker" : "Steve",
    "text" : "The rest.",
    "timestamp" : "43:35-43:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Which is predictions.",
    "timestamp" : "43:37-43:38"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:39-43:39",
    "text" : "All of it."
  },
  {
    "timestamp" : "43:40-43:41",
    "text" : "Well, predictions are fine though.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:41-43:45",
    "text" : "Well your your Patriots win the Super Bowl By 14 points."
  },
  {
    "timestamp" : "43:45-43:54",
    "text" : "Alright. Well, give me some fair and balance bullshit then, Steve. You're good at dishing it out, but you haven't actually given any takes your own that we can judge you on.",
    "speaker" : "Andy"
  },
  {
    "text" : "That's not what this is the episode's about, Andy.",
    "timestamp" : "43:54-43:57",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Hard disagree. Greg, thoughts. Wait, did I I think I may have heard you. Oh, hang on. So he's joining as Kelly Brown now, his wife.",
    "timestamp" : "43:57-44:12"
  },
  {
    "text" : "I think we should That's the podcast. Thanks for joining everybody.",
    "speaker" : "Steve",
    "timestamp" : "44:20-44:25"
  },
  {
    "speaker" : "Andy",
    "text" : "You gotta wait till he's connected. But I I I I feel like we should just start a podcast where we have technically illiterate people try to join the podcast and just see how long it takes. And then when they finally Greg. I think we I think we might be able to hear you Greg. Yes. So we can hear you. Eighth tries a charm. Nice of you to join us. You sound great.",
    "timestamp" : "44:25-44:49"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "44:50-44:50",
    "text" : "Number two."
  },
  {
    "text" : "You sound amazing.",
    "speaker" : "Andy",
    "timestamp" : "44:51-44:53"
  },
  {
    "timestamp" : "44:54-44:57",
    "speaker" : "Steve",
    "text" : "No microphone. Thanks for joining."
  },
  {
    "timestamp" : "44:58-45:00",
    "text" : "Is my audio terrible?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "45:00-45:02",
    "speaker" : "Steve",
    "text" : "Are you just talking to the computer mic?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. My mic as bad as I thought it would be. Yeah. I'm I'm getting tech support from Kelly right now. Also she's cooking dinner. That's uh has Mac Jones played any yet?",
    "timestamp" : "45:03-45:21"
  },
  {
    "text" : "No.",
    "timestamp" : "45:21-45:21",
    "speaker" : "Andy"
  },
  {
    "text" : "It's not good, so I didn't miss any.",
    "timestamp" : "45:22-45:23",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:24-45:30",
    "text" : "I mean you've missed Uh your week one starting quarterback showing why he should be. But other than that."
  },
  {
    "timestamp" : "45:31-45:36",
    "speaker" : "Greg",
    "text" : "I mean, we know we're getting with Cam, you know? Yeah. More interested in Mac."
  },
  {
    "timestamp" : "45:37-45:45",
    "speaker" : "Andy",
    "text" : "That's true. But I mean, like I was saying before, how much can you really tell with Mac Jones playing against the number two Eagles defense? Right?"
  },
  {
    "timestamp" : "45:45-45:46",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "45:47-45:51",
    "speaker" : "Andy",
    "text" : "Joe Flacco. Yeah. Has been playing this whole game."
  },
  {
    "text" : "Still kicking around, huh?",
    "speaker" : "Greg",
    "timestamp" : "45:51-45:53"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "45:53-45:54"
  },
  {
    "text" : "Thank you, Kelly.",
    "timestamp" : "45:54-45:55",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "45:56-45:59",
    "text" : "You think they have a quarterback controversy in Philly?",
    "speaker" : "Steve"
  },
  {
    "text" : "Like they say, if you've got two quarterbacks, you got no quarterbacks.",
    "timestamp" : "45:59-46:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "So Flacco's elite.",
    "timestamp" : "46:02-46:03"
  },
  {
    "timestamp" : "46:05-46:16",
    "speaker" : "Andy",
    "text" : "Was he? Yeah. You didn't know it, Andy. Is he though? You didn't know it? Wait, wait, wait. Hold on, hold on, hold on. I think I'm asking the wrong questions. Uh is Elite at what"
  },
  {
    "timestamp" : "46:17-46:25",
    "text" : "This is like who I forget whose quote this was. And then it's bringing thrown back in his face. It wasn't even Joe Flacco's quote, it was one of his teammates, and it's been thrown back in his face for years.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Who was it? I don't remember who I thought it was like a fucking cliff. What's his face? Uh Keller. Kellerman, yeah. Who uh I don't know if you saw the news. I call him Cliff Kellerman. Um I actually don't remember his first name. That's why I call him. Oh, that's right. Yeah. So, but did you hear that he has been released from first take? So uh his career actually lasted uh not as long as Tom Brady's. Yeah, I saw that. The guy calling for Tom Brady to fall off the cliff. Never did. Then fall off the cliff himself. Oh.",
    "timestamp" : "46:25-47:04"
  },
  {
    "speaker" : "Greg",
    "text" : "He sure did. Hell yeah. I'm ahead of you guys now. This is gonna make for great radio.",
    "timestamp" : "47:07-47:14"
  },
  {
    "timestamp" : "47:15-47:20",
    "speaker" : "Andy",
    "text" : "I had to back my my video up to keep up with Steve's illegal stream."
  },
  {
    "speaker" : "Greg",
    "text" : "Yep.",
    "timestamp" : "47:21-47:21"
  },
  {
    "speaker" : "Andy",
    "text" : "He's got the ghetto shit.",
    "timestamp" : "47:21-47:22"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:23-47:27",
    "text" : "I got the the spectrum going now. You're all fucked"
  },
  {
    "timestamp" : "47:29-47:40",
    "text" : "And now just because this is an audio medium and nobody can see you, Greg, but you have a the computer on your lap and there's a light directly behind you. So it's just a silhouette of you.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Which is sad because I know how grumpy your face looks right now. I just don't care how grumpy your face looks.",
    "timestamp" : "47:41-47:47"
  },
  {
    "timestamp" : "47:48-47:49",
    "speaker" : "Andy",
    "text" : "He sounds pretty calm."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "47:49-47:49"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:50-47:52",
    "text" : "I was grumpy for a second there. Yeah."
  },
  {
    "timestamp" : "47:53-47:57",
    "speaker" : "Andy",
    "text" : "But he did a little bit of meditation, you can see the deep breathing, and he's he's back."
  },
  {
    "timestamp" : "47:57-48:00",
    "speaker" : "Greg",
    "text" : "I was sad. I was disappointed and not mad."
  },
  {
    "speaker" : "Andy",
    "text" : "We were disappointed too to not be able to chat with our brother. But I was. I'm not gonna put any words to see.",
    "timestamp" : "48:00-48:05"
  },
  {
    "speaker" : "Steve",
    "text" : "Don't want me in with that.",
    "timestamp" : "48:05-48:07"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:09-48:18",
    "text" : "I think it's great to have you both here. It's been a while since the three of us have Chatted Patriots. So Greg, give me some uh give me some predictions."
  },
  {
    "timestamp" : "48:19-48:19",
    "text" : "Yeah, some hot takes.",
    "speaker" : "Steve"
  },
  {
    "text" : "I want to know I want to know how you think this season's gonna go.",
    "speaker" : "Andy",
    "timestamp" : "48:20-48:22"
  },
  {
    "timestamp" : "48:22-48:26",
    "speaker" : "Steve",
    "text" : "We can we can we can follow Andy's as well All right."
  },
  {
    "text" : "My hot take? Yep. Jacoby Myers leads the team in receptions and yards.",
    "timestamp" : "48:26-48:31",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "48:31-48:39",
    "speaker" : "Steve",
    "text" : "Oh, we actually talked about that. We didn't think that was a very hot take. Andy Andy even agreed to that one. And then he's like, oh actually I got a hot take out there. Uh John W."
  },
  {
    "timestamp" : "48:39-48:52",
    "text" : "Yeah, I thought it would be John the hot take would be uh somebody else being the the leader. But how about this? How about this? How about this? Take it a step further. No uh Jacoby Myers Top five wide receiver in the NFL.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I thought you were going to say offensive player of the year.",
    "timestamp" : "48:52-48:54"
  },
  {
    "timestamp" : "48:55-48:57",
    "speaker" : "Andy",
    "text" : "No, not offensive player of the year. That's Kim Down."
  },
  {
    "text" : "You said Judon for defensive. And you agree with me, you fucking idiot. I didn't agree with you. I just said that was the least of your hot takes because you had some fire.",
    "timestamp" : "48:57-49:07",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:07-49:10",
    "text" : "Not the that's the most of my hot takes."
  },
  {
    "text" : "Are we keeping Sony Michel? Is he making the opening day roster?",
    "timestamp" : "49:11-49:15",
    "speaker" : "Steve"
  },
  {
    "text" : "And or Nikhil Harry.",
    "timestamp" : "49:16-49:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I've heard Harry's playing well. And I think they need a receiver more than they need a running back, right? Yeah.",
    "timestamp" : "49:18-49:27"
  },
  {
    "text" : "Yeah, they have some sick running backs.",
    "speaker" : "Steve",
    "timestamp" : "49:28-49:29"
  },
  {
    "text" : "Yeah, we went through the list and uh and We went through the list. I'm like, oh, they're gonna keep everybody and then Steve's like, what about JJ Taylor?",
    "speaker" : "Andy",
    "timestamp" : "49:30-49:37"
  },
  {
    "timestamp" : "49:38-49:43",
    "speaker" : "Steve",
    "text" : "They got the ball inside the nine yard and they gave it to Harris twice and he scored a sweet touchdown. That's how they started the game."
  },
  {
    "timestamp" : "49:44-49:54",
    "speaker" : "Greg",
    "text" : "Hmm, he looks promising. Yeah. Sony, yay, nay. I say yay. They seem to like him. They do for some reason."
  },
  {
    "text" : "I get it. He's good when he's on the field. He just doesn't s stay on the field a lot.",
    "timestamp" : "49:55-49:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "All right, what about Nikhil? Yeah, I think I think Nikhila has a better chance of making it than Sony. Okay.",
    "timestamp" : "50:03-50:11"
  },
  {
    "timestamp" : "50:12-50:26",
    "speaker" : "Steve",
    "text" : "Does Hunter Henry play the entire season without getting injured? Probably not. I mean Andy anything suck. Anything's that he has the same injury history as Who is that?"
  },
  {
    "speaker" : "Andy",
    "text" : "Amendola. No, I saw I said his injury history is overblown like Amandola's was when he came here. That's what it was.",
    "timestamp" : "50:26-50:34"
  },
  {
    "text" : "Injury history is exaggerated by the media. It's a conspiracy.",
    "timestamp" : "50:34-50:37",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "50:37-50:39",
    "speaker" : "Andy",
    "text" : "Yeah. You can read all about it."
  },
  {
    "speaker" : "Steve",
    "text" : "You can find out more on Belichick. win.",
    "timestamp" : "50:40-50:42"
  },
  {
    "text" : "Exactly. Exactly what I was gonna say. Thanks, Steve. Way to plug it, baby. Did you hear about this, Greg? Did you catch the part where I'm building a uh a Pat's positive website to counterbalance all the negativity?",
    "timestamp" : "50:42-50:58",
    "speaker" : "Andy"
  },
  {
    "text" : "No, that's just a historical tracking website. Oh, so this is gonna be like hot takes and like opinions and stuff? Yeah, it's just gonna be a m a more positive spin on the the news of the day. But only positive. Oh boy, wait till you see this play, fellas. You guys better unzip.",
    "speaker" : "Greg",
    "timestamp" : "50:59-51:16"
  },
  {
    "timestamp" : "51:18-51:18",
    "speaker" : "Andy",
    "text" : "Really?"
  },
  {
    "timestamp" : "51:18-51:19",
    "speaker" : "Steve",
    "text" : "Oh yeah."
  },
  {
    "timestamp" : "51:19-51:20",
    "speaker" : "Andy",
    "text" : "It was an incompletion over the middle."
  },
  {
    "speaker" : "Steve",
    "text" : "Almost a pick.",
    "timestamp" : "51:21-51:22"
  },
  {
    "text" : "That was just a good defensive play. It was the right. Oh, maybe not. Yeah. Well, I mean, it was a diving deflection. Yeah. It was a good defensive play. Stick it with it. As a as a um a member of Patriots. win, uh no, sorry, thepats. win. Wrong website. Uh as a as a media member, I'm going to say Oh, okay.",
    "timestamp" : "51:26-51:51",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:52-51:54",
    "speaker" : "Steve",
    "text" : "You talking the Mac Jones and Nikhil Harry play, guy?"
  },
  {
    "text" : "Uh-huh. Oh. Is that what you want to see a lot of this year?",
    "speaker" : "Andy",
    "timestamp" : "51:54-51:57"
  },
  {
    "text" : "Oh yeah.",
    "timestamp" : "51:57-51:57",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "51:58-51:59",
    "speaker" : "Andy",
    "text" : "I want to see it all."
  },
  {
    "text" : "Nikhil Harry. I would like to see Harry do well though. I do too. Me too. Just because he gets from people.",
    "speaker" : "Greg",
    "timestamp" : "51:59-52:06"
  },
  {
    "text" : "Yeah. Talking to that guy from Arizona that said he was awesome and loved him.",
    "timestamp" : "52:06-52:11",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, that's right. The uh yeah, the Cardinals fan. Yeah, I remember that.",
    "timestamp" : "52:11-52:16",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That episode what 2004 week three or something?",
    "timestamp" : "52:17-52:20"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, maybe yeah, two or three. Yeah, it was early. Yeah, if you want to hear more about Arizona fans, go back and uh listen to the the Cardinals episode of this season a few episodes ago. So",
    "timestamp" : "52:21-52:31"
  },
  {
    "timestamp" : "52:32-52:35",
    "speaker" : "Steve",
    "text" : "Well, Mac Jones look a little scrambling. Oh boy."
  },
  {
    "timestamp" : "52:35-52:42",
    "speaker" : "Greg",
    "text" : "All right. Hot take uh JC Jackson all pro. Really? See, I disagree."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "52:42-52:49",
    "text" : "Stephon Jackson. How long do you think it is Steph on the team and and if so, for how many years is his contract?"
  },
  {
    "timestamp" : "52:53-52:55",
    "speaker" : "Andy",
    "text" : "I'd say he's thinking deeply, but he's just eating."
  },
  {
    "timestamp" : "52:57-53:02",
    "speaker" : "Greg",
    "text" : "Kelly asked. Kelly just said, what are you, bar stool now? And I was like, come on. What? Kelly."
  },
  {
    "text" : "How are we bar stool?",
    "timestamp" : "53:02-53:03",
    "speaker" : "Andy"
  },
  {
    "text" : "Because we're making hot takes.",
    "speaker" : "Greg",
    "timestamp" : "53:03-53:05"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And she never listened to literally any Patriots podcasts.",
    "timestamp" : "53:05-53:09"
  },
  {
    "timestamp" : "53:09-53:18",
    "speaker" : "Greg",
    "text" : "That's all they are now. I think she associates it with part of my take. Is that correct, Kelly? We just listened to a lot of that on uh our taking creative feedback from Kelly."
  },
  {
    "speaker" : "Steve",
    "text" : "Okay.",
    "timestamp" : "53:20-53:20"
  },
  {
    "timestamp" : "53:22-53:26",
    "speaker" : "Greg",
    "text" : "Just just making sure that we're we're clear on what's happening here. This is our target demo."
  },
  {
    "speaker" : "Andy",
    "text" : "Part of my take doesn't eat while they're while they record. So we we've got that on them.",
    "timestamp" : "53:30-53:35"
  },
  {
    "text" : "Yeah, and they have better technology. Far less professional. Much less professional.",
    "speaker" : "Greg",
    "timestamp" : "53:35-53:40"
  },
  {
    "text" : "Yeah. We we take amateur podcasts to heart.",
    "timestamp" : "53:42-53:45",
    "speaker" : "Andy"
  },
  {
    "text" : "And a busy day, fellas. Going to the uh outer banks this weekend. Okay.",
    "timestamp" : "53:47-53:51",
    "speaker" : "Greg"
  },
  {
    "text" : "That's great. I'm sure our listeners are thrilled to hear it.",
    "timestamp" : "53:53-53:55",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "53:55-54:05",
    "speaker" : "Greg",
    "text" : "Yeah, if anybody is ever visits North Carolina, the Outer Banks, it's a spot to be. The in the television show. Have you seen it, Andy?"
  },
  {
    "speaker" : "Andy",
    "text" : "No, I've heard of it though. Is it like one of those uh like a reality TV show, right?",
    "timestamp" : "54:06-54:12"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "54:12-54:42",
    "text" : "No, it's it's it's scripted, but it's like um Oh, it's like the OC? Yes, it's like the a current version of like a f like a yeah, like a a a scripted reality show. Like the Kardashians, that sort of thing? No, no. Oh, okay. No, it's it's completely scripted, but it's like a bunch of like sixty well, they're supposed to be sixteen, like horned up, banging each other. with like a veiled like story about drama in it. Okay."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "54:42-54:42"
  },
  {
    "timestamp" : "54:43-54:47",
    "speaker" : "Greg",
    "text" : "And the actors are actually like 25. Right, right. Yeah. Playing high school kids."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:47-54:49",
    "text" : "Yeah. Like Like One Tree Hill back in the year."
  },
  {
    "speaker" : "Greg",
    "text" : "Yes, One Tree Hill. That's that's the thing I was looking for.",
    "timestamp" : "54:49-54:51"
  },
  {
    "text" : "That's what I've actually been re-watching that lately. Yeah. It's a show that like uh my wife and I Uh she was watching it when we first started dating, so we like we watched together for a bit. Um And actually that song I forgot to mention on the last episode, the intro song to that was the intro song to the previous game last last uh last week. Interesting.",
    "timestamp" : "54:52-55:13",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "55:17-55:20",
    "text" : "Yeah, I mean it's probably around the same timeframe as it was."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "55:21-55:39",
    "text" : "That show started in 2003, which is why uh And so 2004 was their their heyday. Who is your favorite character, Andy? Um, I gotta say Brooke is definitely my favorite character. Is he the bad boy? Uh she. Oh she's the the rich girl, yeah. She's fucking hysterical."
  },
  {
    "speaker" : "Greg",
    "text" : "I just remember the bad boy, Cambridge town, right?",
    "timestamp" : "55:40-55:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh yeah, yeah. And then it turned out he was the uh the brother of the the badass basketball player, like the guy who's supposed to be going. Yeah, whose dad was a huge dickhead. Yeah. Yeah. Great show.",
    "timestamp" : "55:44-55:58"
  },
  {
    "timestamp" : "55:59-56:02",
    "text" : "You see that from Andre Steverson. That was pretty cool.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:02-56:02",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:03-56:05",
    "text" : "He is Laguerre Blunt. He's got the Laguerre Blunt hair."
  },
  {
    "text" : "Speaking of football.",
    "speaker" : "Andy",
    "timestamp" : "56:06-56:07"
  },
  {
    "speaker" : "Steve",
    "text" : "He got the same hair. Same build.",
    "timestamp" : "56:07-56:11"
  },
  {
    "timestamp" : "56:12-56:13",
    "text" : "Yeah, same running style.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yep.",
    "timestamp" : "56:14-56:14",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "56:14-56:19",
    "text" : "But yeah, I think Ramonde Ramondre Stevenson. Hard to say.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:20-56:24",
    "text" : "But I think uh not keeping Sony because they got him as the backup.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "There's just so many. There's seven running backs on this team right now. But maybe.",
    "timestamp" : "56:25-56:31"
  },
  {
    "text" : "All right, Greg. Other questions for you. Oh well he didn't answer the uh Stefan Gilmore. What about him? Does he stay on this year? And if so, how long how many years is his contract?",
    "timestamp" : "56:31-56:42",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "56:42-56:44",
    "text" : "I think he stays one more year here.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:45-56:52",
    "text" : "Just one so you think they only give him a one-year contract? Yeah. You don't think it'll be like a two or three year betraydom after the season?"
  },
  {
    "text" : "Hmm. I'm not gonna sign up for that take, but I will sign up for that. I think he's got one more year here. He wants more money than the Pats are willing to pay him, but That's probably as far as like a JC Jackson gap year. I think he's gonna have a tougher time getting out of town than just being like, all right, I'll play one more year here and then I'm getting real money. Yeah. Yeah, I could see that.",
    "speaker" : "Greg",
    "timestamp" : "56:52-57:14"
  },
  {
    "speaker" : "Andy",
    "text" : "I think uh similar to Revis, where we're like, Yeah, that's that's kind of what I was trying to get at with the the two year deal where it's like A second year that's like ridiculous that they never intend on actually paying and just get rid of them. Like it's just a one-year rental sort of deal.",
    "timestamp" : "57:14-57:34"
  },
  {
    "timestamp" : "57:34-57:44",
    "speaker" : "Greg",
    "text" : "Yep. And he's been great for what what we expected from him, right? I think he's kind of served his duty. Absolutely."
  },
  {
    "timestamp" : "57:44-57:47",
    "speaker" : "Steve",
    "text" : "So I just don't know if I believe in JC as the air apparent."
  },
  {
    "text" : "Dude, number what what do you get? Number 46 on the top 100?",
    "speaker" : "Greg",
    "timestamp" : "57:47-57:52"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "57:52-57:56",
    "text" : "I just like last year when he was pressed in the number one duty, he did not play that great, I felt."
  },
  {
    "text" : "The the his peers disagree, Steve. He gets a lot of interceptions as well.",
    "speaker" : "Greg",
    "timestamp" : "57:57-58:03"
  },
  {
    "text" : "His stats are sweet.",
    "speaker" : "Steve",
    "timestamp" : "58:03-58:04"
  },
  {
    "timestamp" : "58:04-58:14",
    "text" : "Yeah, but they're they're the NFL players, you know, like I could they play against just being yeah, the media just being like, okay, yeah. You know, but you you expect the NFL players to have a lot of people.",
    "speaker" : "Greg"
  },
  {
    "text" : "These are I'm my my opinions are my own, okay, Greg? I don't get influenced by the media. I'm not a goddamn cheap.",
    "speaker" : "Steve",
    "timestamp" : "58:14-58:19"
  },
  {
    "timestamp" : "58:19-58:23",
    "speaker" : "Greg",
    "text" : "I just know. I listen to that shit not cares."
  },
  {
    "text" : "Hey, I am the media. That's a conspiracy. That's we could we can do conspiracy and children.",
    "speaker" : "Steve",
    "timestamp" : "58:26-58:37"
  },
  {
    "speaker" : "Andy",
    "text" : "I think we'll do a conspiracy section. I feel like that that bodes well.",
    "timestamp" : "58:37-58:42"
  },
  {
    "timestamp" : "58:43-58:45",
    "text" : "It better be a lot of slander against Goodell.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "58:46-59:16",
    "speaker" : "Andy",
    "text" : "I mean I think that's what the conspiracy section of the website will be. Oh yeah. Well I mean here's one. I'll write this uh I'll write this up for when this comes out, but I think um conspiracy theory number one The NFL conspired to keep the Patriots out of the playoffs by forcing them to go to Kansas City when they shouldn't have last season. And that ruined their entire season. Um because they didn't want Beljack to succeed. They wanted the NFC to succeed this year."
  },
  {
    "text" : "You can ask the at patch. Remember you had all those all those instances of them changing the rules to hurt the Patriots?",
    "timestamp" : "59:17-59:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:25-59:33",
    "text" : "Yeah, right, yeah. Share rights itself. I mean I'll I'll I'll flush that one out a little bit, but yeah."
  },
  {
    "text" : "Just to give some background here, we got a text midweek this week that Andy said he's back in on football because he stopped watching last year because of the Kansas City debacle. And I was like, what? Yeah, I said the same thing. I didn't even know what he was talking about.",
    "timestamp" : "59:33-59:48",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "59:48-59:56",
    "speaker" : "Steve",
    "text" : "You mean uh Brian Hoyer's brain farts? No, I I I talked about this- I thought he meant because Hoyer had a couple of dumb dumb plays in that game."
  },
  {
    "speaker" : "Andy",
    "text" : "I talked about this like when it happened on this podcast. about how I was giving up on the season and giving them a a free pass and I wasn't going to be continuing to watch it because the NFL had given up on the idea of competitive Balance. That's right that game and then forcing them to play the game after that against Denver when they hadn't practiced at all for two weeks. So going into a game completely cold having not practiced. Because Belichick decided to put the health of his players over the health of the NFL's paycheck.",
    "timestamp" : "59:56-01:00:24"
  },
  {
    "text" : "Read more on Belichick.",
    "speaker" : "Steve",
    "timestamp" : "01:00:25-01:00:27"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:00:27-01:00:43",
    "text" : "win. Or it was just COVID and they wanted to make money and not cancel games. You ever think about that? That's what I'm saying. So they so they they put they put the health of their their paycheck over the health of the players. It's so it's just it's just a coincidence that it was the Patriots that got you all"
  },
  {
    "text" : "You're gonna have a whole section dedicated to Ted Wells too, Andy. You can dig into his background.",
    "timestamp" : "01:00:43-01:00:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:00:48-01:00:52",
    "text" : "I wonder how much it would cost to hire a private investigator.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Ooh. On Ted Wells? Okay. Yeah. I'm an investigator. Are you? It's true. It's literally in my title. Really? Seriously",
    "timestamp" : "01:00:52-01:01:04"
  },
  {
    "timestamp" : "01:01:05-01:01:07",
    "speaker" : "Steve",
    "text" : "Ball hair investigator."
  },
  {
    "text" : "Then why Team Lee Complaint Investigation Lab. Oh, you investigate complaints.",
    "speaker" : "Greg",
    "timestamp" : "01:01:07-01:01:12"
  },
  {
    "text" : "Mm-hmm. Have you have you had to investigate us? I feel like this should be a lot of complaints.",
    "speaker" : "Andy",
    "timestamp" : "01:01:12-01:01:17"
  },
  {
    "timestamp" : "01:01:17-01:01:24",
    "text" : "Yeah, you complain a lot, so and you don't ever fucking investigate it. What kind of brother are you? Yeah, I suck at my job. What do you want me to do?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:01:27-01:01:31",
    "speaker" : "Andy",
    "text" : "Fair enough. I can't argue with man."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:01:33-01:01:37",
    "text" : "All right, Greg, gimme the Patriots record first four games."
  },
  {
    "speaker" : "Greg",
    "text" : "Can you list who they're playing?",
    "timestamp" : "01:01:37-01:01:39"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh home against Miami Okay. At the Jets, home against the Saints, home against the Buccaneers.",
    "timestamp" : "01:01:39-01:01:46"
  },
  {
    "timestamp" : "01:01:47-01:01:51",
    "speaker" : "Greg",
    "text" : "Two and two. Loss, win, win, loss."
  },
  {
    "text" : "Loss, win, win. You think we lose to Miami to start? At home?",
    "timestamp" : "01:01:51-01:01:55",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:01:55-01:01:56",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "See how they get home and they win.",
    "timestamp" : "01:01:56-01:01:57"
  },
  {
    "timestamp" : "01:01:57-01:02:13",
    "speaker" : "Greg",
    "text" : "They're a good team. That's true. But yeah, I mean Although Tua, I think, could Like if we were gonna talk cliffs here. Boy's a wild card. He yeah, I he could go either way, but my my gut kind of tells me he's gonna be a bust."
  },
  {
    "speaker" : "Andy",
    "text" : "Really? Yeah.",
    "timestamp" : "01:02:13-01:02:14"
  },
  {
    "timestamp" : "01:02:14-01:02:34",
    "speaker" : "Greg",
    "text" : "Yeah. I'm with Greg on this one. You can kind of tell with quarterbacks like early on whether they kind of have that it factor where like even if they're losing or playing poorly, there's some throws where you're like, okay. Yeah, I see. For him, I was like, nothing ever jumped off. He was like a game manager and really wasn't even wasn't even"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:02:36-01:02:42",
    "text" : "I think they also kind of fucked it up when Fitz Magic was playing pretty well and they pulled him for two uh that's what I was gonna say."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:02:42-01:02:42"
  },
  {
    "text" : "He's come out and said that. That was he thought that was crazy.",
    "speaker" : "Steve",
    "timestamp" : "01:02:42-01:02:45"
  },
  {
    "text" : "Right. And and do you think that that ruined his um? It's confidence.",
    "timestamp" : "01:02:45-01:02:52",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:52-01:03:00",
    "speaker" : "Steve",
    "text" : "I don't know. But either way, I don't know what's what's crazier. Going with Tua or going with Ryan Fitzpatrick as a starting quarterback here in 2021."
  },
  {
    "timestamp" : "01:03:01-01:03:50",
    "speaker" : "Andy",
    "text" : "No, Ryan Fitzpatrick's great. Oh, he's great. Yeah. I I think he gives you a chance to win any game. I think Ryan Fitzpatrick, uh, higher ceiling, much lower floor. So would you rather have Fitzpatrick than Tua? Uh depends on how your feeling is on um risk aversion. If you're risk-averse, you take Tua, because he has a higher floor, but maybe a lower ceiling. I don't I don't think you see a four, five, six interception game from Tua. Fitzpatrick, that could be any game. He could also throw that many touchdowns, but you know, you never know which guy you're gonna get week to week, which is fine."
  },
  {
    "speaker" : "Steve",
    "text" : "Well, you know which chest tier you're gonna get, and that's gonna be glorious.",
    "timestamp" : "01:03:50-01:03:53"
  },
  {
    "text" : "Oh yeah, same with the beard.",
    "speaker" : "Andy",
    "timestamp" : "01:03:53-01:03:54"
  },
  {
    "speaker" : "Greg",
    "text" : "There's gonna be a lot of interesting quarterbacks this year.",
    "timestamp" : "01:03:54-01:03:58"
  },
  {
    "speaker" : "Andy",
    "text" : "You think?",
    "timestamp" : "01:03:58-01:03:59"
  },
  {
    "timestamp" : "01:03:59-01:04:09",
    "speaker" : "Greg",
    "text" : "Yeah, I mean a bunch of young guys. Sam Darnold's Saints No, week three Saints have a crazy quarterback situation."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:09-01:04:11",
    "text" : "Yeah, who's even who's gonna start on that Saints team?"
  },
  {
    "timestamp" : "01:04:12-01:04:13",
    "speaker" : "Greg",
    "text" : "Is it gonna be no yet?"
  },
  {
    "timestamp" : "01:04:13-01:04:19",
    "text" : "Is it gonna be it has to be Jameis, right? Oh Hill You really think it's gonna be Taysom Hill?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "There's a chance. Can he even throw the ball?",
    "timestamp" : "01:04:19-01:04:23"
  },
  {
    "text" : "Ish. I feel like he's a Cam Newton without an MVP. They love him though. They do, but I feel like He can throw the ball in spurts, but I don't think he's gonna beat you as a starting quarterback.",
    "speaker" : "Andy",
    "timestamp" : "01:04:23-01:04:34"
  },
  {
    "speaker" : "Steve",
    "text" : "I think he's But yeah, you think that Cam Newton is gonna take the pages to the Super Bowl and they're gonna win by fourteen.",
    "timestamp" : "01:04:34-01:04:39"
  },
  {
    "timestamp" : "01:04:39-01:04:42",
    "text" : "Yeah, I think Cam Newton's a better throw of the football.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:04:45-01:04:50",
    "text" : "Not based on what happened last year though. Andy's already discounted that whole year with a bunch of excuses earlier.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. They're not excuses, they're reasons. Call it what you want. Touchdown Patriots. Fuck you, Steven.",
    "timestamp" : "01:04:51-01:04:57"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, Rahmondre Stevenson.",
    "timestamp" : "01:04:57-01:04:59"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:59-01:05:05",
    "text" : "Yeah. Guess what? It wasn't a passing touchdown, so it doesn't count, I guess."
  },
  {
    "speaker" : "Steve",
    "text" : "You're the one saying preseason doesn't count, Andy, because we're so much better than their backups that's.",
    "timestamp" : "01:05:05-01:05:09"
  },
  {
    "text" : "We are. And I'm pro they're proving it now by fucking running up the score on this Philadelphia Eagles team. Well maybe they're just awesome.",
    "timestamp" : "01:05:09-01:05:15",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That was a sweet block by Jakob Johnson there.",
    "timestamp" : "01:05:15-01:05:17"
  },
  {
    "speaker" : "Greg",
    "text" : "Right. Yeah. The the two, you've probably heard this before, but the both teams that went winless. For a whole season, both went four-0 in the preseason. That's true. That's an awesome stat.",
    "timestamp" : "01:05:18-01:05:33"
  },
  {
    "text" : "Yeah, it's fantastic.",
    "speaker" : "Andy",
    "timestamp" : "01:05:33-01:05:34"
  },
  {
    "text" : "Both groups out how bogus. preseason football.",
    "timestamp" : "01:05:35-01:05:37",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:38-01:05:54",
    "text" : "Oh yeah. Yeah. Yeah. And and every and uh in the last preseason game, people were talking about why Belichick didn't challenge uh Jacoby Myers had a chance at a catch and they ruled it incomplete, even though it was obviously a catch. Like why did you challenge it? And Bella Belichick's answer was because I didn't want to."
  },
  {
    "speaker" : "Steve",
    "text" : "That's like they're calling timeouts at the end of the game.",
    "timestamp" : "01:05:57-01:05:59"
  },
  {
    "timestamp" : "01:06:00-01:06:32",
    "text" : "Exactly. It was it was literally because you wanted to see um He wanted to see his brand new quarterback uh attempt a third down pass is all it was after what he thought should have been a completion, you know? Like how does he handle that? That's that's all Bill Belichick used. This is just extended practice for Bill Belichick, just at full speed against a different team. Different games that you're gonna do. I have not. I don't have it's on HBO, right? It is. Yeah, I don't have HBO. Which team is it? Cowboys. Yeah. Have you watched it, Greg?",
    "speaker" : "Andy"
  },
  {
    "text" : "I yeah. I watch it every year.",
    "speaker" : "Greg",
    "timestamp" : "01:06:32-01:06:34"
  },
  {
    "speaker" : "Andy",
    "text" : "How is it?",
    "timestamp" : "01:06:34-01:06:35"
  },
  {
    "text" : "I mean pe it's it's not as entertaining as some of the previous years. Like the Rex Ryan year was just so entertaining. But I I just love the show, the premise. Even like bad years, I love it. I've never watched it. Really? I don't have HBO. Oh, dude. It's so good. Because it's just like, I don't know, it puts players in like I should just steal your login and put that to me for fucking a decade. Dude, Zeke Elliott is adorable. Is he? Oh There's one scene where he's like trying to wrap a present for Dak because they have similar birthdays. And like he's like never wrapped a present before. Oh boy. And he's like watching a YouTube video and he's like giggling to himself. And I he's just seems like such a nice guy. So it's things like that. You know, like I always kind of thought Zeke was like, eh, whatever. But now I'm like, you know what, Zeke seems like a pretty pretty awesome dude.",
    "timestamp" : "01:06:35-01:07:35",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:07:35-01:08:17",
    "speaker" : "Andy",
    "text" : "Didn't want to I don't know if this is from a show or if this is just like something I saw online, but Wasn't there one point where like, I don't know if it was a preseason game or like a practice where they had fans at it, but uh one of the offensive linemen put a Zeke jersey on? That was like cut off like above the belly and like ran out onto the field and everybody was cheering for him. And he was doing like the the feed me. design and everything. Everyone's like, oh it's sick. And they took the helmet off and like blatantly wasn't because an offensive lineman, like guts hanging over his sh jersey, over his over his pants, but he still like had the the crop top on. It's fantastic. It's my kind of comedy right there. Yeah. Physical physical comedy. It's my jam."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Um Will Fork was the best for that. I mean that, right, Steve? The Will Fork. I think Ron Arnox. Yeah, yeah. He was he's probably the best hard knocks character. Well he's top five that's ever been on the show. He was just electric from start to finish.",
    "timestamp" : "01:08:18-01:08:38"
  },
  {
    "speaker" : "Andy",
    "text" : "Give me a top five list, Greg.",
    "timestamp" : "01:08:39-01:08:41"
  },
  {
    "text" : "Uh Rex Ryan, without a doubt, is is on there. Uh Vince Will Fork.",
    "timestamp" : "01:08:41-01:08:48",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:08:48-01:08:49",
    "text" : "Yep. Ooh."
  },
  {
    "speaker" : "Greg",
    "text" : "You know, Tony Romo. I really this is yeah, before like I His reputation was the same thing where it's like, eh, he's can never win the big game. But y his charisma really came through when they did the Cowboys one. And then obviously now we know who he is.",
    "timestamp" : "01:08:51-01:09:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Right, right, right.",
    "timestamp" : "01:09:08-01:09:09"
  },
  {
    "text" : "And like that makes more sense. But he is he was one that I was like, oh wow, this guy's actually like, you know, pretty charming guy. Um I think James Harrison might have been on one. Oh yeah. Super scary. That was awesome.",
    "speaker" : "Greg",
    "timestamp" : "01:09:09-01:09:24"
  },
  {
    "text" : "Yeah, he's terrifying.",
    "timestamp" : "01:09:25-01:09:26",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "What happened? Timeo Brown last year was ridiculous.",
    "timestamp" : "01:09:26-01:09:29"
  },
  {
    "text" : "That was the only two I've ever seen. Antonio Brown and Vince Wilfork.",
    "timestamp" : "01:09:30-01:09:34",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:09:34-01:09:37",
    "text" : "Yeah, those are those are the clips everybody's seen.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "What what has to happen for the Patriots to do hard knocks? Because can't like they can they've been able to refuse it forever because they keep making the playoffs or something?",
    "timestamp" : "01:09:38-01:09:45"
  },
  {
    "text" : "I believe that's part of it, yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:09:45-01:09:47"
  },
  {
    "timestamp" : "01:09:47-01:09:51",
    "text" : "Yeah, I think you have to have like three losing seasons in a row or something.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:09:51-01:09:52",
    "text" : "To be eligible, yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:09:52-01:10:07",
    "speaker" : "Greg",
    "text" : "Or not make the playoffs or yeah, there's something like that, yeah. Yeah. And you Yeah, so the Patriots will never do it. It would be ridiculous if they did though. Hmm. It'd be interesting, right? What if it was like Belchek last year and he's like, all right, fuck it."
  },
  {
    "timestamp" : "01:10:08-01:10:28",
    "text" : "Here we go. The criteria has three simple prerequisites. Number one, no teams who were in the playoffs in the last two seasons. No teams with a first year head coach. No teams who have which have been featuring on hard knocks in the last ten years. Seems fair. I can't imagine that leaves you with a ton of teams.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:10:28-01:10:33",
    "text" : "Yeah, I think there's usually like six or something teams that like it could possibly be.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:10:33-01:10:34",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, weren't the Patriots eligible for this one?",
    "timestamp" : "01:10:34-01:10:37"
  },
  {
    "timestamp" : "01:10:38-01:10:41",
    "speaker" : "Andy",
    "text" : "No, because they've been in the playoffs in the past two years. They made the playoffs two years ago."
  },
  {
    "text" : "Oh, that past two years? Yeah. So if they miss the playoffs this year, they'd be eligible for next tired Knox. Yes.",
    "speaker" : "Steve",
    "timestamp" : "01:10:41-01:10:48"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:48-01:10:52",
    "text" : "Oh. So That that begs the question."
  },
  {
    "text" : "That's a good hot take. Do they make the playoffs? And it's got to go to the Super Bowl.",
    "timestamp" : "01:10:52-01:10:55",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Do you would you rather them miss the playoffs so you can see them on hard knocks or not? Would you rather them make the playoffs?",
    "timestamp" : "01:10:56-01:11:03"
  },
  {
    "text" : "Because I would pay first round buy or a first round exit.",
    "timestamp" : "01:11:03-01:11:07",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:07-01:11:11",
    "text" : "Right, yeah. Say say the say they make the wild card losing the wild card."
  },
  {
    "timestamp" : "01:11:11-01:11:11",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:11-01:11:16",
    "text" : "Or or are eligible to go on hard knocks and participate."
  },
  {
    "speaker" : "Steve",
    "text" : "Because you know if they're ever eligible, they're making them do it. I know.",
    "timestamp" : "01:11:17-01:11:21"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:21-01:11:27",
    "text" : "Yeah, because it would be the highest-rated hard knock show ever. I would buy HBO to watch that."
  },
  {
    "timestamp" : "01:11:27-01:11:30",
    "text" : "It'd probably be awful. I bet Belichick's wicked boring.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:11:30-01:11:31",
    "text" : "I bet he's not.",
    "speaker" : "Andy"
  },
  {
    "text" : "I bet he is.",
    "speaker" : "Greg",
    "timestamp" : "01:11:31-01:11:32"
  },
  {
    "text" : "No, they did that. They did a whole funny. They did it. And that's the frustrating part. Andy's such a goddamn homer. And then when it comes to Bill Belichick, he's like, no.",
    "timestamp" : "01:11:32-01:11:42",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:43-01:11:44",
    "text" : "What?"
  },
  {
    "text" : "Oh no, sorry, that's Greg.",
    "timestamp" : "01:11:44-01:11:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:11:46-01:11:46"
  },
  {
    "text" : "Oh yeah. I'm the one.",
    "speaker" : "Steve",
    "timestamp" : "01:11:46-01:11:47"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:48-01:11:54",
    "text" : "Yeah, no, I'm all about I because they did they didn't they do like a behind the scenes in 2009, remember?"
  },
  {
    "timestamp" : "01:11:54-01:11:54",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:11:54-01:12:28",
    "speaker" : "Andy",
    "text" : "And it was, yeah. I don't remember what exactly it was for. I don't know if it was like the pages that did it or or like what the reasoning was. But they did it and because that was with with Belichick he like sent a whole bunch of guys home because they like it was a snow day and they couldn't make it in in time. He's like, I just I just don't think I can reach this team. Because that was the the year of fourth and two and everything. Right. And I think that wasn't that the year that they got their doors blown off by uh By Baltimore, yeah, in the wild card. The one that I I did the write-up of Julian Elm on. It was that year. His rookie season. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Find out more on Delcheck. win. Read this Homer story from the fucking worst one of the worst playoff losses of the Patriots Dynasty.",
    "timestamp" : "01:12:28-01:12:36"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:12:36-01:12:40",
    "text" : "Right. Welcome. Actually could be a stand-up comedian if he wanted to be."
  },
  {
    "timestamp" : "01:12:40-01:12:50",
    "speaker" : "Andy",
    "text" : "I'm not thinking. No, it's just jokes are all football related. They're the same fucking ones every year, apparently. But I don't think he's the fucking Grouch everybody thinks he is."
  },
  {
    "timestamp" : "01:12:50-01:12:51",
    "text" : "I think he is.",
    "speaker" : "Greg"
  },
  {
    "text" : "I don't think he is.",
    "timestamp" : "01:12:51-01:12:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Like imagine. I think he got married too. Did you see that?",
    "timestamp" : "01:12:53-01:12:57"
  },
  {
    "text" : "Yeah. Did he?",
    "timestamp" : "01:12:57-01:12:58",
    "speaker" : "Andy"
  },
  {
    "text" : "Sneaky. Sneaky married.",
    "timestamp" : "01:12:58-01:13:01",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "How about that?",
    "timestamp" : "01:13:01-01:13:02"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:13:02-01:13:03"
  },
  {
    "speaker" : "Andy",
    "text" : "I did not see that.",
    "timestamp" : "01:13:03-01:13:05"
  },
  {
    "text" : "All right, Greg, the I'm dying to know what week does Mac Jones take his first start? Andy thinks week one.",
    "speaker" : "Steve",
    "timestamp" : "01:13:06-01:13:15"
  },
  {
    "speaker" : "Andy",
    "text" : "No. Wins a bottom. 2022. Yes, 2022.",
    "timestamp" : "01:13:16-01:13:20"
  },
  {
    "timestamp" : "01:13:20-01:13:24",
    "text" : "Maybe even not then. Maybe we do we resign Cam Andy and just roll him and keep back on the bench.",
    "speaker" : "Steve"
  },
  {
    "text" : "If you win the Super Bowl, yeah, fuck it.",
    "speaker" : "Andy",
    "timestamp" : "01:13:25-01:13:27"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, right? How you gonna bench the Super Bowl quarterback? Well I'm saying one but by fourteen points. What are you gonna against him? You gotta resign him, right?",
    "timestamp" : "01:13:27-01:13:35"
  },
  {
    "text" : "That's what I'm saying.",
    "timestamp" : "01:13:35-01:13:36",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:13:36-01:13:37",
    "speaker" : "Steve",
    "text" : "Trade Mac"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:38-01:13:41",
    "text" : "Yeah, and trading for uh I don't know wide receiver."
  },
  {
    "timestamp" : "01:13:42-01:13:44",
    "speaker" : "Greg",
    "text" : "When's the buy? Do we know?"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh good question. I don't know.",
    "timestamp" : "01:13:44-01:13:45"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:13:46-01:13:52",
    "text" : "I think it's late in the year. Aren't you stat checked boy Greg?"
  },
  {
    "text" : "Not today, buddy.",
    "speaker" : "Greg",
    "timestamp" : "01:13:52-01:13:54"
  },
  {
    "timestamp" : "01:13:55-01:13:57",
    "speaker" : "Steve",
    "text" : "Stat checks computer breaks."
  },
  {
    "text" : "Yeah, not the technology. I'm not touching anything.",
    "timestamp" : "01:13:58-01:14:01",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh Greg. Um God damn it. Fuck you, Rule",
    "timestamp" : "01:14:03-01:14:10"
  },
  {
    "speaker" : "Greg",
    "text" : "All right, I got uh I got a question. Who ends up being the most impactful rookie on the team? Impactful rookie.",
    "timestamp" : "01:14:10-01:14:19"
  },
  {
    "text" : "Uh Barramore.",
    "timestamp" : "01:14:22-01:14:23",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Are we doing a non-Mac Jones?",
    "timestamp" : "01:14:24-01:14:26"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:14:27-01:14:28",
    "text" : "No, you can have him in there."
  },
  {
    "timestamp" : "01:14:28-01:14:53",
    "speaker" : "Steve",
    "text" : "You can put him in there. I'm gonna put Mac Jones in there then. Yeah. I think he needs a shot this year. And plays well. Non-Mac Jones edition. I like Andy's pick of Barmore back. I think he's headed for a chance to be a Foxbro flu year though. I haven't even seen him yet. Or maybe they know he's so good they're just keeping him under wraps. That's an Andy take right there."
  },
  {
    "text" : "I'm rubbing up. Steve, would you like a a guest spot on uh Belichick dot win?",
    "timestamp" : "01:14:54-01:15:00",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:15:00-01:15:03",
    "speaker" : "Steve",
    "text" : "I'll write the Barmore article. I am an eye on him for sure."
  },
  {
    "timestamp" : "01:15:03-01:15:04",
    "text" : "See, there you go, yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:15:04-01:15:21",
    "text" : "Well, all they watched of college football last year was the playoffs. And uh the two things on either side of the ball were Mac Jones and Christian Parmore, and then we picked them one and two. True, yeah. That's cool. So these are one man wrecking crew in those two games.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:15:21-01:15:25",
    "text" : "Oh Andy, you must be in the same as me. I sure am."
  },
  {
    "timestamp" : "01:15:26-01:15:27",
    "text" : "Interception",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:15:27-01:15:27",
    "text" : "Yes."
  },
  {
    "speaker" : "Steve",
    "text" : "No, you're not.",
    "timestamp" : "01:15:29-01:15:30"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:15:31-01:15:32",
    "text" : "Oh, really?"
  },
  {
    "timestamp" : "01:15:32-01:15:32",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:15:33-01:15:40",
    "text" : "It's an interception I don't know, so I didn't see who defensed that pass, but Greg, you need to like pause it for about like 15 seconds.",
    "speaker" : "Andy"
  },
  {
    "text" : "It's cable. I can't pause cable.",
    "timestamp" : "01:15:40-01:15:42",
    "speaker" : "Steve"
  },
  {
    "text" : "No, it's Justin Bethel playing some solid corner, Andy.",
    "speaker" : "Greg",
    "timestamp" : "01:15:42-01:15:44"
  },
  {
    "text" : "Bullshit TV watching. Justin Baffle, how about live TV?",
    "speaker" : "Andy",
    "timestamp" : "01:15:45-01:15:50"
  },
  {
    "speaker" : "Greg",
    "text" : "Gotta come down with that.",
    "timestamp" : "01:15:51-01:15:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Doesn't have a Jesus. Greg Brown living in the fucking stone age. How about that?",
    "timestamp" : "01:15:52-01:15:57"
  },
  {
    "text" : "Bro, you don't even have a fucking DVR.",
    "speaker" : "Steve",
    "timestamp" : "01:15:57-01:16:00"
  },
  {
    "speaker" : "Andy",
    "text" : "Right?",
    "timestamp" : "01:16:00-01:16:01"
  },
  {
    "timestamp" : "01:16:02-01:16:10",
    "text" : "I don't know. Do you barely have your cable? I don't even have cable anymore. I took that away and that's why you have Spectrum now because you stop stealing mine.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, for so long. That's the only is the only way I could I like memorized your address because it was part of your password. 1055 staff or",
    "timestamp" : "01:16:10-01:16:22",
    "speaker" : "Greg"
  },
  {
    "text" : "I see what you're complaining about.",
    "speaker" : "Andy",
    "timestamp" : "01:16:26-01:16:28"
  },
  {
    "timestamp" : "01:16:28-01:16:30",
    "speaker" : "Greg",
    "text" : "No, yeah."
  },
  {
    "text" : "Doesn't look good though.",
    "timestamp" : "01:16:32-01:16:33",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "No. That looks like it hurt. Yeah, he's still down right now.",
    "timestamp" : "01:16:33-01:16:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:16:37-01:16:38",
    "text" : "Oh god."
  },
  {
    "speaker" : "Greg",
    "text" : "That looks like a wind knocked out of him though.",
    "timestamp" : "01:16:39-01:16:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:16:41-01:16:46",
    "text" : "I hope so, yeah. Yep."
  },
  {
    "speaker" : "Greg",
    "text" : "That's a good",
    "timestamp" : "01:16:46-01:16:47"
  },
  {
    "timestamp" : "01:16:48-01:16:49",
    "speaker" : "Andy",
    "text" : "It's gotta catch it."
  },
  {
    "timestamp" : "01:16:49-01:17:08",
    "text" : "See if I got one of your little camera adapters. Oh yeah? Uh-huh. Which one? Uh Zenvo X-E-N-V-O. Okay. And I'm my camera adapters. It was it was highly rated on Amazon. com. Oh",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh well that looked like it hurt.",
    "timestamp" : "01:17:09-01:17:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:17:11-01:17:12",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:17:12-01:17:15",
    "text" : "You hit that ground hard. All right."
  },
  {
    "text" : "Pretty suspicious uh reviews though. We should start doing that with Podcast is just suspicious reviews.",
    "speaker" : "Greg",
    "timestamp" : "01:17:15-01:17:20"
  },
  {
    "timestamp" : "01:17:20-01:17:31",
    "text" : "Yeah. New new hot take, new hot take, uh Nikila Harry IR. So uh he's not allowed to get traded. No, no way. Oh, you already put your hot tech down.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I wrote it down and you said no, he does not make it.",
    "timestamp" : "01:17:31-01:17:33"
  },
  {
    "text" : "I'm allowed to change my hot tags whenever I want. As as uh editor of Uh the paths. when. I'm allowed to do whatever I want. He's gonna cut this podcast up and remove your Yeah, yeah. I'm only going to do it at the end of the season. So anything that I say is correct stays. And everything that I say is wrong will will get cut I think that's how we're gonna do this.",
    "timestamp" : "01:17:34-01:17:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "See, I stand by my hot takes. Josh Allen, he's gonna suck again this year. Ryan Tannehill, not a good quarterback Dude, those tapes ice cold right now.",
    "timestamp" : "01:17:56-01:18:09"
  },
  {
    "text" : "Ice cold.",
    "timestamp" : "01:18:10-01:18:11",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, right now. When they come back, I'm gonna let you know.",
    "speaker" : "Steve",
    "timestamp" : "01:18:11-01:18:16"
  },
  {
    "text" : "Who regresses the most in the NFL?",
    "timestamp" : "01:18:24-01:18:27",
    "speaker" : "Greg"
  },
  {
    "text" : "Are we talking team or player?",
    "timestamp" : "01:18:27-01:18:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "player or team I like team too. How about this? We did a uh over under win total for every team. with my friends and we're gonna bet all the ones that we agree on. We're gonna parlay them together. It's only like four or five right now. Do you want you wanna throw your over-unders in there and we'll see? Got you ten bucks, we'll all pool it together.",
    "timestamp" : "01:18:30-01:18:56"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean we're gonna go through all the teams or just are you gonna fire through them?",
    "timestamp" : "01:18:57-01:19:01"
  },
  {
    "timestamp" : "01:19:02-01:19:08",
    "text" : "That's gonna be boring ass radio, but okay. Let's go. Nobody's yeah, nobody's listening to this at this point anyway.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:19:08-01:19:09",
    "speaker" : "Steve",
    "text" : "So the fuck?"
  },
  {
    "speaker" : "Andy",
    "text" : "Let's rocket. Give it to me.",
    "timestamp" : "01:19:09-01:19:11"
  },
  {
    "timestamp" : "01:19:11-01:19:21",
    "speaker" : "Steve",
    "text" : "Chiefs 12 and a half. Over. Yeah. Keep in mind there's no Buccaneers 12."
  },
  {
    "speaker" : "Greg",
    "text" : "Over. Oh. I think they have the biggest regression this year.",
    "timestamp" : "01:19:21-01:19:26"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:19:27-01:19:27",
    "text" : "Really?"
  },
  {
    "text" : "I I'm I'm sort of with you, Greg.",
    "speaker" : "Greg",
    "timestamp" : "01:19:27-01:19:29"
  },
  {
    "speaker" : "Andy",
    "text" : "I can't I can't do that. Uh Tom Brady's not gonna lose less than 12 games. Not with that offense.",
    "timestamp" : "01:19:29-01:19:34"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:19:34-01:19:37",
    "text" : "I mean, is that offense that good?"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:19:37-01:19:37"
  },
  {
    "speaker" : "Steve",
    "text" : "Ravens. Ravens 11. Under. See, everyone's got the under there. Well, actually, Trevor wrote Suck Me Off, which I'm assuming means under.",
    "timestamp" : "01:19:37-01:19:48"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. We'll ask him next time we have him on the pod. Yeah.",
    "timestamp" : "01:19:49-01:19:53"
  },
  {
    "text" : "We should just let's see uh let's actually see what he said about the Lions. The Lions are second to last at four and a half. Trevor says under. Over. Wow.",
    "timestamp" : "01:19:53-01:20:02",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I think I went more than that. Over. Actually no, because I got that fucking hardo as as uh As a coach.",
    "timestamp" : "01:20:02-01:20:09"
  },
  {
    "text" : "Bite your kneecaps off.",
    "timestamp" : "01:20:10-01:20:11",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, under. I chain it under. Definitely under.",
    "timestamp" : "01:20:11-01:20:14"
  },
  {
    "timestamp" : "01:20:14-01:20:17",
    "text" : "Dude, their wide receiving core is like hilarious too.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, they don't have anybody, right?",
    "timestamp" : "01:20:17-01:20:19"
  },
  {
    "timestamp" : "01:20:19-01:20:20",
    "speaker" : "Greg",
    "text" : "They got Jared Goff, baby."
  },
  {
    "text" : "You don't know about Quintet Citas? Come on, dude.",
    "timestamp" : "01:20:26-01:20:28",
    "speaker" : "Steve"
  },
  {
    "text" : "Plus you just saw Bill from Jacoby.",
    "timestamp" : "01:20:30-01:20:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Bill's eleven.",
    "timestamp" : "01:20:35-01:20:36"
  },
  {
    "timestamp" : "01:20:37-01:20:37",
    "speaker" : "Andy",
    "text" : "Bill's old."
  },
  {
    "speaker" : "Greg",
    "text" : "This is my biggest regression. I'm going Bill's under.",
    "timestamp" : "01:20:38-01:20:40"
  },
  {
    "timestamp" : "01:20:41-01:20:45",
    "text" : "Bill's under. I had that as well, but I was the only one. Everyone else had overgrick.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:20:45-01:20:49",
    "speaker" : "Greg",
    "text" : "I'm giving Josh Allen, I think, had the the Jared Goff year."
  },
  {
    "timestamp" : "01:20:49-01:20:49",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Where you like all of a sudden had like this huge jump in numbers. That doesn't really make sense. I'm sorry.",
    "timestamp" : "01:20:49-01:20:57",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Are you on Steve Brown's uh hot take train? Yes Josh Allen's not a good quarterback.",
    "timestamp" : "01:20:57-01:21:01"
  },
  {
    "speaker" : "Greg",
    "text" : "I think Josh Allen's overrated at this point. Wow.",
    "timestamp" : "01:21:05-01:21:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "01:21:09-01:21:09"
  },
  {
    "text" : "Because you just don't see that happen a lot where like his accuracy numbers went up like eleven percent last year. I mean he got digs in. That's literally what it was. That was a great one. People figure that out, you know? Yeah. And he just doesn't strike me as Mr. Accuracy. He's got a canon, obviously, but I feel like teams can figure him out. Um Rams at ten and a half over. Really? I think that Stafford lights the world on fire in that offense. Under. Mostly under.",
    "speaker" : "Greg",
    "timestamp" : "01:21:10-01:21:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:42-01:21:43",
    "text" : "There's one over there."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:21:44-01:21:45",
    "text" : "Stafford Andy?"
  },
  {
    "text" : "Not feeling messy.",
    "speaker" : "Andy",
    "timestamp" : "01:21:45-01:21:45"
  },
  {
    "timestamp" : "01:21:46-01:21:51",
    "text" : "Alright, this is one we can come back and loop around on then because I feel pretty strongly that Stafford is gonna be ridiculous.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:21:52-01:22:00",
    "text" : "I think they're I think Stafford's gonna do well. I just think the Rams have spent a bunch of money on shit that they don't even they're paying players who don't even play for them. Early golf."
  },
  {
    "text" : "I think they're like an injury or two away from that team just falling the fuck apart.",
    "timestamp" : "01:22:02-01:22:04",
    "speaker" : "Andy"
  },
  {
    "text" : "But the offense is stacked, right?",
    "speaker" : "Greg",
    "timestamp" : "01:22:06-01:22:08"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:22:10-01:22:11",
    "text" : "But again, they're one or two injuries falling apart."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, look how look how they struggle when Cooper Cup got hurt last year.",
    "timestamp" : "01:22:13-01:22:16"
  },
  {
    "timestamp" : "01:22:17-01:22:22",
    "speaker" : "Steve",
    "text" : "Yeah, but injury. Niners ten and a half as well."
  },
  {
    "text" : "This one's tricky. Yeah, I don't know. Uh I think I mean their their roster is good enough, but that quarterback is such a question mark.",
    "speaker" : "Greg",
    "timestamp" : "01:22:22-01:22:32"
  },
  {
    "timestamp" : "01:22:33-01:22:36",
    "speaker" : "Andy",
    "text" : "Yeah, I I'll go over just because I want to see him do well."
  },
  {
    "timestamp" : "01:22:36-01:22:37",
    "text" : "Craig.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:22:37-01:22:46",
    "speaker" : "Andy",
    "text" : "I go under just to be different than it. Only because uh there's an extra game this year. I think it'll be like 11 wins."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:22:46-01:22:53",
    "text" : "See, I thought under. Everybody. That was one of the ones we all agreed on. We all had unders. And only Andy's got the over."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:22:54-01:22:56",
    "text" : "Yeah, don't talk to me at the end of the season, boys."
  },
  {
    "speaker" : "Steve",
    "text" : "All right, Cleveland Browns, ten and a half over. Wow, strong over for me.",
    "timestamp" : "01:22:56-01:23:01"
  },
  {
    "speaker" : "Andy",
    "text" : "Over.",
    "timestamp" : "01:23:01-01:23:02"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, over.",
    "timestamp" : "01:23:02-01:23:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Didn't even need to hear the number.",
    "timestamp" : "01:23:03-01:23:04"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:23:04-01:23:09",
    "text" : "I had over as well, but we were split on the ball. Yeah. Hackers at 10."
  },
  {
    "timestamp" : "01:23:09-01:23:10",
    "speaker" : "Andy",
    "text" : "Under."
  },
  {
    "timestamp" : "01:23:10-01:23:11",
    "speaker" : "Greg",
    "text" : "Over."
  },
  {
    "timestamp" : "01:23:12-01:23:19",
    "text" : "Aaron Rodgers doesn't finish the season. How's that for a fucking hot take? Aaron Rodgers doesn't finish the season. How's that for a hot take?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:23:19-01:23:25",
    "speaker" : "Greg",
    "text" : "I hate Aaron Rodgers as much as anybody on this planet. That 10 seems ridiculously low. Right?"
  },
  {
    "text" : "That seems a little low. It does seem a little low. Keep going.",
    "timestamp" : "01:23:25-01:23:28",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:23:29-01:23:32",
    "speaker" : "Steve",
    "text" : "Seahawks 10. Sneaky yonder."
  },
  {
    "text" : "Yep.",
    "timestamp" : "01:23:32-01:23:33",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:23:34-01:23:37",
    "text" : "Yeah, we had we had a little mix there.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:23:37-01:23:38",
    "text" : "I had said over."
  },
  {
    "timestamp" : "01:23:39-01:23:40",
    "text" : "Okay.",
    "speaker" : "Andy"
  },
  {
    "text" : "I think Wilson's uh he's he's been uh talking about wanting to get out of town too, hasn't he?",
    "timestamp" : "01:23:40-01:23:46",
    "speaker" : "Greg"
  },
  {
    "text" : "Yep.",
    "timestamp" : "01:23:46-01:23:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:23:48-01:23:51",
    "text" : "Discontest cook. Best way to do that is to ball out though."
  },
  {
    "timestamp" : "01:23:51-01:23:52",
    "speaker" : "Andy",
    "text" : "Discontest."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:23:52-01:24:01",
    "text" : "I know, but they don't let him. He wanted to do that last year. Remember there like let Russ Cook. Yeah. Right. Right."
  },
  {
    "timestamp" : "01:24:02-01:24:07",
    "speaker" : "Steve",
    "text" : "Patriots, nine and a half. Over. Under. We all had over Greg."
  },
  {
    "text" : "Under nine and a half?",
    "timestamp" : "01:24:07-01:24:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. With the extra game. Dude, quarterback play.",
    "timestamp" : "01:24:09-01:24:12"
  },
  {
    "timestamp" : "01:24:13-01:24:27",
    "speaker" : "Andy",
    "text" : "Doesn't matter. The the last four teams that have the last four teams that have spent the most money in the offseason on free agents have averaged five and a half more wins. The next season."
  },
  {
    "speaker" : "Greg",
    "text" : "They were probably terrible teams though.",
    "timestamp" : "01:24:27-01:24:29"
  },
  {
    "text" : "No, they were like mediocre. One was the Dolphins last year, the Jets the year before. Uh the Bears and then the Jags, but the Jaguars were garbage and then weren't mediocre, but the other teams went from mediocre to good. Over. Calling it. Next.",
    "speaker" : "Andy",
    "timestamp" : "01:24:29-01:24:48"
  },
  {
    "timestamp" : "01:24:49-01:24:51",
    "speaker" : "Mom",
    "text" : "Chargers nine and a half."
  },
  {
    "timestamp" : "01:24:51-01:24:56",
    "speaker" : "Andy",
    "text" : "Chargers nine and a half. Uh over just because they got a new coach who's not a fucking idiot."
  },
  {
    "speaker" : "Steve",
    "text" : "Andy's cutting against the green here big time. That's fine. Dolphins also nine and a half. Dolphins, Chargers, Pat's all the same odds.",
    "timestamp" : "01:24:57-01:25:07"
  },
  {
    "timestamp" : "01:25:08-01:25:10",
    "speaker" : "Andy",
    "text" : "Under. I think the dolphins were aggressive."
  },
  {
    "timestamp" : "01:25:12-01:25:18",
    "speaker" : "Greg",
    "text" : "Nine and a half. Nine and a half. Uh I'm gonna go under because I don't trust two."
  },
  {
    "speaker" : "Steve",
    "text" : "Yep. That's my thought. Saints nine. Under.",
    "timestamp" : "01:25:19-01:25:24"
  },
  {
    "timestamp" : "01:25:24-01:25:25",
    "text" : "Under.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:25:25-01:25:27",
    "speaker" : "Steve",
    "text" : "Yeah, I was under as well."
  },
  {
    "timestamp" : "01:25:27-01:25:32",
    "text" : "I think they're gonna be a crazy cap situation there too. Yeah, they're fucked.",
    "speaker" : "Greg"
  },
  {
    "text" : "And they don't have a starting quarterback still. So",
    "timestamp" : "01:25:33-01:25:36",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I hope it's Jameis though so we can get another year of his antics.",
    "timestamp" : "01:25:36-01:25:40"
  },
  {
    "timestamp" : "01:25:40-01:25:44",
    "speaker" : "Andy",
    "text" : "And what's his name? Michael uh what's his name once out? Um a wide receiver."
  },
  {
    "text" : "Thomas dude.",
    "speaker" : "Greg",
    "timestamp" : "01:25:44-01:25:45"
  },
  {
    "text" : "Thomas, yeah, he wants out.",
    "speaker" : "Andy",
    "timestamp" : "01:25:45-01:25:46"
  },
  {
    "text" : "Imagine if the Pats scooped Michael Thomas over.",
    "timestamp" : "01:25:46-01:25:49",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:25:53-01:25:54",
    "speaker" : "Andy",
    "text" : "Who's gonna throw it to him?"
  },
  {
    "timestamp" : "01:25:55-01:26:03",
    "speaker" : "Greg",
    "text" : "Dude. Michael Thomas could catch passes from me. Fair. Still catch 70 balls in a season."
  },
  {
    "timestamp" : "01:26:04-01:26:05",
    "speaker" : "Andy",
    "text" : "On nothing but slants, yeah."
  },
  {
    "timestamp" : "01:26:06-01:26:08",
    "speaker" : "Steve",
    "text" : "Titans nine games."
  },
  {
    "timestamp" : "01:26:10-01:26:11",
    "speaker" : "Andy",
    "text" : "Over."
  },
  {
    "text" : "Over. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:26:11-01:26:12"
  },
  {
    "speaker" : "Steve",
    "text" : "Thank you for well pushed there.",
    "timestamp" : "01:26:12-01:26:13"
  },
  {
    "text" : "Steve, you even picked the over, even though Tannehill's gonna struggle.",
    "timestamp" : "01:26:14-01:26:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, yeah. The rest of the team will carry them. Colts nine games as well. Under under.",
    "timestamp" : "01:26:17-01:26:26"
  },
  {
    "text" : "Yeah, they're quarterback situations.",
    "timestamp" : "01:26:27-01:26:28",
    "speaker" : "Greg"
  },
  {
    "text" : "We feel good about those two. The Colts under nine and the uh Titans over nine. Great. It's crazy they have the same odds. I feel like Colts aren't that good.",
    "speaker" : "Steve",
    "timestamp" : "01:26:29-01:26:41"
  },
  {
    "speaker" : "Andy",
    "text" : "No.",
    "timestamp" : "01:26:41-01:26:41"
  },
  {
    "speaker" : "Steve",
    "text" : "Cowboys are at nine as well.",
    "timestamp" : "01:26:42-01:26:43"
  },
  {
    "timestamp" : "01:26:45-01:26:48",
    "speaker" : "Andy",
    "text" : "Cowboys at nine? Under. I don't trust the cowboys ever."
  },
  {
    "text" : "Over because their division sucks.",
    "speaker" : "Steve",
    "timestamp" : "01:26:48-01:26:50"
  },
  {
    "timestamp" : "01:26:50-01:26:51",
    "speaker" : "Andy",
    "text" : "Well, that's fair."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:26:51-01:26:54",
    "text" : "Split. Vikings also at nine."
  },
  {
    "speaker" : "Andy",
    "text" : "That feels like a team is ready to implode even though they have a lot of talent.",
    "timestamp" : "01:26:57-01:27:00"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I think so too.",
    "timestamp" : "01:27:00-01:27:01"
  },
  {
    "text" : "Under.",
    "timestamp" : "01:27:01-01:27:02",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:27:02-01:27:08",
    "speaker" : "Steve",
    "text" : "Under. That's another one we all had the same on. That's a parlay bet right there."
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. What else?",
    "timestamp" : "01:27:08-01:27:10"
  },
  {
    "text" : "Um Steelers eight and a half. Under. I think they confirm Big Ben is playing. You think an under? Big Ben's 39.",
    "timestamp" : "01:27:10-01:27:22",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:27:22-01:27:25",
    "text" : "Yeah. And falling the fuck apart. He doesn't last the season either. Under.",
    "speaker" : "Andy"
  },
  {
    "text" : "Who's the other guy that backs him up? Neil Watch. Duck Hodges. Quack quack quack Mr. Hodgins there. Quack quack quack quack. I get I hit the over on that.",
    "speaker" : "Steve",
    "timestamp" : "01:27:26-01:27:36"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:27:38-01:27:39",
    "text" : "Dwayne Haskins."
  },
  {
    "text" : "And they got what you mean Haskins? Najee Harris is a good fit for that offense.",
    "timestamp" : "01:27:39-01:27:43",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:27:43-01:27:48",
    "speaker" : "Greg",
    "text" : "Yeah, I think so too, but I don't think that's a good one. Don't you mean Askins? It gives you maybe one more win."
  },
  {
    "timestamp" : "01:27:48-01:27:50",
    "speaker" : "Andy",
    "text" : "You get it? Askins?"
  },
  {
    "text" : "I get it, because he's asking. Who else? Cardinals eight and a half.",
    "speaker" : "Greg",
    "timestamp" : "01:27:50-01:27:55"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:27:55-01:27:56",
    "text" : "Under."
  },
  {
    "timestamp" : "01:27:56-01:28:05",
    "text" : "Over. Over. I think they're they win the division. Yeah, I think they're two. I'm I don't get why they're eight and a half. I feel like they should be higher too. Because Cliff Kingsway is an idiot.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "The uh Washington football team. Under. Over. What if I'd said four?",
    "timestamp" : "01:28:06-01:28:17"
  },
  {
    "text" : "Don't do that.",
    "timestamp" : "01:28:17-01:28:18",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "We're all over on that as well.",
    "timestamp" : "01:28:20-01:28:22"
  },
  {
    "text" : "I think Vince is gonna be the real deal.",
    "timestamp" : "01:28:22-01:28:24",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:28:24-01:28:26",
    "text" : "You know, are you just saying how much you love Fitz Magic in?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:28:26-01:28:28",
    "text" : "You know he's a quarterback, right?"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:28:28-01:28:28",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:28:28-01:28:30",
    "text" : "Wait, what was the what was the number?"
  },
  {
    "text" : "Eight and a half. You can't win them nine games with the defensive line.",
    "timestamp" : "01:28:30-01:28:34",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:28:34-01:28:42",
    "speaker" : "Andy",
    "text" : "You've convinced me. Over. So but they're all gonna be blowouts one way or the other."
  },
  {
    "timestamp" : "01:28:42-01:28:42",
    "speaker" : "Steve",
    "text" : "Yes."
  },
  {
    "speaker" : "Andy",
    "text" : "Their point differential is gonna be zero, but they're gonna they're gonna win or lose every game by at least two touchdowns.",
    "timestamp" : "01:28:44-01:28:50"
  },
  {
    "speaker" : "Steve",
    "text" : "Broncos eight and a half as well.",
    "timestamp" : "01:28:51-01:28:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Under",
    "timestamp" : "01:28:53-01:28:53"
  },
  {
    "speaker" : "Steve",
    "text" : "Under.",
    "timestamp" : "01:28:54-01:28:55"
  },
  {
    "speaker" : "Andy",
    "text" : "They're gonna be garbage.",
    "timestamp" : "01:28:55-01:28:56"
  },
  {
    "timestamp" : "01:28:58-01:29:01",
    "speaker" : "Steve",
    "text" : "Uh bears seven and a half. Over."
  },
  {
    "timestamp" : "01:29:02-01:29:02",
    "speaker" : "Andy",
    "text" : "Over."
  },
  {
    "text" : "I had under. I think the polls. That was a tough one.",
    "timestamp" : "01:29:03-01:29:06",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:29:08-01:29:17",
    "speaker" : "Andy",
    "text" : "They were a good team except for their quarterback. And even uh Andy Dalton's an upgrade. Well Dalton's not gonna be a lot of Justin Fields is gonna be awesome. Eventually, yeah."
  },
  {
    "text" : "But Andy thinks you can't start a little three years after you drive.",
    "speaker" : "Steve",
    "timestamp" : "01:29:17-01:29:21"
  },
  {
    "speaker" : "Andy",
    "text" : "No, you can, but they're starting love or get the fuck out, according to Andy. That's right. Absolutely. As it should be. Look at look at the uh the the track record.",
    "timestamp" : "01:29:22-01:29:32"
  },
  {
    "text" : "Get out of here. Carolina Panthers, seven and a half.",
    "timestamp" : "01:29:32-01:29:36",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Under.",
    "timestamp" : "01:29:36-01:29:37"
  },
  {
    "speaker" : "Steve",
    "text" : "Over the biggest thing.",
    "timestamp" : "01:29:37-01:29:38"
  },
  {
    "text" : "Sam Darnold. Sam Darnold is a Pro Bowl. Not a chance. Sam Darnold's done.",
    "speaker" : "Andy",
    "timestamp" : "01:29:38-01:29:42"
  },
  {
    "timestamp" : "01:29:44-01:29:47",
    "text" : "That's a hot take. That's hotter than my fucking ice cold.",
    "speaker" : "Steve"
  },
  {
    "text" : "McCaffrey's gonna be healthy.",
    "speaker" : "Mom",
    "timestamp" : "01:29:52-01:29:53"
  },
  {
    "speaker" : "Greg",
    "text" : "And uh Robbie Anderson, they have a connection from when he's with the Jets. He played really well.",
    "timestamp" : "01:29:55-01:30:00"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:30:00-01:30:03",
    "text" : "to write all these down and and do a recap at the end."
  },
  {
    "timestamp" : "01:30:03-01:30:07",
    "speaker" : "Greg",
    "text" : "We have a fucking uh and they still got DJ Moore. That team is like pretty stacked."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:30:08-01:30:08",
    "text" : "Yeah."
  },
  {
    "text" : "They have a good coach. I think they're gonna get better. They're better last year than the year before. Look out for the Panthers.",
    "timestamp" : "01:30:08-01:30:14",
    "speaker" : "Greg"
  },
  {
    "text" : "You just say that because you live in North Carolina, right?",
    "timestamp" : "01:30:14-01:30:16",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:30:16-01:30:17",
    "text" : "We're gonna have yeah, we're gonna have Bobby on."
  },
  {
    "text" : "We're gonna see it. You're listening to much sports talk radio down there. Yeah, right.",
    "timestamp" : "01:30:17-01:30:20",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:30:21-01:30:22",
    "text" : "They are very positive. It's hilarious."
  },
  {
    "text" : "It's weird.",
    "timestamp" : "01:30:23-01:30:23",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. They're way more optimistic about their team.",
    "timestamp" : "01:30:24-01:30:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, they can be optimistic, but as soon as I start throwing hot tags, I'm a I'm a fucking homer.",
    "timestamp" : "01:30:26-01:30:30"
  },
  {
    "speaker" : "Steve",
    "text" : "All right, Falcons, seven and a half.",
    "timestamp" : "01:30:30-01:30:32"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh under.",
    "timestamp" : "01:30:33-01:30:34"
  },
  {
    "timestamp" : "01:30:34-01:30:34",
    "text" : "Under.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:30:35-01:30:36",
    "speaker" : "Andy",
    "text" : "They don't even have Julio anymore. Fuck it."
  },
  {
    "speaker" : "Greg",
    "text" : "They're just under a shitload of points though.",
    "timestamp" : "01:30:36-01:30:38"
  },
  {
    "speaker" : "Andy",
    "text" : "Maybe.",
    "timestamp" : "01:30:39-01:30:39"
  },
  {
    "text" : "Or Steven Lee.",
    "timestamp" : "01:30:40-01:30:41",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:30:41-01:30:43",
    "speaker" : "Andy",
    "text" : "Yeah, they'll blow a whole bunch of leads. It's gonna be great."
  },
  {
    "timestamp" : "01:30:44-01:30:45",
    "speaker" : "Steve",
    "text" : "Raiders seven."
  },
  {
    "text" : "Under. I don't trust that. Under because of John Gruden. I think he's hysterical, but he's a terrible coach. He's still stuck in the fucking early 2000s.",
    "speaker" : "Andy",
    "timestamp" : "01:30:46-01:31:00"
  },
  {
    "text" : "Right. Yeah, there's no yeah. Yeah, and you're like Jacobs is good, but he's not gonna",
    "timestamp" : "01:31:04-01:31:11",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "And Waller tight end is is amazing, but they don't utilize them correctly. Yeah.",
    "timestamp" : "01:31:12-01:31:16"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, they seem to have like good players that have popped up, but there's no cohesive, like here's how we play. Yep. Speaking of Giants seven. Over. Under. I'm with Standard Jones. Doesn't have it, right?",
    "timestamp" : "01:31:16-01:31:31"
  },
  {
    "timestamp" : "01:31:33-01:31:35",
    "text" : "I think he'll be okay this year because he's got Saquon back.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:31:36-01:31:37",
    "speaker" : "Greg",
    "text" : "Who's the backup there?"
  },
  {
    "speaker" : "Andy",
    "text" : "Who knows?",
    "timestamp" : "01:31:37-01:31:39"
  },
  {
    "text" : "Well, I want to know how long they'll let him stay out there and throw picks and fumbles.",
    "timestamp" : "01:31:39-01:31:43",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh, it'll be all day.",
    "speaker" : "Andy",
    "timestamp" : "01:31:43-01:31:44"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:31:47-01:31:49",
    "text" : "I'm saying he leads the league in turnovers this year."
  },
  {
    "text" : "He's their Eli.",
    "speaker" : "Andy",
    "timestamp" : "01:31:49-01:31:50"
  },
  {
    "timestamp" : "01:31:51-01:31:54",
    "speaker" : "Steve",
    "text" : "Jags six and a half. Over."
  },
  {
    "timestamp" : "01:31:54-01:31:55",
    "speaker" : "Andy",
    "text" : "Under."
  },
  {
    "text" : "We had all had to under here, Greg. That fucking Trevor Lawrence.",
    "timestamp" : "01:31:56-01:32:00",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:32:00-01:32:01",
    "text" : "That head coach is gonna fucking."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:32:03-01:32:06",
    "text" : "Have you seen his records in college though?"
  },
  {
    "timestamp" : "01:32:06-01:32:06",
    "speaker" : "Andy",
    "text" : "I don't care."
  },
  {
    "speaker" : "Greg",
    "text" : "He's like 181 in like 23 or something.",
    "timestamp" : "01:32:07-01:32:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, welcome to the NFL. He's gonna have twenty-three losses this season alone.",
    "timestamp" : "01:32:11-01:32:15"
  },
  {
    "timestamp" : "01:32:17-01:32:20",
    "speaker" : "Greg",
    "text" : "Do you think Trevor Lawrence will play well, Andy?"
  },
  {
    "text" : "I think it'll play well enough. I don't think it'd be enough to to make a roster in the win-loss. Yeah.",
    "timestamp" : "01:32:20-01:32:27",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Their roster is a lot more away than Trevor Lawrence.",
    "timestamp" : "01:32:28-01:32:30"
  },
  {
    "timestamp" : "01:32:30-01:32:31",
    "speaker" : "Andy",
    "text" : "I'm sure it'll be good though."
  },
  {
    "speaker" : "Steve",
    "text" : "Bengals six and a half.",
    "timestamp" : "01:32:32-01:32:34"
  },
  {
    "text" : "Over.",
    "speaker" : "Andy",
    "timestamp" : "01:32:35-01:32:35"
  },
  {
    "speaker" : "Steve",
    "text" : "Tough one.",
    "timestamp" : "01:32:36-01:32:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:32:37-01:32:41",
    "text" : "It is. It's gonna be right around. It's gonna be between six and seven games."
  },
  {
    "timestamp" : "01:32:42-01:32:46",
    "speaker" : "Greg",
    "text" : "Yeah, I say they win six games. Uh they went over."
  },
  {
    "text" : "Yes, sir. I think they're in it if Joe if Joe Burrow stays healthy, I think they're We all had the Bengals over here, except for you guys.",
    "timestamp" : "01:32:48-01:32:55",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:32:55-01:32:58",
    "text" : "They didn't fix the offensive line though.",
    "speaker" : "Steve"
  },
  {
    "text" : "Eagles line. That's true. But they did drop Jamar Chase.",
    "timestamp" : "01:32:58-01:33:01",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:33:01-01:33:14",
    "text" : "Yeah, no, but you gotta be able to protect Burrow to get it to Jamar Chase. I agree. They should have taken uh Seawall there. Oh well. Um Eagle six and a half. Under. Why?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:33:17-01:33:25",
    "text" : "No. No. I've been watching some YouTube videos about his mechanics and his decision making and very poor, let me tell you.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:33:25-01:33:33",
    "text" : "See, that's What was the number on the thing? But actually no you're not bullshitting. You're sitting there at fucking one in the morning watching bullshit."
  },
  {
    "timestamp" : "01:33:35-01:33:48",
    "speaker" : "Greg",
    "text" : "He's a first big guy. And apparently like Like a lot of that success from last year just came from like scramble and like play breakdowns and really he like people think he played well, but"
  },
  {
    "text" : "The Eagles are just so bad before that that it would seem like I like that and I love hitting on the Eagles uh after be uh having them beat us in the Super Bowl and and talking so much trash. So I will go the under even though I don't even remember what the number was.",
    "speaker" : "Andy",
    "timestamp" : "01:33:48-01:34:02"
  },
  {
    "text" : "Six and a half.",
    "speaker" : "Steve",
    "timestamp" : "01:34:03-01:34:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Great, fine. Don't care. Under.",
    "timestamp" : "01:34:04-01:34:05"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh speaking of jets six.",
    "timestamp" : "01:34:07-01:34:09"
  },
  {
    "timestamp" : "01:34:10-01:34:12",
    "text" : "Under. Right.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:34:12-01:34:13",
    "speaker" : "Steve",
    "text" : "They're gonna be an absolute dump screen."
  },
  {
    "timestamp" : "01:34:15-01:34:24",
    "speaker" : "Andy",
    "text" : "They just had I think they just lost like two of their um like their highest offseason signing uh Went down than an ACL or MCL."
  },
  {
    "speaker" : "Greg",
    "text" : "Name five more players on the on the Jess beside.",
    "timestamp" : "01:34:25-01:34:28"
  },
  {
    "speaker" : "Andy",
    "text" : "Zach What's his face, the quarterback.",
    "timestamp" : "01:34:29-01:34:30"
  },
  {
    "timestamp" : "01:34:30-01:34:31",
    "text" : "Yeah, no, five.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:34:32-01:34:35",
    "text" : "Elijah Woods. I got nothing."
  },
  {
    "speaker" : "Steve",
    "text" : "Left tackle, not to bring Shaw Ferguson, but something like that. He's good.",
    "timestamp" : "01:34:35-01:34:38"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, right.",
    "timestamp" : "01:34:39-01:34:40"
  },
  {
    "text" : "Jim Allat. Robbie Anderson.",
    "speaker" : "Steve",
    "timestamp" : "01:34:40-01:34:42"
  },
  {
    "timestamp" : "01:34:43-01:34:44",
    "speaker" : "Andy",
    "text" : "Marcus May?"
  },
  {
    "speaker" : "Greg",
    "text" : "Marcus May. Yeah. Sam Dodd. Name a linebacker. CJ Mosley. Did they get him? Yeah. And we got hurt first here. Uh Davion Bet.",
    "timestamp" : "01:34:45-01:34:58"
  },
  {
    "timestamp" : "01:35:02-01:35:03",
    "text" : "Oh no.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:35:03-01:35:10",
    "speaker" : "Greg",
    "text" : "No. Joe name it. Joe name it thing coming through that door."
  },
  {
    "text" : "Who else is black?",
    "speaker" : "Andy",
    "timestamp" : "01:35:12-01:35:13"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:35:14-01:35:19",
    "text" : "The Jets are a game and a half better than the Lions. Who's their running back?"
  },
  {
    "timestamp" : "01:35:19-01:35:20",
    "speaker" : "Andy",
    "text" : "You tell me."
  },
  {
    "timestamp" : "01:35:20-01:35:21",
    "text" : "Frank Gore?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "No. Well, maybe.",
    "timestamp" : "01:35:22-01:35:24"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't get I don't get how the Jets are a game and a half better.",
    "timestamp" : "01:35:24-01:35:28"
  },
  {
    "speaker" : "Andy",
    "text" : "They're not, which is why we just went under. Next. We gotta put this together over.",
    "timestamp" : "01:35:28-01:35:34"
  },
  {
    "text" : "Lines four and a half over.",
    "timestamp" : "01:35:35-01:35:37",
    "speaker" : "Greg"
  },
  {
    "text" : "I think they come out hot and then lose every game after quarterback after week five.",
    "speaker" : "Andy",
    "timestamp" : "01:35:38-01:35:43"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Texas Ryan four.",
    "timestamp" : "01:35:43-01:35:46"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:35:47-01:35:47",
    "text" : "Under."
  },
  {
    "speaker" : "Steve",
    "text" : "Four. Wow.",
    "timestamp" : "01:35:48-01:35:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Texans are a dumpster fire.",
    "timestamp" : "01:35:49-01:35:51"
  },
  {
    "speaker" : "Steve",
    "text" : "Wow.",
    "timestamp" : "01:35:51-01:35:51"
  },
  {
    "timestamp" : "01:35:52-01:35:53",
    "speaker" : "Andy",
    "text" : "If they win a game, I'll be shocked."
  },
  {
    "timestamp" : "01:35:54-01:35:57",
    "text" : "Wow, wow, wow. Oh, and 17 under.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:35:57-01:35:59",
    "speaker" : "Andy",
    "text" : "Yeah. Maybe one game."
  },
  {
    "text" : "All right, that's all.",
    "timestamp" : "01:36:00-01:36:00",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:36:00-01:36:02",
    "speaker" : "Andy",
    "text" : "Do they play the Lions?"
  },
  {
    "text" : "The only ones we agree on here are the Jets.",
    "timestamp" : "01:36:04-01:36:08",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:36:09-01:36:13",
    "text" : "Makes sense. That feels right for this pod.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:36:14-01:36:23",
    "text" : "Um the Redskins slash Washington football team slash whatever's Vikings. Okay. Nine games.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Are they even gonna bother naming that team or are we just gonna be the football team?",
    "timestamp" : "01:36:24-01:36:28"
  },
  {
    "text" : "They keep they keep saying they keep threatening to name it. I heard red hogs.",
    "speaker" : "Andy",
    "timestamp" : "01:36:28-01:36:32"
  },
  {
    "speaker" : "Greg",
    "text" : "The the Indians did it like right away.",
    "timestamp" : "01:36:32-01:36:35"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:36:35-01:36:35",
    "text" : "Yeah."
  },
  {
    "text" : "Mid season. Yeah.",
    "timestamp" : "01:36:36-01:36:37",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:36:37-01:36:41",
    "text" : "Yeah, well. This is Dan Snyder we're talking about, big duck.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Colts under nine, Titans over nine.",
    "timestamp" : "01:36:41-01:36:44"
  },
  {
    "text" : "Yep.",
    "timestamp" : "01:36:44-01:36:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:36:45-01:36:49",
    "text" : "Uh I don't know if we're we said you said the Patriots. You thought we were gonna go under nine and a half Greg."
  },
  {
    "timestamp" : "01:36:50-01:36:51",
    "speaker" : "Andy",
    "text" : "Greg said under, yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:36:51-01:36:51"
  },
  {
    "text" : "Because he's an asshole.",
    "timestamp" : "01:36:51-01:36:53",
    "speaker" : "Andy"
  },
  {
    "text" : "That's it.",
    "timestamp" : "01:36:53-01:36:54",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh, Ravens under eleven, assuming suck me off means under Greg, uh do you want you want to put a jersey bet on the Patriots? Over under? Over under. Yeah.",
    "timestamp" : "01:36:55-01:37:05",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:37:05-01:37:06",
    "speaker" : "Greg",
    "text" : "Sure."
  },
  {
    "timestamp" : "01:37:06-01:37:07",
    "speaker" : "Andy",
    "text" : "Nine. All right."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:37:08-01:37:09",
    "text" : "Chinese jersey, yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, of course.",
    "timestamp" : "01:37:10-01:37:10"
  },
  {
    "timestamp" : "01:37:11-01:37:11",
    "text" : "All right.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:37:11-01:37:16",
    "text" : "Nine and a half. Nine and a half. That's fine. I'll give you the half.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:37:17-01:37:20",
    "text" : "I get to pick the player though if I lose.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:37:20-01:37:29",
    "speaker" : "Steve",
    "text" : "All right, there's our parlay. I get to pick the team then. I shouldn't that is some nice money. Alright, I got the I got the Jets roster up in front of me."
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, this is it before we put this this uh Light like the Jets uh injury reserve. We're gonna put this to bed after you you give us a lot of the first.",
    "timestamp" : "01:37:30-01:37:39"
  },
  {
    "timestamp" : "01:37:40-01:37:45",
    "speaker" : "Greg",
    "text" : "Starting cornerbacks, Bryce Hall and Bless Austin. Oh bless?"
  },
  {
    "text" : "Ooh, good. Okay.",
    "speaker" : "Andy",
    "timestamp" : "01:37:46-01:37:48"
  },
  {
    "speaker" : "Mom",
    "text" : "That's a real NFL player.",
    "timestamp" : "01:37:49-01:37:50"
  },
  {
    "timestamp" : "01:37:50-01:37:52",
    "text" : "CJ Mulley, yes, it is actually one of them.",
    "speaker" : "Andy"
  },
  {
    "text" : "Who is this? The starting linebacker?",
    "timestamp" : "01:37:55-01:37:57",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Linebackers.",
    "timestamp" : "01:37:57-01:37:58"
  },
  {
    "timestamp" : "01:37:58-01:38:04",
    "text" : "John Franklin Myers Folo Runsu Futa Futakasy",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Is that one name or we we have multiple names there?",
    "timestamp" : "01:38:05-01:38:07"
  },
  {
    "timestamp" : "01:38:07-01:38:11",
    "text" : "That's two names. Yeah. Two guys? That's first and no, that's first and last.",
    "speaker" : "Andy"
  },
  {
    "text" : "John Franklin Myers is one person and Polarunzo Fatukasi.",
    "speaker" : "Greg",
    "timestamp" : "01:38:11-01:38:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:38:18-01:38:23",
    "text" : "So this feels like a Madden generated team. No?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:38:24-01:38:29",
    "text" : "Jameis and Crowder, so Keelan Cole is starting at wide receiver."
  },
  {
    "speaker" : "Andy",
    "text" : "Brexton Barrios is the first back. He's gonna make that roster, baby.",
    "timestamp" : "01:38:30-01:38:35"
  },
  {
    "speaker" : "Greg",
    "text" : "Corey Davis. No, Corey Davis, he could be legit. Makai back then's legit.",
    "timestamp" : "01:38:35-01:38:39"
  },
  {
    "text" : "George Stant. Oh right.",
    "speaker" : "Andy",
    "timestamp" : "01:38:39-01:38:42"
  },
  {
    "timestamp" : "01:38:43-01:38:44",
    "speaker" : "Greg",
    "text" : "Greg Van Rotten?"
  },
  {
    "text" : "Dude, that sounds like That sounds like a punk band from the 80s.",
    "speaker" : "Andy",
    "timestamp" : "01:38:45-01:38:48"
  },
  {
    "text" : "I was in a punk band, that was what my name is. Greg Van Rotten. Such a bad boy, dude. That's a guy that trashes hotel rooms when he's on train. Oh, 100%. Oh yeah. I have a pierced lip, dude.",
    "speaker" : "Greg",
    "timestamp" : "01:38:49-01:39:04"
  },
  {
    "timestamp" : "01:39:05-01:39:10",
    "text" : "Yeah oh yeah and like uh like a a bull thing through the nose as well.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:39:11-01:39:20",
    "text" : "Greg Van Rotten Record dude. I'm buying this guy's jersey. If I win the jersey bet, I want to go stand rotten jersey."
  },
  {
    "text" : "All right, done. It's a Jets one, but that's fine. That's fine, dude. Van Rotten.",
    "speaker" : "Andy",
    "timestamp" : "01:39:20-01:39:26"
  },
  {
    "speaker" : "Greg",
    "text" : "And I want the whole name on the back.",
    "timestamp" : "01:39:26-01:39:27"
  },
  {
    "speaker" : "Andy",
    "text" : "Obviously. Not just Van Rotten.",
    "timestamp" : "01:39:28-01:39:29"
  },
  {
    "timestamp" : "01:39:29-01:39:30",
    "text" : "I want Greg Van.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:39:30-01:39:32",
    "speaker" : "Andy",
    "text" : "Greg Van Rotten. Okay. Done."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh dude, he had a mullet too.",
    "timestamp" : "01:39:33-01:39:34"
  },
  {
    "speaker" : "Andy",
    "text" : "Obviously he did.",
    "timestamp" : "01:39:35-01:39:36"
  },
  {
    "timestamp" : "01:39:36-01:39:37",
    "text" : "This guy looks awesome.",
    "speaker" : "Greg"
  },
  {
    "text" : "You didn't have to tell me that. That was what I was picturing in my head already.",
    "timestamp" : "01:39:37-01:39:42",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:39:42-01:39:46",
    "speaker" : "Greg",
    "text" : "Yeah. Right guard Greg Van Roten almost certainly has a mullet."
  },
  {
    "text" : "Undoubtedly.",
    "speaker" : "Andy",
    "timestamp" : "01:39:46-01:39:47"
  },
  {
    "timestamp" : "01:39:48-01:39:48",
    "text" : "All right.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Anything else before I I'm calculating I'm calculating our power lay.",
    "timestamp" : "01:39:50-01:39:54"
  },
  {
    "speaker" : "Greg",
    "text" : "Andy, who's your biggest who's your who's Who's a player that everyone's hyped on that you think is gonna be terrible? That's a great question, Greg. Yeah.",
    "timestamp" : "01:39:55-01:40:03"
  },
  {
    "timestamp" : "01:40:06-01:40:08",
    "speaker" : "Andy",
    "text" : "I don't know who's everyone hyped on."
  },
  {
    "speaker" : "Greg",
    "text" : "Probably bring up the NFL MVP odds. Kelly wants me to bring it up. Uh-huh. I heard. All right. Mahomes, Rogers, Josh Allen, Brady, Prescott, Lamar Jackson, Matt Stafford, Russell Wilson, Herbert is a good one. Lamar. Rogers. Rogers.",
    "timestamp" : "01:40:08-01:40:26"
  },
  {
    "text" : "Rogers. Aaron Rodgers. Come on, Andy.",
    "timestamp" : "01:40:27-01:40:28",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That is not real.",
    "timestamp" : "01:40:30-01:40:30"
  },
  {
    "speaker" : "Andy",
    "text" : "No, I don't think he finishes the season. I already said this once. What?",
    "timestamp" : "01:40:31-01:40:33"
  },
  {
    "timestamp" : "01:40:33-01:40:40",
    "text" : "Because he plays poorly. I think we're past the point of like predicting he's a bust.",
    "speaker" : "Greg"
  },
  {
    "text" : "No, I'm not saying not say he's gonna be a bust.",
    "timestamp" : "01:40:41-01:40:43",
    "speaker" : "Andy"
  },
  {
    "text" : "It's a hot take from Andy. Aaron Rodgers will be a bust. Or look Joe Barrow. Give me one of these guys, like a newer guy, right? So like Kyler Murray, Justin Herbert, Joe Barrow. These are all guys that I said Jalen Hurts. He's my bust, right?",
    "timestamp" : "01:40:44-01:41:02",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Right.",
    "timestamp" : "01:41:03-01:41:03"
  },
  {
    "text" : "Sam Darnold, he's not really people.",
    "speaker" : "Greg",
    "timestamp" : "01:41:05-01:41:06"
  },
  {
    "text" : "Sam Darnold's definitely gonna be a bust.",
    "timestamp" : "01:41:07-01:41:09",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:41:09-01:41:09",
    "text" : "Tua",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:41:11-01:41:14",
    "text" : "Yeah, I throw two in that category. Josh Allen.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:41:15-01:41:17",
    "text" : "Okay. I think we're on the Josh Allen training."
  },
  {
    "speaker" : "Andy",
    "text" : "I and Tannehill.",
    "timestamp" : "01:41:17-01:41:18"
  },
  {
    "text" : "Well, let me parlay them together.",
    "timestamp" : "01:41:19-01:41:21",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:41:21-01:41:22",
    "text" : "That's fine.",
    "speaker" : "Andy"
  },
  {
    "text" : "What do you think about a sneaky coming back to earth from the um the cheats?",
    "timestamp" : "01:41:23-01:41:28",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:41:28-01:41:33",
    "text" : "I think so. Uh people are talking about them going undefeated already. There's no way that happens."
  },
  {
    "text" : "I know Mahomes is too good. He is really good, but I just something about it doesn't feel sustainable. Yeah. Is there a first round pick?",
    "timestamp" : "01:41:33-01:41:42",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I thought they had a good first round or two.",
    "timestamp" : "01:41:42-01:41:44"
  },
  {
    "timestamp" : "01:41:44-01:41:46",
    "speaker" : "Andy",
    "text" : "Who did I remember?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:41:46-01:41:48",
    "text" : "Running back, maybe?"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know.",
    "timestamp" : "01:41:48-01:41:48"
  },
  {
    "text" : "Thoughts on Joe Burrow?",
    "speaker" : "Greg",
    "timestamp" : "01:41:48-01:41:50"
  },
  {
    "timestamp" : "01:41:50-01:41:52",
    "speaker" : "Andy",
    "text" : "No thoughts on Joe Burrow."
  },
  {
    "timestamp" : "01:41:52-01:42:03",
    "speaker" : "Greg",
    "text" : "Thumbs up. Thumbs up. Me too. He gets he's got the uh he's got the look. When I talk about like a rookie even though the team sucks, to me he had the look."
  },
  {
    "timestamp" : "01:42:03-01:42:09",
    "text" : "I agree. Joe Barrow is uh he seems to have it. Well you're talking about the I get what you're saying, Greg, when you said some guys don't have it, some do.",
    "speaker" : "Steve"
  },
  {
    "text" : "And he seems to. Yep. Imagine. Even Andrew Luck. I remember Andrew Luck's first year, he sucked, but you were like, okay. Yeah. They they would be way worse if he wasn't in there. And you know who else has that? Uh Heber. Yeah, I'm not I'm not Quite sold on him, maybe because he just played when the Pats played and we just dominated, and that was really the only time I watched a full game. But I had him on my fantasy team, he was awesome. Yeah, yeah, he did put up crazy numbers. He did",
    "speaker" : "Greg",
    "timestamp" : "01:42:10-01:42:37"
  },
  {
    "timestamp" : "01:42:38-01:42:45",
    "speaker" : "Andy",
    "text" : "Yeah, he looked good. Alright, I think this is going on long enough. I think we should end this. We only had the first half."
  },
  {
    "timestamp" : "01:42:49-01:42:53",
    "speaker" : "Steve",
    "text" : "Steve, one last hot take because he's adorable when he o when he wraps presents."
  },
  {
    "text" : "Love it.",
    "speaker" : "Andy",
    "timestamp" : "01:42:53-01:42:53"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:42:54-01:42:58",
    "text" : "My not so hot take is Andy's gonna be wrong on every single one of his hot takes."
  },
  {
    "speaker" : "Andy",
    "text" : "And if I'm not",
    "timestamp" : "01:42:59-01:43:00"
  },
  {
    "text" : "I'll give you a hug.",
    "timestamp" : "01:43:01-01:43:02",
    "speaker" : "Steve"
  },
  {
    "text" : "All right. So find out next well, find out probably six months from now whether or not my hot takes are correct.",
    "timestamp" : "01:43:02-01:43:11",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Next season.",
    "timestamp" : "01:43:11-01:43:12"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:43:12-01:43:13",
    "speaker" : "Andy"
  },
  {
    "text" : "Write them all down.",
    "timestamp" : "01:43:13-01:43:14",
    "speaker" : "Greg"
  },
  {
    "text" : "On the pages. Dynasty Podcast. Save those notes, Steve, and we will revisit them. When the time is correct. Otherwise, we'll see you next time back in 2004.",
    "timestamp" : "01:43:14-01:43:27",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yep.",
    "timestamp" : "01:43:28-01:43:28"
  },
  {
    "text" : "On the Patriots.",
    "timestamp" : "01:43:28-01:43:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Make the playoffs.",
    "timestamp" : "01:43:33-01:43:35"
  },
  {
    "text" : "Yeah, okay. Fair. The Bills will not stay in Buffalo. Love it. I can I can get behind that. That'd be great. Yeah, that was that was the that was the hottest take of all night. Well done. Finishing on a high note, if you will. We'll see you next week. Let's go Hoyer.",
    "speaker" : "Andy",
    "timestamp" : "01:43:37-01:43:56"
  },
  {
    "text" : "Third quarter Hoyer, baby.",
    "timestamp" : "01:43:56-01:43:58",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Patriots Dynasty Podcast. Atlanta. See Atlanta.",
    "timestamp" : "01:43:58-01:44:06"
  }
]