[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "speaker" : "Mom",
    "timestamp" : "00:00-00:17"
  },
  {
    "text" : "Welcome back to the Pagers Dynasty Podcast. I'm your host, Andy Brown. We are the podcast where we are going back and re-watching all of the Patriots games of the dynasty era. But this one's gonna be a bit different. Because um there's been some big news lately.",
    "timestamp" : "00:22-00:41",
    "speaker" : "Andy"
  },
  {
    "text" : "But before we get to that, we're now a podcast of four, right Andy?",
    "speaker" : "Greg",
    "timestamp" : "00:41-00:46"
  },
  {
    "timestamp" : "00:46-00:47",
    "speaker" : "Andy",
    "text" : "We are a podcast."
  },
  {
    "text" : "Well, three and a half. Screw Tom Brady. Let's talk some babies.",
    "speaker" : "Greg",
    "timestamp" : "00:47-00:53"
  },
  {
    "timestamp" : "00:53-01:10",
    "speaker" : "Andy",
    "text" : "Some babies, yeah. So the reason um I think we probably alluded to this on the last podcast. But the reason that we haven't put out an episode in a while is because my wife and I have had a child. So the newest Patriots fan. Seven pounds, four ounces."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:10-01:12",
    "text" : "I think well we'll let him choose for himself."
  },
  {
    "text" : "No, we won't. What kind of parenting is that?",
    "timestamp" : "01:13-01:16",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:17-01:23",
    "speaker" : "Steve",
    "text" : "I don't know. I don't think we'll let him listen to the podcast, that's for sure. But if he wants to become a Jets fan, Andy."
  },
  {
    "timestamp" : "01:23-01:36",
    "speaker" : "Andy",
    "text" : "Uh then he's gonna be an outside baby. So yeah, so that's the big news for me. You guys have any big news? No, no. All right. You got you got snow. That's pretty big news."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:36-01:40",
    "text" : "Yeah, we got a little bit of snow, but what are you gonna do?"
  },
  {
    "text" : "Do you still have snow? Are you uh has the state opened back up again? No.",
    "timestamp" : "01:40-01:44",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Seventy degrees today on February 3rd. Good lord.",
    "timestamp" : "01:45-01:49"
  },
  {
    "timestamp" : "01:51-02:07",
    "speaker" : "Andy",
    "text" : "I don't know. I don't e I I don't know what the temperature is. I can't. I'm not going to give you my New England spiel because I don't even know what day it is. I haven't been outside in a week. I have lived in in my bedroom which has the light block and curtain, so I couldn't even tell you what time of day it is. Perfect."
  },
  {
    "speaker" : "Greg",
    "text" : "Sounds awesome.",
    "timestamp" : "02:07-02:07"
  },
  {
    "text" : "It's great, yeah. Yeah. Just sleep whenever the fuck.",
    "speaker" : "Andy",
    "timestamp" : "02:08-02:11"
  },
  {
    "timestamp" : "02:11-02:18",
    "speaker" : "Greg",
    "text" : "I hate knowing like what time it is, what day it is. Oh yeah. That just means my life has been structured by somebody else. Yep."
  },
  {
    "timestamp" : "02:18-02:24",
    "speaker" : "Andy",
    "text" : "Well, I mean technically my life is structured by somebody else too, but it's just like minute by minute instead."
  },
  {
    "text" : "Andy's life just got restructured.",
    "timestamp" : "02:24-02:26",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:26-02:31",
    "speaker" : "Andy",
    "text" : "Oh yeah. Very much so. I am no longer in control of my life."
  },
  {
    "text" : "Well, I'm sure all of our listeners, aka mom, is very happy you carved out time for another podcast. Oh yes.",
    "timestamp" : "02:31-02:37",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Question. Have you tried breastfeeding him? Uh he has tried it.",
    "timestamp" : "02:38-02:43"
  },
  {
    "text" : "Just a little nibble. He's been nuzzling. Yeah. I'm like, oh that's not gonna work, my friend. That uh does not work the same way your mom says.",
    "speaker" : "Andy",
    "timestamp" : "02:43-02:50"
  },
  {
    "text" : "So well, I mean you gotta you gotta just show it to him and That's how babies learn and you can't just say no it's not gonna work. Well my my problem is I don't want him choking on the the the chest hair.",
    "speaker" : "Greg",
    "timestamp" : "02:50-03:02"
  },
  {
    "speaker" : "Andy",
    "text" : "No, because this is a lot of terrible visual. Right?",
    "timestamp" : "03:03-03:05"
  },
  {
    "text" : "Yeah, exactly. Furballs from sucking on Andy's nipples. Yep.",
    "timestamp" : "03:07-03:14",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "03:15-03:16",
    "speaker" : "Steve",
    "text" : "That's disgusting."
  },
  {
    "timestamp" : "03:16-03:17",
    "speaker" : "Greg",
    "text" : "You started this, Craig."
  },
  {
    "speaker" : "Andy",
    "text" : "Just remember that. So yes. Well boy.",
    "timestamp" : "03:17-03:27"
  },
  {
    "timestamp" : "03:30-03:33",
    "text" : "Now all of our listeners are regretting that we're doing a podcast right now.",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh speaking of football, there's big news in the uh this week in football, NFL uh circles. Because Tom Brady was rumored to have been retired and then actually did so a few days later. Adam Scheffer needs to keep his face shut on things like this, I think. Because that's that's the second uh retirement he's ruined, right? He ruined Andrew Luck's retirement. He leaked it up. Yeah. That was even worse. And then he got booed off the field because of it.",
    "timestamp" : "03:36-04:07",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. That is way worse.",
    "timestamp" : "04:07-04:09",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "04:10-04:11",
    "text" : "Is she right at Steve?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I was we were at a bar together. Remember Greg when that D'Came?",
    "timestamp" : "04:11-04:14"
  },
  {
    "text" : "Oh really? Yeah, I don't remember. But it was like a preseason game, right? And he was Yeah. Standing in street clothes and they were booing him in his own stadium. And like you could tell it was like registering with him.",
    "timestamp" : "04:15-04:25",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "04:26-04:26"
  },
  {
    "text" : "And he had look of panic on his face was just heartbreaking, dude.",
    "timestamp" : "04:26-04:31",
    "speaker" : "Greg"
  },
  {
    "text" : "It was rough He was such like a nice guy too.",
    "timestamp" : "04:31-04:34",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "04:34-04:34"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "04:34-04:36",
    "text" : "Yeah. You know."
  },
  {
    "timestamp" : "04:37-04:40",
    "text" : "And gave that city so much as well. That's tough. Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Looking back, Andrew Luck is kind of a G, you know? Yeah. He was just like, nah, I'm not gonna do this anymore. Not worth it. Sure.",
    "timestamp" : "04:41-04:48",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "And it wasn't worth it.",
    "timestamp" : "04:49-04:50"
  },
  {
    "timestamp" : "04:50-05:03",
    "speaker" : "Greg",
    "text" : "None of the his histrionics. Is that the right word? Yeah. Like the needing the media to fawn over him. He's just like, I'm done."
  },
  {
    "speaker" : "Andy",
    "text" : "No farewell tour, no nothing. Just yeah.",
    "timestamp" : "05:03-05:06"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "05:07-05:12",
    "text" : "Brady's on the other hand was stop, start, stop, start, maybe. Maybe, maybe not."
  },
  {
    "timestamp" : "05:12-05:12",
    "speaker" : "Greg",
    "text" : "Maybe not."
  },
  {
    "text" : "Let's just get people talking about it and talking about it and talking about it and talking about it endlessly.",
    "timestamp" : "05:16-05:19",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "05:19-05:24",
    "speaker" : "Greg",
    "text" : "Oh yeah, buy my new clothing line. Buy my new supplement."
  },
  {
    "text" : "Did you listen to Boston Sports Talk this week, Greg?",
    "speaker" : "Steve",
    "timestamp" : "05:25-05:28"
  },
  {
    "timestamp" : "05:28-05:28",
    "text" : "No.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "05:29-05:33",
    "speaker" : "Steve",
    "text" : "Okay. I thought that you're a glutton for that sort of punishment. I thought you'd be all over it."
  },
  {
    "text" : "No, no. I can't do that. I only do that when I come home to visit. You can't take more than like a week of it and then you st you just start getting cynical yourself, you know? Yeah. Yeah. Honestly. Yeah, I can't do it. It's very much like the Nazi party, you know. Jesus Christ.",
    "timestamp" : "05:33-05:55",
    "speaker" : "Greg"
  },
  {
    "text" : "No one Greg, I don't know.",
    "speaker" : "Andy",
    "timestamp" : "05:56-05:57"
  },
  {
    "text" : "Yeah, you're gonna have to you're gonna have to expand on that one. I think you can figure it out where I'm getting up there. I don't know. Who's their Hitler? I don't know. Felger. Probably Felger.",
    "timestamp" : "05:57-06:06",
    "speaker" : "Greg"
  },
  {
    "text" : "Actually probably Jerry Callahan, if we're being honest.",
    "speaker" : "Andy",
    "timestamp" : "06:08-06:11"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "06:13-06:27",
    "text" : "No, Jerry Calla Callahan is like uh Heinrich Himmler. He's like the bastard that's not skilled enough to like really be a leader. Okay. He's like, you know, he's a grunt that you can send out there to do your awful biddings."
  },
  {
    "timestamp" : "06:27-06:30",
    "speaker" : "Andy",
    "text" : "Oh, I just know what mom is saying right now."
  },
  {
    "speaker" : "Mom",
    "timestamp" : "06:31-06:32",
    "text" : "Sometimes a naughty boy."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "06:34-06:38",
    "text" : "It's a good analogy. We could take this really far."
  },
  {
    "speaker" : "Steve",
    "text" : "Put that out on the internet, Greg. Yeah. Use the Twitter account.",
    "timestamp" : "06:38-06:42"
  },
  {
    "timestamp" : "06:42-06:43",
    "speaker" : "Greg",
    "text" : "Yeah, tweet this."
  },
  {
    "timestamp" : "06:44-06:45",
    "speaker" : "Andy",
    "text" : "Tweet this for us, Greg."
  },
  {
    "timestamp" : "06:45-07:01",
    "speaker" : "Greg",
    "text" : "See how that goes. No, it's a sensitive time after Whoopi Goldberg's comments, Andy. Anyways, back to Tom Pree."
  },
  {
    "speaker" : "Mom",
    "timestamp" : "07:01-07:02",
    "text" : "Speaking of football"
  },
  {
    "timestamp" : "07:05-07:11",
    "speaker" : "Andy",
    "text" : "So yeah, so we finally did it. Did not play till 45, like you promised. So I'm heartbroken."
  },
  {
    "speaker" : "Steve",
    "text" : "But how old is he?",
    "timestamp" : "07:12-07:13"
  },
  {
    "speaker" : "Andy",
    "text" : "44. Oh. What a home lawyer. Although I am um because at the time I was so adamant that he wasn't leaving the Patriots, and then he did, and he broke my heart. I'm kind of uh happy that he's doing the same to Buccaneers fans because I saw a lot of people online be like, oh, he's not retiring. He's gonna do he's gonna get at least one more year, then he'll retire. And now the Buccaneers organization is fucked. Because Gronk is obviously going to retire, right?",
    "timestamp" : "07:13-07:41"
  },
  {
    "text" : "Yeah, yeah. I would think so. I gotta admit, I was surprised that he retired. I was a little bit surprised. Because I always just went with the theory he used to say, like, I'll stop playing when I suck. Yeah. And he definitely didn't suck this year. No. No, yeah. And I feel like they kind of let him do whatever he wants in Tampa as far as like practicing and shit.",
    "speaker" : "Greg",
    "timestamp" : "07:42-08:07"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but he's the guy that like uh isn't gonna take advantage of that, right? Like he's still gonna stay after practice and yeah do all that bullshit because he just doesn't know how to not do that.",
    "timestamp" : "08:07-08:19"
  },
  {
    "text" : "Yeah, I would imagine the family.",
    "timestamp" : "08:20-08:22",
    "speaker" : "Greg"
  },
  {
    "text" : "He probably thought like does he really want to go through like a try to pull it all together because Godwin's going to leave and maybe Evans goes or",
    "timestamp" : "08:22-08:29",
    "speaker" : "Steve"
  },
  {
    "text" : "trade and they got a salary cap and not the same team so he's like yeah fuck that you know yeah yeah they kind of just didn't want to listen to Giselle Nagum too yeah yeah ultimately we all kind of know that feeling of like Is this worth the nagging that will be associated with? So Greg, I just have to ask, how's Kelly doing? No comment.",
    "timestamp" : "08:29-08:52",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "08:55-08:58",
    "speaker" : "Steve",
    "text" : "At least we got an upper nagging game because you seem to do whatever the fuck you want anyways."
  },
  {
    "speaker" : "Greg",
    "text" : "It does feel like that. Yeah, and I do a ton of nagging stuff. I've made that decision in my brain.",
    "timestamp" : "08:59-09:05"
  },
  {
    "timestamp" : "09:05-09:08",
    "speaker" : "Steve",
    "text" : "Yeah. That's what I'm saying. She's gotta get, you know, really on the net."
  },
  {
    "timestamp" : "09:08-09:20",
    "text" : "Just like Tom Brady. So Gregory's just like Tom Brady. Yeah, exactly. There's a mix of nagging. Except I'm more athletic and my wife's better looking. This is what I always say.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, we still haven't seen you run the the 40 yet, Greg.",
    "timestamp" : "09:23-09:25"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, what's f what's further from the truth? Me being more athletic than Tom Brady or Kelly being more attractive than G. Oh, I have not answered that question. Because I feel like I have a case on just athleticism, you know?",
    "timestamp" : "09:26-09:41"
  },
  {
    "timestamp" : "09:42-09:44",
    "speaker" : "Steve",
    "text" : "Get her in here, Greg. Let's find out."
  },
  {
    "speaker" : "Greg",
    "text" : "All right. I mean, you were a D1 athlete, so. Yeah, I feel like I'm faster than him. Don't know. Might be even, which I guess It would depend on how you quantify uh athletic.",
    "timestamp" : "09:44-09:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. How do you qualify athletic?",
    "timestamp" : "09:57-10:00"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:01-10:08",
    "text" : "Yeah, well, I mean you could do like athletic from like good at sports standpoint or athletic from like uh how high can you jump, how fast can you run?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "10:08-10:09",
    "text" : "Yeah, yeah."
  },
  {
    "timestamp" : "10:09-10:12",
    "speaker" : "Greg",
    "text" : "How much can you lift? Like those are like the measurables, you know?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, yeah. You have a better chance on the measurables, Greg.",
    "timestamp" : "10:13-10:16"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, for sure.",
    "timestamp" : "10:17-10:17"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "10:18-10:18",
    "text" : "Yeah."
  },
  {
    "text" : "And even that I don't think I I don't think you do either.",
    "timestamp" : "10:18-10:22",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "You know, Combine or a current? Because he's a lot better now.",
    "timestamp" : "10:25-10:28"
  },
  {
    "text" : "Yeah, I think he's probably faster now.",
    "speaker" : "Andy",
    "timestamp" : "10:28-10:30"
  },
  {
    "timestamp" : "10:30-10:31",
    "speaker" : "Steve",
    "text" : "Oh yeah"
  },
  {
    "timestamp" : "10:31-10:33",
    "speaker" : "Andy",
    "text" : "Definitely stronger. Yeah."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "10:33-10:34",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "10:34-10:35",
    "speaker" : "Andy",
    "text" : "I think hamstrings."
  },
  {
    "text" : "I think you should argue hamstrings. Oh my goodness. So much pliability, dude. So pliable. Yeah.",
    "timestamp" : "10:35-10:45",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "He just thinks about lengthening when he gets hit.",
    "timestamp" : "10:45-10:47"
  },
  {
    "timestamp" : "10:47-10:56",
    "speaker" : "Greg",
    "text" : "I mean God. In pliability, you you don't have you don't stand a chance And don't even talk about his elasticity, bro. You fucking get your mind blown."
  },
  {
    "timestamp" : "10:57-10:58",
    "speaker" : "Steve",
    "text" : "We're gonna put you in the pretzel."
  },
  {
    "timestamp" : "10:58-11:00",
    "speaker" : "Greg",
    "text" : "He's a fucking gumby out there."
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know. It felt different. Like I didn't really care that he retired, you know? I think the Patriots, it was it wasn't like a Yeah, it felt like he I mean he's already left. So Yeah",
    "timestamp" : "11:01-11:11"
  },
  {
    "timestamp" : "11:12-11:16",
    "speaker" : "Greg",
    "text" : "It was kind of a relief. Like I don't need him winning more Super Bowls. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "I don't want him ruining his Patriots legacy with somebody else. Exactly.",
    "timestamp" : "11:18-11:21"
  },
  {
    "text" : "Splitting the legacy, you know?",
    "timestamp" : "11:21-11:22",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Right, exactly. Yeah.",
    "timestamp" : "11:23-11:24"
  },
  {
    "speaker" : "Steve",
    "text" : "Do you think he signs a one-day contract? Yes or no?",
    "timestamp" : "11:25-11:28"
  },
  {
    "timestamp" : "11:29-12:00",
    "text" : "I would think so. Well let's let's talk about let's talk about the farewell Um post, right? Right. The one that yeah, they got everybody on the page. Seven seven pages long. He thinks the Buccaneers, coaches, front front office, the The guy that stretches him, the water boy, the cheerleaders, the fans, the radio station. Thanks, everybody under the sun. Yeah. And no mention of the Pats. Yeah. She's got some people a little butthurt.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "How did you feel about it? Oh yeah.",
    "timestamp" : "12:01-12:07"
  },
  {
    "timestamp" : "12:08-12:27",
    "speaker" : "Greg",
    "text" : "I mean I wasn't I wasn't butthurt. Like I don't care. I was a little disappointed. Like I didn't really do it. But I thought it was kind of like he's so he's so thoughtful in like how he what he puts out into the world that it did feel like that was intentional. Because it was nothing."
  },
  {
    "timestamp" : "12:27-12:38",
    "speaker" : "Andy",
    "text" : "So the picture that he means out of himself. The the the the first picture of himself was from uh the game in Foxboro against the Patriots as a buccaneer."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "12:38-12:41",
    "text" : "Oh I didn't realize that. It's interesting. Right."
  },
  {
    "text" : "So I don't know.",
    "speaker" : "Andy",
    "timestamp" : "12:41-12:42"
  },
  {
    "speaker" : "Greg",
    "text" : "Is he sending a message? I I don't know. No, he doesn't seem like he would be someone that would do that though.",
    "timestamp" : "12:42-12:47"
  },
  {
    "timestamp" : "12:47-12:52",
    "speaker" : "Steve",
    "text" : "No. He's doing it to like create buzz and people talking about it. So I said people have just been talking about the shit endlessly."
  },
  {
    "speaker" : "Andy",
    "text" : "That's true, yeah. Yeah, yeah. How many how many news cycles did that?",
    "timestamp" : "12:53-12:56"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "12:57-13:11",
    "text" : "How many eyeballs? How many times is Tom Brady and now he's got all these people looking at his TV or his Brady brand now? Yep. And then that's why I think he does sign a one-day contract, because that's a whole nother news cycle of like, oh, now he is signing the one-day contract. Now we have to listen to his speech or whatever."
  },
  {
    "speaker" : "Greg",
    "text" : "Good point, Steve. I like this angle. I like this angle.",
    "timestamp" : "13:12-13:15"
  },
  {
    "text" : "And then there'll be another one when they retire his number in Young. Do they retire his number in Tampa? That would be embarrassing. Holy shit.",
    "timestamp" : "13:15-13:25",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "13:25-13:28",
    "speaker" : "Steve",
    "text" : "They go unretired John Gruden and then retire Brady."
  },
  {
    "text" : "We got a spot for you right here, Tom.",
    "timestamp" : "13:31-13:33",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "13:33-13:35",
    "text" : "And to fill it. I just, you know.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, what if you can reuse any of the name the letters in in John Gruden? You can use the O in John. Well, we can probably take some from Warren Sap too. Oh fuck. Beautiful. Yeah, what a that the Buccaneers are gonna be a dumpster fire again, right?",
    "timestamp" : "13:36-13:55"
  },
  {
    "text" : "We're just I feel like the cap's gotta be a mess, right?",
    "speaker" : "Steve",
    "timestamp" : "13:55-13:59"
  },
  {
    "text" : "Yeah, because I they basically sold out to get Brady and then to load up that team to get him to the Super Bowl that first year. And that window just slammed.",
    "timestamp" : "13:59-14:08",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:08-14:13",
    "speaker" : "Greg",
    "text" : "It worked though. I mean, it won a Super Bowl. Yeah. And though you see the same thing with the Rams. They're basically like"
  },
  {
    "text" : "Throwing first round picks at it, yeah.",
    "speaker" : "Steve",
    "timestamp" : "14:15-14:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Mm-hmm. How long is it how long does it work for the Rams, do you think?",
    "timestamp" : "14:17-14:20"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "14:21-14:26",
    "text" : "It's the same idea, one and done. Like that's again a tough team to keep together and do consistently."
  },
  {
    "text" : "I'll be interested to see how it works out because I don't know that anyone's really done it to that degree of like let's just not have draft picks. Yeah. Just sell it. I'll be interested to see. Yeah. Cause I mean they still have a good coach.",
    "speaker" : "Greg",
    "timestamp" : "14:26-14:38"
  },
  {
    "timestamp" : "14:39-14:39",
    "text" : "Yep.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Depends I guess Stafford how long he sticks around, but if Stafford retires I could see that falling apart pretty quick.",
    "timestamp" : "14:39-14:47"
  },
  {
    "timestamp" : "14:47-14:51",
    "text" : "You need Donald playing at a high level too. Yeah. Donald sucks, dude.",
    "speaker" : "Steve"
  },
  {
    "text" : "I'm sick of people blowing Donald.",
    "timestamp" : "14:51-14:52",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "What?",
    "timestamp" : "14:53-14:53"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "14:54-14:56",
    "text" : "Oh God. Okay."
  },
  {
    "text" : "Go on. Dude, is is he Hitler, Greg?",
    "timestamp" : "14:56-14:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "He gets How does he fit into the Nazi party? He gets so much love Every single yeah, yeah, he's good, but he's not like he doesn't impact the games like Matt Stafford is way more important for that team than Aaron Donald's.",
    "timestamp" : "15:01-15:15"
  },
  {
    "text" : "It plays quarterback, no shit.",
    "speaker" : "Steve",
    "timestamp" : "15:16-15:17"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. And everybody blows Aaron Donald like he's like this like huge game changer. He put two guys on him. He's nobody.",
    "timestamp" : "15:18-15:25"
  },
  {
    "text" : "I don't know about that, Greg.",
    "speaker" : "Steve",
    "timestamp" : "15:25-15:26"
  },
  {
    "speaker" : "Greg",
    "text" : "He's good for his position. And he's a dickhead. All these choking things. Have you seen all these choking in the streets?",
    "timestamp" : "15:26-15:31"
  },
  {
    "timestamp" : "15:31-15:33",
    "text" : "Here's why Greg doesn't like him. Now we're getting to the root.",
    "speaker" : "Steve"
  },
  {
    "text" : "I haven't. I've seen like one. Yeah, the one the most recent one where he grabs the guy by the throat looking like fucking the dude from Star Wars, right? Doing, you know. So he's Darth Vader. With stop hate on the back of his helmet, which is nice. But there's another one from a couple years ago where he the game is finished. He doesn't even have his shoulder pads on. He's on the sidelines and everyone's going to the middle. He takes his helmet, puts on his helmet, and runs to the center of the field and and seeks out a guy and starts like fucking with him and choking him. What? Yeah. Jesus. He Yeah. It was like not like you I can almost understand like heat of the moment shit, you know, like it's football. Yeah. But that was like he's been sitting and stewing on this thing for like a half a game of football and then thinks to put his helmet on before going out there and choking a random dude at midfield. It's like, what are you doing, dude? That's ridiculous. Who's competitive, Greg? Yeah, I guess so.",
    "speaker" : "Greg",
    "timestamp" : "15:34-16:31"
  },
  {
    "timestamp" : "16:31-16:43",
    "text" : "You know who's a competitive? Darth Vader. That's true. And this is why you don't like him, because he's a really good player. He is good, of course. So he's like what top five defensive player in the NFL, Greg?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "16:44-16:48",
    "text" : "I'm I'm sure he's one of the best defensive players in the league, yes."
  },
  {
    "text" : "Okay.",
    "timestamp" : "16:48-16:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "16:48-17:00",
    "speaker" : "Greg",
    "text" : "But the way people talk about him like he's like Some people are like, he could be the best player in NFL history. It's like, come on. That's ridiculous. You know, like get what are we talking about here?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "17:00-17:07",
    "text" : "No, Greg, you're just mixing it up with the Tom Brady retirement news. Because there's a shitload of that going around, too."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "17:07-17:07",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "17:08-17:11",
    "text" : "A lot of full A and Brady Brady from everybody."
  },
  {
    "text" : "Mm-hmm. That's true. I'm fine with that. I like your marketing angle though, Steve. Now here's a question for you though. Do you think Do you think that's coming from Brady? Or do you think that's coming from Brady's like marketing manager, social media person?",
    "speaker" : "Greg",
    "timestamp" : "17:11-17:28"
  },
  {
    "text" : "I think it's a person. It's like a whole bunch of people.",
    "timestamp" : "17:29-17:32",
    "speaker" : "Steve"
  },
  {
    "text" : "Right, yeah, whatever you're doing.",
    "timestamp" : "17:32-17:33",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "He's certainly signing off on it.",
    "timestamp" : "17:34-17:36"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "17:36-17:36",
    "text" : "Yeah."
  },
  {
    "timestamp" : "17:37-17:38",
    "speaker" : "Steve",
    "text" : "It's some combination."
  },
  {
    "timestamp" : "17:39-18:00",
    "text" : "But do you think he's going into these meetings and being like, guys? I want it framed like this because it builds my brand. Or do you think they're coming to him and being like, hey, we could do it this way, and you're gonna get a ton of clicks, which might be slightly controversial. You know, like is it is he the driving force behind some of this or do you think he's probably just said like hey here's all your options about announcing retirement.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "18:00-18:19",
    "text" : "This isn't something you just walk up and say, hey, I think I'm gonna retire. I've been planning this for years. And they said, okay, these are your options, and you must chose the one that generates more. You probably could have posted some really crazy shit too, you know? Fuck you, fuck you, fuck you, I quit. I know. Just posting that gift."
  },
  {
    "speaker" : "Andy",
    "text" : "Posting some shit like talking bad about the Patriots would have got it. Like that like if you had just gone to Belcheck and just like called him up, be like, yo, uh, is it cool if I pretend to start some shit with you? Just like get some Gets in like uh again in the news.",
    "timestamp" : "18:22-18:38"
  },
  {
    "timestamp" : "18:38-18:39",
    "speaker" : "Steve",
    "text" : "That's Brian Flores."
  },
  {
    "text" : "So yeah, so that's the other the big P. Let's move on to that.",
    "timestamp" : "18:43-18:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:46-18:47",
    "speaker" : "Steve",
    "text" : "Let's talk about that, yeah."
  },
  {
    "timestamp" : "18:47-18:54",
    "text" : "Yeah, we'll talk about it real quick. Uh Brian Flores. Has sued the NFL, right? The owners, the NFL the itself?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "18:54-19:05",
    "text" : "He sued the NFL, the Giants, the Broncos, the Dolphins, and the races. So pretty much everybody.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, and the uh exhibit A in that was his text messages with Bill Balichek, where Bill thought he was talking to Brian Dable. And then congratulated him on getting the giant's job before he'd even interviewed.",
    "timestamp" : "19:06-19:20",
    "speaker" : "Andy"
  },
  {
    "text" : "It was like 14 days too, right?",
    "speaker" : "Steve",
    "timestamp" : "19:20-19:23"
  },
  {
    "timestamp" : "19:23-19:35",
    "text" : "I don't I don't know where my conspiracy hat is. I I I think my tin foil is still in the uh in the kitchen, but um Did Belchak do that on purpose? No. You think so?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:35-19:45",
    "text" : "No. I don't think so, but this is the best part about it, is it's plausibly deniable if he did too. Right. If you are gonna do it, that's the best sorry, wrong number."
  },
  {
    "text" : "Like if someone said, yeah, Belichick knows Is savvy enough with a phone to be able to like manipulate people, or is he so dumb at his phone that he actually accidentally takes the wrong Brian's? Which we've all done. I would say the latter.",
    "timestamp" : "19:48-20:01",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "It's so relatable. Yeah.",
    "timestamp" : "20:01-20:02"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true. Yeah, yeah. But also like he'd be like, oh fuck, I can get back at the Giants here.",
    "timestamp" : "20:03-20:08"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "20:09-20:21",
    "text" : "Oh yeah. That have you know fucking me on fire. Set it on fire. Or he could be like, some people have seen it Well he's jealous of Brady getting all the attention, so he wants to be yeah yeah that's the other conspiracy yeah have you guys ever done done that?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "20:22-20:26",
    "text" : "I'm trying to rack my brain for like for like uh I do it on Slack."
  },
  {
    "timestamp" : "20:26-20:45",
    "speaker" : "Andy",
    "text" : "Yeah on Slack I I I've tag uh Slacked uh people talking about them to them. Brutal. Yeah. Work people too. Oh shit. Or thinking I mean like a one-on-one conversation with somebody and realizing that the other person's in there too. Oh I've done that."
  },
  {
    "text" : "Nothing bad though. But someone at my work, I just thought of this. They used to like you'd have to like company is like 150 people and you're supposed to like email when you're gonna be out on vacation just so everyone knows. So one guy like emails like the whole company is like, I'm gonna be out on such and such dates, yada, yada, yada. And then one of his one of his buddies that's working with him replies all and goes No one no one cares about your stupid ass vacation, bro. And everybody in the fucking company got the email. We're all like, oh shit. Like, Dave, why did you do that? And like Apparently like when he figured it out, he was just like mortified.",
    "speaker" : "Greg",
    "timestamp" : "20:45-21:34"
  },
  {
    "text" : "See, I've done that, but on purpose. We had uh like usually we would have um like if people do that, they just email their department. But there was those one developer, Rick, who would email the entire company when he was like, you know, sick or not coming in. So I uh photoshopped his face onto Slick the Slick Rick CD cover, but made it Sick Rick. And send it back. Be like, I hope you feel better, Rick. Replied all to everybody. And uh he never sent one to the whole company again. That's smart. Yeah, problem solved. Poor Rick.",
    "timestamp" : "21:36-22:13",
    "speaker" : "Andy"
  },
  {
    "text" : "He's sick and he's getting fucking bundled on reply all. He deserved it. Bodied out there.",
    "speaker" : "Greg",
    "timestamp" : "22:13-22:19"
  },
  {
    "text" : "This is also the type of guy who would uh come in first thing in the morning and crack a diet coke. And how six or seven during the day, just like his his blood must have been like battery acid.",
    "timestamp" : "22:19-22:31",
    "speaker" : "Andy"
  },
  {
    "text" : "Dude, some people love Diet Coke.",
    "speaker" : "Greg",
    "timestamp" : "22:31-22:33"
  },
  {
    "timestamp" : "22:33-22:33",
    "speaker" : "Andy",
    "text" : "They love that shit."
  },
  {
    "speaker" : "Greg",
    "text" : "They crush it. Yeah. It's a legally legitimate addiction. I lived with a guy who was addicted to Diet Coke. It was crazy. McBrown. No, not it was really he went through a a Diet Coke phase. Yeah, yeah. But this guy lived with with like You'd be like, dude, I'm doing so good. I haven't had that coke in forever. And then I'd watch him relapse. And he would just go get two, like two liters and drink them in like a sitting. And I was like, oh shit. He's like bro, I I blew it.",
    "timestamp" : "22:34-23:07"
  },
  {
    "text" : "I mean it could be worse, like that's a that's a that's an addict right there. Yeah.",
    "timestamp" : "23:10-23:14",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, could be coke is yeah. Yeah. Sure beats Beth. Jesus Christ. Do you think Flores is gonna win his suit?",
    "timestamp" : "23:14-23:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "23:26-23:26",
    "text" : "No."
  },
  {
    "speaker" : "Steve",
    "text" : "I don't think it'll be he'll ever coach. Or is he gonna be Colin Kaepernick?",
    "timestamp" : "23:26-23:30"
  },
  {
    "timestamp" : "23:31-23:38",
    "speaker" : "Andy",
    "text" : "It's a good question. I would love to see the Patriots bring him back as a like a coordinator or something."
  },
  {
    "speaker" : "Steve",
    "text" : "I think it's a bold move because I think he definitely gets black balls, right? He's trying to like get the jobs from.",
    "timestamp" : "23:39-23:46"
  },
  {
    "text" : "Well he's gotta think then that he's got a chance of some sort of like compensation from it, right?",
    "speaker" : "Greg",
    "timestamp" : "23:47-23:52"
  },
  {
    "timestamp" : "23:53-23:55",
    "speaker" : "Steve",
    "text" : "You don't make this move unless you're pretty confident."
  },
  {
    "text" : "And what I've heard is that uh people are saying he might be able to even if he doesn't coach again in the NFL, he could go coach in college.",
    "timestamp" : "23:55-24:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "24:03-24:12",
    "text" : "Yeah, but I don't know. I feel like it still carries the reputation down there, right? Of like this guy might be a malcontent."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Well, I mean with all the stuff coming out about it though, where the um Dolphins owner was talking about paying him 100K. to like for each loss so that they could tank the season. That's the best.",
    "timestamp" : "24:13-24:25"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "24:25-24:26",
    "text" : "That's my favorite part of the whole thing."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:28-24:39",
    "text" : "And that's the same owner who um like bought into some like sports gambling company too. So it's just like massive conflicts of interest. So I think that's the bigger part."
  },
  {
    "text" : "What is he trying to prove that",
    "timestamp" : "24:42-24:44",
    "speaker" : "Greg"
  },
  {
    "text" : "That well he's trying to prove that that's why he got fired is because you know it was like it was supposed to be like hard to work with, but really it was because he actually had some fucking morals. And wasn't going to be able to do that. So he's like arguing I w I was I wasn't fired fairly?",
    "timestamp" : "24:46-25:00",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "25:00-25:06",
    "speaker" : "Greg",
    "text" : "Right. Yeah. So what does like Brian Dayball and all that have to do with anything then? But I think that's that's a separate piece."
  },
  {
    "timestamp" : "25:06-25:09",
    "speaker" : "Andy",
    "text" : "Discriminated against. Yeah. He's been discriminated against."
  },
  {
    "timestamp" : "25:10-25:27",
    "speaker" : "Greg",
    "text" : "See, that's what I can't understand though. He's being discriminated against by getting fired or not getting hired. Both. It seems like this is just like a a litany of um shit that's happened to him, but I don't understand like if there's a focus behind it. I think it's a I think it's a bit of all of it."
  },
  {
    "speaker" : "Steve",
    "text" : "I think it's discrimination getting the job and then wrongful termination.",
    "timestamp" : "25:27-25:30"
  },
  {
    "timestamp" : "25:31-25:31",
    "speaker" : "Greg",
    "text" : "Right."
  },
  {
    "timestamp" : "25:31-25:36",
    "text" : "Because he wasn't he wouldn't do something immoral or illegal. Right. It's gotta be illegal to pay your coach to fucking lose.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "25:37-25:44",
    "text" : "Yeah, that that sounds like something you could win if you could prove that. Right. To not to not get hired, I think, is like that's gonna be a tough set."
  },
  {
    "text" : "Well that's always a super hard to prove until you have mistaken text from the thing. Exactly. Yeah, I think that text right And then the whole thing with the before you're gonna interview, you're like, what the fuck are we doing here, guys? Just say you you're you're hiring and you're only just giving me a token interview, wasting my fucking time.",
    "timestamp" : "25:44-25:58",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Right, because of the Rooney rule, right?",
    "timestamp" : "25:59-26:00"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "26:00-26:01",
    "text" : "Right, yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:01-26:28",
    "text" : "But it's it's they're not taking it seriously. Well, of course they're not. Everybody knows that that rule was bogus. Like that's the that's honestly the dumbest way ever to try and like have a more diverse head coach. We like let's force them to interview people as token interviews. It's like that's that you have to like create a better pool of like diverse candidates that they can select from, you know? Uh-huh."
  },
  {
    "text" : "Yeah. But that's that being said, it is it's hard to prove that until you have text from Bill Palachet. Exactly. Four days before your interview saying, Congrats on the job. Oh, just kidding, it's the white guy with a very similar name.",
    "timestamp" : "26:29-26:42",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:42-27:11",
    "text" : "Yeah. And then the whole thing with the Broncos. What is that what does that prove though that they weren't they never wanted to hire him in the first place? Not that he didn't get to the first time. But like it that's not even like wronging him necessarily. I mean it waste his time, but you know what I'm saying? Right. But I I well I think that's why he's doing it. though is is kind of him getting fired i that seems pretty clear to me he's losing out on the money he would have had from the contract and he wants to that money reimbursed"
  },
  {
    "timestamp" : "27:11-27:22",
    "speaker" : "Steve",
    "text" : "If this would be the Patriots instead of the Giants, like the Giants can't even do racism, right, right? They even fucked that shit up. We would be fine so many first-round picks and a bajillion dollars and like"
  },
  {
    "timestamp" : "27:23-27:25",
    "text" : "Yeah, do you think there's gonna be any sort of fallout for any of these teams?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "27:25-27:31",
    "text" : "There has to be bad fallout, but one for the coach or the owner paying the coach to lose. That's incredible."
  },
  {
    "timestamp" : "27:31-27:37",
    "text" : "Yeah. The NFL can't have that, right? But they've already come out and said uh the NFL's already come out and like issue a statement where it's like, oh, this is bogus.",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh yeah, they're closing ranks around their own, right?",
    "timestamp" : "27:38-27:39",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "27:40-27:41",
    "speaker" : "Andy",
    "text" : "Yeah, exactly. That's what I think they'll do."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. I think they're gonna they're gonna all Close ranks and be like, no, we're in this together, nobody's gonna be able to get it.",
    "timestamp" : "27:42-27:47"
  },
  {
    "timestamp" : "27:47-27:51",
    "speaker" : "Andy",
    "text" : "And how much uh yeah, how much shit have they swept under the rug with Dan Snyder, right?"
  },
  {
    "text" : "Exactly. And Colin Kaepernick, they're all like, well, we're just gonna do it all the same here. Yeah. No one gets in trouble as long as no one breaks ranks. Exactly.",
    "speaker" : "Greg",
    "timestamp" : "27:51-28:01"
  },
  {
    "speaker" : "Steve",
    "text" : "Some bullshit, it's a fucking monopoly, right?",
    "timestamp" : "28:01-28:03"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "28:03-28:37",
    "text" : "Dude, I kind of like how we're getting like a better look at like some of these like front office scumbags. Or just like the the shit that goes on because you kind of always knew that like they always like put this professional face out there. Yeah. You know, and all these like really polished statements and stuff. But you're like behind closed doors, they're probably just like like anybody. They're just like, you know, scheming and doing bullshit and like the way they talk to each other, you know, and with the gr gruden stuff and now this, we're like, all right. Yep. This is how the sausage is made."
  },
  {
    "text" : "Oh yeah.",
    "speaker" : "Andy",
    "timestamp" : "28:37-28:37"
  },
  {
    "text" : "Yeah. Let's see you try and pull a fucking nice polished statement after this one, dickheads.",
    "timestamp" : "28:37-28:43",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:44-29:00",
    "text" : "I love it. And it's Delchek that's bringing the whole fucking thing down. It's like just being a fucking old idiot on his phone. Beautiful. All done. Everybody can relate to that too. So relatable stuff. I bet Flores comes back. I bet Belchik would probably bring him back and Kraft bring him back."
  },
  {
    "timestamp" : "29:00-29:01",
    "speaker" : "Andy",
    "text" : "That would be the best thing."
  },
  {
    "text" : "Yeah. Kraft bring him back.",
    "speaker" : "Steve",
    "timestamp" : "29:01-29:03"
  },
  {
    "timestamp" : "29:04-29:20",
    "text" : "I could see that. Kraft almost feels to me like he's Like towards the end of his tenure, you know, he's he's getting up there in age and seems like his his faculties are going a little bit and I think it's probably Jonathan that's going to be taking over eventually, sooner rather than later, I imagine.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:20-29:23",
    "text" : "But Flores is the defensive coordinator and Bill O'Brien as the offensive coordinator."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "29:23-29:36",
    "text" : "That could be pretty good. But you already have Mayo and uh Stevie B as the you know de facto defensive coordinators that nobody will actually call a defensive coordinator."
  },
  {
    "text" : "The defense didn't seem to evolve the end of the season, right? They went down pretty they fell off at the end, yeah. Yeah. And I think some of that was coaching.",
    "timestamp" : "29:38-29:46",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "29:46-30:01",
    "speaker" : "Greg",
    "text" : "I think that's a bigger if you want to talk about like, okay, yeah, they can't get like diverse head coach hires, it's because of things like Steve Bill Belichick, where they're like, this guy's only getting these The advancements because he's the coach's son."
  },
  {
    "timestamp" : "30:01-30:35",
    "speaker" : "Andy",
    "text" : "Oh, there's a there's a ton of nepotism in there. Yeah. I I don't even think it's necessarily like that he's related, it's just that A lot of guys. Like, I mean look at um Coaching Trees. Yeah, like the who the Vikings just hire. The Vikings just hired um McVeigh's uh offense coordinator, who the fuck it was. Yep. Who's like never called plays or anything, but he's he's still like now becoming a head coach because he's from the McVeigh tree. You know, so it's like it's all just the the boys' club, right? The good old boys club. Yeah. So it's it's who you know, not what you know."
  },
  {
    "text" : "Which like I kind of like agree with. It's like I don't know, it's hard to it's",
    "speaker" : "Greg",
    "timestamp" : "30:36-30:41"
  },
  {
    "timestamp" : "30:41-30:51",
    "speaker" : "Andy",
    "text" : "I mean if you're yeah, if you're putting your your billion dollar franchise in somebody's hands, you want it to be somebody who like, you know, you kind of have an idea of purpose."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "30:51-30:53",
    "text" : "What do you throw a hundred thousand dollars at home?"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, right, is that. And then Hugh Jackson comes out, it's like, oh yeah, I got paid to lose too. It's like, yeah, sure you did.",
    "timestamp" : "30:53-30:58"
  },
  {
    "timestamp" : "31:01-31:04",
    "speaker" : "Steve",
    "text" : "Don't come at me with that, Hugh. You just sucked."
  },
  {
    "speaker" : "Andy",
    "text" : "Well then you must have made a ton of money, sir.",
    "timestamp" : "31:05-31:08"
  },
  {
    "text" : "Yeah, show me the yacht and I'll believe you.",
    "speaker" : "Greg",
    "timestamp" : "31:09-31:12"
  },
  {
    "speaker" : "Mom",
    "text" : "How many houses did that buy you?",
    "timestamp" : "31:16-31:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Oh. Yeah, I saw that The the meme where it's like um you know Brian Floor is like, oh I was getting paid a hundred thousand dollars per game to lose, and then it was like uh Hugh being like, oh, I got paid 50K and then there was like Adam Gase like you guys are getting paid. We're Adam. Yeah. Well there there's uh rumors that he might be the next New England's offense coordinator.",
    "timestamp" : "31:18-31:45"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "31:45-31:51",
    "text" : "Yeah, I've heard that too. Oh god. It's a tough PR move, but Belchak's never been afraid of that."
  },
  {
    "timestamp" : "31:51-31:57",
    "speaker" : "Andy",
    "text" : "Yeah, it's not even a PR move. That's a tough football move for me. Crazy eyes. I don't yeah, I don't know about that."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, he's just he has not done himself any favor with the media appearance.",
    "timestamp" : "31:57-32:00"
  },
  {
    "speaker" : "Andy",
    "text" : "Because hasn't like wasn't there a thing where like all the quarterbacks who uh left his system did better. I know Tannehill with the dolphins was one. And then I can't remember who it was. Maybe it was Darnold with the Jets and like he actually started off well with the Panthers. Always like, oh look, as soon as you leave Adam Jason's system, you actually you thrive.",
    "timestamp" : "32:00-32:24"
  },
  {
    "text" : "Yeah, it's been sort of riding the Peyton Manning.",
    "timestamp" : "32:24-32:27",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "32:27-32:28",
    "speaker" : "Andy",
    "text" : "Right, exactly."
  },
  {
    "timestamp" : "32:31-32:49",
    "speaker" : "Steve",
    "text" : "I like Bill O'Brien because then you get a little bit of the college game pulled forward, you know. There there need they can be more of that in the Pats offense. And it's true. He knows Mike Mac Jones knows that really well. I don't think there ever Hmm. Were they ever there at the same time? Was B O B?"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't believe so, no.",
    "timestamp" : "32:50-32:51"
  },
  {
    "text" : "I don't think it was either. No. Either way, it can't be like significantly different. So",
    "speaker" : "Steve",
    "timestamp" : "32:51-32:55"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "32:54-33:03",
    "text" : "Right. And also that Bill O'Brien was the one that implemented that dual tight end thing back in 2011 when he was here with Kronk and Aeron."
  },
  {
    "timestamp" : "33:04-33:05",
    "speaker" : "Steve",
    "text" : "And Butchin."
  },
  {
    "timestamp" : "33:09-33:19",
    "speaker" : "Andy",
    "text" : "Unlike Tom Brady's whose somehow has disappeared. Yes. Interesting. Riddle me that. How does that happen, Greg? It's all that water he's drinking."
  },
  {
    "timestamp" : "33:20-33:23",
    "speaker" : "Steve",
    "text" : "We pinpointed the year, if I remember. It was like 2003."
  },
  {
    "timestamp" : "33:23-33:38",
    "text" : "Uh yeah. No, it's actually it it kind of faded as it went on. I saw a picture of like all his headshots from each year. And it would like slowly get smaller and smaller every year. I'm gonna blame the NFL chin straps. That's what I'm blaming it. Like rubbed it down.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:39-33:45",
    "speaker" : "Steve",
    "text" : "That's some solid spin there, Andy. He's gonna hire you. You're you're on my team."
  },
  {
    "timestamp" : "33:47-33:52",
    "speaker" : "Andy",
    "text" : "As he should. I'm good at this uh stirring up social media game."
  },
  {
    "text" : "I'm good at social media. How many Twitter followers do we have, Andy? What's our social media footprint?",
    "speaker" : "Steve",
    "timestamp" : "33:52-33:58"
  },
  {
    "timestamp" : "33:58-34:01",
    "speaker" : "Andy",
    "text" : "We have, let's find out."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh boy, how do I use Twitter? Ray, do you want to guess?",
    "timestamp" : "34:01-34:04"
  },
  {
    "timestamp" : "34:04-34:15",
    "speaker" : "Andy",
    "text" : "Yeah. How many how many Twitter follows do you think we have? I'm not good at this because I don't ever go on Twitter. This account has been Alive since December 2017, apparently."
  },
  {
    "text" : "Uh well that that image thing probably got a bunch, right? Got a handful. Three hundred.",
    "timestamp" : "34:16-34:26",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Steve.",
    "timestamp" : "34:28-34:29"
  },
  {
    "timestamp" : "34:29-34:33",
    "text" : "Oh geez, I was gonna say seven hundred",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "34:34-34:38",
    "speaker" : "Andy",
    "text" : "I wish. We have four hundred and forty-four followers."
  },
  {
    "timestamp" : "34:39-34:41",
    "text" : "Oh, four hundred and forty-four.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:41-34:42",
    "text" : "That's the fucking best number to see."
  },
  {
    "speaker" : "Steve",
    "text" : "We should not accept any more followers.",
    "timestamp" : "34:45-34:46"
  },
  {
    "timestamp" : "34:47-35:23",
    "text" : "Thanks to Samantha A, who followed us about uh 10 minutes ago. What's up, Sam? Yeah. What's up, baby? People are enjoying the fact that uh I've just been because to prepare prepare for this podcast, I decided to do what I do best, and that's nerd. Um so I was going through all the uh my favorite Tom Brady stats. And uh the one that I found today was um Tom Brady is third uh all time in the NFL with most rushing rushing touchdowns over the age of 35. That's pretty good. 21 rushing touchdowns.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:23-35:26",
    "speaker" : "Greg",
    "text" : "Behind over rushing yards over 40."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:27-35:28",
    "text" : "Uh"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "35:29-35:33",
    "text" : "He is or like in like receiving too or something like that too."
  },
  {
    "text" : "He is uh second in receiving yards behind Jerry uh after turning four years old. Jerry Rice is first with 2169. Tom Brady is second with six. Brett Favre is third with negative two.",
    "speaker" : "Andy",
    "timestamp" : "35:33-35:46"
  },
  {
    "text" : "I want to see that play. A 40-year-old Brett Favre catching the two-yard backward pass.",
    "timestamp" : "35:48-35:52",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:52-36:06",
    "text" : "I believe it was a stop too. I I think it was like uh a pass that got deflected that he caught himself. Oh he's the love doing that. Oh you love that shit. He was a football player, Greg. It was all backyard football. Gunslinger, dude. Gunslinger."
  },
  {
    "speaker" : "Steve",
    "text" : "That's backyard football.",
    "timestamp" : "36:06-36:07"
  },
  {
    "timestamp" : "36:07-36:08",
    "speaker" : "Andy",
    "text" : "That's backyard football."
  },
  {
    "text" : "Citching your own pass, run around, throw it again.",
    "timestamp" : "36:08-36:11",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So do you guys have any favorite like Tom Brady like stats that don't seem real but are?",
    "timestamp" : "36:12-36:17"
  },
  {
    "text" : "No, Andy, I don't nerd out like you. Jesus. Just tell me your stat. You're fucking useless.",
    "timestamp" : "36:19-36:25",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "36:25-36:42",
    "text" : "Greg, do you have any? Well, my stat was that the last time that Tom Brady wasn't in the NFL, I still had a bowl cut. Which is Which is outrageous to think about. That's outrageous. Just think of the last time you saw somebody with a bowl cut. I do have a bowl cut.",
    "speaker" : "Greg"
  },
  {
    "text" : "Like freshman year of college.",
    "timestamp" : "36:43-36:44",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "36:44-36:45",
    "text" : "Oh yeah, didn't you bring that back?"
  },
  {
    "text" : "You brought it back.",
    "timestamp" : "36:46-36:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "That was like a Couple days to be funny. Yeah. But back when I was like 12 or whatever, I had a legitimate ball cut.",
    "timestamp" : "36:47-36:56"
  },
  {
    "timestamp" : "36:59-37:04",
    "speaker" : "Steve",
    "text" : "No, that was me. Yeah. I had a bowl cut at some point as well."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:04-37:15",
    "text" : "Pretty sure we all did. I'm pretty sure that was just the haircut your mom had you get at Supercuts in the early 2000s. Nope. Just default."
  },
  {
    "speaker" : "Steve",
    "text" : "It's a hell of a look, I tell you. It's a ridiculous look.",
    "timestamp" : "37:15-37:19"
  },
  {
    "text" : "Well, I think because they used to put a bowl over your head and then just like clip around it, hence the bowl cut.",
    "speaker" : "Andy",
    "timestamp" : "37:26-37:31"
  },
  {
    "timestamp" : "37:31-37:34",
    "speaker" : "Steve",
    "text" : "Is that how you cut your bowl cut? When you're in college grad?"
  },
  {
    "timestamp" : "37:34-37:35",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "37:35-37:36",
    "text" : "With a bowl on the bowl on?",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "37:37-37:37"
  },
  {
    "timestamp" : "37:37-37:43",
    "speaker" : "Steve",
    "text" : "Who cut it for you? Kelly. Kelly did. This is before you guys are even dating, right?"
  },
  {
    "timestamp" : "37:45-37:49",
    "speaker" : "Greg",
    "text" : "Maybe right around the same time. So she knew what she was getting into."
  },
  {
    "text" : "Yeah. Way to Uber, Greg.",
    "speaker" : "Steve",
    "timestamp" : "37:49-37:52"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "37:53-38:03",
    "text" : "It looked bad. It wasn't good. Those are like photos that I don't even share. Because I can't have them getting out."
  },
  {
    "speaker" : "Mom",
    "text" : "Have that one.",
    "timestamp" : "38:04-38:04"
  },
  {
    "text" : "That's how I know it.",
    "timestamp" : "38:05-38:05",
    "speaker" : "Steve"
  },
  {
    "text" : "That's how bad they are. We could talk about the ball.",
    "timestamp" : "38:06-38:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "And this is the man who has a whole lot more followers. They'll get up to our 700.",
    "timestamp" : "38:10-38:15"
  },
  {
    "text" : "Oh, you think so? A picture of Greg and a bull? Adult picture of Greg with a ball. Don't even think about it. I mean I'm pretty sure we have you as um your half beard face on most of our social media. That's fine. That's fine.",
    "timestamp" : "38:15-38:31",
    "speaker" : "Andy"
  },
  {
    "text" : "Bull cut, not so much. Yeah. The bulk was at a low point in my life.",
    "timestamp" : "38:32-38:37",
    "speaker" : "Greg"
  },
  {
    "text" : "So when you met Kelly. The bulk out was a low point in your life.",
    "timestamp" : "38:38-38:42",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Oh fuck.",
    "timestamp" : "38:42-38:44"
  },
  {
    "text" : "It's all been downhill since then, right, Greg?",
    "timestamp" : "38:45-38:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. No good. Kelly doesn't listen to this podcast, does she? No.",
    "timestamp" : "38:47-38:52"
  },
  {
    "text" : "She doesn't know.",
    "speaker" : "Steve",
    "timestamp" : "38:53-38:53"
  },
  {
    "text" : "Of course not, Andy. Come on now. Well, you didn't think mom did too until she started calling you on. Yeah, what's up, Mom?",
    "timestamp" : "38:54-39:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "She's a loyal listener now.",
    "timestamp" : "39:03-39:05"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "39:06-39:07",
    "text" : "Yeah, absolutely."
  },
  {
    "timestamp" : "39:07-39:08",
    "speaker" : "Mom",
    "text" : "Very naughty."
  },
  {
    "speaker" : "Andy",
    "text" : "That's right. It's Greg. That's what she says whenever you come home. Listen to the podcast. You know what you've been. Sometimes a naughty boy. Yeah, that's right. All right. So see if you do you don't have any any favorite Tom Brady Tom Brady moments, memories.",
    "timestamp" : "39:08-39:22"
  },
  {
    "speaker" : "Steve",
    "text" : "It's hard to choose just one, Andy. It's such a wild ride. There's a lot of them, that's true.",
    "timestamp" : "39:23-39:30"
  },
  {
    "text" : "All right",
    "timestamp" : "39:30-39:30",
    "speaker" : "Andy"
  },
  {
    "text" : "We're reliving them too. Why do I, you know?",
    "timestamp" : "39:31-39:33",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "39:33-39:34",
    "speaker" : "Andy",
    "text" : "We are reliving him, yeah."
  },
  {
    "timestamp" : "39:35-39:43",
    "speaker" : "Steve",
    "text" : "Every single moment of it. It is kind of crazy. This definitely ends maybe. Maybe he unretires. Goes to Vegas. Hooks back up with Josh."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh boy. Mike Florio's putting that take out there. Undoubtedly. I hate Mike Florio. He's such a nerd.",
    "timestamp" : "39:46-39:55"
  },
  {
    "text" : "I was just being a fucking jack.",
    "timestamp" : "39:56-39:57",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Mike Florio Mike Florio is in favor of the taunting penalties. Because he needs to clean up the game. It's like, dude. You're the only person in the world with this take.",
    "timestamp" : "39:57-40:09"
  },
  {
    "speaker" : "Steve",
    "text" : "So who is he in the Nazi regime, Greg?",
    "timestamp" : "40:09-40:11"
  },
  {
    "speaker" : "Andy",
    "text" : "No, he's just a fucking nerd. He's a guy that's uh That that ran all the crunch all the numbers for the trains. Very efficiently run though. See, there you go. My floral. Kelly knows she's being talked about.",
    "timestamp" : "40:12-40:32"
  },
  {
    "timestamp" : "40:32-40:33",
    "speaker" : "Greg",
    "text" : "Me?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:33-40:35",
    "text" : "No, the other Kelly."
  },
  {
    "speaker" : "Greg",
    "text" : "I don't know. Last name Kelly?",
    "timestamp" : "40:36-40:39"
  },
  {
    "speaker" : "Steve",
    "text" : "Kelly, um, Greg had a question. Yeah. Or is he closer to Tom Brady athletically than you are to Giselle flux-wise?",
    "timestamp" : "40:39-40:49"
  },
  {
    "speaker" : "Greg",
    "text" : "What's a crazier statement? I'm better athlete than Tom or you're better looking than Giselle. You're a better athlete than Giselle.",
    "timestamp" : "40:51-40:58"
  },
  {
    "text" : "There was no pause there or nothing.",
    "speaker" : "Andy",
    "timestamp" : "41:01-41:02"
  },
  {
    "speaker" : "Greg",
    "text" : "You know? Right. Okay. I agree, Kelly. Ultimately, we ended up coming to the conclusion that that was",
    "timestamp" : "41:03-41:13"
  },
  {
    "speaker" : "Andy",
    "text" : "the case. Well we came to the conclusion we weren't touching that answer with a 10-foot pole, but that's true.",
    "timestamp" : "41:14-41:20"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "41:20-41:23",
    "text" : "And I just thought it uh verbally. It's the truth."
  },
  {
    "timestamp" : "41:23-41:24",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "It's okay. I understand. Okay.",
    "speaker" : "Steve",
    "timestamp" : "41:24-41:29"
  },
  {
    "timestamp" : "41:29-41:33",
    "speaker" : "Greg",
    "text" : "All right. Bye, Kelly. Bye, Kelly. Good night."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, goodness. Well, all right. So what else you got? You guys want to do uh your Tom Brady best and worst?",
    "timestamp" : "41:33-41:40"
  },
  {
    "timestamp" : "41:41-41:47",
    "speaker" : "Greg",
    "text" : "No, we already did that when he left the Patriots. Did we? Let's go through my topic list from the chat, the group chat."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "41:47-41:50",
    "text" : "Okay. I feel like we've covered a lot of it, but go on."
  },
  {
    "speaker" : "Greg",
    "text" : "Okay, one Tom Brady retirement general thoughts. We got that. Two, Josh McDaniels moving on thoughts and Las Vegas predictions. How do you think he's going to do there? Mediocre.",
    "timestamp" : "41:50-42:03"
  },
  {
    "text" : "I think he'll do pretty good. I think take two. He'll be much better.",
    "timestamp" : "42:03-42:06",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "42:06-42:09",
    "speaker" : "Greg",
    "text" : "Me too. I think Derek Carr is pretty good actually."
  },
  {
    "timestamp" : "42:09-42:13",
    "text" : "He's sneaky, like not he doesn't have a super high skin, but he's also got a pretty high floor.",
    "speaker" : "Steve"
  },
  {
    "text" : "I think it depends. The coach was good though. Yes. I feel bad for that guy, the interim coach. He like really held that shit together and like did a good job. Didn't give him a chance. Yeah. Yeah. And apparently all the players loved them too. Yep. Yeah. I think you'd have to for them to be able to keep that team together. All right, number three, Brian Flores. Is he racist or am I racist?",
    "timestamp" : "42:13-42:36",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I think we've covered that one. You are very racist.",
    "timestamp" : "42:36-42:39"
  },
  {
    "speaker" : "Greg",
    "text" : "Yes. Um four, here's a good one. Creative ways to waste time in the offseason. Now that you know NFL is about to be over, what are you guys going to be doing? How do you spend your time?",
    "timestamp" : "42:39-42:51"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm gonna be wiping shit off of my son's bottom side for the foreseeable future.",
    "timestamp" : "42:52-42:58"
  },
  {
    "speaker" : "Steve",
    "text" : "Amy's gonna get elbow deep in the poop game.",
    "timestamp" : "42:59-43:01"
  },
  {
    "speaker" : "Andy",
    "text" : "That's it. What I call it Daddy Diaper Depot. You fill them, we spill 'em. Yeah. Yep. Old stinky fingers, McGee. That's right. Yeah. So that's how I'm going to be spending my off season. Stacking piles of shit. That's sweet, Andy. Yeah. Steve.",
    "timestamp" : "43:02-43:20"
  },
  {
    "timestamp" : "43:23-43:24",
    "speaker" : "Steve",
    "text" : "Smash that shit to bits."
  },
  {
    "text" : "Ooh. That's the fun part. Putting it back together, it sucks.",
    "timestamp" : "43:24-43:27",
    "speaker" : "Andy"
  },
  {
    "text" : "Wordle? Oh yeah. I'm fucking addicted to Wordle.",
    "timestamp" : "43:29-43:34",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:35-43:36",
    "text" : "I've never done it."
  },
  {
    "text" : "Just got sold. Yeah, New York Times. Yeah. They'll probably charge money for it.",
    "speaker" : "Greg",
    "timestamp" : "43:36-43:41"
  },
  {
    "timestamp" : "43:41-43:51",
    "speaker" : "Andy",
    "text" : "Yeah, and then they'll kill it. But then a nerd, Greg, that your least favorite people will clone it and make it free again. So it will live on forever."
  },
  {
    "timestamp" : "43:51-43:56",
    "text" : "Oh yeah. Yeah. Um Survivor, you guys watch Survivor ever?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "43:57-43:59",
    "text" : "No. No. Like a TV show?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "43:59-44:05",
    "text" : "Yeah. Tell me what what season Survivor is on. Is it like 40 something?"
  },
  {
    "text" : "No, because it's close to Tom Brady's career. I remember this at the beginning of this.",
    "timestamp" : "44:06-44:10",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:10-44:11",
    "speaker" : "Greg",
    "text" : "Really?"
  },
  {
    "speaker" : "Steve",
    "text" : "I think it was like a year after Brady's career started, Survivor started. He did 22 seasons, so I'm gonna say 21.",
    "timestamp" : "44:11-44:19"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "44:19-45:25",
    "text" : "It's 42. Yeah. I think they do two a year, Steve. Oh, do they? Yeah. Yeah. Because you're right. They started coming out like early 2000s. Okay. It's still going. Still going, dude. And I don't know, but I saw a commercial for it when I was watching football. Oh, that's another thing I wanted to bring up. Uh oh. Jake from State Farm? Dude. That guy got fucking railroaded. Wait, what? Okay. Remember Jake from State Farm? The original Jake? The the white guy? The nerdy white guy. But what are you wearing, Jake? Yeah, what are you wearing, Jake? Yeah. That guy was a real state farm employee. Right. They just pulled to do the commercial. Yeah, he actually did that job. Oh damn. And everybody loved the commercial. And then They just go and hire this like fucking actor, this like really good looking actor to replace them and they don't even change the guy's name. He's still Jake from State Farm Meanwhile, this guy who made the thing famous has to go slopped back to his desk. Now he's just fucking probably making like 30k a year."
  },
  {
    "text" : "It's and you know bullshit. Every time he picks up the phone, he's like, uh State Farm, this is Jake. Like, oh wait, are you Jake from State Farm? He's like, Yeah, what are you wearing, Jake?",
    "timestamp" : "45:25-45:34",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:35-45:39",
    "speaker" : "Steve",
    "text" : "Yeah, but he's done that for everybody at the company named Jake."
  },
  {
    "timestamp" : "45:39-45:41",
    "text" : "Yeah, but he should get paid for that. He probably does.",
    "speaker" : "Greg"
  },
  {
    "text" : "He brings royalty.",
    "timestamp" : "45:41-45:42",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "He did a great job in that commercial. The delivery was great. The look was great.",
    "timestamp" : "45:42-45:46"
  },
  {
    "speaker" : "Steve",
    "text" : "How do you know he didn't get paid?",
    "timestamp" : "45:46-45:48"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm sure he did, but the fact the fact that State Farm thinks, oh, we've got a good thing going here, let's switch it up to this like, you know, really good looking, but not in like uh an aggressive way, like racing. I know an approachable.",
    "timestamp" : "45:48-46:00"
  },
  {
    "text" : "I know what it is, Greg. It's because the guy's black, isn't it?",
    "timestamp" : "46:02-46:05",
    "speaker" : "Steve"
  },
  {
    "text" : "Is he black? I don't even know. That's what makes a good actor and a fucking thing.",
    "speaker" : "Greg",
    "timestamp" : "46:07-46:12"
  },
  {
    "speaker" : "Steve",
    "text" : "You we've already got him about that.",
    "timestamp" : "46:14-46:16"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "46:16-46:24",
    "text" : "Oh yeah. Dude. Insurance commercials are the fucking worst. Dude, no one gives start on flow from progressive. That bitch."
  },
  {
    "speaker" : "Steve",
    "text" : "No, the worst are fragrance commercials.",
    "timestamp" : "46:25-46:27"
  },
  {
    "speaker" : "Andy",
    "text" : "Those ones Yeah, because they make no sense. Yeah, they don't like a fever dream. Like what Why why is the U2 guy playing a guitar with in front of wolves in the desert plains?",
    "timestamp" : "46:27-46:39"
  },
  {
    "text" : "What do you actually like verbally describe what you're seeing?",
    "speaker" : "Greg",
    "timestamp" : "46:40-46:42"
  },
  {
    "text" : "It's so funny.",
    "timestamp" : "46:42-46:43",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:47-47:01",
    "speaker" : "Greg",
    "text" : "Oh god. But at least they're not like built to make you angry like Flo is. Like her only intention is to anger you enough that she's memorable, which is such an obnoxious business plan."
  },
  {
    "text" : "It's true. Yeah. Now I have a I have a friend who works for Liberty Mutual and that's what he says. He's like we'd we make it as obnoxious as possible so you can't forget it.",
    "timestamp" : "47:01-47:09",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "47:09-47:09",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "And it works. He's like our numbers are are sky high right now.",
    "timestamp" : "47:10-47:13"
  },
  {
    "speaker" : "Steve",
    "text" : "This is your whole strategy as a person. That's not true.",
    "timestamp" : "47:14-47:18"
  },
  {
    "timestamp" : "47:19-47:35",
    "speaker" : "Greg",
    "text" : "That's not true at all. Do we have to get Kelly back in here, Greg? Dude, I can't even believe you'd say that. Compare me to flaw. That's a little strong. Wow. I'm not a corporate shill, Steve. I'm a man of the people."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "47:35-47:36",
    "text" : "Oh yeah."
  },
  {
    "timestamp" : "47:36-47:43",
    "speaker" : "Greg",
    "text" : "Me and Jake. I stand with Jake. The real Jake. Not the fake Jake. Fuck the fake Jake."
  },
  {
    "timestamp" : "47:45-47:46",
    "text" : "Oh boy.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah, and let's get Aaron Rodgers and Patrick Mahomes real original State Farm. Really a way to think outside the box.",
    "timestamp" : "47:46-47:54"
  },
  {
    "text" : "They could use that money to pay Jake. Yeah. Yeah, right?",
    "speaker" : "Steve",
    "timestamp" : "47:54-47:57"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "47:57-47:58"
  },
  {
    "timestamp" : "47:58-47:59",
    "text" : "It wouldn't have cost as much.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:00-48:01",
    "text" : "Man of the people.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. My boy Jake. Although I don't know. That that shit'll that shit'll ruin a person. Remember Jared from Subway?",
    "timestamp" : "48:01-48:09"
  },
  {
    "speaker" : "Steve",
    "text" : "Yep.",
    "timestamp" : "48:09-48:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:10-48:11",
    "text" : "Same thing."
  },
  {
    "speaker" : "Greg",
    "text" : "And then what happened? Here's a question. Here's a question. Oh god. Was Jared always a pedophile or did the fame make him a pedophile?",
    "timestamp" : "48:12-48:21"
  },
  {
    "text" : "That's a good question. Yeah. I mean I'm gonna guess that the fame just gave him access to act on it, you know.",
    "timestamp" : "48:22-48:28",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Right. That's what I'm thinking too. Yeah. And like Hillary Clinton, did she always eat babies or was it only when she became No, she was introduced to that by the Illuminati.",
    "timestamp" : "48:28-48:38"
  },
  {
    "speaker" : "Andy",
    "text" : "Don't get me started. Yeah. Oh fuck. All right.",
    "timestamp" : "48:39-48:46"
  },
  {
    "text" : "What what else is on your list, Greg? Okay, let's see. We got past that one. I think the next one I had. Uh how many hard-boiled eggs is too many hard-boiled eggs?",
    "speaker" : "Greg",
    "timestamp" : "48:46-48:56"
  },
  {
    "text" : "So uh I have a follow-up for this question. Um too much for what? Are we are we talking about ingesting? Oh yeah, yeah. Eve. Are we talking about like filling a swimming pool? Because I think you fill a swimming pool, that I think it'd feel kind of cool.",
    "timestamp" : "48:56-49:11",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "49:11-49:16",
    "text" : "And we're also a specific limit on how many too many when it starts spilling over the top. Maybe."
  },
  {
    "speaker" : "Steve",
    "text" : "Are you just eating the hard boiled eggs just popping in your mouth or are you making like egg salad out of them?",
    "timestamp" : "49:17-49:21"
  },
  {
    "timestamp" : "49:21-49:32",
    "text" : "Yeah. Eating them. Are we blending them? Like making pigments. Which end do you eat them with? Where which end do you stick them when you eat them?",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know, the skinny end of the top?",
    "speaker" : "Greg",
    "timestamp" : "49:33-49:35"
  },
  {
    "speaker" : "Andy",
    "text" : "I'll talk about your end, but yeah, okay.",
    "timestamp" : "49:36-49:38"
  },
  {
    "text" : "Oh, my mouth. Okay. All right. Yeah. Uh then probably. I do two a day. Egggy Greggy, the pecan man. My other thing is pecans. I love pecans. Oh man. Every day I have two hard-boiled eggs and a handful of pecans. Oh yeah, well I think it in my head quite a bit, yes. But I'm generally alone most of the day, so I'm gonna say it out louder.",
    "timestamp" : "49:38-50:08",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "50:10-50:13",
    "speaker" : "Andy",
    "text" : "How many times has Kelly heard you say the phrase eggy Greggy?"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, around Christmas, eggnog season, obviously. That got a lot of fucking She's eating the same amount though. Okay. She's eating the same amount. Four four hubboiled eggs. We got one of those little cookers from like a late night commercial. Oh, I think.",
    "timestamp" : "50:14-50:30"
  },
  {
    "speaker" : "Steve",
    "text" : "I got Ellie one of those for Christmas once.",
    "timestamp" : "50:31-50:33"
  },
  {
    "text" : "Makes them perfect every time. All right, next topic. Is Andy a traitor to the podcast for skipping two weeks for his child's birth? I'm gonna get ahead of this and say yes. Steve, thoughts? Uh yeah, double down on that.",
    "timestamp" : "50:33-50:50",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:50-50:58",
    "text" : "Yeah. Counterpoint. Andy, thoughts? Uh y'all could have done this without me, and you fucking didn't. So we tried. Did you?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Those are the day you had the baby too.",
    "timestamp" : "50:59-51:01"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh really? How'd it go? Well, we text each other and we're like, we should do an episode. I actually said I got something I want to get off my chest. It was the Jake from Staple. You've been sitting on that for three weeks.",
    "timestamp" : "51:01-51:15"
  },
  {
    "text" : "If Greg is saying we should do a podcast, he's got something.",
    "speaker" : "Steve",
    "timestamp" : "51:16-51:19"
  },
  {
    "text" : "Oh yeah.",
    "timestamp" : "51:19-51:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Always. Yeah, it's really worked up about the Jake thing.",
    "timestamp" : "51:20-51:23"
  },
  {
    "text" : "Because it's it's rarely that that Greg is the one suggests, hey, are we doing a podcast this week? It's always me and Steve being like, hey, we gonna do this? Like, okay, yes. Thursday, seven, yeah, okay. And then Greg's be like I might be there. I'll be a little late. The game though.",
    "timestamp" : "51:24-51:38",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "51:41-51:56",
    "text" : "But yeah, we we we didn't we never figured it out. I am sure we pushed it one day and then we were like, well, we'd have to figure out the zoom and record function. And I just Fuck it. Get out of recording.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's that's not a surprise at all.",
    "timestamp" : "51:57-51:59"
  },
  {
    "text" : "But we were willing, and that's what really matters. Yes.",
    "speaker" : "Greg",
    "timestamp" : "51:59-52:02"
  },
  {
    "timestamp" : "52:02-52:04",
    "text" : "There's a thought that counts, huh?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "52:04-52:25",
    "text" : "Yeah, and I think this proves that you're the trader of the podcast. It does. Yep. I think it proves that I am the most valuable player of this podcast. I think you have no honor. You don't really care about the podcast. And that you're not in it for the same reasons me and Steve are in it. Love of the game. Attack his character.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "52:25-52:26",
    "speaker" : "Steve",
    "text" : "Let's go."
  },
  {
    "timestamp" : "52:28-52:35",
    "text" : "I don't even know if he's had this child. That could be anybody's child. You can rent babies. You can rent babies.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "52:35-52:39",
    "text" : "You can rent babies? I should try renting a baby. You should try renting a baby.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "52:38-52:40",
    "text" : "See, now he's trying to play it off.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "It's a lot of work. Yeah.",
    "timestamp" : "52:40-52:41"
  },
  {
    "timestamp" : "52:41-52:42",
    "speaker" : "Steve",
    "text" : "He's trying to cover his tracks."
  },
  {
    "text" : "Yeah, we could just make a joke about it.",
    "speaker" : "Greg",
    "timestamp" : "52:42-52:44"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "52:44-52:46",
    "text" : "That's interesting. Flip-flopping like a politician."
  },
  {
    "text" : "He always does that when he lies, doesn't he?",
    "timestamp" : "52:47-52:48",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Do you think he even cares about this podcast?",
    "timestamp" : "52:48-52:50"
  },
  {
    "text" : "He doesn't. I don't think he does. And he didn't even watch the game that other week. I did watch the game.",
    "timestamp" : "52:50-52:58",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "52:58-53:00",
    "text" : "He didn't watch the game in like a month."
  },
  {
    "timestamp" : "53:00-53:05",
    "text" : "It's unbelievable. Wait, you watch the game, Greg? That one time? The whole game?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "53:06-53:10",
    "text" : "Yeah, where we did the freaky fries. Most of it. Okay."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, exactly. Do you watch the whole thing with the commercials, Andy? I didn't think so. Yeah, if the commercials are in there, I usually do. Because the co old school commercials are pretty dope.",
    "timestamp" : "53:11-53:21"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "53:22-53:23",
    "text" : "That is sweet, actually. Yeah, some of them."
  },
  {
    "timestamp" : "53:23-53:45",
    "text" : "Yeah. That's one thing I hate about like playoff season is I You get so many commercials. Because I really don't watch anything with commercials because it's like Red Zone, I don't. Yeah, you start Netflix, right? Yeah. Streaming stuff. So the only time I really watch a lot of commercials is NFL playoffs. Live football. Yeah. Yep, and it's fucking obnoxious. It's brutal.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "53:46-53:48",
    "text" : "The kickoff commercial is the worst fucking thing in the world.",
    "speaker" : "Steve"
  },
  {
    "text" : "Which one?",
    "speaker" : "Greg",
    "timestamp" : "53:49-53:49"
  },
  {
    "text" : "Score touchdown commercial. Kick off the ball, commercial. Bucket.",
    "timestamp" : "53:49-53:53",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "53:53-53:57",
    "text" : "Oh, I think they stopped doing that. Yeah, that's yeah. I think they stopped doing that like a year."
  },
  {
    "text" : "They do it every time, but they'll do it.",
    "timestamp" : "53:58-53:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. So growing up, a two-minute warning one, they still do that where there's someone called timeout or they'll do they'll have a two-minute warning break and then they'll do one play timeout and then they'll go to commercial and you're like, what the fuck are we doing?",
    "timestamp" : "53:59-54:11"
  },
  {
    "text" : "Yeah. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "54:11-54:12"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:13-54:30",
    "text" : "So I growing up, uh it used to drive us all bananas that mom would mute the commercials. So she didn't have to listen to them. But I do that now. Me too. Me too. I mute the commercials. Especially flaw. Oh, it's all any commercial. As soon as I know there's any, I'll mute the commercial."
  },
  {
    "timestamp" : "54:32-54:38",
    "speaker" : "Steve",
    "text" : "It's another fucking insurance commercial. Where's the where's a remote, Kelly?"
  },
  {
    "timestamp" : "54:38-54:43",
    "speaker" : "Greg",
    "text" : "Dude, I'll like scramble over the couch to find the remote. Just shut that bitch up"
  },
  {
    "speaker" : "Andy",
    "text" : "It's true.",
    "timestamp" : "54:45-54:46"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "54:46-54:47",
    "text" : "Yeah, I mute all commercials."
  },
  {
    "timestamp" : "54:47-54:49",
    "speaker" : "Andy",
    "text" : "Yeah, I don't actually pay what you're saying."
  },
  {
    "timestamp" : "54:50-54:54",
    "text" : "So I'm at a point now where I'm willing to pay for no commercials.",
    "speaker" : "Greg"
  },
  {
    "text" : "Well, we have Hulu and it's actually the worst because you pay, but then you still have commercials, and it's the same fucking commercial every time. Yeah. So I've seen the Liberty Mutual commercial. Probably 3,000 times at this point. Conservatively.",
    "timestamp" : "54:55-55:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "They got the counter though The counter honestly makes it easier because you're like, this will be over in 10. That's true. Because I know what to unmute now. Yeah. Perfect. Yeah. They just need more people like Costco.",
    "timestamp" : "55:10-55:25"
  },
  {
    "text" : "Or the original Jake from State Farm.",
    "timestamp" : "55:27-55:29",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "55:29-55:30",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Definitely the original. Yeah. Need him back. Yep. See if you can get him on the pod, Greg. Reach out to him. Be like, all right. Just call up State Farm until you get Jake. Be like, yo, Jake. Love you in the commercial, dude. You want to come on the pod?",
    "timestamp" : "55:30-55:43"
  },
  {
    "speaker" : "Steve",
    "text" : "Thank you for calling State Farm. This is Jocelyn. Hey, is Jake there? I'll just call back. Click.",
    "timestamp" : "55:44-55:51"
  },
  {
    "speaker" : "Greg",
    "text" : "Just keep calling back till I get somebody named Jake. Doesn't even matter to the same one.",
    "timestamp" : "55:51-55:58"
  },
  {
    "text" : "Yeah. He comes on the podcast and it's the current Jake.",
    "speaker" : "Steve",
    "timestamp" : "55:58-56:03"
  },
  {
    "speaker" : "Greg",
    "text" : "The actor Jake. Dude, he's like ripped too. Yeah.",
    "timestamp" : "56:04-56:08"
  },
  {
    "timestamp" : "56:08-56:10",
    "text" : "Of course he is. Yeah, he's an actor.",
    "speaker" : "Andy"
  },
  {
    "text" : "No, you would never know that by the commercials because you just like they make them so like they soften him up a bit, you know? Yeah. Feminizing men, there's another thing, okay? Alright, Jerry Kelly. Got myself. All this K-pop, you know, it's ruining our American culture.",
    "speaker" : "Greg",
    "timestamp" : "56:10-56:29"
  },
  {
    "speaker" : "Steve",
    "text" : "It's turning all the frogs gay.",
    "timestamp" : "56:29-56:31"
  },
  {
    "text" : "Buy my supplements. Buy my supplements. Oh shit. All right. Anything else on your list, Greg? No, that's everything I had. That was it? We're gonna end on the the trader stuff? That sounds good. Okay. So what's next week?",
    "timestamp" : "56:33-56:49",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "56:50-56:51",
    "speaker" : "Steve",
    "text" : "We're actually gonna do a game, right?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:51-56:53",
    "text" : "This is Super Bowl, you tell me."
  },
  {
    "timestamp" : "56:54-56:59",
    "speaker" : "Steve",
    "text" : "I tried to do a game this way. Oh yeah, let's do some predictions on our way out."
  },
  {
    "speaker" : "Greg",
    "text" : "Rams are gonna win it. Give me winner, gimme MVP, Rams, Odell Beckham Jr.",
    "timestamp" : "57:00-57:07"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "57:08-57:10",
    "text" : "Rams, Aaron Donald."
  },
  {
    "text" : "You actually might be honest on Steve, but that Cincinnati frees up space for the other rushers, you know",
    "speaker" : "Greg",
    "timestamp" : "57:13-57:20"
  },
  {
    "timestamp" : "57:19-57:21",
    "speaker" : "Steve",
    "text" : "I would love it if he wins MB."
  },
  {
    "text" : "That's their favorite line. Is like, yeah, he's been we haven't called his name a lot, but you know he's he's getting double teams so the other guys can get free attack. It's like shut the fuck up. Okay. Like I'm Von Miller now.",
    "timestamp" : "57:21-57:32",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "So you can't double team him.",
    "timestamp" : "57:32-57:34"
  },
  {
    "speaker" : "Greg",
    "text" : "All right. Mine is um I would like to say Cooper Cup because I just I watching him this year, he's fucking unbelievable. The the physical skills he has to play that good and be that productive is amazing. He's he's not that tall, not that fast, not that strong, but he's just ridiculous. Ridiculous. But I'm gonna go bangles because I think they're gonna win. The bangles? The bangals. The bungles. And I mean, and they're probably gonna give it to Joe Burrow.",
    "timestamp" : "57:34-58:03"
  },
  {
    "text" : "Yeah, because of course. So Joe Barrow has never lost a playoff game in his NFL or college career. He's only played like two in college. Yeah, I mean, that's true. And two in. Has he played two? Yeah, he played two in uh four and out. So pretty good. I mean what did how long how how many games did Tom Brady win in a row to start his career? Playoffs. Like 10 or 11?",
    "timestamp" : "58:04-58:32",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Would you count the bowl game as playoffs? No, I'm just talking about that. College playoffs back then, but he won the Orange Bowl.",
    "timestamp" : "58:32-58:39"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:39-58:40",
    "text" : "Yeah, I'm just talking about it."
  },
  {
    "timestamp" : "58:41-58:41",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "text" : "I don't think you won much in high school. What about Peewee Brady? Brady? What about baseball?",
    "timestamp" : "58:42-58:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:47-58:57",
    "speaker" : "Steve",
    "text" : "Uh but he won what? At least shut the fuck up. 3-0-1. Two in O two, no O three, right?"
  },
  {
    "timestamp" : "58:57-59:04",
    "text" : "Oh Steve's brain, here it goes. It's about to explode or implode.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "59:04-59:06",
    "text" : "Did mental map I'm a mental midget.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:07-59:09",
    "text" : "You're killing it right now, Steve. Keep going, keep going."
  },
  {
    "timestamp" : "59:10-59:10",
    "text" : "You got this.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:11-59:13",
    "text" : "I can feel it. I can feel it."
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know when it ends. I don't know when a streak ends.",
    "timestamp" : "59:13-59:16"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:16-59:20",
    "text" : "Uh his streak ended when he lost in the playoffs to the Broncos."
  },
  {
    "timestamp" : "59:21-59:28",
    "text" : "So he went three straight years without he didn't make the playoffs the middle year. So you did three Super Bowls without without losing a game.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "59:29-59:31",
    "text" : "Yeah, one wildcard game in that though.",
    "speaker" : "Steve"
  },
  {
    "text" : "So ten. And then maybe eleven if they won a game before Denver.",
    "timestamp" : "59:31-59:36",
    "speaker" : "Greg"
  },
  {
    "text" : "They did, but it was still only 10. Okay. Because they they weren't a wildcard team in any of those runs. Right.",
    "speaker" : "Andy",
    "timestamp" : "59:37-59:43"
  },
  {
    "text" : "Except for the first one. Nope. That that Raiders. the wild card game.",
    "speaker" : "Steve",
    "timestamp" : "59:44-59:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Nope. That was divisional round. It was that game and then the Steelers. So ten it was ten and oh before we lost to the Broncos in Denver. Yeah suck on that Joe Barrow. Talking about Patrick Mahomes. Gonna be the next Tom Brady.",
    "timestamp" : "59:48-01:00:06"
  },
  {
    "speaker" : "Greg",
    "text" : "Do you guys hate him? I hate him. Mahomes?",
    "timestamp" : "01:00:06-01:00:09"
  },
  {
    "text" : "I don't hate him.",
    "speaker" : "Andy",
    "timestamp" : "01:00:09-01:00:10"
  },
  {
    "speaker" : "Greg",
    "text" : "You don't hate him because he I hate everybody else around him, but uh Patrick Mahomes I kind of like. No, the the hate movement's growing for Patrick.",
    "timestamp" : "01:00:10-01:00:18"
  },
  {
    "timestamp" : "01:00:18-01:00:19",
    "text" : "Really? It is.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, I'm seeing a lot of chitter chatter online about it. He's she's not helping his per his Oh no, she's awful.",
    "timestamp" : "01:00:21-01:00:27",
    "speaker" : "Greg"
  },
  {
    "text" : "And and his brother's terrible too.",
    "speaker" : "Andy",
    "timestamp" : "01:00:27-01:00:30"
  },
  {
    "timestamp" : "01:00:29-01:00:35",
    "speaker" : "Steve",
    "text" : "Yeah, they're they're not doing any favorites. The same way Adam Case's eyes weren't doing him any favors, those two aren't doing Pat any favors."
  },
  {
    "text" : "But Patty Mahomes, I mean, he's fine. Seems like a down-to-earth kind of guy. Huh? Yeah. Did you know his dad played baseball? Did you know that? Shortstop. The classic. Julian Edelman was a quarterback in college.",
    "timestamp" : "01:00:35-01:00:58",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Um no there's something there though. There's something there. Really? Mm-hmm. I don't like them either. I can't really tell why. Maybe it's like the success.",
    "timestamp" : "01:01:02-01:01:12"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:01:13-01:01:16",
    "text" : "But like you just don't like the the media's coverage of him."
  },
  {
    "speaker" : "Steve",
    "text" : "That's exactly Greg hates whoever the media likes, Greg hates him. If they're blurred, I like Josh Allen. For now. You'll soon turn and find some reason, some obscure clip of Josh Allen after a game in Pee-Wee smacking some dude with an open hand and you'd be like, well, see, look, he's a piece of shit. He's not that good. You're probably right.",
    "timestamp" : "01:01:17-01:01:37"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:01:39-01:02:06",
    "text" : "No, there's definitely a trend there. People I hate, they're all like the ones that are the media lusts. Everybody darlings, yeah. Joe Burroughs up next. I can feel it. That's because the media are not m men of the people like I am. Like I see the chitter chatter online. I know what the real people think. And then that the the dichotomy between what the media saying and what the people online say. People don't like Aaron Donald either. A lot of chitter chatter online about that as well. I'm not the only one."
  },
  {
    "speaker" : "Andy",
    "text" : "Craig's been having all these conversations, late-night conversations with Jake from State Farm about Aaron Donald's, and he's just not a fan.",
    "timestamp" : "01:02:06-01:02:12"
  },
  {
    "timestamp" : "01:02:13-01:02:56",
    "speaker" : "Greg",
    "text" : "Google it. Do your own research, Andy Oh God. What is this? I hope this podcast documents my like slide into conspiracy theories. Yeah, internet fucking Comet ping pong. Here we come. Yep. Fucking cray. A lot of chitter chatter out there. Yeah. Yeah, a lot of birdies tweeting. And all the uh conservative circles, all the uh conspiracy circles. Oh dude, you don't even know about the circles I know about. Guy gets a new computer, thinks he's the wizard."
  },
  {
    "timestamp" : "01:03:07-01:03:25",
    "text" : "My favorite was when Greg when Greg posted his first uh blog post to Reddit. And so and all the guys came out with with the semantics. Like oh well he got this first thing wrong in the first paragraph, so I didn't read the rest of it. Yeah dude people on the internet are the worst.",
    "speaker" : "Andy"
  },
  {
    "text" : "They are the worst. The worst",
    "timestamp" : "01:03:26-01:03:28",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:03:28-01:03:31",
    "text" : "These same people who are saying that Aaron Donald is bad.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:03:31-01:03:45",
    "text" : "Yes. That's different, Steve. No. Okay. Okay. Explain to me. The people who criticize you fine."
  },
  {
    "text" : "Yeah, that fine line is what I believe to be true and what I believe to not be true.",
    "speaker" : "Andy",
    "timestamp" : "01:03:48-01:03:52"
  },
  {
    "timestamp" : "01:03:52-01:03:54",
    "text" : "Did they criticize me?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Fuck 'em. No, it's a bad internet.",
    "timestamp" : "01:03:55-01:03:58"
  },
  {
    "text" : "You know what? I'm not even gonna give you guys any more material. I'm nice to people online. I've told you that, right?",
    "timestamp" : "01:03:59-01:04:08",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "No.",
    "timestamp" : "01:04:09-01:04:09"
  },
  {
    "text" : "Intentionally nice to people online. Yeah, me too. What? Because nobody talks like you read online. Everyone's so like sarcastic and passive aggressive with each other that you're like I've never like been around people that like are w have the balls to talk to each other like this. And I'm like, I'm not gonna say shit online that I don't speak like in real life because otherwise I'm a pussy. So I just am nice to people. You're not a keyboard warrior, is that what you're saying? Yeah, dude. It's just kind of like it's kind of Stupid to be like, I would talk to him like this on the internet and then if I saw him in real life, be like, oh I'm sorry, bro, I didn't mean that. Who the fuck did you say it then? You know, like",
    "timestamp" : "01:04:12-01:04:51",
    "speaker" : "Greg"
  },
  {
    "text" : "That's what the internet is all about though.",
    "speaker" : "Steve",
    "timestamp" : "01:04:52-01:04:54"
  },
  {
    "text" : "Yeah, I know, but I don't think that's healthy. And I don't think it's like shit. I think everybody in the internet's a pussy except for me. That's why I'm nice.",
    "timestamp" : "01:04:54-01:05:04",
    "speaker" : "Greg"
  },
  {
    "text" : "Someone to criticize this podcast and you in it. That'd be great. Yeah.",
    "timestamp" : "01:05:09-01:05:13",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So if you're listening.",
    "timestamp" : "01:05:13-01:05:14"
  },
  {
    "speaker" : "Steve",
    "text" : "Yes, please criticize Greg.",
    "timestamp" : "01:05:14-01:05:16"
  },
  {
    "timestamp" : "01:05:17-01:05:31",
    "text" : "Yeah. We'll relate to him. Yeah. Or you or you can text the the the Dynasty Hotline. What's the number? Neither of you have any chance of that number.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:32-01:05:34",
    "speaker" : "Greg",
    "text" : "Is Indian Jones there?"
  },
  {
    "speaker" : "Andy",
    "text" : "603-505-8043 is the quickest way to insult Craig Brown. So just shoot a text to that number.",
    "timestamp" : "01:05:35-01:05:42"
  },
  {
    "timestamp" : "01:05:42-01:05:45",
    "speaker" : "Greg",
    "text" : "Just be just don't say anything you wouldn't say in real life to my face."
  },
  {
    "speaker" : "Steve",
    "text" : "I think we should put it up on the internet.",
    "timestamp" : "01:05:46-01:05:48"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:49-01:05:52",
    "text" : "And just remember, he's almost as athletic as Tom Brady."
  },
  {
    "text" : "That's right. Well, you know, he's closer to be an athlete as Tom Brady as Kelly is to.",
    "speaker" : "Steve",
    "timestamp" : "01:05:52-01:05:57"
  },
  {
    "speaker" : "Andy",
    "text" : "Right, exactly. Yeah. He's further away. Oh god.",
    "timestamp" : "01:05:57-01:06:01"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:06:02-01:06:08",
    "text" : "Well unless that's correct. I think he's then he's just neck and neck with Brady and Giselle Kelly are miles apart."
  },
  {
    "text" : "There's a great Bill Burr bit about that too, about like people at sporting events that like cussing out the players. Telling them they suck and then like seeing them in the parking lot be like, can you sign my stamp collection? Oh man.",
    "speaker" : "Greg",
    "timestamp" : "01:06:09-01:06:25"
  },
  {
    "timestamp" : "01:06:26-01:06:29",
    "text" : "Talking trash is only good if you're funny about it though.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:06:30-01:06:42",
    "text" : "Exactly. That's what I'm saying. Like the the sarcastic, like passive aggressive, like it's like it just comes off as whiny. Like be funny. Nice job, Tom Brady. Yeah, yeah. Oh, nailed him.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:06:42-01:06:43",
    "speaker" : "Andy",
    "text" : "You got him good. Yeah."
  },
  {
    "text" : "Yeah, but like if you say you, you know, would never say something online that you wouldn't say in real life, you say all sorts of ridiculous things in real life.",
    "speaker" : "Steve",
    "timestamp" : "01:06:44-01:06:51"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:52-01:07:40",
    "text" : "Uh didn't we didn't we go to a Jets game and we we kept saying that Geno Smith's uh ass looked fat in those pants? I don't remember that one the entire game. I'm pretty sure we was for some reason we lat we lashed onto that and told him uh that his mother was not proud of him. And uh certain things like that. Because we got seats that were close enough that he could hear us. I That's sweet. Yeah, especially when he was backed up that one time uh and at the goal line. He does have childbearing hips though. Yeah, oh yeah. I think we let him know that too. And there was the LOL Spinners game, which you got, which dad actually left us at because it was so bad. Because Craig was heckling you were heckling the uh you were heckling the mascot who was handing out um free food, I believe."
  },
  {
    "timestamp" : "01:07:40-01:07:48",
    "speaker" : "Greg",
    "text" : "See, I do it in real life. That's what I was saying. You're probably a good one. I'm about to like fuck around and find out kind of deal, you know, Steve."
  },
  {
    "speaker" : "Steve",
    "text" : "You probably just the asshole on the internet, you know?",
    "timestamp" : "01:07:48-01:07:51"
  },
  {
    "text" : "Yeah, you're I don't know why you're not more of an athlete. You're kind of you've gone the other way. Yeah. You're like a reverse ugly duckling.",
    "timestamp" : "01:07:51-01:07:58",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:08:02-01:08:08",
    "speaker" : "Greg",
    "text" : "In real life. Yeah, give it time. It'll make me more cynical eventually. Yeah, be sure."
  },
  {
    "text" : "Especially if you keep posting your own work on the internet.",
    "speaker" : "Andy",
    "timestamp" : "01:08:09-01:08:11"
  },
  {
    "text" : "More time and more insurance commercials. That'll get you there.",
    "speaker" : "Steve",
    "timestamp" : "01:08:12-01:08:14"
  },
  {
    "timestamp" : "01:08:14-01:08:15",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "Uh all right boys anything else?",
    "speaker" : "Greg",
    "timestamp" : "01:08:18-01:08:20"
  },
  {
    "timestamp" : "01:08:21-01:08:21",
    "speaker" : "Steve",
    "text" : "No."
  },
  {
    "text" : "Um I don't think so. Any any TV shows you guys are watching? What do you got going on? I hate February, dude. It's gonna kill me. Don't worry.",
    "timestamp" : "01:08:22-01:08:30",
    "speaker" : "Greg"
  },
  {
    "text" : "I'm re-watching Band of Brothers.",
    "timestamp" : "01:08:31-01:08:32",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Band of Brothers, sweet.",
    "timestamp" : "01:08:32-01:08:34"
  },
  {
    "timestamp" : "01:08:35-01:08:43",
    "speaker" : "Steve",
    "text" : "Yeah. Yeah. I don't remember anything about it. I remember watching it and being like, wow, that was awesome. There's a Pacific version as well, which I haven't seen. So I might just watch it."
  },
  {
    "timestamp" : "01:08:43-01:08:49",
    "text" : "Yeah, the Pacific version. There's a good World War II in color documentary on Netflix too. You should watch that.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I'd watch it.",
    "timestamp" : "01:08:50-01:08:50"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:08:50-01:08:56",
    "text" : "It's like all raw footage from World War II. It's pretty cool. I'm rewatching Game of Thrones."
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "01:08:56-01:08:56"
  },
  {
    "timestamp" : "01:08:57-01:09:01",
    "speaker" : "Greg",
    "text" : "First three seasons of that shit are so good. I don't know."
  },
  {
    "text" : "I remember it being so slow.",
    "speaker" : "Steve",
    "timestamp" : "01:09:02-01:09:03"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean the the ending blows. They screwed that up big time. Yeah. But the characters Like the the writing is really good.",
    "timestamp" : "01:09:04-01:09:14"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. I would definitely pick them up. I feel like the first season was slog.",
    "timestamp" : "01:09:14-01:09:18"
  },
  {
    "timestamp" : "01:09:18-01:09:23",
    "speaker" : "Greg",
    "text" : "Yeah, I could see it. It's a bit slow. I like the little guy though. He's my favorite."
  },
  {
    "text" : "Peter Dinklage.",
    "timestamp" : "01:09:23-01:09:24",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, Peter. That's how you put like diversity in TV shows, by the way, right? You just put them in there. You don't make a big deal about it and not be like, he's so empowering because he's short. No, he's empowering because he's a cool character and really well written and like smart and clever and has weaknesses and has strengths. And he just happens to be small. You know?",
    "speaker" : "Greg",
    "timestamp" : "01:09:25-01:09:49"
  },
  {
    "timestamp" : "01:09:50-01:09:55",
    "speaker" : "Steve",
    "text" : "And Jake from State Farm just happened to be an employee. And Jake from State Farm."
  },
  {
    "text" : "Bringing it all back. Oh shit. The fat guy though, Samuel Tarley, oh god. I have to fast-forward through his bits.",
    "timestamp" : "01:09:56-01:10:06",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:10:06-01:10:07",
    "speaker" : "Steve",
    "text" : "Oh yeah."
  },
  {
    "timestamp" : "01:10:07-01:10:11",
    "text" : "I have not seen it, so. You haven't seen it, Andy?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:10:11-01:10:11",
    "text" : "Nope.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:10:11-01:10:12",
    "speaker" : "Greg",
    "text" : "None of them?"
  },
  {
    "speaker" : "Steve",
    "text" : "Well you got a bunch of free time in your hands, Indy. Get after it.",
    "timestamp" : "01:10:12-01:10:15"
  },
  {
    "timestamp" : "01:10:15-01:10:15",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:10:15-01:11:24",
    "speaker" : "Andy",
    "text" : "The only thing I'm wat only thing I'm watching right now is the back of my eyelids whenever I have a free moment. What do you do? Walk me through a day Right now. Uh they don't have a beginning and end. So I'll just walk you through what happens on on repeat is basically My child will sleep for anywhere between 45 minutes and an hour and a half, which time we will either sleep with him. Or we will try to get shit done, like dishes and like, you know, ordering toilet paper so that we have something to wipe our asses with. Um And then he wakes up and is either hungry or has filled a diaper. And then we will feed him and he'll be awake for probably 20 minutes after that. Um, where we will, you know, show him books of black and white things because that's all he can see right now, and take a bunch of pictures of him because he's awake. Then he falls asleep again. Or he doesn't fall asleep and he cries because he has gas pains and will not fall asleep until he farts. Which I can a hundred percent Understand because that's how I am too."
  },
  {
    "timestamp" : "01:11:24-01:11:27",
    "speaker" : "Greg",
    "text" : "I cry and just you ever just punch him in the stomach trying to get it out?"
  },
  {
    "speaker" : "Andy",
    "text" : "I haven't yet.",
    "timestamp" : "01:11:28-01:11:29"
  },
  {
    "timestamp" : "01:11:30-01:11:33",
    "text" : "Trying to offer solutions. I appreciate that.",
    "speaker" : "Greg"
  },
  {
    "text" : "No, I do I do like the football carry, like having him face down just like patting the hell out of his back. He loves that. That's about it. That's my last and it's on repeat. And so I don't know what day it is. I don't know what month it is. I rarely know if it's night or day.",
    "speaker" : "Andy",
    "timestamp" : "01:11:34-01:11:51"
  },
  {
    "timestamp" : "01:11:52-01:12:04",
    "text" : "But I mean you're just watching TV, right? Like what do you uh don't even we haven't actually turned the TV on yet. So what do you do? You just sit there and look at this thing?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:12:05-01:12:17",
    "speaker" : "Andy",
    "text" : "Uh if he's awake, yeah. Otherwise I'll be sleeping. It's like an awful lot of sleeping. Uh no, it's not. Because it's sleeping 45 minutes at a time trying to get trade hours."
  },
  {
    "timestamp" : "01:12:17-01:12:21",
    "text" : "Ah, you're not getting your RAM. Yep, not getting my REM. It's all it's really about the RAM.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "It's not massive about the REM, yeah. Just not getting there. So we're we're trying now to kind of take turns. of like Erin will do all all the a few cycles in a row by herself while I sleep for a few hours and then we'll swap. Except I can't feed him because I don't have milk.",
    "timestamp" : "01:12:21-01:12:43"
  },
  {
    "timestamp" : "01:12:43-01:12:48",
    "text" : "Well yeah, we've we talked about that in in great detail.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:12:49-01:12:51",
    "text" : "Thankfully that wasn't on the recording part.",
    "speaker" : "Steve"
  },
  {
    "text" : "What about if uh if you got some sort of fake tits, right? I still don't think they produce milk.",
    "speaker" : "Greg",
    "timestamp" : "01:12:51-01:12:58"
  },
  {
    "text" : "Well you could put milk in 'em. But wouldn't it go bad though? He's drinking an ounce at a time.",
    "timestamp" : "01:12:59-01:13:06",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:13:08-01:13:28",
    "text" : "I'm saying like, okay, here's an idea. Here we go. A tube on Erin. Uh-huh. That filters straight into your fake tit. Like okay. Jacket. Yeah, yeah. And then he just sits on there and sucks on the fake nipple. Okay. And it's just coming right from the source, baby."
  },
  {
    "timestamp" : "01:13:28-01:13:30",
    "text" : "You got a little pump on there?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:30-01:13:52",
    "text" : "I have I have another idea. Aaron, don't even have to wake up. I got another idea. Uh bottle feeding. Yeah, I guess that would work too. I could even hide the bottle in inside my shirt and scut a little hole. And then yeah, he thinks and put a little pillow down my shirt. Yeah. So he gets the full experience, but I like your idea too, Greg. Yeah."
  },
  {
    "timestamp" : "01:13:53-01:14:00",
    "speaker" : "Greg",
    "text" : "Got a siphon system going with me there and they're attached by a uh it keeps going, baby."
  },
  {
    "timestamp" : "01:14:01-01:14:05",
    "speaker" : "Steve",
    "text" : "But whatever method you choose, just make sure that fake nipple comes out past the chest air andy."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, oh yeah, yeah, no, the the chest hair is my worry. Yeah, you gotta get that past the jungle there. Yeah, no, we don't we don't want that happening.",
    "timestamp" : "01:14:05-01:14:12"
  },
  {
    "timestamp" : "01:14:12-01:14:18",
    "speaker" : "Greg",
    "text" : "So you should shave one breast and then put the picture on the internet on Twitter. Well, I've shaved them both once."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, yeah, what's coming up next from Greg. Bull cuts and shaved breasts.",
    "timestamp" : "01:14:19-01:14:25"
  },
  {
    "speaker" : "Andy",
    "text" : "No, I did the uh the mustache competition.",
    "timestamp" : "01:14:28-01:14:30"
  },
  {
    "timestamp" : "01:14:31-01:14:34",
    "speaker" : "Greg",
    "text" : "I'm doing a mustache right now. Are you? You guys haven't even can't even tell."
  },
  {
    "timestamp" : "01:14:35-01:14:38",
    "speaker" : "Steve",
    "text" : "No. That must be looks like you just shaved."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:14:37-01:14:50",
    "text" : "I know this is like a week and a half. Really? Yeah, because it's super blonde. I get like wicked bushy like side beard. That's why I've never done a mustache. But I figure like I have to try it at some point."
  },
  {
    "speaker" : "Andy",
    "text" : "I go to the case. I feel like you need to air quotes every time you use the word mustache for that.",
    "timestamp" : "01:14:51-01:14:57"
  },
  {
    "timestamp" : "01:14:57-01:15:02",
    "speaker" : "Greg",
    "text" : "Yeah, it's not a great mustache. I understand it. But it's it It's not gonna stop me from trying."
  },
  {
    "text" : "It never does. And seeing where it's going.",
    "timestamp" : "01:15:02-01:15:04",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:15:04-01:15:11",
    "text" : "I might get some dye to see if I can get some color in it. I think that'll really like make it pop. Yeah. Yeah."
  },
  {
    "timestamp" : "01:15:12-01:15:12",
    "speaker" : "Steve",
    "text" : "Fair enough."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:15:12-01:15:13",
    "text" : "Stay tuned."
  },
  {
    "text" : "Oh, dad has a bunch of extra dyes and he's dying his hair like pink.",
    "timestamp" : "01:15:13-01:15:16",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Can we ex- Can we talk about that? Because I didn't that made no sense to me.",
    "timestamp" : "01:15:16-01:15:20"
  },
  {
    "text" : "No sense. Wait, he got a bunch of dye and then you just ended up dyeing his eyebrows?",
    "timestamp" : "01:15:21-01:15:26",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, in the in the family chat, we just get a chat from what was it mom or dad that were like, just bought a bunch of hair dye.",
    "timestamp" : "01:15:26-01:15:33",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Pink, purple. Yeah.",
    "timestamp" : "01:15:33-01:15:36"
  },
  {
    "text" : "Well, so what does that mean? Yeah. And that was it. And then I'm still a picture of our dad's eyebrow. Like Slightly yellow. Yeah. And still have no idea what any of this means. I don't yeah, I don't understand.",
    "speaker" : "Greg",
    "timestamp" : "01:15:38-01:15:52"
  },
  {
    "timestamp" : "01:15:53-01:15:54",
    "text" : "I'm excited though.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. I",
    "timestamp" : "01:15:54-01:15:55"
  },
  {
    "timestamp" : "01:15:56-01:15:57",
    "text" : "I want to see where this goes.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "That's for sure.",
    "timestamp" : "01:15:57-01:15:58"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:15:58-01:16:02",
    "text" : "Whatever dad's got left over you, I'm sure you can borrow. Yeah for your mustache."
  },
  {
    "speaker" : "Andy",
    "text" : "That's true.",
    "timestamp" : "01:16:02-01:16:03"
  },
  {
    "text" : "And you can also dye the other side of your chest hair with the non-shaven side.",
    "speaker" : "Steve",
    "timestamp" : "01:16:03-01:16:08"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:16:10-01:16:17",
    "text" : "And on that note, I think we will leave this till next week. Okay. Because I need to go get some sleep or attempt it."
  },
  {
    "text" : "What is next week? I take back what I said about being a you being a trader. I didn't mean that. I don't believe you, but I'll I was just trying to entertain the people.",
    "speaker" : "Greg",
    "timestamp" : "01:16:18-01:16:26"
  },
  {
    "speaker" : "Steve",
    "text" : "I was only doing it because Greg was doing it",
    "timestamp" : "01:16:27-01:16:29"
  },
  {
    "text" : "Y'all know where your your bread is buttered. So next week 2004, week 12, going all the way back to 2004. We haven't done been there in a while. Patriots, Ravens.",
    "timestamp" : "01:16:31-01:16:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Brian Billick, Rex Ryan, all right, Mike Nolan in Baltimore, Kyle Bowler",
    "timestamp" : "01:16:46-01:16:56"
  },
  {
    "timestamp" : "01:16:57-01:17:16",
    "speaker" : "Andy",
    "text" : "No, In Gillette. Bold. Yeah. So the uh 7-3 Ravens visiting the 901 Patriots, which should be a good game. Sunday night game. Very well might be. We'll have to find out next week on the Patriots Dynasty Podcast. See you later."
  },
  {
    "text" : "See you later.",
    "timestamp" : "01:17:16-01:17:18",
    "speaker" : "Greg"
  }
]