[
  {
    "speaker": "Mom",
    "text": "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp": "00:00-00:17"
  },
  {
    "speaker": "Andy",
    "timestamp": "00:22-01:16",
    "text": "Welcome back to the Patricy Podcast, the podcast where my brothers and I are re-watching every game. The dynasty era until we run out of games or until we run out of steam. We shall see. We have made it through the 2004 regular season and we're preparing for the 2004 playoffs. With me as always is trusty brother Steve Brown. Dependable brow. Dependable brother, yes. The uh the favorite brother, if you will. Yes. We are missing Greg Brown, but that hardly matters. Because we have uh another guest, a special guest this week. Uh the most special guest, Steve, that we've ever had? Definitely. Fair to say? Yeah, I would say so. With us this week. We are very pleased to announce the one and only Mr. Third Down himself, Kevin Troy Falk. Kevin, thanks for joining us."
  },
  {
    "text": "You're on mute.",
    "timestamp": "01:17-01:18",
    "speaker": "Steve"
  },
  {
    "text": "You're on mute, bud. Still on mute.",
    "speaker": "Andy",
    "timestamp": "01:18-01:23"
  },
  {
    "text": "Unmute me. Here we go. Here you go. Thanks guys. I appreciate y'all having me. Man, I don't know how we got on mute. I got one hand right now.",
    "timestamp": "01:23-01:30",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "Well, I gotta say, Kevin, thank you for agreeing to do the rest of the 300 games instead of Greg. That's like really kind of you",
    "speaker": "Steve",
    "timestamp": "01:32-01:38"
  },
  {
    "timestamp": "01:38-01:40",
    "text": "Yeah, you really tried to slide that one in there, huh?",
    "speaker": "Kevin Faulk"
  },
  {
    "speaker": "Andy",
    "timestamp": "01:41-02:09",
    "text": "Coming out strong. Nice on this day. I like it. All right. So uh maybe for those of the uh younger listeners that we have, we'll just kind of run through those that didn't uh get to experience the Kevin Falk era at the beginning of the 2004. You've heard us talk about him ad nauseum on this podcast. But uh Kevin, born in Lafayette, Louisiana, and correct me if I'm wrong on any of this stuff. This is all basically from your Wikipedia, so"
  },
  {
    "text": "Um but you was pretty good with the malciation too now.",
    "speaker": "Kevin Faulk",
    "timestamp": "02:10-02:13"
  },
  {
    "timestamp": "02:13-02:20",
    "speaker": "Andy",
    "text": "Yeah, not bad, right? Not bad for a northern guy. Yes, um High school your high school quarterback, is that right?"
  },
  {
    "timestamp": "02:21-02:22",
    "text": "High school quarterback.",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "Dreams of playing wide receiver, ended up as a running back, as you do?",
    "timestamp": "02:22-02:25",
    "speaker": "Andy"
  },
  {
    "timestamp": "02:26-02:26",
    "text": "Yes, sir.",
    "speaker": "Kevin Faulk"
  },
  {
    "timestamp": "02:27-02:45",
    "speaker": "Andy",
    "text": "I ended up as a running back at uh LSU. Uh and um I knew I I'm not a big college football guy, uh 'cause you know, uh born and raised in in New England, so we just we don't really do college football up here. Didn't realize like how big a deal you were at LSU."
  },
  {
    "timestamp": "02:46-02:50",
    "speaker": "Kevin Faulk",
    "text": "Oh, appreciate that. You're nobody there, especially up there."
  },
  {
    "speaker": "Andy",
    "text": "Yeah, no kidding. I mean that's true.",
    "timestamp": "02:50-02:53"
  },
  {
    "text": "But thirteen long good years.",
    "speaker": "Kevin Faulk",
    "timestamp": "02:53-02:56"
  },
  {
    "speaker": "Andy",
    "text": "Yeah, yeah. Um but yeah, yeah, I mean I think you're still the school's leader in rushing yards, rushing touchdowns, touchdowns from scrimmage. Um, you're what was it? Fourth in the SEC in rushing yards, third in total touchdowns in the SEC.",
    "timestamp": "02:56-03:12"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Like that, you were a wagon, basically, at LSU. I still didn't know all of that. Thanks for you know reminding me about that.",
    "timestamp": "03:12-03:20"
  },
  {
    "timestamp": "03:20-03:23",
    "speaker": "Andy",
    "text": "I didn't know that. That's what we're here for. We're here to pump your ties, but yeah."
  },
  {
    "text": "I'm still thinking about it.",
    "timestamp": "03:24-03:25",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "But yeah, I mean and there's there's some uh there's some big names on there um on all those lists really. I mean you you're you're up there with some some big names Um who we got? We got uh do you know who who else is up on those lists? Did did you track that back in the day or like when it's happening?",
    "speaker": "Andy",
    "timestamp": "03:27-03:44"
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "03:45-03:52",
    "text": "Well, I know Herschel Walker. Bo Jackson was up there with something."
  },
  {
    "text": "Oh yeah.",
    "speaker": "Andy",
    "timestamp": "03:52-03:53"
  },
  {
    "timestamp": "03:53-04:00",
    "speaker": "Kevin Faulk",
    "text": "Uh Emmett. Maybe. Maybe not. I know Tebow got the touchdowns."
  },
  {
    "speaker": "Andy",
    "text": "Tebow did get the touchdowns, yes, he did.",
    "timestamp": "04:01-04:03"
  },
  {
    "timestamp": "04:03-04:07",
    "speaker": "Kevin Faulk",
    "text": "I remember when that happened. That wasn't fair."
  },
  {
    "speaker": "Andy",
    "timestamp": "04:08-04:13",
    "text": "Yeah, it doesn't quite count, does it? 'Cause it's freaking quarterbacks. That's cheating"
  },
  {
    "text": "No, I well however you can do it. Like I tell people, records are made to be broken by very special people. If somebody break a record, that means that's a special person.",
    "speaker": "Kevin Faulk",
    "timestamp": "04:13-04:22"
  },
  {
    "text": "Yeah, that's fair. But uh yeah, let's see. Um you had you were on the list of single-game rushing yards for LSU twice. Uh number seven with two hundred and forty-six rushing yards against Houston. Two thirty-four against Michigan State year before. Uh Darius Juice is on here like one, two, three, four times. Yep. Daddy's a beast. I don't I don't remember him. Oh, he's on um guys. They just put juice on the saying his name right, yeah. As you can tell, I don't know.",
    "speaker": "Andy",
    "timestamp": "04:22-05:04"
  },
  {
    "speaker": "Steve",
    "text": "Oh Steve, he's uh he's on uh he's on the against Commander's Washington football team. Yeah, the Washington football team, whatever they call themselves now. Yeah.",
    "timestamp": "05:04-05:11"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "He got in trouble so they kinda changed his name a little bit. They didn't put his real name up there.",
    "timestamp": "05:12-05:16"
  },
  {
    "text": "I got you. Yeah, so uh so Kevin Falk, uh highly drafted, highly sought after. Um ended up being the fourth wide receiver off the board, but uh I was listening to another interview you did And you're saying the Patriots told you that they were gonna pick in the first round?",
    "timestamp": "05:17-05:34",
    "speaker": "Andy"
  },
  {
    "timestamp": "05:34-05:45",
    "text": "Right. One of their first two picks. They had two picks in the first round that year. Uh first one they took Casmore or Woody? I think Woody.",
    "speaker": "Kevin Faulk"
  },
  {
    "speaker": "Andy",
    "timestamp": "05:45-05:46",
    "text": "I think Woody was first."
  },
  {
    "timestamp": "05:47-07:19",
    "speaker": "Kevin Faulk",
    "text": "Yeah, they took Damian Woody first. It was like, okay, okay. They setting it up. They setting it up. They do exactly what they said. They setting it up The second pick came in the first uh oh my bad. Second pick came in the first round and it was like Andy Catsmore, Ohio State linebacker. I'm sitting down on the sofa like what? I get off the sofa and like where you going? Shhh out here. I'm gonna jump on the four-wheels. I'm on the I'm riding four-wheels and stuff In the forest. It's bad as hell. Mad as hell. And I think that was like the twenty Six somet something like that. Well, Atlanta was in the Super Bowl that year, so they had the 32nd pick. They call Hey, we're thinking about telling you with the 30 second pick. I'm rushing back. Flying back. Get it? I forget who they picked. They picked somebody else and I'm like, oh y'all mothers. And then from that point on, it's like, I don't even want to watch it no more. I'm good. It's about to they're the draft is about to be in for the day. So I'm probably not gonna get drafted. So I'm really upset. And I get the phone call. Hey man. We trade it up. We trade it up for you, blah, blah, blah. It's New England. Like, mother. Okay, I'm happy. I'm sorry. So but yeah, it was a sad but exciting day."
  },
  {
    "text": "Yeah, no kidding. Who's a G the Patriots uh traded up with uh Tennessee to pick you?",
    "speaker": "Andy",
    "timestamp": "07:19-07:25"
  },
  {
    "timestamp": "07:25-07:35",
    "speaker": "Kevin Faulk",
    "text": "Yes. Because the Giants was about to take me. Oh I think the Giants had the next pick right after Tennessee. Or somewhere around there."
  },
  {
    "timestamp": "07:36-07:47",
    "speaker": "Andy",
    "text": "Yeah, yeah, they're in there. Yeah, they were ahead of the Patriots. They were a couple picks later. Yeah, exactly. And they went with Joe Montgomery instead. Whoops. Whoops."
  },
  {
    "text": "No, they was actually about to take me.",
    "speaker": "Kevin Faulk",
    "timestamp": "07:50-07:52"
  },
  {
    "text": "Yeah.",
    "timestamp": "07:52-07:52",
    "speaker": "Andy"
  },
  {
    "timestamp": "07:52-08:10",
    "speaker": "Kevin Faulk",
    "text": "That's why the Patriots draft moved up. You know, they all these they call who you like on your board, who's the first on your board And that's how they, you know, figure. I didn't even realize that. Who you like on your board? Oh, I like this guy. Oh, okay. Hey man, uh you want to trade? That's how this get done."
  },
  {
    "speaker": "Andy",
    "text": "Yeah, I mean it's it's a hole. I've I've seen like all the behind the scenes stuff and it's just it's a whole like process. It's unbelievable how much work actually goes into making all these picks. Not that I think you know the NFL draft needs to be a three-day televised affair.",
    "timestamp": "08:10-08:26"
  },
  {
    "timestamp": "08:26-08:30",
    "speaker": "Kevin Faulk",
    "text": "Oh yeah. Anything to make more money, guys."
  },
  {
    "timestamp": "08:30-08:32",
    "text": "That's right. Yeah, that's all it is.",
    "speaker": "Andy"
  },
  {
    "text": "Anything to make more money guy. Come on, man.",
    "speaker": "Kevin Faulk",
    "timestamp": "08:33-08:36"
  },
  {
    "text": "So remember who the uh number one overall pick was in that draft? Nah remind me. Tim Couch. Oh",
    "timestamp": "08:36-08:42",
    "speaker": "Steve"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Ooh.",
    "timestamp": "08:43-08:44"
  },
  {
    "text": "Uh Don McMahd picked second.",
    "timestamp": "08:44-08:46",
    "speaker": "Steve"
  },
  {
    "speaker": "Andy",
    "text": "The Browns being the Browns. And then Bengals picking Achilles Smith. Yeah.",
    "timestamp": "08:48-08:52"
  },
  {
    "text": "And he'd still be in the Browns. Oh yeah.",
    "timestamp": "08:53-08:55",
    "speaker": "Steve"
  },
  {
    "timestamp": "08:56-08:57",
    "speaker": "Andy",
    "text": "And then some."
  },
  {
    "text": "Some things never change.",
    "timestamp": "08:57-08:58",
    "speaker": "Steve"
  },
  {
    "text": "So uh you you you see like the interviews with Tom Brady and he knows like the six guys picked ahead of him. Do you know the three picked ahead of you?",
    "timestamp": "08:59-09:07",
    "speaker": "Andy"
  },
  {
    "speaker": "Steve",
    "text": "Hmm.",
    "timestamp": "09:07-09:08"
  },
  {
    "speaker": "Andy",
    "timestamp": "09:08-09:09",
    "text": "Good question."
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Uh Ricky Williams.",
    "timestamp": "09:10-09:12"
  },
  {
    "speaker": "Andy",
    "text": "Mm-hmm.",
    "timestamp": "09:12-09:13"
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "09:13-09:17",
    "text": "Yep. Hey Johnson. Who? I'm not here."
  },
  {
    "timestamp": "09:17-09:18",
    "speaker": "Andy",
    "text": "Oh yeah. JJ Johnson. Yeah."
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "09:18-09:23",
    "text": "Yeah. Yeah. Uh Easy."
  },
  {
    "speaker": "Andy",
    "timestamp": "09:24-09:32",
    "text": "Yeah, Egar and James. Egg and James was four. Ricky Williams five. And JJ Johnson was a few picks before you. Thirty thirty-nine."
  },
  {
    "timestamp": "09:33-09:34",
    "text": "I can't believe I remember that.",
    "speaker": "Kevin Faulk"
  },
  {
    "speaker": "Andy",
    "timestamp": "09:34-09:39",
    "text": "I can't believe you remember that either. I'm impressed. Still got that chip on your shoulder."
  },
  {
    "speaker": "Kevin Faulk",
    "text": "I know those guys. But most of them like Besides Ricky Besides Ricky and Az, they played uh other uh J play in SEC, so I knew him.",
    "timestamp": "09:43-09:54"
  },
  {
    "timestamp": "09:54-09:54",
    "speaker": "Andy",
    "text": "Okay."
  },
  {
    "text": "And I knew I knew EJ already. We was cool already And I I roomed with Ricky for a few All American teams in uh college, so I kinda knew I knew How is that?",
    "speaker": "Kevin Faulk",
    "timestamp": "09:55-10:06"
  },
  {
    "speaker": "Andy",
    "text": "Because that guy's a character.",
    "timestamp": "10:06-10:07"
  },
  {
    "text": "It was awkward.",
    "timestamp": "10:08-10:09",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "Oh really?",
    "timestamp": "10:09-10:10",
    "speaker": "Andy"
  },
  {
    "timestamp": "10:11-10:32",
    "text": "Very we never talked. Never really went out with like us. Yeah. Like the guy at the game. He always had something going on in his own. But now you know kind of know why. But he did talk where he just never really, you know Opened up. Yeah, exactly. Want to hang out with the the whole group",
    "speaker": "Kevin Faulk"
  },
  {
    "timestamp": "10:32-10:32",
    "speaker": "Steve",
    "text": "Yeah, gotcha."
  },
  {
    "speaker": "Kevin Faulk",
    "text": "When I came back to the room, we clown joked around, but it wasn't like too many people. You know, we had a very small circle.",
    "timestamp": "10:33-10:40"
  },
  {
    "text": "Yeah, yeah, that's fair I'm like that. I got Steve is about it. And then once a while Greg when he shows up.",
    "timestamp": "10:40-10:47",
    "speaker": "Andy"
  },
  {
    "text": "You better have a small circle.",
    "speaker": "Kevin Faulk",
    "timestamp": "10:47-10:49"
  },
  {
    "timestamp": "10:50-10:57",
    "speaker": "Andy",
    "text": "Yeah, that's the way to do it. I got neighbors. I don't even like them. I want to move further into the woods. I love new friends. I'm not a fan. I don't like people."
  },
  {
    "text": "You'll be like me right now.",
    "timestamp": "10:58-10:59",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "There you go. Living the dream, Kevin. All right. So yeah, so all you did was get drafted by uh the Patriots in 1999, the second round. Yep. And since then, um you still, after all these years. are in the top whatever of basically every single statistic that they have for the Patriots. You're still fifth in rushing yards. Um, which I think is more impressive because you weren't ever kind of the feature back, like the the the bell cow that you normally see. Right. Um never actually had a hundred-yard game. Did you know that?",
    "timestamp": "11:00-11:36",
    "speaker": "Andy"
  },
  {
    "timestamp": "11:37-11:43",
    "speaker": "Steve",
    "text": "Oh I knew that came up on our podcast earlier. That's a crazy chat."
  },
  {
    "text": "The one time that it came close The one time. Ooh.",
    "speaker": "Kevin Faulk",
    "timestamp": "11:43-11:48"
  },
  {
    "timestamp": "11:49-11:58",
    "speaker": "Andy",
    "text": "It was like 96 yards. Like it was real close. Did I watch that game recently? I think we did, yeah. Yeah. Uh once the podcast. I guess the Browns maybe. Yeah. Yeah."
  },
  {
    "text": "Yes, yes. I remember that day. Oh my God.",
    "speaker": "Kevin Faulk",
    "timestamp": "11:58-12:01"
  },
  {
    "speaker": "Andy",
    "text": "And yet, with all that said, you are still first in all-purpose yards.",
    "timestamp": "12:01-12:07"
  },
  {
    "speaker": "Steve",
    "text": "So never having 100-yard game. It's crazy.",
    "timestamp": "12:08-12:10"
  },
  {
    "timestamp": "12:10-12:45",
    "text": "Yeah. Yeah. But because with your, I mean you're with a 13th in receiving yards with all the quality receiving options that the patients have had over the years. Um first in kick return yards still. Have some good kick returners out there. Eighth in punt return yards, which again, some real good punt returners, I would say. Um and you see and your first um like you have a ton of kick return yards. And that that's I that's what I you know everybody's like oh it's he's missed a third down, but I remember you being the kick return guy. For a long time like growing up.",
    "speaker": "Andy"
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "12:45-13:01",
    "text": "I was there to secure the ball. I was there to secure the ball. Yeah. Make sure the ball get caught. And I caught I I had a few good few good runs. Um they won One year would I return two kickoffs for a touchdown?"
  },
  {
    "text": "Yep. You sure did. I believe uh 2002, I think. We watched that a couple seasons ago, yeah. Well they actually that that was one of the like the the stats that I don't even know how I came up. I think this was like one of the games we watched and they posted this stat, you know, like they have just the The the random stats. And you were the only Patriot to score multiple touchdowns in three different categories. You did it rushing, receiving, and kick returns. Yes. And you were the only person in the whole NFL to do it that year. Wow. Bananas.",
    "timestamp": "13:01-13:33",
    "speaker": "Andy"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Interesting.",
    "timestamp": "13:33-13:34"
  },
  {
    "text": "Yeah.",
    "timestamp": "13:34-13:35",
    "speaker": "Andy"
  },
  {
    "timestamp": "13:35-13:37",
    "speaker": "Kevin Faulk",
    "text": "Nobody never told me that."
  },
  {
    "speaker": "Andy",
    "text": "I would imagine you're probably still the only The only Patriot at least to do in all three categories. Unless Edelman, yeah, I don't think it's a good one. Edelman probably in the year. I don't know. Like two punt returns and like two rushing touchdowns? I don't think so. That's that wasn't his style. Never really had rushed. So yeah, I I bet I bet that probably still stands. Wow. Because you were Mr. Everything. Yeah. You are Yeah, I uh I we've said this on the podcast a lot that you and I think Troy Brown are the prototypical Patriots. Like that seems to be like the guys they're looking for were basically replacements for you in Troy. All the way through. Yeah. I mean it's our guy too, not just because he's been the last name.",
    "timestamp": "13:38-14:23"
  },
  {
    "text": "That's probably my number one question. Who is your favorite teammate and why is it Troy Brown?",
    "timestamp": "14:24-14:28",
    "speaker": "Steve"
  },
  {
    "text": "Well, I got a bunch of favorite teammates, but when I first came, you whenever you first come somewhere you try to find somebody that to idolize or to watch to mimic. And Throughout the c course of my first few days, few weeks there, took notice of Troy. You know, how he worked. Wasn't wasn't like the best player on the team, but he just worked hard and went about his business not saying nothing, but just being that guy And took to it and really started paying attention to how you know how he works, how he goes about his business, and really started, you know, trying to simulate him",
    "timestamp": "14:30-15:10",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "Well, I think you did a good job of that.",
    "timestamp": "15:12-15:14",
    "speaker": "Andy"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Try to.",
    "timestamp": "15:17-15:17"
  },
  {
    "speaker": "Andy",
    "text": "So do you have a uh kind of like favorite moment from your football career? Anything that stands out specifically?",
    "timestamp": "15:19-15:27"
  },
  {
    "text": "Oh definitely. Uh the first Super Bowl, I I have to say that well because it was in my home state.",
    "timestamp": "15:27-15:34",
    "speaker": "Kevin Faulk"
  },
  {
    "speaker": "Steve",
    "text": "Oh yeah.",
    "timestamp": "15:35-15:35"
  },
  {
    "timestamp": "15:37-16:05",
    "speaker": "Kevin Faulk",
    "text": "I won a high school championship in that stadium at that time. Uh then to come back and win a Super Bowl. And then in 2019 we won a national championship in there. So it supernome is kind of like a Yeah, no, I hidden. Right. So you know that that that that's definitely a memory. Um Bad memory. Bad memory losing his o seven."
  },
  {
    "text": "Yeah, well.",
    "timestamp": "16:05-16:06",
    "speaker": "Kevin Faulk"
  },
  {
    "timestamp": "16:07-16:29",
    "speaker": "Kevin Faulk",
    "text": "You me but. Uh but it still was That season was a memory like in its own. Just the the different weeks that went through it, you know, the different weeks were totally different each week as a team to you know play each and every other team. It was a different team that we had to face and we had to have a different game plan. So yeah, it was it was special."
  },
  {
    "timestamp": "16:29-16:53",
    "speaker": "Andy",
    "text": "So how that whole 2007 season felt like a big middle finger to like the whole league. Like you guys just never seem to take your foot off the gas. Is that how it was like in the locker room too? Or was that just like us fans being like, nah, look what we do. We can we can throw the middle finger because the Patriots are doing so well and stomping everybody."
  },
  {
    "timestamp": "16:53-17:59",
    "speaker": "Kevin Faulk",
    "text": "No, I I think it was something that throughout the course of training camp, mini camp You see what was developing. You see what type of team that we could have, we could possibly have. And then when we added that that that one piece that we thought that was gonna be And that was Randy and it was like came to training camp. I can remember the first couple of days of training camp. I don't know if time rolled out, was getting flushed out of the pocket, but he threw a deep ball to the left side And Randy was lined up on the right side. Tom threw the ball so high in the air. Randy just had to run under it in the back of the left end zone. And if you remember the play of the first game of the season against the New York Fets, it was the identical play. Identical ball that he threw. Just like that. And it was like, oh my god, did you guys see him go get that? Did you see him accelerate? And it was like, oh, wow."
  },
  {
    "speaker": "Andy",
    "timestamp": "18:00-18:05",
    "text": "That's exactly what I said when we're watching that Jets game. Yeah. He literally outran triple coverage."
  },
  {
    "timestamp": "18:04-18:22",
    "speaker": "Kevin Faulk",
    "text": "I'm like, this is gonna be something special this year, guys. I'm literally, literally. And then the team start to gain that confidence As as a whole team, wow. You can't stop it."
  },
  {
    "timestamp": "18:22-18:31",
    "speaker": "Andy",
    "text": "Yeah, no kidding. Yeah, yeah. So what the NASCAR defense is what they call themselves?"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Yeah, that's indeed. That's rough.",
    "timestamp": "18:32-18:35"
  },
  {
    "timestamp": "18:35-18:41",
    "text": "Yeah, not not not big giants fans in the Brown household, I gotta tell you. No. Not our style.",
    "speaker": "Andy"
  },
  {
    "speaker": "Steve",
    "text": "It's okay. It's okay, guys.",
    "timestamp": "18:46-18:48"
  },
  {
    "timestamp": "18:49-18:54",
    "speaker": "Andy",
    "text": "I mean the the the other the other six Super Bowls did kind of lessen the blow, so it's cool."
  },
  {
    "text": "You win some, you lose some.",
    "timestamp": "18:56-18:58",
    "speaker": "Kevin Faulk"
  },
  {
    "timestamp": "18:58-19:13",
    "speaker": "Andy",
    "text": "Yeah, that's true. I will say had to I had to delete all the sports talk radio stations from my car radio though. The next like six months after that, after that Super Bowl, I was just I deleted all my bookmarks, ESPN, and all that shit. Like I was I was done with sports for like six months. Couldn't do it."
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "19:13-19:19",
    "text": "Yeah, I don't I don't think I watched sports something until we actually went back to working out"
  },
  {
    "speaker": "Andy",
    "text": "Yep.",
    "timestamp": "19:19-19:19"
  },
  {
    "timestamp": "19:23-19:25",
    "speaker": "Kevin Faulk",
    "text": "I would have watched not nothing dealing with football right now."
  },
  {
    "speaker": "Andy",
    "text": "Nope.",
    "timestamp": "19:26-19:26"
  },
  {
    "text": "Yes. Yeah.",
    "timestamp": "19:28-19:30",
    "speaker": "Kevin Faulk"
  },
  {
    "speaker": "Andy",
    "timestamp": "19:30-19:35",
    "text": "Um, but you were actually drafted by uh Pete Carroll when he was coaching the team, right?"
  },
  {
    "timestamp": "19:35-19:41",
    "speaker": "Kevin Faulk",
    "text": "Yes, sir. Pete Pete Carroll was the head coach, Bobby Guerrero was the uh general manager."
  },
  {
    "text": "So um was was there a big difference between a Pete Carroll locker room and a Bill Belichick locker room?",
    "timestamp": "19:43-19:49",
    "speaker": "Andy"
  },
  {
    "text": "Oh definitely. Hands down. Pete Carroll is your players coach. Like he's whatever you need, you tell Pete he gonna take care of it.",
    "speaker": "Kevin Faulk",
    "timestamp": "19:49-20:00"
  },
  {
    "speaker": "Andy",
    "text": "Okay.",
    "timestamp": "20:00-20:00"
  },
  {
    "text": "Bill So now we're gonna work around. We're gonna work at what we got. Yeah. And we're gonna make it work. It's gonna work. It may be a little tough, but we're gonna make it work",
    "speaker": "Kevin Faulk",
    "timestamp": "20:01-20:13"
  },
  {
    "timestamp": "20:13-20:25",
    "speaker": "Andy",
    "text": "Well, it wasn't the uh the first year that Bill took over in two thousand by the end of the season because the salary cap was so Mangled like you guys couldn't even feel 53 players, right? Right."
  },
  {
    "timestamp": "20:27-20:42",
    "text": "Right. But that was I think he he liked stuff like that. Yeah. It seems that way. Yes. For some odd reason that's just Bill, you know, he liked doing you know that type of stuff. That I I can control this, I can make this make this work.",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "Yeah. Yeah. He also seems to like doing things the hard way.",
    "timestamp": "20:42-20:46",
    "speaker": "Andy"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Yeah no. But it seems like the hard way, but at the end of the year you're like We actually made that work.",
    "timestamp": "20:48-20:56"
  },
  {
    "speaker": "Andy",
    "timestamp": "20:56-20:58",
    "text": "Yeah. Yeah, that's true. Yeah."
  },
  {
    "text": "It's one thing is about him is getting a good feel. He's a I'ma get a good feel for my team guy.",
    "speaker": "Kevin Faulk",
    "timestamp": "20:58-21:06"
  },
  {
    "speaker": "Andy",
    "text": "Okay.",
    "timestamp": "21:06-21:07"
  },
  {
    "text": "I'ma understand what my team is, who they are, what our strengths are, what our weaknesses are And we're gonna attack it that way and try to avoid our weaknesses in games, but like you say, it's gonna happen. Of course. Gonna happen. So he he feels his team out and understands, you know What's the strengths of that team at that time? And that's not saying that the weaknesses can't be built into strengths later on in that season. But he knows that some at that point when it starts season, that's their weakness. So he knows his team.",
    "timestamp": "21:08-21:43",
    "speaker": "Kevin Faulk"
  },
  {
    "speaker": "Andy",
    "text": "So we we've had a uh not an argument, a disagreement I'd say, with Greg who uh conveniently isn't here. Um but I I am in the camp that Bill Belichick is a coaching genius. And Greg says he's just like a smart guy. And that like any good coach would would do a lot of the things that he did.",
    "timestamp": "21:43-22:02"
  },
  {
    "timestamp": "22:03-22:04",
    "speaker": "Steve",
    "text": "It's more credit than he deserves."
  },
  {
    "timestamp": "22:04-22:05",
    "text": "Yes.",
    "speaker": "Andy"
  },
  {
    "text": "One thing Bill does is pays attention to detail. Very small detail, little detail. Some of the things you'd be like, ah, why would you pay attention to that? Why would we need to know what school a guy went to that we're playing against? Why would that make a difference? Why would we need to know that he played a different position Why would we need to know that Ronnie Brown was left-handed before the Wildcat game? Why we need to know that? You know, just those little things That that you know like when soon as Ronnie Brown threw that pass, that touchdown pass The first thing I heard was, who knew he was left-handed? Not who had to cover that guy, but who knew he was left-handed? So you know that those little things. I think I'm being too loud. My wife told me to butt.",
    "timestamp": "22:08-23:10",
    "speaker": "Kevin Faulk"
  },
  {
    "speaker": "Andy",
    "text": "Why do you think I'm in the car? Yeah, right. I get the same thing. At least you can't hear me. So cause uh just for like uh you know peeling the curtain back a bit, the w the way that we convince you to come on is that I started a uh Twitter campaign. Where I would um post uh flattering things about you every day and post a highlight and stuff and like why why it was so cool. Um and the one today was actually because I've been I've been doing ones with the direct snap because you are kind that's kind of your play that a lot of people remember. Like when there's a big moment and the pages needed a conversion.",
    "timestamp": "23:11-23:52"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "two-point conversion or a touchdown or s or like they need this play that seemed to be where they would go why people didn't understand the Why people didn't get that? It's like he's going out in motion. He's out of the backfield. He's motioning back into the backfield. Hmm. And then Tom Rain goes like this. What's the one play they run when he motions back into the backfield? Yeah.",
    "timestamp": "23:52-24:20"
  },
  {
    "text": "And it caught him off guard every time. Every time",
    "timestamp": "24:21-24:24",
    "speaker": "Andy"
  },
  {
    "text": "The crazy thing is I'm watching the uh the Atlanta Falcons Super Bowl with the Pages. Yesterday or day before or something. Same thing. Yeah.",
    "timestamp": "24:24-24:34",
    "speaker": "Kevin Faulk"
  },
  {
    "timestamp": "24:34-24:36",
    "text": "What's the one play? They needed that those points.",
    "speaker": "Andy"
  },
  {
    "timestamp": "24:37-24:37",
    "speaker": "Kevin Faulk",
    "text": "Yes."
  },
  {
    "timestamp": "24:39-24:58",
    "speaker": "Andy",
    "text": "Yeah, then they wanted but the but Huh? I was gonna say the the one play that um I I found that I posted today was uh you ran that play, but then you ran to the right and and did the throwback to to Tom. who um look like a wounded gazelle finishing the play."
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Yeah. Hey, that was the problem though, like Can am I going to throw a good enough ball that is going to be perfect enough for Tom not to have to go try to chase it enough? Because if he has to go chase it, we're in trouble.",
    "timestamp": "24:58-25:11"
  },
  {
    "timestamp": "25:11-25:26",
    "speaker": "Andy",
    "text": "We've seen what happens. Steve was at the uh the Titans game where they they tried that. Amendole or something, like a few years ago. And that did not go well. The knee brace got stuck in the ground and he just, oh, look like you've been shot. It was rough."
  },
  {
    "text": "But but I must say They gave me a lot of practice, throwing the ball, you know, what people fail to realize is back then. I was like the number three quarterback because we only had two quarterbacks on the roster.",
    "timestamp": "25:27-25:39",
    "speaker": "Kevin Faulk"
  },
  {
    "speaker": "Andy",
    "text": "Right. Yeah Because that was I think 2002. That was after they they traded Drew Bledsoe. Yeah. Um and so I and yeah, I found the Boston Globe clipping that was talking like Bill Belchak after the game talking about how you guys would literally practice that every week. It had been for like months, but just never had the chance to call it.",
    "timestamp": "25:39-26:00"
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "26:00-26:04",
    "text": "We practiced that There's at least twice a week we practice that play."
  },
  {
    "timestamp": "26:05-26:05",
    "text": "Yeah.",
    "speaker": "Andy"
  },
  {
    "timestamp": "26:05-26:10",
    "speaker": "Kevin Faulk",
    "text": "At least twice a week. We might run once a year, twice a year?"
  },
  {
    "text": "Yeah. If that, yeah. Yeah. But even I mean you can say that about all the the trick plays you see. I mean every time after the game, whoever ran it, like the uh the double pass with Edelman, talking about, oh yeah, we practice this all the time. We've just never had the chance to call it, so we just don't. So it's that level of preparation I think that for me sets uh a Patriots team apart. They're always that well prepared. And always have been.",
    "timestamp": "26:10-26:36",
    "speaker": "Andy"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "That's kind of like I was telling people about that 2083 comeback. I'm like, they won that game. A long time before that game was even played, you know, there's certain situations that we practice as a group, and it may not be in that identical situation, but it was a situation similar to that we had to come back and we had to score three or four touchdowns. And we're like, oh that ain't gonna happen. That ain't gonna happen. Sure enough stuff happens in there The Super Bowl.",
    "timestamp": "26:36-27:08"
  },
  {
    "text": "Right. Yeah. Of all of all weeks. So what you're saying is you're team me and Andy, not team Greg. Got it.",
    "speaker": "Steve",
    "timestamp": "27:09-27:17"
  },
  {
    "speaker": "Andy",
    "text": "So so we can go on the record. Uh team fuck Greg is is strong here. I like it. Greg, useless.",
    "timestamp": "27:18-27:25"
  },
  {
    "text": "Greg, I don't know you, Greg. So yeah, I'm sorry, but you don't need to apologize.",
    "timestamp": "27:26-27:30",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "He's the baby anyway. He he gets he gets plenty of love. Yeah. Um I speaking to Greg actually, um he had some questions uh because you and him have certain things in common. Um he thinks that uh you two have something in common because you're both D1 athletes, but Uh I think that's that's a stretch. Um he rode the bench at UNH uh soccer. Yeah. Um played the same level. He claiming that D1 though. He's he's claiming D1 double A too. It doesn't even really count. Um But uh he was also, he's a huge uh Lil Wayne fan. So uh there's mention a little Wayne in your in your Wikipedia that I'm not gonna get into because you know it's not what we do here.",
    "timestamp": "27:30-28:16",
    "speaker": "Andy"
  },
  {
    "text": "I'm grown. I'm grown.",
    "speaker": "Kevin Faulk",
    "timestamp": "28:16-28:18"
  },
  {
    "timestamp": "28:21-28:28",
    "speaker": "Andy",
    "text": "But uh really we just kind of want to know he what was he want to know he said um what is your favorite uh Wayne album?"
  },
  {
    "text": "Oh Carter Five.",
    "timestamp": "28:29-28:34",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "Carter Five. Alright, here's what's Carter One. Yeah. And then for mixtapes, you got a favorite mixtape?",
    "speaker": "Andy",
    "timestamp": "28:34-28:40"
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "28:40-28:56",
    "text": "Uh I'm looking at it right. I'm looking at the I I can't think of the name, but I'm looking at the cover of it right now. Oh. I can't think of the name of it. Wow."
  },
  {
    "text": "His was uh the drought three.",
    "timestamp": "28:56-28:58",
    "speaker": "Andy"
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "28:58-28:59",
    "text": "That's it."
  },
  {
    "speaker": "Andy",
    "text": "That's it? Oh wow, all right.",
    "timestamp": "29:00-29:01"
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "29:01-29:07",
    "text": "Not to drop not to drop not to drop three, not that. No it might be one or two"
  },
  {
    "text": "All right. Might be one or two drowns so so I mean Greg's wrong on that too. That's perfect. That's exactly what we're talking about.",
    "speaker": "Andy",
    "timestamp": "29:07-29:13"
  },
  {
    "text": "But he's not wrong about no way, though. We're good.",
    "timestamp": "29:13-29:15",
    "speaker": "Kevin Faulk"
  },
  {
    "timestamp": "29:16-29:24",
    "speaker": "Andy",
    "text": "Yeah, oh yeah. Yeah. No, he uh he actually wanted people to call him um what do you want to what was his name? A breezy F baby, don't forget the baby."
  },
  {
    "text": "Yes. He did that for like a year.",
    "speaker": "Steve",
    "timestamp": "29:24-29:26"
  },
  {
    "timestamp": "29:26-29:30",
    "text": "A long time, yes. Yeah, that's rough.",
    "speaker": "Andy"
  },
  {
    "text": "Don't do it. Don't do it, Greg. Don't do it. Yeah, no, yeah.",
    "speaker": "Kevin Faulk",
    "timestamp": "29:30-29:33"
  },
  {
    "speaker": "Andy",
    "text": "Like you said, he's grown too, but uh maybe not. Don't do it.",
    "timestamp": "29:33-29:37"
  },
  {
    "text": "I have some real questions. Alright, give me a real question. Were you ever close to leaving the Patriots?",
    "timestamp": "29:41-29:45",
    "speaker": "Steve"
  },
  {
    "timestamp": "29:47-30:14",
    "text": "Year six was my like free age year. Yes and no. Uh It was between pages in Tampa. And it was like, you know what, my kids are very comfortable. School wise, don't make no sense to transform them to another school, different friends. So it was like, you know what? We just gonna stay here. How old were your kids then? Uh they were like in middle school.",
    "speaker": "Kevin Faulk"
  },
  {
    "speaker": "Andy",
    "text": "Okay. All right. Yeah, makes sense.",
    "timestamp": "30:14-30:16"
  },
  {
    "text": "They were young. It didn't make sense to move on. The money was very different, yes, but the money wasn't too much different. So it was like, you know, it's just it.",
    "timestamp": "30:16-30:26",
    "speaker": "Kevin Faulk"
  },
  {
    "timestamp": "30:27-30:44",
    "speaker": "Steve",
    "text": "Yeah, it makes sense. And then like, I don't know, I've always envisioned you as the first person in that role, right? That a bunch of guys have followed since Um, James White, Shane Green, all those different dudes. Woodhead. Is there someone before you? I don't even really. Or is this sort of like this Bill?"
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "30:45-31:26",
    "text": "This is all Bill. Um, like Bill brought me in, um told me, hey look, I'm gonna bring in these two guys, I'm gonna bring in this guy. Um I want to make you as my third down back. And I'm like, okay. I really want to be the guy, but third down back. And he started telling me about Metcalf he had at Cleveland. All right. Meggett at the Giants. You know, we start talking about those guys. And those all guys I watched when I was younger. So it was like, oh, what? Okay. Sure sure enough, you know, adapted to my role and there we go."
  },
  {
    "speaker": "Steve",
    "text": "Did you like beat somebody out at the time that was already on the team? Do you remember?",
    "timestamp": "31:26-31:30"
  },
  {
    "text": "Or no, this is when you no, I I think it like they had a couple of guys on the team that like could have portrayed that role. JR was on the team, Patrick Pass is on the team JR was actually doing a lot of the third down stuff in uh 01 whenever we won't. So he was doing a lot of this pickup stuff. So uh yeah. So those guys were there.",
    "timestamp": "31:30-31:52",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "Beat him up. And I imagine that probably helped you in the long run too. It prolonged your career, not having to be like taking all those hits.",
    "speaker": "Andy",
    "timestamp": "31:53-32:01"
  },
  {
    "text": "I'm trying to think of the yeah, definitely. Yeah, a whole lot. Yes, definitely helped me in my career and my longevity and everything. I'm trying to think of the running back that was there my first year with uh it was me, Terry Allen Uh uh Lamont. I forgot Lamont last name, but he was like a third down type back.",
    "timestamp": "32:01-32:24",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "Jordan?",
    "speaker": "Steve",
    "timestamp": "32:25-32:25"
  },
  {
    "text": "Nah, not Lamont Jordan. Not Lamont Jordan. Lamont Jordan came later. Yeah. He was an older guy.",
    "speaker": "Kevin Faulk",
    "timestamp": "32:26-32:32"
  },
  {
    "speaker": "Andy",
    "text": "Lamont Warren.",
    "timestamp": "32:33-32:34"
  },
  {
    "text": "Yes.",
    "speaker": "Kevin Faulk",
    "timestamp": "32:34-32:35"
  },
  {
    "timestamp": "32:35-32:36",
    "text": "Okay.",
    "speaker": "Andy"
  },
  {
    "text": "That might be that might yes Um that you know he kind of took me in his wing a little bit and broke down a little bit of the third down stuff for me. I at the time I was young, I wanted to be a good guy. Don't worry about no third down stuff, but he kind of Broke a little bit down to him and I kind of remembered for when that time came from. Cause that's what he did. That's what he did a lot of.",
    "speaker": "Kevin Faulk",
    "timestamp": "32:36-33:00"
  },
  {
    "timestamp": "33:01-33:05",
    "text": "Okay. Wow. Yeah, that's a name I haven't heard in a long time, Lamar Moore.",
    "speaker": "Andy"
  },
  {
    "text": "Yeah. I've been trying to think of his last name for a while too.",
    "timestamp": "33:05-33:08",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "Internet's a great play. It's dangerous, but it's great.",
    "timestamp": "33:11-33:14",
    "speaker": "Andy"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "I'm glad you got those rosters, buddies.",
    "timestamp": "33:13-33:16"
  },
  {
    "text": "Well Terry Allen was only on the team because um Robert Edwards tore his knee, right?",
    "speaker": "Steve",
    "timestamp": "33:16-33:21"
  },
  {
    "timestamp": "33:21-33:31",
    "speaker": "Kevin Faulk",
    "text": "Right, right. Well that's why I got drafted. Oh, Robert Edwards tore his knee up Jeez. That was brutal. Yes. Yes. Yes. Yes. Yes."
  },
  {
    "timestamp": "33:32-33:48",
    "speaker": "Andy",
    "text": "I mean I think we we talked about that on one episode and and like just the severity of it. He he tore every single ligament in his knee and like if they if they hadn't taken care of him the way they did, they would have had to amputate the leg or something. Like it was like real close."
  },
  {
    "text": "Really close. Yeah, that's nice. We saw him in a game watching this podcast. He was like playing for the Chiefs or something.",
    "speaker": "Steve",
    "timestamp": "33:48-33:53"
  },
  {
    "speaker": "Andy",
    "text": "Yeah, someone, yeah. And just wasn't the same guy.",
    "timestamp": "33:55-33:57"
  },
  {
    "timestamp": "33:57-34:06",
    "speaker": "Steve",
    "text": "Nah. You could tell. How could you be? Well, but even the fact that he came back and played in the NFL after that is solved. Yeah, that's that's a bounce back."
  },
  {
    "speaker": "Andy",
    "timestamp": "34:07-34:30",
    "text": "Um all right, so Steve asked some serious questions, so I have other ones that aren't so serious. Um I always loved the elbow pads and I was wondering if there was a story behind those because they they reminded me for some reason of like tire treads and I was used to like when I was young because I was little and I used to Like look for tire treads to see if they match your your elbow pads."
  },
  {
    "text": "There is a story. Um when I first got to New England I met a couple of guys, a few guys, like three or four guys. Um that we became very close. Real close. And one of the guy one of the guys was a younger guy and he was Design he was making or trying to design hockey pads. Hockey shoulder pads, hockey pads, you know, just And he told me that he was gonna design me some pet, some football shoulder pads. And I was like, man, don't worry about it, man. Look, we just gonna be cool, me and you. Don't worry about it And over the years, he was like, hey man, look, I want you to try this. Would you wear this for me? Would you wear this for me? And I'm like, explain it to me. Explain why I'm wearing this.",
    "speaker": "Kevin Faulk",
    "timestamp": "34:31-35:19"
  },
  {
    "speaker": "Andy",
    "text": "Yeah.",
    "timestamp": "35:19-35:20"
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "35:20-36:13",
    "text": "And he explained it to me, explained everything, and I was like, wow. Okay, I get it. Because we do get hit here sometimes. Yeah. And when you do get hit, At the right angle, you can cough up that ball. And I'm like, let me see these pads. Put them on. And I took a helmet and I hit my elbow. And I'm like, wow the the the like the all the like the power will spread through all the cubes in it. You can feel it I'm like, wow, okay. I'll wear them, bro. Started wearing them. And everybody like, man, where you get calls? Where you get this? What what was that? Yeah, yeah. And it was just something that he just put together at the time. Now, eventually they started he started patterning and patterning him and everything. But the the first couple, oh my god."
  },
  {
    "timestamp": "36:15-36:19",
    "text": "You always have like a gigantic chin scrap too, like your Oh yeah, that's right.",
    "speaker": "Steve"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Well I put a um wristband. Oh, that's a for the sweat for the sweat.",
    "timestamp": "36:19-36:26"
  },
  {
    "speaker": "Andy",
    "timestamp": "36:29-36:30",
    "text": "I can appreciate that."
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Yeah, I also had um Like the elbow pads, I had an undershirt with some those cubes underneath my pads to where I'll take a shake a hit. it would go through all those cubes as well.",
    "timestamp": "36:30-36:42"
  },
  {
    "text": "That's fascinating.",
    "timestamp": "36:43-36:44",
    "speaker": "Andy"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "So it wasn't just the elbow pads. I had a I had a little shot shirt too now. No kidding, huh?",
    "timestamp": "36:44-36:50"
  },
  {
    "speaker": "Andy",
    "timestamp": "36:49-36:51",
    "text": "Damn, learn all sorts of secrets."
  },
  {
    "text": "Like they do it now, like they have now, that's that's been yes.",
    "timestamp": "36:51-36:55",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "Yeah, yeah, yeah. Revolutionary. Kevin Fox setting those trends. D",
    "timestamp": "36:55-37:00",
    "speaker": "Andy"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "I like it. Well, I wish you would have patented and still have the stuff right now, but you know how it Yeah. That's how it goes.",
    "timestamp": "37:00-37:08"
  },
  {
    "text": "Inventors, man. Can't trust. Right. Um other oh I got some other questions from uh some some of our listeners. So let's go through these. We have listeners. A few. Okay. Do you tease your cousin about uh Super Bowl 36?",
    "speaker": "Andy",
    "timestamp": "37:08-37:28"
  },
  {
    "timestamp": "37:29-37:34",
    "speaker": "Kevin Faulk",
    "text": "No, I don't know. No. Because it could have easily gone the other way."
  },
  {
    "speaker": "Andy",
    "text": "Oh yeah, fair. Yeah, but it didn't though.",
    "timestamp": "37:34-37:38"
  },
  {
    "timestamp": "37:38-37:41",
    "speaker": "Kevin Faulk",
    "text": "No, it didn't. But no, I don't. I don't."
  },
  {
    "speaker": "Andy",
    "timestamp": "37:41-37:46",
    "text": "Because I mean our our our family's all from England, so uh Well the one thing, the crazy thing is"
  },
  {
    "text": "Like they like he really do believe that we stole signals from them.",
    "timestamp": "37:47-37:51",
    "speaker": "Kevin Faulk"
  },
  {
    "speaker": "Andy",
    "text": "Oh he does doesn't he?",
    "timestamp": "37:51-37:52"
  },
  {
    "timestamp": "37:56-37:56",
    "speaker": "Steve",
    "text": "He still believes that?"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "He's like absolutely Hey man, I'm like leave it alone. I don't want to talk about it.",
    "timestamp": "37:56-38:06"
  },
  {
    "timestamp": "38:06-38:27",
    "speaker": "Andy",
    "text": "Yeah, that's fair. We got family in England and uh Every once in a while, soccer will happen in England versus USA. And I feel like I'm the only one who wrote reps the USA in that. That's not true. Even my brothers. Greg, Greg's a big England. We are shit all over Greg today. He should have been here to defend himself. This is what he gets when he doesn't show up."
  },
  {
    "timestamp": "38:27-38:29",
    "speaker": "Kevin Faulk",
    "text": "This is bad, Greg. You're not here to defend yourself."
  },
  {
    "text": "But yeah, but I mean any excuse to to shit on a cousin for sports related things, I think, is works in our family. But I yeah, I can appreciate it if he if he legit thinks that You guys cheated together. That's that's that's a tough conversation to have.",
    "speaker": "Andy",
    "timestamp": "38:30-38:44"
  },
  {
    "timestamp": "38:44-38:56",
    "speaker": "Steve",
    "text": "Yeah, it is. So what did you think? Like give me give us some like memories from this 2004 Super Bowl run we're about to do. Oh yeah. What do you remember from those games?"
  },
  {
    "text": "So AFC divisional was home in the snow against that historic uh Peyton Manning offense.",
    "timestamp": "38:57-39:05",
    "speaker": "Andy"
  },
  {
    "speaker": "Steve",
    "text": "And we had no secondary. We had Troy Brown playing a bunch of snaps. Yep.",
    "timestamp": "39:05-39:10"
  },
  {
    "text": "Ooh. Relentless. That team knew what it took, what it was going to take, or what need whatever needed to be done, that team knew that we could get it done. However. After the 01 season, that 02 season where we didn't make the Super Bowl When we didn't make the playoffs, yeah.",
    "timestamp": "39:10-39:38",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "Thanks a lot.",
    "timestamp": "39:38-39:39",
    "speaker": "Steve"
  },
  {
    "timestamp": "39:40-39:52",
    "speaker": "Kevin Faulk",
    "text": "A lot of guys on that team, you know, let it be known, hey We know what it takes. We getting back there at some point. In the next two years, that's what happened. That's exactly what happened"
  },
  {
    "speaker": "Andy",
    "text": "And then the week after oh the week after that was going to Pittsburgh to play Ben Rothesberger.",
    "timestamp": "39:55-40:02"
  },
  {
    "timestamp": "40:02-40:03",
    "text": "Rookie Ben Rothesberger.",
    "speaker": "Steve"
  },
  {
    "timestamp": "40:03-40:07",
    "speaker": "Andy",
    "text": "Rookie Ben Raw had beaten you guys Pittsburgh early in the season."
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Oh yeah. Again. Yes, they beat his ear in the season. Yeah. Which you know like I know it's tough to be someone twice in the NFL. Yeah. Look, I know everybody about how Miami is horrible or was back in the day, how Buffalo. But do they understand how tough it was to beat those guys twice? I don't know. Everybody knows everybody's tendencies. Everybody knows what you're gonna do, when you're gonna do it. So it's like, okay, stop me",
    "timestamp": "40:07-40:40"
  },
  {
    "timestamp": "40:40-40:41",
    "speaker": "Andy",
    "text": "Right."
  },
  {
    "timestamp": "40:42-40:43",
    "speaker": "Kevin Faulk",
    "text": "That's all it is."
  },
  {
    "speaker": "Andy",
    "text": "Yeah, and can you? Because yeah, I mean I mean even the Buffalo Bills, you guys had unbelievable unparalleled success against them, home or away. But at the end of the day, none of those games were really blowouts. They're all close games. Nope. Just pulled them out every time.",
    "timestamp": "40:43-40:59"
  },
  {
    "text": "Miami Dolphins.",
    "speaker": "Kevin Faulk",
    "timestamp": "40:59-41:00"
  },
  {
    "timestamp": "41:03-41:07",
    "speaker": "Andy",
    "text": "Is there something about Miami, like in Miami, that's that's tough?"
  },
  {
    "text": "Uh we psych ourselves out every year.",
    "speaker": "Kevin Faulk",
    "timestamp": "41:07-41:09"
  },
  {
    "text": "Is that what it is? That's all it is?",
    "timestamp": "41:09-41:11",
    "speaker": "Andy"
  },
  {
    "text": "Yeah, it's just it's just a psyche thing, man. That's all. You go into a hot you go you go into a hot climate",
    "timestamp": "41:11-41:17",
    "speaker": "Kevin Faulk"
  },
  {
    "timestamp": "41:17-41:21",
    "text": "Yeah, so we're definitely gonna lose week one this year, right? Open Miami.",
    "speaker": "Steve"
  },
  {
    "text": "First time first week in Miami, baby.",
    "timestamp": "41:21-41:23",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "Yeah.",
    "timestamp": "41:23-41:23",
    "speaker": "Steve"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Yeah, that's tough.",
    "timestamp": "41:23-41:24"
  },
  {
    "timestamp": "41:25-41:40",
    "speaker": "Andy",
    "text": "That's tough. Um I've got to ask you this. Um you did convert that fourth and two, right? Like I will I will I will die on that hill. That was a conversion. You got a screwdriver by the refs."
  },
  {
    "text": "I think I got it. The guy tried to say that I bobbled the ball.",
    "timestamp": "41:40-41:44",
    "speaker": "Kevin Faulk"
  },
  {
    "timestamp": "41:44-41:49",
    "speaker": "Andy",
    "text": "But hey. Even if you did, he still you still crossed the line and you needed to."
  },
  {
    "timestamp": "41:50-42:31",
    "speaker": "Kevin Faulk",
    "text": "Look. I was sick, sick that that whole evening, when it had after it happened, the next morning, until I walked in the building. And I walked in the building, we were going, I guess we go we were going to work out, watch film and everything. And coach secretary was was waiting and he was like, yeah, if coach wanna see you. I'm like, okay. Going coach's office and and he just wanted to reiterate to me and let me know that hey if I had the opportunity to call that play again, have that situation again, I'm calling that same play. So that that right there just let me know, you know, don't even worry about nothing. Good."
  },
  {
    "timestamp": "42:32-42:35",
    "speaker": "Andy",
    "text": "Yeah, that's gotta feel good to have your coach have your back like that."
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Right, right, right.",
    "timestamp": "42:35-42:36"
  },
  {
    "timestamp": "42:37-42:39",
    "text": "What's Coach Fierce like?",
    "speaker": "Andy"
  },
  {
    "timestamp": "42:41-43:14",
    "text": "Great guy. Great guy. Just kind of like everybody is like a little something that Bill is not. Bill is not a real big talker. Wasn't a real big talker. Talks more now. Those guys, you know, held all the talking down for you. But attention to detail. Had to know what you was doing. If you didn't know what you was doing, you weren't gonna play for him at all. But a good person, really good person And coach.",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "So he's uh he just retired this past year, right?",
    "speaker": "Andy",
    "timestamp": "43:14-43:17"
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "43:17-43:19",
    "text": "Yeah. Yes, sir."
  },
  {
    "text": "Uh you have coached your high school team.",
    "timestamp": "43:19-43:22",
    "speaker": "Andy"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Yes.",
    "timestamp": "43:22-43:23"
  },
  {
    "speaker": "Andy",
    "text": "And you've coached your college team.",
    "timestamp": "43:23-43:25"
  },
  {
    "text": "Yes. See where we're going with that.",
    "speaker": "Kevin Faulk",
    "timestamp": "43:26-43:27"
  },
  {
    "speaker": "Andy",
    "timestamp": "43:27-43:31",
    "text": "Is the next step being coached for the Patriots in any capacity?"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "We can see. We can wait to see. I don't know. All right. We'll see. All right.",
    "timestamp": "43:33-43:38"
  },
  {
    "text": "That doesn't sound like a no to me. I'll tell I'll take it",
    "speaker": "Andy",
    "timestamp": "43:38-43:41"
  },
  {
    "timestamp": "43:41-43:52",
    "speaker": "Kevin Faulk",
    "text": "No, it's definitely not no no. Definitely not. That would be like a tri-fector. Are you kidding me? That's what I'm saying, yeah. That'd be like you know you dream about stuff like that."
  },
  {
    "speaker": "Andy",
    "text": "That's full circle, yeah. I like that.",
    "timestamp": "43:52-43:54"
  },
  {
    "timestamp": "43:54-44:02",
    "text": "Right. They might be mad at me this preseason though when they see me. I don't know about that.",
    "speaker": "Kevin Faulk"
  },
  {
    "timestamp": "44:03-44:05",
    "text": "I would be mad at Kevin Falk. Yeah, why would they be mad at you?",
    "speaker": "Andy"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Uh because I would be in another uniform. No.",
    "timestamp": "44:06-44:10"
  },
  {
    "speaker": "Andy",
    "text": "Really?",
    "timestamp": "44:11-44:11"
  },
  {
    "timestamp": "44:11-44:27",
    "text": "Yeah, but not a uniform but just another c another color Well called just for the preseason. Just tell me it's not Tampa Bay and I'm all right. It might be worse than Tampa Bay, it might be worse than Tampa Bay, Steve.",
    "speaker": "Kevin Faulk"
  },
  {
    "timestamp": "44:28-44:31",
    "speaker": "Steve",
    "text": "It's not the Jets. It can't be the Jets."
  },
  {
    "speaker": "Andy",
    "text": "Alright, good. Then it doesn't matter. All right, that's good to know. Interesting.",
    "timestamp": "44:34-44:45"
  },
  {
    "text": "Yeah, that'd be cool. I'm doing uh the Bill Walsh thing with the Giants this year.",
    "speaker": "Kevin Faulk",
    "timestamp": "44:45-44:49"
  },
  {
    "timestamp": "44:50-44:53",
    "text": "Oh cool, cool, cool That'll be interesting.",
    "speaker": "Andy"
  },
  {
    "timestamp": "44:53-44:58",
    "speaker": "Kevin Faulk",
    "text": "Yeah, because um I like I like I like your answer just now. Cool. Yeah."
  },
  {
    "timestamp": "44:58-45:06",
    "speaker": "Andy",
    "text": "Hey man having you back in the NFL. I don't even care. Like Kevin Fogg's back. I'll take it. I'll take whatever. It's all good."
  },
  {
    "text": "Yeah, so I got a cut I'm doing uh about three three weeks four weeks with them and it's just it just so happened that the first preseason game is in fox bro.",
    "speaker": "Kevin Faulk",
    "timestamp": "45:06-45:16"
  },
  {
    "text": "So you so you're coaching in Fox Bro that's close enough. We'll we'll get it we'll baby steps, right? Little baby steps, little baby steps. I love it. Uh all right, so I got one more thing here. Okay, go ahead. I want to hear kind of the story behind when you came out to announce a draft pick. And you were wearing a jersey, but it wasn't yours. And just so happened to be of a player who had just been suspended by Roger Goodell, who was standing right next to you for four games. How did that happen?",
    "speaker": "Andy",
    "timestamp": "45:18-45:52"
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "45:53-46:46",
    "text": "Man. It's the day of the giraffe, the morning of the giraffe, and I get a phone call, like an unknown number. You guys know nowadays you don't back then I was in unknown numbers. Oh no. But for some odd reason I picked it up I don't know why I picked it up. Hey, Kevin, man, how you doing? Say hey. Oh, well, how you doing? Hey, um Don't want to make you think that you have to do this, man. We just want to see if if you're on board with this. What do you think about uh wearing a Tom Brady jersey whenever you announced the uh the draft pick. I'm like wearing a Tom Brady jersey. See I wouldn't mind, but I don't have a time braided jersey on me."
  },
  {
    "timestamp": "46:46-46:47",
    "speaker": "Andy",
    "text": "Right."
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "46:47-46:51",
    "text": "They're like, don't worry. There's gonna be one in your room when you get there."
  },
  {
    "timestamp": "46:53-47:03",
    "speaker": "Andy",
    "text": "So who was it that was making this phone call? Do you know? Yeah. It's Tom. Fair enough. Fair enough. It was Tom."
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "47:05-47:18",
    "text": "Nah, it's not him. It's not him. Nah, I wouldn't lie about that. It wasn't him. He didn't know nothing about it. He didn't know nothing about it. Okay Trust me, it wasn't him."
  },
  {
    "text": "But he returned the favor though, right?",
    "speaker": "Andy",
    "timestamp": "47:18-47:19"
  },
  {
    "text": "At your uh Yeah, at the uh my at the retirement uh ceremony.",
    "timestamp": "47:19-47:24",
    "speaker": "Kevin Faulk"
  },
  {
    "speaker": "Andy",
    "timestamp": "47:24-47:27",
    "text": "Yeah, he came out in a uh Kevin Falk jersey."
  },
  {
    "timestamp": "47:27-47:34",
    "speaker": "Kevin Faulk",
    "text": "Yes, yes that's pretty dope. Some of the smallest things in the world. That was awesome. That was like very, yeah."
  },
  {
    "timestamp": "47:34-47:34",
    "speaker": "Andy",
    "text": "Yes."
  },
  {
    "timestamp": "47:34-47:39",
    "speaker": "Kevin Faulk",
    "text": "When he walked in, I'm like, okay, okay."
  },
  {
    "timestamp": "47:39-47:40",
    "text": "I love it",
    "speaker": "Andy"
  },
  {
    "timestamp": "47:41-47:41",
    "speaker": "Kevin Faulk",
    "text": "Yeah."
  },
  {
    "timestamp": "47:41-47:44",
    "speaker": "Andy",
    "text": "Yeah, because that's not something he does very often either, is it? No."
  },
  {
    "timestamp": "47:45-47:45",
    "speaker": "Kevin Faulk",
    "text": "No."
  },
  {
    "speaker": "Andy",
    "timestamp": "47:45-47:49",
    "text": "He's a busy man. So definitely. Yeah, that's pretty cool."
  },
  {
    "speaker": "Kevin Faulk",
    "text": "I gotta go check him out in Tampa too, though. He got a couple of my guys out there.",
    "timestamp": "47:49-47:55"
  },
  {
    "speaker": "Andy",
    "timestamp": "47:55-47:56",
    "text": "Oh, does he?"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "From LSU.",
    "timestamp": "47:56-47:57"
  },
  {
    "text": "Oh, right, right, right.",
    "timestamp": "47:58-47:59",
    "speaker": "Andy"
  },
  {
    "text": "Yeah.",
    "speaker": "Kevin Faulk",
    "timestamp": "47:59-47:59"
  },
  {
    "text": "Gonna make sure he treats them right, yeah.",
    "timestamp": "48:00-48:01",
    "speaker": "Andy"
  },
  {
    "timestamp": "48:02-48:15",
    "speaker": "Kevin Faulk",
    "text": "Yeah. Oh, trust me, he is. All right. You gotta think about it. Just think about all the Super Bowls he's won. There's been a running back from LSU on the team or somebody from LSU close to it"
  },
  {
    "timestamp": "48:16-48:20",
    "speaker": "Andy",
    "text": "That's right. Yeah, because um Stephen Ridley, right? He was from Sue."
  },
  {
    "timestamp": "48:20-48:21",
    "speaker": "Kevin Faulk",
    "text": "Yeah."
  },
  {
    "timestamp": "48:22-48:26",
    "speaker": "Andy",
    "text": "Oh man And then uh Legarrett, um, no, who am I thinking of?"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Leonard Fournette.",
    "timestamp": "48:27-48:28"
  },
  {
    "speaker": "Andy",
    "timestamp": "48:28-48:41",
    "text": "Leonard Fournette, that's what I was thinking, yes. Yep. Oh man, oh look at that. I thought I was the one with the stats. Yeah, I'm not sure. Getting shown up by Kevin Fogg. What is the problem?"
  },
  {
    "text": "That's just one I knew. That's just well he's That's a good one though. That's a good one. He he actually told me that. He was like Always gotta have an LSU back on my team. He told me that.",
    "speaker": "Kevin Faulk",
    "timestamp": "48:42-48:53"
  },
  {
    "speaker": "Andy",
    "timestamp": "48:53-48:59",
    "text": "That's awesome. Oh man All right, see if you've got any more questions?"
  },
  {
    "text": "Uh I just have one favor. Okay. We're the Browns, so Obviously Troy Brown's our favorite patriot, no disrespect. None at all. Just if he knew we existed, that would just make my life. Text them, you know? Hey Troy, these crazy three brown bros doing a podcast and they love you. That's all I know.",
    "speaker": "Steve",
    "timestamp": "48:59-49:22"
  },
  {
    "speaker": "Andy",
    "timestamp": "49:24-49:38",
    "text": "Yeah, Steve asks every guest we have on who has any relation to the Patriots whatsoever. Um if they will next time they talk to Troy Brown, mention us. So I don't even know if you talk to him at all. I can do that."
  },
  {
    "speaker": "Steve",
    "text": "This is the closest we never come.",
    "timestamp": "49:38-49:40"
  },
  {
    "text": "It is actually, yeah.",
    "timestamp": "49:41-49:42",
    "speaker": "Andy"
  },
  {
    "timestamp": "49:42-49:45",
    "speaker": "Kevin Faulk",
    "text": "He's so busy worried about coaching right now. Oh yeah."
  },
  {
    "speaker": "Steve",
    "text": "He ain't coming on the podcast. I've I've given that dream up.",
    "timestamp": "49:46-49:49"
  },
  {
    "speaker": "Kevin Faulk",
    "text": "Yeah, no, I don't think you're gonna get that, buddy.",
    "timestamp": "49:49-49:51"
  },
  {
    "timestamp": "49:51-49:53",
    "speaker": "Steve",
    "text": "Just knowing I exist is enough."
  },
  {
    "text": "I think he I think he worried about uh making it to the playoffs.",
    "timestamp": "49:56-50:00",
    "speaker": "Kevin Faulk"
  },
  {
    "text": "Yeah, he's worried he's worried about that uh week one preseason game against the Giants, I bet. Yeah Hey, what one game at a time, eh? You can't look forward. That's right.",
    "timestamp": "50:01-50:14",
    "speaker": "Andy"
  },
  {
    "timestamp": "50:15-50:15",
    "speaker": "Kevin Faulk",
    "text": "Yeah, okay."
  },
  {
    "text": "That's true. All right. Um so last question for you is do you have any questions for us?",
    "timestamp": "50:18-50:25",
    "speaker": "Andy"
  },
  {
    "text": "No, not at all. Oh, don't stop sending the highlights, man. Just keep them coming. I don't care.",
    "timestamp": "50:26-50:31",
    "speaker": "Kevin Faulk"
  },
  {
    "timestamp": "50:31-50:56",
    "text": "Oh hell yeah. Bro, I I have a website dedicated to to these sorts of things because I'm a nerd. It's ridiculous. Um and I use my power for good. Well, I use my power for nerd, let's be honest. Um I I have a stack of them and we're still going through, like I said, the 2004 season. So we're putting even more into the system. So Uh they ain't gonna stop for a while. Don't you worry about it. We got years.",
    "speaker": "Andy"
  },
  {
    "timestamp": "50:58-51:03",
    "speaker": "Kevin Faulk",
    "text": "So do y'all watch them together or like you may watch one game, they might watch one game, or"
  },
  {
    "text": "So me and Steve, we we will spend the week and we'll watch it by ourselves and then we'll come together and we'll talk about it. Greg just shows up without having watched the game pretty much every week. Yeah, pretty much. He's that brother.",
    "timestamp": "51:03-51:18",
    "speaker": "Andy"
  },
  {
    "text": "He's a freelancer.",
    "timestamp": "51:18-51:19",
    "speaker": "Kevin Faulk"
  },
  {
    "speaker": "Andy",
    "text": "He's something. He's little brother, you know. He's a lot of work is what is what he is.",
    "timestamp": "51:20-51:27"
  },
  {
    "text": "So y'all say he's the youngest.",
    "speaker": "Kevin Faulk",
    "timestamp": "51:27-51:29"
  },
  {
    "timestamp": "51:29-51:30",
    "text": "Oh yeah, yeah, yeah.",
    "speaker": "Andy"
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "51:30-51:32",
    "text": "Oh, but that's that's that gets it."
  },
  {
    "timestamp": "51:32-51:32",
    "speaker": "Andy",
    "text": "Right?"
  },
  {
    "timestamp": "51:33-51:35",
    "speaker": "Kevin Faulk",
    "text": "They they don't have no worries."
  },
  {
    "timestamp": "51:35-51:36",
    "speaker": "Andy",
    "text": "Tell me about it."
  },
  {
    "text": "It's right here. Everything you need is right there.",
    "speaker": "Kevin Faulk",
    "timestamp": "51:36-51:39"
  },
  {
    "speaker": "Andy",
    "timestamp": "51:40-51:43",
    "text": "That's right, yeah Yeah, he'll watch a highlight sometimes. That's that's all he needs."
  },
  {
    "timestamp": "51:43-51:48",
    "speaker": "Steve",
    "text": "Yeah. I watched Chris Burman talk about it for like two and a half minutes. That's enough, right?"
  },
  {
    "text": "Yeah, exactly.",
    "speaker": "Andy",
    "timestamp": "51:48-51:49"
  },
  {
    "speaker": "Steve",
    "text": "Wow.",
    "timestamp": "51:50-51:50"
  },
  {
    "text": "Yeah, so you know, the fact he's not here, not a huge surprise, because it's no as Greg Brown.",
    "timestamp": "51:51-51:56",
    "speaker": "Andy"
  },
  {
    "speaker": "Steve",
    "timestamp": "51:56-51:57",
    "text": "Tom Brand."
  },
  {
    "timestamp": "51:57-52:05",
    "speaker": "Andy",
    "text": "Yeah. But we appreciate that you were here. This has been like the coolest thing we've done on this podcast by a long shot."
  },
  {
    "text": "Thanks, Matt. Really appreciate it.",
    "speaker": "Kevin Faulk",
    "timestamp": "52:06-52:07"
  },
  {
    "text": "Really appreciate it. Yeah. And uh yeah, look forward to your uh your highlights. They'll keep coming.",
    "timestamp": "52:07-52:13",
    "speaker": "Andy"
  },
  {
    "speaker": "Kevin Faulk",
    "timestamp": "52:14-52:14",
    "text": "Appreciate it."
  },
  {
    "speaker": "Andy",
    "text": "Cool.",
    "timestamp": "52:15-52:15"
  },
  {
    "speaker": "Andy",
    "text": "All right, Kevin. Thank you so much. We'll talk you back. Take it easy",
    "timestamp": "52:15-52:20"
  }
]
