[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom"
  },
  {
    "timestamp" : "00:21-01:13",
    "speaker" : "Andy",
    "text" : "Alright, welcome back to the Patriots Dynasty Podcast. We're back again, believe it or not. Uh this is 2004 week four. Paige is traveling to Orchard Park to play Buffalo Um in a game I had never watched on TV because I was actually at this game, believe it or not. I flew up. It was the only the only thing I remember really about this game was Flying from Manchester, New Hampshire to Buffalo, New York. It's one of the few times I thought I was gonna die because the plane ride was terrifying. And everybody else on the plane, completely normal. They didn't seem bothered by it at all, but it was the most turbulence I've ever felt because it was a little tin can with wings. Um but we have a full house joining me today. We got both brothers Browns, Steve and Greg. How you boys doing I'm great. Fantastic."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:13-01:26",
    "text" : "You sound like you're on the top of the I'm excited to talk numbers, baby. All right, so I'm talking salaries, we're talking dead money, we're talking cap hits. So we're we're uh spoiling the surprise."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:26-01:50",
    "text" : "Thanks, Greg. Uh joining us as well is uh I'm probably Miguel Benzan, I think. Oh, nailed it. I always try. Yeah, you nailed it. Yeah. Um, better known, I think, to people on the internet as uh the Twitter account Pat'Cap. Yep. has been uh doing this for as long as I've been on Twitter, I think. Um so thanks for joining us."
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "I've been doing this in like 2000. I've been on Twitter since 2009.",
    "timestamp" : "01:51-01:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Wow, so you've just been tracking the Patriots salary cap since two thousand.",
    "timestamp" : "01:56-02:00"
  },
  {
    "timestamp" : "02:01-02:12",
    "speaker" : "Miguel Benzan",
    "text" : "Yeah. Since then I I'd say it's always a coincidence nor a correlation, but I I I just happen to think it's funny that I started doing it and I started winning."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "02:12-02:30",
    "text" : "So as somebody who's been uh doing a podcast tracking the Patriots since about that same time, uh hats off to you, sir. Uh how how did you I think we need to get kind of the elephant in the room, how did you get into following the Patriots salary cap?"
  },
  {
    "text" : "Basically came down the one day I read a stor I read a story that had Ted Johnson's cap number as whatever it was. Next day I read a story in the Boston Globe with a different cap number. As a person who's always been pretty good with ma with math, that doesn't didn't make any sense to me. Decided to do it decided to hey. I'll t I'll I could keep track of it on an Excel in an in a workbook and I asked my fellow and back in the day I asked my fellow p Patriot fans, like on newsgroups, back use Usenet newsgroups folks You have to Google that what that that was. Um in f in forums like KFFL forum and Patriots Bosco Net mailing list. I asked them if you see anything about the salary cap, just let me let me know. And I kept track of it. Like I had like a on my salary cap page, um, I had like cap footnotes. And we're talking about 2004. That back in the day when I was doing this, back then, then NFP NFLPA would actually publish documents, PDFs, they would talk about contracts. They wouldn't name the players. Okay, per se, but they would say this linebacker with the Patriots who had six years experience got this deal. So if you knew I could figure it out, reverse engineer knew figured out who they were talking about. Um so back then, that's why I started doing it. It started um I've been since then I've developed sources. I would say I looked back at my uh when you t you DM me, I look back at my two thousand four page. Yeah. Boy, I'm not sure that I got Now I'm very cl I'm very close to the numbers and I look back then, I'm not sure that my numbers as I know for a fact they ain't as close as they are now as they are now. And that just happens to be what comes with being ex more experienced and having better sources then um than I do back then. Um interest. It was to say that's why I started doing it and I just realized I could do a better job of the of covering the covering this outcome than beat riders.",
    "timestamp" : "02:31-04:39",
    "speaker" : "Miguel Benzan"
  },
  {
    "text" : "I mean yeah, I think they're not gonna be the one skill set too though, right? Like a numbers driven guy is gonna have a different approach than like uh interviewing players guy, you know?",
    "speaker" : "Greg",
    "timestamp" : "04:40-04:50"
  },
  {
    "text" : "Right. I'm I'm I've never interviewed a player or ex",
    "timestamp" : "04:50-04:53",
    "speaker" : "Miguel Benzan"
  },
  {
    "timestamp" : "04:58-05:00",
    "speaker" : "Steve",
    "text" : "Which one? Was it Troy Brown?"
  },
  {
    "timestamp" : "05:00-05:59",
    "text" : "No, it wasn't Troy Brown. Troy Brown's my favorite Patriot, but it wasn't Troy Brown. It was Oh my gosh. It was Steven Anderson. He's a tight end. It was after the the championship parade. I asked him a question. I don't even know if it's still on my phone. He answered me a question and um I was supposed to be put in an article but I never did. I consider myself a fan who ha who has a niche carries a a niche territory. I d um I have sources so I know what uh about the salary cap. Sometimes I hear about things that might the h th it's gonna happen with the Pagets, but I never tweet it out because the people who tell me those things ask me to keep it a secret. So I don't fall I don't break those. I'm not breaking a story.",
    "speaker" : "Miguel Benzan"
  },
  {
    "text" : "That's fair.",
    "speaker" : "Andy",
    "timestamp" : "05:59-06:00"
  },
  {
    "timestamp" : "06:00-06:23",
    "speaker" : "Miguel Benzan",
    "text" : "Um but if it comes to the salary cap, I will break stories because I I figured stuff out. Um and some and so that that if it comes to like breaking news like transaction wise and somebody's told me it gives me a hell up I'm not breaking their confidence. Um, but if it comes to the salary cap where I figured out something, I will say it on Twitter."
  },
  {
    "text" : "Yeah, yeah.",
    "timestamp" : "06:24-06:24",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "06:24-06:41",
    "speaker" : "Miguel Benzan",
    "text" : "Um It is it is a tough job being a journalist because not uh it's covering the p covering the football now because you gotta be a numbers guy. You gotta be a legal guy and now you gotta know about medicine and COVID and all this other stuff. Oh yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:41-06:45",
    "text" : "I don't know if you knew you were signing up for that in 2000. Huh?"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "I don't know if you knew you were signed up from that from the beginning like um what they guys gotta do and you gotta like for me I don't I'm not um I don't have to write a story, don't have to tweet unless I want to. Um I don't have to come up with anything. I'm not I don't ha um and I got a mission statement where I s basically tell people I um that's kinda true to my life where I say what I mean, mean what I say. I'm not going for clicks. I don't I don't have a problem when I'm wrong. I'm not making and therefore you know I'm not making stuff up to get clicks or to make but um it is what it is. I'm just it cracks me up that people will make stuff up.",
    "timestamp" : "06:45-07:32"
  },
  {
    "timestamp" : "07:32-07:34",
    "speaker" : "Andy",
    "text" : "Oh my god, yeah."
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "To get people to follow him. Um I told you. Um",
    "timestamp" : "07:34-07:40"
  },
  {
    "text" : "Among others I would say.",
    "timestamp" : "07:41-07:42",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:42-08:18",
    "text" : "Yeah, but I m I'm a s you know, but he's I c I can't believe that people he's still follow him when he tells people he is making the stuff up. He told you what he is and people still follow him. And I just and I and I thought about the how that relates to some people's relationship. Like why do you stick You think you could change a person when he's told you what they are? Stop. Because people want to hear what you want. People believe follow them because they want to hear they He's taking advantage of their willingness to believe anything.",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:19-08:23",
    "text" : "Right, yeah, yeah. Or wanting to believe true, yeah."
  },
  {
    "text" : "Um so who is this? Is this uh Some some guy named This is the rival? Sounds like a rival baby.",
    "speaker" : "Greg",
    "timestamp" : "08:23-08:32"
  },
  {
    "text" : "He's not nearly as famous though.",
    "timestamp" : "08:36-08:37",
    "speaker" : "Steve"
  },
  {
    "text" : "I've raised over thirty-three thousand dollars so far.",
    "timestamp" : "08:42-08:44",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Steve",
    "text" : "I donated a couple of bucks to you just because I was checking your Twitter all the time. I don't even",
    "timestamp" : "08:44-08:48"
  },
  {
    "text" : "Yeah, yeah, yeah. I don't know how much cap thank you. I don't know how much money I've raised for the bread of life and m at the food pantry in Malden. I just I I know people have sent them money. I just don't know how much I because of me. Um because they would have to tell the Brother Life would have to tell me this was They would get notes and stuff like that. But if somebody who gave them a a donation out of the blue didn't mention my name, I wouldn't you know I wouldn't get credit for that.",
    "timestamp" : "08:49-09:16",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Andy",
    "text" : "That's true.",
    "timestamp" : "09:16-09:17"
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "09:19-09:26",
    "text" : "That's one reason why I did it the way I do it. I'm doing it right now, if I have it at the unity, so now I can keep track of at least what I've done. Yeah. Trying to raise money."
  },
  {
    "text" : "That makes sense. Help spread awareness too. Absolutely.",
    "speaker" : "Andy",
    "timestamp" : "09:26-09:28"
  },
  {
    "timestamp" : "09:28-09:29",
    "speaker" : "Miguel Benzan",
    "text" : "Yeah, yeah, yeah. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh so the I have noticed one thing when you do every once in a while get something uh not necessarily wrong, but maybe slightly off. You talk about doing a lap. Do you actually go do a la?",
    "timestamp" : "09:29-09:41"
  },
  {
    "text" : "Yes. I need to lose weight. I put on a little bit of weight up during the pandemic. So I actually do do a lap.",
    "timestamp" : "09:41-09:48",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Steve",
    "text" : "Um what are you doing a lap around",
    "timestamp" : "09:49-09:52"
  },
  {
    "text" : "Uh it's actually it's more like I add a m I say a lap because I think that um that's a like a minute to my walk.",
    "timestamp" : "09:52-09:59",
    "speaker" : "Miguel Benzan"
  },
  {
    "timestamp" : "09:59-10:00",
    "speaker" : "Andy",
    "text" : "I'll take it."
  },
  {
    "text" : "Okay.",
    "timestamp" : "10:01-10:01",
    "speaker" : "Miguel Benzan"
  },
  {
    "text" : "And then the days I go to That's what I mean.",
    "timestamp" : "10:01-10:04",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, so there's a days to go there's a high school and and and and where I live. And then if I do it like on right before Sad they never remember it, I'll do a lap around uh a round the track. An extra lap around the track.",
    "timestamp" : "10:05-10:18",
    "speaker" : "Miguel Benzan"
  },
  {
    "timestamp" : "10:19-10:27",
    "text" : "I love it. I love it. That's so good. Uh so I mean you you're talking about being good with math. Do you do that sort of stuff for a living as well?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "10:27-10:38",
    "speaker" : "Miguel Benzan",
    "text" : "Or is this just kind of like no I so I I I majored in economics. So I started yeah, so like after I made um then I got a job with the FDIC."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "10:38-10:39",
    "text" : "Oh wow."
  },
  {
    "timestamp" : "10:39-11:23",
    "speaker" : "Miguel Benzan",
    "text" : "Okay, and then They had an open I just learned I had an affinity with working with computers. And so I switched over from being in the credit department to being in the information technology department. And then since then I've been in that in in in information technology. People bl think I'm an accountant by trade um because I'm good with numbers, but I'm not. I may I try to double major in economics and accounting. when I was in school, but my s they wouldn't let me because economics was in a college of liberal arts and I forget the s accounting was in a different school. A different college. But they wouldn't let me. I sorry I couldn't double major because I wasn't uh you couldn't double major if you had two different colleges."
  },
  {
    "text" : "At least everyone's gonna know where you're from because your accent is ridiculous.",
    "timestamp" : "11:24-11:27",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "I've I've been told that. I've been told that, yes.",
    "timestamp" : "11:32-11:35"
  },
  {
    "speaker" : "Andy",
    "text" : "See, I get told that uh only on this podcast. Apparently my boss and accent comes out more talking to you guys about football. For sure it does, but",
    "timestamp" : "11:36-11:44"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "We got the non Miguel right now. See yeah, I it people I I'll never forget I went to San Francisco once and and I asked for directions to the basketball arena And with the when one minute, one sentence, the guy says you must be from Boston. One sentence.",
    "timestamp" : "11:44-12:03"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:03-12:07",
    "text" : "Yeah, it doesn't take much. No, I love it."
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "I cannot forget the and the the Warriors came back. Cost me five dollars to go to the this was before they were b this was way back in the day. They were not good. Cost me five dollars to go to the game. Nice. Awesome. the way to be.",
    "timestamp" : "12:08-12:20"
  },
  {
    "text" : "Or maybe he gets that because you're wearing a Celtics jersey or something. No, no, no, no.",
    "timestamp" : "12:21-12:26",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "12:27-12:34",
    "speaker" : "Miguel Benzan",
    "text" : "No, I wasn't wearing a Celtics jersey back then. What the heck was I wearing? I don't remember what I was I wasn't wearing my reserve."
  },
  {
    "speaker" : "Andy",
    "text" : "If you had pulled that out, I would have been super impressed.",
    "timestamp" : "12:34-12:36"
  },
  {
    "text" : "No, no, no. No, no, no, because I know it wasn't wearing my reserve uniform. 'Cause it's after w it was after the training. I don't know what I was. I wasn't wearing I didn't bring any boss and stuff with me. Yeah. I know that Probably for the trip. Never when I was taking my trips for the reserves, I was never taking my trip.",
    "timestamp" : "12:37-12:53",
    "speaker" : "Miguel Benzan"
  },
  {
    "text" : "Again, we've talked about this. That's not true. You bring your accent with you, so that just helps me.",
    "timestamp" : "12:53-12:58",
    "speaker" : "Steve"
  },
  {
    "text" : "That's true, but I don't wear I hardly ever wear the now but when I was a kid When I was not as a kid, I was in the twenties. When I was I how you ever wore Boston s pr sports paraphernalia.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "13:00-13:10"
  },
  {
    "text" : "Yeah. Now I do. I tend not to wear it outside New England 'cause uh We're not particularly well liked.",
    "speaker" : "Andy",
    "timestamp" : "13:10-13:15"
  },
  {
    "speaker" : "Steve",
    "text" : "But when you live here you have no choice, dude.",
    "timestamp" : "13:17-13:18"
  },
  {
    "text" : "That's true, yeah. You guys have both moved away, so I'm leaving this weekend. Thank you very much. I wanna hear it. Um so you get asked a lot of questions on Twitter. Is there one that you get asked the most? Before right now? Just in general.",
    "timestamp" : "13:19-13:42",
    "speaker" : "Andy"
  },
  {
    "text" : "Justin J uh since I've been in 2009, there was a guy who it used to be how much cap space they had. Then a guy told the guy on Twitter suggested you should just put that in your handle and that stopped being the question Now it's more about who's the the player in right now is all about Gilmore. So that's now. Once he signs his deal, hopefully he'll go to something else. I bet you in in the next couple of weeks you'll be how come the draft picks haven't been signed? How come the draft picks haven't been signed? You know what I'm saying? Now the other Most frequently question this about when I talk about the roster is how come they haven't processed Patrick Chung's retirement? I have no idea. I they I I that was one thing I got wrong. I said they would process it on June second.",
    "timestamp" : "13:42-14:29",
    "speaker" : "Miguel Benzan"
  },
  {
    "timestamp" : "14:30-14:30",
    "text" : "Yeah, yeah",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:31-14:46",
    "speaker" : "Miguel Benzan",
    "text" : "Makes sense to me. I have no idea why I haven't. And I and and what to be something cap uh I wanna be embarrassed. I might be embarrassed if there's a cap a cap reason for it. Yeah, to thank you."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "14:50-14:51",
    "text" : "I actually know a little bit more than you do."
  },
  {
    "text" : "He messed with he's been messing with me this year. Yeah. Goodness gracious. Signing all these players and keeping me busy. And I'm not and then he signs a whole bunch of five draft picks right away. And then then stopped for a month.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "14:53-15:08"
  },
  {
    "text" : "Nothing, yeah.",
    "speaker" : "Andy",
    "timestamp" : "15:09-15:09"
  },
  {
    "text" : "Yeah, nothing. So true. He's been messing with me. I'm like, oh my gosh. And now we got the s now we got the July second opt-out deadline.",
    "timestamp" : "15:09-15:20",
    "speaker" : "Miguel Benzan"
  },
  {
    "timestamp" : "15:20-15:21",
    "text" : "Oh, right, right. Okay.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:22-15:24",
    "speaker" : "Miguel Benzan",
    "text" : "Which we just learned about today, folks."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:24-15:25",
    "text" : "Um Right."
  },
  {
    "timestamp" : "15:26-15:31",
    "speaker" : "Miguel Benzan",
    "text" : "I just I don't hopefully no Patriots opt out. I just can't imagine it."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I don't feel like it'll be the same as last year.",
    "timestamp" : "15:31-15:34"
  },
  {
    "text" : "Yeah, over sixty players off the n last year. I'd be shocked if it's even comes close to ten.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "15:34-15:39"
  },
  {
    "text" : "I agree.",
    "timestamp" : "15:39-15:40",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "15:41-15:50",
    "speaker" : "Miguel Benzan",
    "text" : "Unless the big boys do it. Yeah, I don't see that happening. I mean the big oh I'm talking about the offensive linemen and the defensive linemen. They're the who most likely qualify for the high risk thing."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:51-15:52",
    "text" : "Oh that makes sense too, yeah."
  },
  {
    "timestamp" : "15:52-15:53",
    "text" : "Yeah. Yeah.",
    "speaker" : "Miguel Benzan"
  },
  {
    "text" : "Yeah, defensive tackles and such.",
    "speaker" : "Andy",
    "timestamp" : "15:54-15:56"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Yeah, though the guys were really overweight.",
    "timestamp" : "15:57-15:59"
  },
  {
    "text" : "I mean although I mean you look at videos of Vince Wilfork playing basketball and like He may be overweight, but the two could still move. My gosh. Unbelievable how athletic they are.",
    "timestamp" : "15:59-16:10",
    "speaker" : "Andy"
  },
  {
    "text" : "It's they play at a different level that's like way beyond us. Yeah. Like the regular person.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "16:10-16:17"
  },
  {
    "timestamp" : "16:18-16:24",
    "text" : "We even looked it up and Vince Wilfork ran a faster 40 at the combine than Tom Brady did.",
    "speaker" : "Andy"
  },
  {
    "text" : "That I believe.",
    "timestamp" : "16:25-16:26",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "16:26-16:26"
  },
  {
    "text" : "That's not that shocking.",
    "timestamp" : "16:27-16:28",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:28-16:30",
    "text" : "That's not that shocking. It's a little shocking. No, no."
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "16:39-17:01",
    "text" : "She was in shock. When I I showed her the the Tom Brady video, the 40 video. It's like he's an ad he ran like that. I said yes and he trained for it. He trained for it. He took months. He probably trained a couple of months and that's how fast he went. And this is in his mid twenties. This is like you know, he's probably in the he's he's in better shape now than he's in his twenties."
  },
  {
    "text" : "Was he he threatening to run it again to see if he could run it faster? He probably could. I think a Wolfman probably could, yeah.",
    "timestamp" : "17:01-17:07",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Yeah. Uh um He I he he like from my side like I know people second like the thing about the two thousand team is like he I don't think the Patriots were ever coming close to putting him on the Ross on the field because he was so skinny.",
    "timestamp" : "17:07-17:22"
  },
  {
    "timestamp" : "17:23-17:23",
    "speaker" : "Andy",
    "text" : "Mm-hmm."
  },
  {
    "text" : "And I'm I'm I'm wondering, I'm thinking me maybe does Mac Jones have that too.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "17:23-17:29"
  },
  {
    "timestamp" : "17:29-17:35",
    "text" : "Yeah. Yeah. Yeah. I had had similar. That's a good take. Yeah. I agree.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "17:35-17:45",
    "speaker" : "Miguel Benzan",
    "text" : "Yeah, I don't know if see I'm w see he cause he looks like a guy who's gonna whose body's gonna change bet between this offseason and next off next training camp."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, absolutely.",
    "timestamp" : "17:45-17:46"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Yeah.",
    "timestamp" : "17:46-17:46"
  },
  {
    "timestamp" : "17:47-17:54",
    "speaker" : "Steve",
    "text" : "He's a little older than Brady was when he was tracked though, right? I don't actually know. Statue? Actually no. Wasn't Brady a senior as well?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. Although they were saying the other day that um if if the if Brady and uh Mac Jones play each other this year It'll be the biggest age gap in starting quarterbacks ever.",
    "timestamp" : "17:54-18:10"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Yes.",
    "timestamp" : "18:10-18:11"
  },
  {
    "text" : "Wow. That's true.",
    "speaker" : "Andy",
    "timestamp" : "18:11-18:12"
  },
  {
    "text" : "Yeah. Which is another record that Tom Brady has. Yeah.",
    "timestamp" : "18:12-18:15",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:15-18:18",
    "text" : "Oh yeah. He's got them all at this point."
  },
  {
    "timestamp" : "18:18-18:23",
    "text" : "He's got them. He's terrific. He's unbelievable. It's the best.",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Andy",
    "text" : "So you don't hold any ill will against Tom Brady for leaving? No.",
    "timestamp" : "18:23-18:28"
  },
  {
    "timestamp" : "18:28-18:58",
    "text" : "No. I did it's for me for me I I think of it as When you learn someone a couple has been married for like decades and then they get divorced. I think they just threw for whatever reason The little the things that used to the little things that used to get us that you used to l you let your husband or wife wouldn't buy those little things now drive drive you absolutely crazy. And I think that's what happened with those two with Bill Beljak and Tom Brady.",
    "speaker" : "Miguel Benzan"
  },
  {
    "text" : "What happens if your wife already thinks those things drive her crazy?",
    "timestamp" : "19:02-19:05",
    "speaker" : "Andy"
  },
  {
    "text" : "I I I I've been ma I've been married for a long time, so my wife puts up with a lot. So I I've I'm not push I'm not pushing my luck and asking her.",
    "timestamp" : "19:09-19:15",
    "speaker" : "Miguel Benzan"
  },
  {
    "timestamp" : "19:18-19:20",
    "text" : "She's got nothing on Greg's wife.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Hanging paintings in the bedroom. Put your foot down.",
    "timestamp" : "19:22-19:25"
  },
  {
    "timestamp" : "19:27-19:28",
    "speaker" : "Andy",
    "text" : "Oh God."
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Oh guys. Listen to a podcast about the patriots and you get marital of ice. Oh yeah.",
    "timestamp" : "19:28-19:32"
  },
  {
    "timestamp" : "19:33-19:45",
    "text" : "You get all sorts on this podcast. Yeah. Um but speaking speaking of football Um since we are a historical Pats podcast, I ask you a bit about that. Do you so your favorite player you said is Troy Brown, correct?",
    "speaker" : "Andy"
  },
  {
    "text" : "Is Troy Brown. Yes, as it should be. And it cracks me and folks, it cracks me up that people on Twitter will say it should be Tom Brady. I'm like, it it's my favorite play. It's your favorite place to be my favorite place. It's just an opinion. I'm like, okay. Okay. I'm sorry, I don't share the same opinion. It's just an opinion, folks. No. So why Troy Brown? There he is. I uh Troy Brown Great contract. No he was for me the original Patriots in the terms of the of the Bill Belichick area. error, excuse me. Plus I am ten feet away from where I'm pointing to my left where I predicted he would score a a touchdown on a punt return and it happened.",
    "timestamp" : "19:46-20:37",
    "speaker" : "Miguel Benzan"
  },
  {
    "timestamp" : "20:37-20:38",
    "speaker" : "Andy",
    "text" : "Which one? Was this the A game?"
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "20:38-21:09",
    "text" : "Oh, this is the championship? Not the championship game, but it was during the regular season because my friend Dave David was here and with my wife. And they I and he s he scored a touchdown on that play and I look like the awesome thing. Like during the um the snowball game. Yep I thought to myself that Tom Britney should be able to run in the ball at a the near the end zone. It didn't happen the next play, but it happened two plays after And I was like, oh my gosh, I called it, but I didn't really call it."
  },
  {
    "timestamp" : "21:10-21:12",
    "speaker" : "Andy",
    "text" : "Call it in your head, which nobody believes."
  },
  {
    "timestamp" : "21:16-21:30",
    "speaker" : "Miguel Benzan",
    "text" : "I was up my friend and I were in the top of the top of the arena of stadium, excuse me. So no one heard the idea. Exactly. I could see people the best thing about that you go into that game you could see people leaving. And then trying to come back."
  },
  {
    "timestamp" : "21:31-21:56",
    "speaker" : "Greg",
    "text" : "Oh, that's brutal. Wait, you were at the snowball game? I was at the snowball. Oh burying the lead there. Right? We've talked about this on the podcast about whether that's the best Patriots game you could pick to be at. Yeah. You had to pick one in Foxborough, the snow, the kick, Brady like cementing his legacy. Like that's There's a lot going on there."
  },
  {
    "timestamp" : "21:57-21:57",
    "speaker" : "Miguel Benzan",
    "text" : "There's a lot going on there."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "22:03-22:06",
    "text" : "That game was awesome too. That's definitely an insane classic"
  },
  {
    "text" : "Yeah, yeah, yeah. I see. I was at the snowball and then um that was I'll never forget that because I could watch people from leaving and then they just try to come back. That was the funniest thing ever",
    "speaker" : "Miguel Benzan",
    "timestamp" : "22:07-22:18"
  },
  {
    "text" : "Imagine if you went to that game and then left.",
    "speaker" : "Greg",
    "timestamp" : "22:19-22:21"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Like after the tuck rule happened, they didn't you know people did.",
    "timestamp" : "22:22-22:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, yeah. I bet none of them will admit it though. No, we were there the whole we were there the whole thing, I swear.",
    "timestamp" : "22:28-22:33"
  },
  {
    "text" : "Oh my gosh. It took me two hours to get out of the stupid pocket line.",
    "timestamp" : "22:36-22:40",
    "speaker" : "Miguel Benzan"
  },
  {
    "text" : "That's right, we're talking about that too. Imagine the traffic after that came.",
    "timestamp" : "22:40-22:45",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "22:45-22:48",
    "text" : "Oh my god. That's when you just grill again after that one.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:50-23:14",
    "text" : "I should have waited. I should have waited. I should've done it. My friend said she came on to hang out and I'm like, uh nah. I was soaking wet. Even though I was laid Didn't matter. I was soaking wet. I wanted to get out of the m out of out of the school. I literally took off most of my clothes in the ca in the car. It's like I literally drove home. With a t shirt in my and underwear in my underwear. Because I was so wet.",
    "speaker" : "Miguel Benzan"
  },
  {
    "text" : "We've done that, right, Andy? Oh yeah. After that Jets game. It was like a Thursday night Jets game too. That was such a bad game. And Andy's driving home shirtless. And I remember thinking, wow, Andy's hating this. That was a tough day.",
    "timestamp" : "23:16-23:33",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. So well let's about the two thousand four cap. Uh we just want to talk about it a little bit.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "23:33-23:36"
  },
  {
    "timestamp" : "23:36-23:38",
    "speaker" : "Andy",
    "text" : "Yeah, yeah. Give me some two thousand four numbers."
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "23:38-26:12",
    "text" : "Two thousand four numbers. Like t we obviously Brady was the had the high one of the highest cap numbers. The funny thing about the two thousand four cap is that I actually kept a spreadsheet where I tracked of how much money they pushed out into the next year. Oh. They did like so they pushed out money for eight players to keep that team uh together. And so like and at the and they did the sum so Brady redid his deal in September, which gave him the cap space to operate the next the rest of the the during the during the season. I mean they obviously you d need to replace r r injured players during the season. Back then the Patriots weren't using per uh active roster bonuses so that they didn't have that c consideration back then Um for me, I'm trying to I was trying to remember what I learned about the 2004 cap. For me, it was How many how f how few free agents they re-signed? They had a ton of free agents last in in 2000 and they let most of them go, signed some players, and they still And they repeat. I said that's pretty good. So I was like, I didn't man, looking back, I'm like, wow. And that's the other thing about the league year, it started on March 3rd. Like now the the league year starts in mid March. All right. Um so that was interesting for me looking it up uh looking up my numbers. It was the other thing that's happening during two thousand four, are they gonna keep Ty Thai Law. Oh right. And that was a big discussion. I wrote I must on the on the Pat's fans file from I kept on saying they could have kept Thai law, they should keep Thai law. I mean I thought they should have kept them. Obviously what's wrong, those one of those things, hey, they did they moved on and I kept on I you know saying but it was Capwise 2004 was kind of an interesting year because they had because the two they were coming up to 2006 was going to be the ending of the CBA They had this kind of quirky rule for the for Vince Wolfbuck and Ben wa Ben Watson. It took me 2000 it took me until I learned about the rule in 2001. It took me to 2004 to get it right. What was the rule? It was Because they were coming up at the end of the CBA, and it's not the rule doesn't exist anymore, right? So they're coming up to the end of the CBA and it's how much hump signing bonus coration you could have, a rookie could have. Oh my gosh."
  },
  {
    "text" : "Oh NFL making stupid complicated rules? That doesn't sound like the NFL at all.",
    "timestamp" : "26:13-26:17",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "26:18-26:53",
    "text" : "And they got yeah, and they got rid of it, thank God. I was like, oh my gosh, because It was so I got it wrong the first couple times I did it, try to figure these numbers out. And that's why I think when I went back and looked at it, my 2002 and 2003 numbers, ugh. They're wrong. Like in 2008, there was uh let's just say the NFLPA site w was open to the public for a while. Which means you could download any report you wanted to.",
    "speaker" : "Miguel Benzan"
  },
  {
    "text" : "Oh really?",
    "speaker" : "Andy",
    "timestamp" : "26:53-26:54"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Okay, yeah.",
    "timestamp" : "26:54-26:55"
  },
  {
    "timestamp" : "26:55-26:56",
    "speaker" : "Andy",
    "text" : "On purpose?"
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "26:57-28:01",
    "text" : "I I I I I don't think the security somebody screwed up on the security. Okay? That's all I'm saying. Fair enough. So I was able to download the reports for every every we were able the guys, the people who were the capologists, all the images, we were able to download uh every cap of cap reports for every player in the in the league that year. And then they had history. I'm like, man, I went back and I was like, man, I had some numbers wrong for these guys. And then and the w and it was w Wilk Fuck and Watson was being one of them was being the one of them because of that stupid rule. I was like, oh. That's why I wanted to bring it up because it's like, oh, I'm so glad the rule's not in the C B A anymore. I can't find and that's the interesting thing is I can't find a copy of the the CBA that was in in effect. of two thousand four. I'll say this about the NFL and NFPA. They can really need to do a better job of putting this stuff out that's online, the public. Like for example, the CBA's outlout was Is now online. Was it on it wasn't online back in the day when I started doing this. The bylaws are not online, period."
  },
  {
    "speaker" : "Andy",
    "text" : "Huh.",
    "timestamp" : "28:01-28:01"
  },
  {
    "text" : "Period. I mean though the the version that there used to be an old version, now they took it down, but they haven't put the new version on.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "28:02-28:10"
  },
  {
    "speaker" : "Steve",
    "text" : "Right, right, right, right. Aren't that Green Bay Packers like publicly held too? They should be uh Exactly. Exactly.",
    "timestamp" : "28:10-28:17"
  },
  {
    "text" : "So how do you how do you get all your like source information on like how do you put together your Your Excel sheet. Do you is it all publicly available stuff or are you pulling from sources or are you digging online?",
    "timestamp" : "28:17-28:32",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Okay, okay, so some stuff is some stuff makes public. Like for example, Aaron Wilson does a really nice who used to write for the Houston Chronicle. Uh doesn't write I don't know what he wr he writes for now, but he he does a great job of of putting out the numb of of tweeting out numbers. All right. He doesn't do He has been covering this NFL for years and still interprets the numbers incorrectly, but at least he puts out the numbers and I can figure it out that way. So Tom Palisaro Ian, Adam, they'll tweet out the things, the contract details. I can f you give me enough contract details, I can figure it out. All right. Okay. I have a s A couple of people sources who have access to the contract database. And so if I have a question, I'll ask them to give me the clarification. Yeah. Right? I on and um as since I'm a cap geek, every day, every m for one of the first things I do in the morning after I go to the bathroom is I go down and I download the NF the spreadsheet from the NFL public salary cap page. Okay. That helps me figure out the the changes in the in in that change I can figure out if the page has done a deal recently. All right. And if they did a deal recently, what the percentage of the of the cap was. Because So that's the answer to the question. I'm not gonna name the sources. I have sources.",
    "timestamp" : "28:35-30:04"
  },
  {
    "text" : "Are there other fan versions of you?",
    "timestamp" : "30:04-30:07",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Like do the cowboys have a at the Cowboys used to have one The name guy Adam JT13? He used to do it.",
    "timestamp" : "30:07-30:15"
  },
  {
    "timestamp" : "30:16-30:17",
    "text" : "Shout out Adam J13.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "30:20-30:53",
    "text" : "So Nick Cortey who works works for writes for the um over at the cap. com. He's now the comp pick goudal, compensary pig pic guru. He's just building off the work that Adam JT13 did. Okay. So like you when you were talking when the two in the early two thousands, Adam JT would he had a source. that had access to the contract database. He would I he would post numbers out there and he I would use his numbers, all right? So there's 32 teams, I think there's 20 of us?",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:54-30:58",
    "text" : "You guys like a a a capologist? Yeah, you guys have a lot of people who are not going to be able to do that."
  },
  {
    "text" : "I I would say.",
    "timestamp" : "31:01-31:01",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Andy",
    "text" : "You guys have like a WhatsApp group and stuff? No, we just formed",
    "timestamp" : "31:02-31:05"
  },
  {
    "text" : "There's a four d there's a four of us who DM each other all the time. Me, Troy who does the Texans, Ian who does the Steelers Jason who does the Jets, Brian who does the Ravens. This is the five of us who DM each other. We we've been dying DM members for years.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "31:06-31:24"
  },
  {
    "text" : "This is awesome.",
    "speaker" : "Greg",
    "timestamp" : "31:24-31:24"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "We don't put The other guys, and there's unfortunately there's not one woman out there who's doing this. Um the other they DM us sometimes. They ask us questions. Um They only they they we you know we tweeted at each other um but there is not like a there used to be back in the day I started a a Yahoo group. I don't know if it's still they still have Yahoo still has groups. I don't I forget what it called App AM Cap NFL. That was his name. AM being short for amateur, cap being cap short for capologists, NFL being the obvious. Alright? It used to be back in the day, so like Jason Hurley, who does the 49ers, used to be in that group. Bryce Johnson, who used to was Eagles captain back in the day, who now works in the Eagles front office. Oh, that's a good one. Oh man.",
    "timestamp" : "31:25-32:17"
  },
  {
    "speaker" : "Greg",
    "text" : "So so like you know like Spow Track? I mean, whenever I'm like trying to figure something out, I go on Spow track. Is that accurate?",
    "timestamp" : "32:18-32:25"
  },
  {
    "text" : "Stop that. Stop that.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "32:26-32:28"
  },
  {
    "text" : "This is what I need to know. Nerd brought the expert.",
    "timestamp" : "32:29-32:31",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "32:31-33:04",
    "text" : "Okay, so I literally so literally hopefully because I'll say this. They do a good job of Mirroring w over the cap. Okay, so over the you need to be at over the cap. com Forget Spotrack. And then you can lean and I'll tell you this, Spotrack still gets their numbers wrong. They still do not understand the cap. But people because they have a nice They have a better constructed database. People go to them."
  },
  {
    "timestamp" : "33:05-33:06",
    "text" : "Like the interface.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "33:06-33:29",
    "text" : "Yeah, the interface, their interface is better than over the caps. But the n go for the over the for the you want accuracy? Go to over the cap for every team but the Patriots. Me you should say follow me for the Patriots. That's all I gotta say because I have an umbrella insurance, but I really can't afford to get sued by them."
  },
  {
    "text" : "Your opinion on Corey Dillon because he was the trade, not the free agent.",
    "timestamp" : "33:31-33:35",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah I love oh my gosh. I love that trade. I loved his deal. For example, he had incentives up like yin yang in his deal, so that was So it was one of the things like I y I would go out and post and he just made this money how much money he had. I would think I do on Twitter right now as like um When a player has earned his incentives, I'll tweet it out. Yeah. I I used to do that big time for Corey Dillon at the end of the 2004 season. It was it it was so fun.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "33:36-34:04"
  },
  {
    "speaker" : "Greg",
    "text" : "What about Ricky Williams? Remember that contract he signed his rookie deal?",
    "timestamp" : "34:04-34:09"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "I wanted to like",
    "timestamp" : "34:14-34:16"
  },
  {
    "text" : "Yeah, all the benchmarks were like NFL like rushing records.",
    "speaker" : "Greg",
    "timestamp" : "34:18-34:21"
  },
  {
    "timestamp" : "34:24-35:05",
    "speaker" : "Miguel Benzan",
    "text" : "Yeah, so like you know, so back in the day, so when I started doing it The when the rookies got their the top rookies when they get the deals, the people that have big numbers. Right? Adrian Penerson had a a big number, big rookie deal number, right? People didn't realize how much money what he had to do to get the all of his all of his money. He had to run to two thousand yards every season and be the NFL MVP to reach his whole deal. They d the agents used to fluff up the numbers big time. That's so true. That was one thing I'm so glad they got rid of the rookie deals because I'm so tired of saying, yeah Oh, this rookie got a a sixty million dollar deal over five years. He's never gonna see that sixty million dollars. No."
  },
  {
    "text" : "Yeah, so that's a question I had, right? So all the all the rookie deals are like Kind of like hardlined in there, right?",
    "timestamp" : "35:05-35:12",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "35:12-35:17",
    "speaker" : "Miguel Benzan",
    "text" : "So the n the number the number the first year number is hardlined in there."
  },
  {
    "speaker" : "Greg",
    "text" : "So it's everything after the like what are they negotiating with.",
    "timestamp" : "35:17-35:20"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Okay, so okay, so let's just go by round",
    "timestamp" : "35:21-35:23"
  },
  {
    "text" : "Yeah, okay.",
    "speaker" : "Greg",
    "timestamp" : "35:23-35:24"
  },
  {
    "timestamp" : "35:24-36:20",
    "speaker" : "Miguel Benzan",
    "text" : "For the seventh round, all you're negotiating is when if when you get if and when you get injured. When do you get the split salary? Because folks, for rookies and undrafted free agents, right? The NFL screws them over when they get r inju in injured. They lower their salary. Alright. So these guys right now are making $660,000 as a rookie salary. But they get injured, it goes down like $415,000. I'm just going off the top of my head so I don't know it. Alright. So that's what they're negotiating, is like Hey, if I get injured, when do I get is it is it in the fr throughout the entire first year of my work year and throughout the first year, entire second year? Or sometimes sometimes just the preseason of the second year. Most NF every NFL teams, like if you get hurt if you're a seventh round pick in the first year, you can guarantee your salary is getting lowered."
  },
  {
    "text" : "Okay, so their only leverage is I could just like sit out or not play for this. So they have no leverage their clear.",
    "speaker" : "Greg",
    "timestamp" : "36:20-36:28"
  },
  {
    "text" : "No leverage, you are not wasting You because the second contract is so much money, you are not wasting that year. You were just saying, hey, I'm just gonna put up with it. I'm gonna go hit.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "36:29-36:39"
  },
  {
    "speaker" : "Greg",
    "text" : "Give me the piece of paper, I'm signing it.",
    "timestamp" : "36:40-36:41"
  },
  {
    "timestamp" : "36:41-38:18",
    "speaker" : "Miguel Benzan",
    "text" : "I'm signing it. There's no way I said none of no rookies l is leveraging is gonna hold out anymore. Okay. The brakes, Brownie. Okay. Sixth round, the same thing. They're only negotiating about this when the sp salary kicks in. Fifth round, same thing. Alright. Fourth round, same thing. Now with now we're talking about the the um the third round. This is where it gets tricky, folks. Alright. So in the CBA, it says a rookie salary can only increase by twenty-five percent of his total salary and his signing pluration. of the first year. So that we know the rookie salary is six hundred sixty thousand dollars. Okay? If he gets a bonus of the a signing bonus of a million dollars That's $250,000. $660 plus $250 is is $910. Divide that by by divide that by four and that's twenty five that equals twenty-five percent. That that month that amount is how much the salary can go up. each year. All right? So for third round picks, right? They're negotiating they How much this salary was gonna be, not in the first year, because we know it's gonna be six hundred sixty thousand dollars, all right. We also know in the second year it's gonna be whatever the maximum possibly is, depending on what signing bullets they got, all right. They're negotiating how much the third year salary is."
  },
  {
    "text" : "Wow.",
    "timestamp" : "38:18-38:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Yeah. And then therefore they're the by the negotiation of the third year salary, you're also negotiating your fourth year's salary. All right? So for for Ronnie Perkins. He's a third round pick for the Patriots. He happens to be a compensatory comp pick. There's ten of them. Ten comp pics in the third round picks. They all have quirky rule. They're all gonna get the same amount of money. What?",
    "timestamp" : "38:19-38:44"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "38:44-38:48",
    "text" : "Because they're a compic? Yes. Because compic, everyone has to get the same level of garbage."
  },
  {
    "text" : "They're gonna have the same Cap number in two thousand twenty one. Those ten k players are gonna have the same cap numbers. So even one guy is ninety-six and hundred and six. They're all gonna have the same cap numbers.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "38:49-39:00"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but the NFL is like on odd numbered years only.",
    "timestamp" : "39:00-39:04"
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "39:07-39:58",
    "text" : "So the thing is, so the la so th this is why Ronnie Perkins deal hasn't been done. All right. The last every fourth round pick, every fifth round, seventh round have b all been signed. I I should look it up really quickly. I think the last sixteen picks in the third round haven't been signed because of this quirky rule. And it's gonna be Somebody in that ten has to be the first one to go forward. Oh. Yeah. For example, with this teams like I think tip bay who've signed every pick but the third round pick. Because yeah. So that's the third round pick. That's the third we took talked about the third round. But second round pick Alright? They're getting the maximum salaries. Alright, throughout the deal."
  },
  {
    "text" : "Okay.",
    "timestamp" : "39:59-39:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "39:59-41:18",
    "text" : "Okay, what they're negotiating and the the first year salary is guaranteed. Okay? Oh, all right. Yeah. Second year's salary is guaranteed. Okay? Well that's what the really negotiation is how much of the second year salary is guaranteed. Alright? And how much the third-year salary is guaranteed. Oh. All right? Because that because when you get a salary get guaranteed, if you get cut, you get the money even no matter what. All right. For the first round picks For most of them now, all the salaries guaranteed. The top 27 right now. Every every part of it is just go and this just gets negotiated. Each year, the number of picks who get fully guaranteed deals goes up All right. Back in the day when it was 2011 when the f this new the this rookie this new rookie slot on system came in, very few had ver guaranteed years. Now it's up to 2728. All right. So the they're not negotiating about the money. They're not negotiating about guaranteed salaries. They're good negotiating about when they get their money. For example, they have a signing bonus. Folks if they're getting a t if you're getting a fifteen million dollar signing bonus, some teams don't pay you the fifteen million dollars right away. They're looking so they either put they're looking like doing installment plans for those Look up Google um layaway. Okay."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh man. I understand layaway.",
    "timestamp" : "41:22-41:25"
  },
  {
    "text" : "Um do the players get interest on those installments? I'd be like, yeah, you get twenty-six percent interest. They don't get shit.",
    "speaker" : "Steve",
    "timestamp" : "41:29-41:35"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "They don't get any interest. Can me the the Owners are always about that's why they're billionaires. 'Cause they they take care of their money to the they ain't giving up the players the the any money. They don't get interest. Um so the negotiating one their thing. They're negotiating what what would cause them to forfeit the guarantees. So last year, Rockhand Smith, like there was a that crazy rule about the helmets. All right. Where you could hit someone and you could actually lose, be suspended.",
    "timestamp" : "41:36-42:07"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh right.",
    "timestamp" : "42:07-42:07"
  },
  {
    "timestamp" : "42:08-42:08",
    "text" : "Right?",
    "speaker" : "Miguel Benzan"
  },
  {
    "text" : "Oh yeah.",
    "speaker" : "Greg",
    "timestamp" : "42:08-42:09"
  },
  {
    "timestamp" : "42:09-42:25",
    "speaker" : "Miguel Benzan",
    "text" : "He was afraid his his his agents were afraid, well if I get suspended for that, I'm losing my guarantees. Oh like and if you think if you work for um Tim Con Tom Conflin, if you're late for a meeting, like for why should I f why are you late for ten meetings?"
  },
  {
    "timestamp" : "42:26-42:31",
    "text" : "If you were on time for a meeting. Huh? But if you were on time, not just five minutes early for a meeting.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, yeah, yeah. You could lose your guarantees. Yeah. Yeah. Okay. So then Yeah, so then the uh the the other thing people would say on my some guy on would say this but the offsets folks it that's not true for it's only four teams who who has ever used uh who ever have offsets and what I mean by offsets is like hey you cut a player with guaranteed money he goes to another team He's not double di he doesn't uh if you have an offset, he doesn't he's not double dipping.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "42:31-43:01"
  },
  {
    "timestamp" : "43:01-43:02",
    "speaker" : "Andy",
    "text" : "I got you."
  },
  {
    "text" : "All right. For example, Steven Kowkowski, he got cut last year by the Patriots. He had two million dollar guaranteed salary. All right Patriots got a credit on the 2000 this year's cap because he got paid more than two million dollars last year by the Titans.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "43:02-43:16"
  },
  {
    "text" : "Right.",
    "timestamp" : "43:16-43:16",
    "speaker" : "Andy"
  },
  {
    "text" : "So he didn't double dip. So the offset, if you have an offset, a guaranteed offset, you don't double dip. The Jaguars, the Rams, they don't care about double dip, if they don't care about the offsets. The Bears, Justin Fields doesn't have an offset in his deals because m Mitch Trubrisky didn't have an offset in his deal. And I just forgot the fourth team that's gonna kill me. Um Oh the Raiders, the Raiders, Marcus Moriola, Marcus Moriola. It's always a quarterback. And I'll s and the other thing you'll you'll notice that that the quarterbacks, because they play the most important positions, sometimes they get more money. Um, like for example, if you're on a fourth or fifth round pick, right, you sometimes get an if you're a quarterback, you might sometimes get an off-season workout bonus. Right? So you get $15,000 more. If but if you're a center, same team, same team, you're a fifth round pick, center, you're not getting an off-season workout bonus. Quarterbacks sometimes do. So does that I think that answers your question.",
    "timestamp" : "43:16-44:19",
    "speaker" : "Miguel Benzan"
  },
  {
    "timestamp" : "44:20-44:20",
    "text" : "Yes. Okay.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "44:21-44:32",
    "text" : "All right. When talking to your like other salary cap expert friends, is the Patriots the one that's the hardest to follow? Or it would be intricate."
  },
  {
    "timestamp" : "44:33-44:54",
    "speaker" : "Miguel Benzan",
    "text" : "They the pages hardly ever do until the last couple of years really difficult deals to figure out cap-wise. Okay? They didn't highly there were they weren't using voided deals. They weren't using escalators. They weren't doing any pay v um buying back of years and stuff like that. Like unusual?"
  },
  {
    "timestamp" : "44:54-45:00",
    "text" : "In the league? Yeah. Dave. Is Belichick better or worse than his peers at managing his cap?",
    "speaker" : "Steve"
  },
  {
    "text" : "Another question. Is it Belichick or is there some sort of like lawyer slash Someone who waits for the works of the city.",
    "speaker" : "Greg",
    "timestamp" : "45:00-45:08"
  },
  {
    "timestamp" : "45:16-45:38",
    "speaker" : "Miguel Benzan",
    "text" : "Um Nick Cassario used to sign the contracts. Now it's um Patricia. All right? But he's not the guy, like my Patricia in in Nick Casario. weren't figuring out the the cap thing. So there's a guy that works there that his job is to manage the cap and patriot front office if you listen to this podcast, right? I'm so sorry I forgot the guy's name. All right. I am so hungry right now. I can't."
  },
  {
    "timestamp" : "45:38-45:44",
    "speaker" : "Greg",
    "text" : "Dude, I'm hiring you right now. Yeah, that's what I'm saying. If you're listening, Patriots front office, hi Miguel. You know what he's talking about?"
  },
  {
    "text" : "Um experience. The Patriots follow I know the Patriots follow me on Twitter. And I know that the the players Know about me. Know about my website.",
    "timestamp" : "45:45-45:59",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Steve",
    "text" : "I can imagine, right? Have you ever met Troy Brown then?",
    "timestamp" : "45:59-46:03"
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "46:03-46:16",
    "text" : "I have met Troy Brown at a training camp. I asked for his pri um autograph. Oh, he looked nice. He was the nice guy. Some guy Some guy cut in front of a kid."
  },
  {
    "text" : "Oh God.",
    "speaker" : "Andy",
    "timestamp" : "46:16-46:16"
  },
  {
    "text" : "Yeah, and the guy was upset. I'm like, are you serious? Yeah. Yeah. He was like, come on, let the kid You know, so but I mean I mean I know some I I mentioned it cracks me up. I mentioned on on Twitter that T Ryan is my favorite guy, right? And I guess some guy people say he was a jerk to me one time. I'm like, okay.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "46:21-46:42"
  },
  {
    "speaker" : "Andy",
    "text" : "No, he wasn't.",
    "timestamp" : "46:43-46:43"
  },
  {
    "text" : "There you go. I mean that literally You know, people uh you people might sometimes have bad days. Yep. If Troy Brown jerks you, I'm gonna guess it's your fault. Yeah, Twitter is Twitter. Yeah, but literally, I mean you're judging you're judging the man on one",
    "timestamp" : "46:44-46:59",
    "speaker" : "Miguel Benzan"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "46:59-46:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:00-47:01",
    "text" : "Interaction with him.",
    "speaker" : "Miguel Benzan"
  },
  {
    "timestamp" : "47:01-47:02",
    "speaker" : "Andy",
    "text" : "Yeah, with thirty seconds of his life."
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Yeah, thirty seconds of his life. You don't you know saying um so I have met Tread Bound. And the Patriots don't do how they ever do really complicated deals.",
    "timestamp" : "47:03-47:13"
  },
  {
    "text" : "I I mean that's Do you get the feeling that they're they're good at cap management or do you I mean is it is there are there teams where you're like valuating the plays to what they they to the",
    "timestamp" : "47:14-47:26",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "They're very good at evaluating the play what the player's worth to them. Right.",
    "timestamp" : "47:27-47:31"
  },
  {
    "speaker" : "Greg",
    "text" : "Yes. Okay.",
    "timestamp" : "47:31-47:32"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "To to them. Some some teams I s you know And what I mean by that is that some for player Calvin, he went to to the v to the to the Dolphins. They paid him a b they paid him a one year good year year salary, but they didn't think it's worth the next that much money. All right. He comes back to the Patriots. Same same player Same talent, same abilities. One team thought he was what worth watch m watch worth w was worth much more.",
    "timestamp" : "47:32-48:08"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:08-48:09",
    "text" : "Right."
  },
  {
    "timestamp" : "48:09-48:19",
    "text" : "But after the after the l after he had us on the team for a while, they decided he wasn't worth that money. Comes back to the Patriots. That's where they the that was the advantages. And um",
    "speaker" : "Miguel Benzan"
  },
  {
    "timestamp" : "48:20-48:21",
    "speaker" : "Andy",
    "text" : "Yeah, I'm bringing it up."
  },
  {
    "text" : "They have a value system and they stick with it.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "48:21-48:24"
  },
  {
    "text" : "I feel like that's like a rare thing in the NFL because it's such like a results-driven league that it's hard to stick to a value system, especially if it's like one that isn't splashy and doesn't like wow the fan base because if you only have a limited time for that to like work out in your favor before fans are like get this guy the hell out of here you know",
    "timestamp" : "48:25-48:47",
    "speaker" : "Greg"
  },
  {
    "text" : "I mean, but th that happens when you win.",
    "timestamp" : "48:48-48:50",
    "speaker" : "Miguel Benzan"
  },
  {
    "timestamp" : "48:50-48:52",
    "speaker" : "Greg",
    "text" : "Yes, exactly. Yeah. True, yeah."
  },
  {
    "text" : "He went ten years without winning the Super Bowl, but he still made the playoffs every year. He's still in contention every year. Right? His worst what was his worst team from two thousand fourteen to two thousand 2004 to 2014, maybe to 2009, 2010. And he still was in contention.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "48:57-49:15"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "49:15-49:15",
    "speaker" : "Andy"
  },
  {
    "text" : "He still made the playoffs. It was like there are teams who don't who who have to miss the playoffs. Be a be a a two and fourteen, three and fift three and now three and fourteen team now with seventeen games. Um to reset the experience So you know this last year was their reset.",
    "timestamp" : "49:15-49:35",
    "speaker" : "Miguel Benzan"
  },
  {
    "text" : "It was the first losing record they've had since 2000.",
    "timestamp" : "49:36-49:40",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "49:41-49:49",
    "text" : "And and and basically I you know you could say it was the co and Yes, they lost the greatest player in in the football in the in the history of the foot NFL."
  },
  {
    "text" : "Right.",
    "timestamp" : "49:49-49:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "49:49-49:55",
    "text" : "But they also had eight eight opt-outs, more than anybody else's team. More than any team in the in the league."
  },
  {
    "speaker" : "Andy",
    "text" : "And they lost a bunch of guys too in the offseason.",
    "timestamp" : "49:55-49:57"
  },
  {
    "text" : "Yeah, and and they had th this team is for for sometimes i is not a doesn't stay healthy. So they had like fifteen guys Well they had a a bunch of players going aye. If they could stay healthy, like in d you know, if they stay healthy this year, would they would there improvements on the on the team and I think an easier schedule. You know, I I've I've said like before, I I I'm an optimist. I can't they could go from seven seven to nine to twelve and five if they catch Couple of breaks.",
    "timestamp" : "49:58-50:31",
    "speaker" : "Miguel Benzan"
  },
  {
    "text" : "Absolutely. And actually we actually saw that in the 2003 season where the Patriots led the league in uh the number of starters with 40 something and they showed a list like in one of the games we're watching they showed a list of all the other teams that led the the league in injuries And I think the best record was like six and ten. And the Patriots went on to win the Super Bowl that year.",
    "speaker" : "Andy",
    "timestamp" : "50:31-50:55"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "So But it it For me, I do I think the Patriots it cracks me up when people say that Bill Belichick's a bad GM, right? Because well, okay, okay. Oh, he didn't draft well. Okay, so you literally so you could you could throw throw out the players he didn't draft he didn't di he missed on. All right. Go back and do a comparison from each player, each team, and then tell me that he's really either there's either There are p people who either draft well or no one drafts well. Or is it everybody is this an average? And it just ends evens out. You tell me which one you believe in. And then y if you believe that the people can draft well, then h who are the people who have drafted well who are better than Bill Beljak? All right. But if you believe it's average I mean, he's got a value system. He's always the Patriots have typically, except for last year, have oh usually always end the c end of the year with very little cap space compared to the rest of the league.",
    "timestamp" : "50:55-52:08"
  },
  {
    "timestamp" : "52:08-52:08",
    "speaker" : "Greg",
    "text" : "Mm-hmm."
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "52:09-53:01",
    "text" : "All right. It is what I I it cracks me up. I don't know what to say though, people. You think be Bill Balzuk's a bad GM God bless you. I mean I just I I I I literally stopped talking to people who said who who have Twitter I said I uh who say the cap is crap, blah blah blah, it doesn't mean anything. I'm like literally This year, the two sides who know the salary cap the best agreed to prop it up this year. All right. Just because the salary cap is soft doesn't mean it's meaningless. Right. I mean And if you're gonna tell me the ca the cap is crap or soft and blah blah blah, it's meaningless, it's not real, I just not engage in you anymore because you're You have fallen, you listen to that sports station and you fall into that you stopped thinking and critical thinking on your own. Yep."
  },
  {
    "text" : "You listen to that, Greg? Stop harassing them.",
    "timestamp" : "53:01-53:03",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "53:08-53:10",
    "text" : "So like my friend Russia."
  },
  {
    "timestamp" : "53:16-53:29",
    "text" : "I yeah, I don't it it's the worst. It is. It's it's they're just being antagonistic to get people to call it the exact opposite of what you talked about earlier, where you don't do it for clicks, you don't do it for headlines, you just do it for the numbers.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "They are the opposite other end of that continuum.",
    "timestamp" : "53:29-53:32"
  },
  {
    "timestamp" : "53:33-53:42",
    "speaker" : "Andy",
    "text" : "And there's no accountability for whether they're right or wrong. They just throw shit at the wall and see if things will stick so they can talk about them. It just pissed people off. Yeah."
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "53:42-53:52",
    "text" : "You know, so like um what's they saying? Like what they said, oh I g I can figure out the cap on a on a napkin. Literally so like So this is Felga."
  },
  {
    "speaker" : "Greg",
    "text" : "That is that is insulting.",
    "timestamp" : "53:54-53:55"
  },
  {
    "text" : "Well some people could I don't think Felger could literally I'm like literally Felga, I'm like Lily, you were covering the Patriots when I started saying I thought I could do better than you. He's one of the guys whose beat runners. I said I could I think I could do this better than you.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "54:01-54:15"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "54:16-54:23",
    "text" : "Surprise, surprise, you have. But I mean they get paid a lot of money to do it, so they're obviously something."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "54:26-54:43",
    "text" : "Yeah, but he doesn't have his morals at the end of the day, Andy. Yeah, yeah. And he's up to all the money in the world But Miguel can come on here and say he doesn't do the job for the cliques and he's not lying to us and never say that. So I rate Miguel higher than Felgar and Maz any day of the week."
  },
  {
    "text" : "Yeah, I I I I ain't lying. And like when I'm wrong, I'll say I'm wrong. You know what I'm saying? Like these guys don't go back and say, yeah, the Patriots won six six six six Super Bowls. I was wrong about them.",
    "timestamp" : "54:43-54:54",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "54:55-55:03",
    "text" : "The only one that it's ever held to that standard is Skip Bayliss's like cliff comment where he the his problem is he made the little motion with his fingers. You know?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "55:03-55:10",
    "text" : "And people screenshot it that and keep bringing it back up and there's still a bunch of like this there's a cottage industry about hating the Patriots."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "55:10-55:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "55:11-55:13",
    "text" : "What was the other guy that did the cliff? Um"
  },
  {
    "timestamp" : "55:14-55:31",
    "text" : "Yeah, but I mean that kind of like that's sports. Like I understand fans that hate the Patriots, like yeah, but like commentators that I feel like are being intentionally disingenuous to drive clicks and like Make money off people getting angry. That kind of like frustrates me.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "55:31-56:08",
    "speaker" : "Miguel Benzan",
    "text" : "It's it's condescending. It's insulting. It's demeaning. Yeah. It is uh it's it's just not who I want to be. Yeah, I like like so like literally one reason I I used one reason I stopped writing for website is I just want to go back to being uh considered a fan. I no longer wanted to be considered a part of the media because they just got Vic I just said some of those guys just I don't want to be considered like that, be part of that group."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "56:08-56:09"
  },
  {
    "timestamp" : "56:09-56:39",
    "speaker" : "Miguel Benzan",
    "text" : "So like I literally So when I my mother in law had hot uh had c had um had heart surgery, I had to take care you know, I basically had to take care of her. So I stopped writing. And then um I'm thinking I guess I gotta go back to start writing. Do I really want to be a journalist? Let me just go back to being a fan. And I said that's I'm just happier that way. It's like literally some of those guys Nah, I I don't want to be with them."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "56:39-56:40",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "56:40-56:45",
    "speaker" : "Miguel Benzan",
    "text" : "I know fans are some f I'd rather be associated with the fans because there's much more of us."
  },
  {
    "text" : "Oh yeah.",
    "timestamp" : "56:45-56:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "56:46-56:53",
    "text" : "So people gonna don't expect us to be We're fans. We're f the f which is short the fanatic. We're not supposed to be normal."
  },
  {
    "timestamp" : "56:55-57:05",
    "speaker" : "Andy",
    "text" : "I've been saying that forever because I keep getting shit on for For putting on the rose colored glasses and saying belly checking you know I'm checking you dude, I'm checking you to make sure you know we're crazy."
  },
  {
    "text" : "We're fans, we're fanatics. Yeah, exactly. So but you're in an industry where you have standards. Well at least I think you should have standards.",
    "timestamp" : "57:05-57:14",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Steve",
    "text" : "I gotta disagree, Miguel, because technically I think we are both fanatics and journalists because we're doing a podcast which technically is journalism. Fair enough, fair enough.",
    "timestamp" : "57:15-57:25"
  },
  {
    "timestamp" : "57:25-57:25",
    "text" : "Fair enough.",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Steve",
    "text" : "No standards or morals either.",
    "timestamp" : "57:26-57:28"
  },
  {
    "timestamp" : "57:31-57:39",
    "text" : "Are you in a journalistic group? No. Okay. Well we all. Could you get a media credential at the for the Patriots game?",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:39-57:50",
    "text" : "Oh well, I was actually gonna ask you that, could we? I can't What do you think the uh the odds are if we have to do that? Can you uh can you let us into this thing?"
  },
  {
    "text" : "I got some questions asked Bill. No, no, no. They they the pages will well the pages know who I am, the chances of me getting a media credential The way I uh the way how loud I am and my inability to keep my fandom That's the best part.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "57:50-58:07"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. I mean we've had that conversation as well, like behind the scenes about this podcast of like, where do we draw the line of we do it because we think it's fun and we get to like hang out as brothers. But there's certainly a line where it's like where it becomes a job as opposed to us just meeting up once a week and shooting the shit. Yeah.",
    "timestamp" : "58:07-58:30"
  },
  {
    "timestamp" : "58:33-58:33",
    "text" : "Yeah, yeah.",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "58:33-58:38",
    "text" : "I'm gonna do the fun thing and like take it for what it is."
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Yeah. Oh yeah. If if if you t so that you know that phrase if you love something you you're doing it's not really your work. You know what I'm saying? That's what I'm like I love doing this. I um the fact that I'm a fan and that I'm better at this than the some in the media who look like look the look down on fans gives me So much pride. Because I literally like that but that part they can never say None of none of the sports none no one in the Boston sports media can say that the the fans know they know more than the f than the the fans and about the salary gap. Because I'm around.",
    "timestamp" : "58:38-59:15"
  },
  {
    "text" : "Yeah. Damn right. It's true. It is true. It's a hundred percent true. And the forty something thousand followers that you have have your back.",
    "timestamp" : "59:15-59:23",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "59:23-59:25",
    "speaker" : "Miguel Benzan",
    "text" : "Forty five, keep it right. Keep it real."
  },
  {
    "speaker" : "Andy",
    "text" : "Talking to the numbers guy. I should have known that. Yeah, right. He's gonna be forty-five point one bringing ballpark numbers",
    "timestamp" : "59:26-59:33"
  },
  {
    "text" : "How many fans do we have on Twitter?",
    "speaker" : "Steve",
    "timestamp" : "59:34-59:36"
  },
  {
    "text" : "Uh we don't have that many. We have 171 followers.",
    "speaker" : "Andy",
    "timestamp" : "59:36-59:41"
  },
  {
    "timestamp" : "59:41-59:48",
    "speaker" : "Steve",
    "text" : "Yeah, yeah. We're getting that. Miguel read us or whatever it is."
  },
  {
    "text" : "I'm sure that's how it works, yeah. Actually, I was gonna do this.",
    "speaker" : "Andy",
    "timestamp" : "59:50-59:54"
  },
  {
    "text" : "You should have Ed Bryant. I'll say this. Like you guys are going over old games. You should have this guy named Ed Bryant.",
    "timestamp" : "59:54-01:00:00",
    "speaker" : "Miguel Benzan"
  },
  {
    "timestamp" : "01:00:00-01:00:00",
    "speaker" : "Andy",
    "text" : "Ed Bryant."
  },
  {
    "timestamp" : "01:00:01-01:00:19",
    "text" : "Who's on on your show because he is He sends out he sends out to a mailing list a a song of the week. So he and he goes and he brings up references to old games. So he should be on on one of you guys. I should tell him I should tax. I should t I shouldn't say that because I should text him first.",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:20-01:00:35",
    "text" : "Yeah, no, we're we're we love having people on the city. And he can cut it out for you apparently sometimes. No no no don't don't cut it out. Don't cut it out. I say I'm gonna cut out a lot of things. Sometimes Greg asked him to cut stuff out and he doesn't anyways. Leave it in. It's a crapshoot."
  },
  {
    "timestamp" : "01:00:36-01:00:41",
    "speaker" : "Miguel Benzan",
    "text" : "He's a he's a really nice guy, but he know he knows his b PJ's games like there's no tomorrow."
  },
  {
    "timestamp" : "01:00:41-01:00:54",
    "speaker" : "Andy",
    "text" : "Yeah, we've had a we've had a few people and we've had um Brian Mori from the uh Page Hall of Fame on. Yes. And he's he can give us a run for our money too. He just remembers a shit like off the top of his head that we have to like rewatch the games to remember."
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Damn. Like he's I I I remember So like when I go to training camp practices, right, I yell out the names of of the people I know, the sports media name. And I yelled out one time. Brian Morey. And he didn't know. He was like, how does people know who I am? You could just look, he's looking around, I'm like, all right. Like he did not expect to see that. Like so there's a running gap. Like I used I l I love doing that like like just yell out the pi the like the person's name. Like I'll like hey this Bob Sosy the voice of the Patriots",
    "timestamp" : "01:00:54-01:01:30"
  },
  {
    "timestamp" : "01:01:33-01:01:37",
    "speaker" : "Andy",
    "text" : "Oh I mean that sounds a lot like uh Greg at a football game. Greg has some."
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Oh I oh yeah, I'm a yellow.",
    "timestamp" : "01:01:38-01:01:39"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm a bringing yellow Greg ever had at a game was when we went to the Redskins in This is post-RG3, he had left town at this point, and he goes, Robert Griffin the third, string quarterback.",
    "timestamp" : "01:01:40-01:01:52"
  },
  {
    "timestamp" : "01:01:56-01:02:04",
    "speaker" : "Andy",
    "text" : "I I still remember when uh The three of us went to a Lowell Spinners baseball game with dad, and Greg was heckling so bad."
  },
  {
    "timestamp" : "01:02:05-01:02:07",
    "speaker" : "Miguel Benzan",
    "text" : "Heckling with somebody in minor league?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:02:07-01:02:22",
    "text" : "Oh, he was in there. It was literally everybody. It was mostly the umpires. But then he turned on the mascot. He turned on the mascot after a while. And dad literally left us to find our way home from LOL. Because he couldn't be at the game with us. Sonny Marcus Greg was so bad."
  },
  {
    "speaker" : "Greg",
    "text" : "Did you? Yeah. Oh my gosh. That was a group effort though. There was like four of us.",
    "timestamp" : "01:02:25-01:02:30"
  },
  {
    "timestamp" : "01:02:31-01:02:41",
    "speaker" : "Miguel Benzan",
    "text" : "Oh my gosh. Oh my gosh. So I was like I w have I ever heckled. I don't I would I would I would heckle a an umpire. I wouldn't heckle a player."
  },
  {
    "text" : "Buffalo's the best because they're they're not like Philly, they're like angry fans, but Buffalo, they're like They pretend to be angry, you know? Yeah. So they'll trip you back and they'll give it to you as much as you give it to them. But at the end of the day, they're usually like 95% are just like good people.",
    "timestamp" : "01:02:41-01:03:00",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "01:03:00-01:03:04",
    "text" : "Yeah. So most of the Bill fans who f follow me on Twitter are good people."
  },
  {
    "timestamp" : "01:03:04-01:03:08",
    "speaker" : "Steve",
    "text" : "Yeah. I feel like Patriots fans are like that that especially the ones that live maybe in New England."
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "01:03:08-01:03:39",
    "text" : "Outside of it, it's a little different, but most people most people are good people. I just I just Like you said before, I get a lot of I get a lot of r qu questions. I don't answer everyone. And folks I be and if you have like two or three followers and I probably am not gonna answer your tweet to e Be a meal. And like literally, I don't know especially one that's like that that it seems like you want me to say something that's controversial. Oh yeah, yeah. You know, it's like Yeah, baiting me, I'm like, uh I uh I'm like you're not gonna use me to get more followers."
  },
  {
    "text" : "Yeah. You gotta have at least a hundred and seventy one.",
    "timestamp" : "01:03:39-01:03:41",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Wait, but you only replied to Andy who has a hundred and seventy as a that's more than that's more than two.",
    "timestamp" : "01:03:41-01:03:49"
  },
  {
    "text" : "That's more than two.",
    "timestamp" : "01:03:49-01:03:50",
    "speaker" : "Miguel Benzan"
  },
  {
    "text" : "That's more than two.",
    "timestamp" : "01:03:51-01:03:51",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Like listen, some people have got two for have been on Twitter for since 2009 and have two followers.",
    "timestamp" : "01:03:52-01:03:57"
  },
  {
    "text" : "That's me. I probably I think I have a Twitter account there. I don't know what it is or whatever, but it may exist and I probably have two followers.",
    "speaker" : "Steve",
    "timestamp" : "01:03:57-01:04:03"
  },
  {
    "timestamp" : "01:04:03-01:04:04",
    "text" : "Okay, okay.",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Steve",
    "text" : "Okay. But I'm also not tweeting at you because I couldn't even get into it if I wanted to. It's like my college idea or some shit like that.",
    "timestamp" : "01:04:04-01:04:13"
  },
  {
    "timestamp" : "01:04:14-01:04:15",
    "text" : "Oh god, yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Um yeah, it's a bit crazy how long it's That like Twitter is like crazy because I was I want to ask you. I'd have followers all over the all over the world now.",
    "timestamp" : "01:04:16-01:04:25"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:04:26-01:04:26",
    "text" : "Yeah."
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "What is your like on a German show in July?",
    "timestamp" : "01:04:26-01:04:29"
  },
  {
    "text" : "What's your general thoughts on like the Twitter environment? Because like every time I'm not a Twitter guy either, so every time I go on there, I'm like, whoa, this is just a whole lot of angry people yelling at each other.",
    "speaker" : "Greg",
    "timestamp" : "01:04:30-01:04:40"
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "01:04:42-01:04:44",
    "text" : "Angry anonymous people."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:04:44-01:04:44"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Um, when social media came out, sorry. Yeah. When social media came out, I just used my name, first name, Miguel. I didn't think of like using hiding behind a a moniker or anything like that. I just hey my name's Miguel. Um lot of angry people out there. It's easy to be A keyboard warrior. Say stuff you would probably uh on a keyboard you wouldn't probably say to someone to their face.",
    "timestamp" : "01:04:44-01:05:16"
  },
  {
    "text" : "Oh yeah, it's on Twitter.",
    "timestamp" : "01:05:16-01:05:17",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Um It is you know what I'm saying? So if you're willing to in it is what it is. I'm like literally some like I'll I'll never forget the guy, some guy blocked me on Twitter. Right? Because I corrected him. And then he after he blocks me then calls me insecure. I'm like, what? I'm like what I I'm like what Okay, uh you blocked me on Twitter because I corrected you about a number, all right? And then you calling me insecure. And it didn't tag me. Somebody else showed me the twit. I'm like, really? Like like like You can't do it. Hey.",
    "timestamp" : "01:05:18-01:06:02"
  },
  {
    "timestamp" : "01:06:06-01:06:07",
    "speaker" : "Andy",
    "text" : "You would think."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:06:07-01:06:08",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Andy",
    "text" : "Or you would just keep your mouth shut the whole thing. Yeah.",
    "timestamp" : "01:06:08-01:06:10"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Yeah. Like literally I've told my like I you know I told one of my friends like one time he was gonna drive he was gonna drive drunk. I said you get in that car I'm gonna punch you in the face. So it's like So we had like we you know, y you had that argument with you have that thing with you know that that five minute arguments thing discussion don't get in the car, don't in the car, and then the guy that says no. If you g you get you take another step to that car with a punch in the face. That was and he knew I was real.",
    "timestamp" : "01:06:10-01:06:43"
  },
  {
    "timestamp" : "01:06:43-01:06:44",
    "speaker" : "Andy",
    "text" : "Yeah"
  },
  {
    "text" : "Yeah, so it's like don't like we can't have that, that you'd leave here drunk and kill someone. Yeah. I know you didn't I uh it's obviously he didn't care, but I said like I can't have that happen on my conscience. I'd rather punch him in the face and have some him kill someone.",
    "timestamp" : "01:06:44-01:07:01",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:07:01-01:07:03",
    "text" : "Send him home in an ambulance at least he gets home."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I had a I had a thought, Andy.",
    "timestamp" : "01:07:03-01:07:05"
  },
  {
    "timestamp" : "01:07:05-01:07:08",
    "speaker" : "Andy",
    "text" : "Uh-oh. Uh-oh. Uh nothing good starts."
  },
  {
    "text" : "Fantasy because you saw that the news thing about a fantasy football punishment that said at Waffle House or something.",
    "speaker" : "Steve",
    "timestamp" : "01:07:08-01:07:13"
  },
  {
    "text" : "Yes.",
    "timestamp" : "01:07:13-01:07:13",
    "speaker" : "Andy"
  },
  {
    "text" : "You know be a great fantasy football punishment for someone who's like a Bills fan that lost is to listen to all of the Bills. episodes of this podcast. And how we are? Reviewing Bills games and the Bills always lose.",
    "speaker" : "Steve",
    "timestamp" : "01:07:14-01:07:31"
  },
  {
    "timestamp" : "01:07:31-01:07:48",
    "speaker" : "Andy",
    "text" : "Always. Always lose Tom Brady. It I think is he's in the top ten list. I think he's like five or six of most amount of quarterback wins in Buffalo Yes. Yeah, yeah, yeah. It's crazy. Uh what's it um Josh Allen just passed him this year."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "01:07:48-01:07:48"
  },
  {
    "text" : "I sent out I sent out a congratulation.",
    "timestamp" : "01:07:48-01:07:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "I was dead wrong about Josh Allen. I didn't think that he would be this good.",
    "timestamp" : "01:07:51-01:07:54"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:07:58-01:08:03",
    "text" : "I'm expecting aggression. See, I put a hot take out there and I stand behind it no matter how wrong it might look."
  },
  {
    "timestamp" : "01:08:03-01:08:17",
    "text" : "Before last year started, Steve said Josh Allen And Ryan Tannehill were gonna like seriously regress. So every week I brought it up to him like that's another another 400 yards for Allen.",
    "speaker" : "Greg"
  },
  {
    "text" : "Did you pick Josh Allen in fantasy football? No, I j I just thought you'd be like, Oh no, no. So you didn't like you you stayed you stayed true to yourself.",
    "timestamp" : "01:08:19-01:08:28",
    "speaker" : "Miguel Benzan"
  },
  {
    "text" : "Oh I'm I'm doubling down next year.",
    "timestamp" : "01:08:29-01:08:30",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "01:08:31-01:08:33",
    "text" : "So you're not picking Josh Allen this year."
  },
  {
    "timestamp" : "01:08:33-01:08:37",
    "speaker" : "Steve",
    "text" : "No, no way. I think both of them regress. They're not good. I'm I stand on that."
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "01:08:38-01:08:40",
    "text" : "Can I play fantasy football with you?"
  },
  {
    "timestamp" : "01:08:43-01:08:46",
    "speaker" : "Andy",
    "text" : "Like taking money from a baby. Very very stupid baby."
  },
  {
    "text" : "Why do you think he's gonna regress? I'm drafting Cam Newton again, let's go. Why do you think he's gonna regress? Who Josh Allen? Yeah. Oh, I'm just when I make a hot take, I stand behind it.",
    "timestamp" : "01:08:48-01:08:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "You stand behind it, so you don't admit you're wrong. No.",
    "timestamp" : "01:09:00-01:09:03"
  },
  {
    "timestamp" : "01:09:03-01:09:04",
    "speaker" : "Andy",
    "text" : "No, that's not his style."
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Good luck with you.",
    "timestamp" : "01:09:04-01:09:05"
  },
  {
    "text" : "It's not good luck with me. It's good luck with Greg and Andy. Those the two that put up with this dude. Are you kidding me? I love it. Did you ever say you're wrong? Uh no my hot takes? Definitely not. Definitely not. Hot takes a lot of other things in life, sure. Other things in life. Oh, thank God. Are you sure? Not to me you don't. Well yeah, not things you guys say right here. Okay.",
    "speaker" : "Steve",
    "timestamp" : "01:09:08-01:09:32"
  },
  {
    "timestamp" : "01:09:32-01:09:41",
    "speaker" : "Miguel Benzan",
    "text" : "Oh boy. My guys, because you have to say you're wrong. You have to be able to view see yourself as wrong. We're not perfect."
  },
  {
    "timestamp" : "01:09:41-01:09:45",
    "speaker" : "Andy",
    "text" : "This is true. Nobody's perfect. Unless we're talking about Tom Brady, of course. Tom Brady's per or Troy Brown. He's perfect."
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Or yeah, Troy Brown. There you go. There you go.",
    "timestamp" : "01:09:45-01:09:48"
  },
  {
    "timestamp" : "01:09:48-01:09:51",
    "speaker" : "Andy",
    "text" : "Minus the two fumbles and the snowball, but we don't talk about that."
  },
  {
    "timestamp" : "01:09:51-01:09:51",
    "speaker" : "Miguel Benzan",
    "text" : "We don't."
  },
  {
    "speaker" : "Andy",
    "text" : "It didn't matter.",
    "timestamp" : "01:09:52-01:09:52"
  },
  {
    "timestamp" : "01:09:53-01:09:54",
    "text" : "I don't remember those who are talking about.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:09:54-01:09:57",
    "speaker" : "Andy",
    "text" : "Yeah, Larry Uzzo on on the punt returns. He fumbled two of them. Larry Uzo recovered them both."
  },
  {
    "timestamp" : "01:09:58-01:09:59",
    "text" : "Larry what are you talking about?",
    "speaker" : "Steve"
  },
  {
    "text" : "So yeah Steve Larry is a was he's a original special teams guy. And that cracks me up because the other thing about the Patriots, people like, oh my gosh. The Patriots have so many people and players on special teams. So I went and looked and looked it up. I never wrote an article about this. Like every team has players who just need special teams.",
    "timestamp" : "01:10:00-01:10:19",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "01:10:19-01:10:20"
  },
  {
    "timestamp" : "01:10:21-01:10:29",
    "speaker" : "Miguel Benzan",
    "text" : "But people just think just they they don't take the time what for whatever reason they are full because the patriots uh maybe because the patriots they don't focus and look at that."
  },
  {
    "text" : "Because the Patriots pay those players more? That's gonna say than other teams will",
    "speaker" : "Steve",
    "timestamp" : "01:10:30-01:10:34"
  },
  {
    "text" : "The difference is practically immaterial to the cap. Yeah, yeah. When you're talking about two hundred million dollar cap, you're paying someone one million dollars more. It's kind of immaterial. I mean you get I guess they're paying the three or four players more money, right? But in the end of the day",
    "speaker" : "Miguel Benzan",
    "timestamp" : "01:10:40-01:10:55"
  },
  {
    "text" : "Sorry. We've always kind of been told, well, or maybe I've just garnered this from reading stuff, but it feels like Uh some teams will focus on paying their like big name guys the big money and then surrounding them with lower paid people, whereas opposite just kind of try to have uh a higher paid middle class with no like huge salaries. That's true.",
    "timestamp" : "01:10:59-01:11:28",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:11:33-01:11:56",
    "speaker" : "Miguel Benzan",
    "text" : "Starting in 2001, 2000, right? When uh the Patriots from every year I've been I've been tracking it. They always had the most players with a $1 million salary cap hit. Alright? And this is back in the day. So like the 2000-2001. That's still been true till this day. Alright? Except for this now. So one thing the Bills did They c they copied the Patriots."
  },
  {
    "timestamp" : "01:11:56-01:11:58",
    "speaker" : "Steve",
    "text" : "I was gonna ask. Is anyone else doing that?"
  },
  {
    "timestamp" : "01:11:58-01:12:51",
    "speaker" : "Miguel Benzan",
    "text" : "Yeah, yeah. So so they so they started doing that. Now, you know, same so they cut so the Bills started doing that. Okay. You know, so they finally learned that teams like, hey I maybe should do what the Patriots are doing. I could not believe it took some a team a team to learn. Let's try the try the strategy with the Patriots doing and building a depth. Like right now they have Let's say they have forty-eight players. I'm gonna say either th forty-seven or forty-eight players over with a million dollar cap hit, right? I am willing to bet that's probably in the top three on the NFL right now. All right. I d it's in the mid the people of the we haven't finished doing the rookie signing deal, so that's a So my numbers could probably be off. But that's gotta be in the top three, I'm willing to bet that. That's something they've been doing the entire time of of the of the Bill Belichick era. That's something I think that is a cap Cap thing."
  },
  {
    "timestamp" : "01:12:52-01:12:52",
    "speaker" : "Mom",
    "text" : "Yeah. All right."
  },
  {
    "timestamp" : "01:12:53-01:12:58",
    "speaker" : "Miguel Benzan",
    "text" : "Strategy. That's and but the Patriots don't with the Bill Belichick, the GM doesn't get credit for that."
  },
  {
    "text" : "Right.",
    "speaker" : "Andy",
    "timestamp" : "01:12:58-01:12:58"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "All right? Because because when you're paying a Larry Isle, you're paying a a w a Larry Wiggum or a Justin Bethel or Matthew Slater, those are not big names. All right? But you s you sign uh a big name style like a Roosevelt Colvin or an Adelius Thomas. That gets the that gets the fan base uh up and oh yeah they signed a big name for you know like but those guys were just as much but just important to the Super Bowls as those Daily Thomas and Roosevelt Colvin.",
    "timestamp" : "01:12:58-01:13:30"
  },
  {
    "text" : "Do you hear that Greg? Now he's advocating for all three phases.",
    "timestamp" : "01:13:31-01:13:35",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Oh yes. I mean, that's the other thing. The the NFL has has done rules to make take away the Patriots' advantage. Really? Yes. Like for example, the Patriots used to play their Pactor Squad players more than the minimum. Now everyone has the same salary. You can't do that anymore. Okay? Take it to the kickoff rules.",
    "timestamp" : "01:13:35-01:13:58"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:13:59-01:13:59",
    "speaker" : "Andy"
  },
  {
    "text" : "Okay? Patriots used to pay have used to focus on the on all three teams. All right. The kickoffs are now less important. Okay. Who's that hurt who's that hurt the most? A team that uh the Patriots, that that kickoff rule benefited you. Alright. Um I'm trying to think of another cap ro thing that's related. Okay. Patriots used to use the c um has used to have option bonuses. All right. And used to qualify for complex. That took taken away. So Darrell Revis left. Yeah. So use it. When Darrell Revis left, the Peters got a comp pick for him, because they had an option for him. That's no there's no longer they can't do that anymore.",
    "speaker" : "Miguel Benzan",
    "timestamp" : "01:13:59-01:14:45"
  },
  {
    "speaker" : "Steve",
    "text" : "It was like a team option or a player option?",
    "timestamp" : "01:14:45-01:14:47"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "It was a team option. I mean we weren't the first ones to do I we might have been the first or we might have been definitely one of the first couple of teams to do it. All right. I'm not sure we were the first team to do it. I I I maybe the Ravens beat us to it. Yeah. All right. But we were definitely one of the teams that did do do it a lot of it. I think because the Patriots gotn' got a w did it with Revis, I'm not surprised they got rid of it. Yeah. You know what I'm saying? Yeah. Yeah. Because they made it they put it out there. Right. The better their chances of winning while the Patriots.",
    "timestamp" : "01:14:47-01:15:30"
  },
  {
    "timestamp" : "01:15:31-01:15:33",
    "speaker" : "Steve",
    "text" : "They're just closing loopholes too that the Patriots are finding."
  },
  {
    "text" : "So I was I was just looking through over the cap about the million dollar cap hit thing. And I was like, uh what which team should I look to compare?",
    "speaker" : "Greg",
    "timestamp" : "01:15:34-01:15:43"
  },
  {
    "timestamp" : "01:15:44-01:15:45",
    "speaker" : "Miguel Benzan",
    "text" : "Should be the Rams."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:15:45-01:15:54",
    "text" : "I picked the Jets. And there's like a 20 player difference between the bats and the Jets as far as like where that cutoff is."
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Yeah, it should go with the Rams because the Rams is so top heavy. I bet you they don't even ha yeah, the the Rams are so top heavy.",
    "timestamp" : "01:15:54-01:16:00"
  },
  {
    "speaker" : "Andy",
    "text" : "And they just trade away all their picks for yeah.",
    "timestamp" : "01:16:01-01:16:02"
  },
  {
    "text" : "I don't know how they they still have a first round pick because they feel like they just throw first round picks at every problem they have. Right, yeah.",
    "timestamp" : "01:16:05-01:16:11",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:16:11-01:16:23",
    "speaker" : "Miguel Benzan",
    "text" : "Yeah, really the same way. The NFL has m somehow managed to make the NFL draft a big thing while some teams are saying, I don't really care about draft picks."
  },
  {
    "speaker" : "Andy",
    "text" : "Right. Yeah.",
    "timestamp" : "01:16:23-01:16:24"
  },
  {
    "text" : "Yeah, which is amazing to me. We'll see we'll see how w I don't know if the Rams they have their shot. I don't know if they'll ever get back to a Super Bowl.",
    "timestamp" : "01:16:24-01:16:36",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, uh I'm with you on that one.",
    "timestamp" : "01:16:36-01:16:37"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "They're gonna regr regret that Jared Gough throw.",
    "timestamp" : "01:16:39-01:16:42"
  },
  {
    "text" : "Which Super Bowl did they li which one are you talking about?",
    "timestamp" : "01:16:46-01:16:48",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, which Super Bowl loss are you talking about to the Patriots?",
    "timestamp" : "01:16:49-01:16:52"
  },
  {
    "text" : "Well no, that's Mike Moss, the first one. He should have like I see he I I could not bel like I I read afterwards that they they were vi he was people telling him to run the ball, run the ball, run the ball. And he wouldn't do it.",
    "timestamp" : "01:16:52-01:17:04",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Andy",
    "text" : "That game shouldn't have even been that close. That holding it.",
    "timestamp" : "01:17:08-01:17:10"
  },
  {
    "timestamp" : "01:17:16-01:17:24",
    "text" : "And that's just ego. That's just ego. That Bill Belichick would not I mean I should I was I used to say Bill Belichick wouldn't do that and then Malcolm Butler was benched.",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it's true.",
    "timestamp" : "01:17:24-01:17:25"
  },
  {
    "timestamp" : "01:17:26-01:17:30",
    "speaker" : "Miguel Benzan",
    "text" : "Who knows? Who knows? Who knows? No one knows. Even Dante doesn't know."
  },
  {
    "text" : "How the hell do we not know? Yeah? Yeah, how has Malcolm not said anything? How is not said anything?",
    "timestamp" : "01:17:30-01:17:36",
    "speaker" : "Greg"
  },
  {
    "text" : "That is crazy.",
    "timestamp" : "01:17:38-01:17:39",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Eventually you'll find out. So when when when Belatrak retires, he comes on this podcast and tells us Exactly.",
    "timestamp" : "01:17:40-01:17:46"
  },
  {
    "timestamp" : "01:17:49-01:17:53",
    "speaker" : "Steve",
    "text" : "Miguel, just hit him up and let us let him tell him to come on. Yeah, yeah, yeah, yeah."
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "Yeah.",
    "timestamp" : "01:17:53-01:17:53"
  },
  {
    "timestamp" : "01:17:54-01:18:05",
    "text" : "Troy Brown. That's what he wants to do once he has finally retired. It's uh it's a rehash it all. All right, so we're at uh two thousand and six, week twelve. Remember this one, Bill",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:18:05-01:18:09",
    "speaker" : "Andy",
    "text" : "Yeah, it was it was a Thursday night gamers, the jets in the rain. Great times, right?"
  },
  {
    "timestamp" : "01:18:10-01:18:13",
    "text" : "Oh yeah, I'd end up driving home without a shirt on.",
    "speaker" : "Steve"
  },
  {
    "text" : "Bill, why would you do it on Fortune 2? But you don't believe in analytics.",
    "timestamp" : "01:18:15-01:18:19",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Steve",
    "text" : "We'll save that for Felder.",
    "timestamp" : "01:18:22-01:18:23"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "And I'm like, ah, the fourth and two things tells you that he is kinda into analytics. Oh yeah.",
    "timestamp" : "01:18:32-01:18:37"
  },
  {
    "speaker" : "Andy",
    "text" : "I just don't think he It's like an end all be all to him. I think they're just analytics and everything else.",
    "timestamp" : "01:18:37-01:18:43"
  },
  {
    "text" : "I think he also regarded Peyton Manning as a special player, similar to Tom Brady.",
    "speaker" : "Steve",
    "timestamp" : "01:18:44-01:18:48"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:18:48-01:18:48",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:18:49-01:18:50",
    "text" : "Especially in those years."
  },
  {
    "text" : "You can't just be like, here's the number. It says 52% of the chance time I should do this. Like, well, yeah, there's two percent variable with other factors that aren't included in your algorithm, you dummy.",
    "speaker" : "Greg",
    "timestamp" : "01:18:55-01:19:06"
  },
  {
    "timestamp" : "01:19:06-01:19:09",
    "text" : "And everyone needs to talk about the we'll take the wind overtime game.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:19:09-01:19:10",
    "text" : "That was stupid."
  },
  {
    "text" : "That was dumb.",
    "timestamp" : "01:19:10-01:19:11",
    "speaker" : "Steve"
  },
  {
    "text" : "It worked out. That was the dumbest shit I ever seen, dude. The wind was a huge factor shit he's ever seen.",
    "speaker" : "Greg",
    "timestamp" : "01:19:14-01:19:19"
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "01:19:19-01:19:23",
    "text" : "And you've not lost the Jets play. Dude, I was at that game."
  },
  {
    "speaker" : "Greg",
    "text" : "I was at that game and they announced the Patriots have won the toss and then we were We were kicking and then never told us why. Everybody in the fans stands like what the hell is going on?",
    "timestamp" : "01:19:23-01:19:33"
  },
  {
    "timestamp" : "01:19:33-01:19:36",
    "speaker" : "Steve",
    "text" : "That's also the game you saw a bunch of people leave, right?"
  },
  {
    "text" : "Oh yeah. Oh yeah. Freeze in that game",
    "speaker" : "Greg",
    "timestamp" : "01:19:36-01:19:39"
  },
  {
    "timestamp" : "01:19:39-01:19:41",
    "speaker" : "Steve",
    "text" : "Yeah, it was a rough one. It worked out, Greg."
  },
  {
    "timestamp" : "01:19:42-01:19:46",
    "text" : "It did, but I still think it was the wrong I still think that works out like ten times out of a hundred.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:19:46-01:19:51",
    "speaker" : "Steve",
    "text" : "Well the so the fourth and two was the right decision. Didn't work out. Maybe that was the wrong decision. It didn't work out."
  },
  {
    "speaker" : "Miguel Benzan",
    "timestamp" : "01:19:51-01:19:58",
    "text" : "It's like when you're going all in. Yeah. Or the pair of aces and you get sucked out on. You know what I'm saying? Yeah. Yeah. That's fair."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:19:58-01:20:07",
    "text" : "They're called odds for a reason. I mean if there's a guarantee every time then it would be a good idea. They'd be called evens. Sorry."
  },
  {
    "speaker" : "Andy",
    "text" : "I agree. We got so much out of this. So we'll we'll touch on the Bills game Yeah, I I tend to talk a lot, so No, this has been amazing. Uh thank you so much for coming on. And actually, um Uh in honor of having you on, what I've decided to do is for every listen to this episode we get between this episode and the next one. Uh I'm gonna donate a dollar to your uh habitat.",
    "timestamp" : "01:20:16-01:20:39"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "I got forty-five thousand followers. You're gonna put up some money. Thank you. Yeah, yeah.",
    "timestamp" : "01:20:40-01:20:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Wait, you there are Jets podcast?",
    "timestamp" : "01:20:52-01:20:55"
  },
  {
    "speaker" : "Miguel Benzan",
    "text" : "There's a jet podcast Yeah, it's a guy he he d Like he the guy the host, he's a really nice guy. And he has a like you you guys got like the same kind of setups, like the the boom things, right? Yeah yeah but he didn't like my gosh He really didn't understand he didn't I had a he didn't really understand the cop at all. So I was like, oh my god. I was like, no wonder you asked me to go on the show. What's his name? Trags. Mike Trags. Like he's the b to me of all the beat writers who ever covered, who he knew the he understood the cap the best. He doesn't have the he didn't have the cap he doesn't have the access that Mike Ben Volan or Mike Reese has. But it's in terms of knowing the cap and how it works and and he I think he knew the cap the best. He I loved going on his podcast just because it was like, all right, I don't have to explain anything. He knew you know was that what the you know saying, but Yeah, you can get nerdy. I can got n I can get nerdy. I I try not to get nerdy on on these podcasts. Same. Yeah, but like so like literally when I I talk about that twenty five percent rule, I actually used a stupid number, the million dollar number. I should have used like in a when I tried not to be nerdy should have used the five hundred sixty thousand dollar number because that's much easier to divide by four.",
    "timestamp" : "01:20:55-01:22:20"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:22:23-01:22:24",
    "text" : "I love it."
  },
  {
    "timestamp" : "01:22:24-01:22:24",
    "speaker" : "Miguel Benzan",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:22:24-01:22:28",
    "speaker" : "Andy",
    "text" : "Uh well thank you very much Miguel for coming on. This has been fantastic."
  },
  {
    "timestamp" : "01:22:28-01:22:28",
    "text" : "All right.",
    "speaker" : "Miguel Benzan"
  },
  {
    "timestamp" : "01:22:29-01:22:30",
    "speaker" : "Andy",
    "text" : "I've learned a lot."
  },
  {
    "text" : "I'm pretty sure we all have. 13 season? Yes. You know what I'm saying? Because that's when the the new CBA. Hit me up again.",
    "timestamp" : "01:22:30-01:22:42",
    "speaker" : "Miguel Benzan"
  },
  {
    "timestamp" : "01:22:42-01:22:51",
    "speaker" : "Steve",
    "text" : "Okay, because then we'll do it before the season episodes, so you can say what happened in that last off-season in the cap. Oh anytime."
  },
  {
    "text" : "Anytime I'm on I love I I love I love being on podcasts just because I like talking about the salary cap.",
    "timestamp" : "01:22:51-01:22:56",
    "speaker" : "Miguel Benzan"
  },
  {
    "timestamp" : "01:22:57-01:22:58",
    "text" : "I love it.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:22:59-01:23:26",
    "text" : "But if you talk about the off season, I'll c I'll come on and I don't work for example Like I I don't work the free the when the the league year, the when the league year begins. So I can go on a podcast anytime. Beautiful. Um so the put the so the league year is gonna be March sixteenth. I forget what I don't even know what day of the year the the day of the week it is. So j let's we'll let's try it for then. Until you get to unless you get to 2013 before that. No.",
    "speaker" : "Miguel Benzan"
  },
  {
    "speaker" : "Steve",
    "text" : "No, don't get it. We we tried to do a game this week and we didn't even get it.",
    "timestamp" : "01:23:27-01:23:34"
  },
  {
    "timestamp" : "01:23:39-01:23:40",
    "speaker" : "Greg",
    "text" : "Take care guys. Bye-bye."
  },
  {
    "text" : "Take it easy, Miguel. Alright. Miguel Benzana, everybody. At Pat'sCap on Twitter. Give them a follow if you probably already do. If you listen to us, I'm guessing you already do. Um other th unless you're mom and you don't have Twitter or Steve.",
    "timestamp" : "01:23:41-01:23:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, mom, go follow him on Twitter.",
    "timestamp" : "01:23:55-01:23:57"
  },
  {
    "timestamp" : "01:23:57-01:24:01",
    "speaker" : "Andy",
    "text" : "Actually, no, just never mind. Yeah, yeah. No, no, we don't. Do you think he's on TikTok?"
  },
  {
    "text" : "We should ask him that.",
    "speaker" : "Greg",
    "timestamp" : "01:24:02-01:24:02"
  },
  {
    "timestamp" : "01:24:03-01:24:08",
    "text" : "Oh missed opportunity. We'll ask him next time he comes back in 2013. Yeah. Five years from now.",
    "speaker" : "Andy"
  },
  {
    "text" : "Five years of games, dude.",
    "timestamp" : "01:24:09-01:24:11",
    "speaker" : "Steve"
  },
  {
    "text" : "That's what I'm saying. Uh so all right.",
    "speaker" : "Andy",
    "timestamp" : "01:24:12-01:24:15"
  },
  {
    "speaker" : "Greg",
    "text" : "Um yes, catscap. com if you're not on Twitter",
    "timestamp" : "01:24:15-01:24:19"
  },
  {
    "speaker" : "Andy",
    "text" : "There is a patscat. com. I don't think it's uh necessarily updated. Uh I meant to ask him about that too. Uh maybe we'll ask about that on on Twitter and see what he says. There you go. But uh we will touch next week. On the Buffalo game that we were going to talk about today and got sidetracked.",
    "timestamp" : "01:24:19-01:24:39"
  },
  {
    "timestamp" : "01:24:39-01:24:44",
    "speaker" : "Greg",
    "text" : "Yeah, Tom Brady's still on this, so I'm guessing it's not up to date. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Good deduction there, Greg. Thanks for that fact check.",
    "timestamp" : "01:24:44-01:24:48"
  },
  {
    "text" : "Nailed it. But if you want to look at 2016, 2015, this might be kind of like a little bit of a little bit of a little bit of a good thing.",
    "speaker" : "Greg",
    "timestamp" : "01:24:48-01:24:54"
  },
  {
    "speaker" : "Steve",
    "text" : "So last updated September 22, 2017.",
    "timestamp" : "01:24:54-01:24:57"
  },
  {
    "text" : "Oh yeah. That's in the middle of the page, Steve, you know?",
    "speaker" : "Greg",
    "timestamp" : "01:24:57-01:25:01"
  },
  {
    "speaker" : "Andy",
    "text" : "All right. On that note, uh until next week, we will see you later. See you later.",
    "timestamp" : "01:25:04-01:25:10"
  }
]