[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Listen, go right ahead. I am not your mother.",
    "speaker" : "Mom",
    "timestamp" : "00:00-00:17"
  },
  {
    "timestamp" : "00:23-01:10",
    "text" : "Welcome back to the Patriots Dynasty Podcast, the only podcast where we're going back and re-watching every game of the Patriots Dynasty era. This week we're going to do something a little bit different because uh it's been a while and we need to get back into the game. And there's also been some uh stuff in the news about our Lord and Savior, William Belajek. So uh this week there's been uh I don't want to say some controversy, but some perhaps disagreements uh off of the air. So we thought we would do a bit of uh an episode where we kind of voice those disagreements in a courtroom setting. So we have with us the honorable Tim the intern presiding. Tim, how are you?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Tim",
    "text" : "Uh that is uh Judge Tim, but how are we doing?",
    "timestamp" : "01:11-01:14"
  },
  {
    "text" : "Judge Tim. Okay. Tim the judge instead of Tim the interim.",
    "speaker" : "Andy",
    "timestamp" : "01:15-01:19"
  },
  {
    "timestamp" : "01:19-01:22",
    "speaker" : "Tim",
    "text" : "Tim the interim judge. The interim judge."
  },
  {
    "speaker" : "Andy",
    "text" : "Good Lord, pick something.",
    "timestamp" : "01:23-01:24"
  },
  {
    "timestamp" : "01:25-01:28",
    "speaker" : "Greg",
    "text" : "Uh just call him Sir, Andy, okay?"
  },
  {
    "speaker" : "Andy",
    "text" : "I called him his honor.",
    "timestamp" : "01:29-01:29"
  },
  {
    "text" : "Goddamn respect in this courtroom.",
    "timestamp" : "01:30-01:31",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:31-01:46",
    "text" : "I c I I called him the honorable. That's what I started with. And also for the uh prosecution, we have uh the dishonorable Greg Brown. And probably eventually Steve, who knows?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:46-01:52",
    "text" : "Or one of those high paid LA lawyers that's coming in, you know. Oh yeah."
  },
  {
    "timestamp" : "01:52-01:55",
    "speaker" : "Andy",
    "text" : "Yeah, you look just like that. Ready to cause a ruckus."
  },
  {
    "timestamp" : "01:56-01:56",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "text" : "All right. You're slimy. You you're driving your two-seater sports car, the top down. That's right. Yeah, that's how you got here. All right. Awesome. So uh you are going to be presenting your case against Bill Belichick and what why Well you you lay it out. What's your what's your case here?",
    "timestamp" : "01:57-02:13",
    "speaker" : "Andy"
  },
  {
    "text" : "Well let's back up a steck, Pierre Can we acknowledge that the dynasty's over?",
    "speaker" : "Greg",
    "timestamp" : "02:14-02:18"
  },
  {
    "timestamp" : "02:18-02:20",
    "speaker" : "Andy",
    "text" : "I think we already did."
  },
  {
    "speaker" : "Greg",
    "text" : "Okay.",
    "timestamp" : "02:20-02:20"
  },
  {
    "timestamp" : "02:21-02:22",
    "text" : "Like when breaking.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Can we acknowledge the season's over? Because that's an infer an important first step here.",
    "timestamp" : "02:22-02:27"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh I don't think you you can acknowledge that.",
    "timestamp" : "02:28-02:30"
  },
  {
    "speaker" : "Greg",
    "text" : "It is current It's currently the 5th of October. Correct. We're going into week five. The Patriots are one and three. They just got their shit pushed in by the Cowboys. Yep. Mac Jones looks like not the answer. Probably won't get a second contract with this team. The offensive weapons are a mess. The defense looks good, but now there's no Christian Gonzalez, no Matthew Judon. God knows what that unit's going to look like after this. So it's probably a wrap on the year as far as making the playoffs, I would expect.",
    "timestamp" : "02:31-03:06"
  },
  {
    "timestamp" : "03:07-03:07",
    "speaker" : "Andy",
    "text" : "Awesome."
  },
  {
    "timestamp" : "03:07-03:09",
    "speaker" : "Greg",
    "text" : "Agreed? Yeah."
  },
  {
    "timestamp" : "03:10-03:17",
    "speaker" : "Andy",
    "text" : "I mean they did just sign JC Jackson, so yeah, that was sweet. Yeah. So who knows? They're just bringing it all back."
  },
  {
    "speaker" : "Greg",
    "text" : "Tim, thoughts? You think it's over?",
    "timestamp" : "03:17-03:19"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "03:20-03:26",
    "text" : "Um I think it's already been over, but as a judge, I have to be impartial right now. So"
  },
  {
    "timestamp" : "03:30-03:40",
    "text" : "All right. So 10-6, they're getting the wild card. You heard it here first. Okay. They're gonna jail. The offense is gonna figure it out once the offensive line gets healthy. I do want to know.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "03:41-03:47",
    "speaker" : "Tim",
    "text" : "I do want to know what uh so we already have three losses. What are those other three losses?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:48-03:53",
    "text" : "I don't know. I'm not looking at the schedule. Yeah. Uh probably the bills at least once, maybe twice."
  },
  {
    "text" : "You think we beat the Bills? Oh wait, you'd think we lose to the Bills twice?",
    "timestamp" : "03:54-03:57",
    "speaker" : "Tim"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Possibly.",
    "timestamp" : "03:58-03:59"
  },
  {
    "speaker" : "Tim",
    "text" : "It's not really good for the division.",
    "timestamp" : "04:00-04:02"
  },
  {
    "timestamp" : "04:02-04:06",
    "speaker" : "Andy",
    "text" : "That's all right. But it's a wild card, doesn't matter. All right."
  },
  {
    "text" : "So yeah, so I'm gonna I'm gonna formulate my my prosecution here on the fly because I was told that we're doing a courtroom thing. About ten minutes ago.",
    "timestamp" : "04:08-04:18",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, well that's where that's when we all decided this was happening.",
    "speaker" : "Andy",
    "timestamp" : "04:18-04:21"
  },
  {
    "speaker" : "Greg",
    "text" : "Well this looks a bit disjointed. The reason is",
    "timestamp" : "04:21-04:24"
  },
  {
    "text" : "So the this is to see uh we're gonna be deciding if Bill Pelichek is a fraud today. I'm gonna be the judge on that and Greg is gonna present his case. for Bill Belichick being a fraud and Andy is going to present will be the defendant for Bill Belichick as not a fraud.",
    "timestamp" : "04:25-04:42",
    "speaker" : "Tim"
  },
  {
    "speaker" : "Greg",
    "text" : "Correct. Okay, so my first my first point here, right? The first charge against Belichick is the obvious one. If you look at him without Tom Brady, it's bad. The numbers are bad. There's no way around it. He's a bad NFL coach without Tom Brady. You want to know where he stands? Behind some coaches that are ahead of him win percentage-wise, if you take out the Brady years. Let's see. Mike McCarthy, Brandon Staley, Kyle Shanahan, Ron Rivera. Belichick is 80 and 90. He's a below 500 coach without John Brady. I'm gonna take down some notes. I'm probably gonna need that.",
    "timestamp" : "04:43-05:26"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:26-07:07",
    "text" : "All right. So you want some rebuttal to that? Uh so uh what's his name? The um quarterback for the Ravens who won the Super Bowl. Arba. The quarterback for the Ravens who won the Super Bowl. Oh, yeah. Has a better um quarterback rating in the playoffs than Tom Brady. So therefore he's better because his numbers are better. Because we're taking out all context to those numbers, right? So but if you do the same with with Bell Belichick, you can you can uh take out all context to those numbers, then yeah, sure, absolutely. They look really bad. But he took an absolutely garbage Cleveland team, turned them around, made the playoffs, had their only playoff win since uh for like what almost 20 years until just recently. The the last uh Cleveland Browns coach to win a playoff game was Bill Belichick. And who did he beat? Bill Parcells and the Patriots in that playoff game. They went 11-5. The next year, um, the ownership promised him that they weren't moving the team out of uh Cleveland, and they did anyway, uh, which tanked the whole season, and then they said they were going to keep Bill Belichick. And they didn't. And so they fired him anyway, even though they told them I'm going to keep them. That team turned into the Ravens, who drafted Ray Lewis that next year, which was Belichick. decision or that's what he was going to do with the Browns was draft Ray Lewis with that team. Uh and then they went on to win another Super Bowl, right? Uh Belichick built that team, yeah."
  },
  {
    "text" : "And then you can just not look impressed.",
    "timestamp" : "07:08-07:10",
    "speaker" : "Greg"
  },
  {
    "text" : "And then he came to New England and did the same thing. Look at Pete Carroll's record when he took over for um for uh Bill uh Bill Barcells, right? He took a Super Bowl team and lost more games every year until Uh he was fired, left the team with an absolutely garbage roster, well, not a garbage roster, but an absolute garbage fire of a uh salary cap situation to the point where in 2000 Balichek took over they didn't have enough players to fill the they didn't have enough money to fill the entire roster. So they finished the season uh rostering less than 54 players because they couldn't afford it. So from there, Belichick turned that team around too. And was starting. And then, you know, the Brady thing obviously and all that happens. Or it actually happened quicker than he expected it to, but they were turning around anyway.",
    "timestamp" : "07:10-08:03",
    "speaker" : "Andy"
  },
  {
    "text" : "Sorry to interject here. Um point of contention, point of motion. Belichick turned that team around? Yes. Before Brady.",
    "timestamp" : "08:03-08:13",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes.",
    "timestamp" : "08:14-08:15"
  },
  {
    "timestamp" : "08:16-08:19",
    "text" : "Uh what was the record in two thousand?",
    "speaker" : "Tim"
  },
  {
    "speaker" : "Andy",
    "text" : "Five and eleven. How many players did they have rostered?",
    "timestamp" : "08:19-08:24"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "08:24-08:26",
    "text" : "I rest my case."
  },
  {
    "speaker" : "Andy",
    "text" : "So his first year with the team after taking over that entire thing, he uh still managed to and and I think they started off like Uh they they won like four the last five games too. So they had turned it around at the end of the season because they had to basically rip out Pete Carroll's awful uh Everything. They had to get rid of all the the guys who are coasting and they had to change the whole dynamic of like the locker room and all that stuff. Takes a season. In fact, Belchak's been on record to say it takes three seasons three years to uh kind of install your team. So he did it in two",
    "timestamp" : "08:27-09:06"
  },
  {
    "timestamp" : "09:07-09:13",
    "speaker" : "Tim",
    "text" : "And then I mean his logic that is good, but I mean And also, um, it's not like"
  },
  {
    "text" : "Brady was necessarily the reason in 2001 that they won all those games. Those are plenty of games where Belichick's decisions and Belichick's defense won those games. We we we watched them. We went through the whole thing. 2001 was uh oh 2001 to 2004 were mainly the defense. The defense was the driving force. We've said it before, it was the driving force of that. uh early dynasty. Yeah, Brady was good and he, you know, did Brady things, but he wasn't the Brady of like 2007 onwards, was he?",
    "timestamp" : "09:15-09:45",
    "speaker" : "Andy"
  },
  {
    "text" : "So how do you explain Tom Brady going to the Tampa Bay and winning a Super Bowl when he looked like he was cooked in New England?",
    "timestamp" : "09:45-09:53",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "09:56-10:08",
    "speaker" : "Andy",
    "text" : "The last year in New England was unfortunate because of the masses of injuries to the offensive line. You're starting Marshall Newhouse at left tackle. Were you pulled off of the street literally off of the street."
  },
  {
    "timestamp" : "10:08-10:12",
    "speaker" : "Greg",
    "text" : "You're the you're the GM, right? You gotta have to account for those types of things."
  },
  {
    "speaker" : "Andy",
    "text" : "You can only account for so much. I mean he did. He had played, but like the starters got injured and then the backups got injured. What are you gonna do? Like what else can you do?",
    "timestamp" : "10:12-10:20"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:20-10:22",
    "text" : "So what about since then?"
  },
  {
    "text" : "Since then he's rebuilding. He lost the best quarterback in the history of everybody. So all right look think about the the first year.",
    "speaker" : "Andy",
    "timestamp" : "10:23-10:30"
  },
  {
    "timestamp" : "10:30-10:32",
    "text" : "Is the rebuilding working?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "10:33-10:46",
    "text" : "I think it's still too early to tell because the first year was the COVID year. You you lost Brady like late, so you had to scramble to f to pick a new quarterback and it was Cam Newton.",
    "speaker" : "Andy"
  },
  {
    "text" : "Probably because of Belichick.",
    "speaker" : "Greg",
    "timestamp" : "10:46-10:48"
  },
  {
    "speaker" : "Andy",
    "text" : "Well no that's just conjecture. You got proof of that? This is this is a court of law, Greg. You can't just be throwing out willy-nilly things.",
    "timestamp" : "10:48-10:58"
  },
  {
    "text" : "All right, fine.",
    "timestamp" : "10:59-11:00",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "We need facts.",
    "timestamp" : "11:00-11:01"
  },
  {
    "text" : "All right, fine. I don't want to be an impartial judge. I want to be a bias.",
    "speaker" : "Tim",
    "timestamp" : "11:01-11:06"
  },
  {
    "text" : "Yeah, I know you fucking idiot. They didn't offer. First year they were actually doing well with Cam Newton, all things considered, until the Kansas City game where everybody got COVID and they still the NFL still made them play. Right. And then I think from there, Cam Newton got COVID, or maybe he was the one that got it originally. I don't remember. Um but whatever happened, he m Cam Newton missed a bunch of uh weeks and the way the pages offense is built is that you kind of build on the last week and you keep building week by week until you know as you would see with normal pages teams with Brady by the end of the year they're better than they were at the beginning. Like the first four weeks are always like extended preseason, right? That's the joke with the Patriots.",
    "speaker" : "Andy",
    "timestamp" : "11:07-11:52"
  },
  {
    "text" : "So So the so the previous Patriots teams, the dynasty teams with Brady, they didn't face any of these injury problems, these important players getting hurt or sick or whatever it is. So why so why didn't they fall apart like the Cam Newton year?",
    "speaker" : "Greg",
    "timestamp" : "11:52-12:07"
  },
  {
    "text" : "Uh because we didn't have COVID to deal with.",
    "timestamp" : "12:07-12:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "12:11-12:18",
    "speaker" : "Greg",
    "text" : "And the injuries, fine, let's call it injuries. Players that can't play, whether it's COVID or injuries or whatever."
  },
  {
    "text" : "But I I think the COVID thing is uh more on top of that. Like they they they had a uh they had to play a game where they didn't actually practice all week. Right against what's it, the not the Raiders.",
    "speaker" : "Andy",
    "timestamp" : "12:18-12:28"
  },
  {
    "text" : "Practice. We're talking about practice.",
    "timestamp" : "12:28-12:30",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:30-12:30",
    "text" : "Yeah."
  },
  {
    "text" : "Overruled.",
    "timestamp" : "12:31-12:32",
    "speaker" : "Greg"
  },
  {
    "text" : "What do you how does how does it even fit?",
    "timestamp" : "12:34-12:36",
    "speaker" : "Andy"
  },
  {
    "text" : "I'm throwing it out.",
    "timestamp" : "12:38-12:39",
    "speaker" : "Tim"
  },
  {
    "text" : "Yeah. I think the COVID year was just a garbage year, just generally, like for the whole NFL, not even just the Patriots. Um Brady got to handpick his team. Halfway through that season, they the Bucks scrapped whatever they were trying to do and just said, Brady, like run your own offense, right? Yeah. And so he did. So he was able to do whatever he was comfortable with with a team that wasn't rebuilding because the pages had gone all in the past few years, drafting, you know. Sonny Michels and Nikhil Harris at the top of the draft, which is not something they normally do, to kind of like take advantage of that last window of Tom Brady before he left or before he retired or whatever it was he was going to do. And so they had to pay the piper and Brady decided, looked at both teams and said, I have a better chance to go with Tampa Bay, because they have all the pieces except the quarterback, and the Patriots need to rebuild, and you didn't want to be here for the rebuild. That's how it looked from the outside.",
    "timestamp" : "12:39-13:32",
    "speaker" : "Andy"
  },
  {
    "text" : "To me, it looks to me outside as that he said, this team isn't giving me the weapons. I'm gonna go to a team that lets me get weapons and lets me play the way I know that works and wins Super Bowls. And then he does and is proved correct. That's how I perceive that.",
    "speaker" : "Greg",
    "timestamp" : "13:32-13:49"
  },
  {
    "text" : "So so what what would you rather have had the Patriots do to get him weapons? Let let him draft a wide receiver in the first round?",
    "speaker" : "Andy",
    "timestamp" : "13:49-13:57"
  },
  {
    "timestamp" : "13:58-14:01",
    "text" : "I d who whose decision was that?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "14:01-14:02",
    "text" : "Whose decision was what?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:02-14:30",
    "text" : "Drafting Nikhil Harry. That's the problem with the Belichick thing, is if he has his hands over everything, then when it goes wrong, it's his fault. You can't say that like him signing players that are busts or like, ah, it's just whatever, the GM, you know, player operations. Or he in the draft, you can't be like, hey, someone overwrote him. He's in charge. He's the final decision. He's made that organization. it that way. So when it doesn't work, it's his fault.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I mean but again Nikhil Harry not Contributing from day one was because of injuries again, right? He got hurt in preseason and didn't start until the Chiefs game.",
    "speaker" : "Andy",
    "timestamp" : "14:32-14:42"
  },
  {
    "speaker" : "Greg",
    "text" : "I think Mikhail Harry, we can all agree is not the player, regardless of injuries, that AJ Brown and uh Whoever that guy that was drafted ahead of him is as well. Debo Samuel. All right. I think it was in that draft too.",
    "timestamp" : "14:42-14:56"
  },
  {
    "timestamp" : "14:56-14:57",
    "speaker" : "Andy",
    "text" : "Who?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "14:59-14:59"
  },
  {
    "text" : "Uh yeah, yeah, I think so. I mean but at at the time it was a consensus pick. Like nobody was like ragging on the page for draft Nikhila Harry. It was a It was seen as a safe, solid pick. So I mean, what are you gonna do?",
    "timestamp" : "15:00-15:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean a lot of picks are seen that way, right? And what separates the good drafters from the bad ones are are they right in the long term?",
    "timestamp" : "15:14-15:20"
  },
  {
    "timestamp" : "15:21-15:32",
    "speaker" : "Andy",
    "text" : "And if you look back, like everybody's about as right as everybody else. Like you can say that the Steelers have great drafts, but if you look at the recent ones, eh, not so much. Same with the Ravens. Like, yeah, they hit on some of them, but they hit as much as anybody else does."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "15:32-15:42",
    "text" : "Yeah, I don't think we should have a problem with with Belichick's draft strategy. I just think it worked because you had Tom Brady. And Tom Brady."
  },
  {
    "timestamp" : "15:42-15:50",
    "speaker" : "Andy",
    "text" : "But you're telling me it worked even though it didn't work. in 2019. You're saying they didn't get him weapons in 2019."
  },
  {
    "timestamp" : "15:50-15:56",
    "speaker" : "Greg",
    "text" : "Yeah, I think the organization was bad enough that they should have given him more power, Brady, to do shit like that."
  },
  {
    "speaker" : "Andy",
    "text" : "Do shit like what?",
    "timestamp" : "15:57-15:58"
  },
  {
    "text" : "To be involved in recruiting and and which players to sign the same Aaron Rodgers shit, right? That we saw. But isn't that what these guys in there and and the people he's comfortable with rather than rolling out these rookies and these these schlubs, these bargain discount guys, and then we're under the cap every year and they don't work out.",
    "timestamp" : "15:58-16:17",
    "speaker" : "Greg"
  },
  {
    "text" : "So what what what would you say uh Antonio Brown was A Belichick decision?",
    "speaker" : "Andy",
    "timestamp" : "16:17-16:22"
  },
  {
    "timestamp" : "16:22-16:26",
    "speaker" : "Greg",
    "text" : "I think that was the kind of thing they should have been doing more of, Antonio Brown."
  },
  {
    "speaker" : "Andy",
    "text" : "Right, because that worked really well.",
    "timestamp" : "16:26-16:28"
  },
  {
    "speaker" : "Greg",
    "text" : "Hey, it didn't work out, but you know what? It worked out in Tip Bay Until it didn't. He won him a Super Bowl. Until it didn't. He played in the Super Bowl, caught a touchdown.",
    "timestamp" : "16:28-16:36"
  },
  {
    "text" : "Yeah. And then what happened? He took all his clothes off in the middle of a game and and danced off the field.",
    "speaker" : "Andy",
    "timestamp" : "16:37-16:43"
  },
  {
    "text" : "And then they they almost made it's not what we're arguing here. That's not what we're arguing.",
    "timestamp" : "16:43-16:47",
    "speaker" : "Greg"
  },
  {
    "text" : "That's true. But my point is that Belichick did put together the weapons. Like I mean what what was the starting line of week one of 2019 for wide receivers? Tim, can you look that up? In fact, that's sure, aren't we? And then when, you know, they started losing guys, um, I can't remember who else they lost. There was another wide receiver on there too, because if you look at that lineup, it was stacked. They went out and traded for Mohammed Sunu, traded a second rounder for him. Why? Because uh according to reports, that's what Brady wanted. He wanted a Muhammad Sunu.",
    "speaker" : "Andy",
    "timestamp" : "16:47-17:19"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "17:19-17:22",
    "text" : "Well, we're talking about facts here, Andy. That sounds like conjecture."
  },
  {
    "speaker" : "Andy",
    "text" : "That was reported. I can get you a link if you want, Greg.",
    "timestamp" : "17:22-17:24"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, is it conjecture or is it fact? All right, let's step back and look at the facts here, right? Belichick's had a long career, a lot of success.",
    "timestamp" : "17:25-17:34"
  },
  {
    "text" : "Yep.",
    "timestamp" : "17:35-17:35",
    "speaker" : "Andy"
  },
  {
    "text" : "But really the only success has been with with Tom Brady, right? You were kind of spinning, hey, is the Browns thing a success because they made the playoffs that one year? I think we can all agree the post-Brady Pellet uh Patriots are not a success, right?",
    "timestamp" : "17:36-17:51",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "17:51-17:53",
    "speaker" : "Andy",
    "text" : "How about 2008?"
  },
  {
    "text" : "They've gotten worse every year since then. 2008. I mean that team is fucking that team, right? You could say that they it's an eight eight-game swing from uh Brady down to his backup.",
    "timestamp" : "17:53-18:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay, so an eight games, well, five game swing. They went 11 and 5 instead of 16 and 0, right?",
    "timestamp" : "18:11-18:18"
  },
  {
    "timestamp" : "18:19-18:20",
    "speaker" : "Greg",
    "text" : "Yeah, and then you count the playoffs."
  },
  {
    "timestamp" : "18:21-18:27",
    "speaker" : "Andy",
    "text" : "Well, that's literally the only team to ever win eleven games and not make the playoffs. I mean that's kind of like"
  },
  {
    "speaker" : "Greg",
    "text" : "After being split team the best team the NFL's ever seen to a non-playoff team",
    "timestamp" : "18:29-18:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, again, they are facts, but they're they're twisted. If you want Tim, you want to talk about twisting the facts. Okay, here's some more. Here's some more. Show me another team that that went 11 and 5 and didn't make the playoffs. That's a that's a playoff caliber team. And they that team also, we were there, Greg, if you remember. They beat the pants off of the Arizona Cardinals, who eventually went to the Super Bowl. And they they smoked like 40 to 7. Huh?",
    "timestamp" : "18:37-19:05"
  },
  {
    "timestamp" : "19:05-19:07",
    "speaker" : "Greg",
    "text" : "The Pages didn't go to the Super Bowl."
  },
  {
    "text" : "You're right. But also show me another head coach who can put together a roster where your star Uh former MVP quarterback goes down quarter one week one and still wins eleven games.",
    "timestamp" : "19:07-19:22",
    "speaker" : "Andy"
  },
  {
    "text" : "I mean Geno Smith basically won eight games for uh Pete Carroll. Last year and he's the guy they pulled up off the street. He's a he's a backup quarterback.",
    "speaker" : "Greg",
    "timestamp" : "19:23-19:33"
  },
  {
    "text" : "Yeah, well uh and who did they lose? Like who who was starting week one there that they lost?",
    "timestamp" : "19:34-19:38",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "19:39-19:42",
    "text" : "I mean it doesn't matter. You throw in a backup, you throw in a backup, right?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "19:42-19:45",
    "speaker" : "Andy",
    "text" : "But they went into the season with that as as the the plan."
  },
  {
    "text" : "Also let's tell I mean all right let's back up all right let's talk about numbers what is Steve doing where is he at the bars",
    "timestamp" : "19:46-19:54",
    "speaker" : "Greg"
  },
  {
    "text" : "I guess we're taking an intermission, Steve. What are you doing? Good lord. I'm unmute Steve until he figures a fucking way.",
    "speaker" : "Andy",
    "timestamp" : "19:57-20:10"
  },
  {
    "timestamp" : "20:11-20:12",
    "speaker" : "Tim",
    "text" : "That's actually very much"
  },
  {
    "timestamp" : "20:15-20:17",
    "text" : "Resume because you were saying Greg.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "20:17-20:21",
    "text" : "We're going back to your Steve.",
    "speaker" : "Tim"
  },
  {
    "speaker" : "Andy",
    "text" : "Not push back.",
    "timestamp" : "20:23-20:24"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "20:24-20:26",
    "text" : "Unmute me, Andy. Come on."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:26-20:33",
    "text" : "I'm not allowed to unmute. I can just ask t you to unmute. I just have the power to mute you, not to unmute you."
  },
  {
    "timestamp" : "20:33-20:56",
    "speaker" : "Tim",
    "text" : "All right, so uh Steve, what we uh Greg is taking a stance of uh Belichuk's a fraud. And I'm assuming that you will join his council. And uh Andy is clearly defending Felichek not being a fraud. Uh so Greg was just about to go off. He's also is he frozen? He sure looks frozen."
  },
  {
    "timestamp" : "20:56-20:58",
    "text" : "He looks frozen. Frozen. Okay. And there he goes.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "There he goes. Good. Thank God he's gone. So now as the rational and cooler brother, I will step in here and settle this case. That should be good. Let me uh get my notes ready. Um You know, as the rational brother, I see both sides, and I can split the difference here.",
    "timestamp" : "20:59-21:23"
  },
  {
    "speaker" : "Andy",
    "text" : "That should be good.",
    "timestamp" : "21:23-21:24"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "21:24-22:01",
    "text" : "I think that The problem with Mr. Belichick is that he's doing too much. Okay. As both coach and GM. What other Person in sports, not even just NFL, has both coach and GM responsibilities. And I get the bill, the bill parcels shopping for the groceries, blah, blah, blah. But my God, it's gonna be a fucking, I mean, each of those is a full-time job that they pay millions and millions and millions of dollars for"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "22:01-22:08",
    "text" : "Page is kind of making out having one guy serve both, but you don't think Belichick's making enough to cover both?"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, even if he is, like, is he stretching too thin? Is is the game passing by and then the real question is would you rather have Bill Belichick the GM or Bill Belichick the coach?",
    "timestamp" : "22:08-22:21"
  },
  {
    "text" : "I mean the coach. Honestly, if we're going that way, you want Bill Belichick the defensive coordinator, right? Sure.",
    "timestamp" : "22:21-22:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean I I I am in that as well.",
    "timestamp" : "22:29-22:30"
  },
  {
    "speaker" : "Andy",
    "text" : "And then bring in like Andy Reid as the offensive coordinator and don't have a head coach. Like fuck it.",
    "timestamp" : "22:31-22:35"
  },
  {
    "text" : "I think the the lot logical Path here, because you can't take the coach from him because he's gotta have the win record, right? He ain't going nowhere without that thing.",
    "timestamp" : "22:35-22:49",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "22:49-22:52",
    "speaker" : "Andy",
    "text" : "Right, was he 29 games behind something like that?"
  },
  {
    "timestamp" : "22:53-23:00",
    "text" : "Sure. Whatever it is. I mean, the people who were asking for Bill Belcheck to be fired are fucking idiots. Yeah, Craig included.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:00-23:07",
    "text" : "I'm assuming he said that since I just joined way late, but I don't think he specifically said it, but he's been leaning hard that way, yes."
  },
  {
    "timestamp" : "23:07-23:13",
    "speaker" : "Steve",
    "text" : "Yeah, yeah, yeah, yeah. He's he's then hitting around the bush. And I'm sure EEI and the talk radio people are saying the same fucking thing."
  },
  {
    "timestamp" : "23:14-23:14",
    "speaker" : "Andy",
    "text" : "Undoubtedly."
  },
  {
    "timestamp" : "23:15-23:19",
    "speaker" : "Steve",
    "text" : "To be fair, they're saying the same thing after that Kansas City loss. So Here we are."
  },
  {
    "timestamp" : "23:20-23:26",
    "text" : "And after um the 31-0 opening season loss in uh 2003.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "23:26-23:27",
    "text" : "So sure."
  },
  {
    "timestamp" : "23:27-23:28",
    "text" : "A common referral.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "23:32-24:05",
    "text" : "Some moments that are few and far between and those ones whatever, but I think that there is something to be said for BB and the Twilight Years. Keeping up the GM side because even if think about from this perspective, at some point, you know, you're not gonna be here too much longer, right? 30 games longer, 30 wins longer from here You're not gonna just plug somebody into that role. You're gonna have to plug two people into that role, right? You're gonna have to hire a coach and a GM when Belichick leaves."
  },
  {
    "timestamp" : "24:05-24:06",
    "text" : "In theory.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "24:06-24:13",
    "speaker" : "Steve",
    "text" : "So why not hire a GM now to get up to that speed and then when Belichick leaves we hire Mike Brable?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:14-24:17",
    "text" : "I think Gerard Mayo is the uh No Mike Rabel."
  },
  {
    "timestamp" : "24:18-24:21",
    "text" : "Mike Brabel is my number one. Are you kidding me?",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh well I think usually the I don't know if it's like the GM picks the coach or the other way around. Um, but I think it's usually there's some sort of um like deal between the two of them that they're gonna work together. The owner gets to pick both of them.",
    "speaker" : "Andy",
    "timestamp" : "24:22-24:39"
  },
  {
    "text" : "This is my point of like, I don't know. I think you can say that he's lost it or he hasn't adapted to the times and Whatever. And and that's a fair criticism.",
    "speaker" : "Steve",
    "timestamp" : "24:41-24:55"
  },
  {
    "text" : "Is it?",
    "speaker" : "Andy",
    "timestamp" : "24:55-24:56"
  },
  {
    "text" : "Yeah, I think I think on some levels it is, right? And Uh Greg was texting me the other day about how Mac Jones has no escape ability and he's not wrong and there's that fumble that he had or that terrible across the body throw. across the field pick six that he had were both sort of symptoms of his in his capability. And part of that is tied to this that's That was maybe a hand there dealt in the draft, whatever, and we got a good quarterback for the 15th pick, blah blah blah. But if Belichick was solely focused on coaching up the players he was dealt with. I think he could be better. As opposed to spreading himself over the entire continuum of everything, of finding, evaluating, selecting. Scouting the other teams in the NFL, finding all those players, bringing them in, and then coaching them up. And I think that's probably where he got caught a little bit with his pants down last year, where he's like, I'll trust, you know, fucking Patricia and Joe Judge to run the offense and oh that didn't work, you know. If Belichick solely focused his efforts on coaching only, would the Patriots be better?",
    "timestamp" : "24:56-26:12",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:13-26:17",
    "text" : "I think that's a more reasonable take than Greg's firely eye."
  },
  {
    "text" : "Well I'm glad I missed all Greg's takes.",
    "timestamp" : "26:18-26:20",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Well we set it up as a courtroom. I had to prosecute. I can't just be like middleman there.",
    "timestamp" : "26:21-26:25"
  },
  {
    "timestamp" : "26:27-26:30",
    "speaker" : "Andy",
    "text" : "Uh coming in it felt like you didn't want to be the middleman anyway, Greg."
  },
  {
    "timestamp" : "26:31-26:46",
    "speaker" : "Greg",
    "text" : "Well, I don't think he's doing a good job since Brady left. I mean I I the case for Was he a good coach when Bertie is here? I mean, I think it's obvious, yes. Yeah. Has he been a good coach since then? I don't think so."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "26:46-26:55",
    "text" : "You don't think he's been a good or a good personnel guy? Or how do you because I see them as two very distinct roles. And on some levels he's been good and some levels he's been good."
  },
  {
    "timestamp" : "26:55-26:59",
    "text" : "I think both. Well let's hear it, Greg. How do you think he's not been a good coach?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:59-27:09",
    "text" : "What's the plan? Personnel wives well that's a GM thing. What's the Patriots identity? It isn't a GM thing because he's the GM."
  },
  {
    "speaker" : "Steve",
    "text" : "Well that's my point of he's He's not doing a great job doing both. And he's the only person in sports that does both. Give me another coach slash GM. in any of the major four sports.",
    "timestamp" : "27:10-27:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Exactly.",
    "timestamp" : "27:27-27:27"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "27:28-27:31",
    "text" : "And it's and he's not doing a particularly good job at either, right?"
  },
  {
    "timestamp" : "27:32-27:51",
    "text" : "Right. So which um and my point is like He's gonna be gone here at some point. So let's if you're gonna get take one thing away from the guy, it might as well be GM Because he's the he he is the best coach in the NFL. He just knows he knows so much.",
    "speaker" : "Steve"
  },
  {
    "text" : "You still think that right now? No.",
    "speaker" : "Tim",
    "timestamp" : "27:52-27:54"
  },
  {
    "speaker" : "Steve",
    "text" : "Do I think that? Yeah.",
    "timestamp" : "27:54-27:56"
  },
  {
    "text" : "No. Kyle Shanahan is the best coach in the NFL. Well, it's Andy Reid. Andy Reid's also got a case for best coach in the NFL.",
    "speaker" : "Greg",
    "timestamp" : "27:56-28:05"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:05-28:06",
    "text" : "No. And"
  },
  {
    "speaker" : "Greg",
    "text" : "A lot of these guys have done it with like multiple quarterbacks too, right? Andy Reid did it with what three separate quarterbacks? Had them as like perennial contenders. He did McMah with McNabb. He did it with Alex Smith. You Alex Smith. That guy sucks. And now he's doing Alex Smith.",
    "timestamp" : "28:07-28:24"
  },
  {
    "timestamp" : "28:24-28:25",
    "speaker" : "Steve",
    "text" : "Get out of here with that."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "28:25-28:27",
    "text" : "They were making playoffs with Alex Smith"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:27-28:31",
    "text" : "And I mean he hadn't uh playoffs is the in death the bar?"
  },
  {
    "text" : "Right.",
    "speaker" : "Tim",
    "timestamp" : "28:32-28:32"
  },
  {
    "text" : "Well no, he started doing three different quarterbacks winning the playoffs with Tom with uh Mac Jones.",
    "timestamp" : "28:32-28:39",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "28:39-28:45",
    "text" : "Having winning seasons. He's had he's had 10 seasons without Brady and seven of them are losing seasons. Okay."
  },
  {
    "speaker" : "Andy",
    "text" : "And how many of those are starting like a rebuilding a program though? That's what we've been talking about.",
    "timestamp" : "28:46-28:52"
  },
  {
    "text" : "Well why do you think you want him to start winning from day one?",
    "timestamp" : "28:51-28:54",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "28:55-28:57",
    "text" : "Why do you have to rebuild if you have a dynasty team?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "28:57-29:03",
    "speaker" : "Steve",
    "text" : "Who was the Browns quarterback when they rebuilt with when they beat the Patriots in the quarterbacks? Muck it. Bernie Kozar or some shit?"
  },
  {
    "text" : "Many tests of Verity. They fired Bernie Kozar, yeah.",
    "timestamp" : "29:03-29:06",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Right. Pete Carroll's rebuilding. He's doing fine. Gino Smith. Yeah. They didn't skip a beat.",
    "timestamp" : "29:07-29:15"
  },
  {
    "text" : "Right, because you know after that last Super Bowl they won back in when was it 2013?",
    "speaker" : "Andy",
    "timestamp" : "29:16-29:20"
  },
  {
    "timestamp" : "29:21-29:28",
    "speaker" : "Greg",
    "text" : "Hey, it doesn't matter. If you're talking about transitioning from one quarterback era to another, he's doing a bad job, no matter how you spin it. P."
  },
  {
    "timestamp" : "29:28-29:31",
    "speaker" : "Steve",
    "text" : "Carroll and He's had one try yet."
  },
  {
    "timestamp" : "29:31-29:36",
    "speaker" : "Andy",
    "text" : "I mean the thing is like if you don't pick the right quarterback, who was he gonna pick in that draft otherwise?"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't know. Pick up Geno Smith from Free Agency. It's working in Seattle. You know what I'm saying? Brock Purdy. He was available. He's doing just fine in San Francisco.",
    "timestamp" : "29:36-29:47"
  },
  {
    "speaker" : "Andy",
    "text" : "On the same team that that traded what three first round picks for uh exactly, exactly.",
    "timestamp" : "29:48-29:55"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "29:55-30:36",
    "text" : "They can make mistakes in San Francisco and they can still look like the best team in the NFL. Because they're good, they're doing good business, which is what we always thought Belichick was, is like even if every these picks don't hit all the time, he's gonna find the guy in the back of the draft. They're gonna like fit into the culture, the Patriot way, and they're gonna be a good football team that's above 500 and always in the contention, right? That's what we thought. But I don't think that's what we're looking at. We're looking at like a poorly cloaked, sloppy team that really misses on important picks. And if you miss on them, they don't have any like foundation to be like okay we're still gonna be good even if we miss this pick."
  },
  {
    "text" : "I'm on Greg's team at to a point where I think there's a lot of sports for you to talk about Bill Belichick, the M GM fucking Bill Belichick, the coach. And like that's a line that I can sort of get behind of like I think Bill Belchak B GM has struggled to adapt to the changes in the NFL and he's maybe tried to zig too much when they've zagged, right? Like he's It seems like he's leaned way into the defense and run game during this NFL of the last five years of for the ball over the yard. Right. And they're bigger and slower. And they've tried to get to that a little bit on the defensive side, but the offensive side is not caught up. And I would love To see because it has to happen at some point is my point of like when Belichick retires if he if we fire Belichick right now, we're not looking for a coach. We're looking for a coach and a general manager. You can't do that. You you know, but give me a time where they just fire a coach in a GM at the same time and like those teams are just the Chicago Bears, you know",
    "speaker" : "Steve",
    "timestamp" : "30:37-31:55"
  },
  {
    "text" : "But it worked for many years, right?",
    "speaker" : "Andy",
    "timestamp" : "31:55-31:58"
  },
  {
    "text" : "It worked for many years. I mean you talk about the maybe this is McDaniels too, of like where they're missing McDaniels. I think that's a thing we're not really talking about much. But You talk about the the two tight end sets that they rolled out. That was like there was no one else in the NFL doing that. And they drafted the personnel. And they rolled out the sets and it was, it worked great, right? And then that year they did the fast offense, right? That they were snapping it in under like 20 seconds every time, right? That worked amazing. And it was always like, okay, they're ahead of the curve. They're ahead of the curve. But that doesn't seem that it seems like they're behind the curve now. And it's like, why? So hold on.",
    "speaker" : "Greg",
    "timestamp" : "31:58-32:40"
  },
  {
    "text" : "Because Mac Jones isn't who they hoped he would be. Yeah, and you can you can argue that like you know they should have drafted a different quarterback that year, right? But I think they went in with the plan of giving him However many years, whatever.",
    "timestamp" : "32:42-32:56",
    "speaker" : "Andy"
  },
  {
    "text" : "How about Cam Newton? Did they is he what they thought that would be?",
    "timestamp" : "32:56-32:59",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "He was the best quarterback available when Brady left.",
    "timestamp" : "33:00-33:03"
  },
  {
    "text" : "Yeah. He was exactly what they thought he was gonna be.",
    "timestamp" : "33:04-33:06",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "33:06-33:14",
    "speaker" : "Andy",
    "text" : "Yeah, probably. And he was actually doing okay in the first few weeks until he missed a few games and then couldn't keep up with the offensive game planning and whatever."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "33:18-33:56",
    "text" : "When they tried to transition to the zone run game in the beginning of the year in training camp, and it was just fucking miserable, right? It was like a half-hearted, a half-ass attempt to like adjust to what the new running game and like we watched that game against the Dolphins and they fucking gashed us on that. It was the those the zone run game cutback where there's just nobody home and they just took it to the house. I don't know. I don't know what the answer is, but From my perspective, you you can't just give Belichick the boot."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:56-34:00",
    "text" : "I think we all know that Belichick is a defensive-minded coach, right?"
  },
  {
    "speaker" : "Steve",
    "text" : "Sure. I mean, Belichick is the coach and you hire a Different offensive coordinator who's you know Bill Velichek or B O B, but you could change the entire culture, right? You hire a combo GMOC That want to come together and make the Patriots different.",
    "timestamp" : "34:00-34:20"
  },
  {
    "speaker" : "Greg",
    "text" : "I say bring back McDaniels. He's gonna get fired soon.",
    "timestamp" : "34:21-34:25"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "34:31-34:38",
    "text" : "Doesn't solve that problem of the the Patriots are playing the football from the games we've been watching, right?"
  },
  {
    "timestamp" : "34:38-34:42",
    "speaker" : "Greg",
    "text" : "But Matt's look good that rookie year, right? Under McDaniels."
  },
  {
    "text" : "Yeah. He did. But he also looked like they they asked him to do literally nothing that first year, right? Like they told him I remember the Jets game where they like he had chances to take shots on the field and he just would not do it no matter what. Like they did like the the throwback pass to him and he was had like ten seconds and like still just dumped it off to the the short guy and uh whatnot. So I think because of that, they've kind of, you know, they tried to draft Bailey Zappy uh the year after in 2022. Um Obviously that didn't work out, but whatever. He was a fourth round pick. But they've also like think alluded to what Steve's alluding to is they've tried to be that run game as well. Um with um Stevenson and uh who was it before? Um who's the guy that went to the uh Damian Harris? Yeah, thank you, Damian Harris. The two of them And I think that kind of actually worked in Mac Jones' first year, right? You have this rookie guy and so you surround him with whatever you can. You build a dominant defense because that's what Belichick is good at, right? I mean he's got freaking game plans in the Hall of Fame for it. He shut down some of the best offenses in history in Super Bowls with his defensive game plan. So and he's doing it again. I think all these people talking about how the league has passed him by. If you look at his defense and how he's now using what, three, sometimes four safeties on the field now because of how light things are. And he's specifically gone out and drafted these guys. Um You know, like the uh Kyle Duggar drafted him like with their first pick from like some no-name school, and now he's kind of running that defense, right? And he and they have a bunch of guys like that. They brought in Jalen Mills, who's that kind of tweener safety linebacker guy who can come up in the box and and still stop the run. And they have this really dynamic defense that is giving Yeah, uh Dolphins team fits that just put up 70 points on the the Broncos.",
    "speaker" : "Andy",
    "timestamp" : "34:42-36:46"
  },
  {
    "timestamp" : "36:46-36:56",
    "speaker" : "Greg",
    "text" : "Right. But the point of the league has passed you by is that you have a really dynamic defense and you're one and three. Like defense doesn't win games in the modern NFL."
  },
  {
    "speaker" : "Andy",
    "text" : "You're right. But I think a lot of teams this year are finding out that How your offensive line goes, your offense goes. And the majors offensive line hasn't started the same five players yet, right? Yeah. They've had a different lineup every week because of injuries.",
    "timestamp" : "36:56-37:13"
  },
  {
    "timestamp" : "37:14-37:19",
    "speaker" : "Greg",
    "text" : "But also you're drafting players like Cole Strange out of fucking East Bonfok University."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:19-37:23",
    "text" : "Yeah, and he was good when he's not hurt, but he's he got hurt in preseason."
  },
  {
    "speaker" : "Steve",
    "text" : "I know this hurts your heart, but I'm I'm on team Greg of I think Belichick is trying to outsmart. He's trying to zig too much when the rest of the league is zagging and finding the the cold stranges and It's just like it's not that complicated and we can take that DM roll out of them and say, hey Belcheck, here are the groceries Fucking make us a goddamn delicious meal. I feel like he could do that. I I feel like he's a little bit more.",
    "timestamp" : "37:23-37:55"
  },
  {
    "text" : "But think about what I just said though. Like right now, like half the teams in the league are finding out that If your offensive line isn't solid, your team's gonna be your offense is gonna be garbage. Look at the Bengals this year. Look at how that offense is running. And you know, they they kind of masked it a bit the year they went Super Bowl. But it's completely fallen apart. And are they one and three as well? Is that right?",
    "timestamp" : "37:55-38:21",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "38:22-38:22",
    "speaker" : "Steve",
    "text" : "They are."
  },
  {
    "timestamp" : "38:22-38:32",
    "text" : "I don't know off the top of my head. Yeah, I think they are. Um and they have all the weapons in the world, right? They have a superstar quarterback. like top receivers and they're in the exact same position.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, but if you were to put money on which team has a better record at the end of the year, I'm taking Cincinnati.",
    "timestamp" : "38:33-38:38",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Does uh Product account for that though? Yeah, yeah.",
    "timestamp" : "38:39-38:44"
  },
  {
    "speaker" : "Greg",
    "text" : "Just right now, if you said, hey, Greg, you have a hundred dollars, you're going to Vegas and you gotta put it on one team or the other.",
    "timestamp" : "38:45-38:51"
  },
  {
    "speaker" : "Steve",
    "text" : "So you're going to Wheeling, Greg. You're going to Wheeling West Virginia, you can put a pet on this.",
    "timestamp" : "38:51-38:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Good. I'd put it on the Patriots.",
    "timestamp" : "38:56-38:59"
  },
  {
    "speaker" : "Steve",
    "text" : "Just because of Belichick's Oh, and you'll also be in Wheeling, West Virginia to put a bet on the Patriots.",
    "timestamp" : "38:59-39:04"
  },
  {
    "timestamp" : "39:06-39:07",
    "speaker" : "Andy",
    "text" : "Well there you go."
  },
  {
    "text" : "I mean what you need in the modern NFL is is an offense to win games, right?",
    "timestamp" : "39:07-39:12",
    "speaker" : "Greg"
  },
  {
    "text" : "What's the modern Give me an idea of the modern league. How far back does that go?",
    "timestamp" : "39:15-39:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "39:23-39:27",
    "text" : "I haven't heard a word from the Tim Turner here. I'm interested to hear his take on this."
  },
  {
    "text" : "I don't have a take. I'm the judge. He's supposed to be the impartial judge, but he's on Team Greg. So I'm I'm I'm here by myself.",
    "speaker" : "Andy",
    "timestamp" : "39:27-39:35"
  },
  {
    "timestamp" : "39:35-40:25",
    "speaker" : "Tim",
    "text" : "Back to the way I like it. I just my take on it is really just it everything that you say, Andy, just comes back to Belichick. Belichick's the one that puts the team together, regardless of and I I think Steve has a point where he's He does try to, you know, throw a dart in someplace that no one else is looking instead of taking obvious talent because I think that he's such an egomaniac that he doesn't want to To take on a personality that he can't handle. He wants someone to come kiss his feet and say, Bill, please save my career. And and I will take no money, I'll put my body on the line, and you know, and he's just not getting that anymore because he's got a bunch of Gen Zers and kids and he's a 70-year-old man."
  },
  {
    "timestamp" : "40:25-40:43",
    "text" : "I just think that's that's really what you I love it Tim. Okay, Boomer. You know what I mean? I think he has a tough time connecting to players. Is Belichick the silent generation or is he a boomer?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "40:44-40:46",
    "text" : "He's a boomer. I don't even know what the silent generation is."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:47-40:50",
    "text" : "He's a boomer. He's gotta be close."
  },
  {
    "text" : "I mean it's pretty uh it's a good point though, right? I mean there is the the shift in coaching strategy to like being the buddy pal, right? Sean McVeigh.",
    "timestamp" : "40:50-40:59",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "40:59-41:00",
    "speaker" : "Steve",
    "text" : "I think it's stupid."
  },
  {
    "speaker" : "Greg",
    "text" : "I don't know.",
    "timestamp" : "41:01-41:02"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "41:02-41:05",
    "text" : "You don't think he has a tough time connecting to players?"
  },
  {
    "text" : "No, I don't think so. I feel like you would have heard that from former players. I think it's more He's struggling to adapt to the like the GM Belcheck is struggling to adapt to the modern fellow. Right, no, no, no.",
    "timestamp" : "41:05-41:22",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "41:23-41:53",
    "speaker" : "Tim",
    "text" : "But I but I think that's a good point too. I no, I think that's a good point. I just think more like Um he he's it that's where it's uh it gets kind of screwed up because he wants them to come and kiss his feet and take the like the less amount of money now whether that comes from you know ownership or if that's coming just from bill I don't know but you might be able to connect with them on a personal level but he's not gonna pay you regardless no matter what you do he's not going to reward you with the money. All right Asante calm down I don't think that's true."
  },
  {
    "timestamp" : "41:57-43:11",
    "text" : "You have a point, but it's more he's always looking like because he's coming at it from a GM perspective of What's gonna keep us competitive for the next five years plus, right? You can always ball out and blow your salary cap and kick the can and have a huge team out the Rams or the Bucks or everybody and have like a dope ass team with the crap cap is crap and do whatever the fuck you want this year, but you can't sustain the in and out. But to Greg's point earlier of That process only works when you're competitive every fucking year and you're going to the goddamn playoffs, right? And there's a little bit of He's definitely resistant to that. And a new GM might not be. And like, hey, Belcheck here is like I went to Whole Foods and I got you the best groceries. Like stop going to goddamn stop and shop and fucking Aldi and trying to find the shitty ass things and find the valueest and and shopping in the produce that's expired and like here's the best stuff. It's only gonna be like make it goddamn work and then we'll suck for a bit and then you know he won't do that because he's the GM and the coach.",
    "speaker" : "Steve"
  },
  {
    "text" : "Is that the point I was trying to make though, Steve? Because that's not what I'm saying at all. I'm just saying they don't want to Yeah, I'm just saying I'm I'm saying more like he doesn't he the way that he brings in his team. Like I think he wants people like I just think it's hard for him to have people that have no ego and he doesn't want that. He just wants",
    "timestamp" : "43:12-43:33",
    "speaker" : "Tim"
  },
  {
    "speaker" : "Greg",
    "text" : "Yes, he's the military style, like I'm in charge, you listen to me. I mean it probably comes from his background, right? His dad was military, all that stuff. Which I don't think I think you're on to something where like the younger generation doesn't respond well to that. I mean you think And you see Sean McVeigh, you see it in college all over the place, right? Deion Sanders, like that's a good example of like the truth it's trending towards like I'm your buddy, even though I'm the coach. I'm not in charge of you. I I disagree. And whether you think that that translates to success on the field is like one thing or another, but I think it's hard to argue that players are excited about like, yeah, me and Bill, you know.",
    "timestamp" : "43:33-44:13"
  },
  {
    "speaker" : "Steve",
    "text" : "Really? I mean I I feel like he's at the other side of that conundrum of knowing everything about the game of football.",
    "timestamp" : "44:14-44:22"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but I think there have been a lot of players, especially on defense.",
    "timestamp" : "44:23-44:26"
  },
  {
    "text" : "But it's not a prick about it. I can have a really smart boss that's also a little bit more.",
    "timestamp" : "44:32-44:36",
    "speaker" : "Greg"
  },
  {
    "text" : "And I'm normal, but you guys want some of me? Like I think you'd be about it.",
    "speaker" : "Steve",
    "timestamp" : "44:44-44:48"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean that's literally what um Like a bunch of players, uh especially on defense have said, like they they came here, like Jalen Mills came specific signed with Patriots specifically to be coached by Bill Belichick.",
    "timestamp" : "44:49-45:01"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "45:01-45:19",
    "text" : "Yeah, but they're also guys that are willing to sacrifice their ego. And it's not and you know who has the biggest ego? The most talented players. So you can get your like your your scrap keep guys that are willing to be the fucking good lunch pail guy, but those aren't guys that are winning in the modern NFL."
  },
  {
    "speaker" : "Steve",
    "text" : "You're way off if you think we can't attract talent because Belichick is the block here.",
    "timestamp" : "45:19-45:23"
  },
  {
    "speaker" : "Tim",
    "text" : "Right, yeah, I agree.",
    "timestamp" : "45:24-45:25"
  },
  {
    "text" : "You're way off.",
    "speaker" : "Steve",
    "timestamp" : "45:25-45:26"
  },
  {
    "text" : "I can't believe I'd see A top like Steve and Auntie on the same side of something.",
    "timestamp" : "45:26-45:31",
    "speaker" : "Tim"
  },
  {
    "timestamp" : "45:32-45:35",
    "speaker" : "Andy",
    "text" : "Steve even agree more than Greg and I do, I think."
  },
  {
    "text" : "I just I don't know, I just feel like Steve likes to be a natural contrarian and to Sometimes probably the word mop.",
    "timestamp" : "45:36-45:42",
    "speaker" : "Tim"
  },
  {
    "text" : "But I can be on the edges, I'm in the middle.",
    "timestamp" : "45:42-45:46",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Tim",
    "text" : "Let's be real. Yeah. Well, hey, I mean I guess natural progression, right?",
    "timestamp" : "45:46-45:50"
  },
  {
    "speaker" : "Steve",
    "text" : "That's how it is. Middle brother, it's how it works.",
    "timestamp" : "45:51-45:54"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "45:54-45:54",
    "text" : "Yeah, I think so."
  },
  {
    "timestamp" : "45:55-45:56",
    "speaker" : "Steve",
    "text" : "That's my lot in life."
  },
  {
    "timestamp" : "45:57-46:00",
    "speaker" : "Tim",
    "text" : "I well, I see you meet leaning more handy right now."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:01-46:21",
    "text" : "I I I think the whole like Belichick doesn't pay people is overblown too. He he he will pay people. Um I mean he yeah I mean he paid Gronk like extraordinary money. He before because I like every the there's always somebody who's like the top. paid player at their position in the league. Yeah."
  },
  {
    "timestamp" : "46:23-46:28",
    "speaker" : "Steve",
    "text" : "Remember when Hightower went and testing the market came back? Yeah. But like this is my point of like"
  },
  {
    "timestamp" : "46:29-46:46",
    "speaker" : "Andy",
    "text" : "But yeah, and that that's the other thing too, Steve. That's a great point, is like the Patriots will like Belichick will say, listen, this is what we think you're worth. Um feel free to go out and get a better offer if you find one. But Great. If not, come back and this is what you'll get And came back."
  },
  {
    "text" : "Steve Brown's at High Time came back. When you're Sean McVeigh or Pete Carroll and the buddy coach, you can't do that. That is removed from your entire repertoire of I know you're really good at your job, but the market is this and I don't give a fuck about and then what's your value of the market? And like this is my point of BB trying to have he has a foot in both camps. And let's be real, he's really fucking good at it, or was really good at it, however you want to look at it, to the point where we won a fucking ton of the world championships because he is really good at it. But This setup is unique. Give me, come on, think about any other top four league franchise where the coach is also the GM For any year more than anything in the history of any franchise ever.",
    "speaker" : "Steve",
    "timestamp" : "46:46-47:42"
  },
  {
    "text" : "Really",
    "timestamp" : "47:42-47:43",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "47:43-48:16",
    "speaker" : "Steve",
    "text" : "There's nothing. He is like the only one who's ever done that. And like it has worked. But Robert Kraft, in my opinion, is come to BB and say, hey, buddy. Great, loved it. I'm obviously not gonna fire you because it worked so well, but like, you know, which would you rather do? Would you rather be the GM or would you rather be the coach because you can't do both? And I think that is our path forward of BBD gives up one of these two. He's doing two full-time jobs."
  },
  {
    "timestamp" : "48:16-48:21",
    "text" : "But I think he's as good a coach as he is because he gets to pick the players. He has built this.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "48:21-48:43",
    "text" : "Sure, but like he can also be a really fucking good coach with giving the groceries. I mean that's pretty much a point that like another coach. Yeah the coach is own GM like like It's not we're gonna say like we're gonna force a GM on you, Belichick. Like if you want a culture and a fit and a system and like yeah of course go find John Robinson, go find but does that make him a better coach though?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "If he picks the guy and says, here's what I want, I want the bargain heap guys that are gonna come in and not say anything, yada yada, we're gonna end up with the same type of players.",
    "timestamp" : "48:45-48:53"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:54-48:58",
    "text" : "Is it gonna change anything? If they have somebody else's name on the draft pick, yeah."
  },
  {
    "text" : "Yeah, you need someone that's gonna be like, No, Bill, I'm getting you this guy or I'm drafting this guy instead, even though you want this guy.",
    "timestamp" : "48:58-49:07",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh but what if that doesn't work?",
    "timestamp" : "49:07-49:08"
  },
  {
    "text" : "That's an RKK conversation. And it's an ego thing, right?",
    "timestamp" : "49:08-49:11",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:11-49:13",
    "text" : "What if the offense doesn't work when they do that?"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know if Belitech has an ego like that.",
    "timestamp" : "49:13-49:15"
  },
  {
    "text" : "Well at least you try it, it ain't working now. I mean you go, hey Bill, on defense you can draft any fucking D3 player you want. From Lenore Ryan.",
    "speaker" : "Greg",
    "timestamp" : "49:15-49:27"
  },
  {
    "text" : "But you're not drafting Cole Strange. non-Belichek GM.",
    "speaker" : "Steve",
    "timestamp" : "49:28-49:38"
  },
  {
    "text" : "Is it 25? I don't think he wants to give up. He never would. Yeah, why would he give it up?",
    "speaker" : "Greg",
    "timestamp" : "49:38-49:45"
  },
  {
    "speaker" : "Andy",
    "text" : "It's all or nothing.",
    "timestamp" : "49:46-49:47"
  },
  {
    "text" : "And then at some point we're gonna have a non-Belichek as the GM, right?",
    "timestamp" : "49:47-49:50",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "49:50-49:54",
    "text" : "Probably the same year we have a non-Belichek coach, I would imagine. Yep."
  },
  {
    "timestamp" : "49:55-50:01",
    "speaker" : "Tim",
    "text" : "He's not gonna step down from that role. No. I think he will. That makes $25 million a year. He's not gonna do that."
  },
  {
    "timestamp" : "50:01-50:05",
    "speaker" : "Andy",
    "text" : "I don't think it's that. I think he's going for the win record."
  },
  {
    "speaker" : "Tim",
    "text" : "Shul has been a dick to him. Yeah, it is a personal thing.",
    "timestamp" : "50:05-50:10"
  },
  {
    "speaker" : "Steve",
    "text" : "But if I was Belichick and I was like focused on that, then The more time I can spend on coaching, the less time I can spend on doing all the other bullshit. That's not how we see it. Salary cap management. Talent players are cut and like that shit. Like, let's let me coach. It's like half his he could half his workload and coach forever",
    "timestamp" : "50:10-50:31"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "50:33-50:43",
    "text" : "I don't think he wants to do that. Honestly, I think he wants to get the thing with Shulha. And then I think eventually he wants to be enough to hand it off to Steve Belichick. Or Brian, whatever."
  },
  {
    "timestamp" : "50:44-50:49",
    "text" : "Yeah, I that's another point. If we're still in the courtroom, fucking Steve Belichick, dude.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:49-50:54",
    "text" : "Are you kidding me? Are you kidding me? No, you're right. That defense is terrible with under his leadership, right?"
  },
  {
    "timestamp" : "50:54-51:01",
    "text" : "Dude, I don't care. That guy should not be coaching a defensive unit in the NFL. That's ridiculous. Why?",
    "speaker" : "Greg"
  },
  {
    "text" : "Greg, you bought me a Steve Belichick shirt. Just get out of here. Get out of here, Greg. You bought me a Steve Belichick shirt that went where he's doing the tongue thing. I have a shirt in my closet.",
    "timestamp" : "51:01-51:14",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "It's funny. I'm not saying it's not funny. I'm just saying that you can't be like you can't hold yourself seriously and be like, I'm gonna have my fucking son do it. Like that's that's ridiculous. I don't know the right.",
    "timestamp" : "51:14-51:29"
  },
  {
    "text" : "Kyle Shanahan. How did he get his start in the league?",
    "speaker" : "Andy",
    "timestamp" : "51:30-51:33"
  },
  {
    "speaker" : "Greg",
    "text" : "Exactly, but they let him go do it on his own, right?",
    "timestamp" : "51:34-51:36"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:36-51:43",
    "text" : "Instead of being like just Kyle Shanahan was started doing it on his own."
  },
  {
    "text" : "Yeah, that's a good point.",
    "speaker" : "Greg",
    "timestamp" : "51:44-51:45"
  },
  {
    "timestamp" : "51:46-51:46",
    "speaker" : "Andy",
    "text" : "No."
  },
  {
    "timestamp" : "51:46-51:46",
    "text" : "I don't know.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "51:47-51:49",
    "speaker" : "Andy",
    "text" : "Where did he start? He started under his father."
  },
  {
    "speaker" : "Greg",
    "text" : "Look it up.",
    "timestamp" : "51:49-51:49"
  },
  {
    "text" : "He started under his father.",
    "timestamp" : "51:50-51:51",
    "speaker" : "Andy"
  },
  {
    "text" : "He was either def was he an offensive coordinator under his father? The nepotism is the least of my concerns.",
    "timestamp" : "51:51-51:56",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "51:56-51:58",
    "text" : "He actually might have been."
  },
  {
    "timestamp" : "51:58-51:59",
    "speaker" : "Tim",
    "text" : "Hold on, hold on."
  },
  {
    "timestamp" : "52:00-52:01",
    "speaker" : "Greg",
    "text" : "What is Steve?"
  },
  {
    "timestamp" : "52:02-52:06",
    "speaker" : "Tim",
    "text" : "He was an offensive coordinator for the Redskins when uh Mike Shanahan was uh head coach."
  },
  {
    "timestamp" : "52:07-52:38",
    "speaker" : "Greg",
    "text" : "All right, so is Steve Belichick gonna be a good head coach in this league? Even aside from that, I don't think it's a good look. Regardless, I don't think it's a good look for Shanahan's either. The nepotism, right, is is horrific. And we're all and we're even having these conversations about like why can't these black guys get uh jobs in the league? And then they're like, oh yeah, but you know, I'm with you, brother. And then it's like, yeah, my son just got the gig, dude. That's ridiculous. Like that son doesn't get the job if Bill Belichick's not the head coach, right?"
  },
  {
    "text" : "I mean he's growing up around football.",
    "speaker" : "Steve",
    "timestamp" : "52:40-52:42"
  },
  {
    "speaker" : "Greg",
    "text" : "He's drawing Mayo's over you being like, what the fuck do I gotta do, dude? This fucking like 35-year-old guy just walking in like, ooh.",
    "timestamp" : "52:42-52:51"
  },
  {
    "text" : "And and who is there who is the uh the uh defense coordinator before that?",
    "timestamp" : "52:51-52:55",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "52:56-52:58",
    "text" : "Andy, do you agree with Steve Belichick getting the gig?",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "52:59-52:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "You do. Why?",
    "timestamp" : "52:59-53:00"
  },
  {
    "timestamp" : "53:00-53:02",
    "speaker" : "Andy",
    "text" : "Because he's fucking good at it."
  },
  {
    "timestamp" : "53:03-53:06",
    "text" : "Look at his defense. But going into that based on what?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Based on the results of this defense and how well.",
    "timestamp" : "53:07-53:09"
  },
  {
    "speaker" : "Tim",
    "text" : "Wasn't he the secondary coach when we played uh when we were in the Super Bowl against Philly? How many points did that secondary give up?",
    "timestamp" : "53:11-53:19"
  },
  {
    "timestamp" : "53:19-53:32",
    "speaker" : "Steve",
    "text" : "The Rams defense too. I mean he was he the I'm just saying we don't even know how to do it. To counter Greg's point, what about Brian Belchek? He's not as good, so he's not shit."
  },
  {
    "speaker" : "Greg",
    "text" : "I know, but even if the is good, the optics are bad. Oh, sure.",
    "timestamp" : "53:32-53:37"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean, put him on a different team, let him figure it out. You missed my head coach pick, Rick. Who who would you rather have as head coach than Belchak if Belchak retired in two years?",
    "timestamp" : "53:37-53:49"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "53:49-53:57",
    "text" : "Oh, I mean there's Like if people that are available. I don't think we should fire him, so I don't think there's anybody available that's as good as him."
  },
  {
    "timestamp" : "53:58-54:01",
    "text" : "But oh wow. Can you say it again?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Tim",
    "text" : "But if you asked if there's anybody I would trade on the I can prosecute. God damn it. Should I should anybody for it? I could I could pick six. You can't say he's a fraud and also say that he you he there's nothing else to want. You just he just shit.",
    "timestamp" : "54:02-54:19"
  },
  {
    "timestamp" : "54:19-54:27",
    "speaker" : "Steve",
    "text" : "But you're agreeing with me that he should keep coaching and give up Yeah, no, I think he should be the head coach, yes. Okay."
  },
  {
    "text" : "But he's a fraud. Ideal Shanahan. I think Kyle Shanahan's the best coach in the FL.",
    "speaker" : "Greg",
    "timestamp" : "54:27-54:34"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "54:35-54:57",
    "text" : "He's not going anywhere. Come on, I got a review. The Pinchest job opens up and it's a very desirable job because they're a historically awesome franchise with a great owner and a rabid fan base as obvious by this goddamn podcast where we're re-watching games from 2004 or 5 or whatever the fuck year it is. Who who's who's going for it?"
  },
  {
    "timestamp" : "54:57-55:06",
    "speaker" : "Greg",
    "text" : "I mean there's not that many good coaches out there just sitting around waiting. My number one, Mike Grable. Yeah, he probably considered it."
  },
  {
    "timestamp" : "55:08-55:15",
    "speaker" : "Steve",
    "text" : "Yeah, I think he definitely goes for it, blobs and pants, and has done pretty fucking good with not much in Tennessee."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, no, that that offense he's put together is way better than what the Patriots have right now, right?",
    "timestamp" : "55:16-55:21"
  },
  {
    "speaker" : "Tim",
    "text" : "It's just way better than what it should be. I mean, I think they've scored over twenty points, so have they? I think so.",
    "timestamp" : "55:22-55:28"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "55:32-55:37",
    "text" : "Well, you know what has really come true? My uh my hot take that Ryan Tanner fucking sucks."
  },
  {
    "timestamp" : "55:37-55:41",
    "text" : "Yeah, but you also said that about Josh Allen and that's just getting darker and darker.",
    "speaker" : "Greg"
  },
  {
    "text" : "One for two is pretty good for hot takes, all right? Yeah, um 50%.",
    "speaker" : "Steve",
    "timestamp" : "55:42-55:48"
  },
  {
    "timestamp" : "55:49-55:52",
    "speaker" : "Andy",
    "text" : "Steve Steve waited out uh Tannehill. He'll he'll wait out Josh Allen till he falls."
  },
  {
    "text" : "Yeah, yeah",
    "timestamp" : "55:53-55:53",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "55:54-56:02",
    "speaker" : "Andy",
    "text" : "I mean the guy does turn the ball over a lot, so just wait just wait till his uh his legs give out on him and he can't outrun the defense."
  },
  {
    "timestamp" : "56:05-56:08",
    "text" : "He can't keep taking those body shots.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Speaking of nepotism, you know what I fucking hate is these big college basketball coaches that have their son as like the tenth guy on the bench. And it's like this fucking, it's like garbage time, and they bring out this darky white guy that's out there like just strictly shooting threes. He's not like that. Yeah, and it's like Oh my god, dude. This kid never would get into this program if his dad wasn't the head coach.",
    "timestamp" : "56:09-56:33"
  },
  {
    "timestamp" : "56:33-56:40",
    "speaker" : "Andy",
    "text" : "Do you know what my favorite part of Greg's nepotism thing is? You wouldn't be on this podcast if it weren't for you or my brother."
  },
  {
    "text" : "I'd have a lot more free time and I'd be fucking happy as a fucking kid. Because this takes up so much time, Greg.",
    "timestamp" : "56:41-56:47",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:47-56:48",
    "text" : "Right."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "56:48-56:49",
    "speaker" : "Greg"
  },
  {
    "text" : "Uh Greg does all the work on this podcast for sure.",
    "timestamp" : "56:49-56:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That's right. Don't tempt me, Andy. Poor Greg.",
    "timestamp" : "56:51-56:57"
  },
  {
    "text" : "In the killer, but don't push him. But I want to go back to Greg talking about how um in this, you know, the the the modern NFL has passed Belichick by because he focuses on the run game and the defense. Um, and the reason I was asking, like, how far back does the modern offense go is because in 2018 they won a Super Bowl. By holding the, I think, the seventh highest scoring offense in NFL history to three points when their offense put up their team. And they did it on their ground.",
    "speaker" : "Andy",
    "timestamp" : "56:57-57:31"
  },
  {
    "text" : "Yeah, but that's that's kind of an aberration of what that team was.",
    "speaker" : "Greg",
    "timestamp" : "57:31-57:35"
  },
  {
    "timestamp" : "57:36-58:04",
    "speaker" : "Andy",
    "text" : "It wasn't because that team was it started off as a as kind of a quote unquote modern offense, throwing the ball all around the yard, but then every all their wide receivers got hurt, and then like right at the end of the season, they converted into a power run game against The Bills and the Jets, and then Sonia Michelle just like scored the most uh playoff touchdowns of any rookie running back in the history of the NFL. on their way to winning a Super Bowl."
  },
  {
    "timestamp" : "58:04-58:33",
    "speaker" : "Tim",
    "text" : "But again, that that has to do with offensive line. And in you're saying the modern NFL uh the modern NFL offense is based off an offensive line. They had a good offensive line. That's what that. Right. So it so Belichick should already know that and why hasn't he why would he take a shot at Cole Strange versus, you know, what I don't know who I I can't I don't know from that specific draft, but so you're saying the offensive line is important."
  },
  {
    "text" : "in the modern NFL.",
    "timestamp" : "58:33-58:34",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Tim",
    "text" : "Very important.",
    "timestamp" : "58:35-58:36"
  },
  {
    "timestamp" : "58:36-58:45",
    "speaker" : "Andy",
    "text" : "But you're Ragnaron Belichick for drafting an offensive lineman in the first round. Because he he picked the wrong."
  },
  {
    "speaker" : "Tim",
    "text" : "If you look around the league, uh that draft In the war room for the Rams, when they made that pick, they out loud laughed because they were expecting him to be a fourth round pick. Like why are you taking a shot on someone that's on someone?",
    "timestamp" : "58:47-59:01"
  },
  {
    "text" : "Because it came out after the draft a bunch of people had him in the second round that would have picked before the Patriots and uh that was actually a run on guards. So he was the next best.",
    "timestamp" : "59:01-59:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "59:12-59:14",
    "speaker" : "Greg",
    "text" : "Andy, I got some bad news, dude."
  },
  {
    "speaker" : "Andy",
    "text" : "What's that, bud?",
    "timestamp" : "59:14-59:14"
  },
  {
    "text" : "The twenty eighteen we had the F fifth ranked offense and the twenty-first ranked defense.",
    "timestamp" : "59:15-59:21",
    "speaker" : "Greg"
  },
  {
    "text" : "In what regard yards Yards doesn't matter, Greg.",
    "speaker" : "Andy",
    "timestamp" : "59:21-59:27"
  },
  {
    "timestamp" : "59:27-59:39",
    "speaker" : "Greg",
    "text" : "Yards doesn't matter. Give me points. Well, was it points? All right, fourth and seventh. Fourth and seventh? So the offense. Oh. Oh, for the offense. A fourth ranked offense, Andy. That's the point."
  },
  {
    "timestamp" : "59:40-59:59",
    "speaker" : "Steve",
    "text" : "But Greg, Greg is also missing the can't win without a good offense. You remember that Rams Chiefs game that year? Yeah, exactly. Where they were just it was it's incredible. It was one of the most it might have been one of the best NFL games of all time regular season, right? Where they were just it was electric."
  },
  {
    "timestamp" : "59:59-01:00:01",
    "speaker" : "Andy",
    "text" : "Was it 54 to 50 or something ridiculous?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, something like Yeah, the Patriots held that offense to three points. Right. Yeah, but you have to but match that up and his defense then. That was double check. That was Clock control, that was the punter who probably should have been the fucking NPC. Exactly. I am I am also like that was how what year that was 2019? I was fucking Fucking three to four years ago, that's a while ago, where it's only gotten more that way. It's only gotten more into the 54-52. Side of things and Belichick has leaned into the success of that 19th Super Bowl of clock control solid defense. And I'm on the team of I don't know if he can win that way anymore.",
    "timestamp" : "01:00:01-01:00:53"
  },
  {
    "text" : "And to get to that Super Bowl, they beat the Chargers 41 to 28, and then they beat the Chiefs 37-31. Like those games don't happen without Brady. You don't get to that Super Bowl without Brady. The reason they won the Super Bowl is because Brady, maybe not specifically that game. But the reason you had a a good team and you got to the Super Bowl is because of Tom Brady.",
    "timestamp" : "01:00:54-01:01:17",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:01:18-01:01:19",
    "speaker" : "Andy",
    "text" : "And Bill Belichick."
  },
  {
    "text" : "Yeah, I think you could say Belichick won the Super Bowl. that specific game with his game planning and his defense. But again, you can't get the like the Patriots do that every now and then where they have a really good game against a good team and you're like, oh, this looks like we can compete. But Over the length of a season, it's just not sustainable to play.",
    "speaker" : "Greg",
    "timestamp" : "01:01:20-01:01:38"
  },
  {
    "text" : "Greg's got to the point of like that specific formula worked in that game. And the as hard as this to talk about, the other side of the coin is that shit worked on us in 2007. Right?",
    "timestamp" : "01:01:38-01:01:51",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:01:51-01:01:52",
    "speaker" : "Tim",
    "text" : "Yep. Yeah."
  },
  {
    "text" : "And it can work, but like the full game, the full season to get there, the to even be",
    "speaker" : "Steve",
    "timestamp" : "01:01:54-01:02:00"
  },
  {
    "text" : "In that game in itself, you need to be able to fucking Yeah, it's like Belichick's a master game planner, but you can't game plan every game. You know? Just from time restriction. You can't sit there and like, yeah, re-coach everything. Yeah.",
    "timestamp" : "01:02:01-01:02:19",
    "speaker" : "Greg"
  },
  {
    "text" : "I mean I I think it just goes back to Balichek is a defensive-minded head coach. Like that's his skill set. And so he goes out I I mean I think historically he's gone out and found an offensive coordinator who I I it feels like has free reign of the offense, right? I mean we see a change from free reign of the offense with the players that Belichick has picked.",
    "timestamp" : "01:02:20-01:02:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "That is, I think, the core of the issue, which has worked. I mean, Belichick has picked some awesome players, and he's gotten lucky over the years with the Brady pick. With a Grom pick, even right? Like he's got he's had some hits, some misses, whatever, whatever, whatever, but I would love to see a GM in a different offensive system and then let Belichick be the coach and own the defense",
    "timestamp" : "01:02:45-01:03:15"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean I have to imagine that the offensive coordinator and probably at the time Brady had some say in who they were bringing in for the offense. You know that's not just putting his foot down and being like, no, we're we're drafting fucking this offensive line from somebody. They sit down as a as a what?",
    "timestamp" : "01:03:16-01:03:36"
  },
  {
    "timestamp" : "01:03:36-01:04:00",
    "speaker" : "Greg",
    "text" : "You know what's interesting about the draft is how good It was and then there's it like just started being bad all of a sudden. Like especially like the front end. Like I I have the the pics in front of me like from 04 I guess even go oh one. It's it's like Richard Seymour, Vince Wilfork, Logan Mankins, Brandon Merriweather, Gerard Mayo, Devin McCourty, Chandler Jones, Dante Hightower."
  },
  {
    "timestamp" : "01:04:01-01:04:05",
    "speaker" : "Andy",
    "text" : "He wasn't the GM at some of those times. Well what do all those have in common too though?"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "01:04:05-01:04:11",
    "text" : "I don't think he was GM until like a couple of years after he started because wasn't Scott Pioli the the"
  },
  {
    "timestamp" : "01:04:12-01:04:19",
    "speaker" : "Steve",
    "text" : "No PD is GM from the get, wasn't he? Yeah, so he was still coach and GM."
  },
  {
    "timestamp" : "01:04:19-01:04:21",
    "speaker" : "Andy",
    "text" : "Yeah, that was a reason he took the job, I thought."
  },
  {
    "text" : "Yep.",
    "timestamp" : "01:04:21-01:04:22",
    "speaker" : "Steve"
  },
  {
    "text" : "But yeah, I think Peoli was part of the",
    "speaker" : "Andy",
    "timestamp" : "01:04:22-01:04:24"
  },
  {
    "speaker" : "Steve",
    "text" : "He's had some big time uh Pioli uh Dimitrov who went to the Falcons and who he beat in the Super Bowl um John Robinson at the Titans. There's been some big time uh Nick Cassero, big time personnel guys who are never GM, that's why they left because they weren't GM. They wanted to go to the GM role.",
    "timestamp" : "01:04:24-01:04:44"
  },
  {
    "timestamp" : "01:04:45-01:05:00",
    "speaker" : "Greg",
    "text" : "So who left in 2012? Yeah, you tell me. That's great. Because there's a pretty steep drop after that. Because then it goes Dominic Easley, Malcolm Brown, Isaiah Wynn, Sonny Michelle, Nikhil Harry, Mac. Jones, Cole, Strange, Christian Gonzalez."
  },
  {
    "speaker" : "Andy",
    "text" : "But I think from like Isaiah What Robinson.",
    "timestamp" : "01:05:00-01:05:03"
  },
  {
    "timestamp" : "01:05:04-01:05:05",
    "speaker" : "Steve",
    "text" : "Isaiah Robinson."
  },
  {
    "speaker" : "Andy",
    "text" : "I think Nikhil Harry and Sonny Michelle, I think that was the Patriots. trying to give Brady some weapons on offense at the top of the draft to kind of maximize that last window. Because if you look before that, like you were talking about those those early 01 through 04 drafts or all the way through, what do all those picks have in common? They're either offensive linemen or they're defensive players. Because that's what Belichick knows best. That's how he builds his team Right? A good offensive line and a good defense. And then, you know, you can say let Brady figure out the rest on offense. Um, because one, the offense was built that way and Brady thrived in it. Um And that has worked for 20 years. But then yeah, I think there was this kind of it felt like a shift in philosophy where they started drafting weapons and You know, everybody on Twitter's like, oh finally Belichick s started drafting weapons in the first round and it didn't fucking work. Well it did. They won one more Super Bowl, but it kind of like Now look at it, that their offensive lines a bit in shambles and kind of was in twenty nineteen, which I I think is part of why Brady left. Because you start Marshall Newhouse in your background and you could tell Brady was frustrated because he just couldn't trust that his protection would hold up to be able to do what he normally does.",
    "timestamp" : "01:05:05-01:06:29"
  },
  {
    "text" : "But that goes back to Belichick, right? If he's the GM.",
    "speaker" : "Greg",
    "timestamp" : "01:06:31-01:06:34"
  },
  {
    "text" : "Yeah. Andy, would you would you want Belichick the GM going forward?",
    "timestamp" : "01:06:35-01:06:39",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:06:39-01:06:40",
    "speaker" : "Andy"
  },
  {
    "text" : "You want him you want him buying the groceries? What about the judge? I'm interested to see what the judge says on this.",
    "timestamp" : "01:06:41-01:06:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:06:51-01:06:56",
    "speaker" : "Tim",
    "text" : "Uh I disagree. I don't think that he should be buying the groceries anymore."
  },
  {
    "speaker" : "Steve",
    "text" : "I I am also I'm open to a one patriot's place.",
    "timestamp" : "01:06:59-01:07:06"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:07:06-01:07:08",
    "text" : "I don't think we have to, right."
  },
  {
    "speaker" : "Steve",
    "text" : "I want I want I want B B. Cause it's my point is Big picture long-term, like you can't have one dude doing both. And the last thing you're gonna take away from him is coaching. You definitely don't want him to stop coaching and be a full-time GM. you're not gonna fire someone so how is your transition gonna go it's gotta be like okay bb like we're gonna have a gm come in here you can pick them i don't give a shit like find the guy you want get one of your homies back i don't care but like We need to split this role.",
    "timestamp" : "01:07:08-01:07:44"
  },
  {
    "timestamp" : "01:07:45-01:08:07",
    "speaker" : "Andy",
    "text" : "I got a question. To your point, I just I just want to say in 2019 Uh they started Isaiah Wynn at left tackle uh as a rookie. And I think he started off okay, but then he went down. They had to get Marshall Newhouse. They were starting Ted Karras at center because um David Andrews, didn't he have like a Something with his blood or something ridiculous. Remember that?"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "01:08:07-01:08:16",
    "text" : "We talk about injuries again, Andy. Yeah. Everybody gets injured. But he that's that's Andy's main point and as a Yeah, like uh like how do you GM around that?"
  },
  {
    "speaker" : "Andy",
    "text" : "Like okay, everybody gets injured, so what do you do?",
    "timestamp" : "01:08:16-01:08:18"
  },
  {
    "text" : "That's part of the how do you build the next man up?",
    "timestamp" : "01:08:20-01:08:22",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:08:25-01:08:29",
    "text" : "Stop making it. Works for Andy Reid. He figures it out."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:08:32-01:08:34",
    "text" : "He doesn't win as many Super Bowls."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, no, yeah. Theoretical question. Tim brought up something earlier that I want I would wanted to see what you guys think. Does Belichick have a big ego?",
    "timestamp" : "01:08:37-01:08:49"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't think anybody knows.",
    "timestamp" : "01:08:49-01:08:50"
  },
  {
    "timestamp" : "01:08:52-01:08:56",
    "text" : "I think I think what audience is the real question.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:08:57-01:08:59",
    "text" : "Just in general, like in NF, in NFL circles."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:09:00-01:09:18",
    "text" : "Well throw the media out because obviously if we brought Belichick on this podcast, he would have an absolute massive media go out and tell us to go fuck ourselves and he's above us. But internally with players, I don't think I think you guys are way off on the he can't relate the younger players."
  },
  {
    "text" : "All right, so Steve, all right. So you were talking about uh Andy was talking about how um he'll he'll have a player go test the market and then come back to them. So I think it was uh uh I don't know when it was but when Lawrence Guy uh went to go test free agency. He had a number for Belichick. Belichick gave him a number, told him to go test free agency. He didn't he went out to the market, didn't get what he wanted, came back. And then Belichick said, yeah, the offer's no longer on the table. Go fuck yourself. You can you can take less or you can, you know, do whatever. You think that has an ego or do if a guy relates to the to his team, does does he, you know At least give him the offer that he presented at first. Or someone fumbles and they get benched for the year.",
    "speaker" : "Tim",
    "timestamp" : "01:09:19-01:10:05"
  },
  {
    "speaker" : "Steve",
    "text" : "Reinforcing my point of the difficulty that Del Czech faces serving both roles of On one hand, he has to talk about the same thing. Steve, you have that one example I just want ego, Steve.",
    "timestamp" : "01:10:06-01:10:20"
  },
  {
    "timestamp" : "01:10:20-01:10:46",
    "text" : "Does he have any ego? Stick on that one thing. Do you not think that's a little bit egotistical for you? Say that I'm I'm your boss and you're like, hey, you know, I don't think I'm getting paid enough. Um, my contract's up, uh, but you know, I want to get paid a little bit more. And I say, all right, Steve, go ahead, go check it out. And then you're like, yeah, I didn't find anything. Like, and I go, yeah, well, now I'm paying you fifty dollars less. You're gonna make less money now. How the fuck are you gonna feel? You gonna think I have an ego or no?",
    "speaker" : "Tim"
  },
  {
    "text" : "Well first of all, if you're my boss, I'm quitting anyways. I don't want to sleep on the goddamn streets. Well second of all this is Yuriha here you're reinforcing the issue of having Belchek",
    "timestamp" : "01:10:46-01:11:08",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:11:08-01:11:20",
    "text" : "Stop saying that, Stan. You're dancing around. You're dancing around. You're i i is that am I not egotistical in some way if that Just hypothetical scenario I just presented is presented to you. No, it's just business.",
    "speaker" : "Tim"
  },
  {
    "timestamp" : "01:11:20-01:11:21",
    "text" : "It's not ego.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "It's like that's just money. That's business.",
    "timestamp" : "01:11:21-01:11:23"
  },
  {
    "text" : "Managing salary cap. That's what I'm actually doing.",
    "timestamp" : "01:11:25-01:11:27",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:11:32-01:11:32",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:11:32-01:12:01",
    "text" : "There's over there with their livelihoods at stake and their families and this money that they're making and they're putting their lives online, literally putting their lives online to play this game for money. And it's when you're a coach, it's like and the GM is making those decisions because they oh fuck man John Robinson's real piece of shit. I'm Pete Carroll. Like You know, John Robinson's giving you 50 cents on the dollar. Yeah, but that's not what we're talking about, Steve."
  },
  {
    "text" : "You can still be like, hey, I respect you. Go get money. I respect you. This offer stands if you come back. And then if you're not a prick, when he comes back, you go, here's the deal. All right, good. Instead of being like, no, fuck it.",
    "speaker" : "Greg",
    "timestamp" : "01:12:01-01:12:15"
  },
  {
    "speaker" : "Steve",
    "text" : "Pre-carol can't sing the big thing. Like it's just that one instance. I'm talking about that one instance. Cool. As a GM, it's a totally different fucking thing, but like this is where I think we're struggling because the the worlds are blended.",
    "timestamp" : "01:12:15-01:12:32"
  },
  {
    "timestamp" : "01:12:32-01:13:09",
    "speaker" : "Tim",
    "text" : "I'm not struggling. I'm not struggling to answer the question, Steve. Do not think it's a prick move for someone to say you this this offer is here and then you go do what I said is fine for you to do. You come back and I say you're not getting that same deal. It's not like that anymore. That's like the fucking mafia dude. Watch any episode of the sopranos, it's with the same fucking thing. I I think he's kind of reproofed. It's dickish to be like, this offer's on the table. You come back and you have you didn't find anything better. So I'm like, all right, yeah, well the deal's changed now."
  },
  {
    "timestamp" : "01:13:09-01:13:48",
    "speaker" : "Steve",
    "text" : "Well that's I mean at the end of the day it's that's business, right? It's true though. That's fucked up the problem of Bilichek has to say that and then fucking say it Steve So I I think it's one thing to say John Robinson, wow what a piece of shit, you know, I'm big Carol and like we really fucked you over. But don't worry, I'll I'll get you, you know, we'll we'll coach you up and you'll make some money in your next contract. You can't say that if you're Bell Bell check when I just fucked you on the salary cap because all I care about is longevity over five years and not this year. And now I have to coach you."
  },
  {
    "text" : "All right, Andy, what do you got?",
    "speaker" : "Greg",
    "timestamp" : "01:13:48-01:13:49"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:13:49-01:13:52",
    "text" : "There's value in having those two roles separate."
  },
  {
    "text" : "Steve, you already made that point. We know.",
    "speaker" : "Greg",
    "timestamp" : "01:13:52-01:13:55"
  },
  {
    "text" : "Crack another chorus, buddy.",
    "speaker" : "Tim",
    "timestamp" : "01:13:58-01:14:00"
  },
  {
    "timestamp" : "01:14:00-01:15:17",
    "text" : "I think that there's been plenty of examples of Belichick altering deals in players. Favor. Like they literally just did it with uh Trent Brown where they uh he was gonna miss some of his um To be earned, yeah, uh bonuses. So they they restructured it so that he would uh be more likely to hit them. And they do that a lot with you know if you miss it by a little bit at the end, they pay they pay you those bonuses anyway. Um But again, to I I think there is a bit of, you know, business is business. And there's been a lot of talk about how Belichick as a GM is kind of a hard ass in negotiations. Um, even players who love him. Like I love being coached by Belichick, but trying to get a new contract out of him was a pain in the tits because It is. It's all about the team. And so like at that part of it, I think he separates the business from the player, which is really hard to do when you're also the coach, to Steve's point. But That is the business side of things. Like Belichick puts uh a number on what he thinks you're worth. And then, you know If you want to go out and test that, that's great, but that number may change when you get back.",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know that but is is there an ego piece?",
    "speaker" : "Greg",
    "timestamp" : "01:15:17-01:15:20"
  },
  {
    "timestamp" : "01:15:21-01:15:25",
    "speaker" : "Andy",
    "text" : "I don't think it's not to that, no. To any of it."
  },
  {
    "text" : "No.",
    "speaker" : "Greg",
    "timestamp" : "01:15:25-01:15:26"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean everybody's got an ego at some. I mean, he's the winningest, second winningest coach in the history of the NFL. There's got to be some sort of ego about that. Right. Right. You you can't not have an ego about it.",
    "timestamp" : "01:15:26-01:15:36"
  },
  {
    "timestamp" : "01:15:36-01:15:57",
    "text" : "Right. But if you're if your thing is uh all everything is about the team, that ego needs to be checked at the door because that's exactly what you expect of your players. And I feel like that's what should be That's what he does do though. I don't think I don't think that's true though. I just I because just the way that he's running it the way that the watch the way that he interacts with the the media and all that kind of stuff.",
    "speaker" : "Tim"
  },
  {
    "timestamp" : "01:15:57-01:16:02",
    "speaker" : "Andy",
    "text" : "I just feel like that the media doesn't do anything for the the"
  },
  {
    "text" : "It works when you're winning, right? He does but he doesn't show any accountability and they're also uh look at the whole thing with the Malcolm Parker thing. What what do you mean whoa?",
    "timestamp" : "01:16:03-01:16:13",
    "speaker" : "Tim"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:16:13-01:16:20",
    "text" : "He doesn't show accountability. Whenever the team wins, he he puts all the praise on the players. And whenever they lose, he says it's my fault."
  },
  {
    "text" : "uh we didn't coach him up correctly yeah he doesn't he just goes you know we need to play better and coach better and we need to do the yeah but like even even on the media is taking all the heat off the players like the player if you go to New England you don't have to talk to the media",
    "timestamp" : "01:16:20-01:16:33",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:16:33-01:16:34",
    "speaker" : "Steve",
    "text" : "That's part of the culture."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, but what if you want to? Then you can. Country Born doesn't build your brand, your own personality. Country Born does it go to the team. Yeah, and look what happened to him last year. You couldn't see the field. There's our best player.",
    "timestamp" : "01:16:34-01:16:51"
  },
  {
    "text" : "There's a little bit of Gronk. Gronk is what we tested at the most.",
    "speaker" : "Steve",
    "timestamp" : "01:16:51-01:16:54"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:16:55-01:17:22",
    "text" : "I don't know. I see to me it's and Brady. There's a high degree of control in in the Patriots organization, right? They want to control a lot of things and it's my way or the highway. And that works when you're winning because no one can say shit because you're winning and the culture works and the team is above everything because the team is winning. But once you start losing, that shit falls apart real quick. Because the players only respect it if it wins."
  },
  {
    "text" : "That's every franchise. And I don't know. I I'm more about Exactly.",
    "timestamp" : "01:17:23-01:17:30",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:17:30-01:17:33",
    "text" : "What held that together was Tom Brady, is what I'm saying.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "No, no, I'm way more about keeping that fucking excellence. I'm way more about keeping that stand of excellence than let people just fucking go buck and say whatever the fuck they want.",
    "timestamp" : "01:17:33-01:17:43"
  },
  {
    "timestamp" : "01:17:43-01:18:09",
    "speaker" : "Greg",
    "text" : "Yeah, I know, but they but if you're not winning, it's gonna fall apart. Right? That's why like Patricia tries to do that shit in Detroit and it's like everyone's like this isn't bad. All of our coaches, right? They go otherware and they try and institute this culture. I'm in charge, my way of the highway. We're fucking running wind sprints and it doesn't work because you don't have the legacy of the winds to fall back on to demand the respect and to demand people to conform."
  },
  {
    "text" : "But we do.",
    "speaker" : "Steve",
    "timestamp" : "01:18:10-01:18:11"
  },
  {
    "text" : "We do. But everybody But it's slipping because now we're starting to lose and it's like this could get worse before it gets better.",
    "speaker" : "Greg",
    "timestamp" : "01:18:11-01:18:18"
  },
  {
    "timestamp" : "01:18:18-01:18:23",
    "text" : "Yeah, but none of the players are are the ones Complaining about this though. Like I know but you just the media.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:18:24-01:18:25",
    "speaker" : "Greg",
    "text" : "Public about it, Andy."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:18:25-01:18:25",
    "text" : "Give it up."
  },
  {
    "speaker" : "Greg",
    "text" : "If the media says shit that the players think. That's definitely not gonna come out and say it because I they're still part of the team, right? There's no benefit to them to come out and complaining.",
    "timestamp" : "01:18:26-01:18:38"
  },
  {
    "speaker" : "Andy",
    "text" : "So in 2003 when they came out and said uh The the players hate their coach. He was talking for the team.",
    "timestamp" : "01:18:38-01:18:47"
  },
  {
    "timestamp" : "01:18:47-01:18:52",
    "speaker" : "Greg",
    "text" : "Dude, maybe there is a piece of that at that time is winning."
  },
  {
    "text" : "There were people that were definitely questioning Belichick at that time. That is definitely confirmed in.",
    "timestamp" : "01:18:53-01:18:56",
    "speaker" : "Tim"
  },
  {
    "timestamp" : "01:18:57-01:18:58",
    "text" : "Players?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Tim",
    "text" : "Yes. Who? I think um Ted Johnson has spoken out a lot about So don't chuckle at who it is. He's a player, yes or no? Yeah, he's a player. There are a lot of places. It doesn't that that's not the point. The point is were there players in that locker room questioning what Belichick was doing?",
    "timestamp" : "01:18:58-01:19:21"
  },
  {
    "timestamp" : "01:19:21-01:19:28",
    "speaker" : "Greg",
    "text" : "Yeah. And just the sniff test is there probably was because It was a questionable move. Yeah, I mean it worked out for him."
  },
  {
    "speaker" : "Tim",
    "text" : "He rolled the dice and it worked out for him. Yeah. But still, there it there was some validity to the fact that um Tom Jackson, what he said, that they some players hate him.",
    "timestamp" : "01:19:29-01:19:39"
  },
  {
    "timestamp" : "01:19:39-01:19:43",
    "speaker" : "Andy",
    "text" : "I mean you didn't say some players hate him."
  },
  {
    "speaker" : "Tim",
    "timestamp" : "01:19:43-01:19:43",
    "text" : "What did he say?"
  },
  {
    "speaker" : "Andy",
    "text" : "Did he just make it?",
    "timestamp" : "01:19:44-01:19:44"
  },
  {
    "text" : "Did he just make it up?",
    "speaker" : "Greg",
    "timestamp" : "01:19:47-01:19:48"
  },
  {
    "text" : "I mean very you just said that you just said that Ted uh Ted Johnson has an axe to grind, so does he hate Belichick?",
    "timestamp" : "01:19:48-01:19:56",
    "speaker" : "Tim"
  },
  {
    "timestamp" : "01:19:56-01:20:05",
    "speaker" : "Steve",
    "text" : "I I absolutely agree Yeah, he does, but not for not sure in 2003 some of their players were super unhappy or 2002."
  },
  {
    "timestamp" : "01:20:07-01:20:15",
    "speaker" : "Greg",
    "text" : "Your best friend Lori Malloy that's been to battle with you and won um games and he made that trade he"
  },
  {
    "speaker" : "Steve",
    "text" : "put his balls on the table and it worked out. And it worked out because they won. It's all works out because you win. But you know why they won't say I pause it to you. What's your what's your alternative here? What would you rather us do? Everybody can do whatever the fuck they want sort of thing? Bullshit. Come on. It works for McVeigh. I want to keep No, I want to keep that standard of excellence.",
    "timestamp" : "01:20:15-01:20:42"
  },
  {
    "text" : "No, fuck that. I want to hire Dion Sanders. I want to draft Deion's son. Number one overall and be like, yo, Dion. Fire firing Bill. Yuri.",
    "speaker" : "Greg",
    "timestamp" : "01:20:43-01:20:54"
  },
  {
    "speaker" : "Steve",
    "text" : "You want to tank? You want to trade away all our players and tank the shit out of the season and just what players do we have? Yeah. What players do we have?",
    "timestamp" : "01:20:54-01:21:02"
  },
  {
    "speaker" : "Greg",
    "text" : "Steve, what plays? The only two I want to keep are on IR.",
    "timestamp" : "01:21:02-01:21:04"
  },
  {
    "text" : "Greg, I got the perfect GM for you. His name is Jim Ursa. He's he's a cold sky. He's a lot of experience. You can get him in here. He can fucking do a bunch of goddamn pills. Take the shit out of the franchise and hopefully we have a guitar too.",
    "timestamp" : "01:21:05-01:21:18",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:21:20-01:21:22",
    "text" : "Nice job, Steve. Nice job.",
    "speaker" : "Andy"
  },
  {
    "text" : "That was I just like like That's what struggles for me is like the the burn it down guys is like what you mentioned earlier Greg of like we can't get it better than Belchick if we fired him",
    "timestamp" : "01:21:22-01:21:36",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:21:36-01:21:36",
    "text" : "Correct."
  },
  {
    "text" : "What the fuck are you gonna do?",
    "timestamp" : "01:21:37-01:21:38",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "We're gonna be bad. We're gonna be bad. And we have to accept that we're gonna be bad.",
    "timestamp" : "01:21:39-01:21:43"
  },
  {
    "timestamp" : "01:21:44-01:22:35",
    "speaker" : "Steve",
    "text" : "And we're not good enough. And we went to that fucking Titans game and we didn't even get in the goddamn stadium and they scored a touchdown and we heard them score a touchdown standing in line to get in the fucking stadium. When we get it to our steats and they score another touchdown, by the time we sit our ass down with a beer, we're down fourteen nothing. And we lost like I remember what was bad. It was like 40 to 7. That was the Tom Brady. They tried to throw the Philly special to him. Just fucking falls on his ass. And I wanted to leave in the fourth quarter. And you're like, what are you doing? You gotta take your lumps. You gotta sit here. You can't sit here and support the Patriots and not Yeah, and give up when it's like, you know, we're we're getting the shit kicked out of it and sit here and take our lumps and Yeah, but at the same time you have to admit when it's"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:22:36-01:23:30",
    "text" : "When it's not working and it's bad. Like to stick your head in the sand and be like, no, it's Belichick, he'll figure it out. We're gonna we're gonna next year's you know, it's like You have to call it like you see it. It's it's not working. I don't see optimism for it working. I don't think burning it down is gonna make it Maybe that does fix it quicker, but I think we owe something to Belichick, some respect that he's he's turned this franchise into one of the best in sports. And he kind of comes and he with that comes, he can do whatever he wants, right? And we have to be like, okay, but that doesn't mean we can't criticize them and say, hey, you're you're lagging behind the rest of the league right now. And there's other coaches that if I could make a trade, I would. I would. They're not gonna trade for where it's not gonna happen. So the other alternative is fire him and pick up a schlub off the street, which I don't think is a good idea either. But"
  },
  {
    "speaker" : "Steve",
    "text" : "Can we uh Andy, can you note the time frame on this and snip this? Because this might be the most rational, even-headed take Greg has ever had.",
    "timestamp" : "01:23:31-01:23:40"
  },
  {
    "text" : "Oh god.",
    "speaker" : "Andy",
    "timestamp" : "01:23:42-01:23:42"
  },
  {
    "timestamp" : "01:23:43-01:24:12",
    "speaker" : "Steve",
    "text" : "Because I absolutely 100% agree with you, Greg. You're totally right up like just because he's been great doesn't mean he's immune from criticism, but he's also earned the respect of That the longest leash of all time. I know, and we should have gave that respect to Brady. Because whatever it's been doing isn't working and my perspective is a new GM."
  },
  {
    "timestamp" : "01:24:13-01:24:15",
    "speaker" : "Greg",
    "text" : "Deion Sanders he should do it."
  },
  {
    "timestamp" : "01:24:16-01:24:19",
    "text" : "I don't want Belchak the coach replaced Lincoln Riley",
    "speaker" : "Steve"
  },
  {
    "text" : "No, no, don't throw me. Lincoln Riley's a fucking beast.",
    "speaker" : "Greg",
    "timestamp" : "01:24:19-01:24:22"
  },
  {
    "timestamp" : "01:24:23-01:24:25",
    "speaker" : "Steve",
    "text" : "Give me GM. Give me GM names."
  },
  {
    "timestamp" : "01:24:25-01:24:33",
    "speaker" : "Greg",
    "text" : "I don't know GM names. I know hate coaches though. Would you okay? Here's a question. Lincoln Riley right now."
  },
  {
    "text" : "No.",
    "speaker" : "Steve",
    "timestamp" : "01:24:33-01:24:33"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:24:34-01:24:35",
    "text" : "Why?"
  },
  {
    "speaker" : "Steve",
    "text" : "Because he's not as good as Belichick. Belichick is the best coach.",
    "timestamp" : "01:24:35-01:24:38"
  },
  {
    "text" : "Lincoln Riley and Caleb Williams.",
    "timestamp" : "01:24:38-01:24:40",
    "speaker" : "Greg"
  },
  {
    "text" : "And also, Belichick, the coach you He's not going anywhere because he's chasing the record.",
    "timestamp" : "01:24:40-01:24:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, Lincoln Riley and Caleb Williams starting week one next year.",
    "timestamp" : "01:24:46-01:24:50"
  },
  {
    "text" : "You don't have the fucking how do you need the first pick, bro?",
    "timestamp" : "01:24:50-01:24:53",
    "speaker" : "Steve"
  },
  {
    "text" : "By being terrible this year. I don't know. Probably.",
    "timestamp" : "01:24:54-01:25:04",
    "speaker" : "Greg"
  },
  {
    "text" : "I don't know. Are they playing on Thursday? Either way. The Bears have the number one and a number two pick. There's no way.",
    "timestamp" : "01:25:04-01:25:10",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "They do right now, but it's week four, Steve. But Lincoln Riley's the type of guy that would make me go, ooh. Because he's an offensive-minded coach that clearly can connect with players that has like has proven success across a few different competitive Environments, right? He's he's one at Oklahoma with Kyler Murray. He and he's made four different quarterbacks good. Right? So he's shown it's not just like the quarterback doing it.",
    "timestamp" : "01:25:11-01:25:42"
  },
  {
    "text" : "You want him as the offensive coordinator? You want him as your head coach?",
    "timestamp" : "01:25:42-01:25:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I want him as the head coach. How many uh quarterbacks has Nick Saban made? Good. In college.",
    "timestamp" : "01:25:46-01:25:51"
  },
  {
    "text" : "Yeah, I'll take Nick Saban too, if for that matter. If Nick Saban wants to jump to the codes, how many codes are you?",
    "speaker" : "Greg",
    "timestamp" : "01:25:52-01:25:59"
  },
  {
    "text" : "He's done that before. I think quarterback is your mire made good.",
    "timestamp" : "01:25:59-01:26:02",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I know. I'm not listening I'm not saying that it's gonna translate perfectly, but it's worth a chance, right?",
    "timestamp" : "01:26:02-01:26:08"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:26:10-01:26:10",
    "text" : "No."
  },
  {
    "timestamp" : "01:26:10-01:26:14",
    "speaker" : "Greg",
    "text" : "No Over an aging Belichick?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, give me give me a new GM to transition and infuse the talent with A different type of player that Belichick needs to adapt to.",
    "timestamp" : "01:26:15-01:26:26"
  },
  {
    "speaker" : "Tim",
    "text" : "I know, but he's not gonna want to do that. That's never going to happen. You're talking so unrealistic.",
    "timestamp" : "01:26:26-01:26:30"
  },
  {
    "text" : "Yeah",
    "timestamp" : "01:26:31-01:26:31",
    "speaker" : "Greg"
  },
  {
    "text" : "What would check do you guys in the history of the NFL? Yes, he is. And he's also in his mind also the greatest GM. He's not gonna just be like, oh, okay, I'm older. Um yeah.",
    "timestamp" : "01:26:32-01:26:43",
    "speaker" : "Tim"
  },
  {
    "timestamp" : "01:26:45-01:26:50",
    "speaker" : "Steve",
    "text" : "Are you if there's one part of his job you think he doesn't like doing, which part of it do you think it is?"
  },
  {
    "timestamp" : "01:26:50-01:26:53",
    "speaker" : "Greg",
    "text" : "I think he likes doing it all. I think he likes control."
  },
  {
    "speaker" : "Steve",
    "text" : "Okay, so like that's not what I asked. What part what Oh oh so now we're gonna do a jump around questions? Right?",
    "timestamp" : "01:26:53-01:27:00"
  },
  {
    "text" : "What now that's crazy stuff? And he probably doesn't even do it. I don't think he does.",
    "timestamp" : "01:27:00-01:27:09",
    "speaker" : "Tim"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't think he does it. He's like in South Park when they're like twisting their nipples. He's like, oh yeah, you're cut. You're so cut. Oh yeah. You can go find a better deal on the market and if you come back, this deal will still be here for you.",
    "timestamp" : "01:27:13-01:27:27"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, I'm sorry, Lawrence. Ooh, yeah. This deal is no longer valid. It's only for a new customer.",
    "timestamp" : "01:27:28-01:27:35"
  },
  {
    "speaker" : "Tim",
    "text" : "It's no longer on the table. But balls are on the table.",
    "timestamp" : "01:27:36-01:27:40"
  },
  {
    "timestamp" : "01:27:40-01:27:47",
    "speaker" : "Steve",
    "text" : "It's a new customer only. Have a new line I can give you. Oh you oh oh no."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:27:48-01:28:04",
    "text" : "Oh no. Oh no. Oh we're sorry. Oh, that's great visual there. All right, should we end on that? All right. Any closing arguments here?"
  },
  {
    "speaker" : "Steve",
    "text" : "Let's uh I love putting down um predictions that we never follow up on. So When do you think Belchek's last game he coaches is how far behind is he?",
    "timestamp" : "01:28:05-01:28:19"
  },
  {
    "speaker" : "Greg",
    "text" : "From Shula? Yes, 19. 19 minutes. 19. Jeez. All right, my answer is 2028 then.",
    "timestamp" : "01:28:20-01:28:29"
  },
  {
    "speaker" : "Steve",
    "text" : "2020. The last game, like week 17 or 19, whatever the NFL expends it to, 2028?",
    "timestamp" : "01:28:29-01:28:36"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:28:36-01:28:37"
  },
  {
    "timestamp" : "01:28:37-01:28:40",
    "text" : "And he doesn't do it for the Patriots? I was gonna do the same thing.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:28:40-01:28:46",
    "speaker" : "Greg",
    "text" : "He does it for the Patriots. And he gets it in that last week. He gets the record. That's win twenty."
  },
  {
    "speaker" : "Tim",
    "text" : "Yeah, so Andy's right. Uh Belichick's got two two ninety-nine and Shula has three twenty-eight. Yeah. 29. How old is he? 70 70?",
    "timestamp" : "01:28:48-01:29:01"
  },
  {
    "timestamp" : "01:29:01-01:29:02",
    "speaker" : "Greg",
    "text" : "Yeah, he's 70."
  },
  {
    "text" : "70? Yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:29:03-01:29:04"
  },
  {
    "speaker" : "Tim",
    "text" : "Pete Carroll's 72 and he looks 10 years younger than him.",
    "timestamp" : "01:29:05-01:29:08"
  },
  {
    "timestamp" : "01:29:08-01:29:40",
    "text" : "I can't stand Pete Carroll. Dude, watching him on that game dancing around after they had their like 12th sack against the Giants, and he's like hopping up and down on the sidelines. I was like, dude, fucking kill me. It's so enthusiastic, it's disrespectful. Like act like you've been there before, dude. Like the dude Detroit is dead and buried. Like their fans are at their lowest point ever. And fucking Pete Carroll's over there like, yeah guys, good job.",
    "speaker" : "Greg"
  },
  {
    "text" : "Like it's like that that face from him when they threw that pick in Super Bowl.",
    "timestamp" : "01:29:40-01:29:46",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I know. Yeah. I was so I was so like angered at him in that Super Bowl just because of his personality and how I didn't want them to win.",
    "timestamp" : "01:29:47-01:29:56"
  },
  {
    "timestamp" : "01:29:58-01:29:59",
    "text" : "Do you remember that, Greg?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "What, being pissed? I remember them panning to his face and I was screaming that TV. I was like, fuck you, P. Carol. Fuck you. And then they panned to Richard Sherman.",
    "timestamp" : "01:30:01-01:30:10"
  },
  {
    "timestamp" : "01:30:11-01:30:12",
    "text" : "I was like, fuck you, Richard Sherman.",
    "speaker" : "Mom"
  },
  {
    "text" : "He had a great face too. Oh, it's the best. The best. My cathartic.",
    "speaker" : "Greg",
    "timestamp" : "01:30:13-01:30:19"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "01:30:21-01:30:24",
    "text" : "Yes, so we we should do some closing arguments. Yes."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:30:26-01:30:35",
    "text" : "End of 2027 season. I think ball check. What coach of the Patriots? It's better than you guys think."
  },
  {
    "speaker" : "Tim",
    "text" : "I said 2025. 2030.",
    "timestamp" : "01:30:36-01:30:39"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, like on the sidelines. He leaves to run for president.",
    "timestamp" : "01:30:48-01:30:51"
  },
  {
    "text" : "Taking my talents to D seq.",
    "speaker" : "Tim",
    "timestamp" : "01:30:59-01:31:01"
  },
  {
    "timestamp" : "01:31:06-01:31:07",
    "speaker" : "Steve",
    "text" : "I think that might be where we ended."
  },
  {
    "text" : "Well yeah 2030 Belcheck for president.",
    "speaker" : "Andy",
    "timestamp" : "01:31:10-01:31:13"
  },
  {
    "text" : "For president, yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:31:13-01:31:14"
  },
  {
    "timestamp" : "01:31:14-01:31:25",
    "text" : "We'll get the shirts ready. All right. Well I think uh I I hesitate to ask, but Tim, are you gonna have a ruling on this?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "01:31:25-01:31:35",
    "text" : "Yeah, I'm gonna I'm gonna rule uh With uh with Andy and Steve's side since Steve like went on the fence. That's bullshit."
  },
  {
    "text" : "Yay yay",
    "speaker" : "Steve",
    "timestamp" : "01:31:36-01:31:37"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, I guess uh the only thing left to say then is um Tune in next week to see how much of a blubbering little bitch Greg is On the Patriots Dynasty Podcast. Tune in next week for another Patriots 10-point performance. See you later.",
    "timestamp" : "01:31:38-01:31:56"
  },
  {
    "speaker" : "Mom",
    "text" : "Some more screen passes, you know, and some draw plays on third and sixteen",
    "timestamp" : "01:31:56-01:32:01"
  }
]