[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:21-00:42",
    "text" : "Welcome back to the Patriots Dynasty Podcast. The podcast where we normally re-watch every game of the Patriots Dynasty. And tell you about them in full detail. It is me, your host, Andy Brown, and with me today are the brothers Brown, Steve and Greg, who are actually there together. How are you doing, boys?"
  },
  {
    "timestamp" : "00:42-00:46",
    "speaker" : "Steve",
    "text" : "Yeah, Craig paid me to be here. I'm only here so I don't get fined."
  },
  {
    "text" : "We have one microphone between the two of us. Two dudes, one mic. It should be a fucking eventful.",
    "speaker" : "Greg",
    "timestamp" : "00:46-00:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, you you boys gotta snuggle in close so we can hear you both. I want your heads to touch. Can you hear me now? Yes.",
    "timestamp" : "00:52-00:58"
  },
  {
    "speaker" : "Steve",
    "text" : "Is this God?",
    "timestamp" : "00:59-01:00"
  },
  {
    "timestamp" : "01:00-01:02",
    "speaker" : "Andy",
    "text" : "Oh God. This is great radio."
  },
  {
    "text" : "This is radio. I thought this is a podcast.",
    "timestamp" : "01:03-01:06",
    "speaker" : "Greg"
  },
  {
    "text" : "It is. That's a big type of radio.",
    "timestamp" : "01:06-01:08",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Two guys, one candy cane.",
    "timestamp" : "01:08-01:10"
  },
  {
    "timestamp" : "01:13-01:15",
    "speaker" : "Andy",
    "text" : "I I have so many questions, but none of them."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:15-01:22",
    "text" : "We're gonna meet in the middle, Andy. Okay. You ever seen Lady and the Tramp? Steve's the Tramp."
  },
  {
    "text" : "That feels right. You're no lady.",
    "timestamp" : "01:23-01:26",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know.",
    "timestamp" : "01:26-01:27"
  },
  {
    "text" : "You're supposed to be nice to me, Greg. It's Christmas.",
    "speaker" : "Steve",
    "timestamp" : "01:28-01:30"
  },
  {
    "text" : "Yeah, what the fuck, Greg?",
    "timestamp" : "01:30-01:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "The Christmas episode.",
    "timestamp" : "01:33-01:34"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes. So normally we would be redo redoing a game, but Uh I will put my hand up uh in full transparency. I have not had time to do any prep for this. So we are winging it today. We're doing a Christmas episode because it's almost Christmas. It is December 16th. So we're getting close. Tis the season. Tis the season. So uh yeah, I Greg had some ideas on what he wanted to do for for the podcast. So Greg, what do you got for us?",
    "timestamp" : "01:35-02:03"
  },
  {
    "text" : "Well, um I figure we could start by you telling me how you've been getting festive this year, Andy. Oh, that's a good question.",
    "timestamp" : "02:04-02:10",
    "speaker" : "Greg"
  },
  {
    "text" : "Um",
    "timestamp" : "02:10-02:11",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:13-02:59",
    "speaker" : "Andy",
    "text" : "Both. So let's see, this past weekend we had a Christmas brunch with some friends where I got to wear my Christmas onesie Oh, classic. Yep. The uh the one it's uh it's a naughty Christmas onesie. So it only gets to come out once a year. Uh and it says uh I have worn it in public before, but uh that is now frowned upon in this establishment. Because I am quote unquote an adult. And so I shouldn't be wearing that sort of stuff. And I may have to get retired because I don't know if we've announced this on the podcast, but I am my wife is pregnant and we are having our first child in the end of January. So uh it may have to get retired after that because it has swear words on it. And so we're not gonna teach this child swear words."
  },
  {
    "timestamp" : "02:59-03:02",
    "text" : "Your kid your kid won't be able to read till like 15.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "03:02-03:09",
    "speaker" : "Steve",
    "text" : "Yeah. What are those reindeers doing to each other? You know, they're just cuddling."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "03:10-03:20",
    "text" : "Yeah, no, they they they're very cuddly, the rangers on it. So so that's how I've gotten in the spirit. Um what about you guys? Steve is wearing his his Christmas hat right now already."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "03:20-03:32",
    "text" : "Yeah, I've been wearing this Patriot Santa hat every December, every single day of December for years now. It's great because Christmas time, no one knows you haven't showered. I just can't compare."
  },
  {
    "speaker" : "Greg",
    "text" : "I'm gonna say they do. Well it's not immediately obvious by viewing me. You're such a disgusting creature of habit. It's the worst. Well, I've been watching um tons of like shitty Hallmark Oh. Christmas movies. What's your favorite so far? Well, they're all the same. That's the thing. It is literally every every trope is in every goddamn one of them. It's the right one for me now. The uptight successful lawyer from the big city lawyer lawyer has to go to like a small town. And she meets like hardworking, humble guy. Who wears a lot of carpet. But they initially don't get along. And then there's always she has always some lie going on where she's pretending she's someone she's not. And then that's different everyone, but there's always a lie. And then she falls in love with him. And then he finds out about the lie. And then forgives her because it's Christmas. And then the whole shebang bang. There's always charity involved. Every single one of these fucking movies, they're holding some sort of charity function. And it drives me crazy. So should we write a Patriots themed one? Yeah. I feel like we could we could we could do that. The charity can be for kids who can't read good or do other stuff good as well.",
    "timestamp" : "03:32-04:54"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh god.",
    "timestamp" : "04:58-04:58"
  },
  {
    "speaker" : "Steve",
    "text" : "We could do it. We could do it. We do we didn't make a lot of progress on our other book project though.",
    "timestamp" : "04:59-05:03"
  },
  {
    "timestamp" : "05:04-05:05",
    "text" : "That's true. I still have that up though.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "05:08-05:10",
    "text" : "How many pages into it are you?",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh a page and a half.",
    "timestamp" : "05:10-05:11",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "For those that don't remember, this is our Bill Belichick erotic fiction.",
    "timestamp" : "05:11-05:16"
  },
  {
    "timestamp" : "05:16-05:21",
    "speaker" : "Andy",
    "text" : "Uh it's it's on my computer, it's Untitled Patriots Erotica is the name of the Untitled."
  },
  {
    "text" : "I thought we decided it was gonna be Bill Belchak.",
    "timestamp" : "05:22-05:24",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "05:24-05:29",
    "text" : "No, we decided that uh everybody writes a chapter, so you can take it wherever the hell you want.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Interesting.",
    "timestamp" : "05:29-05:30"
  },
  {
    "text" : "Mm-hmm.",
    "speaker" : "Andy",
    "timestamp" : "05:30-05:31"
  },
  {
    "timestamp" : "05:31-05:39",
    "speaker" : "Greg",
    "text" : "So I'm gonna sign myself up to do that and then not do it. Again. You already did. Yeah. You were supposed to go first."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, well nothing I feel like that we couldn't top that Cam Newton erobotica one, so I I'm uh fairly confident we could.",
    "timestamp" : "05:39-05:48"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "05:48-06:00",
    "text" : "What about a Christmas erotica? Because that's what's missing from these movies is penetration. Graphic penetration. Preferably by L's."
  },
  {
    "timestamp" : "06:01-06:05",
    "speaker" : "Andy",
    "text" : "And and penetration puns. There has to be lots of puns in there."
  },
  {
    "speaker" : "Greg",
    "text" : "Yes. Yes. Shitting holiday cookies. Alright, so what do we got in the docket here? We got We're gonna go over the Patriots um coldest games in history. We're gonna do uh A snake draft of Christmas songs. Oh. Did you prepare for that at all, Andy? I did not. Steve, did you?",
    "timestamp" : "06:05-06:27"
  },
  {
    "text" : "Did I I can't even remember a song's lyrics?",
    "speaker" : "Steve",
    "timestamp" : "06:27-06:29"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay. Well I guess I could just list mine because I have a bunch. Okay. We can do I can come up with some Christmas uh experiences too. You know, like a sleigh ride or something. You're gonna power rank them?",
    "timestamp" : "06:30-06:42"
  },
  {
    "timestamp" : "06:42-06:43",
    "speaker" : "Steve",
    "text" : "Yeah. Okay."
  },
  {
    "text" : "It's the same thing as a draft. Um, and then we can do some predictions for the rest of the year, as we're currently in week 15. And everybody knows once Christmas comes, that's when the NFL really gets serious. That's right. Yeah. That's when you the teams are who they're going to be. Yeah. Yes. The dregs filter to the bottom. Yes. Urban Meyer. Like the jackwise. Urban Meyer noted dragon. Yes. Noted bottom. Noted bottom.",
    "timestamp" : "06:43-07:16",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh my goodness. So so is that that has to be the first time a coach has gotten fired midway through his first season?",
    "timestamp" : "07:19-07:28",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh that's a good question. That is a good question. Not that I can remember.",
    "timestamp" : "07:29-07:33",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "He's the only one I can think of, but he he quit. He just left halfway through.",
    "timestamp" : "07:34-07:38"
  },
  {
    "text" : "Saban left after like a year and a half?",
    "timestamp" : "07:38-07:41",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "07:41-08:01",
    "speaker" : "Andy",
    "text" : "Something like that. Yeah. He didn't get fired though. So this may be I saw I saw a list of the short shortest terms of uh Head coach employment. Shortest on that list, Bill Belichick, one day head coach of the New York Jets. Oh yeah. Good point. It's pretty good."
  },
  {
    "timestamp" : "08:03-08:12",
    "text" : "Well let's use that as our launching point into the Patriots Cold's games or any of them more degrees than Urban Meyer has weeks coaching in the NFL.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Or has wins.",
    "timestamp" : "08:12-08:14"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "08:15-08:15",
    "text" : "Yeah."
  },
  {
    "timestamp" : "08:17-08:22",
    "speaker" : "Andy",
    "text" : "Okay, so let's see what we got. Yeah, I have a list here. I'm assuming, Greg, you have the same list."
  },
  {
    "timestamp" : "08:22-08:24",
    "speaker" : "Greg",
    "text" : "Yeah, you want to start at 10?"
  },
  {
    "text" : "Start at 10. Okay, where's number 10? Okay. I see I have two that are tied for ten.",
    "timestamp" : "08:24-08:28",
    "speaker" : "Andy"
  },
  {
    "text" : "You guys are looking at different list. Oh.",
    "speaker" : "Greg",
    "timestamp" : "08:29-08:31"
  },
  {
    "text" : "Yeah. Okay, good. All right. Um, so number ten. January 10th, 2015. Oh, this was a good one. This was not just one of the coldest games, but also one of the best games.",
    "timestamp" : "08:31-08:43",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, that's the down 14 twice, right?",
    "timestamp" : "08:44-08:46",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:47-08:52",
    "text" : "Yep. It's the uh New England Patriots, Baltimore, Ravens. AFC Divisional, I think it was."
  },
  {
    "timestamp" : "08:53-08:59",
    "speaker" : "Steve",
    "text" : "Yep. I think the the main name for this game is Edelman to Amandola."
  },
  {
    "text" : "Yeah. Yep. Or the when they ran the tight end package. Learn the playbook.",
    "timestamp" : "08:59-09:05",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, learn the playbook. That's right. Yeah. There's a bunch in this game.",
    "timestamp" : "09:06-09:09"
  },
  {
    "timestamp" : "09:08-09:10",
    "text" : "That game is awesome. Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "09:10-09:14",
    "text" : "Yeah. And the uh and the song that everybody's singing halfway through, too.",
    "speaker" : "Andy"
  },
  {
    "text" : "By the way, now to get us off track, but have you guys been watching Man in the Arena? I watched first two.",
    "speaker" : "Greg",
    "timestamp" : "09:15-09:21"
  },
  {
    "timestamp" : "09:22-09:26",
    "speaker" : "Andy",
    "text" : "I have not. I'm I'm saving them all, but I heard the fourth one was really hard to watch."
  },
  {
    "text" : "Oh dude, it's the best one though. Is it? Oh, it's so it's turn the lights it's better like it's better drama than the other ones. Like the other ones That's fair Probably because I've like re rewatched a bunch of how many Super Bowls so I kind of know all the plays. There's one for every Super Bowl. Okay. Oh really? Okay. Yeah. Yeah. So the one the 17 and one was.",
    "timestamp" : "09:26-09:50",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "09:50-09:54",
    "speaker" : "Steve",
    "text" : "I had forgotten six and we been to not every Super Bowl in one. Yeah."
  },
  {
    "timestamp" : "09:55-09:56",
    "text" : "18 and 1.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. So I'm gonna have to gear myself up for that, I think.",
    "timestamp" : "09:56-10:00"
  },
  {
    "timestamp" : "10:01-10:16",
    "text" : "It was it was uh it was a trip. But like there's one scene in the middle where they have they're playing Queens, another one bites the dust. As they're crushing through teams and it's just this sick montage. There's Goosebum City that I was like, pop, pop, pop, pop.",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh yeah. I'm excited to get to the 2007 season.",
    "timestamp" : "10:16-10:19",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "10:19-10:20",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Most of it.",
    "timestamp" : "10:20-10:21"
  },
  {
    "speaker" : "Steve",
    "text" : "But I'm not.",
    "timestamp" : "10:21-10:22"
  },
  {
    "speaker" : "Andy",
    "text" : "Such a great team.",
    "timestamp" : "10:22-10:23"
  },
  {
    "text" : "There'll be more men in the arenas made than Urban Meyer has weeks coaching.",
    "speaker" : "Steve",
    "timestamp" : "10:25-10:29"
  },
  {
    "timestamp" : "10:32-10:44",
    "text" : "Not if they're doing it for every Super Bowl. Yeah, they're gonna have to keep going, right? Also, Tommy gets a little cussy in it. He's he's dropping F bombs, dropping S bombs.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "10:45-10:45"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:45-10:52",
    "text" : "I can see him being a fiery character. Yeah, a couple hard R's. Wait, what? Just kidding."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "10:54-10:55",
    "text" : "Jesus."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:57-11:03",
    "text" : "All right, so number nine. Oh, do we want to say the temperature on that? Oh, 20 degrees."
  },
  {
    "speaker" : "Andy",
    "text" : "20 degrees.",
    "timestamp" : "11:03-11:04"
  },
  {
    "speaker" : "Steve",
    "text" : "This is game time. And both of those well at least what was the tide, the other tide one.",
    "timestamp" : "11:04-11:09"
  },
  {
    "timestamp" : "11:12-11:25",
    "text" : "Uh 2010. Patriots vs Ravens. Oh, that's when that was In the playoffs and they had uh Ray Rice first play. I think it was that cold. I think it was like sunny in the day.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "11:27-11:32",
    "text" : "But it's the difference. One was at night, like a nighttime playoff game. What was it daytime?"
  },
  {
    "timestamp" : "11:33-12:19",
    "speaker" : "Andy",
    "text" : "That was also, yeah, it's true. But that was also the uh first time Edelman was at Julian Edelman in that game. He had that he converted a fourth down on a wide receiver screen by like fighting through five guys. And then a call back for holding and then he converted it again. I had a boy Jules. Boy's a monster. Yep. So that's when I fell in love with Julian Ellen. Was that day? That was the only good thing to come out of that game. All right, number nine. Oh, I remember this game too. This was not a great game, I don't think. But I remember it being super fucking cold. December 18th, 2016, New England Patriots at the Denver Broncos, mile high. Game temperature. Game time temperature 18 degrees."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "12:19-12:20",
    "text" : "I don't remember this game at all."
  },
  {
    "speaker" : "Andy",
    "text" : "The same amount of degrees. This is, yeah, uh, I believe the only play of note in this was Um the Patriots recovering a muffed punt by the the Broncos early on and scoring a touchdown off of it and then like that was the only score. Yeah, the game ended 16-3. Not much in that.",
    "timestamp" : "12:21-12:38"
  },
  {
    "text" : "I feel like we're the ones. Muffin punts in Denver.",
    "timestamp" : "12:38-12:42",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, well, uh, that's probably on this list too. That might be a little higher, but Yeah, that was a rough game. Yeah, that's that's higher up. That's number 19. Yeah. That was the Brock Osweiler game.",
    "timestamp" : "12:43-12:58",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "12:59-13:00",
    "text" : "I don't want to think about that game.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "13:00-13:11",
    "speaker" : "Andy",
    "text" : "No. All right, well, um, we're sticking in Denver for number eight. Uh this is all the way back in 1991, so before uh Steven remembers football."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "13:11-13:13",
    "text" : "Oh, you remember this game, Andy?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:13-13:20",
    "text" : "All right. Uh this was probably the game where mom was yelling At the TV uh about John Elway rip his fucking leg off, I believe."
  },
  {
    "speaker" : "Steve",
    "text" : "He's young, Andy.",
    "timestamp" : "13:21-13:22"
  },
  {
    "text" : "It was not. No way Andy remembers this game. He was like five It could have been this game.",
    "timestamp" : "13:22-13:28",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "13:31-13:42",
    "speaker" : "Greg",
    "text" : "Steve Steve Young. Nineteen ninety one. Patriots lose 20 to 3 to the Broncos and John Elvin. Yeah. They're still in the old uniforms at this point."
  },
  {
    "text" : "Yeah, both, both teams, the old uniforms. Those are both some dope uniforms. I wouldn't mind seeing Denver coat go back to those, especially the helmets.",
    "speaker" : "Andy",
    "timestamp" : "13:42-13:49"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "13:51-13:57",
    "text" : "It's funny because they always tell us that the Earth is warming, but I've seen that in a lot of recent games have been called."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "13:58-14:03",
    "text" : "Or maybe Patriots are playing more games recently in January, February."
  },
  {
    "timestamp" : "14:07-14:10",
    "text" : "Yeah, because this this game from nineteen ninety one was December first.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "All right, number seven. New Year's Eve 2017 against the Jets. Game time temperature 13 degrees. Patriots win 26-6. Lock up home field advantage in the playoffs. Well, Bryce Petty. James Harrison gets two sacks from James Harrison.",
    "timestamp" : "14:12-14:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh I remember this game. Yeah, this was the game. The Jets had already given up on the season at this point. I remember that.",
    "timestamp" : "14:36-14:40"
  },
  {
    "timestamp" : "14:40-14:56",
    "speaker" : "Greg",
    "text" : "Yeah, they're starting Bryce Petty at the end. Of course they're fucking giving up. All right, number six, we got a uh 1977 Schaefer Stadium, 12. 7 degrees with a 1410 win against Miami."
  },
  {
    "text" : "That must have been tough to sit through. Yeah. Sitting on the metal bleachers.",
    "speaker" : "Steve",
    "timestamp" : "14:57-15:01"
  },
  {
    "text" : "Oh, that's just the Patriots of the 70s. The Patriots scored two touchdowns in the first quarter and then sat on the lead. Oh yeah, that was a slog. There was oh this was another uh low passing game though. There wasn't much passing involved for the Patriots as Steve Grogan finished six of ten on the day Similar to a game we've watched recently against the AFC East divisional foe compared to 51 handoffs.",
    "timestamp" : "15:01-15:28",
    "speaker" : "Andy"
  },
  {
    "text" : "51 running plays? Versus 10 pass.",
    "timestamp" : "15:28-15:31",
    "speaker" : "Steve"
  },
  {
    "text" : "How yeah. How many uh running plays did the Patriots run against the Bills this year?",
    "timestamp" : "15:32-15:36",
    "speaker" : "Andy"
  },
  {
    "text" : "42 or something like that.",
    "speaker" : "Steve",
    "timestamp" : "15:36-15:37"
  },
  {
    "timestamp" : "15:38-15:44",
    "text" : "Yeah, it's 40 something, yeah. That's what I thought. Man, 51 handoffs. That's just like that's the game plan.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Imagine watching that in person. It's freezing. It's what is it 13 degrees, you said? It's sitting on a metal bleacher. You scored two touchdowns earlier, you're all excited, and then they just hand the ball off the entire time the rest of the game. Just make it end.",
    "timestamp" : "15:45-15:59"
  },
  {
    "timestamp" : "16:00-16:08",
    "speaker" : "Greg",
    "text" : "I literally went to that game two weeks ago. Yeah, how was it? No, but I'm saying you just described the game I just went to."
  },
  {
    "text" : "You just wanted to be over. So miserable. No, I enjoyed it. Not bad.",
    "speaker" : "Steve",
    "timestamp" : "16:09-16:14"
  },
  {
    "timestamp" : "16:15-16:26",
    "speaker" : "Greg",
    "text" : "All right. Number five. 1989 Patriots hosting the Rams from Los Angeles. 12. 4 degrees. Twelve point four."
  },
  {
    "timestamp" : "16:27-16:30",
    "speaker" : "Steve",
    "text" : "Oh, the LA Rams before there, the new LA Rams."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:30-16:32",
    "text" : "Correct, yeah, like the original LA Rams."
  },
  {
    "text" : "Gotcha.",
    "timestamp" : "16:33-16:33",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Don't remember anything from that? Nope.",
    "timestamp" : "16:34-16:36"
  },
  {
    "timestamp" : "16:36-16:37",
    "speaker" : "Steve",
    "text" : "Well, Andy remembers it."
  },
  {
    "speaker" : "Andy",
    "text" : "Still a Grogan game.",
    "timestamp" : "16:37-16:39"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "16:42-17:04",
    "text" : "January 2005 at Pittsburgh. 11 degrees. Oh. So this was a playoff game. Oh yes. It would be all right. Oh this is the right. Because you're avenging the loss from when they broke up the street. Yeah, so we'll we'll get back to this one."
  },
  {
    "timestamp" : "17:04-17:06",
    "text" : "Doesn't Brady have the flu or something in this game too?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "17:06-17:20",
    "speaker" : "Greg",
    "text" : "They all do. Yeah. And Tom Brady said it's the best game that they ever played. Saying something to say, most complete 20 years. Most complete like ruthless victory."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "17:20-17:21",
    "text" : "Final score."
  },
  {
    "timestamp" : "17:21-17:24",
    "speaker" : "Greg",
    "text" : "41 to 27 pass. Oh."
  },
  {
    "text" : "Just a shit. And weren't they like 15 and 1 at that point too? They were like, they only had one loss. Rookie Ben Lost was very good.",
    "timestamp" : "17:24-17:30",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Rookie Big Ben Yeah, but I I don't think Ben Rothburg had lost a game in his career up to that point because that one loss was their first week of the season, and then he came in in the second game or something.",
    "timestamp" : "17:30-17:40"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "17:40-17:41",
    "text" : "I love that."
  },
  {
    "timestamp" : "17:42-17:43",
    "speaker" : "Andy",
    "text" : "Beautiful."
  },
  {
    "text" : "All right, number three. Do you remember this one, Andy? 1963, Boston Patriots.",
    "speaker" : "Greg",
    "timestamp" : "17:43-17:49"
  },
  {
    "timestamp" : "17:49-17:51",
    "text" : "I do. Like it was the back of my hand.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "17:52-17:59",
    "text" : "At Kansas City, 9. 2 degrees. Whoof. That's shellac 35 to 3.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "18:01-18:05",
    "speaker" : "Andy",
    "text" : "That's a miserable. Kansas City is like a sneaky cold place, I feel."
  },
  {
    "text" : "Right? It's kind of in the south, you'd think. Missouri. Kansas City's in Missouri. Well no, Kansas City's on in two states, isn't it? Well it's not in Kansas.",
    "timestamp" : "18:05-18:18",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "18:19-18:24",
    "speaker" : "Greg",
    "text" : "That's what. It's definitely That's why it's confusing. But it's on the border of Kansas and Missouri. Yes. Yep."
  },
  {
    "text" : "Wait, maybe I thought it was Missouri and Mississippi.",
    "speaker" : "Steve",
    "timestamp" : "18:24-18:27"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "18:27-18:46",
    "text" : "Mr. Sift to Yerv G. That Wrong geographical region altogether. Wow. All right, number two. We've gone over this one. January 10th, 2004, against the Titans. Game time temperature four degrees. Woof."
  },
  {
    "speaker" : "Steve",
    "text" : "And like these these like playoff ones are you know you know they're at late at night too.",
    "timestamp" : "18:47-18:52"
  },
  {
    "speaker" : "Greg",
    "text" : "They're not wind chill wind chill negative 11. That's right, I remember that.",
    "timestamp" : "18:52-18:58"
  },
  {
    "text" : "I remember this game being super physical too. Like everyone was hitting each other hard.",
    "timestamp" : "18:58-19:02",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "19:02-19:29",
    "speaker" : "Andy",
    "text" : "Yeah. This was the uh This is the game that uh Bethel Johnson got that long touchdown, wasn't it? Yeah, right to start it off. Yeah. I think Willie McGuinness was credited with a sack on um Whoever their tight end was at the time. Y check maybe? Because they th they threw a pass to him and like he stepped back as if he was gonna pass and he just didn't get blocked. So McGinnis. McGinnis got a sack on the tight end."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "19:29-19:57",
    "text" : "How about uh Friarmouth? Is there a better tight end name than Friarmouth? That's a good one. I thought it was Pfeiffermouth, but that's not Pfeiffermooth, no. Fire in it. Fryer motion. We gotta trade for that bastard. Yeah, that's a great name. He's really good. All right, number one, 1989, Patriots at Steelers, Three River Stadium, game time temperature 3."
  },
  {
    "speaker" : "Andy",
    "text" : "0 degrees. Yikes. I I'm pretty sure my my freezer doesn't get down to that temperature. That's fucking cold.",
    "timestamp" : "19:57-20:07"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "20:08-20:13",
    "text" : "So it's what? At Pittsburgh, at New England, at Kansas City."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "20:13-20:14",
    "text" : "Yeah."
  },
  {
    "text" : "It was really it. Denver at Denver. The surprises no at Buffalo.",
    "speaker" : "Steve",
    "timestamp" : "20:14-20:19"
  },
  {
    "speaker" : "Andy",
    "text" : "So am I, actually. I know there's been some cool games at Buffalo.",
    "timestamp" : "20:20-20:24"
  },
  {
    "text" : "We're at like Minnesota or something, I guess.",
    "speaker" : "Steve",
    "timestamp" : "20:25-20:27"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, at Buffalo's number 12. It's right outside the top 10.",
    "timestamp" : "20:28-20:31"
  },
  {
    "timestamp" : "20:31-20:39",
    "speaker" : "Greg",
    "text" : "1963. High for 17, 2013. Patriots versus Paint Manning. I was just at this game."
  },
  {
    "timestamp" : "20:39-20:46",
    "text" : "Oh yeah. That was it. Wasn't that the game where uh you're in the The nosebleeds and you had a beer and you had to drink it before it froze.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, I didn't finish it because it froze in my hand. And they were down twenty-four-nothing at halftime. And Mita was like, we're leaving. And I was like, let's give them one drive in the second half. Yep. And they came all the way back and won an overtime. They sure did. I think Welker muffed the pun that game, right? And over they took the wind. Was that ball in overtime?",
    "timestamp" : "20:46-21:11"
  },
  {
    "text" : "Yes, that's right. Right, right, yeah, yeah, because the pages took win.",
    "speaker" : "Andy",
    "timestamp" : "21:12-21:14"
  },
  {
    "timestamp" : "21:14-21:18",
    "speaker" : "Greg",
    "text" : "I don't think Wilkram muffed it, but he called off it late and it bounced and it hit somebody else."
  },
  {
    "timestamp" : "21:18-21:20",
    "speaker" : "Andy",
    "text" : "It hit somebody else, exactly."
  },
  {
    "speaker" : "Steve",
    "text" : "That was awesome. That's the worst thing. That's what I was saying. These are all like game time temperature coldest ranking, but like what is like the real feel?",
    "timestamp" : "21:21-21:29"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:29-21:33",
    "text" : "Well, what's the wind chill? It's not like they had real field back in the 70s."
  },
  {
    "timestamp" : "21:38-21:44",
    "speaker" : "Steve",
    "text" : "It's gonna be a lock holder from eight till midnight than it will from one to four. That's true."
  },
  {
    "text" : "That's a good point.",
    "speaker" : "Greg",
    "timestamp" : "21:44-21:45"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "21:46-21:50",
    "text" : "See that you hear that Andy? It's a given season. Greg's giving compliments."
  },
  {
    "speaker" : "Andy",
    "text" : "Not to me. You guys getting some snow up there, Andy? Uh we're supposed to get snow tomorrow, yes. Yeah.",
    "timestamp" : "21:50-21:57"
  },
  {
    "text" : "What are you gonna get?",
    "timestamp" : "21:57-21:58",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Saturday. Uh plowable is what they're calling it. Plowable.",
    "timestamp" : "21:58-22:02"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "22:02-22:04",
    "text" : "That's a good way to describe it. I guess, yeah."
  },
  {
    "text" : "Right.",
    "speaker" : "Andy",
    "timestamp" : "22:04-22:05"
  },
  {
    "timestamp" : "22:07-22:11",
    "text" : "He's all choked up about it. So happy. It's okay, Andy.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "22:13-22:28",
    "speaker" : "Greg",
    "text" : "Mm-hmm. Woo. All right. Christmas song snake draft. Okay. Kelly just walked by. He gave me the dirtiest look. I can't imagine why. He's a goddamn grinch."
  },
  {
    "timestamp" : "22:31-22:33",
    "speaker" : "Steve",
    "text" : "She is not wearing anything Christmas themed."
  },
  {
    "text" : "How dare she?",
    "speaker" : "Greg",
    "timestamp" : "22:34-22:34"
  },
  {
    "speaker" : "Steve",
    "text" : "Neither's Greg. All right.",
    "timestamp" : "22:35-22:36"
  },
  {
    "text" : "Oh um I'll start us off.",
    "timestamp" : "22:41-22:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:44-23:00",
    "speaker" : "Greg",
    "text" : "Yeah, yeah, you clearly have the most to gain or lose. With my first overall pick, I'm going with. Christmas in Hollis by Run DMC. Oh, that is the best one. Everybody knows it. Yeah, that's pretty good. It's not cheap. Well, it is cheesy, but it's kind of listenable It's a great song."
  },
  {
    "speaker" : "Steve",
    "text" : "All right. My second round pick is gonna be anything off the now. That's what I call Christmas.",
    "timestamp" : "23:01-23:07"
  },
  {
    "text" : "Well, you don't even know what it's called.",
    "timestamp" : "23:07-23:08",
    "speaker" : "Greg"
  },
  {
    "text" : "So and half of my lisa from that stuff.",
    "speaker" : "Steve",
    "timestamp" : "23:08-23:11"
  },
  {
    "timestamp" : "23:13-23:16",
    "speaker" : "Greg",
    "text" : "What is it called? Um a very special Christmas. Yes."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "23:17-23:20",
    "text" : "I feel like it's the same people who did the now, that's what I call whatever music was."
  },
  {
    "text" : "It's essentially the same thing where they got celebrities or like popular singers at the time to do. Yeah. Christmas.",
    "timestamp" : "23:21-23:27",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Which is where that run DMC song came from, right? Correct. From that album.",
    "timestamp" : "23:28-23:31"
  },
  {
    "timestamp" : "23:31-23:31",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "23:31-23:36",
    "text" : "Yes. So everything on that album is my second round pick. So good luck, Greg. Okay."
  },
  {
    "timestamp" : "23:36-23:49",
    "speaker" : "Andy",
    "text" : "I don't think you can do that. See I just did. Sir, for somebody who who says he's the most uh Christmas guy here, Steve. Yeah. Not being able to name one Christmas song is is not a good look."
  },
  {
    "timestamp" : "23:50-24:27",
    "speaker" : "Greg",
    "text" : "You guys are looking like schlubs. But you don't even have lights on your house. You don't even know it's Christmas too. Right? I bet you don't even have a Christmas tree up in your house. He doesn't. He he doesn't. Ha We're gone for two weeks. Oh, I I could be home for one day in December. I have a damn Christmas tree up. Okay. It's about putting it up. That's the fun part. Yeah, that's right. Drinking some nog, getting real eggy. Have yourself a very eggy Christmas. Okay, that's that's clearly great."
  },
  {
    "text" : "I'm gonna pick all I want for Christmas Is You, the Mariah Carey version. Yeah, I mean that's because it's the sexiest Christmas song there is.",
    "speaker" : "Andy",
    "timestamp" : "24:32-24:40"
  },
  {
    "timestamp" : "24:40-24:43",
    "text" : "Well, and it's just everyone loves that. Everywhere, yeah.",
    "speaker" : "Greg"
  },
  {
    "text" : "Okay.",
    "timestamp" : "24:43-24:43",
    "speaker" : "Andy"
  },
  {
    "text" : "You know how you know how popular that is, right, Andy? Yeah. Okay. All right. Yeah. Like she makes it's like it hits like the top ten billboards every single year. And she makes so much royalties off that thing. Oh yeah. Every single year. It's super catchy though. Like I you can be as tough guy as you want, but if you don't admit that that song slaps and Taylor Swift Shake It Off slaps, then you're lying to yourself.",
    "timestamp" : "24:43-25:05",
    "speaker" : "Greg"
  },
  {
    "text" : "You're you're sing along to both of them if you're in the car by the way.",
    "speaker" : "Andy",
    "timestamp" : "25:05-25:07"
  },
  {
    "speaker" : "Greg",
    "text" : "As soon as they come on, you're like, yes. I bet she does. Not one that slaps. Yeah, clearly not. We're not talking about it. All right, I'll do Santa Claus of the town. And he's going again.",
    "timestamp" : "25:09-25:22"
  },
  {
    "speaker" : "Steve",
    "text" : "Snake craft.",
    "timestamp" : "25:22-25:23"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "25:23-25:23",
    "text" : "Oh, that's right."
  },
  {
    "text" : "Yeah. It's a snake craft, Steve.",
    "speaker" : "Steve",
    "timestamp" : "25:26-25:27"
  },
  {
    "timestamp" : "25:28-25:29",
    "speaker" : "Andy",
    "text" : "Good lord."
  },
  {
    "text" : "We have to get like snakes involved.",
    "timestamp" : "25:29-25:31",
    "speaker" : "Steve"
  },
  {
    "text" : "So good at this. You're almost as good at this as you are at Christmas. Uh I'm gonna I'm gonna pick the uh the the chipmunks Christmas song.",
    "timestamp" : "25:32-25:40",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "25:42-25:48",
    "text" : "He's going opposite ends of the spectrum one. Exactly. The chipmunks are going to be a good one. The chipmunks one is so bad. But it's universally hated."
  },
  {
    "timestamp" : "25:49-25:53",
    "speaker" : "Andy",
    "text" : "Yeah, but if you're if you are under the age of 10, you fucking love that song until you turn 10."
  },
  {
    "timestamp" : "25:54-25:54",
    "text" : "Fair enough. Fair enough.",
    "speaker" : "Greg"
  },
  {
    "text" : "So I'm getting both ends of the spectrum here.",
    "timestamp" : "25:55-25:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Wait till you hear the shit I'm about to hit you with. Oh boy. Oh jeez. I'll stick with my Steve's up next. F",
    "timestamp" : "25:57-26:04"
  },
  {
    "text" : "I find that song weird.",
    "timestamp" : "26:05-26:06",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "26:07-26:40",
    "speaker" : "Greg",
    "text" : "Alright. Remind speaking of when you were 10. Remember in like chorus When you do Rudolph the Red Nose Rainier and they let you add the pizzazz lines in it. Yeah. You know? Like you'll go down in history like George Washington. Like Pinocchio. Yeah, the teacher used to like let you say you have to sing it once regular, and then she'd let all the kids sing it with his thought that was a real song. That was pretty good. Oh yeah. Shout out Walter F. Haig. Walter fuck. Walter Fucking Haig."
  },
  {
    "timestamp" : "26:42-26:47",
    "speaker" : "Steve",
    "text" : "That was the first name that guy. Walter? Walter F. Haig, yeah. All right, so it's me again."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:47-26:59",
    "text" : "All right, I am going to go with uh Maybe it's cold outside just because everyone hates that one."
  },
  {
    "speaker" : "Steve",
    "text" : "That was problematic, Craig.",
    "timestamp" : "26:59-27:01"
  },
  {
    "speaker" : "Greg",
    "text" : "Wicked problematic. I actually looked up the lyrics. Can you search this for me, Steve?",
    "timestamp" : "27:01-27:06"
  },
  {
    "text" : "Yeah, they're rough.",
    "timestamp" : "27:07-27:08",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Because I want to read a couple to you.",
    "timestamp" : "27:08-27:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:12-27:15",
    "text" : "It's just like ever so slightly rapey, which is the problem, I think. The whole thing's a lot of people."
  },
  {
    "speaker" : "Steve",
    "text" : "Kelly has a problem with it from downstairs. Yeah.",
    "timestamp" : "27:16-27:19"
  },
  {
    "text" : "Let's see.",
    "timestamp" : "27:22-27:23",
    "speaker" : "Greg"
  },
  {
    "text" : "I feel like it's like an old-time song though, right?",
    "speaker" : "Steve",
    "timestamp" : "27:25-27:26"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "27:27-28:11",
    "text" : "Yeah, it's super old timey, but she the whole premise of the song is like he's saying You should stay and she's like I should leave and then she says like say what's in this drink What's in this drink, dude? And she's like, I shouldn't go. And he's like, uh, well, maybe just a half a drink more. And then by the end, I'm pretty sure they bang. And she's like, I'm really gonna regret this one. Yeah. But and she's all like, what what will other people think? He's like, who the fuck cares? My sister will be suspicious and then his line is gosh your lips look delicious. This is probably pre-date rate drugs, though, right?"
  },
  {
    "text" : "It's creepy. I don't know. Yeah. What came out first, from hypnol or baby it's cold outside?",
    "speaker" : "Steve",
    "timestamp" : "28:11-28:18"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm not googling that. Look that one. All right, I'll bring his back.",
    "timestamp" : "28:18-28:25"
  },
  {
    "text" : "I'll take Jingle Bells, the classic.",
    "speaker" : "Steve",
    "timestamp" : "28:25-28:26"
  },
  {
    "speaker" : "Andy",
    "text" : "Jingle Bells, by the way. Steve. Alright, um I'm gonna take I don't know the name of it. I think it's just White Christmas. I'm dreaming of a white Christmas. Yes you did.",
    "timestamp" : "28:27-28:43"
  },
  {
    "timestamp" : "28:43-28:44",
    "text" : "No, I don't know that one key key goes.",
    "speaker" : "Steve"
  },
  {
    "text" : "Everybody knows it. That's all I know.",
    "timestamp" : "28:44-28:45",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know. I don't know that one key.",
    "timestamp" : "28:45-28:46",
    "speaker" : "Steve"
  },
  {
    "text" : "But I just sing that over and over again at Erin and she gets super annoyed at me every time it snows.",
    "speaker" : "Andy",
    "timestamp" : "28:47-28:51"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "28:51-29:01",
    "text" : "Yeah, he's really be a baritone in that one too, you know? He started a lot like you really get down deep with that."
  },
  {
    "text" : "Yeah, yeah, yeah, yeah. You have to sing it from your nuts Oh yeah. Otherwise it's not worth it. It's true. Some we're white nuts.",
    "speaker" : "Andy",
    "timestamp" : "29:01-29:07"
  },
  {
    "timestamp" : "29:08-29:13",
    "speaker" : "Steve",
    "text" : "Sure. Uh I'm gonna take that."
  },
  {
    "text" : "Greg, can you teach him how to do a snake draft? And you like it out? I haven't seen a single snake do anything. Uh and I'm gonna take uh basically any song from Trans Siberian Orchestra because they all sound the same, but they're all like heavy metal Christmas, and that is right up my fucking alley. That's a good one. That's a good one. Love that shit.",
    "timestamp" : "29:14-29:36",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:36-29:43",
    "speaker" : "Steve",
    "text" : "I'm gonna do the not problematic song that weird people find problematic, the mommy kissing Santa."
  },
  {
    "speaker" : "Greg",
    "text" : "Okay.",
    "timestamp" : "29:44-29:44"
  },
  {
    "timestamp" : "29:45-29:48",
    "text" : "Because you know there's some real weird people who are like, what?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "She's cheating on her husband? She's a she's a child. It's an odd concept for a song though. Until you get the data's Santa. Oh.",
    "timestamp" : "29:50-30:01"
  },
  {
    "speaker" : "Steve",
    "text" : "Correct or",
    "timestamp" : "30:09-30:10"
  },
  {
    "speaker" : "Greg",
    "text" : "No. Season of gaming, Greg, I'm giving you new information about that. See, but I was okay with it, even if it wasn't dad. Well yeah, you bang Santa too. Yeah, if it's just yes, you know, you gotta give Santa his props. You let Santa slip in your chimney. Yeah. Oh boy. I have two more here. So one of 'em super underrated. It's kind of a niche one. Christmas All Over Again by Tom Petty. No, yeah. I do love that. That song fucking rules. Underrated for sure. If you haven't heard it, go listen to it. And then my last one, I have This Is Our House by Gillette Stadium. Is that horrible song, baby? It's a holiday song for sure. It's a Christmas song. Okay. I'll give you that.",
    "timestamp" : "30:10-31:04"
  },
  {
    "text" : "I'll give you that.",
    "timestamp" : "31:04-31:05",
    "speaker" : "Andy"
  },
  {
    "text" : "Well, you know, this is when we start scoring touchdowns. That's correct. The Christmas season. And there's nothing better than when you fucking freezing cold at Gillette Stadium. And that's the case. And you're kind of shit-faced and you're just screaming this song. Kind of shit-faced.",
    "timestamp" : "31:05-31:19",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:20-31:26",
    "text" : "Oh my god. Coming from the guy who's seen the inside of the the Gillette Stadium drunk tank. Kind of shit-faced."
  },
  {
    "timestamp" : "31:27-31:29",
    "text" : "All right, Steve's turn.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I guess I mean I'm uh I'm gonna just list off all your favorite Christmas songs, Greg, because this is clearly a extra song.",
    "timestamp" : "31:29-31:35"
  },
  {
    "timestamp" : "31:35-31:36",
    "speaker" : "Greg",
    "text" : "I already gave all mine."
  },
  {
    "text" : "There we go. Isn't that how Snake Drafts end?",
    "timestamp" : "31:37-31:39",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "31:40-31:42",
    "text" : "Just fizzles out.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:44-32:05",
    "text" : "It eats its own tail. Yeah. I I will say one thing though. I can't stand the Jesus ones, you know, the gospel. Like what? Let's let's I think it's 2021. Let's get God out of the whole Christmas thing now, right? We all move on. Is this the hot take you've been holding on, Greg? Take Jesus out of Christmas.",
    "speaker" : "Greg"
  },
  {
    "text" : "Take Christ out of Christmas?",
    "timestamp" : "32:07-32:08",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, dude. You know your Jewish friends celebrate Christmas. Well would you rename it to me then? I don't think you have to rename it. It's named Christmas. No, it's like Kleenex. It's like the brand is like overcome. It's like band-aid. Yeah. Yeah.",
    "timestamp" : "32:09-32:24",
    "speaker" : "Greg"
  },
  {
    "text" : "That's fair.",
    "timestamp" : "32:24-32:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "All right.",
    "timestamp" : "32:25-32:25"
  },
  {
    "speaker" : "Andy",
    "text" : "Did you have any more, Andy, you want to chime in with? Um I had one and you just reminded me of it, but it's gone now. So I will shout it out in um Oh holy religious. Oh no no, it's um it's the the Christmas song that mom sings every time we go visiting on Christmas Well, I heard a little. The what? Should we explain the death whistle? Give me the death wish. I don't know what's the death wish whistle.",
    "timestamp" : "32:25-32:55"
  },
  {
    "speaker" : "Greg",
    "text" : "You know how like my mom's like doing like tidy work around the house? Oh yeah she does that little like kind of like can't hear it whistle. Well dad says that that's the noise his mom made when she was dying when she was on her death. Holy shit. So he calls it the death whistle.",
    "timestamp" : "32:56-33:14"
  },
  {
    "timestamp" : "33:14-33:15",
    "text" : "I have not heard this.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I know the whistle you're talking about.",
    "timestamp" : "33:15-33:16"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:18-33:19",
    "text" : "I do that whistle too."
  },
  {
    "timestamp" : "33:19-33:28",
    "speaker" : "Greg",
    "text" : "Oh yeah. I do the same whistle sometimes. That's a ridiculous one. But the best Christmas whistling song in"
  },
  {
    "text" : "It's jingle bells.",
    "speaker" : "Steve",
    "timestamp" : "33:32-33:33"
  },
  {
    "speaker" : "Greg",
    "text" : "That song rules to whistle.",
    "timestamp" : "33:33-33:35"
  },
  {
    "timestamp" : "33:35-33:39",
    "speaker" : "Steve",
    "text" : "Jingle bells? Yeah, is that jingle bells? Not so jingle bells, you idiot."
  },
  {
    "speaker" : "Greg",
    "text" : "Sleep bells ringling. Ding ding ding ding ding ding.",
    "timestamp" : "33:39-33:42"
  },
  {
    "speaker" : "Andy",
    "text" : "This Is something else",
    "timestamp" : "33:44-33:46"
  },
  {
    "text" : "Brings a big whistle.",
    "timestamp" : "33:46-33:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:47-33:49",
    "text" : "Yeah, what does mom sing though?"
  },
  {
    "text" : "Uh we wish you Merry Christmas. Yeah. Take her version of happy birthday.",
    "speaker" : "Steve",
    "timestamp" : "33:50-33:54"
  },
  {
    "timestamp" : "33:54-33:56",
    "speaker" : "Andy",
    "text" : "Yep. In a British accent."
  },
  {
    "text" : "Whenever we like see when we like see Ivon Bow and all that.",
    "timestamp" : "33:56-33:59",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "33:59-34:14",
    "text" : "Oh yeah, yeah. And then and then dad follows up with uh the the figgy pudding line And we won't go until we got some. Yeah, we won't go until we got some.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That's good. If Hicky putting it probably disgusting in the case, there's no way it's good.",
    "timestamp" : "34:15-34:19"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:19-34:22",
    "text" : "There's absolutely no way. Yeah, that's true"
  },
  {
    "timestamp" : "34:23-34:28",
    "text" : "All right. I have another segment here that we can kind of shoehorn in here.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "34:29-34:32",
    "text" : "Greg with the most notes on this podcast episode, by the way. Look at this.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, this is the this is the most he's participated in an episode.",
    "timestamp" : "34:32-34:35"
  },
  {
    "timestamp" : "34:35-34:37",
    "speaker" : "Steve",
    "text" : "Well, this is getting festive."
  },
  {
    "speaker" : "Greg",
    "text" : "Tis the season. Tis the season. All right. These are my Chris Kringle Burmanisms. Oh my goodness. See what I did there? I do. All right. This is just Patriots roster. All right. Alright. Chase Wintervich. Oh, not bad. Okay. Start off strong.",
    "timestamp" : "34:38-35:01"
  },
  {
    "speaker" : "Steve",
    "text" : "This is more of the hack game.",
    "timestamp" : "35:01-35:03"
  },
  {
    "speaker" : "Greg",
    "text" : "Old Saint Nick Folk. Oh.",
    "timestamp" : "35:04-35:06"
  },
  {
    "text" : "These are good.",
    "speaker" : "Steve",
    "timestamp" : "35:08-35:09"
  },
  {
    "text" : "Yeah, okay. Brian Ho Ho Hoyer. Oh Kendrick born in Bethlehem. Oh. Um Jesus Christ Jackson. That one's kind of a stretch. That one's not a stretch. Yeah. And I had um I had just written down Matthew Jew Dawn with some sort of Hanukkah joke, but I couldn't fit one in there.",
    "speaker" : "Greg",
    "timestamp" : "35:09-35:36"
  },
  {
    "timestamp" : "35:39-35:45",
    "speaker" : "Steve",
    "text" : "G E O dash D O N show Dawn. Yeah. You started out too strong, though. You should have started out with those."
  },
  {
    "timestamp" : "35:46-35:51",
    "speaker" : "Andy",
    "text" : "Yeah. Although those though he came out hot. Those are probably the best ones you've come up with."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:51-35:54",
    "text" : "Oh hoyer, old Saint Nick. Yeah, because he is old."
  },
  {
    "speaker" : "Andy",
    "text" : "Kendrick born in Bethlehem.",
    "timestamp" : "35:55-35:56"
  },
  {
    "speaker" : "Greg",
    "text" : "That one is fucking perfect. I was most proud of that one.",
    "timestamp" : "35:58-36:01"
  },
  {
    "text" : "No, Chase Winterfitch is my favorite. It's Winter Vitch. Nailed it. Is that what you did today? You just came up with those. You didn't work.",
    "speaker" : "Andy",
    "timestamp" : "36:01-36:10"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "36:10-36:19",
    "text" : "Uh-huh. Yeah. Yeah, I came on, I came here and he's like, oh. Coming up with segment ideas for the podcast. All right."
  },
  {
    "timestamp" : "36:21-36:36",
    "speaker" : "Andy",
    "text" : "Predictions. Yeah, time to look towards the future now. It's not something we do very often. All right. So wait, before you start, I I told you I had a hot take and uh Oh yeah. This is this is the perfect segue because Oh, I thought the hot take was I got it confused."
  },
  {
    "speaker" : "Steve",
    "text" : "I thought it was Greg saying Jesus shouldn't be in Christmas.",
    "timestamp" : "36:36-36:39"
  },
  {
    "text" : "Well that's his hot take. I got my own.",
    "timestamp" : "36:39-36:40",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:41-36:41",
    "speaker" : "Steve",
    "text" : "I yes."
  },
  {
    "timestamp" : "36:41-37:12",
    "speaker" : "Andy",
    "text" : "Mine's football related. Um so if you recall uh in our emergency episode when the Patriots signed Cam Newton. I had um interaction. Yes. And it was because I had a story all planned out as to how the the season would go, if you recall. Yes. Very detailed. And it was basically a repeat of 2001. And I would just like to point out that um I wasn't wrong. I was just a year too early."
  },
  {
    "speaker" : "Greg",
    "text" : "Well, and you had a different player.",
    "timestamp" : "37:12-37:14"
  },
  {
    "text" : "Playing quarterback.",
    "timestamp" : "37:15-37:16",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "37:16-37:16"
  },
  {
    "text" : "Doesn't matter. I I had the new guy playing quarterback. I had the new unproven guy playing quarterback.",
    "timestamp" : "37:16-37:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "37:22-37:33",
    "text" : "Well, Andy, I'll get some clarity on your hot take. Who's the who's the big bad wolf? AKA the greatest show on turf. In your new Tom Brady. Why isn't it the Rams?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Because the Rams aren't as good.",
    "timestamp" : "37:34-37:37"
  },
  {
    "speaker" : "Steve",
    "text" : "Rams are good.",
    "timestamp" : "37:37-37:38"
  },
  {
    "timestamp" : "37:39-37:41",
    "speaker" : "Andy",
    "text" : "Not as good as Tom Brady. Not not offensively."
  },
  {
    "speaker" : "Steve",
    "text" : "The Rams is the best defensive player in the league.",
    "timestamp" : "37:42-37:45"
  },
  {
    "timestamp" : "37:45-37:51",
    "speaker" : "Andy",
    "text" : "But we're talking about offense. They have to play an offensive powerhouse in this in the Super Bowl, Steve. And then they get they come up."
  },
  {
    "timestamp" : "37:52-37:55",
    "speaker" : "Greg",
    "text" : "Huh? What about the Cardinals? What about the Packers?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:55-38:09",
    "text" : "Because they haven't played that team already and uh got a moral victory in a lot in a close loss against uh a team that was in the Super Bowl previously. We don't do moral victories in New England, Andy. We did in 2001 against the Rams in the regular season."
  },
  {
    "text" : "You want to hear my hot take What's your Belichick? Everyone's praising Belichick for that win against the Bills. If if the Bills hit a field goal earlier. They he's like they're gonna tell him he's like the worst coach in the world.",
    "timestamp" : "38:14-38:30",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Well it could even be went zero blitz in the last down, even if they hit that as a touchdown, it's game over.",
    "timestamp" : "38:31-38:36"
  },
  {
    "timestamp" : "38:36-38:36",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "And the entire narrative would have flipped.",
    "timestamp" : "38:36-38:38"
  },
  {
    "timestamp" : "38:39-38:43",
    "speaker" : "Greg",
    "text" : "The entire narrative was such like a results-driven like media reactionary thing."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "38:43-38:48",
    "text" : "Well your hot take is dumb because if they had a field bill earlier, they probably would have passed more, they would have exactly"
  },
  {
    "timestamp" : "38:48-38:51",
    "speaker" : "Andy",
    "text" : "Yeah. If they had gone for two when they scored a touchdown, it would have been a different game."
  },
  {
    "speaker" : "Greg",
    "text" : "I don't know. I think he just runs the ball everything every play, regardless.",
    "timestamp" : "38:51-38:55"
  },
  {
    "speaker" : "Andy",
    "text" : "I don't think so. Mac Jones even said, and uh I think um Josh McDaniels also said that. Their plan wasn't to run the ball every play. It was just to run it until it stopped working, basically. And it just never stopped working. They never got into a position where they didn't have to run it.",
    "timestamp" : "38:55-39:12"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, well there was like thirds and fourteens, thirds and thirteens.",
    "timestamp" : "39:12-39:15"
  },
  {
    "speaker" : "Steve",
    "text" : "Like that should have been a give me some Bills fans like temperature after the game.",
    "timestamp" : "39:15-39:21"
  },
  {
    "text" : "Uh very sad. No, like this was different. This was different. This felt different. Usually they're like they're a little uh Testy testy is probably the right word. But the you could tell they were expecting a loss, so they would they were kind of having fun with it. This time they were just sad. Yeah, we saw that video. As you do. I was doing like strut walking by the cars on the way out too. Like stopping by every car and looking at him",
    "speaker" : "Greg",
    "timestamp" : "39:21-40:09"
  },
  {
    "timestamp" : "40:12-40:15",
    "text" : "This is regular Bill Sands cars, not like players cars. Yeah, the fans.",
    "speaker" : "Steve"
  },
  {
    "text" : "And one guy like did a fake get out of the car because he was an ad. It was funny. That guy's a good sport if he's out there.",
    "speaker" : "Greg",
    "timestamp" : "40:15-40:24"
  },
  {
    "speaker" : "Andy",
    "text" : "Not gonna lie, I've seen you. I mean, we went to the the Panthers game and you chanted basically through the entire game uh who's the home team. And uh you were well on your way to your your blackout um at the end of the game as we're walking back. And I uh only slightly feared for your safety at times. Um when you would basically walk through crowds of Panthers fans chanting things. Um so I did actually have a legitimate slight worry when we hadn't heard from you the next day after the Buffalo game That's true. By like one o'clock I had to I had to check in with Steve and be like, have you heard from Greg?",
    "timestamp" : "40:24-41:07"
  },
  {
    "speaker" : "Steve",
    "text" : "I I had to ask Kelly.",
    "timestamp" : "41:07-41:08"
  },
  {
    "timestamp" : "41:09-41:11",
    "text" : "Oh I was I was in a bad place.",
    "speaker" : "Greg"
  },
  {
    "text" : "I'm sure.",
    "timestamp" : "41:12-41:12",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "41:12-41:27",
    "speaker" : "Greg",
    "text" : "I woke up at I had a flight at 6 a. m. The morning after the game. So the Monday night game. Got after good got after it went to the game, got in the slept in the RV and then Got a ride at like four in the morning to the airport."
  },
  {
    "text" : "Holy shit.",
    "timestamp" : "41:27-41:28",
    "speaker" : "Andy"
  },
  {
    "text" : "Flew to Charlotte, layover, got back to Durham by 9 a. m. Did you work? And and worked. I was in the bag of shit. And like when I say I smell bad, I can't even put into I've I've honestly never smelt worse in my life than I did that one on the plane. We get Kelly to vouch.",
    "speaker" : "Greg",
    "timestamp" : "41:28-41:49"
  },
  {
    "speaker" : "Steve",
    "text" : "That Rio was disgusting.",
    "timestamp" : "41:49-41:51"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "41:51-42:03",
    "text" : "It was so disgusting because it was just mud everywhere. Oh yeah. The videos you sent me made me glad I didn't go up. For that game. That's why you go though. I don't know. I'd rather be like that than sunny."
  },
  {
    "text" : "That was the video where um you were outside And uh you could see the mud on the ground and the snow falling sideways and one of your tents had collapsed because the wind was so strong.",
    "speaker" : "Andy",
    "timestamp" : "42:04-42:16"
  },
  {
    "timestamp" : "42:16-42:16",
    "text" : "Oh yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "42:17-42:24",
    "speaker" : "Andy",
    "text" : "You had like a fire in a barrel going to keep warm Uh-huh. And that was when I'm like, I'm good. I'll watch this at home. That's fine."
  },
  {
    "speaker" : "Greg",
    "text" : "Great time. Brutal.",
    "timestamp" : "42:24-42:25"
  },
  {
    "timestamp" : "42:25-42:26",
    "text" : "Brutal.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "42:26-43:01",
    "text" : "Yeah, because he won. All right, predictions. I started to try and come up with Christmas themed predic prediction categories. Good effort. We'll start there. Okay. Okay. I could fit some of these in there. Okay, so the first one is um your Santa Claus team Or the team that most personifies Santa Claus when you turn 10 years old. So like the most likely to be a fraud once they get to the big show.",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh, I was I was just gonna go the Kansas City Chiefs, mainly because of Andy Reed. Gives off a real strong Santa Claus vibe, but isn't",
    "speaker" : "Andy",
    "timestamp" : "43:02-43:10"
  },
  {
    "text" : "Okay.",
    "timestamp" : "43:10-43:11",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "But I'm I'm gonna stick with that because I I think that still fits your criteria. I think the Chiefs are frauds.",
    "timestamp" : "43:11-43:15"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay. I'm going Packers. I think the Packers are fraud.",
    "timestamp" : "43:16-43:19"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:19-43:21",
    "text" : "Hmm, Aaron Frogers."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "43:22-43:32",
    "text" : "Because there've been frauds every year. Yeah. Like how many times have we seen Aaron Rodgers dominate the regular season? They look like a wagon and then they get to the playoffs and they just lose."
  },
  {
    "text" : "So what you're saying is is he is the current version of Peyton Manning?",
    "speaker" : "Andy",
    "timestamp" : "43:32-43:36"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, kinda. I mean it's hard to win the NFL, I get that. And I I'm not gonna like judge a career just by playoff How you doing the playoffs, but it's hard to say that he he doesn't play terribly, but he just doesn't play well enough to win. Like last year was a great example of him not running in that one from like the 10. Yep Like there's just something about Rodgers that I maybe it's like he's like too aloof to have that like competitive razor's edge when those games over that matters, you know? Yeah, yeah. I think that's what it might be, but I think that yeah, I think you're right. Sure, Ravens can count.",
    "timestamp" : "43:36-44:10"
  },
  {
    "timestamp" : "44:14-44:16",
    "speaker" : "Steve",
    "text" : "If not the Ravens, then maybe the Rams."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "44:16-44:17",
    "text" : "Or the Titans."
  },
  {
    "text" : "No, the Rams are just collecting talent. They're saying, hey, you got a big name. Good old yeah.",
    "speaker" : "Steve",
    "timestamp" : "44:18-44:23"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay, so who's your Rudolph the Red Nose reindeer team? You know, just the fucking leading the charge. Lead the charge. Exceeding exceeding expectations. I mean by the other than the Patriots?",
    "timestamp" : "44:24-44:37"
  },
  {
    "text" : "You're saying other than the Patriots?",
    "timestamp" : "44:40-44:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "44:42-44:46",
    "text" : "I mean you can pick the Patriots if you want, but that makes you fucking armor."
  },
  {
    "text" : "Huh, the Patriots Dynasty podcast has a Homer on it? Call me surprise.",
    "timestamp" : "44:49-44:54",
    "speaker" : "Andy"
  },
  {
    "text" : "We gotta do non-Patriots edition.",
    "timestamp" : "44:55-44:57",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:57-45:02",
    "speaker" : "Andy",
    "text" : "All right. I would say the Indianapolis Colts. No. Colts are good."
  },
  {
    "timestamp" : "45:02-45:03",
    "speaker" : "Steve",
    "text" : "Carson Wentz."
  },
  {
    "text" : "Carson Wentz is actually playing sneaky good right now. Yeah, he'll do something dumb though. He's only thrown like four interceptions on the season or something stupid like that. And all four have been absolute backbreakers. Problem.",
    "timestamp" : "45:04-45:16",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "45:17-45:33",
    "text" : "But they don't even have to throw the ball anymore. Yeah. Just ask the Bills. I got the Bengals too. I think the Bengals are sneaky good. Joe Burrow is legit. And like their receiving core is like pretty nasty. Jaguars. Jaguars."
  },
  {
    "text" : "No.",
    "speaker" : "Steve",
    "timestamp" : "45:34-45:34"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "45:34-45:37",
    "text" : "Well we got a category for that. Okay. Vikings."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "45:38-45:40",
    "text" : "Vikings, I could see, turn it up. Vikings."
  },
  {
    "text" : "Vikings will find a way to lose it at the end all the time.",
    "timestamp" : "45:41-45:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:44-46:09",
    "speaker" : "Greg",
    "text" : "49ers, well coached, good running game. They can they can win in uh January. Happy about that. All right, next category, how the Grinch Stole Christmas team. Non-playoff spoiler team. Hmm. Interesting. Lions, dude. I'm taking lions through to playing green in the last game of the season, dude. Um"
  },
  {
    "speaker" : "Steve",
    "text" : "And then they still get the number one pick because they're they have a lot a tie on there.",
    "timestamp" : "46:10-46:14"
  },
  {
    "timestamp" : "46:14-46:30",
    "text" : "Yeah. Dude. And they're still playing hard. I love watching the Lions. Um Seattle. Seattle. That's a good one. They can still win games for sure.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "46:30-46:55",
    "speaker" : "Andy",
    "text" : "Yep. But it's a crapshoot if they're gonna win any games or if they're just gonna go winless. I can see it going either way. But then I bet they could because the Cardinals um Rams and Niners are all like fighting for those playoff spots. And I can see the Seahawks put throwing a wrench in those plans. Oh, for sure. Of somebody, you know, right at the end."
  },
  {
    "text" : "All right. Um any other bold predictions you guys have? Uh uh.",
    "timestamp" : "46:56-47:02",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "47:03-47:09",
    "text" : "Urban Meyer gets rehired. As a what? By the Jets."
  },
  {
    "text" : "Ooh. Oh no, gimme uh gimme what uh what's the next thing that's gonna come out about Urban Meyer? What's the next scandal that's been brushed under the rug up up until now?",
    "timestamp" : "47:09-47:22",
    "speaker" : "Andy"
  },
  {
    "text" : "Um he already had a job lined up at a college.",
    "timestamp" : "47:22-47:26",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "47:35-47:36",
    "speaker" : "Andy",
    "text" : "He's been trying to do both."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "47:36-47:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:37-47:40",
    "text" : "Oh, that's not bad. That's not bad. That's actually I I can see that."
  },
  {
    "timestamp" : "47:41-47:44",
    "speaker" : "Steve",
    "text" : "Yeah. I'm gonna say a paternity suit."
  },
  {
    "timestamp" : "47:45-47:49",
    "speaker" : "Andy",
    "text" : "Yeah, that's where I was that's where I was leaning, somewhere in that direction."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:49-47:52",
    "text" : "Um don't mind grinding, that's for sure."
  },
  {
    "timestamp" : "47:52-47:55",
    "speaker" : "Andy",
    "text" : "Yep, yep, yep. I think there's gotta be something with the players."
  },
  {
    "timestamp" : "47:56-48:01",
    "speaker" : "Greg",
    "text" : "Um well I got another bold prediction."
  },
  {
    "text" : "Oh, okay.",
    "speaker" : "Andy",
    "timestamp" : "48:01-48:02"
  },
  {
    "text" : "The season does not finish as scheduled.",
    "timestamp" : "48:02-48:05",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "48:06-48:14",
    "speaker" : "Andy",
    "text" : "Ooh. Omnicron. Uh will not happen. The they will finish the season and come hell or high water."
  },
  {
    "timestamp" : "48:14-48:28",
    "text" : "Yeah, well they'll finish it, but they push it back a week or something like that, or they like I don't know. The EPL in England's already start already talking about doing that, taking a break. Really? Wow.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "48:28-48:31",
    "text" : "Well, they can though, because where when does their league run the EPL?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Um because they're not all full spring.",
    "timestamp" : "48:32-48:35"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:35-48:46",
    "text" : "Yeah, so they're like in the halfway through. Yeah. But we're getting towards the end here. You get divisional games, you're getting games that have playoff implications, you're not gonna cancel any of them."
  },
  {
    "text" : "Yeah, they'll maybe skip the week in between the Super Bowl, the extra week. Maybe. 75 players. Yeah. Tested for positive for COVID in the last two days.",
    "timestamp" : "48:47-48:59",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "The Browns have 20 players.",
    "timestamp" : "49:00-49:02"
  },
  {
    "text" : "Ridiculous.",
    "timestamp" : "49:02-49:03",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:04-49:05",
    "text" : "Including their top two quarterbacks."
  },
  {
    "speaker" : "Greg",
    "text" : "And they're all vaccinated. So it's not even like there's anything.",
    "timestamp" : "49:06-49:08"
  },
  {
    "text" : "And a lot of them are asymptomatic too.",
    "speaker" : "Andy",
    "timestamp" : "49:09-49:10"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "49:11-49:11"
  },
  {
    "text" : "So who the hell knows?",
    "speaker" : "Andy",
    "timestamp" : "49:11-49:13"
  },
  {
    "speaker" : "Steve",
    "text" : "Let them play. What's an influence gonna do? It's like, hey, if you're gonna be symptomatic, here's like as long as you like rapid test negative, get in there.",
    "timestamp" : "49:13-49:20"
  },
  {
    "text" : "I don't see a problem. I think that's what they're gonna do. I'm not a health official though.",
    "timestamp" : "49:23-49:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:30-49:41",
    "text" : "I'm just helping you with a computer. You know, I think at least we guys can take solace in the fact that The NFL will put money aside and just do what's in the best interest for everybody's health and their own."
  },
  {
    "timestamp" : "49:42-49:42",
    "speaker" : "Mom",
    "text" : "Oh, absolutely."
  },
  {
    "timestamp" : "49:43-49:45",
    "speaker" : "Steve",
    "text" : "And put that above everything because that's what's most important."
  },
  {
    "speaker" : "Greg",
    "text" : "So they won't bow to public pressure. They'll just do whatever they think is in the best interest.",
    "timestamp" : "49:45-49:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, you you want you want the newest uh Patriots related conspiracy? Sure. Um they the conspiracy is Bill Belchek is cheating the COVID reporting system by underreporting because Um, they haven't had enough people pop for COVID compared to the rest of the league.",
    "timestamp" : "49:49-50:09"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "50:10-50:11",
    "text" : "I can see them doing it."
  },
  {
    "timestamp" : "50:12-50:22",
    "text" : "And because the Northeast is having a huge spike and the pages themselves are not. I'm not saying, I'm just saying.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "50:23-50:25",
    "text" : "Just just script his first round draft pick now."
  },
  {
    "timestamp" : "50:26-50:35",
    "text" : "You may as well. Maybe we just don't give him a first round draft pick ever again. All future first round draft picks are forfeited.",
    "speaker" : "Andy"
  },
  {
    "text" : "Because of some bullshit. We'll figure something out.",
    "timestamp" : "50:36-50:37",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because uh because safety, league safety, Steve. Don't worry. Like you're talking about. Oh my goodness.",
    "timestamp" : "50:37-50:46"
  },
  {
    "text" : "What do you think, Pats? I got a chance at this thing? Yep. Yep.",
    "speaker" : "Greg",
    "timestamp" : "50:46-50:51"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean, where are we at? We're at, oh, Greg, we're at nine wins. What do we bet on? Uh the over under was nine and a half and you picked the under. Oh boy.",
    "timestamp" : "50:51-51:02"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "51:06-51:13",
    "text" : "Yes. When did I do that? Before the season? Yeah. Okay. Yeah, that would that was our Did you put this dog up, Steve?"
  },
  {
    "text" : "I didn't give it to her.",
    "speaker" : "Steve",
    "timestamp" : "51:16-51:17"
  },
  {
    "timestamp" : "51:17-51:23",
    "speaker" : "Andy",
    "text" : "Oh. Dog. He's so good at this guy. Go in the other room."
  },
  {
    "timestamp" : "51:26-51:28",
    "text" : "Hey, go over there.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "51:35-51:40",
    "speaker" : "Andy",
    "text" : "Oh god. Craig has met his match."
  },
  {
    "speaker" : "Greg",
    "text" : "Thing's so immature.",
    "timestamp" : "51:41-51:42"
  },
  {
    "text" : "There you go, told you.",
    "timestamp" : "51:43-51:44",
    "speaker" : "Steve"
  },
  {
    "text" : "Met of the match.",
    "timestamp" : "51:44-51:45",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "51:46-51:50",
    "text" : "Oh my god. Oh, now she just wants you to play chase with her, Greg."
  },
  {
    "timestamp" : "51:50-52:06",
    "speaker" : "Andy",
    "text" : "Yep. All right. So predictions. Pages are currently nine and four. First in the AFC. With some tough games coming up and then not much after that, really, I think, right?"
  },
  {
    "timestamp" : "52:06-52:09",
    "speaker" : "Greg",
    "text" : "Make it lose to the dolphins. Dolphins are playing well right now."
  },
  {
    "timestamp" : "52:10-52:14",
    "speaker" : "Andy",
    "text" : "Colts, Bills, Jaguars. Dolphins. At the Colts at the Dolphins."
  },
  {
    "timestamp" : "52:15-52:23",
    "speaker" : "Greg",
    "text" : "Holding for the Loss win loss win. Okay, so you think they finish No Lose to the dolphins and the cults."
  },
  {
    "text" : "Okay, so loss, win-win, loss.",
    "speaker" : "Andy",
    "timestamp" : "52:23-52:25"
  },
  {
    "speaker" : "Steve",
    "text" : "We play the Jaguars. Yeah.",
    "timestamp" : "52:25-52:27"
  },
  {
    "text" : "Yeah. At home.",
    "timestamp" : "52:27-52:29",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "52:29-52:31",
    "text" : "I wish it was Urban Meyer, is there?",
    "speaker" : "Steve"
  },
  {
    "text" : "In January, January 2nd, we play the Jacksonville Jaguars. That's gonna be an absolute shit kicking. That might be asked win out. Win out? Mm-hmm. Wow. Okay. Um so that would put them Really? Nine and four, another four, so thirteen and four, Steve is saying.",
    "timestamp" : "52:31-52:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yep.",
    "timestamp" : "52:49-52:50"
  },
  {
    "timestamp" : "52:50-52:59",
    "speaker" : "Andy",
    "text" : "Okay. I say I I'm thinking twelve and five, just cause I think that's what I picked to start with, because that's what they average, 12 wins a year."
  },
  {
    "timestamp" : "52:59-53:00",
    "text" : "Okay.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "So I think they lose one of the next two games, probably either Colts or the Bills. Actually, you know, it it you I think correctly you're probably right. It's probably the Dolphins at the end of the year. It is because after they because if they win these next two games, they I actually I think if they beat the Bills, they clinch the AFC East, regardless. Yeah.",
    "timestamp" : "53:00-53:20"
  },
  {
    "speaker" : "Greg",
    "text" : "So yeah, so that's the Bills are two games back. So they gotta they if they don't beat the Patriots, they're basically fucked.",
    "timestamp" : "53:21-53:28"
  },
  {
    "timestamp" : "53:28-53:56",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah, because the Patriots have worked on schedule though, outside of that. Right, but they're three games up and they've uh got the tiebreaker beating them twice. Right. Yeah. So Yeah, so I think I think they lose one more. Twelve and five. Make the playoffs. First seed. Probably twelve twelve wins could get you the first seed, do you think? Yep, it would be close. I would think. Depends on the case. At least in the AFC. NFC there's two teams with 10 wins already."
  },
  {
    "speaker" : "Greg",
    "text" : "It's gonna depend yeah, it's gonna depend on Kansas City. Yeah. Kansas City be a sneaky scary team. Mm-hmm.",
    "timestamp" : "53:56-54:03"
  },
  {
    "speaker" : "Andy",
    "text" : "It could be. Does any other team scare you? Here here's here's the current um the current playoffs. Uh and just like the teams that are qualified right now is New England, Buffalo, Baltimore, Tennessee, Indianapolis, Kansas City, and the Chargers.",
    "timestamp" : "54:03-54:19"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "54:19-54:23",
    "text" : "Not really. The Bengals maybe. Baltimore? No, not the Baltimore."
  },
  {
    "timestamp" : "54:23-54:26",
    "text" : "Baltim Uh not if they don't have uh they're welcome.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Physical.",
    "timestamp" : "54:27-54:28"
  },
  {
    "timestamp" : "54:29-54:32",
    "speaker" : "Andy",
    "text" : "Yeah, but they've had some sp super bad losses this year, it feels like."
  },
  {
    "text" : "Yeah, and then some good wins.",
    "speaker" : "Greg",
    "timestamp" : "54:33-54:34"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "54:34-54:36",
    "text" : "Barely winning though. They got lucky a lot."
  },
  {
    "timestamp" : "54:36-54:39",
    "speaker" : "Greg",
    "text" : "Yeah, but do you say that about the Patriots?"
  },
  {
    "timestamp" : "54:39-54:40",
    "speaker" : "Steve",
    "text" : "What if we got lucky to win?"
  },
  {
    "speaker" : "Andy",
    "text" : "Pagers are beating bad teams by a lot that they should be, you know? Baltimore struggles with Houston?",
    "timestamp" : "54:40-54:46"
  },
  {
    "speaker" : "Greg",
    "text" : "You're gonna tell me that's not a lucky win? They gotta play in Houston. Lucky though. No, they're what do you define as lucky then?",
    "timestamp" : "54:46-54:54"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "54:55-55:00",
    "text" : "The ball bounced in a certain way and they you know we are lucky in like the Jaguars product game."
  },
  {
    "timestamp" : "55:04-55:06",
    "text" : "They just don't get lucky. They earn lucky.",
    "speaker" : "Andy"
  },
  {
    "text" : "They earn",
    "speaker" : "Greg",
    "timestamp" : "55:07-55:07"
  },
  {
    "timestamp" : "55:11-55:14",
    "speaker" : "Andy",
    "text" : "All right. So what's your Super Bowl then? Give me Super Bowl predictions."
  },
  {
    "text" : "Patriots, Cardinals, I say Patriots, Rams, where an upstart young quarterback beats the greatest show on turf. Down, you know, top game with a couple minutes left instead of playing for overtime, he goes for the field goal and makes it.",
    "timestamp" : "55:15-55:29",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "55:29-55:32",
    "speaker" : "Greg",
    "text" : "Tom Brady's gonna do it again, isn't he? Yep. Yeah."
  },
  {
    "timestamp" : "55:32-55:59",
    "text" : "Well no i it'll be it'll be Pat's uh bucks in the Super Bowl and the world will basically melt down the football worlds because then one of them has to win, especially if Belichick wins it. Can you imagine? Because everybody, because right now the story is, you know, um who's responsible for the Pages dynasty. And so if Brady wins it without Belichick last year and then Belichick wins it without Brady this year.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. It's the worst of both worlds.",
    "timestamp" : "55:59-56:01"
  },
  {
    "timestamp" : "56:02-56:25",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. All the haters will just, yeah, they they have nothing that they can use anymore. It'll be amazing. And Brady would be the first team to win a Super Bowl, one in his home stadium. And with his first year on a team. And if Belichick does it this year, he'd be the first team to win it with a rookie quarterback, I believe. I think that's the truth."
  },
  {
    "text" : "The rookie quarterbacks never even made the Super Bowl.",
    "timestamp" : "56:26-56:28",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:29-56:36",
    "text" : "I believe that's true. Because I think Ben Rosenberg was probably the closest. 15-1 losing the AFC Championship game."
  },
  {
    "text" : "Well, he was in his second year.",
    "timestamp" : "56:37-56:39",
    "speaker" : "Greg"
  },
  {
    "text" : "Technically, yeah. Yeah, because you draft 2000 and played like garbage time against uh Detroit that year. I think he threw three passes.",
    "timestamp" : "56:39-56:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Lions are beating us up so bad they had to stick Brady in.",
    "timestamp" : "56:49-56:52"
  },
  {
    "text" : "Yeah, actually. And he was like one for three for six yards or something. Not not an auspicious start.",
    "speaker" : "Andy",
    "timestamp" : "56:52-57:00"
  },
  {
    "text" : "I don't want to play Brady.",
    "speaker" : "Greg",
    "timestamp" : "57:00-57:02"
  },
  {
    "timestamp" : "57:02-57:14",
    "speaker" : "Andy",
    "text" : "I do. I'd be okay with it. I don't. I'd be okay with it. It'd be a good game. Because you it's the Patriots in the Super Bowl and it's Brady in the Super Bowl. It'd be a good game. If if you have to like root against Brady."
  },
  {
    "timestamp" : "57:14-57:19",
    "speaker" : "Steve",
    "text" : "Well I just want to like I'm okay with it. The only reason I'm okay with it because everybody else would hate it."
  },
  {
    "text" : "I'm okay with it because he's already won the Super Bowl, so I'm okay rooting against him this year.",
    "timestamp" : "57:20-57:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I just want to see like poor Bills fans, you know, like what do they do? What do they do?",
    "timestamp" : "57:25-57:30"
  },
  {
    "timestamp" : "57:31-58:09",
    "speaker" : "Andy",
    "text" : "Oh, oh, oh, that's that I I have uh I have a hypothetical for you guys that I thought of when I was on the toilet the other day. Um let's say Tom Brady uh decides to leave the Buccaneers this year or whenever his his thing is up and he can go to one more team. Which team would boost his um I don't know, not cred, but his his legacy the most If he went to one more team and like took that team to the Super Bowl or won a Super Bowl with one more team."
  },
  {
    "speaker" : "Steve",
    "text" : "Lions, Jets.",
    "timestamp" : "58:09-58:11"
  },
  {
    "text" : "See, I I I first thought the Lions or you know a team that hadn't been to the Super Bowl, Lions or Browns or someone like that. I think the the actual answer is the Buffalo Bills.",
    "timestamp" : "58:11-58:22",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:23-58:25",
    "speaker" : "Greg",
    "text" : "No, it's not a big enough market."
  },
  {
    "speaker" : "Steve",
    "text" : "49ers.",
    "timestamp" : "58:25-58:26"
  },
  {
    "text" : "You gotta think markets. No, be because you You won one for the Jets, dude. The Jets are the biggest like market in the NFL.",
    "timestamp" : "58:26-58:32",
    "speaker" : "Greg"
  },
  {
    "text" : "No, I I don't I I think he's gonna hate the Jets though. Because I I think the Bills are beloved, right, by even non-bills fans. Outside of the AFC East. Like people love the Bills because they love the Bills fans. And they love that they're a small market team that, you know, has been to four Super Bowls but lost all four. The lovable losers. And the one person who they hate the most Is Tom Brady.",
    "speaker" : "Andy",
    "timestamp" : "58:33-58:57"
  },
  {
    "timestamp" : "58:58-59:18",
    "speaker" : "Greg",
    "text" : "Because Tom Brady is talking about legacy, like you're talking about like say you're like a fan and like uh England or Australia, right? They've never even heard of the fucking Bills. You know, they know the Jets, they know the Giants, they know the Patriots, they know the Cowboys. Cowboys is a good answer. 49ers. 49ers. That's where we grew up."
  },
  {
    "timestamp" : "59:18-59:20",
    "speaker" : "Andy",
    "text" : "49ers would be a good one, too. Yep."
  },
  {
    "timestamp" : "59:20-59:27",
    "speaker" : "Greg",
    "text" : "We're talking about like the think about the casual fan and what they think of. Think about the people in Brazil, Andy. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "But that's not what I'm that's not really what I'm talking about. I'm talking about like NFL legacy, like fans of the game. Like, because right now he's he's accomplished a lot, but he's still like super hated, right? By anybody outside of New England or or Tampa Bay.",
    "timestamp" : "59:27-59:42"
  },
  {
    "text" : "I don't know if he isn't. I think like ha going to a hated team like even more enhances your legacy. Like there's a reason, like there's a reason cowboys are like the biggest team. Maybe in the league is because half the league fucking hates them and half the league loves them. And that just means they're important, right? Like the Bills is kind of like, oh shucks they won, or oh shucks, they lost. But no one really thinks like it gets passionate about them winning or losing, except Bills fans. Except Bills fans. I don't know. I think a lot of people would jump on that bandwidth. He wins for Dallas, you're gonna have half the people in the league going, God damn it, and the other half being like, Oh, but he already has that with the Patriots.",
    "timestamp" : "59:42-01:00:21",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:00:21-01:00:23",
    "speaker" : "Andy",
    "text" : "The Patriots are the new Cowboys. I think it's"
  },
  {
    "text" : "And he I think he's honestly made the Patriots into that team.",
    "speaker" : "Greg",
    "timestamp" : "01:00:23-01:00:26"
  },
  {
    "text" : "Oh yeah.",
    "timestamp" : "01:00:26-01:00:27",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:00:27-01:00:27",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "text" : "Him and Belgium.",
    "speaker" : "Andy",
    "timestamp" : "01:00:27-01:00:28"
  },
  {
    "text" : "Before he was there, no one gave a shit. But now we were the Bills. And that's why we're like now the second most valuable franchise in the NFL.",
    "timestamp" : "01:00:28-01:00:34",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Is it still that way? Pretty sure. Yeah. No, I thought the pages were the first. Oh, well really, Andy, you did. No, I I really like I thought there was there was like a news story there. What a surprise. I thought the Patriots were double the next best. I bet Bill Belchuk's the highest paid coach. I mean probably He's been there for twenty fucking years, of course he is.",
    "timestamp" : "01:00:35-01:00:58",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "He probably got it he probably doesn't make as much as fucking Herbermeyer. No.",
    "timestamp" : "01:00:58-01:01:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Well it depends on uh if there's a uh behavior clause in Irving Meyer's contract.",
    "timestamp" : "01:01:05-01:01:10"
  },
  {
    "timestamp" : "01:01:10-01:01:28",
    "speaker" : "Greg",
    "text" : "Well dude like the see what Lincoln Riley got paid to go to USC? Ridiculous funny money. They don't have to pay the players. Like these college coaches get make so much money. I think they make more than NFL coaches. Oh, yeah, that's probably true. Because they don't have to pay the players. So they just throw money at these fucking college guys."
  },
  {
    "timestamp" : "01:01:28-01:01:30",
    "speaker" : "Andy",
    "text" : "Well now they do have to pay players though, right?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:01:30-01:01:34",
    "text" : "No. No, they're not paying them. Players can just make it. Companies are paying. Yeah."
  },
  {
    "timestamp" : "01:01:35-01:01:36",
    "speaker" : "Andy",
    "text" : "Bar stool's paying them."
  },
  {
    "timestamp" : "01:01:36-01:01:59",
    "speaker" : "Greg",
    "text" : "Yeah, they didn't even want to allow that. That's how fucking crooked the NCAA is. You don't even have to pay 'em. We'll get fucking Verizon to pay them. Or American Airlines. And they're like, no, no, that'll ruin the the amateurism of the game. Like such bullshit. Andy's on his fifth link trying to find uh somewhere that says Patriots worth more."
  },
  {
    "text" : "No, it is the Cowboys. Just barely. Just barely Just barely.",
    "timestamp" : "01:01:59-01:02:05",
    "speaker" : "Andy"
  },
  {
    "text" : "Trust but verify, Gray.",
    "speaker" : "Steve",
    "timestamp" : "01:02:06-01:02:07"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, trust. It's fake news. Give me give me the bottom five. The the least. Yeah. The least valuable franchises.",
    "timestamp" : "01:02:07-01:02:16"
  },
  {
    "timestamp" : "01:02:16-01:02:20",
    "speaker" : "Greg",
    "text" : "This is a good exercise. Carolina"
  },
  {
    "speaker" : "Andy",
    "text" : "Steve, you got the the 32nd most valuable franchise.",
    "timestamp" : "01:02:21-01:02:26"
  },
  {
    "timestamp" : "01:02:26-01:02:27",
    "speaker" : "Greg",
    "text" : "Bills. Bills."
  },
  {
    "speaker" : "Andy",
    "text" : "Two point two seven billion dollars",
    "timestamp" : "01:02:27-01:02:29"
  },
  {
    "text" : "Well Carolina just got sold. Carolina is not is not on there.",
    "speaker" : "Greg",
    "timestamp" : "01:02:30-01:02:35"
  },
  {
    "text" : "No. Texas. They're not in the top ten either. Texans are not on here.",
    "timestamp" : "01:02:35-01:02:39",
    "speaker" : "Andy"
  },
  {
    "text" : "There's a big market in Houston. Big small town. Green Bay can't be though. No. Um Cleveland.",
    "timestamp" : "01:02:40-01:02:47",
    "speaker" : "Greg"
  },
  {
    "text" : "Cleveland is 29th, 2. 6 billion.",
    "timestamp" : "01:02:48-01:02:51",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:02:51-01:02:52",
    "speaker" : "Greg",
    "text" : "Cincinnati."
  },
  {
    "speaker" : "Andy",
    "text" : "Cincinnati is 31st, 2. 275 billion. Yeah. Which is 0. 005 billion more than the bills. Pretty big market.",
    "timestamp" : "01:02:52-01:03:03"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:03:03-01:03:04",
    "text" : "Arizona?"
  },
  {
    "speaker" : "Andy",
    "text" : "Nope.",
    "timestamp" : "01:03:04-01:03:05"
  },
  {
    "timestamp" : "01:03:05-01:03:15",
    "speaker" : "Greg",
    "text" : "Oakland? Oh, they're Las Vegas now. Never mind. I don't know. Give us a hint. Kansas City. No."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:15-01:03:19",
    "text" : "Uh AFC South is one of the teams."
  },
  {
    "speaker" : "Greg",
    "text" : "Tennessee.",
    "timestamp" : "01:03:19-01:03:19"
  },
  {
    "text" : "Indianapolis. Tennessee. Oh. Two point. They are 28th. And the other team is one um Washington. No, they're actually top they're number five. That is such fucking bullshit.",
    "timestamp" : "01:03:20-01:03:34",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:03:34-01:03:35",
    "text" : "That is bullshit."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:35-01:03:44",
    "text" : "Um no the 30th ranked team. Uh is as bad at being valuable as they are at uh winning football games."
  },
  {
    "speaker" : "Steve",
    "text" : "Jaguars?",
    "timestamp" : "01:03:44-01:03:45"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh think worse. Think longer term.",
    "timestamp" : "01:03:46-01:03:49"
  },
  {
    "timestamp" : "01:03:49-01:03:50",
    "text" : "Lions. Buccaneers.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:51-01:03:54",
    "text" : "Detroit Lions. $2. 4 billion."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:03:55-01:03:58",
    "text" : "Yeah, that makes sense. Trevor Burrus would say it's an overpay."
  },
  {
    "text" : "I I think a lot of people, especially Lions fans, would say that's an overpay. But yes, the Dallas Cowboys are worth 6. 5 billion. The New England Pages are worth $5 billion. Nobody else is worth more than $5. $6. 5 billion.",
    "speaker" : "Andy",
    "timestamp" : "01:03:58-01:04:12"
  },
  {
    "speaker" : "Steve",
    "text" : "They're a billion and a half more than the Patriots.",
    "timestamp" : "01:04:12-01:04:15"
  },
  {
    "timestamp" : "01:04:15-01:04:18",
    "text" : "Yep. And then the New York Giants, a third of four point eight five.",
    "speaker" : "Andy"
  },
  {
    "text" : "So like a almost a bill's worth more than the I mean that feels right. That's crazy.",
    "timestamp" : "01:04:21-01:04:27",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:04:27-01:04:36",
    "text" : "Yeah. Then it's Giants, Rams, Washington, 49ers, Bears, Jets, Eagles, Broncos. So all like the old school teams.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:04:37-01:04:46",
    "text" : "How the hell? Or the Reds. Uh the sorry. Ooh Washington football too. Almost got a little fucking pee-pee slap there for that one.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "They have the worst attendance in the league. Yeah, that's what I'm saying. That's gotta No, there's no fans anymore. That has to affect bottom line.",
    "timestamp" : "01:04:52-01:04:59"
  },
  {
    "text" : "When was this written? This was August 5th, 2021. So this is recent.",
    "timestamp" : "01:04:59-01:05:03",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:04-01:05:13",
    "text" : "So makeup evaluations, anyways, you know. I mean it's a good market, but until your owner says something racist and then all of a sudden it becomes real.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:14-01:05:15",
    "text" : "Wow. Matter of time."
  },
  {
    "text" : "Dan, Dan, who knows? Hopefully.",
    "speaker" : "Steve",
    "timestamp" : "01:05:16-01:05:17"
  },
  {
    "speaker" : "Andy",
    "text" : "You can't call him, dude. You have to call Mr. Snyder.",
    "timestamp" : "01:05:18-01:05:20"
  },
  {
    "timestamp" : "01:05:21-01:05:22",
    "speaker" : "Steve",
    "text" : "He ain't my boss."
  },
  {
    "timestamp" : "01:05:22-01:05:30",
    "speaker" : "Andy",
    "text" : "That's the rumor. There's there's some like awesome shit coming out about Dan Snyder. Like super petty stuff. Huh?"
  },
  {
    "text" : "What about Senor Snyder?",
    "speaker" : "Steve",
    "timestamp" : "01:05:30-01:05:32"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:32-01:05:34",
    "text" : "I don't know if he'd go for that."
  },
  {
    "text" : "We wee.",
    "speaker" : "Steve",
    "timestamp" : "01:05:35-01:05:36"
  },
  {
    "text" : "All right. Merry Christmas, everybody. Merry Christmas. Happy Hanukkah, if that's your jam. Happy holidays. We will be back at some point. Um we probably will take a bit of a break over the holidays, I would guess.",
    "speaker" : "Andy",
    "timestamp" : "01:05:36-01:05:50"
  },
  {
    "timestamp" : "01:05:50-01:06:01",
    "text" : "Yep. Enjoy your Yule-Tide joy. Yes. In your run DMC, your candy canes and apple. Bobbins. Apple bobbins? Isn't it like a Halloween thing?",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh no. Spitting off top of the dome. Break.",
    "speaker" : "Steve",
    "timestamp" : "01:06:02-01:06:06"
  },
  {
    "timestamp" : "01:06:07-01:06:10",
    "speaker" : "Andy",
    "text" : "Uh happy Chase Wintervich. Everybody."
  },
  {
    "text" : "Have a very eggy Christmas, everybody. A very eggy Christmas.",
    "speaker" : "Steve",
    "timestamp" : "01:06:11-01:06:14"
  },
  {
    "speaker" : "Greg",
    "text" : "And as always, tune in next week to see how much of a blubbering little bitch Greg is. On the Patriots Dynasty Podcast. See you later.",
    "timestamp" : "01:06:15-01:06:27"
  },
  {
    "timestamp" : "01:06:27-01:06:29",
    "text" : "See you later.",
    "speaker" : "Mom"
  }
]