[
  {
    "timestamp" : "00:00-00:17",
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny, but really, they're just being stupid. Do you still want to listen? Listen, go right ahead. I am not your mother."
  },
  {
    "text" : "Welcome back to the Patriots Dynasty Podcast. I'm your host, Andy Brown. We have a special edition this week. We're taking a little quick break from the uh usual game recaps. We were in 2005, but we thought we would uh talk to somebody who was there. Uh in 2005 and was playing in these games. So um not talking about Greg Brown. He's decided to skip this. But uh I do have uh Steve Brown with me and Tim the intern. But enough about them. Let's introduce you to our uh special guests. Tonight we have with us Tyrone Poole, uh two-time Super Bowl champion, former Patriots, former lots of teams actually. Um And kind of all around good human, Tyrone Pool. Thanks for he thanks for joining us, Tyrone.",
    "speaker" : "Andy",
    "timestamp" : "00:23-01:13"
  },
  {
    "speaker" : "Tyrone Poole",
    "text" : "Thank you, Andrew. Thank you, Steve, Kim, thank you, guys, and all of uh The Patriots fans that watch the show. It's an honor. It's an honor. Thank you guys for giving me the opportunity. Oh, I really appreciate it.",
    "timestamp" : "01:14-01:29"
  },
  {
    "timestamp" : "01:29-01:32",
    "speaker" : "Steve",
    "text" : "Yeah, you don't have to lie to us, Tyrone. It's not really an honor."
  },
  {
    "text" : "Oh no. Anytime, you know, I did that's just who I am. You know, it's always an honor really uh to to uh be able to talk to uh the fans or whomever may listen to the show because every time uh it's like a smile you know uh yeah or as they would say you never get an opportunity to make a another first impression. So, you know, people always gonna remember uh the moments of how you made them feel. And so yeah, it's always an honor to be able to share and reminisce, you know, present and past uh information. So yeah, it is an honor.",
    "timestamp" : "01:32-02:12",
    "speaker" : "Tyrone Poole"
  },
  {
    "text" : "Cool. I love that. Um so yeah, uh I kind of speaking of reminiscing, I kind of want to obviously, you know, we're the Patriots Dynasty Podcast. Um, so we'll talk about the past, but I kind of want to just maybe even start a little bit before that and kind of Want to know like what got you into football? What made you passionate about playing football like as a career? How'd that start?",
    "timestamp" : "02:13-02:36",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Tyrone Poole",
    "text" : "Yeah, well what what what got me into football I I think honestly all males And you have females playing sports as well. You know, sometimes they come up in households where, you know, it's an athletic, athletic family. But I came up as an only child and My only competition was my environment. But in the neighborhood, we played, man, we played We would just play sandlot football, you know, wherever there was there was grass, you know, we would play in the streets, you know. The only thing about playing in the streets Is when a car comes down the road, we have to stop the game. Everybody go to their sides like an ox, and you go to your side, that car passed by, and then we start back playing. But um I think every young young male grows up watching sports on television and uh from that moment of seeing sports on television which I ran track I played football as well. Probably could have played baseball. But football was one of those sports where we played it almost every day in the neighborhood. So Uh not only seeing it on television, which back in the day when I came up, um you you would only see the Dallas Cowboys. you know, uh television. So you either love the Cowboys or you hated the Cowboys. But uh, you know, I I I'm from Georgia, uh uh um Lagrange, Georgia. Uh so For those who don't know, uh Lagrange is about about an hour and uh 15 minutes uh south. west of Atlanta. So I grew up watching the Atlanta Falcons too. You know, and all that red, the red uniform. You know. But um yeah, so that's how it kind of started. Just Growing up watching it on television and going outside playing it with uh arguably some of the greatest um People in my neighborhood, guys that were faster than me. So if anybody thought I was fast or or strong or quick, wow, you should have laid eyes on some of the guys that used to beat me and running.",
    "timestamp" : "02:37-04:55"
  },
  {
    "text" : "Yeah, I feel I feel like that's kind of what um because I mean we we have uh a baby brother who kind of grew up playing with us too, but we were we were kind of the same sort of thing. He was always playing with the the faster, bigger kids. And uh he is the only one in the family that actually went on to play sports in college. Um so I I feel like there's something to that of being able to like kind of spend all that time playing with people that make you up your game constantly. And then you get to the people that are your same age or whatever it is. And you've kind of got this uh advantage over them. Yeah.",
    "timestamp" : "04:55-05:31",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know, Andy. We weren't very fast or strong or big. Let's be real.",
    "timestamp" : "05:32-05:36",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I wasn't talking about that. I wasn't talking about our friends that we played with.",
    "timestamp" : "05:36-05:39"
  },
  {
    "speaker" : "Tyrone Poole",
    "text" : "You know, you guys know the funny thing, you know, Andrew, you you you mentioned playing with guys that are older. Um and that is how I believe I was I kind of separated myself from my other peers. Because when you play with older kids, They have the advantage not only from maturity, uh, but you know, just the ability to just physically throw you around and and and basically that's what they did. You know, we play with the older kids and you know they grab you and p throw you around and uh you know uh it made me tougher so these guys my age It's like it's like me and amongst boys because I was being trained by the older kids in the day of to be able to dominate the kids uh the same age.",
    "timestamp" : "05:41-06:34"
  },
  {
    "text" : "Yeah, that's that's how that that's that's why I take credit for Greg's uh athletic accomplishments.",
    "timestamp" : "06:34-06:39",
    "speaker" : "Andy"
  },
  {
    "text" : "You made him the man that uh He is now.",
    "timestamp" : "06:42-06:44",
    "speaker" : "Tim"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:44-06:46",
    "text" : "Do you really want that on your record, Andy?"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "06:47-06:59",
    "text" : "That's what you're going that's what you're going down for. So so Tyrone, um uh as far as the other sports go, um playing baseball what what what position were you when you played baseball?"
  },
  {
    "speaker" : "Tyrone Poole",
    "timestamp" : "06:59-07:42",
    "text" : "Well again uh did I didn't play organized Okay nothing organized yes but but but um When we did select teams, because you know you always have like the two best athletes, really, right? You don't want to put them on the same team They would actually have to pick teams. Sometimes I was one of those guys, okay, Tyro, you pick a team, and uh such such you pick a team. But when I did play, um I love pitching. I love pitching. I love pitching. But yeah, but I would be like on first base. First base or either a shortstop. So it was either uh pitching Uh first base or either shortstop."
  },
  {
    "text" : "All right. Do you have a um like a sports hero growing up that you looked up to?",
    "timestamp" : "07:42-07:49",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh yeah, again. Like I said, I grew up uh watching the Dallas Cowboys and uh Tony Dorset. Tony Dorset. Um and I think actually Ty, I think Ty Law and the Dorset family, I think they're kind of like uh uh got some relation, family relationship uh going on there. Um history and their family. So Tony Dorset, uh Dallas Cowboy number 33. So I used to take a t-shirt and um Whenever we would go out and play, uh, I would take a crayon or a marker and I would put 33 on the front and 33 on the back and write door set. And uh yeah, so um that that was the guy that um I tried to say I was Tony Dor since. So yeah.",
    "timestamp" : "07:49-08:37",
    "speaker" : "Tyrone Poole"
  },
  {
    "speaker" : "Andy",
    "text" : "So then how did you end up with number 38 in the pros? Just because 33 wasn't available or was there another reason for 38?",
    "timestamp" : "08:38-08:44"
  },
  {
    "speaker" : "Tyrone Poole",
    "text" : "Yeah, you know, it's a little bit of history with that as well. Um I when I played in high school, I was 21. 21. And I walked on. I actually quit football in high school. So that you know tell everybody that you can mess up in life and you still if you know where you're going you still could make it to your destination, okay? Uh alternate route but you still can make it But 21 was my number in high school. And then when I got to college, I walked on at Fort Valley State, HBCU, Division II. And they gave me the number 29. 29. Um, and then when I went to the senior bowl, The senior bowl, somebody else had 29 and they gave me 28. All right. So now I have 28. So if you look at all my single bowl uh cars it has jersey number 28. So when the Panthers uh drafted me uh and I never really talked to the Panthers, never talked to them during the combine, never talked to them, period. All of a sudden I know that they're drafting me. So this draft coming up, you know, some players will get chosen, they never talk to the team. Crazy. But uh when they drafted me, somebody else had twenty-eight. Okay, somebody else had twenty-eight. So they ended up giving me thirty-eight. So that's how I came about the number thirty-eight.",
    "timestamp" : "08:45-10:15"
  },
  {
    "timestamp" : "10:16-10:24",
    "speaker" : "Tim",
    "text" : "So And uh when you when you played for the Patriots, did that ever come up that you got picked one pick before Ty Law? Did you ever bring that up to him?"
  },
  {
    "timestamp" : "10:25-15:50",
    "speaker" : "Tyrone Poole",
    "text" : "No, no. Actually, you know, Ty and I go back into the um, you know, all the way back to the combines. And uh, you know, we got our stories there. And um, you know, I I I'll tell you this. Um You know, sometimes I think you can get drafted into a system that really doesn't fit your skills and it's gonna be a lot of players that's gonna that's gonna happen to them as well. You know teams are gonna draft them because they are the best um uh possible athlete, uh, but do they fit that system? Um and uh coming out of Fort Valley, um We played nothing but man to man. Man to man. That's how we played man to man coverage. I didn't know anything about zone. I'm like we only play zone when we had the game one and about three minutes left in the game. We sit back in a cover three. But other than that. It was like you go get him, you go get him. So I was great at man-to-man coverage. Um and when I got to New England, um actually um that was probably the Let me go back. Let me go back. Before I got to New England. With the Denver Broncos, Ray Rose. I don't know if anybody you guys remember Ray Rose, but Ray Rose had a stint as a coach with the 49ers. uh back in the Bill Walsh days and then he was a coach of the Philadelphia Eagles. And then he was the defensive coordinator, my defensive coordinator out with the Broncos. And um, you know, Ray Bob, as they call him Ray Bob, and uh he got a lot of stories, man. I love Ray Rose. Uh he's a great player's coach uh because he played the game as well. So Ray was all about running man to man. So his system just fit me like hand in glove, man. But my previous teams, nothing against You know, none of those teams, nothing against the the Panthers. I love my years in the Panthers. Uh love my years with the Colts. Uh but uh they were more of the fire zone uh Pittsburgh Steelers. So really you're not truly playing man to man. But then I got to New England from Denver, Denver, we all man to man, and then we get to New England, uh Bill um you know allow me and Ty to play man to man. You know uh previously uh Ty would go from one side to the other uh but Beal felt like hey you know when I got there in 2003 that you know hey we both can stay on our respective sides and uh whoever we get that's who we get you know uh so that was fun but uh yeah ty and i go back to the um you know the um um Yeah, the combines. But uh again, I'll say this, I'll let you guys ask your next question. Um Coming from an HBCU, it was a whole lot of pressure, man. A whole lot of pressure. And when I say pressure, it was more pressure mentally. Nothing physically, nothing physically. I'm like, you know, I'm covering arguably one of the best receivers twice a year, Jerry Rice, you know. Yeah, you gotta get your track shoes on when you cover that. Um so Um it wasn't the physical play that was tough. It was the mental. You know, the the playbook in college was like man to man. It was like, you know, that thick. And then you get to the pros and it's like that thick and you know one movement or one shift by one person or running back motioning out to the right or to the left or tight end getting up moving over or receiver uh you know forming twins it changes the whole complexity of the defense and you could be on the strong side that motion now you're on the weak side which now you gotta go to a whole different technique so that was kind of like my struggle My first and second year, third year, and really I didn't catch on to the game until maybe my fifth year. But by then, you know, the Panthers had given up on me And uh, hey, this kid's not gonna, you know, he's not gonna get it, man. It wasn't, it didn't have nothing to do with my physical skills. It was the mental. So that's why um I always try to tell these young kids from HBCUs that, you know, you gotta study the game. The game is is so complex. Now do they have the physical skills to play it? Yes. Uh but it's the mental that sometimes doesn't give uh you know those athletes uh that opportunity. Because you're not you're not getting reps anyways. When you go into a camp you're probably gonna be a low draft pick. So low draft picks don't get a lot of reps doing mini camps. So how you gonna learn? You know, but anyways, uh back to the point. Um uh but yeah, coming from HBCU to see Carolina jump up. you know, uh so many spots. Uh I'm like, you know, at that time I didn't know, you know, what type of skills I had, but evidently They did. And um I played my best ball, one of my best seasons when I got to New England. And Bill, again, did the same thing Ray Rose did. He said we're gonna play man-to-man. Yeah, we drop off in cover two, you know, every once in a while. But really, man to man, that's how we played in cover uh in 2003. We call it dog one. So let Willie McGuinness and Mike Vrabel and uh let them guys go from the side and you know put pressure on the quarterback and you know we cover them up on the outside. So it was fun"
  },
  {
    "text" : "So did Belichick uh teach it any different than other coaches? Yeah, that was gonna be my question.",
    "speaker" : "Steve",
    "timestamp" : "15:51-15:56"
  },
  {
    "text" : "You know, uh every coach has their own um Should I say their own identity? And uh I played with some great coaches. Uh Dom Capers. Dom Capers. Um I think Dom Capers, the coach of Carolina, he was a true uh Your responsibility. You know, do your job, so to speak. The way they say New England, do your job. Well, Dom Capers with that Blitzburg defense or the zone Blitz defense. It was predicated on every person being in their gap and doing what you're supposed to do. You know, if you're supposed to be in the A gap, stay in the A gap. You're in the B gap, stay in the B gap, C gap. Don Don't do somebody else's job. That's how they zone bliss is is basically uh it maximizes itself. Uh so uh Dom was more of a um you know X's and O's guy When I played for Mike Shanahan, Mike Shanahan, Denver Broncos, he was more of a player's coach, meaning he'll treat you like a man. He treated everybody like men. And and uh he gave some rules, and as long as you stay within those rules, it was fun. So I always say that Mike Shanahan added years. He'll add years to your career. You know. Well there's some coaching, they just straight take years away from you for their career. Um when it comes to Belichick, Belichick was uh probably one of the greatest coaches that I've come across that was able to make adjustments. Make adjustments. I'm like, I thought he was uh phenomenal in making adjustments. Like we were building a sideline and if something is not working, you know, that's why I always tell people now when we were watching any of the Patriots games, I say, uh oh Bill over there talking to him. Bill talking to him. Whatever they did previously, they're about to change it. So yeah, he's a great adjustment maker. uh of the game. So, you know, I played for some pretty good pretty good coaches, learned something from all of them.",
    "speaker" : "Tyrone Poole",
    "timestamp" : "15:56-18:04"
  },
  {
    "speaker" : "Andy",
    "text" : "You have any good uh Belcheck stories from your time there?",
    "timestamp" : "18:05-18:09"
  },
  {
    "text" : "Wow, you know, again, um, I guess, you know, I'm gonna clear the air on this. A lot of people think uh that Belichick is that uh guy who like does he ever smile? Does he ever, you know The times that I was in New England, I liked it. I liked it. I enjoyed it. But he was the type of guy that He had his funny moments. He had his funny moments. I think I thought he was a good motivator as well. You know, he would come in on Wednesday's practice, which is usually the first actual official practice preparation for Sunday's game and he would always have his film. And these are the people that we need to stop. You know, this guy, he would always have his stories about each guy that we need to stop, you know. And uh, but there's one particular game we're playing against the um uh the uh coats and the um actually it might have been the it's the 2005 it'll be the 2005 uh uh AFC championship game. The 2003 season rose into the 2004 and then 2004 season rose into the 2005, even though it's a 2004 season It's funny how that thing works. But either way, we're playing the coast. And I always tell people Belichick is always, always in the game. And Peyton tries to throw a seven route, a corner route to Marvin Harrison on the left side of the defense. And Rodney Harrison and Tyler Law are on that side. So the ball gets picked off. A lot of people probably see this video. He picks the ball off. Tyler picks the ball off, you know, keeps his balance. And Marvin uh Rotney hits Marvin Harrison and he goes out of bounds right beside Belichick And you don't really see it, you know, from the cameras that they show you on television. You actually see it from the coaches cam. you know, which shows you everything. Yeah, yeah. And it's just amazing how this guy was into the game even at that moment. And um because Marvin had gone out a bounds on our sideline You know, Marvin is the only one in my eyes that could catch or try to make a play on time. So, you know, Belichick, you know, being the smart coach he is you know, creates a little bit of of of of uh uh I call it just being in repositioning himself so that you know Marvin had to actually run through him uh to get there Uh and then another situation just shows how Belichick is so smart. Uh and he's always into the game. We're playing the Denver Broncos in 2003. And uh we're down, I think um uh oh the intentional safety game, right? Yes, yes, yeah, yes, yes That was a smart move because he felt that just how good our defense was. And I tell people, yes, you know, Tom, Tom is uh one of the best quarterbacks I ever played played with. You know, I played with Peyton Manning his his rookie year. Uh uh got stories about Peyton. Uh got stories about Tom, but uh in 2003 I felt like our defense was the strongest uh you know point of that season but in that Denver Bronco game uh yeah Bill elected to go for the uh safety uh which gave broncos the broncos more points but actually bought us more yards so we could do a free kick from the 20 because If not, if he had not given the safety or told the snapper to snap the ball through the uprights, then our punter would have been punted from the back of the end zone, which Broncos probably would have got the ball around the 50 and then boom. You know, a couple plays here and there to kick a field goal or run the clock out. So we get the free kick at the 20. Um uh Delta O'Neal. uh basically uh underestimates the uh ball and it hits start rolling and our defense went out there went three and out And um actually um you know they didn't move the ball at all. The Broncos didn't move the ball at all on the end of punting the ball. We get the ball back on a 50 and then we go down and score a touchdown and win the game. So I'm like, you know, that was good on the field adjustment and knowing what's going on to put your team in a situation of win. So yeah.",
    "timestamp" : "18:09-22:41",
    "speaker" : "Tyrone Poole"
  },
  {
    "text" : "The real question though is how's it gonna feel about you showing up to this podcast a little bit late?",
    "speaker" : "Steve",
    "timestamp" : "22:44-22:48"
  },
  {
    "timestamp" : "22:55-23:02",
    "text" : "The best act, if you look at all kinds of concerts, they never bring the true act on until Steve.",
    "speaker" : "Tyrone Poole"
  },
  {
    "timestamp" : "23:08-24:15",
    "speaker" : "Tim",
    "text" : "Yeah. So Uh Tyrone, so we just uh reviewed week two of uh 2005 and uh in preparation for that I found some interesting um An interesting article in the Boston Globe. It was the Super Bowl rematch from three seasons. So uh hold on. Yeah. So I uh I found a quote from him that he was saying uh in preparation to that week two game. Um He said about you he said that uh you had spit on him uh in the Super Bowl after the first drive. And he said uh about you, he said um Then he started calling me names. He's a Christian and he wasn't cursing at me, but he was just calling me some names that in my book was still cussing. Uh so I said, look here dog, you're gonna shut up and I'm gonna make you shut up. I was hot. I was very hot. Do you ever hear anything about him saying that about you?"
  },
  {
    "timestamp" : "24:15-26:49",
    "text" : "You know what? People will say, you know, what they say. At the end of the day, what I believe is that we are all one fraternity. We're football players. Just like you guys. You guys are one fraternity. You guys are reporters. So your job is to create stories. Our job is, when we're on that field, we're brothers, yeah, we're playing against one another. We get in heated situations. But at the end of the day, when it's all said and done Would we help each other in a tough situation or a situation where, you know what, on the field we were uh gladiators? But off the field, you know what? Hey, how can I help you, my brother? That's what I I I see, and that's what I hear. So at the end of the day You guys are the one that pepper pepper, you know, you kind of pepper and you know you want to get stories. It's like you guys are the ones that want to raise the dead. And uh, but I understand that's what you do, and that's what you guys are called to do. Uh, but it's just like anything, you know, hey. Things happen, uh heat of the moment, uh words are said, or in an article, whatever the case may be. But at the end of the day, um You look at everybody's heart and everybody's mindset, then yes, you know what? We all love each other. So that's why I say we're all one big fraternity. And when you get on the field, uh, I don't care if it's against your brother You know, you're gonna be competitive. Uh you're gonna say things. Especially against your brother. So at the end of the day, um, you know, hey, it's it's war. It's war. And uh, but at the end of the day, When things are over, you know, it's all love. It's all love. So like I said, I'm pretty sure, you know, there's nothing but love. I'm pretty sure Steve saw me on the side of the road and uh I said, hey. flag them down, yeah, you know what? Um he'll help out. Or if I saw him in a situation, I think we would sit and we would help each other out. So it's only the media that uh wants to create chaos because we get it. We get it 100%. That's why you guys never really get true answers out of us because you're not really digging for the truth. What you're doing is you're trying to uh promote and you're actually we all know that negativity. sells papers and if not negative, um, you know, that's what what what happens. But I like the way you guys try to try try try to pull that in. We just wanted to do it.",
    "speaker" : "Tyrone Poole"
  },
  {
    "timestamp" : "26:50-26:53",
    "text" : "We have your back in this 100%, just so you know.",
    "speaker" : "Tim"
  },
  {
    "timestamp" : "26:54-27:05",
    "text" : "I I put it to you like this, there is no story. There is no And this is I don't know if I like to be lumped in with media here. Like just mom who listens to us.",
    "speaker" : "Tyrone Poole"
  },
  {
    "timestamp" : "27:07-27:08",
    "speaker" : "Andy",
    "text" : "Shout out mom rendition."
  },
  {
    "text" : "Yeah, you are you are media. Let's be uh let's be uh I'm I'm media as well. I'm media as well. you know i do i do podcast shows too so uh you know i can easily turn around and say hey you know what there's this guy uh steve on this uh uh patriots uh a podcast, you know, that guy is no good, man.",
    "timestamp" : "27:08-27:28",
    "speaker" : "Tyrone Poole"
  },
  {
    "text" : "You wouldn't be the first.",
    "timestamp" : "27:30-27:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Tyrone Poole",
    "timestamp" : "27:32-29:02",
    "text" : "Get lied, Tyrod. It doesn't look like he brushes hair and uh uh like he uh may have some uh uh some yeah, so The point is what we try to do in the media is, you know, just to understand and let the fans help the fans understand. Yeah. You know, just like with Ray Lewis, you know, people still try to bring stuff up about Ray. Yeah, that's true. But I think people don't talk about the good things. Or what they try to do, just like what, you know, anybody, I'm not gonna point you guys out, but anybody, you know, they try to lull you to sleep, get you in, and normally, to be honest with you, I always try to ask people, okay, when you do an interview. What are we talking about? What are we talking about? Because you never want to be, you know, uh hit with something from left field. And they just call, you know, respect. And um so that's how you get people to come back and that's how you get people to say uh tell other players, you know what, man, don't even mess around with that. But uh at the end of the day, like I said, no matter Anybody, you, uh, and Andy, uh Andrew, uh Kim, you know, Steve. That's something in your past that you know the reason why nobody knows about it because don't nobody know who you are You know, but if somebody were to dig into your past and they'll find out maybe Steve, maybe you uh uh dating somebody who was underage."
  },
  {
    "speaker" : "Steve",
    "text" : "You know, uh you know blame poop with the door open all the time. Like I say one big door open pooping",
    "timestamp" : "29:03-29:10"
  },
  {
    "text" : "I I just want to clarify. I I would have started out with that. I I had I known that that was something that you wanted, uh Tyrone, but I I just found it interesting uh when we were leading up to that. Yeah, no.",
    "timestamp" : "29:11-29:24",
    "speaker" : "Tim"
  },
  {
    "text" : "Were games against your former teams different in any way? Like would you gear up a little bit more for them or Was it just another game?",
    "speaker" : "Steve",
    "timestamp" : "29:27-29:34"
  },
  {
    "timestamp" : "29:35-30:32",
    "speaker" : "Tyrone Poole",
    "text" : "Again, I think uh people actually uh you always want to show up and you want to show out. And if you have a brother, uh I think you want to um Always show your brother that you're better than your brother. Or again, if you've been on a past relationship and say your ex She shows up with a guy who looks a ton better than you, then you know you're gonna try to put your best foot forward or vice versa. Uh if you uh have now a guy can have found another girl and his Previous girlfriend, if they're at the same event, she's gonna make sure that she's looking her best. So I just think that's human, human, humanistic, that's a human characteristic that we show up And uh if we are going against someone that we're familiar with, that we're going to make sure that we always uh put our best foot forward."
  },
  {
    "speaker" : "Steve",
    "text" : "I agree. Um although it's easy to show up your brothers when they're Andy and Greg, though. Just showing up shows them up. Say that one again. I didn't hear you.",
    "timestamp" : "30:33-30:45"
  },
  {
    "text" : "It's easy to show up my brothers. It's not though. Not when you're you, Steve. Good effort though. Um so I think we've covered most of your uh Patrice career, but you've been doing a ton after football. Um so like we we were, you know, we all kind of went down the rabbit hole of all the different things that you've been doing since football. Um and it's quite a list. Um you've written a book. Uh you do athletic and football training, uh, you do keynote speaking. You were on American Ninja Warrior. At the age of forty-seven, which uh I think the three of us will be lucky if we make it to the age of forty-seven. Never mind compete at an athletic event. Um so I think that's really cool. Uh but I couldn't actually find the full um the full episode of that American Ninja Wars. I was curious how uh how you actually fared because it just showed like the beginning, the intro of it, and it didn't actually show you doing the competition. So I was kind of left a cliffhanger. So I was wondering how that worked out.",
    "timestamp" : "30:45-31:53",
    "speaker" : "Andy"
  },
  {
    "text" : "Well you probably have to take that up with uh the Ninja Warrior uh company. Oh, I will write them a letter. Don't you worry. Yeah, I probably want to write them a letter. Yeah. But I made it to the finals. Uh definitely made it to the finals. That's awesome.",
    "speaker" : "Tyrone Poole",
    "timestamp" : "31:54-32:09"
  },
  {
    "speaker" : "Andy",
    "text" : "That is awesome. That's super. Also, I just wanted to point out when I was watching that video, the video I was uh the the view number 328, which felt poetic. Um because every time I see the number 328 come up, uh that is Just the it it's attached to the Patriots now with that uh Falcons comeback. On eight three, maybe yeah. Yeah. Um So yeah, do you have kind of um, like I said, uh uh we we kind of uh asked for questions too from from some of our uh I don't know if they actually listen, but we'll we'll call them listeners. And one of them was uh what would you say is your greatest accompl accomplishment this far in your life, be it football or not football?",
    "timestamp" : "32:09-32:56"
  },
  {
    "text" : "What was my accomplishment crazy accomplishment?",
    "speaker" : "Tyrone Poole",
    "timestamp" : "32:56-32:59"
  },
  {
    "text" : "Yeah, you're kind of your greatest accomplishment so far in your life.",
    "speaker" : "Andy",
    "timestamp" : "32:59-33:02"
  },
  {
    "text" : "So far in life",
    "timestamp" : "33:02-33:04",
    "speaker" : "Tyrone Poole"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "33:04-33:04",
    "text" : "Yeah. Yes."
  },
  {
    "speaker" : "Tyrone Poole",
    "timestamp" : "33:05-37:06",
    "text" : "I actually uh glad you guys actually said that. So um, you know, what I'm about to present, um, you mentioned some of the things, but uh one of the things I have um I created my own label, my own company. Worked at things supplements. You know, for over 22, 22 plus years, fitness, my body was my business. So What my daughter and I have created is a company called Work That Thing and Supplements. Health products and apparel. So um not saying it is crazy, but it's something that um It's a generational thing that, you know, not only does it give her an opportunity to go into, because she's an athlete herself, track uh the 400. uh 200 uh great little uh young female athlete. So she is now in entrepreneurship So she now can build her own image up and now she can sell and be the face of her own company and actually sell her products to other athletes. Because just like we all go and try to find athletes to promote our products, again, she is the face of her own company and she can Always people ask her, hey, how do you run so fast? Well, my supplement company. I take my own supplement. So that's a great thing. The other thing is basically You know, we created our um own um cross-trainers. Cross trainers. So um, you know, Michael Jordan, you know, well, we have our own uh shoe as well so uh entrepreneurship basis called work that theme cross trainers um so it's a very unique very unique shoe very this is the first The first round of shoes. Great cross trainer. And what we also doing with this, we are giving uh back to the um Underserved communities. So what we ask people to do, and you guys, as three of you guys, you guys can more than welcome, you can go to Tyrone Pool 38 Foundation and We're asking people to help sponsor the shoes so that we can give them away for free to the underserved communities. I'm doing a lot of stuff in my hometown of LaGrange, Georgia. Um and actually Atlanta and what I want to do is go to all the cities that I played in. So we're coming to Boston, Carolina, Indianapolis, and the Foundation. um is basically giving back uh to the community. You know, giving back to the community. So um yeah, so some of the crazy things that, you know, uh we've done or I've done uh life after football. uh is to help impact people lives and to uh you know let them know like I said I quit football in high school so to let them know that you still can make it even though you mess up. And in in closing You know, it comes with uh your own box that actually I signed it. I signed the box. So uh this becomes a great uh trading card because there will never be another pair of work that theme uh shoes. At least not the first original pair. You may get the second, third, fourth But you would never get the first original pair. It's like the first original pair of Jordans, you know. There would never be another original pair of Jordans. That is true. uh so those so those are some of the things that um you know me and my kids are doing and uh you know trying to teach them how to be and have an impact uh on society So if you want to call that crazy then uh I don't know like Beyonce say um crazy crazy"
  },
  {
    "text" : "Uh Andy, how many pairs have you bought already? Uh well we're definitely we're definitely gonna sponsor one uh as a podcast. We'll we'll do that so we can get one of these given away to somebody who who deserves it.",
    "timestamp" : "37:10-37:21",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Tyrone Poole",
    "text" : "And also I appreciate you guys even with the uh even with the book. You know, even with the book. I'm like, uh, you know, it's a great powerful read. You know It says ultimate success in the game of life, but really ultimate success is not about money. Ultimate success is about when you achieve what you set out to do. Even though there were obstacles and opposition and uh things that tried to hinder you, uh, that's where you have ultimate success. Um, so whether it's in sports, uh, you know, we had ultimate success in winning Super Bowls, uh, when other teams were trying to hinder, trying to stop. uh delay uh they could delay us but could not deny us so basically that's what this book is all about uh 12 dynamic principles that help you understand How to uh have ultimate success in your life. And one thing I do know is that life is principles Life is based off of principles. We all have our different experiences with those principles, but we all gonna go through the same principles. Some type of trial, test, or temptation. Okay, we just go through the different experiences, but in this book, uh I just share Some of the things that I overcame, you know, financially in poverty, financial uh uh lack of finances, but that didn't stop me. Uh quit football in high school, that didn't stop me. Um Went to a HBCU, that didn't stop me. Um got traded from Carolina to Indianapolis, that didn't stop me. So in life, you're going to have obstacles. W The key is, do you have the right tools to help you overcome those situations and those oppositions? So That's what the purpose of ultimate success in the game of life is. So you guys can check that out as well at Tyronepool38. com. So I would tell people if you can remember my name First name, my last name, and my football number, then you got my website.",
    "timestamp" : "37:21-39:25"
  },
  {
    "text" : "Yeah, we'll we'll put those in the show notes too.",
    "speaker" : "Andy",
    "timestamp" : "39:25-39:27"
  },
  {
    "speaker" : "Tyrone Poole",
    "text" : "All right.",
    "timestamp" : "39:28-39:28"
  },
  {
    "timestamp" : "39:29-39:31",
    "text" : "People have it, they can click on it. That's awesome.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Tyrone Poole",
    "text" : "I appreciate that guys.",
    "timestamp" : "39:31-39:32"
  },
  {
    "text" : "See Andy, first help for you to do every single game from the Patriots Dynasty as an episode. We only have 538 more, whatever it might be.",
    "timestamp" : "39:33-39:42",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "39:42-39:57",
    "text" : "Yeah, no, we can definitely do this. I I feel uh much more inspired now. Uh so this is great. Uh so all right, we we've taken enough of your time, Tyrone. Thank you so much for for being here. Uh boys, did you have any last questions you had for Tyrone before we let him go?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "39:59-40:01",
    "speaker" : "Steve",
    "text" : "No, I've already asked my stupid question."
  },
  {
    "timestamp" : "40:01-40:20",
    "speaker" : "Andy",
    "text" : "Yeah, or questions. All right. Well, Tyrone, thank you so much for being here. This was a pleasure. We really appreciate it. Good luck with all of your uh stuff you got going on. And um do you have any predictions for the Patriots before we let you go this season?"
  },
  {
    "timestamp" : "40:20-41:27",
    "text" : "For this season, yeah, you know, actually, you know, football is one of those games that I tell people, you you gotta play it on the field. Uh Roster-wise, you know, everybody can look good. I've been a part of teams where, you know, we had talent, uh, but there was no chemistry. There was no chemistry. And uh the the the team, if the Patriots continue to develop that chemistry and continue to bring talent on, of course you need talent to win, but you also gotta have that um chemistry uh with the team. So uh I believe that you know Bill is coming down to the end of his um you know his legacy and uh he's been coaching for a long time. Then Bill's like seventy something years old. So um I do believe that he wants to uh you know lead the game on top and he's gonna give those guys everything that he can. So I think the Patriots are gonna have a real good season, but it's gonna be tough. Because everybody is getting better. Even the Detroit Lions are getting better. So uh that says a lot about where football has uh moved into.",
    "speaker" : "Tyrone Poole"
  },
  {
    "text" : "That is true Yeah, they are a bellwether for the NFL and its success. All right, great. Well, thank you again. We really appreciate this. And until next week, we will see you later.",
    "timestamp" : "41:27-41:41",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "41:46-41:47",
    "speaker" : "Tyrone Poole",
    "text" : "That was awesome."
  },
  {
    "timestamp" : "41:47-41:49",
    "speaker" : "Andy",
    "text" : "Thank you. Really appreciate it"
  }
]