[
  {
    "speaker" : "Intro",
    "text" : "All the little kids growing up on the skills Goin Cleveland Rocks, Cleveland Rocks, Jumpin' Jean Jean, Movin James Dean, goin' Cleveland Rocks, Cleveland Rocks, Clevel",
    "timestamp" : "00:00-00:13"
  },
  {
    "timestamp" : "00:15-00:21",
    "speaker" : "Andy",
    "text" : "All right, welcome back to the final episode. I'm Andy Brown. I'm Steve Brown."
  },
  {
    "timestamp" : "00:21-00:29",
    "text" : "I'm Greg Brown. And this is Browns on Brown. Browns on podcast. Nailed it.",
    "speaker" : "Greg"
  },
  {
    "text" : "We get better every time we do that. Good job, guys. So for those that don't know, should have prepped that. If you're jumping in, if you're we prep it every week. I don't know what you're talking about. This that's the best it's ever gotten. Um but uh yeah a lot of practice, about as much practice as our our Cleveland Browns often do. Um and I think the one thing they are practiced at is losing. So we have been going through The worst of the worst Browns football games, the worst losses ever. And we are finally at the end, boys. This is the cream of the crop. What's the opposite of the cream of the crop? The creme de la creme. Bottom of the barrel? Bottom of the barrel. Okay. The worst. The best of the worst.",
    "timestamp" : "00:30-01:18",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:18-01:19",
    "speaker" : "Greg",
    "text" : "The dregs of the coffee."
  },
  {
    "text" : "The dregs of the coffee.",
    "timestamp" : "01:19-01:21",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "These are the grounds in the dregs of the coffee. Yes.",
    "timestamp" : "01:23-01:26"
  },
  {
    "timestamp" : "01:26-01:36",
    "speaker" : "Andy",
    "text" : "We did get nice and crunchy at the end. So it's nice and crunchy. So uh we are each going to present three"
  },
  {
    "speaker" : "Greg",
    "text" : "Well before we get into this, can I propose a question to you guys? Sure. Best character on the Drew Carey show. Who you got?",
    "timestamp" : "01:37-01:47"
  },
  {
    "text" : "Well, since this is a best of the worst, I'm gonna say Mimi.",
    "timestamp" : "01:50-01:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, Mimi sucks. Okay. Everybody knows Mimi sucks. That's what I'm saying. The boss guy, he was kind of sucky too. Craig Ferguson, that guy's got he's legit now. Yeah, Craig Ferguson. Or was legit for a while. He had his own late night talk show So, oh, is it not who's the uh the tall dude? It's one of the two buddies, right?",
    "timestamp" : "01:54-02:15"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, it's the tall dude and then the short whose line is it anyway, right? That guy rules. I think he's the best. Yeah, they're the best. Yeah, he's definitely the best. But he's he's like actual best, which we don't know.",
    "timestamp" : "02:15-02:27"
  },
  {
    "timestamp" : "02:27-02:36",
    "speaker" : "Greg",
    "text" : "How the hell did Drew Gary get a show just for himself is just beyond me. A stand-up comedian? He's giving away sick comms to everybody back in the 90s, huh?"
  },
  {
    "text" : "Yep. It was a dark time for television.",
    "timestamp" : "02:37-02:39",
    "speaker" : "Andy"
  },
  {
    "text" : "He had a likable face.",
    "timestamp" : "02:39-02:40",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "They they still had music on television back then.",
    "timestamp" : "02:40-02:43"
  },
  {
    "timestamp" : "02:43-02:47",
    "text" : "To be fair, I've watched no less than like 50 episodes of that show though. I don't know why.",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh god, yeah. Because he used to be on all the goddamn time. It was like the friends of its day. I don't know, was Friends on at that time too?",
    "timestamp" : "02:47-02:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That might be a stretch. I think Friends is on at the same time and significantly more popular.",
    "timestamp" : "02:55-03:00"
  },
  {
    "timestamp" : "03:00-03:05",
    "text" : "Yeah, and this was probably on directly before or after, which is why yeah, ended up watching it.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "03:04-03:11",
    "text" : "They're groundbreaking comedy too. They had uh a global warming joke before it was even really happening."
  },
  {
    "text" : "I think it was still happening.",
    "timestamp" : "03:11-03:12",
    "speaker" : "Andy"
  },
  {
    "text" : "You explain that, Steve? They just were joking about global warming back in uh the Drew Carey show days.",
    "timestamp" : "03:13-03:19",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:19-03:22",
    "speaker" : "Greg",
    "text" : "Did you re-watch an episode recently?"
  },
  {
    "text" : "No, it's always stuck with me. Where he's like, That's stuck with you. Takes the like air freshener can and spraying it outside and being like, Where's this global warming I've heard about?",
    "timestamp" : "03:23-03:32",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:33-03:35",
    "speaker" : "Andy",
    "text" : "You know what my favorite jokes are? The ones you have to do."
  },
  {
    "timestamp" : "03:37-03:37",
    "speaker" : "Steve",
    "text" : "Uh-huh."
  },
  {
    "speaker" : "Andy",
    "text" : "Beautiful. Did you find it? It looks like you may have.",
    "timestamp" : "03:40-03:47"
  },
  {
    "text" : "This is just a memory. I don't I'm not even sure this is true, but this is fantastic radio. 100% true.",
    "speaker" : "Steve",
    "timestamp" : "03:48-03:53"
  },
  {
    "text" : "Yeah. So this is this is typical Brown's radio.",
    "speaker" : "Andy",
    "timestamp" : "03:53-03:56"
  },
  {
    "timestamp" : "03:56-04:22",
    "text" : "I think you might be right, Steve. Boom. Here we go. I don't know what uh year this was. But Drew carry on global warming. I love Cleveland. The weather is just terrible. They're too cold. All we want to know in Cleveland is where the hell is all that global warming we've been hearing so much about. Boom. That's all they ever do in the winter, stand outside with an aerosol can. That's right. Fuck the grandkids. I'm cold now.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Is that like on the show?",
    "timestamp" : "04:24-04:26"
  },
  {
    "timestamp" : "04:26-04:33",
    "text" : "No, that's it's just a I'm on deadfrog. com slash comedian slash jokeslash Drew Carey.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "04:38-04:40",
    "speaker" : "Andy",
    "text" : "We're a well-sourced podcast."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, he's just taking that joke from his show. That was the exact joke in the show. Or if I said, that probably sniffed out.",
    "timestamp" : "04:41-04:49"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "04:51-04:52",
    "text" : "That didn't fly on Fox."
  },
  {
    "text" : "All right, in these games?",
    "timestamp" : "04:55-04:56",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yes, so Stephen, you have three games to choose to present today. Is that correct? Yes, I All right, where are we starting then? I believe Greg. Bring us back. Oh, Greg is gonna say, all right, so Greg, bring us back to 1999.",
    "timestamp" : "04:57-05:16"
  },
  {
    "timestamp" : "05:16-05:30",
    "speaker" : "Greg",
    "text" : "Oh, okay. The inaugural vintage year. Week one. Ooh, start of the season. The first game back in the NFL. Oh, that's right for the Browns."
  },
  {
    "timestamp" : "05:30-05:33",
    "speaker" : "Andy",
    "text" : "After they left us. Yeah. In the middle of the night."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "05:33-05:58",
    "text" : "And Drew Carey was there, speak of the devil. Oh, hyping up the crowd in the pregame. Monday night game against the Steelers, and he's like rivalry. It's back. If anybody wants to make jokes about Cleveland, you tell them to shut up. And then they lost forty-three to nothing. It They got they got outgained four hundred sixty-four to forty."
  },
  {
    "text" : "Oh no. That's they play it. Steelers. There's a lot of Steelers losses.",
    "speaker" : "Andy",
    "timestamp" : "06:01-06:08"
  },
  {
    "text" : "That's tough.",
    "timestamp" : "06:09-06:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh. Didn't Drew Carey come out onto the field like in a jersey and stuff too? It was like part of the team.",
    "timestamp" : "06:11-06:16"
  },
  {
    "text" : "Yeah, it was like the Monday night hype segment. Oh, he's getting the crowd all riled up.",
    "timestamp" : "06:17-06:23",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "06:24-06:31",
    "text" : "43-nothing. Not not good. That's a quality quality entrance.",
    "speaker" : "Andy"
  },
  {
    "text" : "Their expansion franchise, you know? Yeah. I mean expected somewhat.",
    "speaker" : "Steve",
    "timestamp" : "06:31-06:35"
  },
  {
    "text" : "I guess the expansion I mean it's not like other expansion teams ever Yeah, Drew Carey can't sit up on and go out and play all the positions.",
    "speaker" : "Andy",
    "timestamp" : "06:35-06:43"
  },
  {
    "timestamp" : "06:44-06:45",
    "text" : "He's not taking the snaps behind center.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:46-06:51",
    "text" : "Yeah, it's not like the Jaguars or the Panthers did well in their first C season Drew Carey's doing his part though."
  },
  {
    "text" : "Come on, let's not let's get off his case.",
    "speaker" : "Steve",
    "timestamp" : "06:51-06:53"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:53-07:09",
    "text" : "Oh yeah, that's that's true. I mean, well, as a hype man, I guess he didn't do a great job. That team sounds like it came out flat. I don't know. He brought the hype. All right. That's a quality entry. Quality entry. All right. What else you got, Greg?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "07:09-07:27",
    "text" : "All right, let's fast forward a couple years to 2014. This is I didn't do enough preparation for this. Okay. That's not the one I was thinking of. All right."
  },
  {
    "timestamp" : "07:28-07:29",
    "text" : "I mean there's so many issues.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "07:30-07:52",
    "text" : "2004, week twelve, against Cincinnati. In Cincinnati, they lost the game 58 to 48. They tied an NFL record for the highest losing score in league history. It was the second highest scoring game combined score in league history."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "07:52-07:53"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "07:53-08:13",
    "text" : "And they're down 51 to 48 late in the fourth driving. And Kelly Holcomb throws a pick six to make it 58-48 and they lose. Oh sad Kelly Holcomb's not even the worst quarterback either. Kelly Holcomb's one of the best ones."
  },
  {
    "speaker" : "Steve",
    "text" : "Yes.",
    "timestamp" : "08:13-08:14"
  },
  {
    "speaker" : "Andy",
    "text" : "This is what year was that? Kelly Holson. 2004? I mean, that's just not great.",
    "timestamp" : "08:15-08:23"
  },
  {
    "timestamp" : "08:23-08:29",
    "speaker" : "Greg",
    "text" : "So that is number nine, yes. Well that one's number eight."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "08:29-08:30"
  },
  {
    "text" : "Okay. All right, number seven. Uh, 2007, week three at Oakland. On the last play of the game, Phil Dawson kicks a 40-yard field goal. And it's good. They were down two. Unfortunately, Oakland coach Lane Kiffin has called a timeout from the sidelines right before the ball is snapped. A new rule as of 2007. On the second try, the kick is blocked. After week three, the rule is amended so that this exact circumstance is no longer possible.",
    "speaker" : "Greg",
    "timestamp" : "08:30-09:02"
  },
  {
    "text" : "So wait, wait, wait, wait, wait, wait. So So in 2007, the NFL creates a new rule, which is coaches can call a timeout from the sidelines right before the ball is snapped. Yeah. Yeah. And so week three of this game, the Browns are playing it playing at Oakland. And they're they're down two. And they kick it and it goes through and it's good, but they call the timeout, and then they re-kick it and the kick gets blocked to lose the game. Like that is the worst icing icing's ever worked. Right. And then after that week, they're like, nah, that that rule sucks, so we're not gonna Let that happen ever again, but the score stands.",
    "timestamp" : "09:03-09:49",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "09:50-09:58",
    "text" : "Are you not allowed to do that anymore? You can't do it right before they're about to kick. You can ice them, but you can't like wait till it's right about to be snapped, I'm pretty sure.",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh I think it's the coaches can't do it. Or something like that. I think or maybe it's back, I'm not sure. But of course that would they they'd introduce the rule, fuck the browse, and then get rid of it again. Literally that same week.",
    "timestamp" : "09:58-10:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "10:18-10:21",
    "text" : "Ridiculous. Totally getting phone by the rules all the time."
  },
  {
    "text" : "Factory of sadness. Alright, Gregory, Mr. Brown. Do you have a a third entry into the Browns um Lost Hall of Fame, if you will?",
    "timestamp" : "10:22-10:35",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "10:35-10:42",
    "speaker" : "Greg",
    "text" : "Wasn't that three? That was three. I did three. I did my three. I feel like I just presented a school project."
  },
  {
    "text" : "No, I I did my part All right, see, we're so good at this, I've already lost count.",
    "speaker" : "Andy",
    "timestamp" : "10:42-10:48"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "10:48-10:50",
    "text" : "Very brown counting of you."
  },
  {
    "timestamp" : "10:50-10:54",
    "text" : "Yes, exactly. All right, Steven, Mr. Brown.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "All right So we started in 2007. Let's fast forward 2013. Patriots, probably the worst Patriots team. In one of their in their story dynasty. At this is at New England too, right?",
    "timestamp" : "10:54-11:08"
  },
  {
    "speaker" : "Andy",
    "text" : "In their house.",
    "timestamp" : "11:09-11:09"
  },
  {
    "text" : "On week 14 too, late in the season. Down 26-14. Page to score a touchdown, 61 seconds left, just over a minute. Recover the onside's kick, which we kick right to our own guy, hits him right in the stomach and kicks right back out to the kicker. And then the Pedro score another touchdown 30 seconds later.",
    "timestamp" : "11:10-11:28",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "11:28-11:38",
    "speaker" : "Andy",
    "text" : "This was this was the game that um where Josh Gordon was still actually playing. Didn't he have two really long"
  },
  {
    "text" : "No, you're thinking of the other game where he has like 286 yards receiving and they only score 11 points.",
    "timestamp" : "11:40-11:46",
    "speaker" : "Steve"
  },
  {
    "text" : "No, that that was a different game, yes.",
    "speaker" : "Andy",
    "timestamp" : "11:47-11:49"
  },
  {
    "timestamp" : "11:51-11:57",
    "text" : "But this also I think you had at least one that comes to mind and you say John a lot of yards and they still lose.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "11:57-12:01",
    "speaker" : "Andy",
    "text" : "Yeah, because I think that was that same time frame, that 2014 era was."
  },
  {
    "timestamp" : "12:01-12:09",
    "speaker" : "Steve",
    "text" : "Johnside's kick was the worst part, you know. All you gotta do is do this, hits him right in the bread basket, just middle section, the guy's falling on it."
  },
  {
    "timestamp" : "12:10-12:21",
    "speaker" : "Andy",
    "text" : "Like who was the uh who is the guy for the Colts? Hank Basket? Remember in the Super Bowl? All he had to do was recover the onside's kick against the Saints. Didn't do it. Went right through the basket."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "12:21-12:23",
    "text" : "And uh poor bastard."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:23-12:24",
    "text" : "He was the goat in that one."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "12:25-12:47",
    "text" : "Funny story, my friend was at this game, the Patriots game, and left. Prior to Patriot scoring those points and had to listen from the parking lot. Shout out Mark Fratterelli. And he tried to get back in and they wouldn't let him. That's what he gets. Do you know what time of the game he left?"
  },
  {
    "text" : "I mean it was 19-11, six minutes left in the fourth quarter.",
    "timestamp" : "12:47-12:51",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Yeah. He didn't see either the last two uh touchdowns.",
    "timestamp" : "12:51-12:54"
  },
  {
    "text" : "Fairweather fans, am I right? Mm-hmm. Brutal.",
    "timestamp" : "12:55-12:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "No, there's no fair weather fans in Cleveland. The Browns are there's no fair weather.",
    "timestamp" : "13:00-13:05"
  },
  {
    "timestamp" : "13:05-13:06",
    "speaker" : "Andy",
    "text" : "No. No."
  },
  {
    "timestamp" : "13:06-13:17",
    "speaker" : "Steve",
    "text" : "They wouldn't be leaving a game. No matter how bad they got beat. Uh I don't want to be a bad idea. 2002 wild card. We all remember this. One of the uh only playoff games on this list."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:18-13:18",
    "text" : "Yeah."
  },
  {
    "text" : "To the Steelers. Ending score 36-33. Down 24-7. Come back 29 points, 19 minutes in the game.",
    "timestamp" : "13:18-13:27",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "13:28-13:33",
    "text" : "The Browns are up 24-7. With night. In the third quarter.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, late third. That's tough. You know, it's one of those Early 2000s playoff games, you know, a field's all muddy, everyone's you know Brown Steelers Smash Mouth. Yeah. They just they were up led the whole game and Chris Fumatu Mafala 127 total yards scrimmage and no touchdowns in the regular season in the whole season fullback",
    "timestamp" : "13:34-14:00"
  },
  {
    "speaker" : "Greg",
    "text" : "He's one bad mile follow.",
    "timestamp" : "14:00-14:01"
  },
  {
    "text" : "He had he has more apostrophes in his last name than he had touchdowns on the season.",
    "speaker" : "Andy",
    "timestamp" : "14:02-14:08"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, he has more than one posture, yeah.",
    "timestamp" : "14:08-14:11"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:11-14:16",
    "text" : "Yeah, that's what I'm saying. And then he's the one that's gonna score that last touchdown."
  },
  {
    "timestamp" : "14:16-14:24",
    "text" : "And then Ranton and L throws a two-point conversion. to see all make it three points. Mitchell Brown's never even sniff.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "14:25-14:29",
    "speaker" : "Greg",
    "text" : "Unbelievable. Kelly Holcomb threw for like 400 yards in that game though."
  },
  {
    "timestamp" : "14:29-14:43",
    "speaker" : "Steve",
    "text" : "He did and they said this is they're throwing some bomb. There's a bunch of chippiness before the uh before the whole game started as well. It was just it was just tough. Especially the playoffs, you know, it makes it so much."
  },
  {
    "text" : "Yeah. I mean, because some of these are big blowouts. Some of them are are I like it. Well, so which which would you say is worse? Getting blown out, even if it's at home on Monday night, or You're up big and you you lose in a comeback fashion, like a twenty-eight to three.",
    "timestamp" : "14:44-15:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:07-15:11",
    "speaker" : "Steve",
    "text" : "Yeah, I think you're losing big, you know, because That's worse."
  },
  {
    "timestamp" : "15:16-15:21",
    "speaker" : "Andy",
    "text" : "Right. Yeah. Okay. That's what I'm saying. Yeah. And it's and especially and I think it adds more to it when it's a playoff game."
  },
  {
    "text" : "Oh yeah. The playoffs just ratches either both of those are worse than the the playoffs are worse than both of those, you know, just in general.",
    "speaker" : "Steve",
    "timestamp" : "15:22-15:27"
  },
  {
    "text" : "Yeah, because I don't think this would be a top ten loss if If it was in the playoffs. It's just another they lost 19. They lost a 24-7 lead.",
    "timestamp" : "15:27-15:39",
    "speaker" : "Andy"
  },
  {
    "text" : "It's worse. They're next game on the list. 2001, week eight, Chicago Bears in overtime. 27-21.",
    "timestamp" : "15:40-15:48",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "15:48-15:50",
    "speaker" : "Andy",
    "text" : "I remember this game."
  },
  {
    "text" : "We're up 21-7, one minute to play. Bear score, 32 seconds left. Recover the onside kick and sensing a trend here. And then convert a 34-yard Hail Mary as time expires. tie the game. Tie it. Right.",
    "speaker" : "Steve",
    "timestamp" : "15:50-16:05"
  },
  {
    "speaker" : "Andy",
    "text" : "But it gets worse. It like so so let's just put this into perspective. You're leading 21-7 with a minute to play. 60 seconds, and you're up two touchdowns, and it goes to overtime because they score a touchdown, bears score a touchdown, get the on-size kick, and then throw a Hail Mary, which is also complicated. And then what happened, Stephen?",
    "timestamp" : "16:06-16:30"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "16:30-16:42",
    "text" : "You know, it'd be it'll be one thing if it just ended in one of those overtime, you know, they go drive down, kick field goal, and this kind of whatever you have a chance to touch the ball because that's what the rules were back then. But no, we get the coin toss."
  },
  {
    "text" : "That's not how Brown.",
    "timestamp" : "16:42-16:43",
    "speaker" : "Andy"
  },
  {
    "text" : "Chicago intercepts our screen passer, turns up for a touchdown. Little tip drill style. One guy to the other guy takes to the house. That's why we didn't lose by three. We lost by six.",
    "timestamp" : "16:44-16:54",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. The uh how do you have a screen pass intercepted? Like that's supposed to be",
    "timestamp" : "16:55-17:05"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "17:06-17:08",
    "text" : "Uh poor quarterbacking."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:08-17:12",
    "text" : "It's supposed to be the easiest, like safest pass."
  },
  {
    "speaker" : "Steve",
    "text" : "He was probably trying to throw it in the dirt, but then just slipped and just threw it right at a guy and it bounced up and then they just intercepted it.",
    "timestamp" : "17:12-17:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:19-19:43",
    "text" : "It's just not bad. Oh. All right. Those are great, but I think there's worse. Uh there's another overtime game. And this is where we start getting into not just bad play losing games or anything like that or or even coaching decisions. But this is kind of just getting beat by the league. Which makes things even worse. Even worse because there's already fighting yourself. Yeah, there's already you're already behind the eight ball because you're a Cleveland Brown. And you're battling through and you're you're in these close games and one small decision can change the entire outcome of a game and a season. So we'll start in 2002, week four. This game's at Pittsburgh. Um a lot of Pittsburgh games on this, I'm noticing, but to be expected. Um The Browns took the Steels overtime, 13-13 in the game. They get an interception deep in Steel's territory in overtime, but can't go anywhere with the ball. Get a little um A little conservative with it and Phil Dawson, the usually consistent Phil Dawson, misses a 45-yard field goal. So kind of typical, but this is where it gets bad. Uh the Steelers then drive down the field and attempt to kick a field goal on second down, right? The the Cleveland Browns block the field goal, Steelers recover. Um The apparently it usually when that happens the other team gets the ball, right? So it should be Cleveland ball with a chance to come back and win it. Um, but the referees ruled that since the ball did not cross the line of scrimmage and the Steels didn't try to advance the ball. The Steelers are entitled to kick another field goal because that was only second down, which I guess this is why everybody kicks on second or third down these days. Um so they got another chance to kick on third down, and that attempt is good. Stealers win. So just an arcane random rule."
  },
  {
    "text" : "Second down and ten, kick field goal, get blocked, recover, and then kick on third down. Everybody knows that play, Andy. Yeah. That's right next to the Statue of Liberty.",
    "timestamp" : "19:46-19:58",
    "speaker" : "Greg"
  },
  {
    "text" : "Fucking ladder. Fook ladder intentional field goal block.",
    "timestamp" : "19:59-20:02",
    "speaker" : "Steve"
  },
  {
    "text" : "On the intentional field goal block. The full ski.",
    "timestamp" : "20:03-20:07",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "They call it the blockarouski. The blockaruski. Okay. Yeah Wonder which coach that was. A lot of early 2000s here.",
    "timestamp" : "20:08-20:16"
  },
  {
    "timestamp" : "20:17-20:22",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. Yeah. I mean that was kind of I don't think I can say that."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "20:23-20:31",
    "text" : "A lot of uh John Emanzell brand and weed in there uh there are some embarrassing ones in there."
  },
  {
    "timestamp" : "20:31-21:03",
    "speaker" : "Andy",
    "text" : "There are Uh this is a bad one too. Because this is against Kansas City in 2002. That's the good Kansas City teams with priest Holmes. running it down everybody's throat. Trent Green. Trink Green, I think. And uh Tony Gonzalez, early Tony Gonzalez, when he was like a monster. Wasn't this uh who's there who is that that uh kick returner too?"
  },
  {
    "text" : "The human joystick, rips.",
    "speaker" : "Steve",
    "timestamp" : "21:03-21:05"
  },
  {
    "text" : "Yeah. Who?",
    "timestamp" : "21:05-21:07",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:08-21:10",
    "text" : "I think you're talking about Josh Cribbs.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:11-21:11",
    "text" : "No, no, no."
  },
  {
    "timestamp" : "21:12-21:13",
    "text" : "Dante Hall.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yes, yes, yes, yes. Dante Hall. And so I think the Chiefs were pretty good in 2002 as well. But the the Browns are hanging with them. This is week one opening the season. The Chiefs are trailing our Cleveland Browns 39-37. Last play of the game, Chiefs on their own 47, out of field goal range. So All the Browns have to do is make one stop. And for a minute it looked like that's what happened. So Trent Green under pressure and linebacker Dwayne Dwayne Rudd gets to him. And right before Green goes down, though, he shovels a lateral to one of his linemen. Which I didn't think you could do. I thought that would be an ill ineligible receiver, but okay. Um And then the lineman runs to the 26th of the Browns. You know, time's expired, whatever, game's over. But But in true Cleveland Brown fashion. Dwayne Rudd thought he got the sack, and so he thought the game was over. And as part of his celeb celebration, removes his helmet and throws it, which because the play wasn't over, is an automatic 15-yard penalty. And since the game can't end on a defensive penalty, Chiefs get an untimed down and now kick a chip-shot 28-yard field goal. Because they got the yardage that like the random yardage that the offensive linemen ran. And then plus 15 yards. 28-yard field goal. Lose it on the last play of the game, 40 to 39.",
    "speaker" : "Andy",
    "timestamp" : "21:13-22:55"
  },
  {
    "timestamp" : "22:55-23:02",
    "text" : "It was a 41-yard play. Yeah. That lateral was so so lucky. It wasn't. Oh yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:02-23:06",
    "text" : "Also also that the fact that they were able to come"
  },
  {
    "text" : "To get that many gold. You can't blame Dwayne for celebrating there.",
    "timestamp" : "23:07-23:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. No, exactly. But this is just one of those Stereotypical losses that as a Browns fan just tears your heart up because you were that close. And it almost you almost lost on the technicality, you know? So being a quality team, week one, start the season really well.",
    "timestamp" : "23:11-23:32"
  },
  {
    "timestamp" : "23:33-23:48",
    "speaker" : "Greg",
    "text" : "Well, it's just finding creative ways to lose games, you know? Yeah. Just losing regular. normally getting your ass whipped or whatever, but to get a a sack that wasn't actually a sack with a flick, with a run, with a penalty tacked on. It's just"
  },
  {
    "text" : "It's just silliness. In 2002, this is a Cleveland Browns team that went 9-7. And that's where they made the playoffs, played the Pittsburgh Steelers. And lost 36-33 in the game Greg already talked about. But they win that they win they open the season with that win. Maybe they're 10 and 6. Maybe uh they're not playing in the wildcard. Maybe they're playing second round the playoffs, you know? Who knows? You never know. What could have been. But because I am As we all know, not a fan of referees.",
    "speaker" : "Andy",
    "timestamp" : "23:50-24:26"
  },
  {
    "timestamp" : "24:26-24:28",
    "speaker" : "Steve",
    "text" : "I thought you loved referees, Andy."
  },
  {
    "text" : "Not a fan of referees. Not as a Browns fan. The the worst loss in Browns history. Is against Jacksonville in 2001, week 14. Browns sitting at 500 at 6-6, looking to keep their playoff hopes alive, looking to try get into the playoffs for the first time in a long time. Down 15 to 10, 68 seconds left in the game. Browns are driving. Greg's boy Tim Couch. Tim Sofa, Tim Seti, whatever you'd like to call him. It looks like he appears to complete a three-yard throw to Quincy Morgan on fourth and two from the Jacksonville 12, setting up first and goal. Right? Clock's ticking, tick, tick, tick, tick, tick. Couch hurries everybody to line, spikes the ball. Boom. After he spikes the ball, Terry McAuley, the the head referee, signals that the Morgan completion. Before the spike is under review. Even though the rule is, yeah, once another player's run, the play before can't be reviewed. Like it's over. That's",
    "timestamp" : "24:28-25:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "25:35-25:36",
    "text" : "Yeah, it's in the box."
  },
  {
    "timestamp" : "25:36-27:13",
    "text" : "You've seen teams like the Patriots start running as soon as there's a questionable call, everybody runs up and just like tries to run a play real quick to to get that second playoff before the the play can be reviewed. And this is exactly what happened. But the referee's reasoning is that the replay booth buzzed him before the spike play was run, but he had to confirm it with another official that the buzz had happened before the play was run. And so, of course, this being the Browns, they reviewed the play, overturned the catch, fourth down failed, Jaguars win the game. And at this time, uh, you know, this is in Cleveland, so the the hometown fans, not happy. So they decide to start throwing bottles and other debris onto the field, but mostly bottles. So the referees decide to forfeit the game with 48 seconds still left on the clock. It's like, you know what? Fuck it. Canceling this game. Moving on. Um can't do that. Nope. You sure can't. So this is speaking of this is what I'm talking about. Badly refereed game. The commissioner, Paul Taglia Boo at the time, Taglia Boo? How do you say that? Taglia boo. That's fun to say. Uh but the commissioner actually called the referees and made them go, everybody go back on the field and run. the last forty-eight seconds of the game off. Even though uh the Cleveland fans were continuing to show their displeasure by throwing more and more debris onto the field. So this game is now, you can Google it, you can Google bottlegate. And the video of this will show up.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:14-27:45",
    "text" : "People getting hurt by those bottles. I got a hot take though. Okay. I don't think the fans went far enough. I think this should have burned that fucking place to the ground. I think they should have. Everybody knows once you run another play, that's it. That's it. Everybody knows. If we can't have that feeling of relief. When you watch a live play that might be suspect and then your team snaps the next play. You know that feeling where you're like, well, oh, oh, oh, oh, that's in the past. In the books. I don't even look at a replay.",
    "speaker" : "Greg"
  },
  {
    "text" : "That is a great feeling. Do you take that touchdown off the board too? Exactly.",
    "speaker" : "Steve",
    "timestamp" : "27:45-27:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Huge swing. And of course, as we all know, the Cleveland Browns in 2001 finished 7-9, would not recover from that Jacksonville loss, would lose two out of the next three. and miss the playoffs.",
    "timestamp" : "27:52-28:07"
  },
  {
    "speaker" : "Greg",
    "text" : "Factory of the wanna do some uh honorable mentions here. Give me some honorable mentions, yes please. Okay, 2004. Work week 14, a 37-7 loss. The Browns vanish 17 total yards of offense. Fifteen of them on a garbage time drive after the two-minute warning.",
    "timestamp" : "28:09-28:29"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:29-28:30",
    "text" : "Yes, that was on my list too."
  },
  {
    "speaker" : "Greg",
    "text" : "17 total yards of offense. The the two matchups versus Baltimore in 2003. Wait, wait, wait, wait.",
    "timestamp" : "28:30-28:40"
  },
  {
    "text" : "Before we move on to that. Um that that game was two weeks after Butch Davis had resigned following the 58-48 loss to Cincinnati. And Terry Rabisky was the interim coach. The Browns ran 39 plays for 26 yards of offense. Which is 14 yards lower than their 41-0 loss opening night in 99 to the Steelers. The Buffalo ran 72 plays, including 215 yards of rushing. The Browns had negative three yards of passing offense, mostly because Buffalo recorded seven sacks. The Browns had five turnovers. The previous season low in yardage was against the Jets a month before with 216 yards. Almost 200 yards more than this game. Oh boy. Unbelievable.",
    "timestamp" : "28:40-29:35",
    "speaker" : "Andy"
  },
  {
    "text" : "I have another knowledge. Honorable mention, Greg. See it. Uh Detroit 2005, week seven, 1310. Not not standout the Lions, but Jeff Garcia, the Brown starter year prior, needs to come back. Against the Browns. Gloats about it in the media afterwards. Now even now even the Lions are up and down the nose of the Browns",
    "speaker" : "Steve",
    "timestamp" : "29:35-30:00"
  },
  {
    "text" : "You know, when Jeff Garcia is chirping at you, yeah, you know, you got problems. That's bad.",
    "timestamp" : "30:00-30:05",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "30:06-30:17",
    "speaker" : "Steve",
    "text" : "He earned that for that comeback against us. 1310, all those low-scoring slog fest games and he's in the media afterwards just rubbing salt in the wounds"
  },
  {
    "text" : "Uh 2003, weeks two and sixteen, Jamal Lewis rushes for a combined 500 yards against Cleveland in two weeks. 205 in one game and 295 in the other.",
    "timestamp" : "30:20-30:37",
    "speaker" : "Greg"
  },
  {
    "text" : "Wasn't and wasn't one of those games uh the Andre Davis, the linebacker. Called up Jamal Lewis and basically said something about like I dare you to run it more. Yeah Yeah, exactly.",
    "timestamp" : "30:37-30:52",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "30:52-31:17",
    "speaker" : "Greg",
    "text" : "If you get a certain amount of carries, you're gonna lose. Yeah, they were selling out in the week sixteen game against the run and it just didn't matter. They didn't they didn't have an answer. Yeah. Uh 2013, week 11, 41 to 20 loss. Trying to climb into the playoff race and jumping up to a 13 to nothing lead in the first quarter. The Browns promptly give up 31 points in the second quarter. To Cincinnati."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:21-31:46",
    "text" : "Oh my God. How about uh Baltimore to 2015 week twelve? Um the Browns line up for a 47-yard field goal as time expires. The kick, of course, is blocked and return for a touchdown. To add insult to injury, this is the first field goal all season that rookie kicker Travis Coons had missed. The kick six nullifies an incredibly heads-up game-tying drive by Austin Davis, of all people."
  },
  {
    "timestamp" : "31:46-31:52",
    "speaker" : "Steve",
    "text" : "Not good. Dawson Davis, not the worst quarterback we've ever had."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:54-31:56",
    "text" : "I mean, I guess you can't Mr."
  },
  {
    "timestamp" : "31:56-31:56",
    "speaker" : "Greg",
    "text" : "Anderson."
  },
  {
    "text" : "Mr. Anderson. I know there's so many weeding. He's gotta be up there.",
    "speaker" : "Steve",
    "timestamp" : "31:59-32:05"
  },
  {
    "speaker" : "Intro",
    "text" : "Mm-hmm.",
    "timestamp" : "32:05-32:05"
  },
  {
    "speaker" : "Steve",
    "text" : "The old rookie.",
    "timestamp" : "32:06-32:07"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:07-32:12",
    "text" : "Yep. I mean the drive. We didn't even mention the drive."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh I think we're in the uh the expansion restart browser. That's too much to unpack if you go back to the first iteration of the Browns too.",
    "timestamp" : "32:12-32:21"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "32:21-32:41",
    "text" : "Right. And then the very next year they're playing the Broncos again. Yeah. And they're and they're about to go in for a score. And Ernest Bayer uh Biner fumbles at the one-yard line with like a clear path into the end zone. Yeah, it's a tough look. That one could be the worst whenever."
  },
  {
    "timestamp" : "32:44-33:19",
    "speaker" : "Andy",
    "text" : "Um Cincinnati 2011 week one. Cincinnati backup quarterback Bruce Gradkowski, the one who actually started for the Cleveland Browns. Notice that the Cleveland defense is slow out of the huddle and thus rushes to the line and quick snaps the ball for an easy go-ahead touchdown to win 27-17. And when Greg Kowski started for our Cleveland Browns, he lost 31-0. So to get beat by a quarterback who couldn't play quarterback for you. Tough luck."
  },
  {
    "text" : "There's the uh recent game in 19 against the Patriots. We had the three turnovers from Nick Chubb in Oh yep in the rain. Or he had that nice long run. He was about to score and after he fumbled the first snap of the game or whatever and then gets a punched out. And then he has that screen pass hit him right in the face or he gets kicked in the face. Yeah. Oh, in the first quarter.",
    "timestamp" : "33:21-33:43",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "33:43-33:50",
    "speaker" : "Andy",
    "text" : "Oh yeah, they had a uh the shovel pass intercepted. Yeah, shovel pass interception, yep. That was bad."
  },
  {
    "text" : "Uh shout out to uh can we uh give some props to this guy that put this list together?",
    "timestamp" : "33:53-33:59",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "34:00-34:01",
    "speaker" : "Andy",
    "text" : "Yes, I think we should."
  },
  {
    "timestamp" : "34:01-34:28",
    "speaker" : "Greg",
    "text" : "Yeah Yes. Yeah, we are we're pulling these from a list of every Browns lost since nineteen ninety-nine ranked. So this this guy. Do you see his name, Andy? Mm I N I I N C K looks like Nick spelled incorrectly. He went through and ranked them uh all hundred and eighty-six losses."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, there's a lot of these. This is through the 2015 season.",
    "timestamp" : "34:28-34:32"
  },
  {
    "timestamp" : "34:33-34:55",
    "speaker" : "Greg",
    "text" : "Yeah, so I mean there's definitely more ever since then. But so 99 to 2015. So there should be some since then, but he's he's gone through It is worth a read. I mean you can just look, you could say uh Brown's loss is ranked if you want to go through and like read these, but he's gonna go play every single game."
  },
  {
    "speaker" : "Andy",
    "text" : "We'll put a thing in the show notes. a link for these. Yeah, and it's it's it's it's thorough.",
    "timestamp" : "34:55-35:03"
  },
  {
    "timestamp" : "35:03-35:09",
    "speaker" : "Greg",
    "text" : "It's it's thorough. It's depressing. Yeah. Yeah. You'll laugh, you'll cry. Yeah."
  },
  {
    "text" : "And you'll not want to be a Browns fan.",
    "timestamp" : "35:09-35:10",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:11-35:14",
    "text" : "I don't know though. I don't know. This is the year.",
    "speaker" : "Greg"
  },
  {
    "text" : "This is the year, yeah.",
    "timestamp" : "35:14-35:16",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. I agree. Coming off a playoff win, coming off a, you know, battling the Chiefs to the To the last drive of the game. Right.",
    "timestamp" : "35:16-35:26",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "35:26-35:30",
    "speaker" : "Steve",
    "text" : "The Steelers are, you know, Ben Rothesburg is wicked old. Yep."
  },
  {
    "speaker" : "Greg",
    "text" : "OBJ's coming back. Yeah. Oh yeah. This is the year. I can feel it. I can't wait until they fall apart in some creative way this year. It's a matter of time, isn't it?",
    "timestamp" : "35:30-35:46"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:46-36:12",
    "text" : "Yeah. Yeah, just Just the fact that uh it wasn't Hugh Jackson was in the news today, actually. It was complaining, yeah, basically complaining that he didn't really get uh a fair shot Um what? Did it get a fair shot? I mean he he only went one in thirty-two is about to turn it. One win in two seasons. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that's more than fair. I think he's got the fairest shot of anybody ever.",
    "timestamp" : "36:12-36:17"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "36:18-36:21",
    "text" : "Yes. Himmant and Jeff Fisher have had the most fair shots."
  },
  {
    "text" : "Yeah. That's incredible. Shout out Tim Couch. He got a he got a put through the ringer. Kelly Holcomb too. Kelly Holcomb. How many names do you think you can name on the on the famous jersey?",
    "speaker" : "Greg",
    "timestamp" : "36:21-36:36"
  },
  {
    "text" : "No, man. Alright, here you go. Hugh Jackson says Brown's ownership lied to him about the rebuilding process. I guess he thought.",
    "timestamp" : "36:38-36:44",
    "speaker" : "Andy"
  },
  {
    "text" : "Well. Rebuilding means coach too, buddy.",
    "timestamp" : "36:44-36:47",
    "speaker" : "Steve"
  },
  {
    "text" : "Accused Browns are of lying to him about the nature of the rebuilding process in Cleveland. Jackson said I'm just gonna bring this up Shut up. Jackson said in Cleveland that the extent to which the decision makers would use analytics wasn't disclosed to him when he took the job. There's no doubt I was lied to by ownership and leadership of the team, Jackson said. They were going to be football plus analytics, but it was football verse analytics. Jackson said he plans to publish a book about his experience in Cleveland, a story he says hasn't been accurately told. I think I became the fall guy because that was the narrative. The truth needs to come out for other minority coaches. They need to know the pitfalls out there. My story has affected some of their futures, Jackson said. Jackson said he signed a contract extension in the middle of the 2017 season when the Browns were 0-8 and had gone 1-15 the year before, but Haslam wouldn't announce the deal. I got a contract extension at 1-23 midway through the season, Jackson said. I wanted to go public with it, but the Browns didn't. I can't imagine why. There's little doubt that Haslam deserves a fair amount of the blame for the Browns lack of success since he bought the team. But the reality is a lot of coaches have cunning come and gone since Haslam bought the Browns, and none has had as bad a record as Jack.",
    "speaker" : "Andy",
    "timestamp" : "36:47-38:01"
  },
  {
    "text" : "Yeah, that's a good thing. But yeah, and the nerds sucked at it too. They both sucked. The nerd sucked. He sucked. Everybody sucked. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "38:01-38:08"
  },
  {
    "speaker" : "Greg",
    "text" : "Were you under the impression that this wasn't like a results-based? industry that you're in. You thought that, you know, ah, they'll just let me go through two seasons without winning games. Yeah.",
    "timestamp" : "38:11-38:22"
  },
  {
    "timestamp" : "38:23-38:49",
    "speaker" : "Andy",
    "text" : "Yeah. I'm curious to know how that uh how that how that um contract talks went. Like, well, you did manage to win a game, but you also have lost 23 others and you're 0-8 this season. But sure, no, let's talk about next year. That's a great idea. Yeah, no, we'll we'll just we'll definitely uh we'll definitely put together the contract uh extension for next year. We're just uh let's let's not tell anybody about it."
  },
  {
    "speaker" : "Steve",
    "text" : "But do you think his bet about jumping in the lake was part of that contract negotiation? Did he like make that part of his deal or he's like, well, I'll do this, but you guys won't you guys won't say anything, but then I can go on the on the radio and say that if we lose, I'll go jump in the lake. And they're like hi, deal.",
    "timestamp" : "38:49-39:07"
  },
  {
    "timestamp" : "39:07-39:16",
    "text" : "You know what? I I respect Brown's fans for leaning into it. You know? Yep. I mean you got it at this point, right? Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "39:16-39:17",
    "text" : "You can't not. It's like being a few.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It's better than being mediocre. I'd rather be a Browns fan than like I don't know, a Dolphin.",
    "timestamp" : "39:18-39:23"
  },
  {
    "text" : "Chargers fan, yeah. Yeah. Bills fan. The Jets. Getting to four Super Bowls and losing them all in a row.",
    "timestamp" : "39:23-39:29",
    "speaker" : "Andy"
  },
  {
    "text" : "The Jets are still hanging on to Joe Namath, fucking Super Bowl three.",
    "timestamp" : "39:29-39:33",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, the yeah.",
    "timestamp" : "39:33-39:34",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Hang on. Any excuse? Dude, Charlie Charlie Fry started 13 games one year. That's crazy.",
    "timestamp" : "39:39-39:46"
  },
  {
    "timestamp" : "39:46-39:49",
    "speaker" : "Suzy Kolber",
    "text" : "What does it mean to you? Now when the team is struggling."
  },
  {
    "speaker" : "Joe Namath",
    "text" : "I want to kiss you. I couldn't care less about the team struggling. What we know is we can improve. Chad missed Chad Pennington our quarterback missed the first part of the season and we struggled. We're looking to next season. We're looking to make a a a noise now and I want to kiss you.",
    "timestamp" : "39:50-40:16"
  },
  {
    "speaker" : "Suzy Kolber",
    "text" : "Thanks, Joe.",
    "timestamp" : "40:16-40:17"
  },
  {
    "text" : "I want to kiss you.",
    "speaker" : "Joe Namath",
    "timestamp" : "40:20-40:21"
  },
  {
    "text" : "Thanks, Joe. Joe Namath, part of the Ford B.",
    "speaker" : "Suzy Kolber",
    "timestamp" : "40:21-40:25"
  },
  {
    "text" : "What are the Jets doing? Well, we're struggling.",
    "timestamp" : "40:26-40:29",
    "speaker" : "Joe Namath"
  },
  {
    "text" : "Well, we're struggling. What we Oh yeah, never pass up a done opportunity to shit on the Jets.",
    "speaker" : "Steve",
    "timestamp" : "40:29-40:36"
  },
  {
    "text" : "No, no. No, especially that.",
    "speaker" : "Andy",
    "timestamp" : "40:36-40:39"
  },
  {
    "timestamp" : "40:39-40:51",
    "speaker" : "Greg",
    "text" : "I think the second part's funnier where he's like I couldn't give a shit about the jets. It's like uh that that's kind of why we're interviewing you. You're supposed to though."
  },
  {
    "speaker" : "Joe Namath",
    "text" : "Looking to next season. We're looking to make uh uh a noise now and I wanna kiss you. I wanna kiss you. I couldn't care less about the team struggling. I couldn't care less about the team struggling. I couldn't care less about the team struggling.",
    "timestamp" : "40:51-41:10"
  },
  {
    "speaker" : "Andy",
    "text" : "That might be like the worst part of all of it too, because he's supposed to be the face of the franchise. He's Joe Namon. The only success they've ever had came through him.",
    "timestamp" : "41:10-41:19"
  },
  {
    "timestamp" : "41:19-41:27",
    "text" : "The Browns have had some good players and some, you know, storied history. That's why it's so bullshit that they got moved to Baltimore.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. Oh yeah. Yeah, fuck Baltimore.",
    "timestamp" : "41:27-41:30"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, they had Brian Hoyer for a couple years.",
    "timestamp" : "41:30-41:33"
  },
  {
    "text" : "Oh yeah. Hoyer the destroyer, baby.",
    "speaker" : "Andy",
    "timestamp" : "41:33-41:36"
  },
  {
    "text" : "Mm-hmm.",
    "timestamp" : "41:36-41:37",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "41:38-41:39",
    "text" : "Oh good.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "41:39-41:52",
    "text" : "Some legendary names in that quarterback uh list. No. Yeah. Give them to me. Give me that list. Tim Couch, Kwit Ty Dapmer, Doug Peterson."
  },
  {
    "timestamp" : "41:53-41:53",
    "speaker" : "Steve",
    "text" : "Yeah. Yep."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "41:53-42:07",
    "text" : "Spurgeon win one of the Brady seven. Kelly Holcomb, who was probably the best one. Garcia, Luke McCown. That's not the McCown, right? The McCann? The one that like just retired."
  },
  {
    "timestamp" : "42:08-42:08",
    "speaker" : "Steve",
    "text" : "Josh."
  },
  {
    "timestamp" : "42:09-42:38",
    "speaker" : "Greg",
    "text" : "Yeah. Trent Dilfer. Charlie Fry started 13 games. Derek Anderson, Brady Quinn, Ken Dorsey, Bruce Kodkowski, Seneca Wallace, Colt McCoy, all-time NFL quarterback name. Yep. Weep there was Spurgeon win. Thad Lewis. Hilarious. Jason Campbell. Saturday games. Another McCown, Josh McCown."
  },
  {
    "timestamp" : "42:38-42:40",
    "speaker" : "Steve",
    "text" : "I knew that both McCowns."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "42:40-42:46",
    "text" : "Yeah. Brian Hoyer, Johnny Manzel, Connor Shaw. So who was Davis?"
  },
  {
    "timestamp" : "42:46-42:56",
    "speaker" : "Andy",
    "text" : "Who's the best quarterback on that list? Who's the most successful quarterback on that list? It's kind of Derek Anderson?"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean with the Browns? Yeah, yeah, yeah, yeah. Derek Anderson had like a decent year one year. Yeah, I think Kelly Holcomb played pretty well. Yeah. He wasn't as bad as people think.",
    "timestamp" : "42:57-43:10"
  },
  {
    "timestamp" : "43:11-43:12",
    "speaker" : "Andy",
    "text" : "Spoke like a true brown."
  },
  {
    "timestamp" : "43:13-43:15",
    "speaker" : "Steve",
    "text" : "Relatively relatively okay."
  },
  {
    "timestamp" : "43:15-43:18",
    "speaker" : "Andy",
    "text" : "Good save. Oh boy."
  },
  {
    "timestamp" : "43:18-43:28",
    "text" : "RG3, double first round pick draft. That's that's a tough one, right? The first one that they came away with was Trent Richardson and Brandon Wheaton.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, but then they traded him for a first round pick. And then they use that pick to tri to move up to get Johnny Manzell. Did you see the the play with them recently? No. This past week. He's in I don't even know what fucking league he's in these days.",
    "speaker" : "Greg",
    "timestamp" : "43:29-43:48"
  },
  {
    "timestamp" : "43:49-43:53",
    "speaker" : "Andy",
    "text" : "He's in the the one where the fans can can pick the plays, right? Yeah. Fan control."
  },
  {
    "timestamp" : "43:55-44:24",
    "text" : "Yeah. It's like a weird like Seven on seven thing. But there's like a snap that went over his head. He goes back to pick it up and like can't quite scoop it. And there's like two guys running at him and he legit just stops and like walks away. They like recover it. He doesn't he just like he's not even looking at the play anymore. He's just like It's like the Cam Newton Super Bowl one on steroids. It's so funny. I love that.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, it's uh fan-controlled football, professional indoor football league created in 2017. And uh played in Duluth, Georgia, broadcast on Twitch.",
    "timestamp" : "44:24-44:36",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Broadcast on Twitch.",
    "timestamp" : "44:37-44:38"
  },
  {
    "text" : "Yeah. But yeah, the fans I think vote on The plays and they and like the most popular plays the one that gets called. Oh, rock, paper, scissors replaces the coin toss. Um seven men playing each side of the ball, like you said. Three men on the offensive line. Each team has one timeout. The team can also have access to three power-ups of fifth down. Flip the field, which moves the ball back to the offensive team's 10-yard line, or power play, which forces the opposing team to play the next play with only six players. No kicking, no punting. All offensive possessions that do not result from turnovers begin on the 10-yard line.",
    "timestamp" : "44:38-45:18",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "45:19-45:25",
    "text" : "Damn. Let's shop fucking around and just bring back slam ball. Yes. Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:25-45:29",
    "text" : "Quite possibly the most American sport ever, slamball?"
  },
  {
    "speaker" : "Greg",
    "text" : "Slamball ruled.",
    "timestamp" : "45:29-45:31"
  },
  {
    "speaker" : "Andy",
    "text" : "High scoring, high flying, uh, full contact.",
    "timestamp" : "45:31-45:36"
  },
  {
    "timestamp" : "45:37-45:40",
    "speaker" : "Greg",
    "text" : "They didn't really make sense, which was great."
  },
  {
    "text" : "No, yeah. A bunch of like rules that were just there to be rules.",
    "speaker" : "Andy",
    "timestamp" : "45:40-45:44"
  },
  {
    "timestamp" : "45:45-45:46",
    "speaker" : "Greg",
    "text" : "Yeah. A lot of knee injuries."
  },
  {
    "speaker" : "Andy",
    "text" : "A lot of injuries. I think the reason they went under is because some guy Like his foot got severed off. Hell yeah. In like practice.",
    "timestamp" : "45:47-45:56"
  },
  {
    "speaker" : "Greg",
    "text" : "Rocket Ishmael. He was a coach. Yeah.",
    "timestamp" : "45:57-46:00"
  },
  {
    "timestamp" : "46:01-46:03",
    "text" : "Johnny Manzell cleared his cell phone.",
    "speaker" : "Steve"
  },
  {
    "text" : "Did you watch it? Post it in the post it in the chat. Put this in the show notes too.",
    "speaker" : "Andy",
    "timestamp" : "46:04-46:10"
  },
  {
    "text" : "It's it's better than Jay Cutler's one where he's like wicked disinterested.",
    "timestamp" : "46:10-46:15",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "46:15-46:24",
    "speaker" : "Steve",
    "text" : "Yeah. But yeah, it is like it is like that. He's just like whatever. The best part is it's not the end of the play too. That makes it so much better"
  },
  {
    "timestamp" : "46:24-46:35",
    "speaker" : "Greg",
    "text" : "And you knew he went back to the silence. Coach was like, dude, what the fuck? And he's like, I don't care. He's like, I'm the only marketable person you have in this league. Get fucked."
  },
  {
    "speaker" : "Andy",
    "text" : "Literally the only name.",
    "timestamp" : "46:36-46:37"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, it's probably true. Yeah.",
    "timestamp" : "46:38-46:40"
  },
  {
    "text" : "That highlight probably brought more attention to this league than anything else. Yep.",
    "speaker" : "Steve",
    "timestamp" : "46:41-46:45"
  },
  {
    "speaker" : "Greg",
    "text" : "I agree. I think that's good for the league. They need more of that. As crazy it is to say, they need more wicked selfish play from washed up all stars.",
    "timestamp" : "46:45-46:59"
  },
  {
    "speaker" : "Steve",
    "text" : "Ron James is like, what? Oh wait, sorry, it's a Cleveland thing. LeBron James didn't never say that. He's the golden boy. We still forgive him for the first time.",
    "timestamp" : "47:01-47:11"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, don't get me started on LeBron James. The decision that's gotta be on the Cleveland list. Yeah.",
    "timestamp" : "47:11-47:20"
  },
  {
    "text" : "All right, anything else? Are we gonna mercifully end this like um experiment in misery Yeah, we'll end this in the same way that the Browns often end their their season. And by that I mean suddenly. See you later.",
    "timestamp" : "47:24-47:44",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Intro",
    "text" : "Yeah later.",
    "timestamp" : "47:44-47:45"
  }
]