[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17"
  },
  {
    "text" : "Welcome back to the Pages Dynasty Podcast. This is a special off-season episode, I guess we'll call it. Book club episode. Yeah. Um so for all the all you numpties that kept telling us we we couldn't read, uh we're here to prove you wrong, except maybe Steven. We'll find out. Um I'm I'm my guess for this is that Steven for these types of podcasts is going to be like Greg, where he didn't read the book, he just shows up.",
    "timestamp" : "00:23-00:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Exactly. I read the back of it.",
    "timestamp" : "00:52-00:54"
  },
  {
    "speaker" : "Andy",
    "text" : "You see you looked at the pictures and that was enough. It's like Greg watching highlights. Um, but yeah, so this is book club week. Uh and since Greg, I think this is mainly driven by you. So do you want to do the honors of introducing us to what we're going to be reviewing today?",
    "timestamp" : "00:55-01:12"
  },
  {
    "timestamp" : "01:13-01:25",
    "speaker" : "Greg",
    "text" : "Sure. Yeah, so we stumbled across this at um one of the previous podcasts, but Essentially it started with uh a gronking to remember, right?"
  },
  {
    "timestamp" : "01:26-01:26",
    "speaker" : "Andy",
    "text" : "Correct."
  },
  {
    "timestamp" : "01:26-01:48",
    "speaker" : "Greg",
    "text" : "And then we're like, well, let's see if there's any other ones out there. And we came across An erotic uh romance novel titled Dabin with Cam by Caroline Blue. Now I don't know if we want to call it a novel. Do we want to call it a novel?"
  },
  {
    "timestamp" : "01:48-02:15",
    "speaker" : "Andy",
    "text" : "I was gonna say novella? Cause me and Steve bought the uh the Kindle version and doesn't really give you page numbers. But you actually bought the physical copy. How how much was that first of all? Because yeah, because it was two ninety nine on Kindle. If anybody else wants to uh to read along with us. You can pause it right now and go on Amazon and it's $2. 99. Dabbing with Cam. But how much was the actual physical book?"
  },
  {
    "timestamp" : "02:16-02:18",
    "text" : "Uh I think it was nine dollars.",
    "speaker" : "Greg"
  },
  {
    "text" : "All right. Nine dollars well spent. Yes.",
    "timestamp" : "02:19-02:21",
    "speaker" : "Andy"
  },
  {
    "text" : "How many pages funny do you get for nine dollars? Well It doesn't have page numbers. There's no chapters, there's no page. That's why I'm hesitant to call it a novel, because it's more like just a long essay, I would say.",
    "speaker" : "Greg",
    "timestamp" : "02:22-02:40"
  },
  {
    "speaker" : "Andy",
    "text" : "It's like a printed out blog.",
    "timestamp" : "02:41-02:43"
  },
  {
    "text" : "Yeah, yeah, that's what it is. I mean it seemed like it's like how long it takes to read it, guys. It was like Half an hour tops.",
    "speaker" : "Greg",
    "timestamp" : "02:43-02:52"
  },
  {
    "timestamp" : "02:52-02:56",
    "text" : "Yeah. Well, longer for Steve, but yeah. I'd say about that.",
    "speaker" : "Andy"
  },
  {
    "text" : "I do have one criticism. No pictures in it. Yeah. Except for the cover.",
    "speaker" : "Steve",
    "timestamp" : "02:57-03:01"
  },
  {
    "text" : "Except for the cover, yeah. Which I I think Yeah, you want to describe the cover, Andy? Yeah, this is uh an audio medium. We understand that. But the cover is uh I was actually just looking it up um because uh on the first like inside cover page I think is probably what it is. Uh it says all images are fully licensed from 123rf. com. And that's definitely where they got these images for the cover because that is a stock photo. website. But it is a stock photo of um a black man, a handsome looking black man, not Cam Newton. Not Cam Newton. Oh Looks just like it doesn't. That's probably racist, Stephen. And there is uh another attractive Kind of normal looking white woman with her head on this black man's shoulder with her arms draped around him. And then it kind of fades down below into that into a football field with a very another stock photo of Uh uh a black man in a black uniform, black helmet with a white number one on it, who looks like he's throwing a football incorrectly. I don't know how you would throw a football grabbing it like that, almost like from the end of it.",
    "timestamp" : "03:03-04:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Like a lefty throwing a football right-handed.",
    "timestamp" : "04:21-04:23"
  },
  {
    "timestamp" : "04:24-04:56",
    "speaker" : "Andy",
    "text" : "Yeah, and then I I like it feels like this was made with um Photoshop elements like the the cheap version of Photoshop that you can get like the online version and you just kind of like took a couple of pictures of the the the normal people And like threw together. Oh, this has this is a romance between these two people, so we'll put those in there. It has football, so we'll put that in there. And then we'll put the text over it, which is just like Like a stock text as well. Font, if you will."
  },
  {
    "timestamp" : "04:56-04:59",
    "speaker" : "Steve",
    "text" : "So MS and Microsoft Paint?"
  },
  {
    "timestamp" : "05:00-05:03",
    "speaker" : "Andy",
    "text" : "Yeah, yeah, that would work. You could you could make this in Microsoft Paint."
  },
  {
    "text" : "Yeah. And then the the back, like the description are all is just like eight or nine different puns about football and sex. So like football's a game of inches, but not in Cam's case. After after a false start, it's first and long. Or will he drop back and hit the tight end? Like just the Just the worst puns.",
    "timestamp" : "05:04-05:28",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "05:29-05:30",
    "speaker" : "Steve",
    "text" : "That's the entire back."
  },
  {
    "text" : "No, there's no synopsis really. I mean, I guess you could make the argument that it's kind of a synopsis, but every single sentence is a pun.",
    "timestamp" : "05:32-05:38",
    "speaker" : "Greg"
  },
  {
    "text" : "But I thought that was most of the book right there.",
    "timestamp" : "05:39-05:41",
    "speaker" : "Andy"
  },
  {
    "text" : "Which I mean it makes sense. Yeah, they're getting their they're going to their directly to their target audience, right? Is people buying this to just laugh for us.",
    "timestamp" : "05:42-05:50",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "05:54-06:01",
    "text" : "So you think the book has seen a spike in sales since Cam got traded? Or Sound of the Pats?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "06:01-06:05",
    "text" : "No, but I think it's about to. Well it did because the three of us bought it.",
    "speaker" : "Andy"
  },
  {
    "text" : "It's about to in Slovenia.",
    "speaker" : "Steve",
    "timestamp" : "06:05-06:07"
  },
  {
    "timestamp" : "06:11-06:13",
    "speaker" : "Greg",
    "text" : "In Slovakia, Steve."
  },
  {
    "speaker" : "Steve",
    "text" : "Well Slovenia is next, right?",
    "timestamp" : "06:14-06:16"
  },
  {
    "text" : "Yeah, we are.",
    "timestamp" : "06:16-06:16",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "It's out Albania.",
    "timestamp" : "06:16-06:18"
  },
  {
    "speaker" : "Greg",
    "text" : "Look out, Montenegro.",
    "timestamp" : "06:19-06:20"
  },
  {
    "text" : "We're big in Eastern Europe. The Ukraine's gonna go hot for this.",
    "timestamp" : "06:21-06:26",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That's right.",
    "timestamp" : "06:27-06:27"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:35-06:43",
    "text" : "So this is Wait, Caroline Blue isn't her real name?"
  },
  {
    "timestamp" : "06:43-06:52",
    "text" : "So that that's the one thing I wanted to talk about too. I looked up the author. It was Caroline Blue, which I don't think Well you want to pause for a second, Andy?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "06:52-06:55",
    "text" : "Your audio just you your audio just changed."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:55-06:58",
    "text" : "Yeah, it's like cutting in and out a little bit. Fuck."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh hang on.",
    "timestamp" : "06:59-07:00"
  },
  {
    "text" : "It just got quieter like you stopped using your mic or something.",
    "timestamp" : "07:00-07:03",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. And like earlier it was getting that, you know, good garbled.",
    "timestamp" : "07:03-07:08"
  },
  {
    "text" : "This is fun. Is it better now? Yeah.",
    "speaker" : "Andy",
    "timestamp" : "07:09-07:14"
  },
  {
    "text" : "Yeah, I mean it sounds fine now. All right. Fuck.",
    "speaker" : "Greg",
    "timestamp" : "07:14-07:17"
  },
  {
    "text" : "This has been my day today.",
    "timestamp" : "07:20-07:21",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:22-07:27",
    "speaker" : "Greg",
    "text" : "I can also hear your sighs very loudly. I don't know if you just sigh into the mic, but it's like"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm actually putting my mic further away.",
    "timestamp" : "07:29-07:30"
  },
  {
    "text" : "At least he's not doing this the entire fucking time, right? That's true. Like Steve, huh? Good one. Jerking off Mike, typical. I was told to talk into the microphone. So I'm talking into the microphone. All right.",
    "speaker" : "Greg",
    "timestamp" : "07:31-07:52"
  },
  {
    "text" : "What are we talking about? Oh the author.",
    "speaker" : "Andy",
    "timestamp" : "07:52-07:54"
  },
  {
    "text" : "Caroline Blue.",
    "timestamp" : "07:56-07:58",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:58-08:27",
    "text" : "So yes. So I looked up Caroline Blue. Because it felt a little shady to me that the author was Caroline Blue, but if you paid attention carefully enough, which was hard to do, I understand reading this, uh, but the main character in this was also named Caroline Blue. So either she wrote this book about herself. Fuck me. Uh all right, give me a second. I'm gonna have to go inside."
  },
  {
    "text" : "Can you hear us when we say something? You sound like you have a delayed response to the right.",
    "timestamp" : "08:28-08:34",
    "speaker" : "Greg"
  },
  {
    "text" : "Right, Stevie? I have no idea then. Hang on. I'm going inside.",
    "timestamp" : "08:34-08:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Okay.",
    "timestamp" : "08:40-08:40"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "08:47-08:49",
    "text" : "Whose dog is that, Steve?"
  },
  {
    "timestamp" : "08:49-09:01",
    "text" : "Scott. He's in Acadia. In the what? He's in Acadia National Park. Oh cool. He goes every Columbus day. I think I'm gonna go next year.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "09:01-09:05",
    "text" : "That's pretty cool. You should go do some some leaf peeping."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, he goes with his parents and he goes hiking they stay like a B and hike for like ten days. An Airbnb?",
    "timestamp" : "09:06-09:12"
  },
  {
    "text" : "No like a bed and breakfast. Like a legit B and B.",
    "timestamp" : "09:13-09:16",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "09:18-09:18",
    "text" : "It sounds like"
  },
  {
    "timestamp" : "09:20-09:24",
    "speaker" : "Greg",
    "text" : "You hear your buddies coming down here possibly? Oh yeah, I meant to text him."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, yep. He texted me. Yeah, I gave me your number. It's he was supposed to get married that weekend. Oh. Pre-COVID. Yeah. So like his fiance wants to get out of the, you know, do something instead of just sitting around.",
    "timestamp" : "09:24-09:40"
  },
  {
    "text" : "Yeah, um you should come down too. October 24th.",
    "timestamp" : "09:43-09:47",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "09:48-10:18",
    "speaker" : "Steve",
    "text" : "Yeah, I'm gonna see something skipping on. Are you gonna come and play golf? When? I don't know. I'm playing, well I guess Monday, but it's supposed to rain. And Saturday morning. And then me and Steve were talking about he's trying to get us on Army Navy Country Club. Oh there. Now that would be cool. Oh yeah. So he gets Fridays off, so I was gonna take I was gonna take every Friday off in December anyway, so I can flip one of those around."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I mean I'm down. I just have to I'd need to know a little bit in advance just so I could plan it out work and stuff like that",
    "timestamp" : "10:18-10:24"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Um maybe maybe if we stick a date on it the weekend after he's there. Ron. Take it off.",
    "timestamp" : "10:25-10:34"
  },
  {
    "speaker" : "Greg",
    "text" : "I fixed my swing.",
    "timestamp" : "10:34-10:36"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Steve",
    "timestamp" : "10:37-10:37"
  },
  {
    "speaker" : "Greg",
    "text" : "It's better. It's like it's a leg fix, Steve.",
    "timestamp" : "10:37-10:42"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "10:43-10:43",
    "text" : "Okay."
  },
  {
    "speaker" : "Greg",
    "text" : "I went to the I I went to the driving range for like four straight days at lunchtime. Until I figured it out because I was like, I'm so sick of sucking at golf that I need to figure this out. What did you change? I just like i I've been playing a lot this summer and I'm not I wasn't getting any better because I was just playing to like my shitty swing, you know? So rather than try and tinker on the golf course, like I was like, I need to just go to the driver and fix it. Alrighty, let's do it. We ready to roll.",
    "timestamp" : "10:43-11:19"
  },
  {
    "text" : "Is this better?",
    "speaker" : "Andy",
    "timestamp" : "11:19-11:20"
  },
  {
    "speaker" : "Greg",
    "text" : "And we're back in three, two, one. Welcome back, Andy. Andy has moved from the car to his living room. I'm surprised the wife lets you in the house. I'm sitting on the bed.",
    "timestamp" : "11:20-11:36"
  },
  {
    "timestamp" : "11:37-11:45",
    "speaker" : "Andy",
    "text" : "So this is more. This feels appropriate for this episode, right? We should be embedded."
  },
  {
    "text" : "Slowly unzips.",
    "speaker" : "Greg",
    "timestamp" : "11:46-11:47"
  },
  {
    "timestamp" : "11:48-12:24",
    "text" : "Oh, well there's nothing slow about it. I've already taken my pants off. So if you see this happening on the uh the screen, you'll know why. Because my computer is on the it won't go that high because I'm not that. Endowed. Yeah, you have a tiny boner. We got it. Yeah. Micropenis. So yes, uh I was looking up the author here, because it was a little sketchy that the author, Caroline Blue, is also, if you were paying close attention, the main character in the story. Caroline Black. Yeah, is this a true story?",
    "speaker" : "Andy"
  },
  {
    "text" : "I had written down that it was a true story, yeah.",
    "speaker" : "Greg",
    "timestamp" : "12:24-12:27"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, okay. Yeah.",
    "timestamp" : "12:27-12:28"
  },
  {
    "timestamp" : "12:28-12:37",
    "speaker" : "Greg",
    "text" : "Well it's like uh It's like a quint Quentin Tarantino where it's like it's based on a true story but with just like an alternate ending, you know?"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah.",
    "timestamp" : "12:37-12:37"
  },
  {
    "timestamp" : "12:38-12:44",
    "speaker" : "Greg",
    "text" : "Like he kills the Nazis in the end. Where that's not what happened, but it's all based around factual things."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:45-12:49",
    "text" : "Okay. Where do you think it veers off?"
  },
  {
    "timestamp" : "12:49-12:53",
    "speaker" : "Greg",
    "text" : "Um, I would say when the Panthers win the Super Bowl, probably."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:53-12:59",
    "text" : "I didn't know it was a Super Bowl, first of all. Because they didn't even They well they they call it the big game."
  },
  {
    "timestamp" : "12:59-13:01",
    "text" : "Well they call it the big game.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "13:01-13:13",
    "speaker" : "Andy",
    "text" : "Probably because you'll get in trouble and you get sued if you call it the Super Bowl. Because if you think about all the uh all the commercials around the Super Bowl, they never call it the Super Bowl They always ask if you're ready for the big game."
  },
  {
    "speaker" : "Greg",
    "text" : "You know? We have to do that at work as well. Which is so stupid, you know. It is.",
    "timestamp" : "13:14-13:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:18-14:05",
    "text" : "But yeah, so I looked up Caroline Blue and there is no uh record of an author named Caroline Blue. There is only uh melodic hard rock band based out of Syracuse, New York, whose originals have been described as being similar in style to Kiss with a touch of Dawkins, Megadeath, and Typo Negative. No, it sounds like Yeah, it's uh it sounds like uh my high school metal band Liquid Fetus had similar uh Wait are they the owners of the Panthers just like KISS is the owners of the X XFL team? Uh I don't know, but they they might be related to this this book with their song Slave to the Hourglass and Mine, Mine, Mine. Oh boy."
  },
  {
    "timestamp" : "14:06-14:36",
    "speaker" : "Greg",
    "text" : "So do you wanna let's let's explain the plot though first so people have an idea of what's going on here. So Our our protagonist is Caroline Blue, who's like a junior financial analyst. uh living and accountant living and working in Charlotte, North Carolina. She um as many romantic movies, novel startups, she's like the overworked I don't have time for love type of gal, you know?"
  },
  {
    "timestamp" : "14:37-14:37",
    "speaker" : "Andy",
    "text" : "Right, yeah."
  },
  {
    "timestamp" : "14:37-14:44",
    "speaker" : "Greg",
    "text" : "I I need to focus on my career. I'm so exhausted. I can't even think about dating, you know."
  },
  {
    "speaker" : "Andy",
    "text" : "All my friends are marketing. Or went into marketing and they're they all get to go out and have drinks and travel and stuff while I'm sitting here working 70 hours a week making sure My boss doesn't fire me for losing pennies or something.",
    "timestamp" : "14:44-14:59"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. So it starts out with her. She gets called into her boss's office and they're like, Congratulations. You've won. And she's like, I don't even know what I won. But little does she know her best friend Emily has entered her into a contest. for VIP package to go to the Super Bowl or the big game as they're calling it in Santa Clara, California. So congrats, Caroline.",
    "timestamp" : "15:00-15:28"
  },
  {
    "text" : "She didn't even remember. Yeah, she she wouldn't have even signed up for herself and she tries to get out of it too.",
    "timestamp" : "15:28-15:34",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:34-15:35",
    "speaker" : "Greg",
    "text" : "Yeah, she doesn't want to go."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:36-15:38",
    "text" : "She tries to use her dog as an excuse."
  },
  {
    "timestamp" : "15:38-15:38",
    "text" : "Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "15:38-15:39",
    "text" : "That's that's low."
  },
  {
    "timestamp" : "15:39-15:42",
    "speaker" : "Greg",
    "text" : "Classic chick move there. Yeah."
  },
  {
    "timestamp" : "15:42-15:44",
    "text" : "I don't have anything to wear.",
    "speaker" : "Steve"
  },
  {
    "text" : "Well actually before we go any further, can we make a promise amongst the three of us that we're not gonna slut shame this time, all right? Oh, of course, yeah. Okay. We're very body positive.",
    "timestamp" : "15:46-15:55",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "15:55-15:56",
    "speaker" : "Andy",
    "text" : "We're not that kind of podcast."
  },
  {
    "timestamp" : "15:56-16:04",
    "speaker" : "Greg",
    "text" : "Yeah, we're body positive. We're very European in that way, in that we are, you know, British. Yeah, you do what you want to do with your body."
  },
  {
    "speaker" : "Andy",
    "text" : "No, he said European. What was it? Oh the I love the the part about the dog though. Cause there the author went into excruciating detail about how um where is it yeah for a for a a book",
    "timestamp" : "16:04-16:28"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "16:29-16:35",
    "text" : "And I use that lightly. Light on detail. Yeah. They talk a lot about the the naming convention of this dog."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:35-17:07",
    "text" : "Exactly. So the dog was named. I mean, I don't know if it's Lewis or Louie. It could go either way. Um, and you can't tell just because they're both written the same. The Louis the adorable basset hound. I chose Lewis, quote, I chose Lewis for the countless nights Lewis CK had cheered me up. over the years and the fact that I've been eyeing a certain Louis Vuitton handbag for years. I regretted the Vuitton part of his name, but to the CK part I was still firmly committed. So this was obviously written pre him jerking off. Maybe."
  },
  {
    "timestamp" : "17:08-17:12",
    "speaker" : "Steve",
    "text" : "Or or maybe why she didn't regret it. Maybe."
  },
  {
    "text" : "Yeah. I think it was aft. I just looked it up. And the New York Times article where he got accused was from November 2017. So I think this is just a very poorly timed excerpt from the book, which is which I think makes it even better.",
    "timestamp" : "17:12-17:28",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:29-17:32",
    "text" : "Well, there'll there'll be more of those coming up."
  },
  {
    "speaker" : "Greg",
    "text" : "Yes, yes, there is a few of those.",
    "timestamp" : "17:32-17:34"
  },
  {
    "timestamp" : "17:35-17:35",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "So her friend Emily convinces her to go and her and her friend is like, oh Cam Newton, you gotta see this hunk of man meet, right? She's like, God, what if you were like Uh she calls him a beautiful piece of amazing man, which wawa we, here we go.",
    "speaker" : "Greg",
    "timestamp" : "17:36-17:53"
  },
  {
    "speaker" : "Andy",
    "text" : "I mean, I get it.",
    "timestamp" : "17:53-17:54"
  },
  {
    "text" : "Yeah. I've seen his workout videos. Yeah. Should see his girth. Just the sides of his dick. All right. So she gets on the plane and she's whisked away to to sunny California. And she's like, you know what? Yeah, with all the bigwigs, all the executives from her uh from her office. And she's like, you know what, I can get used to this. You know, she's drinking champagne on the plane. We got her like set up in a nice hotel room. She's like, you know what, this ain't so half bad.",
    "timestamp" : "17:54-18:33",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:36-19:15",
    "text" : "So, where do we go from there, right? Well yeah, well before we get to that that um there was also sprinkled in there the story about uh her brother and father and how they were huge football fans and to point out how big f uh football fans they were was uh this I don't know if a paragraph is the right sentence for three sentences, but um it was quote, my brother would do five jumping jacks every time the Panthers, quote, entered the red zone. My dad would raise his hands in the air like he was saying, I surrender, before each field goal an extra point kick. Saying they were were obsessed was an understatement."
  },
  {
    "timestamp" : "19:15-19:18",
    "speaker" : "Steve",
    "text" : "That The the field goal thing makes tons of sense."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "19:18-19:19"
  },
  {
    "timestamp" : "19:19-19:21",
    "text" : "That that doesn't feel like obsession to me.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Also, who does jumping jacks in 2020? You know it's",
    "timestamp" : "19:21-19:24"
  },
  {
    "text" : "Who does something tax in relation to football? I've never heard that before. Or just I've never seen that. All right, we're inside the 10 drop and give me 10.",
    "timestamp" : "19:25-19:31",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "19:34-19:56",
    "text" : "That's college football like cheerleader style. I did get the feeling that this was written by someone who wasn't. It feels like it's someone from a different country wrote about football That doesn't I quite understand like they they've looked up what football is, but they can't quite figure out like the yeah how to sound normal talking about it, you know? Yeah."
  },
  {
    "text" : "They've only read about it, they've never seen it on TV.",
    "speaker" : "Andy",
    "timestamp" : "19:57-19:59"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, exactly.",
    "timestamp" : "19:59-20:00"
  },
  {
    "text" : "They've read about it in a textbook.",
    "speaker" : "Andy",
    "timestamp" : "20:00-20:02"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "20:02-20:22",
    "text" : "She exactly because she gets the um She described her posture as like a turtle and then drops a line about how turtles survived the ice age, which I googled it, is true. Like she's little nuggets of knowledge like that, but that is like, yeah. Those guys are crazy about football. They do jumping jacks when they enter the red zone."
  },
  {
    "speaker" : "Greg",
    "text" : "So she gets to uh she gets to California and then it's finally the she's having a great time, you know, rubbing elbows with all these big uh big wigs, and then it's finally the day of the game. So she gets uh she gets her her Panthers jersey on or signed Cam Newton Panthers jersey on. From her friend Emily. From Emily. Emily is a big fan. So she and then she goes up to the booth, um, the box, the box seats, right. So they're all whining and dining, you know, having a good time. But There's there's a somber mood up there because the Panthers are not winning. Uh-oh. That's gonna ruin the day for all these millionaires.",
    "timestamp" : "20:27-21:13"
  },
  {
    "timestamp" : "21:15-21:29",
    "speaker" : "Andy",
    "text" : "They were uh oh by the way. I didn't catch this until I read it in one of the reviews, but uh at halftime the Panthers were down 15 points when the score was 17 to 3."
  },
  {
    "text" : "Yes. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "21:30-21:32"
  },
  {
    "timestamp" : "21:32-21:37",
    "text" : "Which was the biggest would be the biggest comeback in history.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "21:37-21:44",
    "text" : "Yes, would require the biggest comeback in the history of the game. Again, points was the previous record."
  },
  {
    "timestamp" : "21:44-21:45",
    "text" : "Poorly timed.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:47-21:56",
    "speaker" : "Greg",
    "text" : "Also, I don't wanna I don't wanna call Carolyn out for her like uh grammatical mistakes in here. But just get an editor. Good."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:56-22:36",
    "text" : "So no, here's the thing. I I was thinking that too when we're like when I was reading this before we were gonna record it. I was going back and forth on whether I would or wouldn't. And I think we should, because it doesn't feel like She doesn't know better. It feels like this was just a half-ass job. Like you just throw in something together. Like this is something I would have written in the ninth hour when I had like a a paper due for English class. Exactly. I don't really get like She uses the word, uh, what was it? Uh steel as if like the spelling doesn't matter. Like you can use the different words interchangeably. That's not how English works. Like you can't steal with it. Let's not shame her."
  },
  {
    "timestamp" : "22:36-22:38",
    "speaker" : "Greg",
    "text" : "Let's not shame her, Andy."
  },
  {
    "speaker" : "Andy",
    "text" : "Well, I think Greg might have said that maybe she maybe she gets it right sometimes and then she like like she'll she'll talk about a steel tub multiple times. She'll spell it differently both times. Like that's that's not not knowing, that's just not giving a shit.",
    "timestamp" : "22:38-22:52"
  },
  {
    "text" : "Well, I mean she didn't she needs to get an editor is what she needs. She needs someone to proofread this shit because no one proofreads That that that goes without a doubt. Like yeah, I've written on the blog where I'll read it myself after I wrote it, but like when you're reading it And you wrote it, you have a tendency to like miss like extra words or like especially when you went back and changed your sentence. But but s a third party reading it should look at that and be like, well Here's one. Here's a mistake. If I found like 15 to 20 of them minimal, that means that someone else would have found at least like 10 of them, you know?",
    "timestamp" : "22:52-23:26",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh yeah. Maybe they did. Maybe that was edited, which is this this reads like a first draft.",
    "timestamp" : "23:27-23:33",
    "speaker" : "Andy"
  },
  {
    "text" : "But we're not gonna shame her for it because I know it's difficult. Okay.",
    "timestamp" : "23:33-23:37",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "23:39-23:57",
    "text" : "We paid money for this though, so I feel like we can pay nine dollars for this shit. It's not free. Like like your if your blog post if I came across your blog post and there was like a spelling error, I'd be like, well I got this for free. No boogie. Maybe she can now afford an editor.",
    "speaker" : "Andy"
  },
  {
    "text" : "Wait, oh wait, I have some redemption for. All right. Can you state what you said before about uh the 15 points? That's incorrect. She said the Panthers needed 15 to win, 14 to send the game into overtime. So M Driss on Amazon. com can eat shit. Okay. Because he got it wrong. That's true. Yes. All right. So she's at the game. Yeah. That's enough like actual like author critique here. Let's get back to the story. So she's at the game and she's slugging down the champagne, just getting a little spicy, you know? Having herself a day. But then her damned bladder, right? She goes to the bathroom.",
    "timestamp" : "23:59-24:49",
    "speaker" : "Greg"
  },
  {
    "text" : "Can I can I read the quote? Can I read the quote? Sure. My tiny bladder reminded me it can only do so much and halftime seemed like the perfect time to take care of that and also get a bit of fresh air.",
    "timestamp" : "24:49-24:59",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "24:59-25:23",
    "text" : "Ooh, very nice. But for some reason to me. The bathroom, the line for the bathroom is longer in the box seats than it is in the regular seats, which is the right one. I've never been in a boxy butt I would imagine there's shorter lines."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:24-25:25",
    "text" : "I've been in a box seat."
  },
  {
    "timestamp" : "25:25-25:26",
    "speaker" : "Steve",
    "text" : "Have you been in a box seat, Andy?"
  },
  {
    "speaker" : "Andy",
    "text" : "At UNH I was in a box seat and uh it had its own bar, it had its own TV, and the there was no line for the bathroom.",
    "timestamp" : "25:27-25:36"
  },
  {
    "text" : "Yeah. I was in a box seat in the cap stadium and there was a bathroom in the box. Like you had no bathroom. Like you anything. Yeah, food, a booze, and a fucking bathroom.",
    "speaker" : "Steve",
    "timestamp" : "25:37-25:50"
  },
  {
    "text" : "They have a guy there that shakes it for you just like a button. He just holds the button. So she goes down to the bathroom, she takes a piss, and then like second half's about to start, she's like, uh oh Disaster strikes. Pull yourself together, Carolyn, is the quote. Um, so she splashes some water in her face, she heads back up to the elevator, and she has forgotten her purse in the booth.",
    "timestamp" : "25:52-26:21",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "26:21-26:23",
    "text" : "She has everything her ticket. Everything her tickets.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:24-26:52",
    "text" : "Phone. Phone. Yep. Probably her keys and wallet. Yep. So the man at the elevator, the security guy is like, sorry ma'am, I can't let you go back up there Um and there was some weird part about her trying to like explain it. She's like, I'm not that drunk. And she was pointing at skyward and then she like pointed back down at the guy and that made her fall over."
  },
  {
    "timestamp" : "26:54-27:05",
    "speaker" : "Andy",
    "text" : "As well as I'm not that drunk and you try to do some sort of like Emphatic movement and that knocks you over like Charlie Chaplin sort of physical comedy, Greg."
  },
  {
    "text" : "Yeah, she tumbles face first down the steps of the lower level. Oops. So I think that part was just to get her close to the field.",
    "timestamp" : "27:05-27:13",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "And the audience fuck your shit up too. If you just fucking face first it on those concrete steps.",
    "timestamp" : "27:13-27:19"
  },
  {
    "text" : "Oh yeah. I've seen the aftermath of that.",
    "timestamp" : "27:20-27:22",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "27:23-27:27",
    "text" : "Yeah. And all the fans are laughing at her and they're like, ha ha ha."
  },
  {
    "timestamp" : "27:28-27:39",
    "speaker" : "Andy",
    "text" : "Security coming up or I think also uh I'm curious if you guys thought the same thing. Do you what what uh opponent did you think the Panthers were playing?"
  },
  {
    "speaker" : "Steve",
    "text" : "40 miners, but then I didn't realize it was a Super Bowl until after she's like, it's the biggest comeback in the big game history. I was like, oh shit. How the fuck did you say that earlier?",
    "timestamp" : "27:39-27:51"
  },
  {
    "text" : "They didn't explain that very well.",
    "timestamp" : "27:51-27:52",
    "speaker" : "Greg"
  },
  {
    "text" : "So well, yes.",
    "speaker" : "Steve",
    "timestamp" : "27:53-27:54"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "27:56-28:20",
    "text" : "That's what they put in. So yeah, so this this is the thing. It was um The the crowd it the crowd oh Jesus here's your editing I'm gonna um I'm reading verbatim now the crowd the area erupted in laughter Quote, it's been that kind of day for the Panthers, a man in the opposing team's jersey said. At least their fans are getting some form of entertainment, his friend in Orange said."
  },
  {
    "timestamp" : "28:21-28:21",
    "speaker" : "Greg",
    "text" : "There you go."
  },
  {
    "timestamp" : "28:23-28:24",
    "speaker" : "Andy",
    "text" : "I think the Broncos make the most sense."
  },
  {
    "timestamp" : "28:25-28:40",
    "text" : "Yeah, I mean this is this is when that Super Bowl was, and it was in Santa Clara. Oh, all right. So yeah. Super Bowl 50 was in California. Yeah. Perfect. Yes. So she falls down, her pants are unzipped. Forgot about that part. Yep, forgot to zip her pants. Fucking idiots.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "28:41-28:46",
    "speaker" : "Andy",
    "text" : "Adding into the sexual tension of the peace. Who does that? Never catch me do that."
  },
  {
    "text" : "And someone yelled to the security guard, or the security guard yelled to the other one, cuffer, Max. And just as she's about to get handcuffed and dragged off to jail. Cam Newton getting sacked just launches a ball into the crowd. And what does she do, Andy?",
    "speaker" : "Greg",
    "timestamp" : "28:46-29:07"
  },
  {
    "text" : "She channels her her father, who uh because she's the eldest and it took them so long to get pregnant with her, want thought that this was his only chance of having um a son to share sports with. So he used to throw footballs and other balls at her in the backyard and taught her how to catch a football. So she turns around and just out of reflex snags this motherfucker out of thin air.",
    "timestamp" : "29:08-29:38",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "29:39-29:40",
    "speaker" : "Greg",
    "text" : "Randy Moss."
  },
  {
    "text" : "Oh just mossed it. Yeah. Mm-hmm",
    "speaker" : "Andy",
    "timestamp" : "29:41-29:43"
  },
  {
    "timestamp" : "29:43-30:01",
    "text" : "And the fucking crowd goes crazy. They're all like, holy shit, this chick in the stands, this shit face, dumbass broad, just fucking snagged this catch. And none of our wide receivers could catch shit. Fucking sign this girl up, get her in there, everyone's fucking losing it.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah. What sign the cheap? They even had her up on the jumbotron with replays of her making the catch.",
    "timestamp" : "30:01-30:09"
  },
  {
    "timestamp" : "30:10-30:17",
    "text" : "Apparently the jumbotron was flashing. What a catch, what a catch, what a catch. On all the screens.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "That's a pretty good uh Jumotron guy, like to be able to fly on top of that really quickly.",
    "timestamp" : "30:17-30:22"
  },
  {
    "timestamp" : "30:22-30:38",
    "text" : "Yeah. Um yeah, so she fucking catches it. Everyone, you know, giving her high fives, and she's she feels like a celebrity walking out of there. Great catch, lady. You you brought them luck. Yeah, foreshadowing.",
    "speaker" : "Greg"
  },
  {
    "text" : "As she's as she's getting dragged out, one of the one of the a child, a boy a few seats over, yells as his dad, Dad, look! Play has resumed. Cam had let go off. Cam had let go off a long pass, covering at least half of the field. The ball still perfectly and landed right in the hands of another Panther for a touchdown.",
    "speaker" : "Andy",
    "timestamp" : "30:38-30:59"
  },
  {
    "timestamp" : "30:59-31:00",
    "speaker" : "Greg",
    "text" : "Yep."
  },
  {
    "text" : "Not gonna bother with names at this point.",
    "timestamp" : "31:00-31:02",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:02-31:03",
    "speaker" : "Greg",
    "text" : "Changed their luck."
  },
  {
    "timestamp" : "31:04-31:05",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "So then uh she has to get mended up because she there was such a rocket from Cam. that she like bloodied her hands, I guess. She broke a nail as well. Yeah, broke a nail. So she she had to go get security and get her all patched up. So she went to the medical tent. And then Uh they send her into the drunk tank because she's still shit-faced, obviously, right?",
    "timestamp" : "31:06-31:29"
  },
  {
    "timestamp" : "31:29-31:32",
    "speaker" : "Steve",
    "text" : "When you read that, Greg, what were what was your thought?"
  },
  {
    "text" : "Oh well I highlighted it. You're the one who's been there, right? Oh yeah, I highlighted it. And I'll tell you that's not a fun place to be.",
    "timestamp" : "31:32-31:42",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, but you don't even remember getting sent to the drunk tanks.",
    "speaker" : "Steve",
    "timestamp" : "31:42-31:45"
  },
  {
    "text" : "Correct. This lady's an amateur is what we're saying. Yeah. But then they said uh take her downtown, book her on a six oh two. And it's like, well, um the trunk tanks are in the stadium, so I don't think you really have to go downtown. Yeah. Again, this this is uh",
    "timestamp" : "31:46-32:00",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Somebody who's who's read about it in a book.",
    "timestamp" : "32:00-32:02"
  },
  {
    "speaker" : "Steve",
    "text" : "Right, yeah. Yeah. Wasn't trying to handle jack before the game, just to you know, see what the drunk tank's all about. Yeah, right. For research.",
    "timestamp" : "32:02-32:13"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. So they so they're they're leaving the stadium and they're like going to the officer's car, right? And then uh another officer is like Yo what are you doing? Like you know who this girl is? Right? Alright And it's like that's that's the lady right there that made the catch that turned the game around for the Panthers and won the fucking Super Bowl.",
    "timestamp" : "32:14-32:41"
  },
  {
    "text" : "And and the cop and what is his name, Max, who cuffed her. Yeah. Had the exact reaction that I'm sure the three of us had. Like, the fuck you talking about?",
    "speaker" : "Andy",
    "timestamp" : "32:43-32:53"
  },
  {
    "text" : "Yeah. Who, this drunk bitch?",
    "speaker" : "Steve",
    "timestamp" : "32:54-32:56"
  },
  {
    "text" : "Yeah, so then so Officer Fisher takes her and is like, all right, you're not going to jail. You're gonna go on the field right now. So they so they bring her back in as the Panthers are celebrating this confetti coming down from the rafters. This is Almost a two-thirds of the way through the book, and so far Cam Newton has not made an appearance.",
    "speaker" : "Greg",
    "timestamp" : "33:02-33:23"
  },
  {
    "speaker" : "Andy",
    "text" : "Other than his chucking it five yards out of bounds. Yeah. Five rows out of bounds.",
    "timestamp" : "33:24-33:29"
  },
  {
    "text" : "So she uh she gets on TV, she tells uh she tells her the interviewer and like you're the you're the fan that won the Super Bowl. She's like, oh my god, I'm fucking, I can't believe it. Uh she asks some kid to borrow his phone, calls her dad, and he's like weeping on the phone. Oh yeah, it's not that I highlighted this part.",
    "speaker" : "Greg",
    "timestamp" : "33:30-33:52"
  },
  {
    "timestamp" : "33:52-34:22",
    "speaker" : "Andy",
    "text" : "Hang on. So she wanted she had a phone call she wanted to make. And here it is verbatim from the book. Quote, do you mind if I make a long distance call? I asked as I looked up from the phone to the boy. Quote, sure, I have the full US plan. Call anybody you want. It doesn't cost me extra and I never use all my minutes. This is 2016, right? Yeah, that would have been great in 2001, maybe. Well that was a thing."
  },
  {
    "text" : "I also thought that was very strange. And she missed a total opportunity to plug. Oh, I have Verizon. You can you call anyone in the US, Canada, and Puerto Rico, plus Mexico. You know?",
    "timestamp" : "34:22-34:34",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Only 35 cents a minute. Uh sorry, continue, Greg. So she calls me that.",
    "timestamp" : "34:35-34:44"
  },
  {
    "text" : "See, that makes me think that maybe this is a copy and paste job where This is a previous book with some other quarterback and they just like did control F replace with all Cam or like Steve Young with Cam Newton kind of thing. So thanks her dad, I love you, you know, like his dad crying. Yeah, her dad cries on the phone, and then uh yeah, that was pretty much the end of that. And then someone comes up to her and says, uh, hey little lady, Cam wants to holler at you for sure.",
    "timestamp" : "34:44-35:23",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "No, that was the first one. That was the end of the that's that was that's why I was saying this is definitely not a control replace sort of job, you know? Yeah, Joe Montana wants to holler at you for sure. For sure And holler H O L L E R for sure. Yeah.",
    "timestamp" : "35:25-35:45"
  },
  {
    "text" : "That was perfect English. I'm almost surprised that this wasn't uh dabbing. with a G instead of dabbing with an apostrophe.",
    "speaker" : "Andy",
    "timestamp" : "35:46-35:53"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, right. That's a good point. Yeah, so she gets into the locker room and then this is where it starts to get a little bit hot and heavy.",
    "timestamp" : "35:54-36:00"
  },
  {
    "text" : "Oh it gets steamy",
    "speaker" : "Andy",
    "timestamp" : "36:01-36:02"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, girls allowed in here and they're like, whatever, it's the Super Bowl shit. Get on in here and start looking at some dicks. And she does. Oh yeah.",
    "timestamp" : "36:02-36:14"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:16-36:23",
    "text" : "So she goes in there and uh how how much of the this part onwards, Greg, of your book is highlighted?"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh dude, every page. I just started like doing highlight whole whole paragraph. Just circling paragraphs. Me too. It's fucking hilarious. Um So where does it start? Yeah, so they're all just hanging out in their towels, right? Just uh she's kinda describing how honky they all are. So she's like Right right now I was a horny lustful voyeur who couldn't find the strength to lift her eyes beyond groin level. One word came to mind dot dot dot dot hung",
    "timestamp" : "36:23-37:01"
  },
  {
    "timestamp" : "37:02-37:06",
    "text" : "Eight inches to my left, nine inches to my right.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "37:07-37:10",
    "text" : "There goes another seven to nine, I thought."
  },
  {
    "timestamp" : "37:10-37:13",
    "speaker" : "Steve",
    "text" : "That's a pretty wide gap of seven to nine."
  },
  {
    "text" : "Yeah, but soft Steve. They're not even hard yet. Think about that.",
    "timestamp" : "37:13-37:17",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "37:17-37:20",
    "text" : "She does specify that, yes. Yes.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Even before that, going back to the towels thing, d I I I s I skipped over it the first time, but then when I was going back highlighting stuff. I realized what it actually said. Tell me if this makes sense. The players were getting interviewed in their towels until they weren't. Weren't not as in getting interviewed, weren't as in not wearing towels. That that makes sense, right?",
    "timestamp" : "37:21-37:45"
  },
  {
    "text" : "Yeah. Yeah. Okay. I read through that a couple times. I got it. As in they took their towels off. Yeah, they're getting exposing their genitalia. Yeah, I mean, I get it. The interview continued That's how the interviews did not stay on is what she's getting at.",
    "speaker" : "Greg",
    "timestamp" : "37:46-38:06"
  },
  {
    "text" : "Yeah. Okay.",
    "timestamp" : "38:06-38:07",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, so then she's uh they they keep all these people keep Pointing her to like, oh Cam's been asking about you, and she's like, Oh my god, Cam the quarterback? And they're like, Yeah, he's he's back there in the whirlpool. No, the other Cam. Yeah. So she uh she keeps heading back into the um like the depths of the locker room. So a little bit of privacy, you know?",
    "timestamp" : "38:07-38:30"
  },
  {
    "speaker" : "Andy",
    "text" : "Ooh, barrel.",
    "timestamp" : "38:31-38:32"
  },
  {
    "timestamp" : "38:32-38:43",
    "text" : "And You know, as most Super Bowl winning quarterbacks do right after the game, he's just taking a quick ice bath before he celebrates by himself.",
    "speaker" : "Greg"
  },
  {
    "text" : "After winning the Season Bowl. In a historic comeback fashion.",
    "timestamp" : "38:46-38:50",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "38:51-39:34",
    "speaker" : "Greg",
    "text" : "Yeah. Confetti still in the air and he's okay. I gotta ice up for my game in seven months. So there he was, Cam Newton, winner of the big game, just sitting there, the most popular person in the world today. And he was less than ten feet from Carolyn, fully naked. Fully naked. Buck naked. And he's like, hey girl, it's you. I can't believe it. Come over, come over here and give daddy a hug. That's gonna be my Cam Newton voice. Oh hey, baby. Hey baby. It's you, girl with the hands. Come over here and give daddy a hug."
  },
  {
    "text" : "How many times have you lived in Kelly so far, Greg?",
    "speaker" : "Steve",
    "timestamp" : "39:35-39:37"
  },
  {
    "text" : "Well, this is me workshopping it live, so.",
    "speaker" : "Greg",
    "timestamp" : "39:38-39:41"
  },
  {
    "speaker" : "Andy",
    "text" : "So we'll ask in a week from now how often he's uses his voice on Gelly. Yeah. Once this part I didn't quite understand.",
    "timestamp" : "39:43-39:50"
  },
  {
    "text" : "He says I walked over to the whirlpool, or should I say floated. Can't Cam squeeze me tight and put his hand put out his hand for a high five.",
    "timestamp" : "39:51-40:00",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:00-40:06",
    "text" : "I would say sexual attention right there, a nice little, you know, steamy high five."
  },
  {
    "text" : "While hugging them? How does that work? Get into the whirlpool, right? Nah, yeah. So she's still out of the out of the whirlpool right now.",
    "speaker" : "Greg",
    "timestamp" : "40:07-40:14"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:14-40:15",
    "text" : "Still playing coi"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "40:16-40:16",
    "text" : "Yeah."
  },
  {
    "timestamp" : "40:17-40:31",
    "text" : "But that it it it does explain why he's in the uh the ice bath right now. Because uh Says, yeah, they brought the blitz. I escaped the pocket, but still took a licking from two linebackers. That explains the whirlpool when I should be celebrating.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. When in real life he just like let them recover the fumble and was like, you know what, business decision.",
    "speaker" : "Greg",
    "timestamp" : "40:31-40:37"
  },
  {
    "text" : "Speaking of business decisions, carry on. So uh Greg just froze. Greg! That's a good look on his face when he did though.",
    "timestamp" : "40:40-40:52",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "To to make this comeback.",
    "timestamp" : "40:52-40:54"
  },
  {
    "text" : "Start over. You froze like when you first started that.",
    "timestamp" : "40:55-40:57",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, okay. So Cam Cam proceeds to tell Carolyn how she was the inspiration for the the Panthers comeback win and said that right after that that play, he goes in the in the locker into the uh huddle and it was like, yay. If that stupid broad can catch the ball, then you guys can goddamn well do it.",
    "timestamp" : "40:57-41:17",
    "speaker" : "Greg"
  },
  {
    "text" : "No offense. Yeah, no more drops.",
    "timestamp" : "41:18-41:20",
    "speaker" : "Andy"
  },
  {
    "text" : "If a woman, no offense, in the stands can catch a ball. And they were all just like, you know what, that makes sense. If a chick can do it, why can't we do it? And they start catching passes everywhere. And then there's about that's the best part of this whole story is",
    "speaker" : "Greg",
    "timestamp" : "41:22-41:39"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "41:42-41:56",
    "text" : "You dummies. That stupid drunk bitch in the stagnat like Randy Moss. Fuck you dude. Oh yeah, you're right. Let me start catching the balls as you throw them away now. It's all duck."
  },
  {
    "timestamp" : "41:56-42:19",
    "text" : "It's all duck! So also not only was this like the most misogynist part of the whole story, I think it was also the most uh grammatically egregious part of the story too. Because if you look at it, the the text actually says if a woman, no offense in the stance, can catch the ball and she's not even expecting it, we can't too. And two is spelled TWO as in the number.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Here's the question, do you think Tom Brady, when he was down 28 to 3 Throws it on. Dumb lady in the stands catches it. He comes back in the huddle and is like, you motherfucker.",
    "timestamp" : "42:19-42:30"
  },
  {
    "text" : "If she doesn't fumble it, you can't too.",
    "timestamp" : "42:32-42:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, right.",
    "timestamp" : "42:35-42:36"
  },
  {
    "text" : "No more drops. We're going deep and we're gonna win.",
    "timestamp" : "42:37-42:40",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "42:41-42:45",
    "text" : "Laser focused laser focus",
    "speaker" : "Steve"
  },
  {
    "text" : "It's because that guy in Kansas City was shining the light in his eyes.",
    "speaker" : "Andy",
    "timestamp" : "42:46-42:49"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh.",
    "timestamp" : "42:50-42:50"
  },
  {
    "timestamp" : "42:50-42:53",
    "speaker" : "Andy",
    "text" : "Like if he can laser focus, you can laser focus."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "42:53-42:54",
    "text" : "That's true."
  },
  {
    "timestamp" : "42:57-43:10",
    "speaker" : "Greg",
    "text" : "Yeah, so then there's about uh I would say three to five pages of just them having a conversation that is just all strictly Sexual innuendo puns. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "This is, I think, the uh football, not football section of this episode, right? Right. We're now getting into football, not football.",
    "timestamp" : "43:11-43:18"
  },
  {
    "text" : "Mm-hmm. Talking about penetration in the backfield, talking about scoring in the red zone.",
    "speaker" : "Greg",
    "timestamp" : "43:18-43:24"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "43:24-43:29",
    "text" : "I sent deep into the red zone and we scored. Yeah."
  },
  {
    "timestamp" : "43:29-43:55",
    "text" : "Our offense got a quick blow and she's like, Oh my god, a quick blow. She's like, Yeah, you know. We almost scored again. She's like, Oh, scored again. Oh my god. That would make it most sense. Yeah. Shot right through the two hole, which which also doesn't make sense. Is it like the gap? And she's like the That's a butthole joke, right? Fun. I'm gonna say hole is is your is your beehole, yes?",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "43:55-43:56",
    "speaker" : "Andy",
    "text" : "Isn't it also hockey?"
  },
  {
    "text" : "That's the five hole. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "43:57-44:01"
  },
  {
    "timestamp" : "44:01-44:05",
    "text" : "That one didn't make sense. And she also missed like a squirt through the hole, you know?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:06-44:10",
    "text" : "Yeah. Mike Mello would be disappointed. As with Dan Deerdorf.",
    "speaker" : "Andy"
  },
  {
    "text" : "Also there's a um you have to just uh open a hole and keep pounding it in. Which we definitely Yeah hashtag keep pounding that's like Carolina's like motto thing. Really? Yeah. Of course it is. You know how like every team has like a phrase they hashtag and all their drop. Yeah, theirs is keep pounding. Is that Jerry Richardson's idea, you think? Oh well it's it's clearly Caroline Blue's idea, I think. She's the first one that wrote it.",
    "timestamp" : "44:10-44:44",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "It's a game of inches, and our guys were prepared to win the battles when the refs bring out the chains to measure. Measured the inches, and we always had the length.",
    "timestamp" : "44:49-44:57"
  },
  {
    "timestamp" : "44:59-45:23",
    "speaker" : "Greg",
    "text" : "Yeah, her head was spinning from all the sexual innuendos. Quite honestly, I skipped over this bit because I'm so I get it. But then her she could uh she could feel the wetness between her thighs though. So she's clearly, you know, she's in the mood now after all this That was sex talk from Cam."
  },
  {
    "timestamp" : "45:24-45:38",
    "speaker" : "Andy",
    "text" : "I do I did like the part where it was uh you must be cold. It's frigid in the whirlpool, to which he responds, I'm not frigid. Quite fit the rest of it, but yeah, okay. I love that."
  },
  {
    "text" : "I'll allow it. Yeah, and Cam gets out and they're gonna and he's gonna go to the the hot tub, right? Oh yeah. And he gets out so very big but so gentle at the same time, you know? I could see that with Cam. He is kind of like a Yeah, he's intimidating, but he's kind of got that like boyish like, oh yeah. I bet this guy be a good lover. Yeah.",
    "timestamp" : "45:38-46:00",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "46:00-46:01",
    "speaker" : "Andy",
    "text" : "Big old gentle teddy bear."
  },
  {
    "timestamp" : "46:02-46:05",
    "speaker" : "Greg",
    "text" : "Yeah. Well, I just mean from like a a lover standpoint."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, so do I.",
    "timestamp" : "46:06-46:06"
  },
  {
    "text" : "I think he'd be very giving. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "46:06-46:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I agree.",
    "timestamp" : "46:08-46:09"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh I should make some comments about his butt, his big perfect behind. And then um then they start dabbing. That's when we get to the dabbing part.",
    "timestamp" : "46:09-46:22"
  },
  {
    "text" : "So yeah, that this This is where I I I it all fell apart for me. I was hanging in there right up until this. Um Should we just read this part?",
    "timestamp" : "46:23-46:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "46:35-46:42",
    "text" : "Sure, read it out. I mean this is the this is the title of the book, so I feel like this is the the the climax of the novel."
  },
  {
    "text" : "Yeah, so what happens is Cam gets into the hot tub and he's like, oh, you should you should come in too, you know. She's like, but I I you know I'm I don't have, you know, I don't I'm not properly retired for this. And he's like, you know, just Your best suit is your birthday.",
    "timestamp" : "46:43-46:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "46:59-47:01",
    "speaker" : "Steve",
    "text" : "I mean, he's not wrong. Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:01-47:06",
    "text" : "But so uh, you know, Caroline's like still kind of A little self-conscious."
  },
  {
    "text" : "Wait a second, guys. I just put it together. Caroline is not a fucking real name. Carolina blue, like the Panthers, the color of the Panthers. You just put that together, Greg? Did you guys know that? Yeah.",
    "timestamp" : "47:06-47:21",
    "speaker" : "Greg"
  },
  {
    "text" : "They said it in the book. I said that a real name. Because Carolina Blue I'm the idiot then.",
    "speaker" : "Steve",
    "timestamp" : "47:23-47:32"
  },
  {
    "timestamp" : "47:32-47:39",
    "speaker" : "Andy",
    "text" : "Like at the end, they're like, oh what's I I didn't even get your name. It's like Caroline Blue. It's like, oh isn't that appropriate?"
  },
  {
    "text" : "Alright, I'm sorry. It's okay.",
    "speaker" : "Greg",
    "timestamp" : "47:39-47:40"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:43-47:44",
    "text" : "No, we're leaving that in."
  },
  {
    "speaker" : "Greg",
    "text" : "Dumbass, dude.",
    "timestamp" : "47:44-47:45"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "47:46-47:56",
    "text" : "So yeah, but uh So we're we're we're getting like he's the Cam is trying to to kind of use the tension a bit. Oh of course. Bro."
  },
  {
    "timestamp" : "47:57-48:01",
    "speaker" : "Greg",
    "text" : "Shut that fucking dog up. Yeah, yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Steve. Oh, we'll cut that part out.",
    "timestamp" : "48:04-48:06"
  },
  {
    "timestamp" : "48:07-48:12",
    "text" : "Just leave in. Let's blame Scott. The fuck Scott. Fucking Scott.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So yeah, so Cam's trying to like make Caroline feel a bit uh you know a bit more relaxed because she's a little uptight about like, you know, getting in the hot tub with this stud. And so what does he do? Is he he uh so she you know she's too embarrassed and so he says, Don't worry, he said, I almost forgot. He stood up and took my hand in his hand. Ready? He asked. Ready for what? You know? He thrust our joint hands towards the ceiling and leaned into his other elbow. What's that? Don't tell me you don't know. Don't know what. Come on, girl. Dab Next thing I knew, we were dancing dadding and doing the cat daddy.",
    "timestamp" : "48:13-48:53"
  },
  {
    "text" : "Cat daddy.",
    "speaker" : "Greg",
    "timestamp" : "48:55-48:55"
  },
  {
    "text" : "I looked it up. I looked it up. Cam Oh, did you? I because I did not. You didn't know what cat daddy is?",
    "timestamp" : "48:56-49:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I didn't know.",
    "timestamp" : "49:02-49:03"
  },
  {
    "timestamp" : "49:03-49:23",
    "speaker" : "Greg",
    "text" : "Oh. You guys are not good. Uh I mean no, I can't. I don't remember it that well. I remember it was like a it was a popular thing with um that model. With the the large late large breast model, Kate Upton. Yep. Yep."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:23-49:27",
    "text" : "Oh that sounds familiar. Two thousand eleven song."
  },
  {
    "text" : "2011, so she's five years late on Cat Daddy.",
    "timestamp" : "49:27-49:30",
    "speaker" : "Greg"
  },
  {
    "text" : "Or maybe the Panthers were.",
    "timestamp" : "49:31-49:32",
    "speaker" : "Mom"
  },
  {
    "text" : "I mean it was the jam of the week in January 2011. 2011. Cat Daddy.",
    "speaker" : "Steve",
    "timestamp" : "49:33-49:41"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "49:43-49:48",
    "text" : "She's doing the soul boy. You the stanky leg."
  },
  {
    "text" : "First thing I know is that it's staky legged.",
    "timestamp" : "49:48-49:51",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "49:54-49:59",
    "speaker" : "Greg",
    "text" : "That made her feel better though, because then she's like, alright, fuck this. I'm getting lots of. Yeah. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "And at this point, I like how she tied it back to the very beginning. You know, I think all good authors do this where they like, you know. Fold in some of the previous parts they talked about where she's like, oh shit, I ain't even trimmed up my bush. I've been so busy at work, you know, I haven't even had time to Shaved the grundle and then she's like, you know what? Put me at ease. Let's get in this hot tub.",
    "timestamp" : "50:00-50:21"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, some dudes like that. Yep.",
    "timestamp" : "50:21-50:23"
  },
  {
    "timestamp" : "50:25-50:41",
    "speaker" : "Andy",
    "text" : "So just to finish this off, she's drinking champagne, laughing, dabbing with Cam. I felt so free like a bird, or should I say a panther in the jungle. And like a panther, I now decided it was time to hunt, or at least be hunted. I don't think panthers get hunted. Maybe by us."
  },
  {
    "text" : "So she rips open her blouse like Superman, another Cam celebration. Oh, I missed that one. That's great. So she's in her brahme panties and she's like, well, let's get in this tub. Scoots up in there. She's feeling a little confident from the alcohol. Even though you think she'd be sober and up by now. I mean she's a little bit more.",
    "timestamp" : "50:43-51:02",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "51:02-51:05",
    "speaker" : "Andy",
    "text" : "Well no, because they drank more alcohol. They drank more right there."
  },
  {
    "timestamp" : "51:05-51:08",
    "text" : "Oh, that's right. They were getting some bubbles going. Spraying each other.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "51:08-51:11",
    "speaker" : "Steve",
    "text" : "Yeah, drinking a hot tub makes you quick."
  },
  {
    "speaker" : "Andy",
    "text" : "Steve apparently knows this.",
    "timestamp" : "51:12-51:14"
  },
  {
    "timestamp" : "51:15-51:16",
    "speaker" : "Steve",
    "text" : "Yeah, it dehydrates you."
  },
  {
    "text" : "I can see Steve being a drunk hot tub kind of guy.",
    "speaker" : "Andy",
    "timestamp" : "51:17-51:19"
  },
  {
    "speaker" : "Steve",
    "text" : "Uh a couple times. It sneaks up on you.",
    "timestamp" : "51:20-51:23"
  },
  {
    "timestamp" : "51:24-51:25",
    "text" : "I rest my kiss.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, so she gets in there and she's just uh she's all over him immediately. And next thing you know, she's got her hand down his pants. Or I guess he might even not be wearing pants. But either way, she's she's grabbing on his goalpost. And she says, his manliness was bigger than I had ever seen. And it wasn't only his length, his girth was equally impressive.",
    "timestamp" : "51:26-51:51",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I was hoping you'd read the the paragraph before that. My hand continued down the goal line. Down to the goal line. Before I even got close, I could feel his goalpost. At that moment I knew why he was referred to as the man of steel.",
    "timestamp" : "51:53-52:06"
  },
  {
    "timestamp" : "52:06-52:14",
    "text" : "See I the the puns just don't do it for me. Like let's just go let's skip the innuendo and just really start talking about his dick, you know?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "No, the puns are why I spent $299 on this.",
    "timestamp" : "52:15-52:17"
  },
  {
    "timestamp" : "52:18-52:25",
    "text" : "There's so fucking many because right right after this it just evolves again into just football or not footballs.",
    "speaker" : "Steve"
  },
  {
    "text" : "It did, but then it got weird. I ran my hands up and down his shaft and then slid them around and grabbed that amazing behind. Two halves of molten lava made of steel apples.",
    "speaker" : "Andy",
    "timestamp" : "52:26-52:37"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "52:38-52:40",
    "text" : "Is it molten or is it steel?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:40-52:52",
    "text" : "I don't What molten lava made of steel apples? I can't even picture. Like I'm I'm trying to get in the mood here, but I can't picture what that is. Greg, can you help me?"
  },
  {
    "speaker" : "Steve",
    "text" : "Like, apples, where the fuck did apples come from?",
    "timestamp" : "52:56-52:58"
  },
  {
    "speaker" : "Andy",
    "text" : "And why are they molten apples?",
    "timestamp" : "52:58-53:00"
  },
  {
    "text" : "I don't know. With steel apples, excuse me. Steel apples. Two halves. Two halves makes me think she's talking about a CUDA. You know?",
    "speaker" : "Greg",
    "timestamp" : "53:00-53:09"
  },
  {
    "timestamp" : "53:10-53:11",
    "speaker" : "Andy",
    "text" : "No, explain that."
  },
  {
    "text" : "Well, you know, molten lava halves like together the melty in the middle, you know",
    "speaker" : "Greg",
    "timestamp" : "53:11-53:17"
  },
  {
    "text" : "peach with apples.",
    "speaker" : "Steve",
    "timestamp" : "53:30-53:31"
  },
  {
    "timestamp" : "53:31-53:44",
    "text" : "Yeah, I think that might be it. But anyways, she's he slides his goal post into her open hole, which I mean I guess is a pun, but you don't ever put a goal post into a hole. So it doesn't really",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:44-53:50",
    "text" : "Doesn't really make sense. Fourth in inches wasn't even close to the appropriate term. Right, because it's fourth and inches."
  },
  {
    "text" : "Yeah, which is ironic.",
    "speaker" : "Greg",
    "timestamp" : "53:51-53:52"
  },
  {
    "speaker" : "Andy",
    "text" : "More like first down and goal.",
    "timestamp" : "53:52-53:54"
  },
  {
    "speaker" : "Steve",
    "text" : "Makes no fucking sense either. Yeah. It went off the rails a little bit here, yeah. Yeah, it started getting pretty pretty graphic.",
    "timestamp" : "53:54-54:05"
  },
  {
    "timestamp" : "54:06-54:08",
    "text" : "Yeah, then we get into some booty talk.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "54:08-54:16",
    "speaker" : "Steve",
    "text" : "Yeah, all the she is of all the good football and not football is when he's sitting in the whirlpool and then like by the time they're in the hot tub, she's got nothing left and she's wrapped up."
  },
  {
    "speaker" : "Andy",
    "text" : "I'm desensitized at this point. Like none of this",
    "timestamp" : "54:16-54:18"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean, but when she said, but my backfield was fully penetrated, I was like, whoa, that's great.",
    "timestamp" : "54:19-54:24"
  },
  {
    "timestamp" : "54:25-54:32",
    "text" : "But then later she's like, but then I didn't take it up the butt. And so I was like, wait, did you take in the ass or not? Because that's very confusing.",
    "speaker" : "Steve"
  },
  {
    "text" : "That's that's why innuendo works, because we can interpret it however we see fit. I knew I was gonna feel it in the morning, but I didn't care I knew I'd be shitting pancakes but I didn't care.",
    "timestamp" : "54:33-54:48",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "54:58-54:59",
    "speaker" : "Mom",
    "text" : "Now that's a visual"
  },
  {
    "text" : "Oh my god, I'm gonna be sick. I feel like we should probably rewrite this. Oh man. Yeah. Oh But speaking of that, uh at this point, the hole was so big you could drive a truck through it, hole with a W, by the way. And drive he did. It was a long, sustained drive that lasted the fully 15 minutes. He called the plays and he certainly executed. Short thrusts, deep balls, a few flickers thrown in. A couple flickers. I was so into the moment. He could have called for a You could have called a for a scat and it would have lined up for the action.",
    "speaker" : "Andy",
    "timestamp" : "55:05-55:45"
  },
  {
    "timestamp" : "55:46-55:57",
    "text" : "See that's what I'm saying. Did she take it in the butt or did he cough a sc he didn't cough a scat? So like Did she take it in the tight end or not is the real question. Unanswered.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean I read uh fully penetrated backfield to mean that she was She had been penetrated in the act.",
    "timestamp" : "55:58-56:04"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but then he could have called for the scat and she would have been okay with it, but he didn't.",
    "timestamp" : "56:05-56:09"
  },
  {
    "timestamp" : "56:10-56:10",
    "speaker" : "Andy",
    "text" : "Right."
  },
  {
    "speaker" : "Steve",
    "text" : "I mean, yeah.",
    "timestamp" : "56:10-56:11"
  },
  {
    "text" : "I think that that's",
    "timestamp" : "56:11-56:12",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I think that's more um well the I think that's more the pancakes that Greg was talking about than actual Or maybe we're we're we're confusing scat to me in the rear and maybe it's like ski, skate, skate, skate.",
    "timestamp" : "56:12-56:24"
  },
  {
    "speaker" : "Steve",
    "text" : "No, I think she said, I figured it out. I figured it out. He could have called for the scat meaning like shit on my chest.",
    "timestamp" : "56:24-56:32"
  },
  {
    "timestamp" : "56:33-56:49",
    "text" : "Yes. That's what I was trying to say without saying those exact words, but yes. Because if you read the actual sentence that Greg was referring to, it is uh he had to stretch to get it in, but my backfield was fully penetrated. So I think I th uh yeah, I think there was some some bumps.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, and she said a tight end that had never seen a single play. So that means that He took her anal virginity.",
    "timestamp" : "56:50-56:58",
    "speaker" : "Greg"
  },
  {
    "text" : "But didn't shit on him. Which is good because it's a hot tub and that's a whole mess. But she's as somebody who used to clean pools, like that's not a mess you want to clean up.",
    "timestamp" : "57:01-57:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "The facility's gotta get sued.",
    "timestamp" : "57:12-57:14"
  },
  {
    "text" : "It's like damn the fuck happen in the house.",
    "speaker" : "Mom",
    "timestamp" : "57:21-57:32"
  },
  {
    "text" : "I thought you were just icing up. Damn it, Cam, not again. Hold on underwater.",
    "timestamp" : "57:33-57:42",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "57:45-57:54",
    "text" : "Oh, just just hotboxing there. Oh. Oh yeah. Yeah, let's get to that part.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "57:54-58:02",
    "text" : "Yeah, cuz so the so then her boss somehow wanders his way back into the locker room, into the whirlpool.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:04-58:15",
    "text" : "I don't know how her boss got access, but he's like, hey. Subbody, have you seen have you seen Carolyn anywhere? He's like, I think she went that way. Well she dumps he he dumps her head underwater."
  },
  {
    "timestamp" : "58:16-58:19",
    "text" : "Yeah, he puts her head underwater and is like, nah, I haven't seen her.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "58:21-58:22",
    "text" : "All right, cool."
  },
  {
    "speaker" : "Greg",
    "text" : "Johnny's like, oh man, that's fucking hilarious. Yeah. Oh god And they're like, wow, we really got away with one there. What if my boss had seen me?",
    "timestamp" : "58:23-58:39"
  },
  {
    "speaker" : "Steve",
    "text" : "Jesus Christ.",
    "timestamp" : "58:44-58:46"
  },
  {
    "text" : "I can't read. But all good things come to an end, unfortunately, including this book, because we're on page 20 at this point of 25. And uh so basically Cam invites her to come on the plane for the the plane ride home.",
    "speaker" : "Andy",
    "timestamp" : "58:48-59:05"
  },
  {
    "timestamp" : "59:05-59:08",
    "speaker" : "Steve",
    "text" : "And she's that's a booty call. That's nice."
  },
  {
    "speaker" : "Andy",
    "text" : "She's like, no, I want this. I like this is the special moment between us. This is gonna be our little secret. And uh like I'm gonna end it like this.",
    "timestamp" : "59:08-59:16"
  },
  {
    "timestamp" : "59:16-59:21",
    "text" : "Yeah. And then as she's leaving he goes, Hey, I didn't catch your name.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "59:23-59:25",
    "speaker" : "Mom",
    "text" : "I didn't catch your name"
  },
  {
    "text" : "It's not even funny. Why you laughing? Just fucked your ass. What's in A bottle?",
    "speaker" : "Andy",
    "timestamp" : "59:31-59:35"
  },
  {
    "speaker" : "Mom",
    "timestamp" : "59:48-59:49",
    "text" : "Oh fuck"
  },
  {
    "timestamp" : "59:56-01:00:12",
    "speaker" : "Andy",
    "text" : "How perfect. Well, Caroline, he said. He raised his hands in position and said, Don't forget to, as he dabbed. I dabbed back. We both smiled and out the doorway and into the night I went. Oh my goodness."
  },
  {
    "timestamp" : "01:00:13-01:00:20",
    "text" : "And then she thought she was gonna get fired, but then sh then she got a promotion, right? Oh yeah. Yeah.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "A promotion that allows her to travel the world and do other shit. I don't know.",
    "timestamp" : "01:00:20-01:00:25"
  },
  {
    "speaker" : "Steve",
    "text" : "The core office that can view the Super Bowl parade. Yeah.",
    "timestamp" : "01:00:26-01:00:29"
  },
  {
    "speaker" : "Greg",
    "text" : "I thought this was a little subcontext that maybe he had seen what was going on in the hot tub and is like, okay, we'll send this girl out to be a fucking client pleaser.",
    "timestamp" : "01:00:29-01:00:39"
  },
  {
    "text" : "She's got what it takes.",
    "timestamp" : "01:00:40-01:00:41",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:00:41-01:00:41"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. And he's like, oh, well, you know, I I Uh I I let your your boss know, Donald Devlin, which is real close to the devil. Except it's not real close to James Devlin, right.",
    "timestamp" : "01:00:42-01:00:53"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:00:53-01:00:58",
    "text" : "Yeah. Donald Devlin? She's ready to go the whole nine inches."
  },
  {
    "speaker" : "Andy",
    "text" : "You're a senior analyst on our client side team. Requires a lot of traveling and client interfacing. So maybe you're right, Greg. And uh he's like, you know, I uh I'm sorry, I really should have consulted to you first, but you know, is that cool with you? And she's like, I love it, thank you. Yeah, and then and then there was this which was like a little Interesting, I thought. Says, and I did love it. So much that I gave Brian a hug right then and there. He was great. I saw him as a sort of father figure now, someone who would watch over me at times and make sure everything's okay. She just met this guy like two days ago when she was like when she won the thing. She'd never met him before. And now he's a father figure Yeah. Just cause she caught a football. Something's there.",
    "timestamp" : "01:01:03-01:01:43"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, daddy issues.",
    "timestamp" : "01:01:43-01:01:45"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, dabble cam too.",
    "timestamp" : "01:01:45-01:01:47"
  },
  {
    "timestamp" : "01:01:49-01:01:49",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:01:49-01:02:09",
    "text" : "Dab and Brian. Yeah. See, I this is my takeaway from this book is that this is all a social critique on Bank of America. What? Hear me out. I'm listening. I am all ears. Hear me out.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:02:10-01:02:11",
    "speaker" : "Steve",
    "text" : "Couldn't say that when I'm fucking drinking a beard."
  },
  {
    "text" : "Hear me out, right? She's working the she's working the shit fucking numbers job in Charlotte uh North Carolina. Oh, where's Bank of America's headquarters? Yeah what Charlotte North Carolina remember they mention they mentioned uh oh out of the hundred and fifty th thousand employees.",
    "timestamp" : "01:02:14-01:02:36",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:02:36-01:02:40",
    "speaker" : "Steve",
    "text" : "They were yeah, 159,000. They were very specific about that. They were."
  },
  {
    "text" : "You want to know you want to know how many employees Bank of America has? I did. 137,000 employees. Interesting. As of twenty sixteen, I bet it might have been more. Yes, yes, yes, yes. And then she she all she goes away on this fancy trip and she doesn't even do anything work related. In fact, she makes work take a back seat, but somehow gets promoted at the end of it just by pure like chance, not because of work ethic. And that just goes to show you that it's not about who does the most work to get ahead. It's just who fucking sleeps with the athlete or gets to go to the big name and rub elbows with the executives. That's what's wrong. with America and our banking system specifically.",
    "timestamp" : "01:02:40-01:03:27",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:03:28-01:03:34",
    "text" : "I capitalism I call you a lot, but you are definitely onto something. Yes. He's an idiot savant.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:03:35-01:03:36",
    "text" : "Thank you.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, you're right. This is a subtle critique of our capitalistic nature, especially the lead way we give these big banks to just fucking Waste all the taxpayer money, get failed out of the money. You know what I do to that?",
    "timestamp" : "01:03:37-01:03:55"
  },
  {
    "text" : "You want to answer to that? Dabbing.",
    "speaker" : "Andy",
    "timestamp" : "01:03:55-01:03:59"
  },
  {
    "speaker" : "Greg",
    "text" : "Dab on the haters.",
    "timestamp" : "01:04:00-01:04:01"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:02-01:04:04",
    "text" : "I dabbed on the haters."
  },
  {
    "text" : "Also, did you notice how often she referenced like, oh, lucky this or lucky that? Like, oh, that's my lucky jersey or oh my lucky tank. There was a lot of that talk. Yeah. Oh, the lucky girl, which makes me think, oh yeah, it's all about luck, not about like hard work. It's true. Makes you think.",
    "timestamp" : "01:04:05-01:04:26",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:04:26-01:04:34",
    "text" : "Makes well here's here's my here's my whole take on this thing. And a different perspective. And a more micro perspective.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "01:04:35-01:04:35"
  },
  {
    "text" : "Emily hates her. Oh yeah. She's secretly thinking that should have been me taking a hot tub dip with Cam Newton. She's wearing my lucky jersey. But she doesn't know about it. There's no way these girls remain friends.",
    "timestamp" : "01:04:36-01:04:51",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:04:51-01:06:04",
    "text" : "I disagree because at the end, this is all wrapped up nicely because uh Caroline comes back a change woman. Realizes she's she's not gonna be doing this 70 hours a week, not having uh, you know, her her best friends aren't gonna be Ben and Jerry anymore and Louis Vuitton CK. Um So what she does is she comes back and as a thank you to Emily, takes both of them on a trip to Paris. She gives them tickets to Paris, which apparently is something they've been talking about forever, because it's that trip. Um And but before they go, like as as it wraps up the the end of this this story. Um It is. So, you know, there she's like saying thank you for for doing this. And uh so Emily says, girl, I can't wait to go with you, see what trouble we can get into. Me either, but first, I said as I turned my head sideways and raised my eyebrows, we gotta dab. And dab we did until we fell to the ground, rolling on the carpet in laughter. Best friends are crazy like that Go Panthers."
  },
  {
    "timestamp" : "01:06:05-01:06:07",
    "speaker" : "Greg",
    "text" : "The end. Finn."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, they definitely don't like each other. All up to the ground laughing and dabbing.",
    "timestamp" : "01:06:08-01:06:12"
  },
  {
    "text" : "Hey, hey, hey, hey, hey, hey. Best friends are crazy like that.",
    "timestamp" : "01:06:12-01:06:16",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, Steve. You don't do that with your best friend, Steve? Yeah, haven't you ever been on Instagram. com? You dumbass. Chicks love each other. Yeah. Steven, Steven. I'm guys I'm tuckered.",
    "timestamp" : "01:06:16-01:06:34",
    "speaker" : "Greg"
  },
  {
    "text" : "I just think I just think Emily is gonna be resentful forever for entering her friend into that conversation who then won and then took her jersey.",
    "timestamp" : "01:06:34-01:06:41",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:06:41-01:06:42",
    "speaker" : "Greg",
    "text" : "In her jersey, yeah."
  },
  {
    "timestamp" : "01:06:43-01:06:58",
    "speaker" : "Steve",
    "text" : "And and Caroline is holding back the secret that she banged Cam. Yeah, supposed to be best friends. At some point, they're gonna go to Paris and get drunk. She's like, oh girl, I have to You mean Cam, you know? His his dick is as wide as it is long and she's like, what the fuck?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:07:01-01:07:04",
    "text" : "This random French dick we're getting is okay, but you should have seen Cam's."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah",
    "timestamp" : "01:07:04-01:07:05"
  },
  {
    "timestamp" : "01:07:05-01:07:05",
    "text" : "Yes.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07:06-01:07:16",
    "text" : "And they're supposed to be best friends that have known each other forever. They've been planning trip to Paris their whole lives. And she's not even going to tell them about sleeping with the Super Bowl MVP immediately after the game.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:07:16-01:07:16",
    "text" : "Exactly.",
    "speaker" : "Steve"
  },
  {
    "text" : "On a trip that you were only there because you got entered in by Emily. That's what I'm saying. Yep.",
    "speaker" : "Greg",
    "timestamp" : "01:07:17-01:07:22"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:07:23-01:07:28",
    "text" : "Emily could have been Emily's trip. Emily would have enjoyed it more. Caroline's a bitch. Yep."
  },
  {
    "text" : "And fuck Bank America.",
    "timestamp" : "01:07:31-01:07:32",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07:33-01:07:51",
    "speaker" : "Greg",
    "text" : "Yes. Okay, um I Googled um book club tocket topics for 50 Shades of Grey, because I thought they just like they'd they'd parallel well here. Do you want me to bring up a couple of the questions?"
  },
  {
    "timestamp" : "01:07:51-01:07:52",
    "speaker" : "Steve",
    "text" : "Sure, sure."
  },
  {
    "text" : "Yeah. Okay. Um, this book is marketed as steamy erotica for suburban housewives. Is this accurate? Do you think reading about intense sexual encounters enhances a sexual experience? Of the many sex scenes, discuss your favorite or least favorite.",
    "speaker" : "Greg",
    "timestamp" : "01:07:52-01:08:08"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:08:08-01:08:09",
    "text" : "There was only one sex scene."
  },
  {
    "timestamp" : "01:08:10-01:08:11",
    "text" : "Yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay.",
    "timestamp" : "01:08:12-01:08:12"
  },
  {
    "text" : "Unless he comes from Cam getting fucked up on the field.",
    "timestamp" : "01:08:13-01:08:16",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Do you think this is uh marketed as a steamy erotica for suburban housewives?",
    "timestamp" : "01:08:18-01:08:23"
  },
  {
    "text" : "No, I think it's marketed as a steamy erotica for guys like us.",
    "timestamp" : "01:08:23-01:08:26",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:08:26-01:08:29",
    "text" : "Yeah, yeah, we we are the target market.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:08:29-01:08:41",
    "text" : "Well, I don't know, the whole the whole like, oh, Emily's my best friend, that screamed to me like marketing towards women. Like I hate my I hate my best friends. I hate you guys. I hate all my friends."
  },
  {
    "text" : "Yeah. You say f friends, but I don't think that word means what you think it means.",
    "timestamp" : "01:08:42-01:08:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:08:46-01:09:02",
    "text" : "Yeah, I don't think you have any friends. Wow. You have like like people who are obligated to be your friends, like me and Andy, but that Yeah and and people you see at work, but they're paid to be there too. Yeah, they're from like Czech Republic. You guys talk about fucking Pasternock, that's it."
  },
  {
    "text" : "Mm-hmm.",
    "timestamp" : "01:09:02-01:09:03",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:09:03-01:09:19",
    "speaker" : "Greg",
    "text" : "Peter Hoskell. Love that guy. Yeah, no, I'm out on that. Keep going. All right. Does this book place women in a degrading light, as some have claimed? I could see that."
  },
  {
    "timestamp" : "01:09:20-01:09:21",
    "speaker" : "Andy",
    "text" : "The bumbling drunk idiot."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, the the kind of former smart smarty two pants, you know, fucking a junior accountant does everything right and then goes and gets drunk.",
    "timestamp" : "01:09:21-01:09:29"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, and like even the beginning she was like seeing herself as a bit of a loser too.",
    "timestamp" : "01:09:30-01:09:33"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, and she's like a redeemer with the whole like, oh I caught balls because my dad taught me how to, and then I call my dad and we'd cry about it.",
    "timestamp" : "01:09:33-01:09:40"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:09:40-01:09:40"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "01:09:40-01:09:40"
  },
  {
    "timestamp" : "01:09:41-01:09:44",
    "speaker" : "Greg",
    "text" : "And why wouldn't like her mom teach her how to catch football, so you know?"
  },
  {
    "timestamp" : "01:09:44-01:09:46",
    "speaker" : "Steve",
    "text" : "Well her mom was dead. Do you didn't get that?"
  },
  {
    "text" : "Oh no. Oops. My bad. And she's like fangirl. I thought Cam Newton was a very flat character in this, you know? Like he was just he was just a A piece of meat with a fucking cock attached to them.",
    "timestamp" : "01:09:46-01:10:03",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:10:03-01:10:09",
    "speaker" : "Steve",
    "text" : "You know, there was a green anybody, it's uh athletes with big dicks. Yeah, yeah."
  },
  {
    "text" : "There's no character arc, there was nothing there. Uh I really didn't uh you know uh I was offended quite honestly.",
    "speaker" : "Greg",
    "timestamp" : "01:10:09-01:10:16"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, yeah as an athlete with a huge dick I also was offended.",
    "timestamp" : "01:10:17-01:10:21"
  },
  {
    "text" : "I mean you are a dummy.",
    "timestamp" : "01:10:23-01:10:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, there is more to us than just length and girth, I'll have you know, okay?",
    "timestamp" : "01:10:25-01:10:29"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, right.",
    "timestamp" : "01:10:29-01:10:30"
  },
  {
    "text" : "I've I've used two. Yeah. And dancing. Andy, comment?",
    "speaker" : "Greg",
    "timestamp" : "01:10:30-01:10:39"
  },
  {
    "timestamp" : "01:10:40-01:10:43",
    "text" : "I'm a smart one on this, I think we all know.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, came up with that whole idea, so it clearly has a microped.",
    "speaker" : "Steve",
    "timestamp" : "01:10:43-01:10:47"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, were you guys aroused at any part in this book? Uh it was weak smut. Let's throw that out.",
    "timestamp" : "01:10:52-01:10:58"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:59-01:11:01",
    "text" : "It wasn't great. Yeah. Weak smut."
  },
  {
    "timestamp" : "01:11:01-01:11:02",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:02-01:11:17",
    "text" : "I mean, because uh we're comparing this to kind of the gold standard of a gronking to remember. And there's there's some steamy scenes in that. I mean it's also a bit more fleshed out too, pun intended. Um, but I don't think this kind of holds a candle to that one in terms of"
  },
  {
    "text" : "The like you said, Greg. First draft, you know? Yeah. Yeah. You probably could have made this better, but this is uh slapped it together, didn't even edit it, just throw it out there, make nine bucks off an idiot like you.",
    "timestamp" : "01:11:17-01:11:29",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. And I and I came into this uh to read this and come onto this podcast perfectly willing to admit any time I became aroused by this book. But I can't I can't lie to you guys and say that at any point did I have any feelings of sexual arousal. Yeah, those are yeah It just wasn't written well enough to be forced. Yeah.",
    "timestamp" : "01:11:29-01:11:52",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:11:53-01:12:01",
    "text" : "So much football or not football that it just took it to an insane amount of life. You know We we we know what we need to do, right?"
  },
  {
    "text" : "We gotta write our own.",
    "timestamp" : "01:12:01-01:12:02",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:12:02-01:12:09",
    "text" : "No, no, no. We all need to Christmas get Mike this book and ship it right to him so I'll see these open"
  },
  {
    "text" : "I love that you think it's not already on the way. Oh, this is not Mike Mello's book. I don't know what it's right in the wheelhouse. Yeah. I mean he he he already caught most of these sayings already anyway during regular football broadcasts. All right. Here's an advantage.",
    "timestamp" : "01:12:10-01:12:28",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "We bring Mike back on to uh direct and produce a film adaptation of Dabbin with Cam.",
    "timestamp" : "01:12:30-01:12:39"
  },
  {
    "speaker" : "Andy",
    "text" : "Are we the actors in this?",
    "timestamp" : "01:12:40-01:12:42"
  },
  {
    "speaker" : "Greg",
    "text" : "Yes. Is Steven Caroline Blue? We can make we can discuss that, but I think uh I think he's definitely the most feminine of us.",
    "timestamp" : "01:12:42-01:12:51"
  },
  {
    "speaker" : "Steve",
    "text" : "No, we'll have Kelly be it. I will be the next governor. You can be Emily, Greg, you can be Cam.",
    "timestamp" : "01:12:52-01:13:02"
  },
  {
    "timestamp" : "01:13:03-01:13:11",
    "text" : "Yeah. I I w I work with a black guy so I'll have him be Cam and then Oh my god",
    "speaker" : "Greg"
  },
  {
    "text" : "I even closely vaguely remember Cam, like the guy on the picture up. Yeah, yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:13:13-01:13:17"
  },
  {
    "text" : "Oh my god. Apparently you can just insert black guy and whatever, yeah. Like whatever.",
    "speaker" : "Greg",
    "timestamp" : "01:13:18-01:13:22"
  },
  {
    "text" : "Close enough. So but I I think Greg, you might be honest with me. I think we could make a couple of bucks writing one of these. What would that be about?",
    "speaker" : "Andy",
    "timestamp" : "01:13:24-01:13:33"
  },
  {
    "text" : "I mean you said the Edelman one. I think that there's a lot of squirrel finds a nut uh jokes in there.",
    "timestamp" : "01:13:33-01:13:39",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:39-01:13:46",
    "text" : "There is an Edelman one out there already. Really? So yeah, we may have to look into that. I can't remember what it's called."
  },
  {
    "text" : "I got one. I got one. Sex Burkehead.",
    "timestamp" : "01:13:46-01:13:49",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Ooh. Not bad. Is there a Tom Brady one? There has to be, right?",
    "timestamp" : "01:13:50-01:13:58"
  },
  {
    "timestamp" : "01:13:59-01:13:59",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:14:00-01:14:01",
    "speaker" : "Andy",
    "text" : "That's almost too easy."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:14:01-01:14:11",
    "text" : "Wait, wait, wait. What about Troy Brown one? Where he's very polite and takes them out on like really nice dates and it's just like a I don't think we could do enough erotic in ask their father for their hand in marriage and then just look in."
  },
  {
    "timestamp" : "01:14:12-01:14:18",
    "text" : "It's like a Christian version of a romantic novel. Yeah, it's literally just romance.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:14:18-01:14:26",
    "text" : "There's no erotic in it. I mean we could uh I initially I was thinking Bill Belichick. I think that would be weird."
  },
  {
    "speaker" : "Greg",
    "text" : "Oh well we're the better I think on this genre. A Belichick one.",
    "timestamp" : "01:14:26-01:14:30"
  },
  {
    "speaker" : "Andy",
    "text" : "With Ernie Adams showing up somehow. Okay. Yeah. I think I think we'll have to workshop this.",
    "timestamp" : "01:14:32-01:14:39"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:14:40-01:14:47",
    "text" : "Yeah. And it's just instead of actually being erotic, it's just like going over a bunch of like game film, the whole book."
  },
  {
    "timestamp" : "01:14:48-01:14:50",
    "text" : "The whole book is just marketed.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, it's marketed as fucking round.",
    "speaker" : "Greg",
    "timestamp" : "01:14:50-01:14:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that's not bad. It's Belichick watching film, but everything is innuendo.",
    "timestamp" : "01:14:53-01:14:56"
  },
  {
    "text" : "The Caroline instead of Caroline Blue it's just a football.",
    "speaker" : "Steve",
    "timestamp" : "01:14:59-01:15:01"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:15:02-01:15:06",
    "text" : "No, it's him watching game film, but he's talking dirty. To the football."
  },
  {
    "speaker" : "Steve",
    "text" : "To the game film.",
    "timestamp" : "01:15:07-01:15:07"
  },
  {
    "timestamp" : "01:15:10-01:15:21",
    "speaker" : "Greg",
    "text" : "He's fucking a pig skin. He's just fucking a pig. Cuts a hole in the playbook. Just happen. And we call it uh love of the game"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:15:22-01:15:24",
    "text" : "No, not bad. Not bad."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:15:25-01:15:33",
    "text" : "He just has he has sex with sex with inanimate football-related objects like tackling ding chairs. Yeah, tackling danger."
  },
  {
    "text" : "The goalposts. Oh man. Yeah. Oh, I already know what the end scene's gonna be, and it's terrible. But I don't think we should ruin it for the listeners, so I'll tell you.",
    "speaker" : "Andy",
    "timestamp" : "01:15:35-01:15:45"
  },
  {
    "text" : "film spinning around uh the projector the whole dude all right I think uh I have one last question sure do you think Cam Newton has read this",
    "timestamp" : "01:15:45-01:15:55",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:15:57-01:16:01",
    "text" : "I wouldn't say Reddit. I bet he's aware of it. You think?"
  },
  {
    "speaker" : "Andy",
    "text" : "I feel like you probably have to be.",
    "timestamp" : "01:16:01-01:16:03"
  },
  {
    "text" : "Yeah. I mean someone would have asked him about it. Like a a friend. Like if if I had a friend and I found this, I'd be like, dude, immediately tell them.",
    "timestamp" : "01:16:03-01:16:10",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:16:10-01:16:10",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:16:11-01:16:12",
    "speaker" : "Greg",
    "text" : "But I doubt he's read it."
  },
  {
    "text" : "Somebody may have read it to him though, because this shit's fucking hilarious.",
    "timestamp" : "01:16:13-01:16:16",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "They might have like told him excerpts, but I don't know if like That's what I mean.",
    "timestamp" : "01:16:16-01:16:19"
  },
  {
    "text" : "Yeah, not the whole thing, but yeah, the the good.",
    "speaker" : "Andy",
    "timestamp" : "01:16:19-01:16:20"
  },
  {
    "timestamp" : "01:16:22-01:16:27",
    "speaker" : "Steve",
    "text" : "Is there a way to translate it into his hieroglyphics and then send it to him? Yes."
  },
  {
    "timestamp" : "01:16:29-01:16:36",
    "speaker" : "Andy",
    "text" : "Oh. Andy. Oh, so there is a translator out there. And I think we'll just tweet it at him."
  },
  {
    "timestamp" : "01:16:36-01:16:37",
    "speaker" : "Steve",
    "text" : "Yes."
  },
  {
    "speaker" : "Andy",
    "text" : "In 180 characters at a time. Tweet out the highlights in Greg's book. The whole book. We'll just tweet the whole book at him. 180 characters at a time. That's only like what six tweets? This is not a long book.",
    "timestamp" : "01:16:37-01:16:50"
  },
  {
    "speaker" : "Steve",
    "text" : "Not a long book. It's definitely doable.",
    "timestamp" : "01:16:51-01:16:52"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:16:53-01:16:57",
    "text" : "But I do think, yeah, that's not a bad idea. Maybe we'll create a whole separate Twitter account. No."
  },
  {
    "text" : "Let's just do it from the podcast account.",
    "speaker" : "Steve",
    "timestamp" : "01:16:59-01:17:00"
  },
  {
    "text" : "Just from all right, fuck it. Oh, in the hieroglyphics. Okay, we can do that. I love that. Alright, we'll get on that. Oh my goodness. I need a cigarette. I don't smoke, but I need a cigarette after this one, boys. That was a wild ride.",
    "speaker" : "Andy",
    "timestamp" : "01:17:01-01:17:17"
  },
  {
    "text" : "Best and worst. Or uh actually just rate rate this on a Lombardi scale, the book.",
    "speaker" : "Greg",
    "timestamp" : "01:17:17-01:17:23"
  },
  {
    "text" : "Out of Panthers on Bodies or out of Patriots Lumbies?",
    "timestamp" : "01:17:24-01:17:26",
    "speaker" : "Andy"
  },
  {
    "text" : "Patriots Lumbies.",
    "timestamp" : "01:17:26-01:17:28",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. Uh three? I'm gonna go. Well, I think I think the the book itself was a two. But just the fact that uh reading it together made me laugh so hard I choked on my own spit, I think gives it an extra lombardi. So I'm giving it a three. By the day by the way, what's your name?",
    "timestamp" : "01:17:28-01:17:50"
  },
  {
    "text" : "That one fucking got me, dude. Yeah, no sh It just fucked her in the ass in a hot tub. I forgot your name.",
    "timestamp" : "01:17:54-01:18:07",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:18:08-01:18:09",
    "speaker" : "Andy",
    "text" : "Oh jeez."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:18:09-01:18:46",
    "text" : "Do you want to come on my plane? Hey Cam, who's this? Oh, I don't know actually. What's your name? Alright, I'll give this I'll give gonna give this two different scores. Okay. Panthers Lombardi of like a one. And a Patriots Lombardi of like a four and a half, four and an AFC chickens. Wow. Because like as a book, it's just not a good book. No. But as a Patriots fan and like looking at it from all is this funny or not? It's pretty fucking funny."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:18:46-01:18:57",
    "text" : "Yeah. Yeah. Just the fact that the 10 points was the biggest Big game deficit back from literally the year before, written the year before the pages due 28 to 3."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Fantastic. And I have in here, wait, this is a super toll. They should dive on the fumble too.",
    "timestamp" : "01:18:57-01:19:02"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:19:04-01:19:06",
    "text" : "You know? Business decisions."
  },
  {
    "timestamp" : "01:19:08-01:19:09",
    "speaker" : "Andy",
    "text" : "All right, Greg."
  },
  {
    "timestamp" : "01:19:09-01:19:48",
    "speaker" : "Greg",
    "text" : "I give it out of six, I give it four and a half. I think we're the possibility. To go up to five and a half if that social critique piece of it is the intended the intentions of the author. That's fair. I think she needs to clean up some, you know, grammatical. That's why yeah, I I graded harder on that. Yeah. Yeah. But as far as uh, you know, I b I paid nine dollars to get some laughs to not have to commit a lot of time, and it it it accomplished everything I wanted it to accomplish."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:19:48-01:19:54",
    "text" : "So I just want to know for the both of you, because I think I got you them for Christmas. Did you read the Gronking to Remember books?"
  },
  {
    "timestamp" : "01:19:55-01:19:57",
    "speaker" : "Greg",
    "text" : "I think so, but I don't remember it at all."
  },
  {
    "timestamp" : "01:19:57-01:19:59",
    "speaker" : "Steve",
    "text" : "I don't think I did. I think you got me the Gronking too."
  },
  {
    "text" : "So maybe that's why. Yeah, maybe that's why I've uh I've graded it harsher because I've read the pinnacle of of the genre, I think, in those books.",
    "speaker" : "Andy",
    "timestamp" : "01:20:00-01:20:10"
  },
  {
    "text" : "So maybe we'll have to do our own Belichick version and top them all.",
    "timestamp" : "01:20:10-01:20:15",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:20:15-01:20:20",
    "speaker" : "Greg",
    "text" : "I think we could write. I honestly think we could write one better than this. I think so too."
  },
  {
    "timestamp" : "01:20:21-01:20:22",
    "text" : "Yes, yes, yes. I agree.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:20:22-01:20:24",
    "text" : "Alright, I'm gonna put together.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "We're not going to. I've done dumber shit for a last frigged. All right.",
    "timestamp" : "01:20:24-01:20:30"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:20:35-01:20:41",
    "text" : "How long do you think uh how much do you think it costs to get it published? I bet you can self-publish it on Amazon, yeah."
  },
  {
    "text" : "Yeah, yeah. Only charge you when it prints.",
    "timestamp" : "01:20:42-01:20:44",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "All right. I'm in. All right. I'm in.",
    "timestamp" : "01:20:45-01:20:47"
  },
  {
    "text" : "We're doing it. We just need Mike now.",
    "timestamp" : "01:20:48-01:20:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:20:49-01:20:55",
    "text" : "I'll I'll write I'll write chapter uh two. You start with chapter one, Andy. I'll write chapter two."
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. And then yeah, and then Steve can do three and we'll just rotate all the way through.",
    "timestamp" : "01:20:56-01:21:00"
  },
  {
    "text" : "Yeah. And and we can't come up with the idea together what the whole plot line is.",
    "speaker" : "Greg",
    "timestamp" : "01:21:00-01:21:08"
  },
  {
    "text" : "We just have to keep building on the previous plot. Yes. This is exactly how it's gonna go. You just have to rewhat what it's what's there so far and add your own and keep building on it. All right. So I'll I'll get that started.",
    "speaker" : "Andy",
    "timestamp" : "01:21:08-01:21:19"
  },
  {
    "text" : "We'll see where this tells us.",
    "speaker" : "Steve",
    "timestamp" : "01:21:19-01:21:21"
  },
  {
    "speaker" : "Andy",
    "text" : "And then if you want to support the podcast, you can buy this um masterpiece, I'm sure, is what it's gonna end up being.",
    "timestamp" : "01:21:23-01:21:29"
  },
  {
    "text" : "It's gonna be fucking sweet.",
    "timestamp" : "01:21:29-01:21:31",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:21:31-01:22:07",
    "text" : "Greg, we may need you to draw some oh because none of these actually have any pictures, but we may have if you draw this, get some illustrations. All right. Yeah We'll get to that. We'll get to that when we get to it. But for now, we will leave the listeners What listeners we have left. I'm not even gonna give out the rate this podcast. So join us next week on what might be something a little less saucy. On the Pages Diocee Podcast. See you later."
  },
  {
    "timestamp" : "01:22:07-01:22:08",
    "speaker" : "Steve",
    "text" : "Ayo later"
  }
]