[
  {
    "speaker" : "Mom",
    "timestamp" : "00:00-00:17",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:21-00:31",
    "text" : "Alright, welcome back. Patrick's Dynasty Podcast Emergency Episode Because uh this is worth interrupting our season for, I think, boys."
  },
  {
    "timestamp" : "00:31-00:46",
    "speaker" : "Greg",
    "text" : "Uh should we do the emergency weather service noise? Give it to us again, Greg. So obnoxious. What is it? The weather service noise"
  },
  {
    "timestamp" : "00:46-00:47",
    "text" : "Hit us with it again.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "00:48-00:51",
    "speaker" : "Greg",
    "text" : "No, I'm not I'm not your monkey Steve. I'm just Dan."
  },
  {
    "timestamp" : "00:51-00:53",
    "speaker" : "Steve",
    "text" : "Okay, and you can cut it and then redo it."
  },
  {
    "speaker" : "Greg",
    "text" : "Um another thing I hate about those is when they like do it on the TV and they have that like robot voice doing it.",
    "timestamp" : "00:55-01:03"
  },
  {
    "text" : "Oh yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:04-01:05"
  },
  {
    "timestamp" : "01:05-01:11",
    "speaker" : "Greg",
    "text" : "Why can't you just have a human make that like s say the words and then just play that?"
  },
  {
    "timestamp" : "01:11-01:13",
    "text" : "I think they well they do round here.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "You want you want like someone to actually read it live or you want a human voice instead of a robot voice?",
    "timestamp" : "01:14-01:18"
  },
  {
    "speaker" : "Greg",
    "text" : "It doesn't take that much effort to make it less obnoxious than what it is. I think it's supposed to be obnoxious.",
    "timestamp" : "01:19-01:25"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:25-01:26",
    "text" : "Yeah"
  },
  {
    "timestamp" : "01:25-01:26",
    "speaker" : "Andy",
    "text" : "To grab your attention."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, Mandy's right. What they should really do is get your voice to do it, because that is really obnoxious.",
    "timestamp" : "01:27-01:33"
  },
  {
    "timestamp" : "01:37-02:32",
    "speaker" : "Andy",
    "text" : "Uh so yeah, so we are talking, it's not even football season, but um I feel like Tom Brady left this offseason, which we did an emergency episode for. And this season, Bill Belichick decided to take that personally and has signed pretty much the entire free agency. field of players, would you say? No. Well a good portion of not say. I would. I'm gonna say that. At least until this point, this is Thursday, March 18th. So they've signed pretty much Everybody they fucking want to, starting with uh even before free agency started, before the quote-unquote legal tampering period started. They traded they traded back for Trent Brown. So they retraded for him. I don't I don't know the best way to word that."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:34-02:36",
    "text" : "R trade it again. I don't think traded again."
  },
  {
    "timestamp" : "02:37-02:39",
    "speaker" : "Andy",
    "text" : "Re-re-reacquired."
  },
  {
    "text" : "He's one of three players who've been traded twice.",
    "timestamp" : "02:39-02:42",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:42-02:44",
    "speaker" : "Greg",
    "text" : "Brought him back in the fold."
  },
  {
    "timestamp" : "02:45-02:49",
    "text" : "So he's the bosom of of Gillette of Foxboro.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "02:50-03:02",
    "speaker" : "Greg",
    "text" : "That's why I have my uh Dion Branch jersey on today in honor of Patriots that have left and you have their jersey and then they come back and you're like, whoa, yeah, back in style, baby. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Everyone with Kyle Van Noy nodding ahead right now.",
    "timestamp" : "03:02-03:05"
  },
  {
    "timestamp" : "03:05-03:15",
    "speaker" : "Greg",
    "text" : "Yeah. Or Patrick. Oh. Ted Karas. Ted Karris. Ted Karas' mom is like, thank God I can wear this thing again."
  },
  {
    "timestamp" : "03:16-03:18",
    "speaker" : "Steve",
    "text" : "She throws a dolphin's one in the trash."
  },
  {
    "speaker" : "Andy",
    "text" : "She didn't buy a dolphin's one. Who are you kidding? Yeah, so I mean that they've had a busy offseason so far because um they've also re-signed a bunch of players as well, including quarterback Cam Newton. Do you boys have thoughts on that? Yay or nay.",
    "timestamp" : "03:20-03:37"
  },
  {
    "timestamp" : "03:37-03:54",
    "text" : "Well when they first dropped it, it was like the 14 million number, everyone freaked out. Right. Dana was 5 million, and that was way more about it. All upside, no, no downside. You got paid five million last year. So you bring it back to the same price and see what else you can do with it",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "03:54-03:58",
    "speaker" : "Andy",
    "text" : "And put some people around him, let them have a second year in the system with maybe an off season."
  },
  {
    "text" : "You would hope that last year was the floor. And if you run that floor out again, maybe it's a little higher because all the guys I signed, but you know, the other side Get someone else.",
    "speaker" : "Steve",
    "timestamp" : "03:59-04:07"
  },
  {
    "timestamp" : "04:08-04:13",
    "speaker" : "Greg",
    "text" : "I think we should I think we should close with this question. You know?"
  },
  {
    "text" : "Okay.",
    "speaker" : "Steve",
    "timestamp" : "04:14-04:14"
  },
  {
    "text" : "Because that's ultimately what you think you do at quarterback? Exactly. That's the that's the only like pending question. So I think we should have that discussion after we talk about this.",
    "timestamp" : "04:14-04:22",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "04:22-04:35",
    "text" : "Yeah, and I'll we'll table aside discussion too, but what we've done to change a team really changes that question. Correct. Exactly. Let's go into what the new team would sort of look like and all different moves there."
  },
  {
    "speaker" : "Andy",
    "text" : "Non-CAM. Yeah. So the big splash was First thing in the morning when the Patriots uh when legal tampering started. They signed the top two tight ends. Well, they signed the top tight end, and then the next morning they signed the other top tight end, right? So John Smith from uh the Titans, 25 years old. Play he's been in the league for four years. Uh has kind of a um Aaron Hernandez vibe, if you will, minus the murdery stuff. An on-the-field arrogant. Okay, alright.",
    "timestamp" : "04:35-05:12"
  },
  {
    "timestamp" : "05:13-05:14",
    "speaker" : "Greg",
    "text" : "I was like, whoa, print talk about projects."
  },
  {
    "timestamp" : "05:17-05:18",
    "text" : "Yeah, yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "05:19-05:25",
    "text" : "No, he was minus yeah, minus being gay, murdering people, and cu committing suicide. He's exactly like him."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:26-05:31",
    "text" : "Right, yeah. He he's a spitting image on the field. If he wears 81, uh I don't think he'd be able to tell him apart."
  },
  {
    "text" : "I don't know. He's a beefcake. Yeah.",
    "timestamp" : "05:31-05:33",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "See how big that dude is? You're a beefcake. He's a hog moly. But he's not e but he's like He's the shiftier of the two. Like Hunter Henry's the the road grader, isn't he?",
    "timestamp" : "05:33-05:46"
  },
  {
    "timestamp" : "05:46-05:46",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "05:47-06:09",
    "text" : "And Hunter more than the way everybody's talking about is Hunter Henry fits the the Gronk role more and like the inline run blocking type of Tight end who can catch passes as well. Whereas Johnny Smith is more of like that guy you can split wide, put anywhere you want, line him up in the backfield and hand it off to him, that sort of thing. Run screens to him."
  },
  {
    "timestamp" : "06:09-06:17",
    "speaker" : "Greg",
    "text" : "More of a more of an athlete than a He's thick though. You know, he's like uh DJ Metcalf where it's like"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "06:17-06:23",
    "text" : "So I I haven't I haven't seen him with a shirt off. So can you get how how many C's are you putting on that thick?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "06:23-06:31",
    "text" : "Well just Google it dude he looks like a linebacker without a shirt off. He looks like a middle linebacker. His neck is the size of my waist."
  },
  {
    "timestamp" : "06:32-06:34",
    "speaker" : "Andy",
    "text" : "So is that is that like a 3C sick?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, thick.",
    "timestamp" : "06:34-06:35"
  },
  {
    "timestamp" : "06:35-06:36",
    "speaker" : "Steve",
    "text" : "Yeah, I agree with A. Can we put it as a number?"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay.",
    "timestamp" : "06:39-06:39"
  },
  {
    "timestamp" : "06:42-06:49",
    "text" : "Nice. And yet he'll still look uh like a midget next to Trent Brown. Correct.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah Yeah, Trent Brown's. I forgot how massive he is until sometimes you see pictures of it. So but it was awesome. You could see it in games. He was just so much more massive than everybody else.",
    "speaker" : "Steve",
    "timestamp" : "06:49-06:58"
  },
  {
    "speaker" : "Andy",
    "text" : "He is. Yeah.",
    "timestamp" : "06:58-06:59"
  },
  {
    "speaker" : "Steve",
    "text" : "He was awesome when he was here.",
    "timestamp" : "06:59-07:01"
  },
  {
    "timestamp" : "07:01-07:02",
    "speaker" : "Andy",
    "text" : "How big is he?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "07:05-07:07",
    "text" : "I also have a question, how much should the Raiders pay him?"
  },
  {
    "timestamp" : "07:11-07:18",
    "speaker" : "Andy",
    "text" : "Um I mean they they spent a shit ton on him. Shit ton. He wasn't there for very long though."
  },
  {
    "speaker" : "Steve",
    "text" : "It was super quick too. Like he was only there two years.",
    "timestamp" : "07:18-07:21"
  },
  {
    "text" : "He is six foot eight, three hundred and fifty-nine pounds. How big is how big is Shaquille O'Neal? Seven foot two.",
    "timestamp" : "07:22-07:33",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "07:34-07:34",
    "speaker" : "Greg",
    "text" : "Is he?"
  },
  {
    "speaker" : "Andy",
    "text" : "He's definitely seven footer. Seven foot one. Uh how heavy is he? Come on, give me give me a stats. 7'1, 325. Trent Brown is 6'8, 359.",
    "timestamp" : "07:35-07:48"
  },
  {
    "speaker" : "Greg",
    "text" : "Dude John who is 6'3 250. Like he's fucking huge. These are some big guys.",
    "timestamp" : "07:49-07:56"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah I just looked up Trent Brown's earnings by year. With the Patriots was 1. 9 million Then the Raiders first year was fifteen and a quarter, Raiders second year was twenty-one and a half.",
    "timestamp" : "07:56-08:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "08:10-08:14",
    "text" : "And this year he's back on like. It was like 11 million."
  },
  {
    "speaker" : "Steve",
    "text" : "I don't think it's actually been detailed out yet. Yeah.",
    "timestamp" : "08:15-08:17"
  },
  {
    "speaker" : "Andy",
    "text" : "That's what I thought. Yeah. So it's a it's a big chunk less. It's less it's more than half of what he made last year in cash. And so this is kind of, I mean, Greg's not going to want to hear it, but this is the genius of of Bill Belichick where it almost feels like he and I don't know if he'll ever admit to it, but kind of like almost punted on last year as a way to Put himself in a better position to build a team this year by kind of just playing out last year without putting a lot of weapons on the field. You know, Cam was on short money and they didn't they they just like drafted a bunch of guys and just put them out there like the tight end position, for instance. Like they just put out first year guys and said All right, um, Izo, let's see what you can do. And uh you didn't do much and didn't really matter because they didn't have a lot going for them, all the opt-outs and everybody leaving and all of that. But That led to this year the team being in such a good position in a year where because of the COVID and everything. The Patriots have uh or the the league itself, the the salary cap is shrunk. So everybody has to let go of A lot of players, which floods the market, the free agent market with a bunch of um higher-end guys than maybe you're used to seeing in a in a normal year, with nobody being able to afford it because I think at the start of this year, the Saints were 60 something million dollars over the cap because of how low it was. So they've just been cutting guys left and right.",
    "timestamp" : "08:19-10:02"
  },
  {
    "timestamp" : "10:02-10:19",
    "speaker" : "Steve",
    "text" : "66. And I they did actually get some cool moves to get under. And Andy, I just thought it was right now. But I think you're right. Not I've been thinking the same thing, but What if Belichick has been planning for a post-Brady world for at least six years, right?"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "10:19-10:20"
  },
  {
    "speaker" : "Steve",
    "text" : "Well I mean he's been painting host Brady forever. It's gotta be on his mind, yeah. And this seems to be the opportunity meets that plan, right? I don't know if last year was an intentional will punt on the whole season, but it was like we're not gonna fuck up a cap. We're not gonna do any crazy cap moves. We're gonna roll as much cap space into this next offseason. Yeah, because I I think it's",
    "timestamp" : "10:20-10:41"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "10:41-10:59",
    "text" : "Yeah, last year they had a shit ton of dead money and they just decided like, well, there's not much we can do with this year. So we're not gonna go out and like try to be proactive in in trading for players or Signing any real free agents other than like long shots like Cam Newton on prove it deals."
  },
  {
    "speaker" : "Greg",
    "text" : "See, my theory is that he thought the season was gonna get canceled because of COVID. So he punts on the season being like, we're not even finishing this season. Interesting. Yeah, and being like, and I know the salary cap's coming down next year because of COVID. So I'm just considering this a watch season from the end. And it didn't really work out and they Still went seven and nine, so it's fine. They they handled it, but I think that's what you was thinking.",
    "timestamp" : "11:01-11:25"
  },
  {
    "speaker" : "Andy",
    "text" : "I th that might be some of that too. And I also think because they just announced today the um the T the T V network deals, the NFL did. That Goodell.",
    "timestamp" : "11:25-11:35"
  },
  {
    "text" : "I haven't even seen that. There's been so much shit all happening at once.",
    "timestamp" : "11:36-11:38",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "You did something like I think the NFL's getting something like $10 billion a year.",
    "timestamp" : "11:38-11:45"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "11:45-11:48",
    "text" : "Well, there's like the gambling stuff in it too, I think."
  },
  {
    "timestamp" : "11:48-12:42",
    "speaker" : "Andy",
    "text" : "Something like that. But like like Amazon is doing um they're streaming the Thursday night games and like all this this all this other stuff going on. And so the basically the amount of money coming in in I think I think it's 2023, maybe something like 2024, like when that deal kicks in, the they're saying the salary cap's gonna jump back up again. And which is basically when all of the deals that the patrons have made this free agency kind of jump because they've they've backloaded all those into that sort of timeframe. So I'm wondering if. Belichick was also having conversations with Kraft, who's really close with Goodell, you know, and is probably in all those conversations with all of the uh the the league deals going on. So maybe he had an idea of yeah, it's gonna go down this year and then in a couple of years it's gonna skyrocket back up again."
  },
  {
    "timestamp" : "12:42-12:45",
    "speaker" : "Greg",
    "text" : "I think everybody knew that though. Yeah, that was pretty common knowledge."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, even I sort of knew that. Maybe. And you can see the way they structure these contracts. Everything has like a $1 million base salary and then a bunch on the backside because they know the cost would work.",
    "timestamp" : "12:45-12:54"
  },
  {
    "timestamp" : "12:55-13:08",
    "text" : "My takeaway from all this is I have fucking no clue how NFL contracts work. Like I have uh I have no idea what hits a salary cap, what's dead money, what is fucking signing bonuses, what are they capable? I have no fucking clue.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "13:09-13:09",
    "speaker" : "Steve",
    "text" : "That's why you gotta follow."
  },
  {
    "timestamp" : "13:13-13:22",
    "speaker" : "Andy",
    "text" : "Yep. He's got like 30,000 followers now because of this. Yeah, he's a he's a great follower because he's like who who is it? Uh at Pat's Cap"
  },
  {
    "speaker" : "Greg",
    "text" : "At Pat'sCap.",
    "timestamp" : "13:22-13:23"
  },
  {
    "text" : "Yes, he's been doing it since 2000. Since we've been started back in the podcast, he was on Twitter talking about it.",
    "timestamp" : "13:23-13:28",
    "speaker" : "Steve"
  },
  {
    "text" : "Shout out at Pat's Cap.",
    "timestamp" : "13:29-13:30",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:30-13:36",
    "text" : "Does it for free. Um, but he accepts donations to his local habitat for humanity. Oh yeah."
  },
  {
    "timestamp" : "13:37-13:45",
    "speaker" : "Greg",
    "text" : "All right. I'm gonna give him a fucking signing bonus of $2 with a fucking third year option for fucking 50 cents. Yeah."
  },
  {
    "timestamp" : "13:45-13:48",
    "speaker" : "Andy",
    "text" : "But I guess the new thing now is is void years too. Yes."
  },
  {
    "speaker" : "Steve",
    "text" : "I feel like the Beatrice started that too in Tom Brady's contract. It may be automatically void and you're just spreading, you're just kicking the can. Right. Yeah.",
    "timestamp" : "13:49-13:57"
  },
  {
    "speaker" : "Andy",
    "text" : "So there's a lot of that going on this year. I think because they're trying to kick the can down the right.",
    "timestamp" : "13:57-14:01"
  },
  {
    "text" : "The can came do it for the Patriots last year. That's how they had so much dead money in their caps. Like they couldn't even sign to anybody if they'd wanted to",
    "speaker" : "Steve",
    "timestamp" : "14:01-14:08"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because Brady's dead money alone was like 20 something million. So and this year they're at the bottom.",
    "timestamp" : "14:08-14:15"
  },
  {
    "timestamp" : "14:15-14:19",
    "speaker" : "Steve",
    "text" : "Well the cat hits they have like for this year is like barely above that."
  },
  {
    "timestamp" : "14:20-14:25",
    "speaker" : "Andy",
    "text" : "Yeah for all those big guys. So is there anybody else you're excited that they signed?"
  },
  {
    "text" : "Well you wanna you wanna let's let's go by uh like position unit, right? All right. So let's start with the offensive line because there was a ton of shit that went down with the offensive line, coming's and goings, right?",
    "speaker" : "Greg",
    "timestamp" : "14:26-14:36"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "14:36-14:55",
    "text" : "That's probably the worst the the units the m the been the worst since the free agency period because we lost I don't know. I think they're in decent shape here. Yeah in bad shape but of all the units from like last year's group versus this current year's group, this is the one that probably decreased. Because he lost Tooney and Andrews."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I know, but we already spent a season without Andrews. Right.",
    "timestamp" : "14:55-14:58"
  },
  {
    "text" : "And the Patriots, uh, I saw this as well today. And Tony was awesome too. The the Patriots have never Paid a second contract for a center. Like every center that they've started has been like an undraft either an undrafted free agent or somebody they picked up in the draft late",
    "timestamp" : "15:00-15:18",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:18-15:39",
    "speaker" : "Steve",
    "text" : "Yeah, I'm not like worried about them at center or even guard. I think that like it'll be fine. Who are the guys they have? I just think last year's group a little better. Uh I don't know that I'm probably right. Tooney is one of the top cards in it. He got $80 million contract with 60 of it guarantees. Like the second most guaranteed Toonie."
  },
  {
    "text" : "I think they lost depth for sure, right? So if you they they brought in Brown, they lost Andrews and they lost Tooney, right? Yeah. So right now you're looking at the tackles are gonna be Wynne and Brown.",
    "speaker" : "Greg",
    "timestamp" : "15:40-15:54"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "15:54-15:55",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "15:55-16:25",
    "text" : "Possibly. Maybe your your guards are gonna be Unweyu and Shaq Mason. I think Unwayu And Weyu getting him in the draft is a fucking huge steal. And he can play guide or tackle, and Wynn can play guide or tackle, so you have like a lot of flexibility there. I think Karis is your only one that's kind of a question mark at center, but we've had a year with him where like he wasn't noticeably bad, so Yeah. There's not much depth beyond that, but those five that you're rolling out, you feel comfortable with them, right?"
  },
  {
    "text" : "Well the pages have also spent other draft picks. I'm trying to find the names right now. Um",
    "timestamp" : "16:26-16:30",
    "speaker" : "Andy"
  },
  {
    "text" : "Yodnik Kastile or whatever that guy.",
    "speaker" : "Greg",
    "timestamp" : "16:31-16:32"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, and there was uh there was him and there was another one too who's that guy the foreign dude that they had that video on that I loved that video and then never saw him again.",
    "timestamp" : "16:33-16:41"
  },
  {
    "timestamp" : "16:41-16:42",
    "text" : "Oh yeah, I think he's gone.",
    "speaker" : "Andy"
  },
  {
    "text" : "Uh that might have been four.",
    "timestamp" : "16:42-16:43",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "16:43-16:45",
    "speaker" : "Andy",
    "text" : "Like the Swedish guy or something, yeah."
  },
  {
    "timestamp" : "16:47-17:01",
    "speaker" : "Steve",
    "text" : "I think with a run game, I bet you know having just Trent Brown back out there is a massive. He's I remember him being pretty awesome in the run game. And then a Wenu? I said it was Oenu, but I also never heard his name. On Wenu."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "17:02-17:10",
    "text" : "I think it is what did I say? Owenu? I don't know. I think it's on on Wenu. O-N-W-E-P-N-U."
  },
  {
    "timestamp" : "17:10-17:15",
    "speaker" : "Andy",
    "text" : "Yeah. Oh, they also have uh Justin Heron as well. Yeah. As a guard."
  },
  {
    "timestamp" : "17:16-17:24",
    "speaker" : "Greg",
    "text" : "They're all kind of no names though. And then Illuminor was the other guy that played a bunch of snaps last year, right? But they're a free agent. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "He was not. Come on, dude. Yeah. So yeah, if what those guys get hurt here. We'll call it a a wash.",
    "timestamp" : "17:24-17:34"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "17:35-17:40",
    "text" : "Uh a downgrade in depth, but starting five is a wash. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "All right, what what's which uh we're gonna go the other side of the ball, DL? Yep. Um This was an area I felt like they were awful last year.",
    "timestamp" : "17:40-17:51"
  },
  {
    "timestamp" : "17:53-17:54",
    "text" : "Linebackers.",
    "speaker" : "Andy"
  },
  {
    "text" : "Let's put linebackers and defensive line together.",
    "timestamp" : "17:54-17:56",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:56-18:05",
    "text" : "Yeah, the front seven. And I think they were At the bottom of the league, especially in stopping the run. Yes, there is 26 in the NFL."
  },
  {
    "timestamp" : "18:06-18:08",
    "speaker" : "Steve",
    "text" : "It was like we were asking Terez Hall to just do way too much."
  },
  {
    "timestamp" : "18:09-18:14",
    "text" : "Yeah. Anthony Jennings. So they lost Adam Butler.",
    "speaker" : "Greg"
  },
  {
    "text" : "Nobody could set the fucking edge",
    "speaker" : "Steve",
    "timestamp" : "18:15-18:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:17-18:23",
    "text" : "Yeah, if they lost Adam Butler and uh Bo Allen technically who didn't actually fucking play."
  },
  {
    "speaker" : "Steve",
    "text" : "And you might even make a case that Adam Butler was the best of the front seven. Yeah. Last year.",
    "timestamp" : "18:23-18:27"
  },
  {
    "speaker" : "Andy",
    "text" : "And Lawrence Guy technically hasn't signed yet either, so maybe he might be gone. Hard to tell. But they've Done some things to address that defensive line. Uh they re-signed Dietrich Wise and Carl Davis, so that's good. They also signed anybody want to give this a chance? Devon God show?",
    "timestamp" : "18:28-18:52"
  },
  {
    "text" : "God Shaw. I don't know how to say it either. I'm can I'm not even want to know because I want to call him the God Show.",
    "speaker" : "Steve",
    "timestamp" : "18:52-18:59"
  },
  {
    "timestamp" : "19:00-19:01",
    "speaker" : "Greg",
    "text" : "That's not bad."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "19:01-19:05",
    "text" : "Let's just call him the God Show. I don't even I don't even care how it's actually pronounced. I'm gonna call him the God Show."
  },
  {
    "text" : "I thought you were gonna do it phonetically and say God show. The God Show baby. Welcome to the God Show.",
    "timestamp" : "19:05-19:11",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh they also signed defensive lineman Harry Henry Anderson.",
    "timestamp" : "19:13-19:16"
  },
  {
    "timestamp" : "19:17-19:19",
    "text" : "Um never heard of him.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but I always like those never heard of 'em no-name defensive end guy from the Jets because they're probably good, but they're just playing in a fucking black hole.",
    "timestamp" : "19:19-19:27"
  },
  {
    "timestamp" : "19:27-20:00",
    "text" : "And recently, uh, as of today, Montravius Adams, who from the I haven't seen this one yet. Again, I guess He was a um like a big deal in high school and was good in college, but like hasn't been able to translate that, which is something the Patriots are um are big on like those sorts of projects. So he might work out, he might not, but a lot of these guys are kind of like Big body body.",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh, Anfravius got a great name. I will really want to. I can say that a bunch. It reminds you of Barcavius Mingo.",
    "speaker" : "Steve",
    "timestamp" : "20:00-20:06"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "20:06-20:08",
    "text" : "Yes. All-time name."
  },
  {
    "timestamp" : "20:08-20:16",
    "speaker" : "Steve",
    "text" : "Yep. And his brother's names were also all-time. I forget what it was. Yeah, the whole family had great names. When there was one dude who had just a regular name, that was even better."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "20:18-20:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "20:19-20:24",
    "text" : "Well, this is the regular. Alright, I'm looking it up. Statchek."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "20:24-20:25",
    "text" : "Roger Mingo."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, something hilarious like that.",
    "timestamp" : "20:26-20:28"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, Barcavius Mingo's full name. Barcavius Lavon Kiki Mingo. Kiki. Kiki. Do you love me? Siblings, Hughtavius Mingo, Malik Mingo. Hugh Mingo. Hugh Hughavius and Hugh. They're two separate people. Yeah. Because the his parents are Hugh Mingo and Barbara Johnson. Barbara Johnson. Right. That's part of the whole thing. The fuck out of here. That's part of the whole thing.",
    "timestamp" : "20:28-21:01"
  },
  {
    "timestamp" : "21:01-21:13",
    "speaker" : "Greg",
    "text" : "Barbara Johnson. Babs just sp now you monkey bus. Abs mangums. Mark Javius. Barkey and Babs."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, that's hilarious. Well we gotta only talk about defensive line.",
    "timestamp" : "21:15-21:20"
  },
  {
    "timestamp" : "21:20-21:26",
    "speaker" : "Greg",
    "text" : "Well yeah, and then Judon, obviously we didn't mention him. That's that's a big ticket name spit ticket name."
  },
  {
    "text" : "Yeah. So let's talk about Judon because I am a I was initially all about it. And I think he's awesome and he's a great player. Exactly what the defense needs. But the other side. Like ex-Ravens linebacker front seven, terrible track record. Even like Lawrence Guy, I thought also could pop, and he's just been okay at best.",
    "timestamp" : "21:27-21:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:47-21:48",
    "text" : "Fidelius Thomas."
  },
  {
    "speaker" : "Steve",
    "text" : "He was good. For like a year. Then you got like who is the guy, uh, Rosie Colt, and now he is the Bears. The guys from the Bears, yeah.",
    "timestamp" : "21:50-21:58"
  },
  {
    "text" : "I don't know, you can't judge a player based on A sign for like 2005.",
    "timestamp" : "21:58-22:04",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I don't know, it's just like everyone who comes over from the Ravens. We've we've signed a couple and they've never actually been the wicked guide.",
    "timestamp" : "22:05-22:11"
  },
  {
    "speaker" : "Greg",
    "text" : "I think they're uh they're kind of like uh linebacker m factory too, kind of like the Steelers are with wide receivers where it's like the They always do better there than in other places.",
    "timestamp" : "22:11-22:22"
  },
  {
    "speaker" : "Steve",
    "text" : "Right.",
    "timestamp" : "22:22-22:22"
  },
  {
    "speaker" : "Greg",
    "text" : "It's true.",
    "timestamp" : "22:22-22:23"
  },
  {
    "text" : "In Baltimore, like they franchised him last year too. So he was a franchise player. So he's definitely quick. That is I think it's out of the question.",
    "timestamp" : "22:23-22:31",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "22:31-22:31",
    "speaker" : "Mom"
  },
  {
    "timestamp" : "22:31-22:40",
    "speaker" : "Steve",
    "text" : "I just wonder if like, you know, it's like uh the Red Sox signing someone with big expectations from the Rays. You know. He's a little gun shy after a couple of those."
  },
  {
    "text" : "I don't know if that's The same because it's not like he's going from a small market to a big market. Like Baltimore.",
    "timestamp" : "22:41-22:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Here on the top, 99% of me, super stuffed. I think he's like that perfect. Maybe not be the flashiest pass rusher, but setting the edge and controlling the run game and being like an all-around overall linebacker like Dante Hightower is fucking awesome.",
    "timestamp" : "22:52-23:06"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:06-23:58",
    "text" : "I think he'd be more of like a uh Mike Vrabel uh Ninkovich sort of guy. Planning that idea, right? Well, I think that's the role that they probably see for him. And especially with the way that they're drafting these these these big boys. Or not drafting, but um signing these big boys on the defensive line. Like these are some, like I think this uh Montravius Adams, he's he's a wide-body boy. Um Henry Anderson as well. He's a big guy. So I think they're kind of almost, it feels like they're gonna go back to that 3-4. Yes. Because I mean, just look how many linebackers they picked up. They got that. They've got Hightower coming back. They've got Uce and Chase Winovich as well. Who I think was one of the other only people who had more quarterback pressures than that judo."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "24:00-24:15",
    "text" : "defense setting the edge really well from these guys, he's gonna be an absolute monster next because he's got the pass rush that like Mike Vrabel had. As we're watching this 2003 season, watching Brabell like really find his group as a pass rusher. It's been awesome."
  },
  {
    "timestamp" : "24:15-24:20",
    "text" : "Yeah. And I feel like Judon is going to fit into that sort of mold as well.",
    "speaker" : "Andy"
  },
  {
    "text" : "What about Kyle Vanoy being back too? I mean, this is like everything you could possibly want. That's right, yeah. From the linebacking group. You get Dante back.",
    "timestamp" : "24:20-24:28",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, you get yeah, Dante Hightower and Kyle Van Noy in the middle, basically.",
    "timestamp" : "24:29-24:33",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "24:33-24:42",
    "speaker" : "Greg",
    "text" : "Do you think Dante Hightower is gonna come back and be the player he was? I have serious concerns. I don't know. He looked pretty bad his last year."
  },
  {
    "text" : "No, he didn't.",
    "timestamp" : "24:42-24:43",
    "speaker" : "Steve"
  },
  {
    "text" : "In coverage. I remember thinking about the coverage. Yeah, yeah. I don't know, dude. I'm concerned about linebackers. I don't know. Uche didn't Uce didn't pop for me last year either. And Winovich was getting benched halfway through the year. I'm concerned about linebackers.",
    "speaker" : "Greg",
    "timestamp" : "24:43-25:05"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "25:06-25:10",
    "text" : "I am actually the opposite. I think linebackers are going to be the strength of the defense next year."
  },
  {
    "speaker" : "Andy",
    "text" : "No, the safeties are going to be the strength of defense this year. That's what I think. This safety group is No no no.",
    "timestamp" : "25:11-25:18"
  },
  {
    "text" : "Let's not leave this because I think me and Greg are on very opposite sides of this.",
    "timestamp" : "25:18-25:21",
    "speaker" : "Steve"
  },
  {
    "text" : "I think we are. Yeah. I think you're rating Hightower too too much. He's What about slower? And in the modern NFL, like that's not what you need is like a run-stuffing linebacker.",
    "timestamp" : "25:22-25:34",
    "speaker" : "Greg"
  },
  {
    "text" : "What about Jawan Bentley? I think you do though.",
    "speaker" : "Andy",
    "timestamp" : "25:34-25:36"
  },
  {
    "text" : "No, you can't do that.",
    "timestamp" : "25:40-25:40",
    "speaker" : "Greg"
  },
  {
    "text" : "I think that's a that's uh terrible. He's like a playmaker all over the like he's uh steps up in huge moments, he's a leader of the defense, he's like the heart and soul, he makes all the big plays. And yeah, he's a run stuffer and we fucking sucked against the run. If we can stop the run with the linebackers, they have to throw it. Now you have you're going right into the teeth of our strength, which is the secondary. Because I, you know, the secondary has always been for the last couple of years fucking awesome. And I don't think it's gonna get any worse.",
    "speaker" : "Steve",
    "timestamp" : "25:43-26:10"
  },
  {
    "text" : "Also, who's gonna who's gonna rush the passer? Winovich is the only one on the on the entire defense that I feel comfortable saying. Pass rush numbers. He's not a big sack guy though, right?",
    "timestamp" : "26:11-26:23",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but he's still got great numbers on rush past rush. He just wasn't he was asked to do everything.",
    "timestamp" : "26:23-26:27"
  },
  {
    "text" : "He's asked to cover the thirty four and a half sacks since twenty sixteen. So for a linebacker's not bad. Yeah, it's okay. Yeah. But beyond that you don't have that typical pass rushing defensive end, I guess. But if you're playing if you're playing that 3-4 That's kind of where those linebackers fit in.",
    "timestamp" : "26:27-26:45",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "26:46-26:57",
    "speaker" : "Greg",
    "text" : "Yeah, and there's no one that really looks like they're like a jet after guy. I mean Winovich, yeah, but I mean there was really some issues with Uce. Didn't didn't do anything for me last year."
  },
  {
    "text" : "I thought he was good coming off the edge.",
    "timestamp" : "26:57-26:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:00-27:03",
    "text" : "His closing speed was crazy. I don't know. Oh yeah",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "And also he was they were both rookies uh coming up. Yeah, with",
    "timestamp" : "27:04-27:10"
  },
  {
    "timestamp" : "27:13-27:18",
    "speaker" : "Greg",
    "text" : "Yeah, Chase Winovich, I have high hopes for expectations for the rest of them."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "27:19-27:33",
    "text" : "Greg, you know who should be your favorite person in the front seven? Beatrich wise. Why? Because apparently he's a big locker room guy, and that was like your role in the UNH soccer team. You're a glue guy."
  },
  {
    "speaker" : "Greg",
    "text" : "I was a locker room guy, not a fan favorite, dude.",
    "timestamp" : "27:35-27:37"
  },
  {
    "speaker" : "Andy",
    "text" : "You should just appreciate it. To be fair, there weren't any fans at your game, so yeah. Yeah. There are no fan favorites.",
    "timestamp" : "27:40-27:45"
  },
  {
    "text" : "Mom was there every game. That's right.",
    "timestamp" : "27:45-27:47",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "27:47-27:49",
    "text" : "So maybe you were the fan favorite.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, there you go, Greg. No other fans there besides mom. Boom. That means he's a fan favorite. Why do we resign Wise?",
    "speaker" : "Steve",
    "timestamp" : "27:49-27:57"
  },
  {
    "speaker" : "Greg",
    "text" : "He hasn't done anything in five years.",
    "timestamp" : "27:57-27:59"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "28:00-28:03",
    "text" : "Yep. Because he's a big locker room guy, apparently. Everyone loves Wise."
  },
  {
    "speaker" : "Greg",
    "text" : "Yes. I mean I like him too.",
    "timestamp" : "28:03-28:05"
  },
  {
    "timestamp" : "28:06-28:17",
    "text" : "Yeah, I don't I don't dislike him. I think he may have more potential. I don't know if he's reached it yet, but he certainly is taking his goddamn time getting there. All right. I'm good on the front seven. I've said my piece.",
    "speaker" : "Steve"
  },
  {
    "text" : "All right. Secondary. Secondary. Who the hell knows? See Leda Gilmore, probably. Doesn't seem like everyone has said that.",
    "timestamp" : "28:17-28:27",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "28:27-28:34",
    "speaker" : "Andy",
    "text" : "Like it's an absolute certainty. But people are saying like the fact that it hasn't happened yet, it seems like people are cooling on that idea."
  },
  {
    "timestamp" : "28:34-28:34",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "28:35-28:46",
    "text" : "Well you gotta look at the salary cap numbers because if they take uh if they cut 'em, then they have dead cap money of 13 million compared to restricted free agency in 2026."
  },
  {
    "timestamp" : "28:46-28:49",
    "speaker" : "Steve",
    "text" : "And no, if they trade them, I have no fucking clue."
  },
  {
    "timestamp" : "28:50-28:52",
    "speaker" : "Greg",
    "text" : "I have no clue what happens if they cut over trade them. No clue."
  },
  {
    "speaker" : "Steve",
    "text" : "If they trade them, they get plus six million in Caprium or something like that.",
    "timestamp" : "28:52-28:56"
  },
  {
    "text" : "They yeah, but it's still like eight million in dead money or something.",
    "timestamp" : "28:57-28:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "28:59-29:12",
    "text" : "Yeah, but what is dead money regardless, they could they could create more cap room and they do. So if you I would say if you traded them for another player as much. Right. You could kind of use that like a NBA uses a trade, you know, an exception.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "29:12-29:29",
    "text" : "As a fan, I'm not as concerned about losing Gilmore as people might think, right? Yeah. I think they're pretty stacked. I think there's even people getting buried in that depth chart that are could play. If they stand up. Yeah. He's the guy that like I thought, wow, he played well when he got in there.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I see. I didn't look at it.",
    "timestamp" : "29:29-29:30"
  },
  {
    "text" : "You just can't get in. Jonathan Jones had a hell of a year. JC Jackson, I think, could be a fucking pro bowler. Yeah.",
    "timestamp" : "29:30-29:37",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:37-29:40",
    "text" : "Yeah, Jackson's gonna get paid next year."
  },
  {
    "text" : "Yeah, Jackson, they put a second round tender on him. Yeah. Tends restricted. Free agent.",
    "speaker" : "Andy",
    "timestamp" : "29:40-29:46"
  },
  {
    "text" : "Second round tenda. Someone's him on the on the chicky tender. Chicky tendas. We get their second round pick.",
    "speaker" : "Steve",
    "timestamp" : "29:46-29:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh we get their French fries if we don't match their offering.",
    "timestamp" : "29:56-29:59"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:59-30:07",
    "text" : "Right, right. They which I saw someone ask on Twitter Are poison pills still allowed?"
  },
  {
    "timestamp" : "30:07-30:09",
    "speaker" : "Andy",
    "text" : "They are not. Yes."
  },
  {
    "text" : "We know to know all about that.",
    "speaker" : "Steve",
    "timestamp" : "30:09-30:12"
  },
  {
    "text" : "Yes, Steve.",
    "timestamp" : "30:12-30:13",
    "speaker" : "Andy"
  },
  {
    "text" : "Tell us all about that. The Curtis Martin contract back in the early 2000s was why they oh I don't even want to go down that road again. I don't want to relive that. No, that was I used to hate Curtis Martin because I thought he left us, but",
    "speaker" : "Steve",
    "timestamp" : "30:13-30:27"
  },
  {
    "speaker" : "Andy",
    "text" : "That's why they research and I love them. Poison pills.",
    "timestamp" : "30:28-30:31"
  },
  {
    "timestamp" : "30:31-30:33",
    "speaker" : "Steve",
    "text" : "Poison pills. Well that's when they got rid of it, right?"
  },
  {
    "text" : "Wasn't it because Kraft got pissed about it? Yeah.",
    "timestamp" : "30:33-30:36",
    "speaker" : "Greg"
  },
  {
    "text" : "Mm-hmm. So safeties? I feel like we're that's probably we have the the deepest uh safety group in the league.",
    "speaker" : "Andy",
    "timestamp" : "30:36-30:47"
  },
  {
    "text" : "Yeah. Safeties are getting paid more and more too. They're actually making a fair bit of money. Like their contract values have been going up fast.",
    "timestamp" : "30:47-30:53",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "30:53-31:00",
    "speaker" : "Andy",
    "text" : "I mean league. Pat Chung just retired, Patrick Chung. Today. Today? Today. Yeah. Amazing."
  },
  {
    "text" : "You see that stat of going to the playoffs 11 straight seasons? It's ridiculous. To start his career. Yeah.",
    "timestamp" : "31:01-31:07",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "31:08-31:17",
    "text" : "Um but you still have Devin McCordy, Adrian Phillips. Adrian Phillips um was like the only free agent signing from last year, basically, right?",
    "speaker" : "Andy"
  },
  {
    "text" : "I looked them up. I looked up all the pages, 2020 free agents. Do you want to hear them?",
    "timestamp" : "31:17-31:21",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:21-31:22",
    "text" : "Yeah. Yeah."
  },
  {
    "timestamp" : "31:25-31:28",
    "text" : "Cody Davis, who we resigned again this year. Yep. Brian Hoyer.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Special teams guy.",
    "timestamp" : "31:29-31:30"
  },
  {
    "text" : "Brandon Copeland. Dan Vital, Adrian Phillips. Two-year deal. Yep. Um Bo Allen didn't play a snap. Nope. Damere Bird. That's it.",
    "timestamp" : "31:30-31:43",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Cam Newton.",
    "timestamp" : "31:43-31:44"
  },
  {
    "speaker" : "Steve",
    "text" : "That's like a Targetin Central.",
    "timestamp" : "31:44-31:47"
  },
  {
    "text" : "Right, that's what I mean.",
    "speaker" : "Andy",
    "timestamp" : "31:47-31:48"
  },
  {
    "timestamp" : "31:48-32:19",
    "text" : "Uh they re-signed Butler. It looks like a one-year Calhoun. Illuminor, Tooney on franchise, DMAC resigned last year, so did Slater. Yeah. And Jason McCarty. Phil Dorset left and he just went somewhere else as well, so he went one year. Nate Ebner left to the Giants. I think he's a freedom. Not sure. Lyndon Roberts still with the Dolphins. Ted Garris. Back. Back.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. I like I love the the uh Kyle Van Noy because They let him walk to the Dolphins, got a fourth round pick this for this draft, and then he's back. So they they basically Lost Kem Kyle Van Noy and then got him back plus the pick from the Dolphins.",
    "timestamp" : "32:20-32:38",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "32:39-32:47",
    "speaker" : "Steve",
    "text" : "And here's the picked up his earnings, just like Trent Brown's while I was in there. The first year of the Patriots was 4. 6."
  },
  {
    "timestamp" : "32:47-32:48",
    "speaker" : "Andy",
    "text" : "Yep."
  },
  {
    "timestamp" : "32:48-32:56",
    "speaker" : "Steve",
    "text" : "Then two and a half, then five. First year of the Dolphins was 15 million. Yeah. And next year he's down."
  },
  {
    "speaker" : "Andy",
    "text" : "But he signed like a five year fifty million dollar contract with him, right? And they basically cut him after one year.",
    "timestamp" : "32:56-33:02"
  },
  {
    "text" : "Ridiculous.",
    "speaker" : "Steve",
    "timestamp" : "33:03-33:04"
  },
  {
    "speaker" : "Andy",
    "text" : "Which is fuck that the NFL for you.",
    "timestamp" : "33:04-33:05"
  },
  {
    "text" : "6. 8 this coming year at the Patriots. So he's yeah, he's actually uh 43 million bucks.",
    "speaker" : "Steve",
    "timestamp" : "33:06-33:12"
  },
  {
    "timestamp" : "33:12-33:14",
    "text" : "Yeah. It's not bad.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "33:15-33:18",
    "speaker" : "Steve",
    "text" : "The Lions paid him two and a half million too."
  },
  {
    "timestamp" : "33:18-33:58",
    "speaker" : "Andy",
    "text" : "Oh right, yeah. Oh, that's right. You started with the Lions, didn't they? Um yeah, so these defensive backs, um, you also have Jalen Mills, who's another big uh offseason signing this year. Um spent five years with the Eagles and he's kind of the guy that played everywhere. Uh oh it felt it feels a bit like a um a Devin McCourty where Started at cornerback but wasn't like the greatest cornerback. But they've kind of like shifted him around to safety. He's played a little bit of linebacker. He went to the Pro Bowl as a cornerback. In his first year, and then what do you do in his second year? Oh yeah, yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Then he's struggled. But like he was awesome as a cornerback. Don't put all that. You know, he just just we just found out he was better at safety. Sure, we'll go with that. Yeah. Uh which he has, he's awesome. Yeah. But he sucks too, Greg, just because he's old and he's just not gonna be nearly the player that he was. He's the same type of player as High Tower. You can say that about High, you gotta say it about D-Mac.",
    "timestamp" : "33:59-34:20"
  },
  {
    "speaker" : "Greg",
    "text" : "I think it's easier to get exposed in high tower's position than it is uh McCourty's. Free safety? I don't know.",
    "timestamp" : "34:21-34:28"
  },
  {
    "text" : "Yeah, free safety is how you get beat deep and like take it one wrong step and you're done. Uh McCourty as an I",
    "timestamp" : "34:28-34:35",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I'm basing this off of I there was like three or four occasions in High Towers last season he played where I was like, wow, he looks really slow.",
    "timestamp" : "34:35-34:45"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "34:45-34:46"
  },
  {
    "speaker" : "Greg",
    "text" : "In coverage. And I I and I've I haven't said that about McCourty. I mean maybe I'm not a fucking X's and O's guy. I'm not watching tape, but just from the eye test.",
    "timestamp" : "34:46-34:55"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "34:55-35:02",
    "text" : "I think McCourty's still got the speed, which covers a lot of um Maybe a lot of that sort of stuff. Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "35:05-35:10",
    "text" : "Guess we'll find out. But he's getting there too. I mean, I don't know how many how many years he's got left in him. That's true."
  },
  {
    "speaker" : "Steve",
    "text" : "He's equally but like the other aspects he brings off the you know pure speed or athleticism, whatever on the keeping the defense in line. Imagine if he adopted out as well how much how shit our defense would have been last year. Oh, yeah. Because at least we weren't like blowing assignments like left and right.",
    "timestamp" : "35:11-35:26"
  },
  {
    "text" : "It's true. It's true.",
    "timestamp" : "35:26-35:27",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:27-35:33",
    "speaker" : "Steve",
    "text" : "And I think Hightower and McCourty bring a ton of like leadership and that sort of side to the defense."
  },
  {
    "timestamp" : "35:33-35:34",
    "text" : "Yep.",
    "speaker" : "Andy"
  },
  {
    "text" : "Especially trying to integrate all these new guys into, right?",
    "timestamp" : "35:34-35:37",
    "speaker" : "Steve"
  },
  {
    "text" : "Right.",
    "timestamp" : "35:37-35:38",
    "speaker" : "Andy"
  },
  {
    "text" : "Isn't there isn't there more in the secondary that's new?",
    "timestamp" : "35:38-35:41",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "35:41-36:33",
    "speaker" : "Andy",
    "text" : "Kyle Duggar. Kyle Duggar, yeah. Second year guy who was I think one of the bright spots on defense last year. I think he's gonna be a big thing. I it wouldn't surprise me uh because it almost feels like a lot of these positions are kind of blending together too. Like linebackers are getting a bit lighter and faster. Yeah. Um, safeties are getting bigger and guys that can play in the box but also cover a tight end. Right. So I wouldn't be surprised if you see like Maybe three safeties on the field in some situations in instead of like a linebacker, you know? So you take off Like uh Hightower and put on Kyle Duggar, Adrian Phillips, and and uh Jalen Mills. So you have technically like three safeties on the field instead of uh three line three or four linebackers, you know?"
  },
  {
    "text" : "Yeah. You know who's a great comp? Teddy Brusky for Hightower because Teddy was not great in coverage either, especially towards his backside of his career.",
    "timestamp" : "36:33-36:41",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "36:41-36:45",
    "text" : "Bro, Teddy Bruski, every every pick he got was a pick six. TD Bruski.",
    "speaker" : "Andy"
  },
  {
    "text" : "We're in the middle of his.",
    "speaker" : "Steve",
    "timestamp" : "36:46-36:46"
  },
  {
    "text" : "Yeah. And we're in the middle of that right now. So I can't believe you're talking shit about him. How dare you?",
    "timestamp" : "36:50-36:54",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:54-37:07",
    "speaker" : "Steve",
    "text" : "I'm not talking shit. I'm just saying that I love high tower. He's awesome. So is Teddy. I'm just saying. In like later in his career, I've just passed him down. They're subbing him out for a coverage person. And you do you got the great point of you can use a safety in that role."
  },
  {
    "timestamp" : "37:07-37:29",
    "speaker" : "Andy",
    "text" : "Yeah. Right. Especially as offenses get lighter as well. I mean you you don't see that two tight ends, which except for the Patriots of course, which they're gonna go back to it seems like Um, but yeah, everybody's doing spread offenses with RPOs and all this stuff, and so you're gonna have just smaller guys on the field, and so to counter that I think I mean you almost saw it a little bit last year too, Paige's play."
  },
  {
    "speaker" : "Steve",
    "text" : "This is my other theory that I did have before this call.",
    "timestamp" : "37:30-37:32"
  },
  {
    "text" : "Oh boy.",
    "timestamp" : "37:33-37:34",
    "speaker" : "Andy"
  },
  {
    "text" : "And I've got this for a while.",
    "timestamp" : "37:35-37:36",
    "speaker" : "Steve"
  },
  {
    "text" : "Oh boy.",
    "timestamp" : "37:37-37:37",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:39-37:46",
    "text" : "Including last year. Oh boy. And Bellcheck's all about zigging when the on when the NFL is zagging."
  },
  {
    "timestamp" : "37:46-37:46",
    "speaker" : "Greg",
    "text" : "Yep."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:47-38:24",
    "text" : "And to go back to what we're seeing in 2003 with like real run heavy clock control defense first. being bigger than the other person and overpowering physically when everybody's going to a spread offense super light approach, right? Yeah. So if he attacks all the defense that will be real light and used to covering spread offenses every day with a really aggressive run game. And I think the Ravens are doing the same sort of thing with success. Then he's going to have like an unstoppable clock control offense. And then the other side of that is build an awesome, awesome defense. Which we've had for a little bit now."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:25-38:40",
    "text" : "Yeah, I don't I don't think you're I don't think you're wrong. I think I think Belichick has often gravitated towards the two tight ends. Um because it was Graham and Watson first, right?"
  },
  {
    "timestamp" : "38:40-38:41",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Um kind of in the time frame we're doing now.",
    "timestamp" : "38:41-38:43"
  },
  {
    "timestamp" : "38:43-38:45",
    "speaker" : "Steve",
    "text" : "Watson's 2004, I think."
  },
  {
    "timestamp" : "38:46-38:56",
    "text" : "So Watson, yeah, I think Watson, exactly. Um and then obviously Gronk and Hernandez. And now you have Hunter Henry and John Smith.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "38:57-39:20",
    "text" : "And the only reason that was available, I think, is because the cap was so low and no one else could give money tight ends a crazy money offer. Right. And so we could give two crazy money offers like Yeah. Henry probably was like would never have signed if John who hadn't signed. I don't know if that's true. Because he'd said like a great quarterback and like Kim is not it. Let's be real. The quarterback situation of the Patriots is unsettled."
  },
  {
    "timestamp" : "39:20-39:24",
    "text" : "It's true, but I think uh money money solves a lot of those issues, you know?",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, yeah. Money. I don't think they I think people put more stock into that than you'd think.",
    "timestamp" : "39:25-39:30",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "39:33-39:33",
    "text" : "Yeah."
  },
  {
    "text" : "I think Johnu John's got the higher upside. Yeah, Hunter Henry's like a he's got injury questions and",
    "speaker" : "Andy",
    "timestamp" : "39:35-39:41"
  },
  {
    "speaker" : "Steve",
    "text" : "But like it but I think the the cap being so low prevented somebody else from paying 100 Henry just like John and more You know? So he was left with like no one else is gonna give me more than him. I'm gonna go to the same team I he just already on. We're both gonna be awesome together. You know? Who knows what they're gonna do at quarterback though Yeah. He would never have gone there if it's just him. If someone else had paid John to a ton of money and we were like, hey, we'll pay you two. He'd be like, eh, you know. Maybe I go play in Tampa.",
    "timestamp" : "39:41-40:09"
  },
  {
    "text" : "I don't know. I don't know about that.",
    "speaker" : "Greg",
    "timestamp" : "40:09-40:11"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:11-40:15",
    "text" : "They go play in Tampa for one year and see what the cap is like next year, you know? I'm with Greg."
  },
  {
    "text" : "I think I think that's a little overrated. I I think it depends on the uh if it's uh like a Rodney Harrison type of guy who's doing it for the respect. Maybe. Yeah. But like uh tail end of his career. But if if you're kind of like in your prime, you make that money. You you want to go get that back",
    "timestamp" : "40:15-40:30",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "And they gave him a decent time commitment too, right? Where I think that plays and a decent signing bonus. Like those are these players are like, okay, I have like I have minimal opportunities to capitalize on a free agency. So l how much money can I get right now is the most important thing for like People talk about competitive this and that. Like I want to set I want to be have money for my family. You know, like yeah, those are the kind of things that are highest priority for these players. It's not it's not who's my quarterback and you know, what is the five year plan look like of the program? It's I want to get I want to get paid because this is my one chance in my NFL career.",
    "timestamp" : "40:30-41:06"
  },
  {
    "text" : "There's so many factors in it. And that's I know, but I I would venture to guess more people than more.",
    "speaker" : "Steve",
    "timestamp" : "41:09-41:13"
  },
  {
    "speaker" : "Greg",
    "text" : "I think that's the biggest facture though. I would venture to guess that.",
    "timestamp" : "41:13-41:15"
  },
  {
    "timestamp" : "41:15-41:18",
    "speaker" : "Steve",
    "text" : "Tom Brady didn't do that. That's the whole everyone always talks about it."
  },
  {
    "text" : "Yeah, but Tom Brady is such a fucking unique situation because he's not gonna get cut. They can cut everybody else whenever they want.",
    "timestamp" : "41:18-41:26",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "41:26-41:27",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "Like big name quarterbacks, like that's why Mahomes got that weird contract is because he's basically uncuttable. You know, all the rest of the players in the NFL, you tear an ACL, you're out for a year. See you later. All those back end years are failing.",
    "speaker" : "Greg",
    "timestamp" : "41:27-41:41"
  },
  {
    "timestamp" : "41:41-41:53",
    "speaker" : "Steve",
    "text" : "So it's all about the lack of guaranteed money is fully guaranteed contracts in the NFL would be an absolute Crazy talent situation on that thing."
  },
  {
    "timestamp" : "41:54-42:00",
    "speaker" : "Greg",
    "text" : "Oh yeah. Yeah. It really would. In the vi in the sport that's the most violent. Yeah. That has the shortest life. Yeah."
  },
  {
    "timestamp" : "42:00-42:03",
    "text" : "Yeah. How are they not guaranteed their money? Right.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, compared to a baseball or basketball where guys play forever.",
    "speaker" : "Andy",
    "timestamp" : "42:04-42:07"
  },
  {
    "speaker" : "Steve",
    "text" : "We're making even more money.",
    "timestamp" : "42:07-42:08"
  },
  {
    "timestamp" : "42:08-42:09",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "timestamp" : "42:09-42:16",
    "speaker" : "Steve",
    "text" : "Fully guaranteed. Yeah. And like if I sign a contract with a gummy, they're gonna be gonna pay you this money and then they're like, mm, actually you got real fucked up. Never mind."
  },
  {
    "text" : "Yeah. But and why can't the player just be like, I don't like this team anymore? I'm quitting. Like why can't they do that? You can you can quit me, but I can't quit you. That doesn't seem fair.",
    "speaker" : "Greg",
    "timestamp" : "42:17-42:27"
  },
  {
    "timestamp" : "42:31-42:34",
    "speaker" : "Andy",
    "text" : "Well, I mean we'll we'll see if if you actually can quit a team."
  },
  {
    "speaker" : "Greg",
    "text" : "Ah, you signed the contract. It's like so did you, bitch.",
    "timestamp" : "42:35-42:38"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "42:40-42:43",
    "text" : "It's a right to work state, baby. I can just fucking leave."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "42:43-42:44",
    "text" : "Yeah."
  },
  {
    "timestamp" : "42:44-42:52",
    "text" : "Yeah. But uh yeah, I think we'll see uh what happens with the Texans. Um And Deshaun Watson, we'll see if you can.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I've not got a quarterback yet, Andy. I'm not ready for quarterbacks. I don't care.",
    "timestamp" : "42:53-42:57"
  },
  {
    "timestamp" : "42:58-43:04",
    "speaker" : "Greg",
    "text" : "There's the uh let's talk weapons. Offensive weapons. Weapons. Weapons."
  },
  {
    "text" : "Uh well the Page haven't done anything really uh in the backfield, but they signed two wide receivers.",
    "timestamp" : "43:06-43:13",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "But they might lose James White. That's seeming like more and more of a possibility, right?",
    "timestamp" : "43:14-43:18"
  },
  {
    "timestamp" : "43:18-43:26",
    "speaker" : "Steve",
    "text" : "Yeah. Maybe. Yep. I don't think David Andrews or James White is officially gone, but they seem to be assumed gone. Same as Steph for some reason."
  },
  {
    "text" : "Uh I think Andrew signed somewhere today, didn't he?",
    "speaker" : "Andy",
    "timestamp" : "43:26-43:29"
  },
  {
    "timestamp" : "43:30-43:41",
    "text" : "I thought so. Well at least he said he was exploring free agency. He's like I've they looked at deals from New England and he decided he was gonna go to free agency, which almost means He's definitely gone.",
    "speaker" : "Greg"
  },
  {
    "text" : "Not definitely. Yeah.",
    "timestamp" : "43:41-43:45",
    "speaker" : "Steve"
  },
  {
    "text" : "No, you're But then they signed Ted Karas later that day and it's like, okay.",
    "speaker" : "Greg",
    "timestamp" : "43:45-43:48"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, Karis's money is is small, you know?",
    "timestamp" : "43:48-43:51"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. That's a one-year deal too.",
    "timestamp" : "43:51-43:53"
  },
  {
    "timestamp" : "43:53-44:07",
    "speaker" : "Steve",
    "text" : "Yeah, have him as a backup. He's instantly better than the other guys you have as a backup. Jakob Johnson. Yeah. Got tendied. Yeah. Tenda. What level did he get tended tendied at? I have no idea."
  },
  {
    "speaker" : "Andy",
    "text" : "Uh I don't think it was like a You've an exclusive free agent tendered. I don't know.",
    "timestamp" : "44:07-44:11"
  },
  {
    "text" : "Apparently guys who come to you from fucking Germany. Yeah. Anyone that comes from NFL Europe is exclusive rights free agent. But didn't the pages have a butt. You have their exclusive rights, so they can't negotiate with anybody, but they are a free agent.",
    "speaker" : "Steve",
    "timestamp" : "44:17-44:28"
  },
  {
    "speaker" : "Andy",
    "text" : "But they signed a fullback last year, didn't they? Uh Danny Vitali. They let him go. Did they?",
    "timestamp" : "44:28-44:34"
  },
  {
    "text" : "Yep. He's gone.",
    "speaker" : "Steve",
    "timestamp" : "44:34-44:36"
  },
  {
    "speaker" : "Greg",
    "text" : "He gone.",
    "timestamp" : "44:36-44:37"
  },
  {
    "text" : "I mean Jakob was good last year.",
    "timestamp" : "44:38-44:40",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "44:41-44:41"
  },
  {
    "speaker" : "Steve",
    "text" : "But I think what they're real playing at fullback is Dalton Keene.",
    "timestamp" : "44:41-44:44"
  },
  {
    "speaker" : "Greg",
    "text" : "Interesting.",
    "timestamp" : "44:44-44:44"
  },
  {
    "timestamp" : "44:45-44:48",
    "speaker" : "Steve",
    "text" : "Let's go back to the tight ends a bit because here I have another theory that I've thought of."
  },
  {
    "speaker" : "Greg",
    "text" : "Okay.",
    "timestamp" : "44:48-44:49"
  },
  {
    "text" : "The four tight end offense.",
    "timestamp" : "44:49-44:51",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh fuck yeah. Now you're talking my language.",
    "timestamp" : "44:51-44:56"
  },
  {
    "timestamp" : "44:56-45:39",
    "speaker" : "Steve",
    "text" : "We have the offensive line who's already massive. You're all the three tight ends, Asi Asi, and the two guys you signed. And then at fullback, you have Dalton Keane. And then Cam at running back and Cam at running back? Yeah, or the Cam at quarterback and then you know Sony or Damian Harris at a running back. Assuming both those guys are catching, then we're what advantage does that give you? Well you can tighten it up and just pound it. Or you can spread it out entirely and just throw it. Remember when uh Houston was playing goal line defense against us in the middle of the field? I think uh Imagine if you took that and said, okay, we're gonna spread everybody out and these guys who are now blocking are playing YPC."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "45:39-45:54",
    "text" : "Yeah, but I think he Like the the difference is you have to have tight ends that are like matchup problems. Like the if that was the case, they would have just ran it last year with four like two tight ends. But You need players that can like beat linebackers in coverage."
  },
  {
    "text" : "Well you have that now, don't you? Yeah, that's what I'm saying.",
    "timestamp" : "45:55-45:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "That's what I'm saying. Now they do, but but to get four in there it doesn't make any difference.",
    "timestamp" : "45:57-46:00"
  },
  {
    "text" : "Like if two were you could have uh if if both the tight ends are drafted last year. grow a ton, which generally on tight ends they say your first year always sucks and look at everybody's stats.",
    "timestamp" : "46:00-46:09",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "46:09-46:10"
  },
  {
    "speaker" : "Steve",
    "text" : "Rookie tight ends always blow.",
    "timestamp" : "46:10-46:11"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "46:12-46:12"
  },
  {
    "timestamp" : "46:12-46:26",
    "text" : "Second year is when they make their big moves. And so If you get both those guys out there who can also beat linebackers in coverage, then you can go from a full-on full run forward tight end package goal line to a spread offense.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Well they yeah, I mean I have heard it floated. It's not a spread offense if you have four tight.",
    "timestamp" : "46:26-46:30"
  },
  {
    "timestamp" : "46:31-46:48",
    "text" : "I've heard it floated that Dalton Keene is more of like a like a halfback sort of thing, like a like a you line him up in fullback We can split them wide, whereas Devin Asiasi is more of like the actual on-the-line tight end. So I see tuna.",
    "speaker" : "Andy"
  },
  {
    "text" : "You you're picking up my four tight end offense, right?",
    "timestamp" : "46:49-46:51",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, okay. Uh five if you count Cam. And Cam can run it as well. Now you can tight end option even better. Who's the uh who's the backup in in uh Las Vegas?",
    "speaker" : "Andy",
    "timestamp" : "46:51-47:07"
  },
  {
    "text" : "The Raiders uh Darren Mariota.",
    "timestamp" : "47:07-47:09",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "47:10-47:11",
    "speaker" : "Andy",
    "text" : "Mariota. So you"
  },
  {
    "text" : "Wait for the Raiders. Navi says is the future of the Raiders, if I remember correctly.",
    "speaker" : "Steve",
    "timestamp" : "47:11-47:15"
  },
  {
    "text" : "Yes. So you wait for the Raiders to fuck that up and release him. You sign him, you run a two-quarterback offense, four tight ends.",
    "timestamp" : "47:16-47:23",
    "speaker" : "Andy"
  },
  {
    "text" : "Ooh.",
    "timestamp" : "47:24-47:24",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "And then I don't think you need anybody else on the three.",
    "timestamp" : "47:25-47:27"
  },
  {
    "timestamp" : "47:27-47:34",
    "speaker" : "Steve",
    "text" : "Harris and Sonny Michelle with or yeah, you're replacing one of those two with a quarterback. Yeah. Who's taking the snap?"
  },
  {
    "text" : "Uh either one, that's the thing. It's a surprise, bitches. And then you can do the RPO, but to the other quarterback who can then throw the ball. Yes. Or run it because they're both.",
    "timestamp" : "47:35-47:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "47:46-47:47",
    "text" : "Cam actually had good hands last year too."
  },
  {
    "text" : "That's what I'm saying. Yeah. Split Cam wide. Yeah. Uh I'm pretty sure Mariota's had some uh reception in his in his career.",
    "timestamp" : "47:47-47:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:56-47:58",
    "text" : "Wow, and you're really onto something here.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Let's see, Marcus Mariota.",
    "timestamp" : "47:59-48:01"
  },
  {
    "timestamp" : "48:01-48:13",
    "text" : "The two quarterback four tight end offense. Oh my god, it's like going back to the original Days of football, right? Isn't that like flying offense or some shit like a fixed wing or whatever it is?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "48:13-48:23",
    "speaker" : "Andy",
    "text" : "Yo, uh Mariota is averaging 31 yards per reception. How many receptions? Well, two."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "48:24-48:24"
  },
  {
    "timestamp" : "48:26-49:25",
    "speaker" : "Andy",
    "text" : "On three targets. So that's like 66% catch rate. That's not too bad. What is uh longest of 41? Uh great question. I mean Cam Newton's gotta be up there, right? I don't know. I can't remember a ton of them and uh Cam Newton um Rushing and receiving, he has three catches on four targets, averaging 22. 7 yards per catch. It's not too bad. And and uh three touchdowns. God damn. All right. He had two touchdown catches last year. Yeah. Right. Yeah, he did, didn't he? He caught two and threw eight. And one in his rookie season at Carolina. Andy, you're on to something here. This is what I'm saying. So we have So I mean so you have the you have your five offensive linemen, right? And then what we say four tight ends, so that's nine, and then two quarterbacks, that's eleven. That's all you need. What what other weapons do you need on an offense?"
  },
  {
    "text" : "That would legit be really hard to defend because who do you put out there to defend that? You put in like a ton of linebackers, I guess? That's the only part. You can put a ton of linebacker and how you do you have enough linebackers on your team? Do you run the ball between the tackles of Cam over and over again? You could. I guess. So do you really want to get hurt? But I guess we're paying five million bucks, right?",
    "speaker" : "Steve",
    "timestamp" : "49:25-49:43"
  },
  {
    "speaker" : "Andy",
    "text" : "Or I mean you don't even have to worry because you can you can split Mariota out wide, throw to him on a wide receiver screen, and then he could do a throwback to one of the tight ends.",
    "timestamp" : "49:44-49:51"
  },
  {
    "timestamp" : "49:51-49:59",
    "text" : "I mean you can do all sorts of crazy trick plays with like a running back in that same, you know.",
    "speaker" : "Steve"
  },
  {
    "text" : "I got an idea. What about a phone that you can smell through? While we're talking about stupid fucking ideas.",
    "timestamp" : "49:59-50:09",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Hey, poke it poke any hole in that. Poke one hole in my idea.",
    "timestamp" : "50:10-50:14"
  },
  {
    "timestamp" : "50:14-50:20",
    "text" : "I dare you. I want to hear this. No one's done it before, which means it's not a good idea.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I'm telling you, Belchecks. That's what they said to Henry Ford too. They're like, oh no, just make a faster horse. Yeah, how'd that work out?",
    "timestamp" : "50:20-50:26"
  },
  {
    "timestamp" : "50:28-50:30",
    "text" : "And if anyone's Henry Ford of the actual.",
    "speaker" : "Steve"
  },
  {
    "text" : "Henry Ford, he says. Henry Ford. That proves your point. You're right. You know what? I hadn't considered Henry Ford's horse versus vehicle. That's right. Theory, Andy.",
    "speaker" : "Greg",
    "timestamp" : "50:30-50:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:45-50:49",
    "text" : "Glad you're coming around. Really coming around."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "50:49-50:53",
    "text" : "Speaking of the Henry Ford of the NFL. Bill Belly. John Brady?"
  },
  {
    "speaker" : "Greg",
    "text" : "Johnny Smith. No. Tom Brady. Nick Folk. Can I give you my theory? Big Dick Nick is back. Okay. Okay. My theory is uh Bill Belichick builds his team around the talent that he has. Specifically the quarterback. So he built all those teams in New England around Tom Brady being a uh Okay You know, a good the Lynch moved the chains guy, right? Get Amendola. That was a pretty big signing at the time. Addleman, Welker, those guys. Now he's saying, okay, I have Cam Newton. We're gonna give this Cam Newton thing another roll. How what how does Cam Newton work at his best?",
    "timestamp" : "50:53-51:36"
  },
  {
    "speaker" : "Steve",
    "text" : "Let's I don't know let's let's table the let's table the quarterback stuff.",
    "timestamp" : "51:37-51:40"
  },
  {
    "text" : "2015, 2015, Cam Cam's MVP season, 15 and 1 Who is the leading receiver on that team? Uh tight end. What's his name? Greg Greg Olson. Greg Olson. 77 catches, 1100 yards, seven touchdowns. His receivers, you want to hear him? Deep threats. Tedkin Jr. , Jericho Cottry, Philly Brown, and Devin Funches.",
    "speaker" : "Greg",
    "timestamp" : "51:41-52:05"
  },
  {
    "timestamp" : "52:06-52:08",
    "speaker" : "Andy",
    "text" : "The most that's right. We've talked about this."
  },
  {
    "text" : "Tedkin Jr. led the wide receiving core with 44 catches. Ted Ginn Jr. did? The deep guy.",
    "speaker" : "Greg",
    "timestamp" : "52:08-52:15"
  },
  {
    "text" : "Yeah. What was it? What was his yards per catch? Yeah.",
    "speaker" : "Andy",
    "timestamp" : "52:16-52:20"
  },
  {
    "timestamp" : "52:20-52:27",
    "text" : "Yards per uh I think he had like 700 yards, something like that. So not as high as I thought, but",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "52:27-52:34",
    "text" : "All right. Well uh actually a good comp for that is Who do those names sound like? Nelson Aguilar, Kendrick Bourne, right?"
  },
  {
    "text" : "Those sound like the same type of guys.",
    "speaker" : "Greg",
    "timestamp" : "52:34-52:36"
  },
  {
    "speaker" : "Steve",
    "text" : "Well Aguilor had like the same amount of like 49 catches for 800 or 900 yards. So very, very similar. I don't know Born that well. But I do feel like as far as the overall moves, the receivers are just a little bit like, hmm, you know, like AJ Green didn't sign for a lot. Um Marvin Jones didn't sign for a lot and he's been awesome.",
    "timestamp" : "52:36-52:57"
  },
  {
    "speaker" : "Greg",
    "text" : "Kenny Galladay?",
    "timestamp" : "52:58-52:59"
  },
  {
    "timestamp" : "53:00-53:04",
    "text" : "I don't know if he signed yet, but Marvin Jones was also a free agent. He signed for like six million bucks.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "53:04-53:05",
    "speaker" : "Greg",
    "text" : "I don't even know he free aided."
  },
  {
    "speaker" : "Steve",
    "text" : "He gave Aguilar like 15 million. Guaranteed. This seemed like a lot. He's uh he's a risky one, right? Yeah, you're betting on potential for him for sure. You could have got a better deal for that. Money not on Algar. You're betting on him like being a more production.",
    "timestamp" : "53:06-53:23"
  },
  {
    "speaker" : "Greg",
    "text" : "Because he was nobody for five years in Philly and that had a real.",
    "timestamp" : "53:24-53:26"
  },
  {
    "timestamp" : "53:27-53:31",
    "text" : "I remember his reputation was like dropping big passes. Yeah. It was just like",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. Yeah, there was that uh clip in the news about him about the guys the guy talking about how like there was a place on fire and the uh the people inside were literally throwing babies outside out of the windows so the people in the ground could catch them. He's like, and we were catching them, unlike that fool Aguilar, who needs to take some fucking notes. He doesn't let it drop that into the interview that he was doing after you've been catching babies being thrown out windows. That's so Philly. Beautiful.",
    "timestamp" : "53:31-53:57",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "53:58-53:59",
    "speaker" : "Steve",
    "text" : "Oh my God."
  },
  {
    "text" : "Um so what do you think the wide receiver room looks like then starting next year? Yeah, it's also unsettled. So question number one, is Julian Adam coming back?",
    "speaker" : "Andy",
    "timestamp" : "54:00-54:08"
  },
  {
    "timestamp" : "54:08-54:19",
    "text" : "Yeah. That report is his knee is not awesome. Right? And it's like it's still a concern. Greg? I heard somewhere where like he may not be ready for that.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean, I don't know. Where's he gonna go? I I can't imagine. Does he retire? Yeah, I mean I think it's either he retires or stays in New England and I think it's probably a better chance he stays in New England because he's doesn't strike me as a guy that Knows when the stop. I feel like he pushes it until they they are forced to cut him.",
    "timestamp" : "54:19-54:40"
  },
  {
    "speaker" : "Steve",
    "text" : "I think he goes to uh Tampa. They have to trade him. I don't think it's a good thing.",
    "timestamp" : "54:40-54:45"
  },
  {
    "timestamp" : "54:46-54:50",
    "speaker" : "Andy",
    "text" : "Why would they trade him though? Right. And also, like Tampa doesn't need wide receivers right now."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, but so we trade him for uh Scotty Miller and some compensation.",
    "timestamp" : "54:51-54:55"
  },
  {
    "text" : "I think James White goes to fucking Tampa. Yeah, and I don't I don't think Edelman goes to Tampa because uh the pages don't need another Edelman. They have Gunnar Oshewski in the",
    "timestamp" : "54:56-55:06",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "But like why would you not trade him then to the camp of like a do you add them in a solid to get him back with Tom Brady, which the fucker probably really really wants and seeing Gronk having so much fun down there, he's probably sitting up here being like man that looks sweet",
    "timestamp" : "55:07-55:18"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, but again, does Tam Tampa has no room for him though? Why the fuck would they want him?",
    "timestamp" : "55:18-55:23"
  },
  {
    "timestamp" : "55:23-55:28",
    "text" : "Because Tom Brady told him to why would Cable want what Tom wants there?",
    "speaker" : "Steve"
  },
  {
    "text" : "Tom Brady just wants the window, so maybe No Tom Brady wants eldle down there, dude.",
    "timestamp" : "55:28-55:31",
    "speaker" : "Andy"
  },
  {
    "text" : "They are sush boys.",
    "timestamp" : "55:32-55:32",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, you might be right, Steve. I just don't see New England trading them just as like a favor.",
    "timestamp" : "55:33-55:37"
  },
  {
    "text" : "The real question is, how much do you believe in Gunner?",
    "speaker" : "Steve",
    "timestamp" : "55:37-55:40"
  },
  {
    "text" : "I believe in Gunner. I'm all in gunner.",
    "timestamp" : "55:41-55:43",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "55:43-55:45",
    "text" : "I don't I'm all in on Gunner.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "55:45-55:47",
    "text" : "As a receiver? Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "55:48-56:01",
    "text" : "He's followed the exact same path as the West Welker era. He just had Julian popped and then that Texas game where Welker tours ACL and that gave uh Edelman his shot and we're all like, oh wow. So why didn't it"
  },
  {
    "timestamp" : "56:01-56:06",
    "text" : "Why didn't Gunnar do anything last year when we were rolling out fucking nobody?",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:07-56:11",
    "text" : "He was coming out later. And like that offense throwing the ball was atrocious."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Also you're you're you're framing it around the the Tom Brady years, which is a very different thing than the the Cam Newton years. Right, but I think if uh I think you're stereotyping white guys is what I think, Steve",
    "timestamp" : "56:11-56:29"
  },
  {
    "speaker" : "Mom",
    "text" : "Yeah.",
    "timestamp" : "56:31-56:31"
  },
  {
    "text" : "Do you know what that is?",
    "speaker" : "Greg",
    "timestamp" : "56:32-56:32"
  },
  {
    "timestamp" : "56:33-56:33",
    "speaker" : "Mom",
    "text" : "Very naughty."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "56:34-56:34"
  },
  {
    "timestamp" : "56:34-56:37",
    "text" : "Oh. Very naughty.",
    "speaker" : "Mom"
  },
  {
    "timestamp" : "56:38-56:39",
    "speaker" : "Andy",
    "text" : "So you you're welcome for that."
  },
  {
    "text" : "Um but Is that from Mom Kong the Page's Daddy Highline? Very naughty.",
    "speaker" : "Steve",
    "timestamp" : "56:39-56:46"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "56:46-56:48",
    "text" : "No. Very naughty."
  },
  {
    "timestamp" : "56:48-56:50",
    "speaker" : "Mom",
    "text" : "Is it is it from Mao Kahn, the heartline?"
  },
  {
    "timestamp" : "56:50-56:53",
    "text" : "No, but uh when we're talking about Gregory.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mom",
    "text" : "Sometimes a naughty boy. Sometimes a naughty boy.",
    "timestamp" : "56:53-56:58"
  },
  {
    "speaker" : "Greg",
    "text" : "Very naughty.",
    "timestamp" : "56:58-57:00"
  },
  {
    "speaker" : "Mom",
    "text" : "So it's it's so true too. Very naughty.",
    "timestamp" : "57:00-57:03"
  },
  {
    "text" : "That's gonna get a lot of use.",
    "timestamp" : "57:09-57:10",
    "speaker" : "Andy"
  },
  {
    "text" : "Oh yeah, yeah.",
    "speaker" : "Mom",
    "timestamp" : "57:10-57:11"
  },
  {
    "speaker" : "Andy",
    "text" : "Can I just hear it again one more time though? Which one do you want?",
    "timestamp" : "57:11-57:14"
  },
  {
    "speaker" : "Mom",
    "timestamp" : "57:15-57:20",
    "text" : "Sometimes a naughty boy. Very naughty."
  },
  {
    "speaker" : "Andy",
    "text" : "Oh dude. That was worth all the effort I put into it.",
    "timestamp" : "57:23-57:26"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh my god, that's fucking funny.",
    "timestamp" : "57:26-57:29"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I got I got them queued up with don't you don't forget to add Greg's uh emergency warning, sir.",
    "timestamp" : "57:29-57:37"
  },
  {
    "timestamp" : "57:38-57:38",
    "speaker" : "Steve",
    "text" : "Uh"
  },
  {
    "timestamp" : "57:39-58:22",
    "text" : "Sound to that. Yeah, we're we're we're saving spot number four for something good. We'll see what that is. I don't know yet. Um well that derailed the conversation. Yeah, I don't know. Um yeah, so but I think to Greg's point about uh the Gunnar Oshewski not or to both your points not not playing well this year is because maybe like a Cam Newton-led offense isn't relying on that shifty slot receiver who is getting open but just barely and and it's like a lot of that short passing game where Cam Newton might be more of like Uh like a play action down the field, if that's not open, he hits the tight end, sort of thing, you know, which I I think is how he succeeded in Carolina, right, Greg?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:23-58:38",
    "speaker" : "Steve",
    "text" : "You know what? uh point for that equation is the drafting of Nikhil Harry, right? He would be one of those ones who's better at 50-50 balls than using craftiness and root running to get open. So Cam can just throw the ball up like he did with Devin Funches. He had some big ass guys there that he did pretty well with."
  },
  {
    "text" : "Good point. But I mean there's a lot of talk about Nikhil Harry being uh traded as well. So do you think he stays?",
    "timestamp" : "58:39-58:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:48-58:52",
    "speaker" : "Steve",
    "text" : "I think the ultimate uh determiner of that is what they end up doing at quarterback."
  },
  {
    "text" : "You know? I don't care.",
    "timestamp" : "58:52-58:54",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "58:54-58:58",
    "text" : "I think if they keep if they keep him, they can keep him. I mean",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "58:58-59:01",
    "text" : "I don't I don't care what they do with Harry at this point.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "He's been super frustrated. And they've never drafted a great receiver besides the guy you're wearing the jersey of, Greg. That's the last great high pick receiver they've drafted.",
    "timestamp" : "59:02-59:11"
  },
  {
    "text" : "You're gonna David Givens. Yeah, you're gonna do David like that?",
    "speaker" : "Greg",
    "timestamp" : "59:11-59:14"
  },
  {
    "speaker" : "Andy",
    "text" : "You're gonna do Julian Adelman like that? Deion Branch is Super Bowl MVP. But actually.",
    "timestamp" : "59:16-59:22"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "59:24-59:33",
    "text" : "But that's like seventh round. I'm saying high pick. Don't you mean don't you mean drafted or undrafted free agents? They definitely found some guys there, but like high pick for the Patriots."
  },
  {
    "text" : "Aaron Dops. How about Aaron Aaron Dropson? How about Kembo Dropkins?",
    "timestamp" : "59:33-59:37",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "59:38-59:43",
    "text" : "What about uh Malcolm Mitchell? Malcolm Mitchell's great for the year that his knees were still alive.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Chad Johnson.",
    "timestamp" : "59:44-59:44"
  },
  {
    "text" : "So here's something though. Jackson.",
    "timestamp" : "59:46-59:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "59:49-59:55",
    "text" : "Yeah, Chad Johnson was the other guy. I always make that mistake too. Johnson, Jackson, whatever. I was having this conversation."
  },
  {
    "timestamp" : "59:56-59:57",
    "speaker" : "Steve",
    "text" : "Eric Lass names."
  },
  {
    "speaker" : "Andy",
    "text" : "Stop interrupting him, Steve. Damn it, Steve. Nobody cares. I was having this conversation.",
    "timestamp" : "01:00:00-01:00:05"
  },
  {
    "text" : "Very naughty. Sometimes a naughty boy.",
    "timestamp" : "01:00:08-01:00:16",
    "speaker" : "Mom"
  },
  {
    "text" : "You need a naughty boy. That's right, mom. You're absolutely correct. What are they being?",
    "timestamp" : "01:00:16-01:00:21",
    "speaker" : "Andy"
  },
  {
    "text" : "Very naughty.",
    "timestamp" : "01:00:21-01:00:21",
    "speaker" : "Mom"
  },
  {
    "timestamp" : "01:00:22-01:00:38",
    "speaker" : "Andy",
    "text" : "Yeah, I agree. All right, go ahead. Patriots have never in free like what's the biggest offensive free agent the Patriots have brought in in the Beljack era? Randy Moss. Not a free agent. What do you mean?"
  },
  {
    "timestamp" : "01:00:40-01:00:41",
    "speaker" : "Steve",
    "text" : "Biggest by what measure?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:41-01:00:42",
    "text" : "Like most impactful."
  },
  {
    "speaker" : "Steve",
    "text" : "Most productive. Yeah.",
    "timestamp" : "01:00:42-01:00:43"
  },
  {
    "timestamp" : "01:00:43-01:00:45",
    "text" : "Biggest name. Whatever you want to do.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:00:47-01:00:47",
    "text" : "No, no.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:00:48-01:00:54",
    "text" : "Yeah. I think that's probably the only big name offensive weapon that the Pagans have brought in in free agency.",
    "speaker" : "Andy"
  },
  {
    "text" : "I mean, like Gilmore is probably their best ever free agent side.",
    "speaker" : "Steve",
    "timestamp" : "01:00:54-01:00:56"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:57-01:01:00",
    "text" : "Corey Dillon. Corey Dillon. Corey Dillon was a trade."
  },
  {
    "text" : "Was he? Yeah. Oh yeah.",
    "timestamp" : "01:01:00-01:01:01",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:01:01-01:01:02",
    "speaker" : "Andy",
    "text" : "Randy Moss is a trade."
  },
  {
    "timestamp" : "01:01:02-01:01:03",
    "speaker" : "Steve",
    "text" : "Res Volker was a trade."
  },
  {
    "text" : "Those are probably the big three. But in terms of offensive free agents. Pages don't really do that in terms of big name base.",
    "speaker" : "Andy",
    "timestamp" : "01:01:04-01:01:09"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:01:10-01:01:18",
    "text" : "They do some line stuff, a a fair bit of line in running back too. Like Rex is a free agent from the Bengals."
  },
  {
    "timestamp" : "01:01:19-01:01:22",
    "text" : "Yeah, yeah. I don't know how big that is, but yeah, okay.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And then like the depth guys on running back as well. But yeah, wide receiver. Yeah, I mean Cam Newton maybe biggest free agent signing. Yeah, that was my thing. I mean we didn't have the quarterback for so long, so I don't know if I'll really count that.",
    "timestamp" : "01:01:22-01:01:35"
  },
  {
    "text" : "Yeah, they always get the I mean they got some big names that they're all tail end of the career, like OJ Cinco was pretty big at the time.",
    "timestamp" : "01:01:35-01:01:42",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Fred Taylor, you know, they have big names.",
    "timestamp" : "01:01:44-01:01:46"
  },
  {
    "text" : "But in terms of like productivity, yeah. Whereas defense, like they're they're willing to spend the money on defense to go get a guy if they want, like a Dalius Thomas or Roosevelt Colvin.",
    "timestamp" : "01:01:47-01:01:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01:59-01:02:07",
    "text" : "But who's gonna be in that big name? Maybe that shows up at the end, Emmanuel Sanders. I always thought that guy should have been a patriot when we did that restricted offer to him.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:02:08-01:02:08",
    "text" : "Yeah, yeah, yeah."
  },
  {
    "text" : "He would have been awesome on the packs.",
    "timestamp" : "01:02:08-01:02:10",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:02:10-01:02:33",
    "text" : "Yep. Yeah, he would have. But the the Steelers just didn't want to let him go. Yeah. Oh actually, uh Antonio Brown, another big name. He was uh technically a free agent signing. Big name, but didn't do anything. Yeah, so I think this year, if you're gonna say that this is um an unbelacheck like year."
  },
  {
    "text" : "It's the most well that can I that's the the only I'm not gonna criticize Belichick. I I I like what they're doing this year, but I will criticize Patriots fans who over the years have always been like clowning on the other teams in the NFL for making big free agents. For winning the offseason. Yeah, for winning the offseason. And now all of a sudden the Patriots start handing out these like above market average uh contracts and the Patriots are like, oh yeah, suck it, rest of the NFL. It's like, what do you mean dude?",
    "timestamp" : "01:02:34-01:03:05",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:03:05-01:03:15",
    "speaker" : "Andy",
    "text" : "No, you're not saying the exact opposite for 20 years. You know what? And that's why I'm going to give him a pass this year, because we've never been able to experience it in our Patriots fandom, right? Yeah."
  },
  {
    "timestamp" : "01:03:16-01:03:21",
    "speaker" : "Greg",
    "text" : "So just admit just admit that you it's fun, it's exciting, it's scary."
  },
  {
    "speaker" : "Andy",
    "text" : "I don't know how it's gonna work. This is the first time. Well, maybe second, if you want to count 07 and the reign also as well, but I don't think anybody realized at the time.",
    "timestamp" : "01:03:21-01:03:29"
  },
  {
    "speaker" : "Steve",
    "text" : "Right. This year has been an Like every other year, just drafting them. Everybody knew it. It's just like the draft. Don't stand for the Patriots pick. They're just going to trade out of the first round and you're going to get tired.",
    "timestamp" : "01:03:32-01:03:42"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Right. So does he continue that trend into the draft and stuff?",
    "timestamp" : "01:03:43-01:03:46"
  },
  {
    "speaker" : "Steve",
    "text" : "I didn't even thought of that. So yeah, I think this is where we get to our quarterbacks. Here's a Ricky Williams deal. Remember that? Or a Herschel Walker deal. Herschel's even worse, right? Yeah. Well, I don't think it's the entire draft. The whole draft. Yeah. Of the Dolphins to the Saints for the right to draft Ricky won that.",
    "timestamp" : "01:03:47-01:04:09"
  },
  {
    "speaker" : "Andy",
    "text" : "And we looked it up. Who won that who won that trade? Or I I think the the Dolphins it was Ricky Williams, right?",
    "timestamp" : "01:04:09-01:04:15"
  },
  {
    "timestamp" : "01:04:15-01:04:17",
    "speaker" : "Steve",
    "text" : "The Dolphins won that trade. Yeah."
  },
  {
    "timestamp" : "01:04:17-01:04:18",
    "speaker" : "Andy",
    "text" : "The Saints drafted nobody."
  },
  {
    "text" : "It was an impressive list of nobody's ever remembered.",
    "timestamp" : "01:04:19-01:04:22",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:04:22-01:04:38",
    "speaker" : "Andy",
    "text" : "Although having said that, the Dolphins didn't win anything after going to Williams. Didn't help that what's his name was the quote coach Wannstatt. Who decided to spend all that draft capital on him and then not run it with him in the last game of the season with this uh playoffs on the line."
  },
  {
    "text" : "Oh yeah.",
    "speaker" : "Steve",
    "timestamp" : "01:04:38-01:04:39"
  },
  {
    "speaker" : "Andy",
    "text" : "Whoops. Conspiracy time. Ooh, love this.",
    "timestamp" : "01:04:39-01:04:43"
  },
  {
    "text" : "I don't know if I should say this. Give it to me.",
    "timestamp" : "01:04:45-01:04:47",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "You should definitely say it.",
    "timestamp" : "01:04:49-01:04:51"
  },
  {
    "speaker" : "Greg",
    "text" : "Very normal. I'm gonna preempt this by saying this might be insensitive, but Deshaun Watson in recent news, a lot of accusations coming out about masseuses.",
    "timestamp" : "01:04:51-01:05:04"
  },
  {
    "text" : "And they're they're getting worse by the day.",
    "speaker" : "Andy",
    "timestamp" : "01:05:04-01:05:07"
  },
  {
    "timestamp" : "01:05:06-01:05:16",
    "text" : "Yeah. There's six of them now. So the price for Deshaun Watson probably just went down. Who else has had a couple run-ins with Masseuses in the recent years?",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Mom",
    "timestamp" : "01:05:16-01:05:17"
  },
  {
    "speaker" : "Greg",
    "text" : "That's true.",
    "timestamp" : "01:05:17-01:05:18"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:05:18-01:05:29",
    "text" : "Maybe knows his way around a hand job or two. knows how to get off of it too. In in I guess multiple ways. But in terms of like not having to pay any fines."
  },
  {
    "timestamp" : "01:05:29-01:05:34",
    "speaker" : "Steve",
    "text" : "Well yeah Greg, let's the come on keep going with your conspiracy theory. Like let's name names and say, you know"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:05:34-01:05:46",
    "text" : "What is your cats trade draft picks on the lowered market for Deshaun Watson? Get him into town. Craft gets him off the charges. Onwards and upwards."
  },
  {
    "text" : "So Kraft is the one spreading the rumors about Deshaun Watson.",
    "timestamp" : "01:05:46-01:05:50",
    "speaker" : "Steve"
  },
  {
    "text" : "No. No, Belichick planted this back when we were in the AFC Championship game.",
    "timestamp" : "01:05:50-01:05:56",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:05:56-01:05:58",
    "text" : "Wait, who so who's who's planting the rumors?"
  },
  {
    "text" : "Belichick is little fingering the whole thing. He's behind. He got craft arrested. For the first time. Oh, okay. Now he's planting these masseuses. Plant the long to get yeah, yeah, yeah. Well, because he thought Brady was gonna be done back then. And he's like, I like thought Brady was retiring after that Super Bowl. Yeah.",
    "timestamp" : "01:05:59-01:06:20",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:20-01:06:21",
    "text" : "Okay. Didn't he?"
  },
  {
    "text" : "Wait, no, why did he frame craft it the first time? Wait, did he framecraft",
    "timestamp" : "01:06:21-01:06:25",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "to get Deshaun was that his like original to get sympathy for the the quarterback he's gonna bring in the future that he lowers the price with he hadn't decided on but he had to practice at it by framing his boss first Well, you know, he wanted craft sympathies towards bringing in a player like that.",
    "timestamp" : "01:06:25-01:06:42"
  },
  {
    "speaker" : "Steve",
    "text" : "Wait, did Belchek frame craft or did Belchek say see that? situation and say how can I just take advantage of this? No, Belichick framed him. Yeah. Yeah.",
    "timestamp" : "01:06:47-01:06:55"
  },
  {
    "speaker" : "Andy",
    "text" : "Belichick's an evil genius like they definitely framed him. Okay.",
    "timestamp" : "01:06:55-01:06:58"
  },
  {
    "speaker" : "Steve",
    "text" : "Okay.",
    "timestamp" : "01:06:58-01:06:58"
  },
  {
    "timestamp" : "01:06:58-01:06:59",
    "text" : "So Belichick framed craft.",
    "speaker" : "Andy"
  },
  {
    "text" : "And and framed him by you know why wouldn't he just frame uh Deshaun as well? Then it's way more believable. He did. That's the thing.",
    "speaker" : "Steve",
    "timestamp" : "01:06:59-01:07:07"
  },
  {
    "text" : "So the allegations are true. This is where I stopped. Yep. Uh to there we were having fun. Yeah, I'll I'll be where you stopped. He turned to Q and said",
    "speaker" : "Greg",
    "timestamp" : "01:07:07-01:07:20"
  },
  {
    "text" : "Yeah, we'll have to wait for the next Q. Once you start once you start fucking telling people that this is all you know what? But what I I I think uh yes, we definitely stop there for that, but I think that there needs to be an NFL version of QAnon. There needs to be an unnamed source inside the building. No, there doesn't. Inside league offices dropping Q drops.",
    "speaker" : "Andy",
    "timestamp" : "01:07:23-01:07:50"
  },
  {
    "text" : "No. Because they're all bullshit. You saw people just making b a bunch of right, which is why we can do it, because we're great at bullshit. So you want us to become QAnon? Is that where you're going with this? Yeah, we're just we're just we're gonna cut this gonna cut this part out.",
    "timestamp" : "01:07:51-01:08:03",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:08:03-01:08:05",
    "text" : "Yes, but we're gonna be QAnon."
  },
  {
    "text" : "No.",
    "timestamp" : "01:08:05-01:08:05",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "NFL Anon? I don't know. It needs a better name. No, I'm not going down. Gianon. It's definitely not Roger Goodell. It's just G Anon.",
    "timestamp" : "01:08:06-01:08:13"
  },
  {
    "timestamp" : "01:08:13-01:08:14",
    "speaker" : "Greg",
    "text" : "Steve, thoughts?"
  },
  {
    "timestamp" : "01:08:14-01:08:17",
    "speaker" : "Andy",
    "text" : "We're real G's. And Greg can be the first one."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:08:18-01:08:23",
    "text" : "I can I can barely commit to a once-a-week podcast, never mind breadcrumbing things."
  },
  {
    "timestamp" : "01:08:24-01:08:34",
    "text" : "But you don't even have to breadcrumb, you can just make them up. Yeah. And fucking verification codes, it sounds like a lot of and then thinking all the bullshit up and then like, oh no, now everyone's believing it.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:08:35-01:08:48",
    "text" : "Alright, let's start now. Roger Goodell. has been molesting uh children for 30 years. You know, every conspiracy has a thin veil of truth to it."
  },
  {
    "speaker" : "Andy",
    "text" : "Every every time he mentions pizza What he's really talking about is is little children.",
    "timestamp" : "01:08:48-01:08:53"
  },
  {
    "speaker" : "Greg",
    "text" : "I know every time he mentions player safety, he's he's he's referencing a child he molested. Oh",
    "timestamp" : "01:08:54-01:08:59"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:09:01-01:09:04",
    "text" : "And when he when he says owners, he's not actually talking about the biggest thing."
  },
  {
    "timestamp" : "01:09:05-01:09:15",
    "text" : "Everybody in the NFL is drinking children's blood to keep them. That's how they perform it to high level. That's how they're so athletic is a cabal. Trafficking and sex trade, you know, propping up the Failing books.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, that and that's the reason Goodell is still a commissioner is because he has all this blackmail and all the owners. So they can't get rid of him.",
    "speaker" : "Andy",
    "timestamp" : "01:09:15-01:09:20"
  },
  {
    "speaker" : "Steve",
    "text" : "The pink is for children's blood. Everyone knows that children's blood is pink in October. He's on Epstein's flight log. See, this is easy.",
    "timestamp" : "01:09:21-01:09:28"
  },
  {
    "text" : "We could do this. We'll cut this part and uh so nobody'll know. I'm I'm sure I'll remember that.",
    "speaker" : "Andy",
    "timestamp" : "01:09:28-01:09:33"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:09:34-01:09:48",
    "text" : "All right. Do you want to go right into quarterbacks then? All right, here's the question. Wait, can I uh I have like one more note. That's it. About how Belichick. This is like a master question. Talk about big kick nick."
  },
  {
    "speaker" : "Greg",
    "text" : "He's back. Is he? Oh yeah. Let's talk about the kicker. Let's talk about tap water.",
    "timestamp" : "01:09:49-01:09:55"
  },
  {
    "timestamp" : "01:09:55-01:10:09",
    "speaker" : "Steve",
    "text" : "No, let's talk. Let's talk about the kicker because I didn't even know he was back until in this because like I walked away at a I had a work day and then a puppy party and I didn't even check it and I come to sit down for this podcast."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:09-01:10:14",
    "text" : "I'm sorry, I'm sorry. Rue was no no please don't puppy party"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:10:15-01:10:16",
    "text" : "Yeah, you who are you?"
  },
  {
    "text" : "Good God. You can start a podcast about it?",
    "speaker" : "Greg",
    "timestamp" : "01:10:19-01:10:23"
  },
  {
    "text" : "You fucking called it a puppy podcast.",
    "timestamp" : "01:10:23-01:10:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:10:25-01:10:27",
    "text" : "I'm sure there's a ton of podcasts about it."
  },
  {
    "speaker" : "Andy",
    "text" : "I'm surprised you didn't give it a cuter name.",
    "timestamp" : "01:10:28-01:10:30"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:10:30-01:10:30",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:10:31-01:10:46",
    "text" : "The puppy Palooza. Ooh. What other cool names can we come up with? No, that's it. Uh so quarterbacks. Craig, talk to me about quarterbacks. No, kickers. We already talked about kickers.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:10:47-01:10:47",
    "speaker" : "Greg",
    "text" : "Tapwater?"
  },
  {
    "text" : "Tapwater, done.",
    "timestamp" : "01:10:48-01:10:49",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Just Justin Tapwater.",
    "timestamp" : "01:10:49-01:10:50"
  },
  {
    "text" : "Yeah. Don't they have three kickers right now? They do. Uh Aguile. Let's talk we're all bear a guy. I also I'm surprised Nick Folk didn't get more money from somebody. He was awesome last year.",
    "speaker" : "Steve",
    "timestamp" : "01:10:51-01:11:03"
  },
  {
    "timestamp" : "01:11:04-01:11:05",
    "speaker" : "Andy",
    "text" : "I don't care. No, the kickers."
  },
  {
    "timestamp" : "01:11:06-01:11:14",
    "speaker" : "Steve",
    "text" : "Um why you guys hate kickers so much special teams is hugely important. We gotta talk about Justin Bethel getting back as well."
  },
  {
    "timestamp" : "01:11:14-01:11:15",
    "speaker" : "Greg",
    "text" : "Oh no, please not."
  },
  {
    "speaker" : "Steve",
    "text" : "What I think that Bethel signing is huge.",
    "timestamp" : "01:11:15-01:11:18"
  },
  {
    "speaker" : "Greg",
    "text" : "You are wait, are you fucking with me right now? No. You're serious.",
    "timestamp" : "01:11:19-01:11:23"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:11:24-01:11:24",
    "text" : "Yes."
  },
  {
    "text" : "You think the Justin Bethel signing is huge?",
    "speaker" : "Greg",
    "timestamp" : "01:11:24-01:11:27"
  },
  {
    "text" : "Yep. Yes.",
    "speaker" : "Steve",
    "timestamp" : "01:11:27-01:11:28"
  },
  {
    "text" : "Guys, you are so fucking dumb, Steve. What are you gonna do when Matthew Slater retires, Greg? Oh my retiring in three years? Probably this is why this podcast sucks.",
    "speaker" : "Greg",
    "timestamp" : "01:11:28-01:11:39"
  },
  {
    "text" : "Oh I drink, why did it suck?",
    "timestamp" : "01:11:42-01:11:45",
    "speaker" : "Steve"
  },
  {
    "text" : "Justin Baffled.",
    "timestamp" : "01:11:50-01:11:52",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "He's been made huge plays in the same way Slater has. Him and Slater are the two best special teams guys in the league. We have to do that. Yeah, they were both awesome last year and we were re signed for three years six million bucks. It's nothing. Inslater is like on the tail end of his career anyway, so we can just do make the transition for are you serious, Steve? Yes, very serious. You're serious. Yes.",
    "timestamp" : "01:11:54-01:12:17"
  },
  {
    "text" : "Hell yeah.",
    "timestamp" : "01:12:17-01:12:17",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:12:17-01:12:27",
    "speaker" : "Steve",
    "text" : "That was one of the first signings. What was the first signing they made was Bethel. Yeah, it was up there. Actually, I don't think he've hit free agency, they said. Is they signed him right before Who cares? Who cares?"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:12:27-01:12:46",
    "text" : "The guy plays fucking like ten plays a game. I didn't yeah, I I don't even remember no I didn't even know he was on the roster until they said he re-signed him. I don't even know what the fuck Justin Vethel is. I'm sure he's good. The difference between the best special team here in the league and the worst is like nothing. No."
  },
  {
    "speaker" : "Mom",
    "timestamp" : "01:12:47-01:12:51",
    "text" : "It's a rounding error in in what your final outcome of the season is."
  },
  {
    "speaker" : "Andy",
    "text" : "No, it's a matter of uh opinion A team deep in the uh on their own five yard line that ball bounce again.",
    "timestamp" : "01:12:51-01:12:57"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:12:58-01:13:05",
    "text" : "Twice a year. Twice a year it's the difference. So wrong. Twice a game. Yeah. So so it's two drives a season that it matters."
  },
  {
    "timestamp" : "01:13:06-01:13:11",
    "speaker" : "Andy",
    "text" : "Did the did uh the punter in uh the Rams Super Bowl did did he win that game for him?"
  },
  {
    "timestamp" : "01:13:11-01:13:14",
    "speaker" : "Steve",
    "text" : "I'd say everyone universally agrees he was the M VP of that game."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:13:16-01:13:32",
    "text" : "They have the best punch of the NFL on the Rams, Johnny Hecker. Why didn't the Rams win? Because they don't have the gun. Because they don't have the guns, guys. You guys are your head is so far up your own ass. No, I can't even believe the game."
  },
  {
    "timestamp" : "01:13:32-01:13:37",
    "speaker" : "Andy",
    "text" : "How the fuck are we still talking about Justin Bethel? I love it. Great signing."
  },
  {
    "timestamp" : "01:13:38-01:13:54",
    "speaker" : "Steve",
    "text" : "I thought it was an amazing sign. Yes, there was like there was that play in the Chargers game where the ball was about to bounce so fast he got there and like caught it and scooped it behind him. Yep. Right before we stepped in the end zone, and it was a good idea."
  },
  {
    "text" : "You're approaching football as a religion. And like Bill Belichick says that's Special teams are important. So that's the other's a really good signing.",
    "speaker" : "Greg",
    "timestamp" : "01:13:57-01:14:05"
  },
  {
    "text" : "Oh that's the other thing I want to talk about. Apparently it's really easy to sign up. So if he says that's true, I believe it a hundred percent. I think we should start a religion. Um, because apparently it's really easy to do and it's completely tax-free. And so we should start a religion around this. Bellad like Czechyism? Yeah, we'll f we'll we'll work on the name. Yeah.",
    "timestamp" : "01:14:06-01:14:32",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:14:32-01:14:35",
    "speaker" : "Greg",
    "text" : "How does the money play into it? Because we don't make any money."
  },
  {
    "timestamp" : "01:14:39-01:14:49",
    "text" : "Yeah, but peop people can tithe to us. to the Church of Belichick. Um and then, you know, if you pay enough money to us, the the pages will win. So the more money you give, the more changes.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:14:50-01:14:51",
    "text" : "Send a masseuse to your house.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "No, we'll send a masseuse to um Uh Patrick Mahomes' house. Ooh.",
    "timestamp" : "01:14:52-01:14:57"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:14:58-01:15:02",
    "text" : "Yeah, see? We're talking, dude. His wife is super annoying."
  },
  {
    "text" : "And is tax-free.",
    "timestamp" : "01:15:02-01:15:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "His brother and his wife are like TikTok people. I don't know.",
    "timestamp" : "01:15:06-01:15:09"
  },
  {
    "text" : "I don't know TikTok.",
    "timestamp" : "01:15:09-01:15:10",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:15:10-01:15:42",
    "text" : "They're awful. They're fucking awful. Oh, can I I'm not on TikTok either? I still know. The TikTok rules, okay? I I know people take yeah. I know it's like the you know it's like the most popular app out there, but Yeah, but like football fans in general, I bet if you ask them if you like to TikTok, like what am I, a fucking Gen Z? Like I I get it. Oh yeah, they all say that Their fucking algorithm is so good that it just funnels you to shit that is you'll find funny or entertaining."
  },
  {
    "speaker" : "Steve",
    "text" : "I thought you hated marketing.",
    "timestamp" : "01:15:42-01:15:43"
  },
  {
    "text" : "Like there's a ton of shit out there on it that are wicked cringy and are not funny at all, but the algorithm just takes that shit out and you just keep getting shit you think is funny. So if if you're a 55-year-old man out there listening to this, try TikTok. I guarantee. I guarantee this dad joke TikTok. There's all sorts of fucking funny TikTok. You will find it very quickly, TikToks you like. That's just my that's my two cents, okay? That nobody quarterbacks. I'm a TikTok stan. You're a TikTok",
    "speaker" : "Greg",
    "timestamp" : "01:15:43-01:16:17"
  },
  {
    "text" : "I'm a Belichick stand. That's probably what we should call a religion, by the way. Because think about it this year where comp pics have always been so important to the Patriots, right? We're getting like pretty sweet ones here. And this is the year where he's like comp pics because I have no big free agents that are gonna sign big contracts. Yep. And I'm just gonna spend. So if I'm gonna spend any year, it's gonna be this year. Everyone's getting those low $1 million salary deals, everything pushed to the back, and we're just going for a ton of players.",
    "speaker" : "Steve",
    "timestamp" : "01:16:20-01:16:53"
  },
  {
    "text" : "Yes, Steve, I want you to write out the like uh the tenants of the the church of Bill Belichick, you know, like we can do that.",
    "speaker" : "Greg",
    "timestamp" : "01:16:53-01:17:01"
  },
  {
    "speaker" : "Steve",
    "text" : "Thou shalt not.",
    "timestamp" : "01:17:02-01:17:03"
  },
  {
    "text" : "Yeah, value, value, value. Yeah. Thou shalt sign players that value.",
    "timestamp" : "01:17:03-01:17:08",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:17:08-01:17:12",
    "text" : "Thou shalt not build a strong middle class of the roster. That is the first thing."
  },
  {
    "timestamp" : "01:17:13-01:17:16",
    "speaker" : "Andy",
    "text" : "Thou shalt not underestimate special teams."
  },
  {
    "timestamp" : "01:17:16-01:17:17",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Thou shalt consider",
    "timestamp" : "01:17:17-01:17:18"
  },
  {
    "speaker" : "Greg",
    "text" : "Weather while picking sides of fields. In overtime. Yeah",
    "timestamp" : "01:17:20-01:17:25"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:17:27-01:17:29",
    "text" : "Thou shalt not punt inside."
  },
  {
    "timestamp" : "01:17:30-01:17:36",
    "text" : "The toss if they win it at the beginning. Yes. Unless throwing a curveball to the opposing coach.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:17:36-01:17:40",
    "text" : "Thou shalt treat the media like total dickheads."
  },
  {
    "timestamp" : "01:17:41-01:17:43",
    "text" : "Well yeah, I think we can all get behind that.",
    "speaker" : "Steve"
  },
  {
    "text" : "Thou shalt wait take the season one game at a time. Thou shan't Think of the future. Thou shalt take no days off.",
    "timestamp" : "01:17:43-01:17:54",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Thou shan't smile on the sidelines. Thou shalt do thy job.",
    "timestamp" : "01:17:57-01:18:03"
  },
  {
    "text" : "Thou shalt keep thy sleeve short. And Bill said, do thy job. And Bill said, from thy demeanor disheveled thy job.",
    "speaker" : "Andy",
    "timestamp" : "01:18:03-01:18:13"
  },
  {
    "speaker" : "Greg",
    "text" : "Sundays are not for resting. Alright, the religion I'm I'm into it now.",
    "timestamp" : "01:18:15-01:18:19"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:18:20-01:18:25",
    "text" : "Yeah. If you have any commandments you want us to write down."
  },
  {
    "text" : "Yeah, what's the uh dynasty hotline?",
    "speaker" : "Steve",
    "timestamp" : "01:18:26-01:18:28"
  },
  {
    "timestamp" : "01:18:28-01:18:33",
    "speaker" : "Andy",
    "text" : "Dynasty Hotline, 603-505-8043."
  },
  {
    "timestamp" : "01:18:33-01:18:34",
    "text" : "For three.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:18:34-01:18:37",
    "speaker" : "Andy",
    "text" : "For three. So, quarterbacks."
  },
  {
    "speaker" : "Greg",
    "text" : "Quarterback. Let's make our predictions. Who starts week one or snap under center? Cam Newton. Cam Newton, yeah. All right. If it's not Cam Newton.",
    "timestamp" : "01:18:38-01:18:46"
  },
  {
    "text" : "Well how about who takes the next afternoon?",
    "timestamp" : "01:18:48-01:18:50",
    "speaker" : "Steve"
  },
  {
    "text" : "Julian Edelman.",
    "timestamp" : "01:18:50-01:18:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:18:51-01:19:00",
    "text" : "Who's the next starting quarterback after Cam Newton? And you can say draft pick or free agent or I don't know what you think they're gonna do."
  },
  {
    "timestamp" : "01:19:00-01:19:05",
    "speaker" : "Greg",
    "text" : "Well, let's just let's just propose it as say they go another way this year."
  },
  {
    "timestamp" : "01:19:06-01:19:06",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:19:06-01:19:13",
    "speaker" : "Greg",
    "text" : "Like we can say either on the roster, trade, or draft. Watson. Here's my theory."
  },
  {
    "timestamp" : "01:19:14-01:19:35",
    "speaker" : "Steve",
    "text" : "They're gonna trade up in grass for Trey Lance. I like Trey Lance too. Trade up and graph for Trey Lance. Garoppolo. I don't I mean I think that was their plan for a bit, but I think they're past that now. Why? Uh I think just it would have happened early in the year and like the why unless the unless they can get him for cheaper, I think"
  },
  {
    "text" : "I heard San Francisco's still poking around quarterbacks.",
    "speaker" : "Greg",
    "timestamp" : "01:19:35-01:19:38"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:19:38-01:19:39",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Who? Who's left?",
    "timestamp" : "01:19:39-01:19:40"
  },
  {
    "text" : "I think Watson has the 49ers on his trade list.",
    "timestamp" : "01:19:41-01:19:44",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "It's the 49ers and like I I see I thought they were just waiting for that domino to fall of like even maybe it's even after the draft where the Niners draft a quarterback and Pat's coming scoop grapes.",
    "timestamp" : "01:19:44-01:19:57"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:19:58-01:20:04",
    "text" : "Yeah, but what do you draft at 15 there? Do you just keep him going best player available? Or do you like what if you d what if they don't and then"
  },
  {
    "text" : "Yeah, you're fine. Offensive tackle.",
    "timestamp" : "01:20:07-01:20:09",
    "speaker" : "Greg"
  },
  {
    "text" : "It's like the path to a guard quarterback.",
    "timestamp" : "01:20:09-01:20:12",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "I don't think they don't need to draft a quarterback in the First.",
    "timestamp" : "01:20:12-01:20:15"
  },
  {
    "text" : "But I think Belchek understands that like the path to a top tier QB is most likely through the top rounds of the draft, right? And like the top top of the draft because you can't get like a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of Uh he he hasn't had to worry about it before, so who the hell knows? Every other NFL franchise do it and the way they're kinda getting it is picking the top half of the round.",
    "speaker" : "Steve",
    "timestamp" : "01:20:16-01:20:33"
  },
  {
    "timestamp" : "01:20:34-01:20:37",
    "speaker" : "Greg",
    "text" : "Like Watson and Jason Jimmy Garoppolo is second rounder."
  },
  {
    "speaker" : "Steve",
    "text" : "Where was Wilson? He was like a third, right?",
    "timestamp" : "01:20:37-01:20:40"
  },
  {
    "timestamp" : "01:20:40-01:20:40",
    "speaker" : "Greg",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:20:40-01:20:41",
    "text" : "But that was the only one."
  },
  {
    "text" : "Sean was first round. Mahomes was first round.",
    "timestamp" : "01:20:41-01:20:45",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yep. He was kind of late. Trubisky was first round. Lamar Jackson. Sam Darnold was first round. Because you pick in the first round doesn't mean you're going to hit. So do you do it?",
    "timestamp" : "01:20:45-01:20:57"
  },
  {
    "timestamp" : "01:20:57-01:21:03",
    "speaker" : "Greg",
    "text" : "Yeah, there's even more names out there that are worse than that. Oh yeah. The blank gabbers of the world, you know."
  },
  {
    "speaker" : "Andy",
    "text" : "Basically any Jags quarterback for the past 20 years.",
    "timestamp" : "01:21:04-01:21:07"
  },
  {
    "timestamp" : "01:21:07-01:21:19",
    "speaker" : "Steve",
    "text" : "Hasn't no first round pick from like 2016 still been on their roster 2016 to 20 some other I forgot something like that. It's like four years where the first round quarterbacks were not on the roster once Wentz was traded."
  },
  {
    "timestamp" : "01:21:19-01:21:22",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah Yeah, there's another name."
  },
  {
    "text" : "I like Trey Lance though. I I think he fits well in the system we're running now. And he's not like a too much of a because I think if you're talking about the draft, you have to consider All right, let's say this question, all right? Let's let's say they pick a they pick a quarterback. Who who do you rate highest with the consideration of what you'd have to trade to get them?",
    "speaker" : "Greg",
    "timestamp" : "01:21:23-01:21:47"
  },
  {
    "timestamp" : "01:21:47-01:21:48",
    "speaker" : "Andy",
    "text" : "Right."
  },
  {
    "text" : "Right. So you say, yeah, Trevor Lawrence, you have to give up everything. Everything. The whole fucking thing, you know? Justin Fields, you might be able to get him at what four or five. Zach Wilson, you probably have to give up multiple firsts. Trey Lance.",
    "timestamp" : "01:21:48-01:22:07",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "You can kind of put Fields, Lance, and Wilson all in the same. I don't think so. I don't know. I think Trey Lance has grown in even Mac Jones kind of cup. It's like the number one in those three guys and anyone kind of has them wherever, right? Everyone's gonna have them a little differently, I think. Yeah. And then Mac and he's rising. Yeah. I don't think Mac will be there if you get a quarterback sort of regardless.",
    "timestamp" : "01:22:08-01:22:29"
  },
  {
    "text" : "Trey Lance, it's possible, right?",
    "timestamp" : "01:22:30-01:22:32",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, all all four of those guys are definitely possible. Macro costs a little bit less, but I think all the other three, like you gotta move up and go get your guy sort of thing, you know?",
    "timestamp" : "01:22:32-01:22:40",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:22:40-01:22:42",
    "speaker" : "Andy",
    "text" : "Yeah, I think so too."
  },
  {
    "speaker" : "Steve",
    "text" : "Um so if you're talking a fair bit of draft capital, do that. What I what I think the best fit for the offensive they built it is like Cam Newton from Auburn, like when he was first drafted, right? And even a little bit like James Winston, where they are like those big guys who can run pretty well and can throw it really well as well.",
    "timestamp" : "01:22:42-01:23:01"
  },
  {
    "timestamp" : "01:23:02-01:23:03",
    "text" : "Can throw it down the field too. Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:23:03-01:23:11",
    "speaker" : "Greg",
    "text" : "Okay. So a Heisman. First overall pick that can run and throw. Okay. Noted. So Trevor Lawrence. Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "I mean you're going to be able to do that.",
    "timestamp" : "01:23:13-01:23:13"
  },
  {
    "timestamp" : "01:23:13-01:23:15",
    "speaker" : "Greg",
    "text" : "Trevor Lawrence or Bust appear."
  },
  {
    "timestamp" : "01:23:15-01:23:19",
    "speaker" : "Steve",
    "text" : "Watson and Russ can both do that. They're both equally adept in that area already."
  },
  {
    "speaker" : "Greg",
    "text" : "The guy coming into Clemson next year is a is a fucking thick boy.",
    "timestamp" : "01:23:20-01:23:24"
  },
  {
    "text" : "How many seeds Greg?",
    "speaker" : "Steve",
    "timestamp" : "01:23:24-01:23:25"
  },
  {
    "timestamp" : "01:23:25-01:23:28",
    "speaker" : "Greg",
    "text" : "Greg likes his thick boy. Yeah, he's huge."
  },
  {
    "text" : "Like Steve McNair in this offense would have been fucking unstoppable. Steve McNair in his prime in this offense would have been absolute. And he is a thick forward. You know what I've been great brilliant seeds.",
    "speaker" : "Steve",
    "timestamp" : "01:23:28-01:23:37"
  },
  {
    "text" : "Randall Cunningham would have been amazing in this offense. Michael Vick, maybe they're building. I think they want to be able to run on anybody. You know? John Ellway probably would have been great in this offense. I don't know if Montana Kim would have killed it.",
    "timestamp" : "01:23:37-01:23:52",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know if Montana would have been either. I think they I think that guy's gotta have a good running part to his to his game.",
    "timestamp" : "01:23:52-01:23:58",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:23:58-01:24:02",
    "text" : "Alright, so we're done with Jerry Stidham. There's a question. Yeah, it feels like it.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, unless it's an emergency.",
    "timestamp" : "01:24:02-01:24:03",
    "speaker" : "Steve"
  },
  {
    "text" : "I mean, I think you'll find out real quick in the uh remember Steve at the beginning of last year, you said Stim was gonna win the job over Kim Newton? Hell yeah. Yeah I just yeah.",
    "timestamp" : "01:24:05-01:24:16",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Wasn't that part of my fantasy too?",
    "timestamp" : "01:24:16-01:24:18"
  },
  {
    "timestamp" : "01:24:18-01:24:31",
    "speaker" : "Steve",
    "text" : "I also said that Tannehill and Josh Allen were gonna suck. Yeah, no, yeah, how'd that go? Well at the end of life I still I still believe deep down inside."
  },
  {
    "text" : "It's like uh GR from Subway is still affecting.",
    "timestamp" : "01:24:33-01:24:35",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:24:35-01:24:43",
    "speaker" : "Steve",
    "text" : "Josh Allen is convinced a little bit, but still makes a bunch of dumb decisions. A lot of dumb decisions. But he's better than Dan Allen."
  },
  {
    "timestamp" : "01:24:44-01:24:46",
    "speaker" : "Andy",
    "text" : "Yeah, he's pretty good. We'll see."
  },
  {
    "timestamp" : "01:24:46-01:24:47",
    "speaker" : "Steve",
    "text" : "I mean that's the best."
  },
  {
    "speaker" : "Andy",
    "text" : "I have one good year. I'm not ready to crown anybody yet At least we're not the bears, you know? Oh my god. Andy Dalton, the savior. At least his hair matches his his uh outfit now.",
    "timestamp" : "01:24:47-01:24:58"
  },
  {
    "timestamp" : "01:24:58-01:25:23",
    "text" : "Unbelievable. You see that uh Trubitsky's gone now too? Yeah, he's he's a backup for the Bills. Backup for the Bills. Unbelievable. Woof. You go from like a from like a month straight of like Russell Wilson rumors to Andy Andy Dalton. I would kill myself. I would just stop watching food. I would kill myself there. Uh yeah, I wouldn't. I can't imagine what it's like. to be a Bears fan right now. I'd give up.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:25:24-01:25:28",
    "text" : "Even watching the Peaches just like over here going, oh my God, we've got to have an emergency podcast episode.",
    "speaker" : "Steve"
  },
  {
    "text" : "This is this has been such a great offseason. We've never had this before. We never had to This is what it's like to sign every good free agent. And the bears like we can.",
    "speaker" : "Andy",
    "timestamp" : "01:25:29-01:25:37"
  },
  {
    "text" : "Also, it's like did you hear about Michael Brockers, the guy from the Rams?",
    "speaker" : "Greg",
    "timestamp" : "01:25:38-01:25:42"
  },
  {
    "text" : "No.",
    "speaker" : "Steve",
    "timestamp" : "01:25:43-01:25:43"
  },
  {
    "timestamp" : "01:25:44-01:26:01",
    "text" : "This is great. When they traded for uh Stafford for Goff, he was like, Oh man, Stafford is such a huge upgrade from Goff. Yeah. And then this week he got traded to Detroit for like seventh traffic.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "He's back with the boy Goff. Awkward. Tough look. Tough look. That's tough.",
    "timestamp" : "01:26:03-01:26:09"
  },
  {
    "text" : "Yeah. All right. Anything else? No. Who's your favorite signing? You're most excited? Judon. Jakob Johnson. Mine's Johnu. I I watched uh shout out Flemlo Raps on YouTube. Yes. That guy rules. Yeah. Did you watch the Johnu one? Yeah. Yeah. He's fucking cool, dude. That's a YouTube channel and he does like um just like mini deep dives on NFL players, like where are they now or like how do they get here? You should watch the Johnny one, Steve. It's really good. I'm looking it up right now. Did you hear did you hear the story about his girlfriend? No.",
    "speaker" : "Greg",
    "timestamp" : "01:26:09-01:26:49"
  },
  {
    "text" : "Oh, maybe I didn't watch it on Johnny.",
    "timestamp" : "01:26:50-01:26:51",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:26:52-01:27:29",
    "speaker" : "Greg",
    "text" : "Oh. I watched it most. It's all about like what he's been through up to this point. Like he had like a rough childhood. F-L-E-M-L-O space raps. His girlfriend when they were in college. She's pregnant with his child. He he wasn't giving her enough attention, is that she said, and she was mad, so she went over, boiled a pot of water, and then threw it on him. Holy shit. It cut a senior season short. I bet it did. Like first degree burn shit."
  },
  {
    "timestamp" : "01:27:29-01:27:31",
    "speaker" : "Andy",
    "text" : "Yeah. God damn"
  },
  {
    "timestamp" : "01:27:31-01:27:51",
    "speaker" : "Greg",
    "text" : "And in like the core filing, she said is because he wasn't reacting to the argument that she was having with him. Oh my God. So he does everything right. He just doesn't react, doesn't react. So she's like, oh yeah? Here's some fucking boiling water. That's nuts. And apparently he didn't even react to that either when she said started."
  },
  {
    "text" : "That's a baller move. That's hardcore. Jesus.",
    "speaker" : "Andy",
    "timestamp" : "01:27:53-01:27:55"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:27:56-01:27:58",
    "text" : "Oh yeah. He just sighs deeply."
  },
  {
    "text" : "Yeah. Just walks to the emergency room. Well, all right. Yeah, I I'm with you. I think uh I think and didn't he come out and say uh he's gonna be the hardest worker Fox like Gillette Stadium's ever seen, which Fucking right, dude. Right attitude. I'm excited. As long as he doesn't go murdering people. He's uh he's uh got a tight end spot here for life",
    "speaker" : "Andy",
    "timestamp" : "01:27:58-01:28:21"
  },
  {
    "text" : "I think we still got more quarterback here though because you guys didn't go on, would you rather like draft somebody and give a bunch of draft capital, go get Trey Lance, you know, Cam Newton. Or do you want to trade? I'm ride or die. You're happy to sit Pat with Cam, Andy. Cam Newton, ride or die. That's your preferred. Who do you want at 15 then?",
    "timestamp" : "01:28:24-01:28:41",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:28:41-01:28:45",
    "text" : "I don't care. You know whatever Belgian best best available."
  },
  {
    "text" : "Like wide receiver.",
    "speaker" : "Steve",
    "timestamp" : "01:28:45-01:28:46"
  },
  {
    "timestamp" : "01:28:46-01:28:49",
    "speaker" : "Andy",
    "text" : "Tight end. I want that tight end from Florida."
  },
  {
    "text" : "Oh my god.",
    "speaker" : "Greg",
    "timestamp" : "01:28:49-01:28:50"
  },
  {
    "speaker" : "Andy",
    "text" : "Drop a pit. Mm-hmm.",
    "timestamp" : "01:28:50-01:28:54"
  },
  {
    "timestamp" : "01:28:54-01:28:56",
    "speaker" : "Greg",
    "text" : "Then I'd be on board with the fucking four tight ends."
  },
  {
    "text" : "Four tight ends, right? Yeah. Four tight ends and then I go get Mariota. Four tight ends, two quarterbacks. Okay.",
    "timestamp" : "01:28:56-01:29:02",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:29:02-01:29:32",
    "speaker" : "Greg",
    "text" : "Break the league. I think they should do stick with Cam as a starter this year and then draft like a later round quarterback. Because I just don't I don't think it's worth trading up. And then, you know, the Garoppolo's, the Brady's, the Russell Wilsons of the world, they're there if you get lucky. I'm not gonna pretend to know enough about who Would be a pick at that, but I'm sure there are guys out there that fit that like third, second, fourth round role."
  },
  {
    "timestamp" : "01:29:32-01:29:49",
    "speaker" : "Steve",
    "text" : "So you're stand pat in the draft and see if you can sign uh veteran. Andy. What about you, Steve? And I am I'm I'm an aggressive move up the board to get your guy on the quarterback side right now. What would you give up? You never have a higher pick than 15. Two first Yeah, I'll probably give yeah."
  },
  {
    "timestamp" : "01:29:49-01:29:55",
    "speaker" : "Greg",
    "text" : "Three first this year, exchange this year, next year is in the year after is all for sure."
  },
  {
    "text" : "What do you mean less than it would take to go get Deshaun or Russ? Right. If I'm gonna spend like three first and I'm gonna get the proven veteran guy who's definitely gonna work.",
    "timestamp" : "01:29:55-01:30:04",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Okay, so you're giving three first to move up to the fourth pick.",
    "timestamp" : "01:30:04-01:30:07"
  },
  {
    "timestamp" : "01:30:07-01:30:13",
    "text" : "No, no, I'm saying you give three firsts to get Deshaun or Russ. That I would even be okay with.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:30:14-01:30:15",
    "text" : "Three doesn't get Russ."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, so that's why. So like maybe give up two to go get make my move in the draft.",
    "timestamp" : "01:30:15-01:30:20"
  },
  {
    "timestamp" : "01:30:20-01:30:22",
    "speaker" : "Andy",
    "text" : "So two is the the most you give up. Two five."
  },
  {
    "timestamp" : "01:30:23-01:30:25",
    "speaker" : "Greg",
    "text" : "Yeah, but two two in an exchange, you're saying?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:30:26-01:30:29",
    "text" : "I don't know, whatever it takes to get up. Like you didn't I think it takes a lot more than you think."
  },
  {
    "text" : "Yeah. Third round pick price to get first, second, third this year, first next year. Yeah. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "01:30:29-01:30:35"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:30:35-01:30:47",
    "text" : "To get from like 15 to 7 or whatever it might be. Yeah. Yeah. Yep. To get in the top 10, it's a little it's expensive. For sure, dude. Two firsts and like some two or threes or fours or whatever, right?"
  },
  {
    "speaker" : "Andy",
    "text" : "Basically a draft this year. Yeah, whatever. Fuck it.",
    "timestamp" : "01:30:49-01:30:51"
  },
  {
    "timestamp" : "01:30:53-01:30:55",
    "text" : "I would fucking need those things anyways.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:30:55-01:30:58",
    "speaker" : "Andy",
    "text" : "They're my draft picks. I don't give a fuck. They're Bills."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:30:59-01:31:12",
    "text" : "Ain't my money that that is the I do subscribe to that theory of like oh they overpay for this guy It ain't my money. Yeah. Yeah, I get to get excited about this dude. I get to root for him. It ain't my money."
  },
  {
    "speaker" : "Steve",
    "text" : "That's why I fucking hate the Red Sox now because they trade away Mookie and they could have been it ain't my money and just paid him.",
    "timestamp" : "01:31:12-01:31:18"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:31:18-01:31:19",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "There's a salary dump was fucks.",
    "timestamp" : "01:31:19-01:31:21"
  },
  {
    "timestamp" : "01:31:21-01:31:29",
    "speaker" : "Andy",
    "text" : "Uh true. All right, boys. Yes, we have talked for a long ass time about a whole lot of nothing. Again."
  },
  {
    "timestamp" : "01:31:30-01:31:31",
    "text" : "You're good at that.",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. So unless anybody has anything pressing they want to say",
    "speaker" : "Andy",
    "timestamp" : "01:31:31-01:31:36"
  },
  {
    "text" : "Just really want to talk more with Greg about how awesome Bill Belichick is and how masterclass this will be.",
    "speaker" : "Steve",
    "timestamp" : "01:31:37-01:31:42"
  },
  {
    "timestamp" : "01:31:42-01:31:45",
    "speaker" : "Greg",
    "text" : "I think it was I think he I like what he's doing. I really do."
  },
  {
    "speaker" : "Andy",
    "text" : "Yep, me too.",
    "timestamp" : "01:31:45-01:31:46"
  },
  {
    "speaker" : "Greg",
    "text" : "I like it.",
    "timestamp" : "01:31:46-01:31:47"
  },
  {
    "speaker" : "Andy",
    "text" : "The genius.",
    "timestamp" : "01:31:47-01:31:47"
  },
  {
    "speaker" : "Greg",
    "text" : "We're all on the same page finally. Wow.",
    "timestamp" : "01:31:48-01:31:49"
  },
  {
    "text" : "Yeah. The Church of Belichick. Yes. The latter day church of Belichick. I don't know why Latter day, but okay.",
    "timestamp" : "01:31:50-01:31:58",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "And we we certainly ain't saints. The sleeveless day church of Belichick.",
    "timestamp" : "01:31:58-01:32:02"
  },
  {
    "timestamp" : "01:32:03-01:32:14",
    "speaker" : "Andy",
    "text" : "Beautiful. All right. Well until uh next week when we're back to uh regularly scheduled programming, I'm assuming, unless something else. Playoffs."
  },
  {
    "speaker" : "Steve",
    "text" : "Yes.",
    "timestamp" : "01:32:14-01:32:14"
  },
  {
    "text" : "We will see you later.",
    "speaker" : "Andy",
    "timestamp" : "01:32:15-01:32:16"
  },
  {
    "text" : "Unless that next game is the Titans 2003.",
    "timestamp" : "01:32:17-01:32:19",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:32:20-01:32:33",
    "text" : "2003. We're still in 2003. Steve McNair, co-MVP. Co-MVP, right. in the brutal cold in the arctic air of Foxboro, Massachusetts. So until then we will see you later.",
    "speaker" : "Andy"
  },
  {
    "text" : "See you later. See you later. Very naughty",
    "timestamp" : "01:32:34-01:32:38",
    "speaker" : "Mom"
  }
]