[
  {
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. You still want to listen? Go right ahead. I am not your mother.",
    "speaker" : "Mom",
    "timestamp" : "00:00-00:17"
  },
  {
    "text" : "Welcome back to the Pagers Dynasty Podcast. I'm your host Andy Brown. With me tonight Middle brother Steve Brown. Steve, how's it going? Terrible. Yeah, Greg. Baby brother Greg Brown.",
    "timestamp" : "00:23-00:36",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "00:37-00:42",
    "speaker" : "Greg",
    "text" : "This is the The funeral edition. I sh should have worn black."
  },
  {
    "text" : "The eulogy edition of the Patriots Destiny.",
    "timestamp" : "00:42-00:45",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "The eulogy test.",
    "timestamp" : "00:45-00:46"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "00:46-00:51",
    "text" : "So We're recording this kind of the week."
  },
  {
    "timestamp" : "00:51-00:52",
    "speaker" : "Greg",
    "text" : "Can I interrupt?"
  },
  {
    "timestamp" : "00:53-00:53",
    "speaker" : "Andy",
    "text" : "Well, you already have."
  },
  {
    "timestamp" : "00:54-01:01",
    "speaker" : "Greg",
    "text" : "Can I interrupt? When I when I die, can you guys do a podcast, the two of you, and talk about how much you loved me?"
  },
  {
    "text" : "What makes you think you're gonna die for me?",
    "timestamp" : "01:02-01:04",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I want to put this for a question. You don't think I'm going first? I already got the bottom of the thing.",
    "timestamp" : "01:04-01:10"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:12-01:17",
    "text" : "Yeah. The way I live my life, dude. I think Greg is the odds-on betting favorite here."
  },
  {
    "text" : "You might be right. Um yeah, I uh if if your dying wish is to have us do a shitty podcast that nobody listens to about how much or what we think of you, then yeah.",
    "timestamp" : "01:17-01:28",
    "speaker" : "Andy"
  },
  {
    "text" : "Would you like a topic list? Special guests, Greg.",
    "timestamp" : "01:28-01:31",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Um Connor. See if you can get some celebrities. You know, I'll I'll probably have a lot of like rich celebrity friends by then.",
    "timestamp" : "01:33-01:44"
  },
  {
    "timestamp" : "01:44-02:06",
    "text" : "So somebody will listen to it then. Yeah. Not for us then for the celebs. Beautiful. All right. Sounds good. Um but yeah, so we're recording this the week after the last Patriots game of 2020. Well yeah 2019 season, right? It is 20. No.",
    "speaker" : "Andy"
  },
  {
    "text" : "2021 indeed.",
    "timestamp" : "02:07-02:08",
    "speaker" : "Greg"
  },
  {
    "text" : "This year is so long and we're only seven days in. We're 2021.",
    "timestamp" : "02:09-02:13",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Currently 2021. Yes.",
    "timestamp" : "02:14-02:15"
  },
  {
    "timestamp" : "02:15-02:37",
    "speaker" : "Andy",
    "text" : "So we just finished the 2020 season. The Patriots finished seven and nine only by beating the two-win New York Jets on the last week of the season. Uh were you boys rooting for them to win and beat the Jets or lose and get a better draft position? Last week."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, I had incredibly mixed feelings because I mean think about it. When's the last time we'd been in this position? Was Like I honestly can't really remember. 2000. Yeah. Yeah. And that was, I mean, I was like 13 years old.",
    "timestamp" : "02:37-02:55"
  },
  {
    "timestamp" : "02:55-02:55",
    "text" : "Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't remember that shit. I don't know.",
    "timestamp" : "02:55-02:56",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "So far back we haven't even covered it on the podcast.",
    "timestamp" : "02:57-02:59"
  },
  {
    "speaker" : "Steve",
    "text" : "That's how and like any year they didn't miss the playoffs or whatever, they were like, it was always down the last one, so you never you've Yeah, I had to reach out to Trevor and I was like, Trevor, he's the guy at the lion stand that we had on earlier. And I was like, how do I handle this? I mean, he's the expert, you know. Um, what do we do now? Do I well I didn't I didn't did I root for the Jets to win and get a better draft pick or do I like it go with my hatred of the Jets? Uh and honestly, I it was it was felt like almost like a win-win. It was weird that's how I felt as terrible as I thought it was gonna be because I was like, well, you know, either way, either way, beat the Jets or We get a better draft pick.",
    "timestamp" : "02:59-03:44"
  },
  {
    "timestamp" : "03:44-03:46",
    "speaker" : "Andy",
    "text" : "Yeah, or we slide into that top 10 range."
  },
  {
    "timestamp" : "03:46-03:50",
    "text" : "But I feel like I did was uh I was sort of loot rooting to lose, you know?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I wasn't I couldn't do it. At at the end of the day, I I there was literally no pressure on this game, which felt weird.",
    "timestamp" : "03:51-03:58"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "03:58-03:58",
    "speaker" : "Steve"
  },
  {
    "text" : "But I was still rooting for them to win. I I couldn't root for them to lose to the the Jets. If it was anybody else, maybe, but Just because it was the Jets, I I couldn't do it.",
    "speaker" : "Andy",
    "timestamp" : "03:59-04:08"
  },
  {
    "timestamp" : "04:09-04:48",
    "speaker" : "Greg",
    "text" : "Yeah, well so but we haven't been through it with the Patriots, but we've seen Red Sox, Celtics, Bruins seasons where you're like I guess the draft isn't such a I mean, the Celtics kinda. But I mean there's a few years with the Celtics there where you were like, they're probably better off losing these games. And you're like, oh, I just want to see some Competitive. I guess that's the difference, right? Is that they should win this game, right? If they were playing the Chiefs, we'd be like, all right, they should look we want them to be competitive but still lose. Yeah. But since it was the Jets, you're like, we if we lose this is really embarrassing too. So it's like I don't want to add that on top of this already shitty season."
  },
  {
    "text" : "So yeah.",
    "speaker" : "Andy",
    "timestamp" : "04:48-04:49"
  },
  {
    "text" : "And I ain't no Doug Peterson bitch either, you know? Yeah, yeah, yeah.",
    "timestamp" : "04:50-04:54",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "That was ridiculous.",
    "timestamp" : "04:55-04:56"
  },
  {
    "timestamp" : "04:56-05:02",
    "text" : "I was surprisingly upset about that. As a third party fan.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "05:03-05:07",
    "speaker" : "Steve",
    "text" : "Were you having like fantasy on it either too? Because I know like No, nothing."
  },
  {
    "timestamp" : "05:07-05:09",
    "speaker" : "Greg",
    "text" : "I was just like, it just seemed like such a bitch move."
  },
  {
    "timestamp" : "05:10-05:11",
    "speaker" : "Steve",
    "text" : "Such a bitch move, yeah. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I agree. And especially when these coaches like the f the fact that the the Giants were so upset about it I was like, I I understand where you're coming from, but also you only won six games. Like you didn't deserve to be in the playoffs. So the fact that you're like bullshit that they they're the ones that kept you out is like win seven games in a season.",
    "timestamp" : "05:12-05:34"
  },
  {
    "text" : "Yeah, I know sympathy for Giants fans, but at the same time, like it what pissed me off is like all these coaches always like talking postgames about the culture and like we play to win, we play to win. And he even did it after the game. And you always kind of know that it's a bit bullshit. And this just brought it to light that it's complete bullshit. He doesn't give a he doesn't give a shit.",
    "timestamp" : "05:34-05:54",
    "speaker" : "Greg"
  },
  {
    "text" : "No, you know the players on his roster. Like, how are those guys gonna show up the next year and play for that guy? It's like I guys, I need you to leave it all in the field. Like, why? Leave it all in the field. Yeah. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "05:54-06:03"
  },
  {
    "timestamp" : "06:04-06:11",
    "speaker" : "Andy",
    "text" : "And this was this was the coach that was supposed to be the one that unceded Bill Balichek after you beat him in the Super Bowl."
  },
  {
    "speaker" : "Steve",
    "text" : "The one in the line of the ones.",
    "timestamp" : "06:11-06:14"
  },
  {
    "text" : "There's always one. And the only one I think who's actually maybe given that some credence is Andy Reed. Anybody else in this 20-year reign that you thought, yeah, no, he could be the next guy? Maybe Jim Harbaugh for a while? John Hardy.",
    "timestamp" : "06:14-06:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "06:32-06:39",
    "text" : "McVeigh, like the wonder kid. I was impressed by that Rams game this year. And Belchuk seemed to really like him."
  },
  {
    "text" : "Yeah. But he lost a Super Bowl. To bellot check, then like that kind of excludes you, right? Although I I say that after saying Andy Reed, yeah. Maybe not.",
    "timestamp" : "06:40-06:52",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. Tomlin, he's quietly put together a pretty good career. Except the Jaguars were.",
    "timestamp" : "06:52-07:00",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "But he was so up and down too. Yeah. He was either beating the pigeons in the Super Bowl or going like four and twelve. Yeah. And there was no middle ground. Tony Dungey, maybe? Tony Dungey never really felt like he had a ton of success against the Patriots, though.",
    "timestamp" : "07:00-07:13"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "07:13-07:15",
    "text" : "No, it was always more attributed to Peyton Manning, too."
  },
  {
    "timestamp" : "07:15-07:16",
    "speaker" : "Andy",
    "text" : "Like their success."
  },
  {
    "timestamp" : "07:17-07:18",
    "text" : "Adam Gase.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "07:20-07:48",
    "speaker" : "Andy",
    "text" : "Easy tiger. So yeah, so this is a podcast, uh a eulogy podcast, where my brothers wanted to do Well something all right, Steve. This is Steve's suggestion. Yeah, one to do a podcast about the end of the Patriots dynasty. But I think that begs the question. Is the dynasty officially over?"
  },
  {
    "speaker" : "Steve",
    "text" : "I think it's a conclusive yes. We've already had this discussion, I feel like, on this podcast.",
    "timestamp" : "07:48-07:54"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "07:54-08:05",
    "text" : "But if they figure it out next year, get to the AFC Championship game, does that not continue it? No, that's a totally new thing."
  },
  {
    "text" : "The dynasty has to be associated.",
    "timestamp" : "08:06-08:07",
    "speaker" : "Steve"
  },
  {
    "text" : "Right. I don't know, dude.",
    "speaker" : "Greg",
    "timestamp" : "08:10-08:11"
  },
  {
    "timestamp" : "08:11-08:42",
    "text" : "What if they bring back like Jimmy G and you can't just like have a oops uh miss the playoffs and go seven and nine year. It's not a dynasty Sure you can. No. The Patriots did it in 2008. Making the playoffs. Winning the AFC East. Winning seasons, 10-win seasons. We haven't had a 10 uh less than 10-win seasons since 2000.",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh two thousand two, they went nine and seven.",
    "timestamp" : "08:43-08:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I would went ten and six, no I think that's nine.",
    "timestamp" : "08:47-08:51"
  },
  {
    "speaker" : "Greg",
    "text" : "Nine win seasons. Whatever. Fuck it. I'm on board, Steve. I'm with you.",
    "timestamp" : "08:51-08:55"
  },
  {
    "text" : "I mean this is a pretty clear line of sand because Belichick's gotta rebuild the whole thing up too. Like there's a whole like I think a lot of the guys that have been around are gone. I don't think Julian comes back. I don't I don't think Steph comes back and it's gonna be handed over to the young guys and it'll be a whole new crew. I wouldn't be maybe like McCourty is the only one who really hangs over.",
    "timestamp" : "08:55-09:14",
    "speaker" : "Steve"
  },
  {
    "text" : "Well, as the optimist of the podcast, I'm going to disagree. I think this is a blip. I think this is a 2008. Like, yeah, I am it's the playoffs, whatever. Fuck it, reload next year. Back on top of the AFC East. And uh I think I did this wrong.",
    "timestamp" : "09:16-09:38",
    "speaker" : "Andy"
  },
  {
    "text" : "What makes you believe that? Blind all right.",
    "timestamp" : "09:38-09:41",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "09:41-09:46",
    "text" : "We also have Andy on record going 12 and 4 was the Patriots record this year.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "09:47-09:55",
    "speaker" : "Andy",
    "text" : "I th I think I I think I was the the lowest win total this year out of all of us. I think Greg said 16 and oh"
  },
  {
    "speaker" : "Greg",
    "text" : "Well yeah, but that was being facetious.",
    "timestamp" : "09:56-09:59"
  },
  {
    "timestamp" : "10:02-10:06",
    "text" : "Either way, none of you pick six wins, so tell me the truth though, Andy.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:06-10:16",
    "text" : "Are you saying that like as a uh a fan or are you saying that as a logical human that's looking at it from an objective view?"
  },
  {
    "text" : "I don't think you can be both",
    "timestamp" : "10:16-10:17",
    "speaker" : "Andy"
  },
  {
    "text" : "I think you can I'm glad you're admitting that about yourself.",
    "timestamp" : "10:18-10:21",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "10:21-10:22",
    "speaker" : "Andy",
    "text" : "I'm admitting about all of us."
  },
  {
    "text" : "I don't I don't think any of you are you don't know shit about football is what you're telling me. So you are just helpers. All your opinions are are completely moot.",
    "speaker" : "Greg",
    "timestamp" : "10:23-10:32"
  },
  {
    "speaker" : "Andy",
    "text" : "All opinions are moot. Fuck out of the way. I've cornered you, Andy. You have not. As a fan, I'm allowed to have optimism. And I'm allowed to share.",
    "timestamp" : "10:35-10:48"
  },
  {
    "text" : "I am not like, don't get me wrong, it's not like I have no optimism, but I do think that that dynasty with the Belcheck and Brady Bill and Lent on that big ass run for twenty years. That is its own thing now. And whatever happened even if we do go back and win the Super Bowl next year, that'll be a different dynasty. I'll do that. They win the next five Super Bowls. That'll be a different dynasty.",
    "speaker" : "Steve",
    "timestamp" : "10:49-11:12"
  },
  {
    "text" : "But what if they just win the one more? You're not going to tack that onto this dynasty?",
    "timestamp" : "11:12-11:16",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Then it wouldn't be an it wouldn't be a second dynasty. It would just be a an a winning season, just like the Eagles had, right?",
    "timestamp" : "11:16-11:24"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, well the Eagles having coming off already had two dynasties. What? I think we already had two separate dynasties. I think the the early years where the defense was leading the charge. I think that's one dynasty. And then the the post oh eight where it was like a completely different like approach to the game. I think those were, in my opinion, two separate dynasties.",
    "timestamp" : "11:24-11:49"
  },
  {
    "timestamp" : "11:49-11:50",
    "text" : "I agree. Yeah.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "So I think you if you start over with a fresh quarterback, to me that's definitely a line of like, okay, this is a new thing now.",
    "timestamp" : "11:51-11:57"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "11:57-12:07",
    "text" : "Yep. And like those two dynasties definitely existed as two dynasties, but they're tied together because same quarterback, same coach. Yeah the same sort of system."
  },
  {
    "timestamp" : "12:08-12:13",
    "speaker" : "Andy",
    "text" : "That's literally the only two people that were part of both of them, right?"
  },
  {
    "text" : "How many how many players won 2004 Super Bowl and then the 2000 and",
    "speaker" : "Steve",
    "timestamp" : "12:13-12:18"
  },
  {
    "timestamp" : "12:19-12:39",
    "text" : "Dante Skarnecchia. Yeah. He's he's part of the fucking the 1985 Super Bowl team. I think he was. Did he start like 83 or something ridiculous? Something something ridiculous like that. He's gone? So the dynasty's over because he's not here. That's a hot tip. That's true.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "12:40-12:55",
    "speaker" : "Steve",
    "text" : "But like Cassero's gone now too. He's been there for 20 years. I would I would be willing to bet that Joshua Daniels Gets a head coaching offer and leaves as well. Doesn't sound like it, but maybe. The Chargers, maybe?"
  },
  {
    "text" : "Maybe. But I yeah, I don't know. I'm not ready to call it over yet because I'm thinking maybe from the stance of the podcast of when do we stop doing this? And I think if they continue to be good next year onwards, I don't think we're gonna be like stop doing the podcast because the dynasty's over.",
    "speaker" : "Andy",
    "timestamp" : "12:55-13:17"
  },
  {
    "timestamp" : "13:18-13:21",
    "text" : "And are you really thinking like forty years in the future?",
    "speaker" : "Steve"
  },
  {
    "text" : "Uh at this point it will be forty years at the rate we record episodes, but yes.",
    "timestamp" : "13:22-13:26",
    "speaker" : "Andy"
  },
  {
    "text" : "Can we do the math here?",
    "speaker" : "Steve",
    "timestamp" : "13:28-13:29"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "13:29-13:47",
    "text" : "I mean this question will be I I think I did the math and it was three hundred and sixty two games or something before this this season. Um so if it ended at the end of twenty nineteen That was that many weeks was what like up six-ish years, six and a half years?"
  },
  {
    "text" : "Yeah, no, that would be a good one. So we do an ep a recording two out of every three weeks too because we ain't gonna stick in the I ain't gonna talk to you guys every week for the rest of my fucking life. Can't handle that. Cool The only reason we're doing this is because we're locked down. This is true. I feel like I'm on a little trip right now, but I'm sitting in my goddamn bedroom.",
    "timestamp" : "13:48-14:09",
    "speaker" : "Steve"
  },
  {
    "text" : "Put your seatbelt on, Stevie.",
    "timestamp" : "14:12-14:14",
    "speaker" : "Greg"
  },
  {
    "text" : "Nicely done.",
    "timestamp" : "14:20-14:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, for those listening, Steve just secured his seatbelt.",
    "timestamp" : "14:21-14:24"
  },
  {
    "text" : "He's pantomime just putting a seatbelt on.",
    "speaker" : "Andy",
    "timestamp" : "14:24-14:26"
  },
  {
    "text" : "Click.",
    "timestamp" : "14:26-14:27",
    "speaker" : "Greg"
  },
  {
    "text" : "Is that good? Oh wait, I got you.",
    "timestamp" : "14:28-14:32",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "14:35-14:38",
    "text" : "Sounds like you're from your baritone days, Steve.",
    "speaker" : "Greg"
  },
  {
    "text" : "Mm-hmm. Oh shit. That was me from my trombone days, baby. That's true.",
    "speaker" : "Andy",
    "timestamp" : "14:38-14:42"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh, we're all horn players, huh?",
    "timestamp" : "14:42-14:44"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:44-14:45",
    "text" : "Yeah, we all we're all the best."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "14:48-14:50",
    "text" : "What do you mean where did I play?"
  },
  {
    "speaker" : "Andy",
    "text" : "Did you play an instrument? He played a trumpet.",
    "timestamp" : "14:49-14:51"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "14:52-14:56",
    "text" : "I was the best I was the best fucking trumpet player in the tri-state area. That's not true."
  },
  {
    "timestamp" : "14:58-14:59",
    "speaker" : "Andy",
    "text" : "Not a chance."
  },
  {
    "text" : "I used to sit at the vacuum and not actually play it but press the buttons on the top. That's part of a maritime. And just be like, please Yeah, please don't fucking they used to like pick people randomly to like play to get the tune, be like, okay, play a B flat or whatever. And I'll be like, just please don't pick on me. Please don't pick on me.",
    "speaker" : "Greg",
    "timestamp" : "15:01-15:21"
  },
  {
    "text" : "You can't you can't fake that with a trombone. Because if you're doing the opposite thing of everybody else, it's blatant.",
    "speaker" : "Andy",
    "timestamp" : "15:22-15:30"
  },
  {
    "text" : "You can fake it like a motherfucker with the baritone. No one knows. It's not so noises anyways, you know?",
    "timestamp" : "15:30-15:39",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Well d didn't dad write about that in the Christmas letter about how you uh you used to approach all the songs as a race and you would always finish first?",
    "timestamp" : "15:39-15:46"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, that's a bold-faced lie, but half those Christmas letters are bold-faced lies, so you know, he definitely embellished it.",
    "timestamp" : "15:46-15:52"
  },
  {
    "speaker" : "Andy",
    "text" : "Whatever helped you sleep tonight, Steve. That's great.",
    "timestamp" : "15:54-15:57"
  },
  {
    "text" : "Steve's just finishing off halfway through the song. What are you guys doing?",
    "timestamp" : "15:58-16:05",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "16:05-16:11",
    "text" : "Stands up and walks out. I finished. I don't know what you guys are still doing. Leave the baritone behind.",
    "speaker" : "Andy"
  },
  {
    "text" : "Take the mouthpiece with me.",
    "timestamp" : "16:11-16:13",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "16:14-16:15",
    "speaker" : "Andy",
    "text" : "Oh shit."
  },
  {
    "text" : "Yeah. All right. Let's operate under the assumption that this dynasty is over, okay? Okay. For the purposes of this episode, even if we have a disagreement.",
    "speaker" : "Steve",
    "timestamp" : "16:16-16:30"
  },
  {
    "text" : "Okay. I I alright, I'll I'll give you that. So if you want to do that, would would either of you like to to say some words? Anything you'd like to To get off your chest? No.",
    "speaker" : "Andy",
    "timestamp" : "16:30-16:41"
  },
  {
    "text" : "Yeah, I I just want to I just want to say that like an underrated part of the Patriots being so good is having something to live for as a fan. Yes. Or a person. You know? Like because life sucks, right? And life sucks even more now because like Social media blows, everything sucks, can't go nowhere, can't see friends, family. And just having like in the back of your head, I'll just get through till Sunday. Cause it's the Pats on Sunday. You plan your week around it, you listen to podcasts, you watch TV, you watch YouTube, and you're all just getting hyped up all week for these big games. And they did they gave that to us for fucking 20 years. 20 years every single year for 20 years when this time of year came around. And it's the worst time of the year, like after New Year's. Absolutely. Every year they gave us weeks and weeks and weeks of meaningful let's get through this week by waiting for the game on Sunday. A meaningful. And it didn't even matter how the game went. Even though the games look great, but just the fact of that lead up of getting yourself hyped and like reading about it and thinking about it, that's worth More than anything. They want to always deliver it. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "16:41-18:05"
  },
  {
    "text" : "Be it a win or a loss, the games are always like exciting. I can only imagine a couple.",
    "timestamp" : "18:06-18:12",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, they didn't their their biggest Super Bowl margin of victory was the most recent one. Yeah. And what was the score of that?",
    "timestamp" : "18:12-18:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "18:20-18:22",
    "text" : "10-3 or something shit like that."
  },
  {
    "timestamp" : "18:23-18:30",
    "text" : "Right. 13-3. 13-3. They won by 10 points. Yep. And that was all our garbage time field goal basically.",
    "speaker" : "Andy"
  },
  {
    "text" : "That listen what if we do a fair bit of bests and worsts? And that was Greg's best about being a fan. What's been your worst part about being a fan through all this, Greg?",
    "timestamp" : "18:30-18:40",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "18:43-19:23",
    "text" : "Uh I guess it's kind of like a double sided coin there, right? Where it's It also it's like draining to a certain degree of this always like there is something refreshing about this year of like I can watch a full weekend of football. And not give a shit. You know, I can go golf this weekend and just be like, I don't care. I don't have to fucking schedule around a football game, you know, which is it's kind of nice. I mean I wouldn't want to do it every year, but to have a year off where it's like, okay, I can just sit and relax without being like, well, I hope the Patriots play first so we can get that game out of the way and I can enjoy the rest of them, you know? I remember thinking that every year."
  },
  {
    "text" : "Off of off of that, I've enjoyed this season because I decided after the Chiefs game I wasn't staying up for night games anymore. And I've slept so much better this season because they play so many like prime time games. Especially like the last few years too for some reason. It's always like a Sunday night or a Monday night. And my My week gets wrecked because I'm fucking old and I need my eight hours. So if I don't get that, I'll wreck for the week. So I've just decided this year that I'm Not gonna watch the game live if it's a night game and I'll just wake up early and watch it the next day. Sure. But I got to I got to not have to watch the Bills game because I woke up and Happened to see the score before I turned it on and thought, meh, that's that's not worth it to me.",
    "speaker" : "Andy",
    "timestamp" : "19:24-20:08"
  },
  {
    "timestamp" : "20:09-20:23",
    "speaker" : "Steve",
    "text" : "So I didn't watch the just to recap, Andy, the worst part about being a fan for you is staying up late to watch the exciting games. Okay, just making sure. And what was the best word about being a fan, Andy? That's bad as a gable content."
  },
  {
    "speaker" : "Greg",
    "text" : "As bad as it gets. But I've already had my warm glass of milk, and then they go to overtime.",
    "timestamp" : "20:24-20:32"
  },
  {
    "timestamp" : "20:33-20:46",
    "speaker" : "Andy",
    "text" : "Bro, I go to bed at fucking nine o'clock nowadays. Cool. So games that go on till midnight? That's three hours past my bedtime. Like fuck that noise. What's your best thing?"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "20:46-20:52",
    "text" : "What's give us your best part about being a fan? The one o'clock games or What one o'clock games?"
  },
  {
    "text" : "They don't play one o'clock games",
    "speaker" : "Andy",
    "timestamp" : "20:52-20:54"
  },
  {
    "timestamp" : "20:55-20:58",
    "speaker" : "Steve",
    "text" : "Complaining about complaining about the rest? Is that your best?"
  },
  {
    "timestamp" : "21:00-21:20",
    "speaker" : "Andy",
    "text" : "My best is that we have so much content to go through because it has been 20 years. And I think also underrated that nobody really talks about is I feel like the success of the Patriots has elevated the other sports teams in Boston."
  },
  {
    "timestamp" : "21:21-21:21",
    "text" : "Sure.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "21:22-21:31",
    "text" : "Like when before 2001, how many championships had we seen in our lifetime? Any? Well like across the sports.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "21:31-21:34",
    "speaker" : "Steve",
    "text" : "No, no, yeah, none I can think of. Right."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "21:34-21:42",
    "text" : "But as soon as the pages started winning on a regular basis, now all of a sudden There's this focus on excellence for all the other sports too. So we've seen now."
  },
  {
    "timestamp" : "21:42-21:43",
    "speaker" : "Greg",
    "text" : "You think so?"
  },
  {
    "timestamp" : "21:45-21:48",
    "speaker" : "Steve",
    "text" : "I think Abe's right. I think there has been at least more pressure on them to also be good."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "21:48-21:48"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "21:48-21:51",
    "text" : "Because th this was never uh a Patriots town."
  },
  {
    "timestamp" : "21:51-21:58",
    "text" : "This was always either like a Red Sox like a Red Sox town because they were the Cubs and because they'd never fucking won. Which not a great look.",
    "speaker" : "Andy"
  },
  {
    "text" : "You're telling me there was no pressure to succeed on the Red Sox before the Pats won? No, not that, but the pressure was amplified.",
    "speaker" : "Greg",
    "timestamp" : "21:59-22:05"
  },
  {
    "timestamp" : "22:06-22:10",
    "speaker" : "Andy",
    "text" : "Yeah. Maybe maybe the Red Sox are on a great example with the other two teams, I think."
  },
  {
    "timestamp" : "22:10-22:16",
    "speaker" : "Greg",
    "text" : "I don't know. I feel like a professional organization's always trying to win, especially in like a sports crazy town. Yeah."
  },
  {
    "text" : "And it spread it from just the Red Sox to it it definitely spread the fandom out because it was so focused on the Sox and",
    "timestamp" : "22:21-22:27",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "22:27-22:27"
  },
  {
    "timestamp" : "22:28-22:39",
    "speaker" : "Steve",
    "text" : "And it seemed like you went from the Celtics to the Bruins to the Sox, right? And those are like those are sort of the focus. And then this is, you know, pages for the good ones. And now everyone cares about everything a little a lot more. Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "That might be something too, like thinking you can win games. Yeah. You know?",
    "timestamp" : "22:41-22:47"
  },
  {
    "timestamp" : "22:47-22:48",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "22:48-22:52",
    "text" : "And just like having that expectation when you come to Boston that this is."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "22:53-22:53"
  },
  {
    "text" : "When you come to a Boston team, you're expected to win.",
    "timestamp" : "22:53-22:56",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "22:57-23:01",
    "speaker" : "Greg",
    "text" : "Right. I could see that I guess."
  },
  {
    "text" : "All right, my best is I mean despite outside of the obvious is I lived in DC for a lot of this. what 14 years or so and just all the shit talking ammo is given me. Just, you know, because at some level I've built my brand around being a Patriots fan like at work and with my friends and stuff like that. So yeah, you got the flip side of that coin is whenever like this season I've been getting a lot of shit back. But for the first 14 years, you know, people like, oh, who do you think about that Patriots game last night? And I was like, dude. Just wake me up when it's an AFC Championship game. And you would almost always be right. We always get there and then it's like they're like, I hate you so much. And like are they talking about regular season football? Like, yeah, whatever, it doesn't matter until the AFC Championship.",
    "speaker" : "Steve",
    "timestamp" : "23:01-23:52"
  },
  {
    "timestamp" : "23:52-23:57",
    "speaker" : "Andy",
    "text" : "And we win it every other year. Yeah. The AFC Championship we win every other year."
  },
  {
    "text" : "It was uh it was cool to just, you know. Just robbing people's faces. Wicked man over and over again for years and years and years.",
    "timestamp" : "23:57-24:05",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "24:05-24:08",
    "text" : "You are you are verbalizing why people hate Patriots."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "24:10-24:20",
    "text" : "I think we all are. Oh, it it's really nice to get through the winter with meaningful games to watch. Every fucking year. Yeah."
  },
  {
    "timestamp" : "24:21-24:29",
    "speaker" : "Greg",
    "text" : "For the last twenty persona his brand is created on Oh yeah, I don't care about regular season games."
  },
  {
    "text" : "Yes. Steve Brown as if Barstool Sports was an actual person.",
    "speaker" : "Andy",
    "timestamp" : "24:29-24:38"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. But just living in a different city too. Doesn't matter. Uh I'm trying to think of the worst part. I don't have anything that like really jumps out, but You know, a lot earlier, less so now, but like it used to look kind of like when we lose the big game, you're gonna fuck me up emotionally, you know I think because I staked a fair bit of my personality to that team and how they did and especially that Giants Super Bowl we lost, like that shit fucked me up for like a week. And like my I was just like I was emotionally too tied to the team and like it just had a little much a little bit too much control over just how my life was going and I had to like I had to manage that and I I learned to manage that as I got older but For a while there. It was bad. Oh yeah.",
    "timestamp" : "24:38-25:32"
  },
  {
    "timestamp" : "25:32-25:33",
    "speaker" : "Andy",
    "text" : "And Greg can attest to help."
  },
  {
    "timestamp" : "25:33-25:41",
    "text" : "See, I can Yeah, I can do it post-game now. Like during the game, I still get very heated.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "25:42-25:42",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "25:42-25:55",
    "text" : "Well, it depends on especially if I'm watching with people that don't give a shit or whatever. But as soon as the game ends, I can move on really quickly now. But mid-game. I'm not. I'm a fucking nightmare."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "25:55-26:36",
    "text" : "Well, there's that that Super Bowl, the Atlanta Super Bowl, was probably the the peak of that. The end game. We were at a bar in DC, which was full of Patriots fans, which is awesome. But I had my friend there and my girlfriend at the time. Who didn't really know each other and it comes at halftime and I tell him to take her home to get Were either of them football fans? Nah, Steve is a big Steelers fan. She was a Redskins fan. And I'd said just Steve, take her home. Yeah. I'll just get these fuckers out of here."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:37-26:38",
    "text" : "No way you see this."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "26:38-27:00",
    "text" : "No, yeah, you know, that was my thought process. I was like, they don't need to see this meltdown. Um But it was uh I definitely got shit for that. Because then they got home and turned it on, the babies came back and won. But but in my defense, maybe we don't win if I don't send those fuckers home and get them out of that environment. You know, maybe I needed to be surrounded by all Patriots fans."
  },
  {
    "timestamp" : "27:02-27:09",
    "speaker" : "Andy",
    "text" : "Yeah, I haven't watched a Patriots Super Bowl with other people since the Giants Super Bowls. So you're welcome."
  },
  {
    "timestamp" : "27:10-27:30",
    "speaker" : "Greg",
    "text" : "Well that kind of takes the fun out of it, Andy. You gotta watch it with some people. I try to I get over. You gotta f Yeah, you gotta watch it with people who care as much. Because that's what drives me crazy is when people are like, Why are you so upset? It's like it's like telling a woman they're crazy or they're acting crazy. Like it's just some shit you don't say."
  },
  {
    "speaker" : "Andy",
    "text" : "That's an apt analogy, actually. For all of you gentlemen out there who who want to know what your your significant other is feeling. When you say why you why you acting crazy. Just think about those those Patriots Super Bowls. And think about the person who's like, I don't understand why you're getting upset. They're only losing. Whatever. It's just a game.",
    "timestamp" : "27:31-27:56"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, there's a lot of hormones running through me right now, okay? That time of the football season.",
    "timestamp" : "27:56-28:03"
  },
  {
    "text" : "That time of the season.",
    "speaker" : "Steve",
    "timestamp" : "28:05-28:07"
  },
  {
    "text" : "Oh my god.",
    "speaker" : "Andy",
    "timestamp" : "28:07-28:08"
  },
  {
    "text" : "All right. Let's do uh maybe best and worst, like player coach moment or something, one of those things.",
    "speaker" : "Steve",
    "timestamp" : "28:09-28:15"
  },
  {
    "speaker" : "Andy",
    "text" : "Well I just wanted to to add on. I I think um off of Greg's point, I think Another best is the fact that we've got to watch 41 extra games than like most other teams. Because they have had over the 20 years 41 playoff games. in 20 years. So we get at least two extra games on average every season, which is bananas. And also they've won 73% of them, which is fucking.",
    "timestamp" : "28:15-28:47"
  },
  {
    "speaker" : "Steve",
    "text" : "And those are the best games. Those are like the cream of the crop games. Yeah.",
    "timestamp" : "28:47-28:51"
  },
  {
    "timestamp" : "28:51-29:05",
    "speaker" : "Andy",
    "text" : "Like meaningful games in a time where It's fucking cold, it's dark out, it's like weather sucks, work sucks. You're fucking you're in debt because you spent too much money over the holidays buying people shit."
  },
  {
    "timestamp" : "29:05-29:06",
    "speaker" : "Greg",
    "text" : "Yeah, you're not going to be able to do that."
  },
  {
    "text" : "But like, and then also the the other edge of that sword is that I and we've kind of touched on this before, at least I have. Um you have that expectation every game. So watching the games, uh and we it Steve talked about this a bit for this season where it's not there anymore, but Like you go in expecting them to win every game. And so to Greg's point, like if they're not winning, or they're not winning the way the Patriots should be winning, or they're not playing the Patriot way this game. It's super frustrating. And a lot of the games I felt like even regular season games were like frustrating until the end when they won, you know? 'Cause it's like, well, they should be beating the Dolphins by two touchdowns and they're only winning by three up until the fourth quarter. It's like, what the fuck is going on?",
    "timestamp" : "29:12-29:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "What the fuck? Yeah.",
    "timestamp" : "29:58-29:59"
  },
  {
    "timestamp" : "29:59-30:50",
    "speaker" : "Andy",
    "text" : "Yeah, exactly. And and and then like st you were talking about, Steve, when The Patriots would lose one of those random games. You just get like so we we don't know how to deal with losses, which is again the reason why everybody hates us. But When they do lose, they're not supposed to lose because they don't ever do it. And so you kind of go into the game with that mentality as well. And so I felt watching games, like regular season games anyway, got to be like almost draining for a while But it was worth doing it because you knew they were gonna win 12 of these every season. So you may as well like stick it out till the end because it's Brady and no matter how they're playing, they're gonna have a chance at the end. But like if they didn't get over that hump at the end, you're like, what the fuck?"
  },
  {
    "timestamp" : "30:51-30:54",
    "text" : "The season doesn't start the championship game. I already said that.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "30:54-31:05",
    "speaker" : "Greg",
    "text" : "That was sneaky why 07 was so awesome because you had high expectations and then they went in and like created it and just shit stomped. everybody in their own."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:12-31:16",
    "text" : "Which is why the 07 Super was so shattering."
  },
  {
    "text" : "Oh yeah yeah.",
    "timestamp" : "31:15-31:16",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "31:19-31:23",
    "text" : "That's like fucking speaking of worse. Yeah."
  },
  {
    "timestamp" : "31:24-31:32",
    "speaker" : "Andy",
    "text" : "Oh, so all right. So yeah, so so to Steve's point, let's do um let's do best and worst. Let's start with games, since we're on the topic already."
  },
  {
    "timestamp" : "31:32-31:35",
    "speaker" : "Greg",
    "text" : "What's well then the Super Bowl can't be part of the worst then."
  },
  {
    "speaker" : "Andy",
    "text" : "Well, uh, we could do uh best and worst playoff games and regular season games.",
    "timestamp" : "31:36-31:40"
  },
  {
    "text" : "Well let's just do you can't do that one Super Bowl. All right, that's fair. No soup no Super Bowls. Those are too easy.",
    "timestamp" : "31:40-31:46",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, that's true. Yeah. I I I think those are a given. The best is the Atlanta Super Bowl or well any of the Super Bowls or any of the Super Bowl wins and the worst the Super Bowl losses.",
    "speaker" : "Andy",
    "timestamp" : "31:47-31:56"
  },
  {
    "timestamp" : "31:56-31:59",
    "text" : "Super Bowls are out of out of contention here.",
    "speaker" : "Greg"
  },
  {
    "text" : "Alright. So give me your best game, Greg.",
    "timestamp" : "31:59-32:01",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "It's like a Sophie's choice with Super Bowls, you know? Like how am I gonna pick between my children? Like they're all so beautiful and I love them all so much and I want them all to do well in life. By children you mean brothers, right? I meant by Super Bowl victories.",
    "timestamp" : "32:01-32:20"
  },
  {
    "text" : "All right. So let's see if get uh Greg, give me your your your best game that's not a Super Bowl.",
    "timestamp" : "32:23-32:28",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean, I think you know what that game is. I think I do, but I want to do that. I've said it multiple times in this podcast. The snowball against the Raiders is It it might be the best game. Again, it's hard to vote against the Super Bowl, but I think just where where when it occurred within the dynasty, the last game at Foxboro, the snow, the basically like Everyone like making like this is their coming out party for like a bunch of players. The just the environment, the fucking retro of it. It just was just a fucking beautiful. It's football. That's football. Yeah. You know. Yeah. I agree. Like even the the Super Bowl against the Falcons, like that was like Ye That was like a track meet. Yeah, it was a track meet where it's like the the snowball was like that's fucking football.",
    "timestamp" : "32:28-33:20"
  },
  {
    "text" : "And even that last drive that we never really remember where they they went for it on fourth down so they could get a closer",
    "speaker" : "Andy",
    "timestamp" : "33:20-33:27"
  },
  {
    "timestamp" : "33:27-33:39",
    "speaker" : "Greg",
    "text" : "field goal like all like everybody was just yeah and everyone like gets up from being tackled and they're just their face masks full of snow it's just This is just the coolest visuals ever."
  },
  {
    "text" : "And there's there's uh what David Patton catching every single pass on his knees.",
    "speaker" : "Andy",
    "timestamp" : "33:39-33:43"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "33:43-33:44",
    "text" : "Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Because he can't stand like a foot and a half of snow. It's like",
    "timestamp" : "33:44-33:47"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "33:47-33:47",
    "text" : "Yeah."
  },
  {
    "timestamp" : "33:47-33:49",
    "text" : "Brady's spiking the ball and falling over.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Is it that same like When you like think about the old old school NFL games, like the Ice Bowl and like they're always like crazy weather makes like a an okay game like you know legendary and that one was both the crazy weather but like an actual legendary game where Venateri was kicking you know, hard field goals in perfect weather in the middle of a blizzard. Yeah.",
    "timestamp" : "33:49-34:13"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "34:14-34:24",
    "text" : "Yeah. And the fans too. Like you talk about Patriots fans being kind of spoiled. Like I you could just watching that game, like the shots I showed of the crowd, like Those were not spoiled fans."
  },
  {
    "timestamp" : "34:24-34:30",
    "speaker" : "Andy",
    "text" : "There's like shirtless dudes shit-faced throwing snowballs at uh at Phil Sims."
  },
  {
    "text" : "Yeah, that that have a two hour wait till they can get out of the parking lot after the game. Yeah.",
    "timestamp" : "34:31-34:36",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "34:36-34:39",
    "text" : "Not getting home till three AM so they gotta be at work the next morning.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:39-34:42",
    "speaker" : "Greg",
    "text" : "That's without the snow. Imagine how long it took to get home that night."
  },
  {
    "timestamp" : "34:43-34:52",
    "text" : "No, that's what I'm saying. Yeah. I can hold till 2-3 a. m. Ridiculous. Alright, so that's your best game. Do you have a worst?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:55-35:01",
    "speaker" : "Greg",
    "text" : "You guys do your best and then I'll I'll think I'll think through. I have one I do have one in mind. All right, see give me your best."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:02-35:36",
    "text" : "No, we'll do best first. Uh mine is the Elementadola game Oh yes. Playoff game against the Ravens. That's a great not only did it have a two 14-point comebacks. Ravens are wicked good at that point. It also had the learn the rule book bitch from Brady to to Harva. And it was just like and they pulled that shit on them. It was like and they were just like you can tell the Patriots that was like That was almost like as as hard fought as a Super Bowl that year because they were just like pulling all the stops. They were just fucking going hard."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "35:36-36:08",
    "text" : "Yeah. And it was like it came off the heels of that long, like Super Bowlist streak where we're we were wondering if they were gonna ever get one more. Yeah. And it was like Oh, the Ravens, they we should beat them, but they kind of have our number to, but is it real? And then they're the one team that's not scared to come in uh to Gillette and give you the business. Yeah. Uh-huh. And then we come back and we're like, all right, back in it. And then immediately go down 14 again. You're like, what the fuck, dude?"
  },
  {
    "speaker" : "Andy",
    "text" : "And then they come back again. You're like, oh, this is it's destiny now.",
    "timestamp" : "36:08-36:11"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "36:11-36:16",
    "text" : "That one was really satisfying. Really satisfying. Really satisfying."
  },
  {
    "timestamp" : "36:17-37:15",
    "speaker" : "Andy",
    "text" : "I'm torn, I have to say. I think I would probably go with the game after Greg's The 0-1 AFC Championship game against the Steelers. Because you have the Troy Brown blocked field goal lateral, which is probably the most Troy Brown play ever. You have Brady going down, Bledsoe coming in, and throwing the game-winning touchdown. After everything he's been through. And the fact that they were such underdogs that at the beginning of the game, Gil and Gina were like, oh, uh, even though everybody's expecting them to lose, the Pagers have actually shown up to this game and will play tonight. Like there were such underdogs that everyone's like I like there's always all this talk about Steelers fans booking their tickets to to uh wherever it was, uh what was the game?"
  },
  {
    "speaker" : "Steve",
    "text" : "It was in uh New Orleans.",
    "timestamp" : "37:15-37:16"
  },
  {
    "timestamp" : "37:18-37:54",
    "text" : "Yeah. They're all booking their flights already because they're it's basically a done deal. Um and a Troy Brown punt return. And the Troy Brown punt return for touchdown too. And the Troy Brown block field goal. Yeah, exactly. So just all of all of it. I think. And it felt like that was such a prototypical Patriots beating a team that's probably better than them. That you saw in that, if you want to call it the first dynasty, they had a bunch of those where they played above maybe their skill level as a team to beat a better team than them.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "37:55-38:12",
    "text" : "And it's like the it was validation of like that Belichick theory of all three phases of the game where like everybody knows special teams. Doesn't fucking matter. Logically doesn't matter. And then in the AFC championship game, that would be a good thing.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "38:13-38:16",
    "speaker" : "Andy",
    "text" : "You have a putt return for a touchdown and a block field goal return for a touchdown."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "38:16-38:17"
  },
  {
    "text" : "Uh-huh.",
    "timestamp" : "38:18-38:19",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "38:19-38:22",
    "speaker" : "Andy",
    "text" : "Honorable mention score one offensive touchdown from your background."
  },
  {
    "speaker" : "Steve",
    "text" : "Honorable mention is the uh Jonas Gray game. The Jonas Gray game.",
    "timestamp" : "38:22-38:27"
  },
  {
    "timestamp" : "38:35-38:49",
    "speaker" : "Andy",
    "text" : "Never see it again. Yeah. I was gonna say honorable mention would be the AFC championship game in Kansas City recently. Yeah. Yeah. That game was an absolute Like one for the ages. That's almost two easy. That's why I didn't know."
  },
  {
    "timestamp" : "38:50-39:02",
    "text" : "Meaningless games. Cause I like that one, Steve. Like meaningless game, like But it just was cool because of one thing. Like yeah, I I would say uh the the first game against the Jets when Randy Moss got there.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "39:03-39:03"
  },
  {
    "speaker" : "Greg",
    "text" : "When we're like how is Rainy Mods gonna be, he's kinda like maybe his career's petering out and then you're gonna be.",
    "timestamp" : "39:03-39:08"
  },
  {
    "timestamp" : "39:08-39:12",
    "speaker" : "Andy",
    "text" : "But he didn't play it all in preseason either. Yeah, yeah, yeah."
  },
  {
    "timestamp" : "39:12-39:15",
    "speaker" : "Steve",
    "text" : "That's why he came up with the like the celebration move too. Yeah."
  },
  {
    "timestamp" : "39:16-39:22",
    "text" : "His first touchdown was he outran triple coverage and Brady's like, yeah, fuck it, I'll throw it that deep. Maybe he'll outrun it. Nope.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Love it. All right, let's go worst.",
    "timestamp" : "39:22-39:25"
  },
  {
    "speaker" : "Greg",
    "text" : "I have one. Give it to me. You want me to go first? Because I have one in mind too.",
    "timestamp" : "39:28-39:32"
  },
  {
    "text" : "Alright, yeah, you go first, Greg.",
    "speaker" : "Andy",
    "timestamp" : "39:32-39:33"
  },
  {
    "text" : "We'll we'll do the mine is the um Yeah one of the playoff games against Baltimore, the one where Ridley got knocked out cold. Yeah. Remember that one? Where we like kinda outplayed him, but the Pats still lost. And that was the through that stretch where we're like, are they gonna make it to another Super Bowl again? And it was a miserable game. I was watching with like a bunch of people. at Stephon South from Steve's basement. And then after the game, uh Jeff Bean, also known as Dick Bean, fucking pants me. And like a bit pulled down my pants and my underwear. And I'm just fucking standing there in front of like a room full of A bunch of my buddies and all their girlfriends, and my dick is just hanging out. And I'm in a most miserable mood already. And then he does that to me, and I was like, What the fuck dude? Why would you do that? Read the fucking room kid. And he just did it for no reason. He was like, well, I don't know. It was so stupid And I was already so miserable that I was just like, what the fuck?",
    "speaker" : "Greg",
    "timestamp" : "39:33-40:47"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:47-40:49",
    "text" : "That's ridiculous. How are you gonna kick a guy on his hand like that?"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that's bad. I know. I guess that's why they call him Dick Bean. I guess.",
    "timestamp" : "40:50-40:54"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:55-41:04",
    "text" : "Not not because his dick is the size of a bean. No. All right, uh Steve. What's your uh worst game?"
  },
  {
    "text" : "What was that that Jets playoff game? Oh fuck.",
    "speaker" : "Steve",
    "timestamp" : "41:04-41:09"
  },
  {
    "timestamp" : "41:10-41:11",
    "speaker" : "Andy",
    "text" : "I was at Ryan's stories for that game."
  },
  {
    "text" : "We had beaten them like like just a couple weeks earlier.",
    "speaker" : "Steve",
    "timestamp" : "41:11-41:14"
  },
  {
    "speaker" : "Andy",
    "text" : "Like 41 to 7.",
    "timestamp" : "41:14-41:15"
  },
  {
    "timestamp" : "41:15-41:30",
    "speaker" : "Steve",
    "text" : "Yeah. Absolutely whooped them up. And I was like, this is gonna be the best reaction. We're gonna get him at home this time. We're gonna fucking crush him in the playoffs and then it was like that first fucking drive where strip sack and turn for a fumble or something."
  },
  {
    "text" : "I don't remember much of that game. I drank all the way to the game.",
    "speaker" : "Andy",
    "timestamp" : "41:31-41:33"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "41:34-41:40",
    "text" : "I'm blending in a Ravens game too there with that. There's another Ravens game, a home playoff game where we just got absolutely"
  },
  {
    "text" : "Uh yeah, that was uh when whoever their running back was had that like seventy yard run on the first play.",
    "timestamp" : "41:41-41:47",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Right, yeah.",
    "timestamp" : "41:48-41:49"
  },
  {
    "text" : "Yeah. Yeah, Ray Rice is right.",
    "timestamp" : "41:49-41:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "41:52-41:58",
    "text" : "I'm just like, I'm just blending those two together, I guess. That was a bad game. Those are both like awful games."
  },
  {
    "timestamp" : "41:58-42:10",
    "speaker" : "Greg",
    "text" : "I was at that Jets game. Yeah. And then I drove all the way home and then I was dropping off my buddy who I went to the game with and I backed into his garage."
  },
  {
    "text" : "Oh, that's right. That was oh, I didn't know that was the same night. Fuck.",
    "timestamp" : "42:10-42:14",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "42:15-42:20",
    "speaker" : "Greg",
    "text" : "And I'm like, dude. We'll talk in the morning. I'm not talking to your mom right now."
  },
  {
    "speaker" : "Andy",
    "text" : "I mean, that's fair. Yeah. All right. Uh my worst a little different. It is last year's wildcard game because it was the last game of Tom Brady playing for the Patriots. And the fact that he went out like that And his last play was throwing a pick six. Like it just it wasn't the easy thing.",
    "timestamp" : "42:22-42:49"
  },
  {
    "speaker" : "Greg",
    "text" : "We shouldn't remember that shit, Andy.",
    "timestamp" : "42:49-42:50"
  },
  {
    "text" : "That it should have been. We can put their last two games because they had they had that first. I was at that game. Well I was I was at the Titans game.",
    "timestamp" : "42:51-42:58",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah, you were there, right? Yeah.",
    "timestamp" : "42:58-43:00"
  },
  {
    "text" : "And so we're sitting in the rain watching this happen. And it was just like that's not the ending that should have been the pages dynasty. That's not how Brady should have left, you know? Because I think all the way through this, I don't know about you guys, but all the way through this, I always saw Brady and Belatrack winning one last one and then riding off in the sunset, like retiring together. And going out on top. And it just didn't happen that way. And it sucked.",
    "timestamp" : "43:00-43:29",
    "speaker" : "Andy"
  },
  {
    "text" : "I don't know. 10 years we're not going to remember that shit though.",
    "timestamp" : "43:29-43:31",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "43:32-43:37",
    "speaker" : "Andy",
    "text" : "I will. If you were there and you're doing it. I hold a grudge, Grat. Andy, you don't know this by now?"
  },
  {
    "text" : "Andy's been watching too much Hallmark channel.",
    "speaker" : "Greg",
    "timestamp" : "43:39-43:41"
  },
  {
    "text" : "Bridgerton, baby. I'm on the train right now.",
    "speaker" : "Andy",
    "timestamp" : "43:42-43:45"
  },
  {
    "text" : "Oh God. Of course you are.",
    "speaker" : "Greg",
    "timestamp" : "43:45-43:48"
  },
  {
    "speaker" : "Andy",
    "text" : "But I mean, yeah, I mean, I think an honorable mention would be now. No, there there's only one. No, it's not a Super Bowl. It's the uh AFC Championship game against the Colts where they were up 21.",
    "timestamp" : "43:51-44:04"
  },
  {
    "text" : "Yeah, that was on my list.",
    "speaker" : "Steve",
    "timestamp" : "44:05-44:06"
  },
  {
    "timestamp" : "44:06-44:09",
    "text" : "And because everyone was sick, and it was basically whoever won that game was beating.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "44:11-44:12",
    "speaker" : "Steve",
    "text" : "Fuck fuck what's that?"
  },
  {
    "timestamp" : "44:12-44:18",
    "speaker" : "Greg",
    "text" : "Yeah, let's just oh I got another honorable mention for the best. All right. The Kemberl Tompkins Saints game."
  },
  {
    "text" : "Oh bad.",
    "speaker" : "Steve",
    "timestamp" : "44:18-44:19"
  },
  {
    "timestamp" : "44:20-44:23",
    "text" : "If you want to go up because that's a huge Topkins stand.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "44:23-44:28",
    "text" : "Brandon Cook's uh uh Texans game too is also sick. Good.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "44:28-44:34",
    "text" : "Uh the 2006 playoff game against the Chargers. Troy Brown stripping Marlon McCree.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "44:34-44:35"
  },
  {
    "text" : "That was my other. I mean, there's so many to choose from.",
    "timestamp" : "44:35-44:38",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "44:38-45:04",
    "text" : "Well, those are probably like best moments, too, right? Yeah. You think about like as opposed to a game, but those moments, those are the moments remember of like the Campbell Promp Compkins TD and the Well, that's what makes the games memorable, right? Yeah. I mean we're like full-on games of like like the snowball had so many of those moments in it, but there are games where it's just like you define it by that one moment. True, true."
  },
  {
    "speaker" : "Andy",
    "text" : "I will remember you. Will you remember me? How do I do",
    "timestamp" : "45:05-45:15"
  },
  {
    "text" : "So uh best uh best and worst player.",
    "timestamp" : "45:17-45:20",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "45:20-45:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "45:20-45:22",
    "text" : "Non-Tom Brady edition."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:22-45:31",
    "text" : "Uh non-Troy Brown edition, I think. Yeah, no non-Tom Brady or Troy Brown. Favorite all-time player, Greg. Go."
  },
  {
    "timestamp" : "45:31-45:36",
    "speaker" : "Greg",
    "text" : "I mean it's Ty Law, without a doubt. Ah, fair. Yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "All right, give me give me a top three.",
    "timestamp" : "45:36-45:37"
  },
  {
    "text" : "I feel like I feel like fine, skip Tyla. Top one is easy. Give me top three. All right, then you guys go first. I'll have to think about it.",
    "timestamp" : "45:37-45:44",
    "speaker" : "Greg"
  },
  {
    "text" : "All right. You know who I got Vince Wilfork.",
    "speaker" : "Steve",
    "timestamp" : "45:45-45:50"
  },
  {
    "text" : "Yeah. I was gonna that was the first person I was thinking of actually.",
    "timestamp" : "45:50-45:53",
    "speaker" : "Greg"
  },
  {
    "text" : "Not because like I don't know, just from the whole package of on field and offfield and personality and likability and just like he's awesome. And cost of butt fumble. And you gotta put that in the plus columns. And there's like there's nothing in the negative column either. No. He's awesome at his job. He was.",
    "timestamp" : "45:54-46:14",
    "speaker" : "Steve"
  },
  {
    "text" : "Through and through two interceptions as a fucking nose tagger.",
    "speaker" : "Andy",
    "timestamp" : "46:14-46:17"
  },
  {
    "text" : "That one he had a game ceiling win against the Raiders early in the year. I remember that. It was like week one. And we were like, the Raiders sucked at that time. Yeah. And they were beating us bad. And they were about to win. And he fucking Caught jumping over it, dude. He just has he was just awesome. I loved him.",
    "timestamp" : "46:17-46:32",
    "speaker" : "Steve"
  },
  {
    "text" : "All right, let's do a snake draft here so no one steals. Oh, all right, all right, all right. I like that. Okay. So Steve went first. Yeah. I call second.",
    "speaker" : "Greg",
    "timestamp" : "46:32-46:41"
  },
  {
    "text" : "Okay, go ahead.",
    "speaker" : "Andy",
    "timestamp" : "46:42-46:43"
  },
  {
    "timestamp" : "46:44-46:56",
    "text" : "Wait, let's start from the top then, because no Brady, but everybody's on the table. I got Ty Law, Andy, you got Troy Brown, Steve gets again.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "All right, all right.",
    "timestamp" : "46:56-46:57"
  },
  {
    "text" : "All right. So let me write this down.",
    "timestamp" : "46:57-46:58",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "I'm gonna write this down so we can see I get to go again.",
    "timestamp" : "46:59-47:02"
  },
  {
    "speaker" : "Andy",
    "text" : "Okay. So Greg, Andy, Steve. So Greg does Ty Law. Yep. I got Troy Brown.",
    "timestamp" : "47:03-47:12"
  },
  {
    "text" : "Troy Brown. I do Vince Wilfork and Matthew Slater.",
    "speaker" : "Steve",
    "timestamp" : "47:13-47:15"
  },
  {
    "text" : "Oh, Matthew Slade, that's a deep one. All right. So Vince Will Fork.",
    "timestamp" : "47:16-47:22",
    "speaker" : "Andy"
  },
  {
    "text" : "Also, same idea. Awesome on the field, even though he plays a little less premium position. No negatives off the field. Consistent. Everybody loves them. Emotional heart of the Patriots.",
    "timestamp" : "47:22-47:35",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "47:36-47:36"
  },
  {
    "timestamp" : "47:37-47:38",
    "speaker" : "Steve",
    "text" : "Hall of Famer."
  },
  {
    "text" : "Um, I feel like I would be a bit of a fraud if I didn't pick my team MVP. So Kevin Falk is my second pick. Okay. He basically has been, and I completely forgotten this until we started doing this podcast, but he has been in 2002 and 2003. basically the reason the Patriots offense actually does anything in a lot of these games. And I forgot how clutch he was. And obviously you like I probably knew it on some level because like I had this love for him.",
    "speaker" : "Andy",
    "timestamp" : "47:39-48:11"
  },
  {
    "text" : "Right.",
    "speaker" : "Steve",
    "timestamp" : "48:11-48:11"
  },
  {
    "text" : "But going back and watching these games, it's like you can see why he's just He's that tough as nails guy. He's always reliable, always gets you the exact amount of yards you need, even on the fourth and two, where I I still think he got that two yards, even though the replay uh was inconclusive. But Kevin Falk, my number two pick. Greg. It's a pretty good pick.",
    "timestamp" : "48:12-48:37",
    "speaker" : "Andy"
  },
  {
    "text" : "I'm gonna go not outside the box here, but I'm taking Randy Moss.",
    "timestamp" : "48:38-48:43",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "48:43-48:43"
  },
  {
    "text" : "I know it was a short stint, but it was such a perfect relationship. I mean he played in a lot of places and he's probably gonna go down as like a Viking more than anything, but I think in his heart of hearts.",
    "speaker" : "Greg",
    "timestamp" : "48:44-48:57"
  },
  {
    "speaker" : "Steve",
    "text" : "Yes, I agree with that.",
    "timestamp" : "48:57-48:58"
  },
  {
    "text" : "He thinks that like New England is where he was meant to be in play.",
    "speaker" : "Greg",
    "timestamp" : "48:59-49:04"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:04-49:04",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "49:05-49:45",
    "text" : "And that's just so cool that like he was kind of misunderstood in a lot of cities or are with a lot of like coaching staffs or team cultures or whatever. And like he came to New England on a squad that just wanted to win with Belichick and Brady and they just like perfectly meshed. I think says a lot about who he is and the type of player and work ethic he has. And I think he like It was like duly reciprocated between all those guys. And it just you could you could see it when like they talk about each other. Like Belichick or Brady or Moss. And it's just like it's so it like brings a smile to your face seeing how like happy they all made each other."
  },
  {
    "timestamp" : "49:45-49:47",
    "speaker" : "Andy",
    "text" : "And the respect they all had too."
  },
  {
    "timestamp" : "49:47-49:54",
    "text" : "Yeah. And and they were just so fucking fun to watch when they were on their game that like that 2007 season will never be replaced.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "49:55-50:01",
    "speaker" : "Steve",
    "text" : "In his personality. A plus. I mean Cash Homie came from that season. Stray Cash Homie."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "50:01-50:07",
    "text" : "I mean, they'll still be gazed. Love them. Alright, so Snake Drave, you get to go again."
  },
  {
    "speaker" : "Greg",
    "text" : "So my next pick is a player I think is criminally underrated. Um and he's do you own his jersey I do not. Oh, okay. No. I don't know who this is then. Wes Welker. Oh. I mean he's the best slot receiver. Maybe ever. Ever. Right? Ever. Like we talk about how good Julian Edelman is right now, and his his stats are not even in the same universe as West.",
    "timestamp" : "50:08-50:40"
  },
  {
    "text" : "Which, yeah, I think a lot of people I don't know if they just like the last thing they remember is him dropping that pass in the Super Bowl against the Giants. Or just the way he he kind of left with some animosity. Definitely like things soured on him, but And I'm sure we'll get to that in this in this uh podcast, but his contributions to this team were Yeah, I I th I think you're right. I think he's criminally underrated. I agree.",
    "speaker" : "Andy",
    "timestamp" : "50:41-51:08"
  },
  {
    "timestamp" : "51:08-51:21",
    "speaker" : "Greg",
    "text" : "Yeah, and I think he kind of was like he's like because Moss was like the the big play guy that Welker kinda got lost in that shuffle, but I think without Welker, you don't have Moss. You know?"
  },
  {
    "text" : "Yeah, I I think Welker does that. Like he was that that Kevin Falk for that team. He was what the offense kind of he was the the one that moved the offense and then Randy Moss was the big play guy on top of that. But without Wes Walker like the offense just didn't move.",
    "speaker" : "Andy",
    "timestamp" : "51:21-51:39"
  },
  {
    "timestamp" : "51:39-52:14",
    "speaker" : "Steve",
    "text" : "So and another way around too though without Randy Moss it was harder for West Welker, it would be much harder for him to put those numbers up though. Because everyone could crash down, you know. So they had to respect Randy Moss's speed, so it gave him a lot more room to operate. But you're right, Greg. And he also like blazed that trail of the slot receiver. I mean, Troy Brown, we all love him, and he he kind of created that position within this offense, but West Balker took that to a level even unseen since. And I think a lot of the NFL has even copied that. And when they saw like, oh shit, Oswald is absolutely crushing it. Everyone tried to find and put those sort of concepts in the office."
  },
  {
    "text" : "Try to find the whites uh slot receiver. Yeah. Whole bunch of Cole Beasley's come after him.",
    "timestamp" : "52:15-52:20",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "52:20-52:24",
    "text" : "That that's a kick returner for your division rival, you know."
  },
  {
    "speaker" : "Andy",
    "text" : "And also uh fun fact Wes Walker's first ever points he scored in the NFL. Do you know what they were?",
    "timestamp" : "52:24-52:32"
  },
  {
    "text" : "Safety.",
    "timestamp" : "52:33-52:33",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "52:34-52:37",
    "text" : "Kicking an extra point against the Patriots as a Dolphins.",
    "speaker" : "Andy"
  },
  {
    "text" : "That's the best part. Also the best part of West Wilger is the Dolphins had him on their roster and didn't even And but and in that game I think he",
    "speaker" : "Steve",
    "timestamp" : "52:38-52:46"
  },
  {
    "speaker" : "Andy",
    "text" : "He was because their kicker got injured like during warm-ups. Like he pulled something. So Wes Welker, I think he played soccer, some shit. Um, so he was the designated like emergency kicker. So he was doing kickoffs. So I think there was one stretch of play where he uh caught a I don't know if he caught a touchdown or something, but he may have caught the touchdown, kicked the extra point. Had the kickoff and then made a tackle on the kickoff. All in a span of like four plays. Gave the water boy a back rub",
    "timestamp" : "52:47-53:17"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Fucking folded the laundry.",
    "timestamp" : "53:17-53:20"
  },
  {
    "text" : "As soon as I saw that, I think uh me and dad were watching a game together. I turned and I'm like, I bet Bellatrax got his eye on that Wes Walker kit because he's literally doing everything in this game. And that's like What the pagers look for in a in a player is like being able to play multiple positions. He's playing literally all of them. So I'm not saying I called it, but uh is it my pick? Fuck it. No, it's my pick. Oh, this is getting harder now. Um, I think I need to go defense. And I think I need to go hard of the defense. Oh, that's tough. I think I would go. I think I could go Teddy Bruski. I think there's a lot of big names you could pick on defense, but I don't think Any any of them were the heart of the defense in a way that Teddy Brusy was for as long as Teddy Bruskey was. Including the fact that he literally had a hole in his heart that he got fixed and came back and played with that. Which is ridiculous. And I think uh not because he was kind of almost the how do I put this? He he was kind of a linebacker when linebackers were were changing. Like linebackers used to be the thumpers. A little bit. Like he was linebackers are are like they were kind of changing at that time, like the early 2000s, where they weren't just thumpers anymore. And there weren't just neck rolls out there just fucking throwing their bodies at running backs. And I think Bruski was that one of the few at the time who could get in there and stop the run, but also like had a bunch of interceptions too and could kind of cover as well. And was that that fire in the middle that kind of got everybody else playing maybe a bit above what they would normally play. So Teddy Brucey is my pick.",
    "timestamp" : "53:20-55:21",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "55:22-55:32",
    "text" : "Mine is similar. Heart of the defense for a long time. Except he didn't have a hole in his heart. He has a gigantic heart.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "55:32-55:32",
    "speaker" : "Andy",
    "text" : "Okay."
  },
  {
    "text" : "Aaron Hernandez. No. Oh no. He was giving people holes in the heart. Oh boy.",
    "speaker" : "Greg",
    "timestamp" : "55:33-55:43"
  },
  {
    "timestamp" : "55:44-55:46",
    "text" : "Uh McCordy.",
    "speaker" : "Steve"
  },
  {
    "text" : "Devin McCourty.",
    "timestamp" : "55:47-55:48",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "55:49-56:18",
    "speaker" : "Steve",
    "text" : "He's still not even done either. Yeah. Think about that. Drafted first round, made the Pro Bowl as cornerback. Cornerback. Yeah. Yeah. And then struggled the second year. He did. Labeled the bust. Move them to safety and I mean how long I don't remember what year we distracted, but it feels like forever ago. Does stat check? Super reliable. Been around forever, runs that whole defense. He really does. But just like Teddy ran that defense back in the day."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:18-56:18",
    "text" : "Yeah."
  },
  {
    "timestamp" : "56:18-56:20",
    "speaker" : "Steve",
    "text" : "D Mac runs it now."
  },
  {
    "speaker" : "Andy",
    "text" : "And he guessed when he was drafted?",
    "timestamp" : "56:20-56:22"
  },
  {
    "text" : "Ah, 2000 and Six. Thirteen.",
    "timestamp" : "56:22-56:27",
    "speaker" : "Steve"
  },
  {
    "text" : "Ten. Split the difference. Twenty ten. First round. Twenty-seventh overall in 2010 draft. Man for 10 years. It's pretty impressive for a defensive player to blast 10 years.",
    "speaker" : "Andy",
    "timestamp" : "56:27-56:40"
  },
  {
    "timestamp" : "56:41-56:52",
    "speaker" : "Greg",
    "text" : "Rom, notably Rutgers. Rutgers. noted uh NFL player factor but only really for one team."
  },
  {
    "text" : "And it's clear that he's got to play with his brother too. Yeah, that's really cool.",
    "speaker" : "Steve",
    "timestamp" : "56:53-56:57"
  },
  {
    "timestamp" : "56:58-57:29",
    "speaker" : "Andy",
    "text" : "That that that uh when they did the uh three games of glory and they had the McCourties after the Kansas City Chiefs AFC Championship game. Just like singing and dancing in midfield. That was great. All right, Steve. You get another one. How many rounds are we going? We'll do f let's do five. How many people are going to be able to do that? Pick two then. Give me two."
  },
  {
    "timestamp" : "57:29-57:31",
    "speaker" : "Greg",
    "text" : "All right. Uh to you, right?"
  },
  {
    "timestamp" : "57:31-57:41",
    "text" : "Yeah. I'll do uh James Devlin. Stupid heck. You being stupid, but get fucked crack.",
    "speaker" : "Steve"
  },
  {
    "text" : "And Yeah, I think I used rudd there, but that's okay.",
    "speaker" : "Andy",
    "timestamp" : "57:41-57:45"
  },
  {
    "text" : "Uh I'll leave the the obvious one for you guys and I will go mayo. Drawed mayo is fucking also sneaky beast. And now he's coach from the Patriots too. Even better.",
    "timestamp" : "57:45-58:02",
    "speaker" : "Steve"
  },
  {
    "text" : "True. True. Uh let's see.",
    "speaker" : "Andy",
    "timestamp" : "58:02-58:06"
  },
  {
    "speaker" : "Steve",
    "text" : "Who do we have left? Oh, there's a new there's an obvious one sitting up there.",
    "timestamp" : "58:06-58:10"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, there's a super obvious one.",
    "timestamp" : "58:10-58:12"
  },
  {
    "timestamp" : "58:12-58:17",
    "speaker" : "Andy",
    "text" : "Yeah, I don't want it super obvious. That's why I picked James Devlin, Andy."
  },
  {
    "speaker" : "Greg",
    "text" : "Well then I'm taking them.",
    "timestamp" : "58:18-58:19"
  },
  {
    "text" : "All right. Um Fuck it, you go next then. I don't care.",
    "speaker" : "Andy",
    "timestamp" : "58:19-58:23"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "58:24-58:37",
    "text" : "Okay. I'm going Rob Gronkowski, the greatest tight end that's ever played the game. a fucking complete goofball off the field and just such a lovable guy, you know? You just want to squeeze him on his cheek. Huh?"
  },
  {
    "text" : "Face in my mouth the way he left.",
    "speaker" : "Steve",
    "timestamp" : "58:37-58:39"
  },
  {
    "timestamp" : "58:40-58:55",
    "speaker" : "Greg",
    "text" : "Yeah, I'm not a fan. I know, but uh yeah, but he's still fucking like a completely dominant player for a decade. Like the a a game changer that was undefendable and like without him you don't you probably lose like two more games a season."
  },
  {
    "timestamp" : "58:56-58:58",
    "speaker" : "Steve",
    "text" : "Brady, Moss, and him."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "58:58-58:58"
  },
  {
    "speaker" : "Steve",
    "text" : "That was the only thing elite.",
    "timestamp" : "58:59-59:01"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "59:02-59:16",
    "text" : "My sneaky this uh whatever if this might not be allowed, but I'm doing it anyways. Dante Skarnecchia. You know what? No one's gonna go any offensive linemen And he's the fucking standout from the offensive line for me. Star."
  },
  {
    "text" : "That's fair. That's fair.",
    "speaker" : "Andy",
    "timestamp" : "59:16-59:18"
  },
  {
    "timestamp" : "59:18-59:21",
    "text" : "All right, Andy, your last. That wasn't your roster.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I was gonna go offensive line, but I think Greg kind of covered that. Um I think Dante Hightower has to be has to be on the list.",
    "timestamp" : "59:24-59:33"
  },
  {
    "text" : "Just because three linebackers, by the way, which is probably the most of any position we've thrown out there.",
    "timestamp" : "59:34-59:38",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:39-01:00:07",
    "text" : "Yeah. Um And I'm gonna give it he wasn't here for a long time, he's here for a good time, Rodney Harrison, because I just love those like heart of the defense guys. Yeah. And I think he was one of them. Dante was one of them. Teddy Bruski was one of them. Those were just like they made the defense play differently when they're on the field. They play with a bit more of an edge And that's fucking. That's that's you guys didn't take him."
  },
  {
    "speaker" : "Steve",
    "text" : "I am swapping out James Devlin for Richard Seymour.",
    "timestamp" : "01:00:07-01:00:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:11-01:00:13",
    "text" : "Yeah, that would have been my next guy, but"
  },
  {
    "speaker" : "Steve",
    "text" : "And you know what? That's a good one. This is this is why I think the Patriots sucked so bad this year is because their linebackers are atrocious. Like we're trotting out Terez Hall and Cash Moolah and I don't know. Just like just a good entire crop of no-name dudes and rookies. basically Josh Uchew's a third down pass rusher and Chase Winnow who can't set the edge and just like they're the their It seems like their whole team is built like we just listed three of the awesome linebackers they've had over the last years, and this is really where they fell sure they couldn't stop the fucking run. And it was tough, tough to watch.",
    "timestamp" : "01:00:13-01:00:50"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:00:50-01:00:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Although I do think uh receivers, but I think sneaky linebackers are the worst group in the channel.",
    "timestamp" : "01:00:51-01:00:57"
  },
  {
    "text" : "NFL defenses are going to keep getting lighter. And so you're going to see um more like extra safeties and in spots for like where you'd actually have a linebacker. You're going to switch out of safety instead. Sure. Which what the pages started to do, because you can still do a good enough job against the run with that with like a three safety and have one of them in the box, like a Pat Chung sort of thing. But they'll also be able to run with tight ends and kind of run with with slot wide receivers and shit like that. So I think you'll see more of that. in the future.",
    "speaker" : "Andy",
    "timestamp" : "01:01:03-01:01:39"
  },
  {
    "text" : "The biggest missed opportunity of the dynasty is the Hernandez Gronk combo. 100%. Yeah that would have been so sick for so long. Like those two guys together were just the NFL was not ready for it.",
    "speaker" : "Greg",
    "timestamp" : "01:01:40-01:01:55"
  },
  {
    "speaker" : "Steve",
    "text" : "They were not ready. No.",
    "timestamp" : "01:01:56-01:01:57"
  },
  {
    "text" : "No. And it just won't happen again, I feel like. Right. I agree. Unless we get Dalton Keene and Assy Assy going the next year.",
    "speaker" : "Greg",
    "timestamp" : "01:01:57-01:02:09"
  },
  {
    "text" : "I mean the pages have have have drafted Tight ends pretty consistently for a long time. Daniel Graham, Ben Watson, Gronk Hernandez, Gronk Hernandez, and now these two.",
    "timestamp" : "01:02:09-01:02:23",
    "speaker" : "Andy"
  },
  {
    "text" : "We'll see. Yeah. All right.",
    "timestamp" : "01:02:25-01:02:27",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Any other best and worst you guys wanted to uh to put out there?",
    "timestamp" : "01:02:27-01:02:31"
  },
  {
    "timestamp" : "01:02:31-01:02:39",
    "text" : "Yeah, I mean I guess you could do coach, but I think we're all gonna say start Scarnekia and the worst coach is Man Genie, so I think that's uh does itself.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:02:40-01:02:43",
    "speaker" : "Andy",
    "text" : "Was manie well yeah, I see what you're saying."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:02:43-01:02:44",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:02:44-01:02:46",
    "text" : "Not on the Patriots, yes, but yeah. Best.",
    "speaker" : "Andy"
  },
  {
    "text" : "Epper Johnson.",
    "speaker" : "Steve",
    "timestamp" : "01:02:46-01:02:47"
  },
  {
    "speaker" : "Andy",
    "text" : "Best offensive coordinator",
    "timestamp" : "01:02:48-01:02:50"
  },
  {
    "timestamp" : "01:02:51-01:02:56",
    "speaker" : "Steve",
    "text" : "I don't know if I can even list them all. J McDee, Charlie Woods. Uh I'd probably go Charlie Woods."
  },
  {
    "timestamp" : "01:02:56-01:03:08",
    "speaker" : "Greg",
    "text" : "All right, let's do this one. Best best and worst media member. Fuck you. I'm going Zolak as my best and Felger as my worst."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:09-01:03:25",
    "text" : "I'm going Gino Cappelletti is my best. Yeah. Yeah. And I think we all know who my worst is. Yeah. Say it."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, you were in that jersey.",
    "timestamp" : "01:03:26-01:03:29"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "01:03:29-01:03:30",
    "speaker" : "Greg"
  },
  {
    "text" : "Uh because I was gonna wear it next week for an actual game. I was gonna wear it the next time he commentated a game. And we'll talk about it then. Okay",
    "timestamp" : "01:03:30-01:03:39",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "A little special prezi just for you, Andy. Because we love you. Uh you know, I don't have any I mean I guess media members, I'm I'm I'm with Andy. I don't know. I guess anybody on Boston Sports Talk Radio is also.",
    "timestamp" : "01:03:40-01:03:56"
  },
  {
    "speaker" : "Greg",
    "text" : "Jer Rodney sucks. Mike Reese. I I'll give Mike Reese a fucking shout out. Yeah, Mike Reese is. I know you love him, Steve.",
    "timestamp" : "01:03:56-01:04:03"
  },
  {
    "text" : "You know who also is Jerry Thornton too. Jeff Howe writes some good shit. I like Jerry Thornton shit.",
    "timestamp" : "01:04:03-01:04:10",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:04:10-01:04:21",
    "text" : "Yeah. He's a bit of a homer for me though. Oh yeah, well I like Homer. I'm down with that. He reminds me of Andy. Listen. Honestly."
  },
  {
    "timestamp" : "01:04:25-01:04:27",
    "speaker" : "Steve",
    "text" : "It's like he's smarter than Andy though, you know? Listen."
  },
  {
    "timestamp" : "01:04:28-01:04:34",
    "speaker" : "Greg",
    "text" : "He's old. He knows his shit. Yeah, he knows his shit. He just. Everything's fun to be pro-patriots."
  },
  {
    "text" : "Which is that's the kind of content I'm trying to consume here. Okay.",
    "timestamp" : "01:04:35-01:04:39",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's the kind of content I'm trying to make on this fucking podcast here.",
    "timestamp" : "01:04:39-01:04:42"
  },
  {
    "text" : "Not with me around, big fella. They call me Mr. Balance. Call you Mr. Fence Post. Mr. can't make a decision. You guys are idiots. I got decisions. Yeah, all right I got decisions coming up my butt crack, Andy. Okay. I I gotta sleep on my stomach so I don't fuck up my sheets.",
    "timestamp" : "01:04:43-01:05:07",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Okay, crack.",
    "timestamp" : "01:05:07-01:05:08"
  },
  {
    "text" : "All right. Uh anything else you want to touch on in this in this time? Alright, uh best and worst uh uniforms. I don't know.",
    "speaker" : "Andy",
    "timestamp" : "01:05:11-01:05:19"
  },
  {
    "timestamp" : "01:05:19-01:05:20",
    "speaker" : "Greg",
    "text" : "I have no opinion on this."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:05:20-01:05:25",
    "text" : "Yeah, I don't know. The reds are the best. The older the better, pretty much. Mm-hmm."
  },
  {
    "timestamp" : "01:05:26-01:05:28",
    "text" : "Yep. Agree Mama Brown disagree.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:05:29-01:05:33",
    "text" : "Yeah, but she's got PTSD. That's true.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:05:34-01:05:37",
    "text" : "All right, best and worst uh kickoff times.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:05:39-01:05:43",
    "speaker" : "Andy",
    "text" : "Best is 4. 15. Worse is anything after 8 o'clock."
  },
  {
    "text" : "So we can get all lubricated. Remember that quote from Brady? Oh, that's right. He likes the leg kickoffs because we get all lubricated before the game. You know what? I took that to heart. He got he got shit for that too. And then I I missed the game because I was in the fucking junk tank. Thanks a lot, Brady.",
    "timestamp" : "01:05:44-01:05:59",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:06:00-01:06:02",
    "speaker" : "Steve",
    "text" : "You owe me 50 bucks."
  },
  {
    "timestamp" : "01:06:02-01:06:05",
    "speaker" : "Andy",
    "text" : "Best and worst Patriots related quote"
  },
  {
    "speaker" : "Greg",
    "text" : "Straight cash homie's gotta be up there.",
    "timestamp" : "01:06:08-01:06:10"
  },
  {
    "text" : "Straight cash homie.",
    "timestamp" : "01:06:10-01:06:11",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "We already talked about that once.",
    "timestamp" : "01:06:12-01:06:14"
  },
  {
    "timestamp" : "01:06:14-01:06:18",
    "speaker" : "Andy",
    "text" : "The intro to the uh the Steelers playoff game, I think, is top for me."
  },
  {
    "speaker" : "Steve",
    "text" : "The worst quote was whatever that Steelers defensive back said to Brady. Yeah.",
    "timestamp" : "01:06:18-01:06:23"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:06:28-01:06:28",
    "text" : "Was that 07?"
  },
  {
    "timestamp" : "01:06:29-01:06:40",
    "text" : "I don't remember when that was. Or Trent Dilfer, they're not good anymore. Face it, they're not good anymore. Or uh Max Kellerman",
    "speaker" : "Greg"
  },
  {
    "text" : "Brady's gonna fall off that cliff. That was what six years ago. Yeah, yeah. Yeah. I'll put him on.",
    "timestamp" : "01:06:40-01:06:47",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:06:47-01:06:52",
    "speaker" : "Greg",
    "text" : "Or uh fucking uh Tom Jackson. These players hate their coach."
  },
  {
    "text" : "Yeah. In this 2003 season we're doing right now. Yeah.",
    "timestamp" : "01:06:52-01:06:56",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:06:56-01:06:56"
  },
  {
    "timestamp" : "01:06:56-01:07:07",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. Or um Or or Dungey putting uh Tom Brady at his uh what number five quarterback of all time?"
  },
  {
    "timestamp" : "01:07:08-01:07:09",
    "text" : "I don't remember that.",
    "speaker" : "Steve"
  },
  {
    "text" : "That was recent. He just did that recently.",
    "timestamp" : "01:07:09-01:07:12",
    "speaker" : "Andy"
  },
  {
    "text" : "Damn fuck Yeah.",
    "timestamp" : "01:07:12-01:07:14",
    "speaker" : "Steve"
  },
  {
    "text" : "Was it against the Patriots when uh Peyton Manning was like, oh, we had uh protection problems?",
    "speaker" : "Greg",
    "timestamp" : "01:07:17-01:07:23"
  },
  {
    "timestamp" : "01:07:23-01:07:24",
    "speaker" : "Steve",
    "text" : "Yes, it was. Yeah."
  },
  {
    "timestamp" : "01:07:26-01:07:28",
    "speaker" : "Greg",
    "text" : "That could be a best quote of all time."
  },
  {
    "timestamp" : "01:07:28-01:07:44",
    "text" : "That quote right there is what made me hate Peyton Man. That is like the root, Craig. Because I was like, you know what? Tom Brady would never fucking say that. Never fucking say that. Tom Brady, it's on me. It's my fault. And I don't think Peyton Manning was wrong either.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:07:44-01:07:53",
    "speaker" : "Andy",
    "text" : "No, he's right too. For missing a field goal against the Steelers. That was a zero dead though."
  },
  {
    "speaker" : "Steve",
    "text" : "Oh, and then we another quote we already talked about tonight was the uh learn the fucking rule book. Yeah, that's a great one.",
    "timestamp" : "01:07:53-01:08:00"
  },
  {
    "timestamp" : "01:08:01-01:08:21",
    "text" : "There's a lot of quotables. I like uh we're on Cincinnati. I think that's a classic. That's a good one to add on there. Also Gino just going, it's good, it's good. Yeah. It's good. Yeah. Yeah, that still gives you goosebumps every time I hear it. Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:08:21-01:08:29",
    "speaker" : "Steve",
    "text" : "Um I gotta say this has been really helpful. Yeah. You feel better, Steve? It has, yeah. I feel I feel way better."
  },
  {
    "text" : "I was seeing a little more pep in your step. And All right. Ooh, one last one. Um, best Belichick coaching decision. I got it.",
    "speaker" : "Andy",
    "timestamp" : "01:08:30-01:08:44"
  },
  {
    "timestamp" : "01:08:46-01:08:58",
    "speaker" : "Greg",
    "text" : "Well, I think they're all s can I do worse because I No, you can fuck right off is what you can do. Can I do worse decision that worked out for Belichick?"
  },
  {
    "text" : "Oh fine.",
    "timestamp" : "01:08:58-01:08:59",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:08:59-01:09:03",
    "text" : "Yep, this is still Patriots win, but it was stupid.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Greg Brown Broncos in let's let's hear it.",
    "timestamp" : "01:09:04-01:09:06"
  },
  {
    "speaker" : "Steve",
    "text" : "That was my best.",
    "timestamp" : "01:09:06-01:09:08"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:09:08-01:09:09",
    "text" : "What was it?"
  },
  {
    "speaker" : "Steve",
    "text" : "The intentional thing.",
    "timestamp" : "01:09:11-01:09:11"
  },
  {
    "text" : "No, no. Oh. That's the that's actually legit good decision. It's the one where they're playing the Broncos in the cold. And he fucking decided to he elected to kick off in overtime because he wanted to.",
    "timestamp" : "01:09:13-01:09:24",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because the wind.",
    "timestamp" : "01:09:24-01:09:25"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. Get fucked That's the dumbest shit I've ever heard. You got you want to fucking win instead of the football with Tom Brady as your goddamn quarterback? That's the dumbest shit I've ever heard. You're useless. You're playing Peyton Manning and he wanted the fucking wind over.",
    "timestamp" : "01:09:26-01:09:43"
  },
  {
    "text" : "Yeah, but they had figured out in that game that if they gave Peyton Manning a certain look, he would check to the run every single time. That was the game that whoever the fuck the running back was ran for like 200 yards and they still lost after going up like twenty-eight nothing in the first half, whatever the fuck it was.",
    "timestamp" : "01:09:43-01:09:58",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "I feel like you were out of that game, Greg.",
    "timestamp" : "01:09:58-01:09:59"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:01-01:10:03",
    "text" : "You should know better. It was like Wendy's."
  },
  {
    "speaker" : "Greg",
    "text" : "And we don't have the we don't have the benefit of like a TV thing. It's like garbage. And they announced that like the Patriots won the toss and elected the",
    "timestamp" : "01:10:03-01:10:11"
  },
  {
    "timestamp" : "01:10:11-01:10:24",
    "speaker" : "Andy",
    "text" : "The kick and I was like, what the fuck is going on? Everybody in the stands is like, what the hell's going on? I stayed in this fucking freezer whatever this bullshit. What's that fucking pandemonium up there? Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "It was terrible. Yeah, fourth and two.",
    "timestamp" : "01:10:25-01:10:30"
  },
  {
    "speaker" : "Steve",
    "text" : "I mean I was helpful for it. That's a defensible coaching decision as uh Parker touched on.",
    "timestamp" : "01:10:30-01:10:35"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I actually didn't hate that call.",
    "timestamp" : "01:10:35-01:10:36"
  },
  {
    "timestamp" : "01:10:37-01:10:42",
    "speaker" : "Andy",
    "text" : "They they're I think they all are for me. Um yeah, Steve, you were gonna ruin my ending."
  },
  {
    "timestamp" : "01:10:44-01:11:13",
    "text" : "I feel stands pretty high above because no one was even thinking that. That's like an analytics thing now. You know, like now they're talking about when you go for two, when you're down, like You know, two touchdowns, go for two, and stuff like that. There's a fair bit of that in this day's game. But back then, every like I'm actually kind of excited to watch that game again because I'm sure the announcers are gonna like lose their shit. Well it's funny you say that. The snap hits the upright. It hits the his the his the goalpost and pops it straight up, which is pretty cool.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "It's funny you say that because Next week on the Patriots Dynasty Podcast. What's that game? The Patriots travel to Denver to play the Broncos. In Mile High Stadium.",
    "timestamp" : "01:11:14-01:11:27"
  },
  {
    "speaker" : "Greg",
    "text" : "Get the fuck out of here.",
    "timestamp" : "01:11:27-01:11:28"
  },
  {
    "text" : "The last time Tom Brady was there, he threw four interceptions in the fourth quarter. Yeah. Will he redeem himself? That was 2001, right? Yes, I believe it was. Yes, he had an option.",
    "speaker" : "Andy",
    "timestamp" : "01:11:28-01:11:40"
  },
  {
    "speaker" : "Greg",
    "text" : "Dude, that's what a fucking uh teaser.",
    "timestamp" : "01:11:41-01:11:45"
  },
  {
    "speaker" : "Andy",
    "text" : "So, next week on the Page Dynasty Podcast, join us for what may be Bill Belichick's greatest coaching decision.",
    "timestamp" : "01:11:46-01:11:57"
  },
  {
    "text" : "Of the dynasty. Of the dynasty era. We just decided it here. There's no more discussion. It is the greatest decision.",
    "timestamp" : "01:11:58-01:12:06",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:12:07-01:12:15",
    "speaker" : "Steve",
    "text" : "No Jack's the best coach ever. Yes. So And he didn't make a better coaching decision outside of the dynasty. The best coaching decision."
  },
  {
    "timestamp" : "01:12:15-01:12:23",
    "text" : "The best coaching decision in NFL history next week. Thank you, Andy. Join us on the Patriots Dynasty Podcast. And we'll see ya then. That's a tea.",
    "speaker" : "Andy"
  }
]