[
  {
    "timestamp" : "00:00-00:19",
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast as my motherly duty, you have the choice not to. My sons, and of course Michael, sometimes say some naughty things when they're trying to be funny, but really they're just being stupid. Do you still want to listen? Go right ahead. I am not your mother."
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, welcome back to the Pages Dynasty Podcast. I'm your host, Andy Brown. Uh we'll be starting the season in a few weeks, but we're gonna take a little detour before we dive in and air some of the non-game recap episodes we've recorded uh along the way while we've been doing these. So we're going to do those for a couple of weeks and then we'll be back starting with the 2003 season. So this week is going to be a deep dive that Greg did into the Richie Incognito. Scandal. Uh so enjoy. We'll see you soon.",
    "timestamp" : "00:22-00:57"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "00:57-01:45",
    "text" : "Greg. All right, let's get into it. All right, so I think most of us are familiar, or at least remember to a certain degree, the uh the Richie Incognito and Jonathan Martin scandal. on the Miami Dolphins back in twenty thirteen. So just to give you some context as to who the two the two guys were. Um Jonathan Martin, he was a he's a second round pick out of Stanford in 2012. So this all went down in his second year in the NFL. So he's still pretty new to the league. Um his dad was a Harvard grad and criminal justice professor at Cal State. Whoa. His mom was a Harvard grad and a corporate lawyer for Toyota."
  },
  {
    "speaker" : "Andy",
    "text" : "So obviously Jonathan Martin here.",
    "timestamp" : "01:45-01:48"
  },
  {
    "speaker" : "Greg",
    "text" : "Jonathan Martin, yeah. So so obviously he had, you know, a decent upbringing and a fairly affluent family, right? Yeah. Um As far as mental health issues go, um he had had discussions about having uh severe depression. Um and he had you know, there's emails with him and his mom talking about how he had contemplated suicide before he showed it to Miami. So this is You know, this didn't develop in Miami, but he had issues going in. Gotcha. Incognito, on the other hand. He uh so he was a two thousand and five third round pick. Um so he'd been in the league for eight years by now. He kinda bounced around, he'd been, you know He was a great athlete but definitely had character con concerns. Um in college he was kicked off Nebraska For all sorts of stuff it looked like. They put him in like anger management courses. He had like multiple things of spitting on opponents, getting in fights. All that stuff.",
    "timestamp" : "01:48-02:59"
  },
  {
    "speaker" : "Andy",
    "text" : "Um wait, multiple spinning incidents? Yeah, there was a couple. Even Romanowski didn't have multiple spinning incidents.",
    "timestamp" : "02:59-03:05"
  },
  {
    "timestamp" : "03:06-03:08",
    "text" : "Like the poster boy. Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "So twenty twelve he was his first year in Miami, so that was Martin's rookie year. And it happened to be Incognito's best year in the in the pros. He was a pro bowler that year. And uh coincidentally he got awarded the Good Guy Award. Uh for a for a player who best helps the media do its job, which is pretty ironic considering how the media",
    "timestamp" : "03:10-03:38",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "03:38-03:48",
    "speaker" : "Andy",
    "text" : "Is it though because I feel like I'm saying being a media member in Miami at that time has been like dick easy Yeah."
  },
  {
    "text" : "Yeah, but think of much content he gave him the next year. He should have won that award multiple times.",
    "timestamp" : "03:48-03:52",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah. The stories wrote themselves. Maybe maybe we'll give it to him this year.",
    "timestamp" : "03:53-03:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, so 2013 is the year that it all goes down, right? So this is Martin's second year in Miami, incognito's second year on the Dolphins. And a few weeks into the season, I think it was like November, um, Martin unexpectedly t leaves the team citing emotional reasons. So that's all that we know in in the in the press, right? So all these rumors start swirling about like what are these emotional reasons, what's really going on. And then um the press gets a hold of a voicemail from incognito to Martin where he drops an N-word. Um he sounds like shit faced on the call and he says like Um I wanna shit in your fucking mouth. I'm gonna s I'm gonna slap your fucking mouth. I'm gonna slap your real mother across the face. Fuck you, you're still a rookie. I'll kill you. So once that comes out, Miami's like, you're done. They suspend him for the rest of the day. And then basically from there the whole like leak to the press gradually comes out So there's a lot of like information getting thrown around about, you know, coming from both camps. Incognito does uh uh and sit-down interview with like NBC or one of those people.",
    "timestamp" : "04:00-05:29"
  },
  {
    "timestamp" : "05:30-05:31",
    "text" : "I feel like I remember that.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. There's not a lot coming from Martin. He's pretty quiet himself. There's like some stuff from his lawyer, but nothing really directly from Martin. So yeah, then the NFL uh has Ted Wells. Recognize that name?",
    "timestamp" : "05:31-05:50",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Boy, does a hell of a job.",
    "timestamp" : "05:50-05:52"
  },
  {
    "timestamp" : "05:53-05:55",
    "text" : "But how much money did he make off the NFL? My God.",
    "speaker" : "Steve"
  },
  {
    "text" : "For real. So he does a uh, you know, one of his official report investigation things.",
    "timestamp" : "05:56-06:03",
    "speaker" : "Greg"
  },
  {
    "text" : "And finds whatever the NFL wants them to find.",
    "timestamp" : "06:04-06:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "06:07-06:58",
    "speaker" : "Greg",
    "text" : "Right. And he find uh ultimately his his you know finding was that there was a pattern of harassment between incognito And a couple other players on the Dolphins basically bullying Jonathan Martin. And there's a lot of detail in the report. There's um it's more um So not all of it gets released, right? So there isn't all the text messages, which I thought was pretty interesting. So they like highlight certain stuff in the report, like some of the worst things that he said to him over text. How bad does it get? Alright, so yeah. So here's how I got it organized here. I got the case against incognito and then the case for incognito, right?"
  },
  {
    "text" : "Oh",
    "timestamp" : "06:58-06:59",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "07:00-07:31",
    "speaker" : "Greg",
    "text" : "All right, so the case against incognito. There's some pretty raunchy shit. Um there's some stuff specifically about Martin's sister. I'll read you some quotes here. Uh we're gonna run train on your sister. She loves me. I'm gonna fuck her without a condom and come in her cunt. Good God. Hey, Jmart's sister's in town. Get the plastic sheets ready. She's a squirter. I'm going."
  },
  {
    "timestamp" : "07:31-07:36",
    "speaker" : "Mike Melo",
    "text" : "In that sense, if he knows that personally, then I mean it is what it is. But if he doesn't, that's really messed up."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah This that this next one's kind of ironic. I'm gonna bang the shit out of her and spit on her and treat her like shit. Alright, that one I think is wrong. That one is definitely wrong. She's a squirter, he's a spitter. You know what are you gonna do? Hence the sheets. Yeah, and my personal favorite, my favorite quote to come out of this whole thing, hear your sister as a wolf puss, a fat hairy pussy.",
    "timestamp" : "07:37-08:03"
  },
  {
    "text" : "Now I'm curious like where these texts come in in context of the conversation. Like is Exactly. Oh we'll get there, Mike. All right, all right.",
    "speaker" : "Mike Melo",
    "timestamp" : "08:06-08:14"
  },
  {
    "text" : "So this is the case against",
    "speaker" : "Andy",
    "timestamp" : "08:15-08:17"
  },
  {
    "timestamp" : "08:17-09:09",
    "text" : "Yeah. So then there was some other stuff about him like bullying um a trainer. Like there was like a Asian trainer there and they were making like Pearl Harbor jokes or something like that. Um Some more of the sister stuff. Uh he claimed uh Martin claimed that on the practice field and incognito Jerry and Pouncey would call his sister a squirter and then squirt water onto the field from the water bottles. And that while engaged in warm-up stretching, they would simulate having sex with his sister. Incognito confirm these allegations. So incognito is not really. Yeah. And he's not he's not denying any of this, right? Incognito says, yeah. I said all this stuff, I did all this stuff.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Is his sister hot is the other question. Does he even have a sister?",
    "timestamp" : "09:10-09:14"
  },
  {
    "timestamp" : "09:14-09:20",
    "text" : "Well yeah, that's a good question. And also, did they actually date? Did incognito actually date his sister?",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "09:22-09:24",
    "speaker" : "Greg",
    "text" : "I don't know."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "We'll have to find that out.",
    "timestamp" : "09:27-09:28"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "09:28-10:56",
    "text" : "Yeah. Stat check Steve? Yeah, I'll do it. All right. So then the other big the piece against incognito is um there's a lot of n word well not a lot but there is a a fair amount of n-words thrown in there, right? Incognito are Martin's a black player, incognito obviously white. Um so in text messages in uh voicemails, he's throwing that word around pretty flippantly. All right, so the other side of the coin, the case for incognito. So when all this goes down, right, it all starts getting leaked to the press. There's records of the text messages between incognito text Jonathan Martin and is like Hey, how you doing? Like, uh, I miss you. What's going on here? And Martin's like, yeah, no, no, this has nothing to do with you. This is all, you know, none of this is coming from me. And and uh huh. It sounds like really cordial, right? Yeah, yeah. So that was kind of weird. Um And then uh maybe like three, four months after like all of it went down, they released uh the text message history between the two of them. So this is like over over roughly a year. Yeah, over a year. And there's like over a thousand text messages between the two of them."
  },
  {
    "text" : "Wait, and did you uh find out why they waited so long to release all that?",
    "timestamp" : "10:56-11:00",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, so what one of 'em they they said that they don't know where the leak comes from, but they th they were um, you know, the thing I read was that they were implying it was coming from Incognito's party just because it it it honestly puts some of it in context and you know it shy it makes it look better for incognito if we're being honest. Gotcha. Cause I mean essentially it who's text who's texting somebody they like dislike or bully a thousand times, right?",
    "timestamp" : "11:01-11:30"
  },
  {
    "timestamp" : "11:31-11:55",
    "speaker" : "Mike Melo",
    "text" : "Unless he's intimidated, but it definitely like it gives like context because if you're picking and choosing like isolated shit which like happens every day now, it kinda sucks. Like, and I'm not saying that incognito is right or not. I don't know the whole thing we're finding out, but um I obviously it's a lot more advantageous to uh pick and choose as opposed to just showing us what happened."
  },
  {
    "timestamp" : "11:55-12:47",
    "speaker" : "Greg",
    "text" : "Right. Exactly. Yeah. And that's and that's basically what you get. I w I read through every single one of the text messages. And it was it was amazing, I tell ya. There's some unbelievable stuff in there. But the the the overall point of it is, I mean, these two guys were It it didn't come off as like an intimidation thing, right? Like incognito is inviting them out to bar. Like all the texts were about them, like Going out and getting pushed essentially. Getting wolf pus. Oh, dude, some of it's raunchy as hell, but At the end of the day, like incognito is like, you know, being like, hey, meet me out here, meet me out there, what are you doing tonight? Like, let's go, let's go to Vegas together, this and that. And you know, Martin's giving it back to him too. He's not being just like a a passive observation."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "12:49-12:50",
    "text" : "Do you have some of his texts?"
  },
  {
    "text" : "Yeah, so there's one that um that incognito is kind of standard by where it's he sends him a Martin sends him a meme and it's like, I will murder you and your whole fucking family. Right. So that's like yes, so they're going back and forth kinda shitting on each other, right? Um Some of it's definitely over the line if you're in.",
    "speaker" : "Greg",
    "timestamp" : "12:51-13:14"
  },
  {
    "text" : "Wait, yeah, wait. Give me some more of the like wolf pussy shit from like the Jonathan uh camp.",
    "timestamp" : "13:15-13:20",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh so Jonathan's not so much like he's less of like I'm uh being like aggressive towards incognito, but he does say a lot of like I mean he's talking about like coming on girls, titties, and shit like you know, like like raunchy shit himself.",
    "timestamp" : "13:20-13:39"
  },
  {
    "text" : "It's not so much he didn't seem like a guy not incognito sister or whatever, just some random. Right, right, yeah, yeah. Yeah, yeah.",
    "timestamp" : "13:39-13:45",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "13:47-13:48",
    "text" : "Locker room talk, as we say.",
    "speaker" : "Andy"
  },
  {
    "text" : "Locker room talk, right? Yeah. And to be honest, dude, being a football player in your 20s in in Miami sounds awesome.",
    "speaker" : "Greg",
    "timestamp" : "13:48-13:58"
  },
  {
    "timestamp" : "13:59-14:01",
    "speaker" : "Andy",
    "text" : "Dude, it sounds awesome."
  },
  {
    "speaker" : "Greg",
    "text" : "I didn't even think of that, but yeah that Yeah, because these guys, you know, they're off season, they're just like going out. So these bars getting like the best treatment. They can do whatever they want, you know, they got all the money. Yeah, yeah. It's unbelievable. So it kind of gave you a sneak peek into like, hey, what's actually going on in these players' lives you know in the offseason, which I thought was pretty interesting. Um but I'll I'll get to some of the quotes in a little bit because some of it's funny. I just pulled out a few of them. But so another thing that uh kind of supports Incognito, uh, when it all went down, a lot of the Dolphins players actually came out and defended Richie. So, you know, the media went and interviewed every single player in that team and almost You know, a lot of people said no comment, but a few people were saying, hey, listen, like, these guys are best friends. And I don't I don't agree with this, you know, accusation of bullying, basically. They're they were more forward than I thought people would be. So I I I could read you a quote from Ryan Tannehill, actually. Actually. Quarterback speaking, yeah. He said, if you had asked John Martin a week ago a week before who his best friend on the team was, he would have said Richie Incognito. The first guy to stand up for Jonathan when anything went down on the field, any kind of tussle, Richie was the first guy there. When they wanted to hang out outside of football, who was together? Richie and Jonathan. Damn. So that I mean that's pretty forward, right?",
    "timestamp" : "14:01-15:32"
  },
  {
    "text" : "Yeah, but here's the I'm I'm gonna throw this out there because You know, um a lot of this stuff pops up even with like the uh, you know, like the Harvey Weinstein stuff, like the his his trial. The like big thing that like his defense had um on his side was that w after these allegations and whatever might have happened. that um, you know, these his victims would continue a relationship with him or or reach out to him or be very cordial or whatever. Now obviously like, you know, he's he's um a guy of power and whatever so it's a little different situation than like teammates but what I'm what I'm thinking is So I'm not gonna say any names, but I mean you guys would know what I'm talking about and Andy for sure. But in growing up, um You know, I definitely know that I I hung out with some people that maybe like you you you how do you meet people, right? You're in a class together, you like have some activity together and all of a sudden you're just like hanging out all the time. Um and you know that progresses with your circle of friends and as the years go on, whatever. And so certain dynamics start happening. And I can say for myself there have been people that I'm like, oh man, like this person's my friend, like they're cool, whatever. But like I don't feel that great when I'm like with them, but you don't know why necessarily. You're just kinda like, ah, this kind of feels like shit or whatever. Yeah. It gets to the point where as you get older you change. Cause you know, I was kinda like quiet when I was younger, but then as I got older I was like, fuck this. Like I'm I'm gonna say what I wanted and like I I felt like nothing matters anyway, whatever, fuck it. So as I started vocalizing, um, it changes the dynamic because it's like, oh wait a minute, I thought we were this and now you're like acting this way, it pisses me off type of thing. But uh a lot of times I felt like I hung out with people who were like You know, if I pissed them off or I was like, dude, just like shut up or leave me alone, they might set your house on fire. Like you don't know. You know what I mean? So Oh I'm wondering, um, and you know, as we continue talking about this, I'm curious, was were they friends or was it a situation that like Jonathan never like opened up and like defended himself and was like, dude, shut up. Or if he actually was his buddy, they talk like that. Because obviously we all have friends that we say stupid shit with each other and it's not necessarily personally offensive, maybe to other people. But um But yeah, I'm curious, like, were they buddies or was it a situation that it looked like they're buddies and he's like, fuck this guy.",
    "timestamp" : "15:33-17:58",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "17:58-18:13",
    "text" : "Yeah, I mean that's a That's a pretty interesting take. I mean I I think w I think I understand and you could argue that he Richie does have a a certain amount of power over Martin, right? Because he's a fair he's a pro bowler, he's a leader in the locker room."
  },
  {
    "text" : "Actually, yeah, that's a really good point.",
    "timestamp" : "18:13-18:15",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "18:15-18:50",
    "speaker" : "Greg",
    "text" : "Yeah. Um there's definitely so for I actually pulled out some text from the the text thing that I thought was kind of like Cause most of the talk is not serious at all, right? They're not actually discussing real problems and they're just shooting the shit. So it's kind of hard to get a read on that of hey, what would happen if Jonathan Martin says, hey, listen, like You know, I'm not sure. Right. I'm having a real problem or you know, I I feel depressed. I'm I'm in yeah, I'm in the dumps this week. Stuff like that."
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Um Did you see anything in the text where he was more personable like that?",
    "timestamp" : "18:50-18:55"
  },
  {
    "timestamp" : "18:55-20:18",
    "speaker" : "Greg",
    "text" : "Yeah. So there was one thing where they were supposed to go to Vegas and like Uh Richie was like giving him shit about like, hey, you gotta bring six thousand dollars, you know, because you have the rookie still, this and that. And uh Martin says, Man, I I just can't justify this Vegas trip with what I've been dealing with recently. Let me know if I owe you anything for the room. And Richie said, It's all good. Let me know if you need anything. Which I thought was Considering the text leading up to that, where he was like, fuck you, you pussy, that one seemed as like a all right, like he kind of gets it, you know? Yeah, it's a bros text right there. Right, exactly. Um There is one where, I mean granted, this is still kind of shooting the ship, but he says, uh Richie says, what's up, pussy? I love you. Hashtag bipolar relationship. Um there was one about getting a girl pregnant too. Oh. Yeah, I don't think I pulled it out, but basically he was like, yo, if you uh Did you like have sex with that girl last night? And he's like, oh here it is. Um you good dude? Did you get some chick pregnant I'll help I'll help you offer if that's the case. Which again is like a bit tongue-in-cheek, but it's kind of like, hey, you know, I'm on your team type of thing."
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah.",
    "timestamp" : "20:18-20:19"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "20:19-20:25",
    "text" : "So I mean it's c it's kind of hard to get a read on what they would if they had serious stuff going on."
  },
  {
    "speaker" : "Steve",
    "text" : "Quick question, Greg. How many hours of reading was all these text messages?",
    "timestamp" : "20:25-20:30"
  },
  {
    "text" : "Oh no, it's like a half hour.",
    "timestamp" : "20:30-20:32",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Oh really? Yeah.",
    "timestamp" : "20:32-20:34"
  },
  {
    "text" : "That sounds like a well. See Go ahead. Go ahead, Mike. No, no, it's uh gonna take us on a tangent, so go for it.",
    "speaker" : "Mike Melo",
    "timestamp" : "20:35-20:44"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I mean most of it was like some of it was kind of mundane, but When I first started, I was like, dude, there's so much funny shit in here. And like a quarter of the way through, I was like, all right, I gotta like filter down what I think is funny because all of this is pretty funny.",
    "timestamp" : "20:45-21:00"
  },
  {
    "text" : "Well, and then I I was gonna bring up another situation and maybe you guys can like, you know, as we discuss their relationship, I don't know if you um have experienced this kind of stuff, I would imagine. Everyone uh has dealt with somewhat of uh similar situations throughout their life, at least one point or another. But um, you know, another example of like when I was older now, so at this point I was like, all right, you know I am confident in how I w what I think and I'm I feel comfortable like speaking, but I was I was in a uh work environment and it was very like casual environment, you know, and uh uh coworkers they're all older. And uh just kind of saying vile shit. And like, you know, I you grow up here in this kind of stuff, but as the generations like continue or whatever, things aren't the way that they used to be. And so it used to kinda piss me off. Like he would just say stuff and I it not out of a a sensitive aspect. Like I wasn't like offended. It was like obnoxious. Like I was like, man, this guy is just talking out of his ass and I gotta listen to it all the time. But I kept my mouth shut for a long time because I was like, you know, there's a workplace and like these guys have been around for 15 years, so like, whatever. And I put up with this crap and I hated this job every day, worse and worse because like these people just talked about the dumbest shit that I didn't agree with. I let it go and I let it go. And this guy wasn't a friend. But what I started uh um seeing happen was that he believed that we were friends. Right. So I gave him this false sense of uh security where I didn't check him. And so he kind of just ran his mouth and I kind of just laughed it off and whatever. It got to the point where it was annoying me and he couldn't even tell. You know, like and so it came to a culmination where, um I believe this happened like right after the uh uh uh Trump was in office. And I don't give a fuck what what anybody thinks. And I I don't care uh whatever. You're for Trump, you're against him. I don't really give a shit. But the way that he was talking about it pissed me off so much because he didn't even like this guy didn't even vote or anything. So I was like, dude, who are you to like tell me anything and whatever? And I was like, I lost my shit and I went off on him. And I was like, you fucking asshole. I've been sitting here listening to your crap and I'm tired of you as a person and all this other stuff. It was a little bit of much.",
    "speaker" : "Mike Melo",
    "timestamp" : "21:01-23:14"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "23:15-23:16",
    "text" : "That doesn't sound like you"
  },
  {
    "text" : "Yeah, a little too extreme. You go from like being buddies to like all of a sudden it's like, hey, here's like a year and a half's worth of like why I hate you. So there's probably better ways to like communicate.",
    "speaker" : "Mike Melo",
    "timestamp" : "23:16-23:30"
  },
  {
    "timestamp" : "23:30-23:31",
    "speaker" : "Andy",
    "text" : "Wait, let me get the PowerPoint."
  },
  {
    "timestamp" : "23:32-24:28",
    "speaker" : "Mike Melo",
    "text" : "Hang on. Exactly. So I probably should have filtered that a little bit before getting to that point. And I'm learning. But um I also acknowledge that I gave that guy sort of a free pass for so long that he didn't know that he was like even bothering me. And like to his credit, like which I felt so bad. But I was like, dude, just like do your job and leave me alone. And then like half hour later, he like bought a cupcake for me or something. He's like, hey man, like how about the Patriots? Whatever. We were talking for a little bit. And then he's like Are you still mad at me? And he didn't understand why I was mad. So is it and I don't know if you guys have been in certain situations like that. I mean, you know, you meet a ton of people all the time, but th those are two different sides of like this conversation where it's like It looks like a friendship, and one person might even think it's a friendship, so they're like no one's necessarily wrong in a situation if they're not malicious. But can it still be a detriment? I think so."
  },
  {
    "text" : "It's just no, but I think in the other case though, you you generally keep that guy at bait, you're right. You're not spending your free time with him.",
    "speaker" : "Steve",
    "timestamp" : "24:28-24:35"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "24:36-25:00",
    "text" : "Uh the uh the well the first scenario um I did spend time with a person and it wasn't necessarily like the my first choice. So you were hanging out with him outside of work? I was, yeah. Yeah, and I'm in. I mean Andy's been in similar situations, I know for a fact. So and he probably knows what I'm talking about. But um Yeah, there are scenarios."
  },
  {
    "speaker" : "Andy",
    "text" : "You can say it. I got I was stuck in a pool van with my brothers.",
    "timestamp" : "25:00-25:03"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "What?",
    "timestamp" : "25:04-25:04"
  },
  {
    "text" : "I was stuck in a pool van with my brothers, having to listen to them talk, pretending we were friends.",
    "timestamp" : "25:05-25:09",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Oh boy.",
    "timestamp" : "25:09-25:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:10-25:11",
    "text" : "Is that what you're talking about?"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "No, I was talking about um just friends that we've had along the way.",
    "timestamp" : "25:12-25:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh, okay, yeah. All right. I loved our time together.",
    "timestamp" : "25:18-25:21"
  },
  {
    "speaker" : "Steve",
    "text" : "Just like your boss? Damn.",
    "timestamp" : "25:21-25:26"
  },
  {
    "timestamp" : "25:26-25:27",
    "speaker" : "Mike Melo",
    "text" : "You didn't tell me that."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "25:28-25:30",
    "text" : "Yeah, I mean it was very clear you were upset, Andy."
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "25:31-25:38",
    "text" : "Yeah, why didn't you tell me you hated that job. Wait, we've been friends throughout the whole time. You didn't tell me that Steve was your boss? He thought he was the boss."
  },
  {
    "timestamp" : "25:39-25:42",
    "text" : "Andy was a great employee. Greg was the worst.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "25:42-25:45",
    "text" : "Yeah, because you're because we're fucking cleaning pools, bro."
  },
  {
    "text" : "Greg didn't keep up.",
    "timestamp" : "25:46-25:47",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Fuck.",
    "timestamp" : "25:47-25:47"
  },
  {
    "timestamp" : "25:47-25:50",
    "text" : "Yeah, you didn't listen to anything I tried to tell you to do. You just like to do it.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that's because Steve was like, do we're gonna change the world cleaning these pools? I was like, dude, I'm making eight bucks an hour in the summer. Like, give me a break.",
    "timestamp" : "25:50-26:00"
  },
  {
    "text" : "I'm just trying to survive this thing. And I was the other end of the spectrum talking about how I hated my life. I want to to kill everybody.",
    "timestamp" : "26:00-26:08",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "When was this? Around the same time? Yeah, those are dark ones.",
    "timestamp" : "26:08-26:11"
  },
  {
    "speaker" : "Andy",
    "text" : "Well Steve Steve started there and then I joined and Steve left and then Greg joined.",
    "timestamp" : "26:13-26:17"
  },
  {
    "timestamp" : "26:17-26:18",
    "speaker" : "Mike Melo",
    "text" : "Oh okay."
  },
  {
    "timestamp" : "26:18-26:20",
    "speaker" : "Andy",
    "text" : "So we kind of all overlapped."
  },
  {
    "text" : "But yeah, so I mean I know you're joking about your brothers and whatever, but like you know what I'm talking about, like as we were growing up. And so my question is, and I don't know how it even happens, because I don't even think like Like I didn't even know that I didn't like hanging out with like certain people until like time passes and you're like, wait a minute, what the hell am I doing? Um And then it gets awkward, right? Because if you bring it up, then people are like, whoa, whoa, you know, what happened the last three years or whatever?",
    "timestamp" : "26:21-26:47",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, that's true.",
    "timestamp" : "26:47-26:49"
  },
  {
    "timestamp" : "26:49-27:15",
    "speaker" : "Mike Melo",
    "text" : "So I don't know if you can speak to to that or anything similar with your experiences because we were also like quiet people, but we we knew everybody, we were friendly with everybody, but I think it's easy to get lulled into situations where then after an outside perspective is like yay or nay one way or another, like ic incognito is an asshole or he's not, or Martin should have done this, or he you know, he's lying. Yeah. And it's tough to tell."
  },
  {
    "timestamp" : "27:15-27:57",
    "text" : "Yeah, I I'm sure there's a whole lot of gray area too. I mean it may have been something like that where they may have been friends at the beginning, or maybe they were friends, but you know, um Martin kind of like you said, kind of grew grew apart and uh that changed everything. But Without being in there. Like I I think I know what you're saying. And I um in our friend group growing up, there were a few people that I was less than thrilled with. Feliche if you're listening. No, I'm just kidding. Yeah, he is uh He may be our only listener, so I don't really want to talk shit.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:58-27:59",
    "speaker" : "Mike Melo",
    "text" : "I love you, Feliche."
  },
  {
    "text" : "Uh but yeah, no, I think um and I think if you're looking at it from the outside, especially if you're like a passive person too, which it seems Jonathan Martin may have been. then even if you're what was he, six, four, three hundred pounds, like that you still like inside still have that thing where you're just kinda gonna go along with whatever they say and Because Richie Incognito is the pro bowler and the the leader of this team, you're just gonna go along with what he says. And if he says you guys are friends, then you're friends, and unless like Something changes, you know?",
    "timestamp" : "28:00-28:35",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "28:35-28:36",
    "text" : "Yeah."
  },
  {
    "timestamp" : "28:36-28:43",
    "speaker" : "Andy",
    "text" : "And perhaps his Harvard educated parents may have opened his eyes to some of what was going on as well."
  },
  {
    "timestamp" : "28:44-28:49",
    "text" : "Oh true. Did you cover like the media response to it all?",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, I mean the media was kind of what you'd expect. I mean maybe it's changed a little bit since then, but it you know, if the headline is, you know, incognito drops n word and blah blah blah about teammate. You know, it was all like high level stuff. No one really got into the weeds of it of like trying to look at the actual context of the stuff. It was you know trying to get people to click on their article.",
    "timestamp" : "28:50-29:19",
    "speaker" : "Greg"
  },
  {
    "text" : "Mm-hmm. Yeah, I mean it's definitely like a gray area thing, right?",
    "timestamp" : "29:19-29:24",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "For sure. Yeah, yeah.",
    "timestamp" : "29:25-29:26"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:33-29:37",
    "text" : "And it's just talking about Wolf plus left and right. Right."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "29:38-29:44",
    "text" : "Incognito thinks he's doing a good thing, right? He thinks he's taking a quiet teammate and like pulling him into the group, right?"
  },
  {
    "text" : "I don't think it was like maliciously intended by him.",
    "speaker" : "Steve",
    "timestamp" : "29:45-29:49"
  },
  {
    "speaker" : "Greg",
    "text" : "Exactly.",
    "timestamp" : "29:49-29:49"
  },
  {
    "timestamp" : "29:50-29:55",
    "text" : "It doesn't mean that it didn't impact, you know, Martin's mental health negatively.",
    "speaker" : "Steve"
  },
  {
    "text" : "Right. I know. That's a that's a tough thing.",
    "speaker" : "Mike Melo",
    "timestamp" : "29:56-29:58"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "29:59-30:06",
    "text" : "But if you look at if you look at the uh the media reports, right? Like you said, Greg, just White guy calls black guy N-word."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "30:06-30:07",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Right.",
    "timestamp" : "30:07-30:07",
    "speaker" : "Steve"
  },
  {
    "text" : "But it is also tough because there was an age difference, right? So when you're young and you're in a new environment you might think a certain way. Um and like, you know, how I think Andy said, maybe, or maybe it was you, Greg, but um how his parents may have sort of enlightened him as things went on, like, hey, you're a football player, but you don't necessarily have to take this or whatever. Or maybe he didn't even know how he was feeling, and then he figured it out over time. Um I I don't think based on what I've remember from the past that incognito is was in trying to be malicious, um like Steve was saying. Um",
    "timestamp" : "30:08-30:47",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "30:50-31:04",
    "text" : "I was gonna say it seems to me that Incognito had some like other shit going on with him. He was he was fighting his own demons, but I don't think he was Well, I mean I I actually don't know. I mean it was he was caught off guard by it."
  },
  {
    "timestamp" : "31:04-31:09",
    "speaker" : "Greg",
    "text" : "Yeah. Oh he does. He was very surprised when it all went down, and that seemed authentic. From what I could tell."
  },
  {
    "text" : "I mean what I find interesting because I I could speak like personally from those two scenarios that I said that looking back, it was never a relationship like, you know, we can all talk about stuff and whatever. With those guys, it was never a relationship where I really opened up about much, to be honest. It was like all on the surface stuff. So and I definitely didn't confide anything. They confided things in me, probably because of that false sense of security. But um I never like really went into anything. Um so that's why I was like curious like if if Martin had that relationship with him sometimes where he did open up. Because if that was the case, then it kind of makes it seem like there's a little bit of like a you know, cost benefit thing between them. But if it's all just like wolf pussy and then every once in a while, hey, I can't afford something. Sorry, man. Oh, it's all good. Then it's like, I don't know, it's tough. But then obviously it's on Martin as an adult to speak up if he wants to be treated a certain way. Um so yeah, man, I don't know. I mean what did you uh determine after all this?",
    "timestamp" : "31:09-32:13",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I mean I think that you kind of hit the nail on the head there as far as it probably was detrimental to Martin, but he never said anything. Richie thinks he's doing a good thing. So there's no one that's really the asshole here, but it definitely had a a bad effect on Martin, right? Yeah. But I don't think it's right to vilify incognito though, because he's he's not coming from a place of I'm trying to fuck with this guy. He's actually thinking he's doing a good thing. So I I don't think there's any assholes here. I think it's just One of those weird situations.",
    "timestamp" : "32:14-32:51"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Right. And I do hate the media because it's like, you know, we've all said stupid shit. You know what I mean? The president has said grab grab women by the pussy and I he gets a pass for that, right? So people say stupid shit. Um and what people forget nowadays it's context, right? It's intention and context. So if i Richie could say something shitty, and we all can agree that it's shitty. But if he believes, based on the environment that was created, that he is being funny or supportive. Well then that sort of manipulates the intention. And so we vilify people because we're like, oh, you shouldn't have said this thing eight years ago. But it's like who was that said to and what was the intention? Because if you're trying to be a prick Then yeah, let's uh fucking take matters into our own hands and ruin your life. But if you're trying to be funny or stupid or you know, whatever it is and you don't mean any harm, shit man, like society is pretty rough on that nowadays.",
    "timestamp" : "32:52-33:50"
  },
  {
    "timestamp" : "33:50-34:20",
    "text" : "Yeah. And I think uh uh like a point to bit on that is some people would say that like, oh, the the culture of the locker room is the real problem, right? Because it it fosters this type of like It fosters incognito thinking he's doing the right thing. But I don't even think I agree with that because I'm sure there's plenty of players that find this shit funny and that are like, all right. Incognito likes me cause around with me. You know? Like just because one person took it hurtfully doesn't mean that everyone else wasn't.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Right. Yeah. And that's true. And it's like if the if if he thinks uh you know his feelings are hurt, so they they they remove that from everybody, why does ten people uh on one side and three people on the other, why do three outweigh the fun quote unquote that they're having? I mean I can agree that hey she has a wolf pussy is probably not the best thing to say. That's funny.",
    "speaker" : "Mike Melo",
    "timestamp" : "34:20-34:43"
  },
  {
    "text" : "You know someone would be like, I wish incognito called my sister Squirtle.",
    "speaker" : "Steve",
    "timestamp" : "34:44-34:48"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "But yeah, i that that's language that some people, you know, i it is what it is. So w now I'm gonna determine I'm so high and mighty that I'm gonna d determine what people should and shouldn't say and when they should say it. That seems insane.",
    "timestamp" : "34:50-35:03"
  },
  {
    "timestamp" : "35:03-36:12",
    "text" : "Yeah. I think his parents had a lot to do with this too. Because how did it get leaked again? Uh that I don't know. I don't know how they got a hold of like the voicemail stuff. Mm-hmm. But I know that there was transcripts between Martin and his parents, and the way he talked to them was like night and day to the way he was texting with Richie. Hmm. Like he was using like, you know, some some pretty like language that was like vocabulary that was for like, you know Turn papers. When you're talking, yeah, exactly. Talking to his parents, you know, talking about all this stuff. And like being like, you know, addressing his emotions pretty thoroughly, but then with incognito, he's One quote I have here is, I'm not gonna make it to dinner. I'm shitting chocolate pudding every 10 minutes, you know? It sounds like he's just trying to be funny, but he can't really He doesn't he didn't seem like he could he didn't have the same humor. He was trying at times, but it didn't quite hit the mark most of it.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "36:13-37:16",
    "text" : "I mean the interesting thing is that like because I don't remember the timeline, but obviously awareness um across the board um has happened in the last 10 years, and I think for the most part, um a positive. So when these situations happen, I think people have a little bit more tools or support where if something is bothering you or whatever, hopefully they're you you're you feel comfortable enough where you can come out and talk about this stuff. But I mean, wasn't this when this come out when this came out, it wasn't like extremely talked about, right? Like wasn't this like sort of uh opening up the discussion like nationwide? On like bullying? Yeah. Somewhat, yeah. For sure. So I mean that's interesting because I think uh, you know the conversation has grown since then, which I think is a plus uh throughout all this, even though their situation didn't turn out so well. Um I don't know. What do you guys think uh about seeing that in sports and sort of the discussions that it's opened up over time?"
  },
  {
    "speaker" : "Andy",
    "text" : "About bullying specifically?",
    "timestamp" : "37:17-37:18"
  },
  {
    "text" : "Yeah, I mean uh I guess overall in in general, but um yeah, but bullying uh and that that environment.",
    "timestamp" : "37:19-37:25",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Yeah, I mean I've been in a lot of locker rooms. And I think like there a good locker room has balance, right? So you have people like Richie, which are great, but then you also have People that are like a Matthew Slater looking yeah, looking out, like more like emotionally intuitive people that are looking out for people like this. And that are leaders too that are respected that can be like that can check mo uh Richie for Martin, be like, hey listen, fuck you. You you're such a Neanderthal, right? And I and Richie will probably be like, yeah, yeah, I know. But then that also makes it feel like Martin's being protected by someone else in the locker room, right? So you have to have both ends of the spectrum to to give it more balance. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "37:26-38:10"
  },
  {
    "speaker" : "Andy",
    "text" : "So does this kind of deteriorate too, Greg?",
    "timestamp" : "38:11-38:14"
  },
  {
    "timestamp" : "38:14-38:40",
    "speaker" : "Greg",
    "text" : "Yeah, so as far as like where it went from there, um obviously so Martin, he you know never really made it back into the league. He like You know, was on a couple teams, didn't really make an impact. And I think he was gone within like three years. He was retired. Um Incognito has had his obviously documented issues since then. There was like"
  },
  {
    "text" : "Fadio's uh Ferrari or Lamborghini or something with a baseball bat?",
    "timestamp" : "38:41-38:46",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, he's definitely got his own uh mental health issues. And he's been pretty forward about it too. He's talked about it in the media as far as like, listen, I battle all the time with my anger and mental health. Um Mar interesting, interesting, Martin. f maybe you know fairly recently ha put up an Instagram post with uh like a picture of a gun and bullets yeah and like tagged as high school And like said something about like bullies will get what's coming to 'em or something like that.",
    "speaker" : "Greg",
    "timestamp" : "38:46-39:18"
  },
  {
    "text" : "Well he tagged some of the Dolphins players too, didn't he? I think so, yeah.",
    "speaker" : "Andy",
    "timestamp" : "39:18-39:21"
  },
  {
    "speaker" : "Greg",
    "text" : "What? Yes. So it sounds like he's not quite over it.",
    "timestamp" : "39:22-39:26"
  },
  {
    "text" : "Oh, here it is. I have it. He uh says Instagram posts it's a picture of a shotgun on a bed with a bunch of like shells around it. And he tagged James Dunleavy, TJ Taylor, 68 Incognito, and Mike Pouncey. And hashtags are Harvard Westlake and Miami Dolphins. I'm assuming Harvard Westlake is his high school. And the quote is when you're a bully victim and a coward, your options are suicide or revenge. Yikes. What? Yikes",
    "timestamp" : "39:26-39:59",
    "speaker" : "Andy"
  },
  {
    "text" : "So I guess that probably explains the relationship a little bit with uh some time passing.",
    "timestamp" : "39:59-40:05",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "So that's the yeah, I mean that's the coward thing we were talking about where it's probably a little bit more passive in that relationship. So Mike had to kick him onto something.",
    "timestamp" : "40:05-40:13",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, posted Andy.",
    "speaker" : "Steve",
    "timestamp" : "40:14-40:16"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:17-40:22",
    "text" : "Um February twenty-second, it doesn't tell me what year. Uh"
  },
  {
    "text" : "Incognito's still playing by the way. I looked it up. I thought he was done. Nope. Plays for the Raiders. No kidding. What you said, 2005, Greg? 15 years",
    "speaker" : "Steve",
    "timestamp" : "40:24-40:35"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "40:35-40:35",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Pretty long. Jesus.",
    "timestamp" : "40:36-40:38"
  },
  {
    "timestamp" : "40:38-40:40",
    "text" : "Yeah, I think he's a good player. That's probably why.",
    "speaker" : "Greg"
  },
  {
    "text" : "So you want to hear some of the hang on, hang on, there's more to this. Earlier, Los Angeles Police Department Detective Peter Dumanis testified that Martin's web surfing on February 9th showed he pulled up a story about incognito just hours before ordering the shotgun from American Gunworks.",
    "speaker" : "Andy",
    "timestamp" : "40:41-40:56"
  },
  {
    "timestamp" : "40:56-40:57",
    "text" : "Whoa.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "40:59-41:02",
    "speaker" : "Andy",
    "text" : "So and I think this got him into legal trouble. I think he got arrested for all this."
  },
  {
    "text" : "Yeah, I heard that.",
    "speaker" : "Greg",
    "timestamp" : "41:03-41:04"
  },
  {
    "text" : "I mean so I I guess that, you know, at least it did open up discussion so that people can talk about this stuff. Um Because also, I mean, unless you feel threatened, you should definitely tell somebody, but there's no point in being in a relationship if you don't want to be in it and you're afraid to be in it anyway. So it's easier said than done, but hopefully it helps, you know, at least give us some tools and uh I don't know, you know, what measures we're taking since then, but that like can help people with that.",
    "speaker" : "Mike Melo",
    "timestamp" : "41:08-41:40"
  },
  {
    "speaker" : "Greg",
    "text" : "Right. It make probably makes people think, hey, is this all in fun? You know, if they have that type of relationship, it probably made them at least think about and be like This guy's kind of quiet. He might be, you know, a similar situation to Jonathan Martin. I should probably like check and make sure.",
    "timestamp" : "41:41-42:00"
  },
  {
    "text" : "Yeah. I mean it's also like you can think of bullying as like it's black and white. Bullying is bad, you know? Right, right. And I'm sure there are cases where bullying is black and white where the kid says stop and you keep doing it, and that's bullying. But this clearly highlights that it's a very gray area and the pack impacted Jonathan for I mean years, right? Yeah.",
    "speaker" : "Steve",
    "timestamp" : "42:01-42:22"
  },
  {
    "text" : "He posted this five twenty nineteen.",
    "timestamp" : "42:23-42:25",
    "speaker" : "Andy"
  },
  {
    "text" : "No, Jesus Christ, yeah. Fifteen years later he's still feeling the effects of it. And I think part of that's also the media coverage you got. Oh, I agree.",
    "timestamp" : "42:26-42:37",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "So you want to hear some of the funny quotes from this? Yeah, you have to brighten this up to end it here. So what if I'm like Martin's kind of like giving him crap crap for something and and Richie says, Oh, I'm sorry I have puss swinging from my nuts. What? Yeah. Well that that's an image. Yeah. Richie uh recounting the previous night. I got the worst hand job ever. My ween is so chafed right now. Oh my god. My wien. W W-E-I-N. I was gonna ask you how you spelled it.",
    "timestamp" : "42:38-43:16"
  },
  {
    "text" : "No, not wiener. I would have bet money on double E's.",
    "speaker" : "Andy",
    "timestamp" : "43:17-43:20"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. My ween.",
    "timestamp" : "43:20-43:22"
  },
  {
    "timestamp" : "43:22-43:34",
    "speaker" : "Andy",
    "text" : "He started spelling wiener and just couldn't thought it was cooler without the ER. It does not be like that. But then again I I'm gonna I'm gonna say that um incognito probably thought the word was cooler without the ER as well."
  },
  {
    "text" : "Hey he just misspelled it because it doesn't have a spell.",
    "timestamp" : "43:34-43:36",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "43:37-44:11",
    "text" : "And to be fair, it's he was probably like a wiener that's childish. I'm gonna call him a wien. So chafed right now. Worst hand job ever. Two stars. Uh there was a lot of talk about prostitutes too, which I guess is fairly common in Miami. Like they'd be like, Oh, you you going to this bar? Or like, how was it there? And they're like, Oh no, it's all prostitutes. Don't bother coming. Yeah. Jesus. So uh Martin doesn't like prostitutes. Richie, can can you guess?"
  },
  {
    "timestamp" : "44:11-44:13",
    "speaker" : "Andy",
    "text" : "I'm I guess he has less of a problem."
  },
  {
    "text" : "Yeah. Martin says, uh nah, I'm grossed out by prostitutes. To which Richie says, ha ha, you cunt the strippers who go the extra mile.",
    "timestamp" : "44:14-44:23",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "44:25-44:26",
    "text" : "Oh man.",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "Oh, Richie. And then the last one I had pulled up was um Richie saying, yo, I got those chicks from last night lined up. Let's go eat with them and bang their mouths.",
    "timestamp" : "44:27-44:39",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "That shouldn't be funny.",
    "timestamp" : "44:41-44:43"
  },
  {
    "text" : "Okay with food? That's so funny. Who knows? Whinin' and dining, baby. Let's go bag their mouth.",
    "timestamp" : "44:43-44:52",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "44:52-44:56",
    "text" : "That's what that's her nick. That one the what the I don't know.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I feel like that might be our sign off.",
    "timestamp" : "44:56-44:58"
  },
  {
    "text" : "No, wait a minute.",
    "speaker" : "Mike Melo",
    "timestamp" : "44:59-45:00"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "45:02-45:02",
    "text" : "Thanks for listening."
  },
  {
    "text" : "Don't forget to bang their mouths. Hey, this is awful. What about uh d do you guys think that this was going on in the Patriots at all? Like just by uh any type of thing that you might have heard over over time? Like do you remember seeing anything like this coming from the Patriots side of things?",
    "timestamp" : "45:03-45:20",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I would think it's a more professional locker room. Right, but I can think of the top of my head.",
    "speaker" : "Greg",
    "timestamp" : "45:21-45:25"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "45:26-45:57",
    "text" : "I hear guys like Vrabel, right? Where now like he's like long gone from the Patriots, but you know, he's doing interviews talking about cutting off his dick and laughing about it and whatever. And again, it's not malicious. It's just like, you know, some bullshit, funny stuff. Right. So if you put him in a locker room with, say, somebody who might not like that kind of stuff, and I obviously Vrabel always came off as like extremely professional, but I'm just saying I I don't know if there were whispers coming from like anywhere else that I can remember or that if you guys um can think of any."
  },
  {
    "text" : "What year was Gronk drafted?",
    "speaker" : "Steve",
    "timestamp" : "45:57-45:59"
  },
  {
    "text" : "Uh Trua twenty eleven.",
    "speaker" : "Andy",
    "timestamp" : "46:02-46:06"
  },
  {
    "timestamp" : "46:07-46:12",
    "text" : "Uh an alternate universe Incognito and Gronk on the same team in the same locker room.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "They would get along with the team.",
    "timestamp" : "46:12-46:13"
  },
  {
    "text" : "Yeah, I don't know. It was incognito on the Bills in 2010. Because he went from the Dolphins to the Bills, right? Oh, that's right. Yeah. Matt and the doll and the Bills like passed on Gronk.",
    "timestamp" : "46:14-46:25",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, I don't know. I mean, do you guys have uh any opinions on this stuff? I've been kind of talking about this stuff, but Andy, I mean we we grew up together. Did you encounter some of this stuff? Because I know we were both quiet. Um I obviously developed uh a little bit of a tongue as we got older, but uh I don't know if you uh you had any uh or how was your childhood, man?",
    "speaker" : "Mike Melo",
    "timestamp" : "46:27-46:46"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "46:47-47:16",
    "text" : "Uh I was never big enough to be able to talk. back to people. So I just had to make jokes out of it all. So I got really good at the self-deprecating humor very quickly. Because I was super annoying as a child and people wanted to beat me up. And so I would uh And as an adult I would ask them to um to to schedule it, please, because I had so many people who wanted to beat me up that I would see if I could fit them in."
  },
  {
    "timestamp" : "47:23-47:40",
    "speaker" : "Mike Melo",
    "text" : "Oh off the top of my head, but we were whip out the uh notebook here. So why you got high school is pretty good then? Uh no we have to talk about this stuff? So well in high school forever, but did we open up about this shit?"
  },
  {
    "timestamp" : "47:41-47:47",
    "text" : "I don't think so. I well, I think my uh defense tactic in high school was to be seen as a Columbine kid",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "47:47-47:54",
    "speaker" : "Mike Melo",
    "text" : "Well yeah, you wrote me into that crazy nonsense. I I I didn't even know what you were talking about. You can you scared me sometimes, man."
  },
  {
    "text" : "Yeah, you know. I had to keep you on your toes But yeah, so everybody ever and I would I would kind of play that up a little bit whenever things the heat got a little too hot.",
    "speaker" : "Andy",
    "timestamp" : "47:54-48:04"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Wait, and why did you do that, you think?",
    "timestamp" : "48:05-48:07"
  },
  {
    "timestamp" : "48:07-48:09",
    "speaker" : "Andy",
    "text" : "Oh, it's a defense mechanism."
  },
  {
    "timestamp" : "48:09-48:11",
    "speaker" : "Mike Melo",
    "text" : "So but what did that accomplish?"
  },
  {
    "text" : "Uh prevented me from being bullied more than I was.",
    "speaker" : "Andy",
    "timestamp" : "48:12-48:14"
  },
  {
    "text" : "Oh, you're trying to intimidate. Uh yeah.",
    "timestamp" : "48:15-48:18",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I suppose. In my own strange way, yes.",
    "timestamp" : "48:19-48:22",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, so I don't know. I mean I I guess we didn't really talk about this stuff. I I can't remember having these conversations with you. Maybe we we just weren't like You know, emotionally there.",
    "timestamp" : "48:22-48:31",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh yeah, no, we definitely weren't. We were too busy wondering what it would be like to hold a girl's hand. We were real fucking cool in high school.",
    "timestamp" : "48:32-48:40"
  },
  {
    "text" : "All right.",
    "timestamp" : "48:41-48:42",
    "speaker" : "Mike Melo"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh that's um which is how you get to be on the uh Pages Dynasty Podcast or the host of the Page Dynasty Podcast. A real fucking shitty upbringing when it comes to opposite sex.",
    "timestamp" : "48:42-48:59"
  },
  {
    "text" : "I don't know, that backpack he had was pretty fucking cool though.",
    "timestamp" : "48:59-49:03",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Right?",
    "timestamp" : "49:03-49:04"
  },
  {
    "text" : "Spiky backpack.",
    "timestamp" : "49:04-49:05",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "49:06-49:08",
    "text" : "Well that was part of the whole Columbine look.",
    "speaker" : "Andy"
  },
  {
    "text" : "Mm-hmm. That's not a good thing to throw around, Mr.",
    "timestamp" : "49:08-49:13",
    "speaker" : "Mike Melo"
  },
  {
    "text" : "I'm not saying I was gonna do anything, but I used that to my advantage. That it had happened and everybody I I I didn't bring it up on myself. It's just as soon as it happened, everybody kind of slowly turned and looked at me and thought",
    "speaker" : "Andy",
    "timestamp" : "49:14-49:25"
  },
  {
    "text" : "What why did you do you feel like everyone thought that or looking back, like or did they actually think that? Like what do you think?",
    "speaker" : "Mike Melo",
    "timestamp" : "49:26-49:33"
  },
  {
    "text" : "That's a good point, Mike. Um it was probably a bit of both. How old are you guys when it happened?",
    "speaker" : "Andy",
    "timestamp" : "49:34-49:42"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "49:42-49:44",
    "text" : "When Combine happened? What grade were you in?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "49:44-49:48",
    "text" : "Why don't we like switch back? That feels about right, yeah."
  },
  {
    "timestamp" : "49:48-49:49",
    "speaker" : "Mike Melo",
    "text" : "In high school?"
  },
  {
    "text" : "Yeah. When was that? That was yeah, April 20th, 1999. So I think we would have just been No, because cause we graduated in 01. So yeah, probably sophomore maybe junior? Give or take?",
    "timestamp" : "49:50-50:08",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, I think you're right. Yeah. But I'm also wondering why that is because obviously, like, you know, and I don't know if everybody goes through this, but you know, you obviously felt that. I felt different things as well. And maybe it was perception, I don't know, because like I said, I you know, as a sixteen, seventeen-year-old kid or even younger, like I'm not emotionally evolved enough to probably process anything. Um But I I also felt like you know until like I got like older and like I said I could maybe like develop a sense of humor and laugh at things Um I felt like things were a little bit harder before that happened. And maybe like you said, it's a defense mechanism where you learn how to just laugh things off and then you know everything becomes a little bit better I think but uh but because I remember like getting into lots of fights when I was younger and I mean you may have prevented a couple um which I'm using my wit Right, yeah. Actually one time you uh you grabbed me and sat me down and was like this is not the one to do and I was like all right gave him a good spanking. Right, yeah. Well that was after Why were such good friends? Right. But uh yeah, so I I I'm wondering like um is that perception or because I I feel like if you're quiet, right, then people might think that's a little weird or off-putting and then they might try to reach out in however way they feel most comfortable, right? And that can sometimes feel like being, you know, demeaning or whatever. But uh I mean uh you guys are are younger. Did you encounter this or was it a different environment? when you guys are, you know, growing up.",
    "speaker" : "Mike Melo",
    "timestamp" : "50:09-51:44"
  },
  {
    "timestamp" : "51:44-51:57",
    "speaker" : "Greg",
    "text" : "Yeah, I I I have uh one from either side of the table here. Cause I was thinking about it of like One, have I ever bullied someone and two, have I ever been bullied?"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "51:57-51:59",
    "text" : "That's also a very good point."
  },
  {
    "timestamp" : "51:59-52:44",
    "speaker" : "Greg",
    "text" : "Yeah, so From the have I bullied thing, there's one thing that came to mind of at UNH, I was on a soccer team, and so this may be like my junior senior year. When you first come there, we all shower together, which is very like strange for a lot of the freshmen because they show up and they've never had to shower around. you know, a team, which can be weird at first. Like you get over it within like a month and it's after that it's not a huge deal at all. But so to like break the ice, I used to like Kind of be like in your face about it, you know, and just be like, yo, in my in my mind, I was like just to be like, hey, this isn't a big deal, you know?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "52:44-52:44"
  },
  {
    "text" : "We all got dicks, let's swing them around. And I remember there was one kid who showed up who was quiet and that was in the locker next to me and I used to like do the aggressive like under the leg. like drying of my nuts, like right like looking him in the eye. And like I I always thought he thought I was funny, but looking back, I'm like, maybe that Wasn't the right thing to do, you know? I mean, he ended up, I think he was a good player, so I think he ended up like finding his way pretty easily. Um But still, if he hadn't been a good player, I think, you know, it could have been easily gone the other way. So I think he was he was comfortable by the time I left for sure. But Those first few months I pro I'm if I had to do it again I might have approached it a little differently.",
    "timestamp" : "52:45-53:33",
    "speaker" : "Greg"
  },
  {
    "text" : "That's fair. What about the other side Yeah, I was gonna ask that.",
    "speaker" : "Mike Melo",
    "timestamp" : "53:33-53:36"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh yeah. So the other side was when I was younger, I was kinda like you guys, a lot a lot quieter. This maybe like sophomore year in high school. And there was this kid. That was kind of like he was like the kid that was always getting in trouble in high school. He used to get suspended all the time. And I don't know like how he like got me in his sights, but he used to just fuck with me all the time. And and like I it was nothing really that malicious, but one time we like used to sit next to each other in English class. This is my sophomore year in high school. And I uh I got called after class and a teacher was like So there's something serious I want to discuss with you. She's like someone wrote on one of the deaths. Greg Brown is a Big smelly N-word with AIDS. And immediately I was like, oh, it's him. There's no fucking way it's not him. That's the type of shit he'd do. And I was just like, yeah, I have no idea why that would happen. And then I had to like go and talk to the fucking guidance counselor or everything. But when I saw it, I was like, dude, what the fuck, man? And he was like, yeah, it was funny, right? And I was like, oh really? But like it never got like malicious and I never felt like I don't know. He was like that to everybody and he was kind of like a fuck up. So like he wasn't really in a position of power because he was just He was just a fuck yeah. Just lashing out indiscriminately more than uh",
    "timestamp" : "53:37-55:12"
  },
  {
    "text" : "Yeah, I mean that's a good point too. There's like a couple of guys, um, once I started viewing things a little differently and you know, you gain a little bit more social and emotional awareness, obviously, as you get older and you get experiences, but there were a lot of guys that had started out contentious, but because I had a different perspective. Um a lot of times like I ended up like becoming friends with those people and it was actually like a real friendship. And you you realize that sometimes It's a communication tactic that they want to reach out and they don't know how and they're trying to be funny like you were saying about incognito. And, you know, sometimes it comes from a place that they're um, you know something in their life is not quite right, maybe, and it's manifesting in this way. Not that it absolves anybody from from acting like that, but I also hate how I have to like I feel like in talking about this stuff, like I was bullied, I was probably a bully too. We're all fucking dickheads. But I like as we're talking about this, I find myself dancing around words and I have to pause and make sure I'm like, it's bullshit. Like Most people nowadays don't talk like this, but I think it's good to have this discussion because it's not just so um bland or",
    "speaker" : "Mike Melo",
    "timestamp" : "55:12-56:19"
  },
  {
    "text" : "Uh also black and white.",
    "speaker" : "Andy",
    "timestamp" : "56:19-56:20"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "Yes. Yeah. It's like it is murky and everyone has their own experiences and if everybody just sat down and was like, oh yeah, I didn't know I was bullying, or yeah, I was bullying because of this. Like you're saying, like you might have done some shit that now you're like, fuck, that was pretty stupid of me. And you can hang up to it, you know? Yeah.",
    "timestamp" : "56:21-56:39"
  },
  {
    "speaker" : "Steve",
    "text" : "I've had a uh co-worker call me relentless. Which is like I think like incredibly apt. Like he's like, you're relentless like when you want to work and like you have a goal in mind, you're you're relentless of that, but you're also relentless when you like want to play.",
    "timestamp" : "56:39-56:53"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "56:53-56:53",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "56:55-58:00",
    "text" : "We would have a bunch of the same shirts just because work gives us a bunch of f free shit. And we would match just like randomly and I would love it and he would hate it. So I would always like try to match him. I'd bring like extra shirts to work that I knew that how did I go change, right? And uh he'd start a Christmas party. with his now wife and uh he got matching onesies like Christmas onesie with her and I found out which ones and then went to Target and I bought one. Oh my and then like to my credit he's like dude Don't wear that and I was like all right I get that like I'm sure like he you know in like you can compare that to Richie Ancognito and Jonathan Martin and he had the wherewithal to be ex Steve like I know that she thinks is funny and like it doesn't really bug me that much, but if you did that, that would piss me off. Now I was like, all right, bet, I got you. I'm not gonna do that because we're fun, we're friends, but I can see, you know, me, I'm sure I've taken it too far at some point in my life. Oh yeah, I'm sure I have too."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I can be relentless in that too. And I I I get that talk often from even my wife. Where she just apparently I'm like a puppy. Where as soon as if I if I'm home first and she comes home from work, I just like I'm sitting there waiting by the door for her to just shower her with affection when all she needs is. To be like to have a minute. And I I don't do that. And I also think that I uh uh probably not uh not just me, but I have um Some like social interaction issues maybe. Um I figured out",
    "timestamp" : "58:01-58:43"
  },
  {
    "timestamp" : "58:46-58:53",
    "speaker" : "Mike Melo",
    "text" : "This guy, man. We can have heart to hearts. I don't see him for a year. Go to a party. How many times is this guy gonna throw me under the bus to get a laugh?"
  },
  {
    "text" : "Every time. I'll throw anybody under a bus.",
    "speaker" : "Andy",
    "timestamp" : "58:53-58:56"
  },
  {
    "speaker" : "Mike Melo",
    "text" : "No, especially me.",
    "timestamp" : "58:57-58:58"
  },
  {
    "timestamp" : "58:58-59:02",
    "text" : "It's everybody. I just know more things I Oh there you go.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "59:02-59:11",
    "speaker" : "Mike Melo",
    "text" : "That's what it is. You're lucky that I uh that uh I I do value our friendship and I do think you're a friend. Oh, well that could change at any minute."
  },
  {
    "timestamp" : "59:12-59:13",
    "text" : "I'll keep that in mind.",
    "speaker" : "Andy"
  },
  {
    "text" : "Fair enough. Let's keep an open dialogue.",
    "timestamp" : "59:13-59:15",
    "speaker" : "Mike Melo"
  },
  {
    "timestamp" : "59:15-59:34",
    "speaker" : "Andy",
    "text" : "Yeah. But like you were saying, Mike, when, you know, I was the quiet kid in high school. And so because of that, everybody thought I was the Columbine kid, but it wasn't just because I was quiet, it was because I was socially awkward as well. So I think to your point when they would come and try talk to me and try to open me up, I didn't know how to interact with them."
  },
  {
    "timestamp" : "59:34-59:35",
    "speaker" : "Greg",
    "text" : "Mm-hmm."
  },
  {
    "text" : "Um, because I didn't know how to interact with anybody. So I was I would come off as strange to people I didn't know. Uh I probably still come off as strange people I do know, but they understand that I'm strange and that's just how I am, so they look past it. Um but I think those sorts of things in high school especially get you a bit of a Uh a reputation.",
    "speaker" : "Andy",
    "timestamp" : "59:35-01:00:00"
  },
  {
    "text" : "Yeah, and I think it's like age is a lot to do with that too, right? You've come into your your own a lot now. You understand who you are. You understand what kind of like people you want to interact with. Whereas at that age you're like hormones are flying. You know, you're learning on the fly how to interact with people. You're trying to finger bang. You don't know, you know, you don't know what's going on. So you just try not to get bad hand jobs that that shape your ween, yeah. Shaping weens, yeah. So it's like all that shit's going on, it's hard to like Take a step back and be like, all right, how is this affecting other people? Because all you can think about is yourself. Oh, absolutely.",
    "speaker" : "Greg",
    "timestamp" : "01:00:01-01:00:36"
  },
  {
    "speaker" : "Mike Melo",
    "timestamp" : "01:00:37-01:00:51",
    "text" : "True. And there's so many like people at in one location, especially at that young of an age where let's say you have like a well-intentioned teacher that's got like thirty-five kids running around like maniacs. Um that's that's tough for anybody."
  },
  {
    "speaker" : "Andy",
    "text" : "And oh yeah. Things are gonna slip through the cracks.",
    "timestamp" : "01:00:51-01:00:53"
  },
  {
    "text" : "Exactly, for sure. I I I think it's like inherent in just, you know, you're trying to find it's that pack mentality, unfortunately, where you're trying to find people that you can gravitate towards so that you don't feel alone and sometimes you know, there's fallout with that. And I think we're trying to figure it out. But yeah, it's it's a it's insane when you're younger.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:00:54-01:01:13"
  },
  {
    "speaker" : "Steve",
    "text" : "And even to your point earlier, Mike, I mean, I think there's a ton of pressure to like fit in. Yeah, back that soon to be it part of that pack. And then as you get older you like, wait a minute, nah, fuck that, I'm just gonna be me. Yeah.",
    "timestamp" : "01:01:13-01:01:25"
  },
  {
    "timestamp" : "01:01:25-01:01:29",
    "speaker" : "Greg",
    "text" : "Guys, I think we just solved the uh school shooting problem in the US. Ye"
  },
  {
    "timestamp" : "01:01:30-01:01:38",
    "speaker" : "Andy",
    "text" : "Everyone just everyone just listened to the spot, right? Yeah. I don't know if we can do another episode after this."
  },
  {
    "text" : "Yeah, Richie Incognito is really good.",
    "timestamp" : "01:01:38-01:01:40",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:01:41-01:01:43",
    "text" : "Maybe we'll tackle cancer next."
  },
  {
    "text" : "I'd rather not.",
    "speaker" : "Mike Melo",
    "timestamp" : "01:01:45-01:01:47"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, that one seems black and white. Alright, maybe football then.",
    "timestamp" : "01:01:47-01:01:50"
  },
  {
    "timestamp" : "01:01:51-01:01:54",
    "speaker" : "Mike Melo",
    "text" : "Alright, yeah. With a little football or not football."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:01:55-01:01:58",
    "text" : "Yeah, whole podcast episode with no football or not football."
  },
  {
    "timestamp" : "01:01:59-01:02:05",
    "speaker" : "Mike Melo",
    "text" : "I don't know how I feel about that. Not the whole thing. We gotta we gotta spread it out. There's only so much knowledge I can take."
  },
  {
    "timestamp" : "01:02:07-01:02:08",
    "speaker" : "Andy",
    "text" : "Is that football or not football?"
  },
  {
    "timestamp" : "01:02:09-01:02:11",
    "speaker" : "Mike Melo",
    "text" : "I don't know, dude. I see what you can do. How much can you take?"
  },
  {
    "timestamp" : "01:02:12-01:02:13",
    "speaker" : "Greg",
    "text" : "Oh yeah, I'll give you some knowledge, buddy."
  },
  {
    "timestamp" : "01:02:14-01:02:29",
    "speaker" : "Mike Melo",
    "text" : "Yeah, some knowledge. Yeah, yeah, I see what you alright. Well, if anybody out there got anything from this episode, fantastic. And if not, we strongly apologize for everything. We don't condone anything that we said. We're not professional hands."
  },
  {
    "timestamp" : "01:02:29-01:02:34",
    "speaker" : "Andy",
    "text" : "Uh if as Mama Brown said at the beginning of this episode, we're we're very naughty boys."
  },
  {
    "timestamp" : "01:02:34-01:02:41",
    "speaker" : "Mike Melo",
    "text" : "So we're probably intentioned across the board. So God bless."
  },
  {
    "text" : "Or not.",
    "speaker" : "Andy",
    "timestamp" : "01:02:41-01:02:42"
  },
  {
    "text" : "God bless.",
    "timestamp" : "01:02:42-01:02:43",
    "speaker" : "Mike Melo"
  }
]