[
  {
    "speaker" : "Mom",
    "timestamp" : "00:00-00:17",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Listen, go right ahead. I am not your mother."
  },
  {
    "text" : "Welcome back to the Patriots Dynasty Podcast, the only podcast where we're going back and re-watching every game of the dynasty era. Uh we are technically getting through the 2005 season, but we thought we'd take a break because um we haven't recorded an episode in a while, but there has been a renewed interest in our podcast. We're trying to figure out why. Uh and I think we decided it was probably because there is a um documentary on Apple TV that is uh of a similar name and so people are looking for that. Uh so we thought we'd just hop on the bandwagon. So what we're gonna do is we're going to rewatch the rewatch of the uh dynasty and uh talk about that instead. So we'll do a couple episodes on that and then we'll get back to the regular season of 2005. With me this evening are my trusty, well, one of my trusty brothers, uh, Greg Brown. Good to see you, bud.",
    "speaker" : "Andy",
    "timestamp" : "00:22-01:18"
  },
  {
    "text" : "Good evening, Andy.",
    "timestamp" : "01:19-01:20",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:20-01:20",
    "speaker" : "Andy",
    "text" : "Great to see you."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:21-01:23",
    "text" : "Very well. Nice."
  },
  {
    "timestamp" : "01:23-01:35",
    "text" : "I like I like the fit you have on today. The uh selfies The Celtics hat for that looks like it's probably from the 80s and also an uh England soccer jersey. Probably looks like it's from the 80s.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:36-01:40",
    "text" : "Dude, I just moved from one sport to the next. Fair enough."
  },
  {
    "speaker" : "Andy",
    "text" : "No Bruins, huh?",
    "timestamp" : "01:42-01:43"
  },
  {
    "timestamp" : "01:44-01:48",
    "speaker" : "Greg",
    "text" : "I don't know. They stung me last year. I'm still her. That's fair."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:48-01:50",
    "text" : "Didn't the Celtics also sting you last year?"
  },
  {
    "speaker" : "Greg",
    "text" : "Uh kind of, but not as much as the Britons.",
    "timestamp" : "01:50-01:52"
  },
  {
    "timestamp" : "01:53-02:15",
    "text" : "That is a fair play. All right. And we don't have Steve Brown because he is off gallivanting and potentially meeting Tom Brady tonight. So uh hopefully he puts it in good word for the podcast. Um, and hopefully that doesn't get him kicked out of whatever event he's in. But also with us we have our reliable Tim Turn. Tim, the intern. Good to see you, Tim.",
    "speaker" : "Andy"
  },
  {
    "text" : "Good to see you.",
    "speaker" : "Tim",
    "timestamp" : "02:15-02:16"
  },
  {
    "timestamp" : "02:16-02:45",
    "speaker" : "Andy",
    "text" : "two guys have been a while yeah so we are talking about the dynasty new england pay colon new england patriots the controversial Yes, exactly. So uh let's just go through uh how they portray themselves, uh, and then we'll kind of talk about uh the first couple episodes here and maybe a little bit uh of some of the reaction that has come since this has been released."
  },
  {
    "timestamp" : "02:45-02:57",
    "speaker" : "Greg",
    "text" : "Well before we start here, right? We're gonna segment this, right? A couple episodes at a time. So we're gonna start with the first two here. Yeah. So question, have you what, Andy, you've just seen the first two, right? Correct. Tim?"
  },
  {
    "timestamp" : "02:58-02:59",
    "speaker" : "Tim",
    "text" : "I watched the whole thing."
  },
  {
    "timestamp" : "02:59-03:06",
    "speaker" : "Greg",
    "text" : "Whole thing. All right. Cause that's gonna play into this, I think, a little bit. I've seen up through like four, I believe."
  },
  {
    "timestamp" : "03:06-03:06",
    "text" : "Okay.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "03:07-03:16",
    "text" : "So I think some of the controversial stuff is later on, but we'll try to isolate this podcast to what they what they discuss in the first two.",
    "speaker" : "Greg"
  },
  {
    "text" : "All right. Yeah, we'll we'll do our best. And maybe Tim will get some teasers. Oh, all right.",
    "timestamp" : "03:16-03:21",
    "speaker" : "Andy"
  },
  {
    "text" : "I I really don't remember too much, but I I do remember the things I got pissed off at. So those are the things I'll probably focus on.",
    "timestamp" : "03:22-03:29",
    "speaker" : "Tim"
  },
  {
    "text" : "That's all Tim wrote down. He's got a little hate list.",
    "timestamp" : "03:29-03:31",
    "speaker" : "Andy"
  },
  {
    "text" : "We're trying to remember what aggravated me in the podcast. So where I'm really I'm in this podcast, I'm going uh to do my best, uh Greg Brown. impression.",
    "speaker" : "Tim",
    "timestamp" : "03:34-03:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh that sounds like an Andy Brown impression.",
    "timestamp" : "03:44-03:46"
  },
  {
    "timestamp" : "03:49-03:52",
    "speaker" : "Tim",
    "text" : "Well it's a little bit, you know, uh I take a little bit of every brother."
  },
  {
    "timestamp" : "03:52-03:54",
    "speaker" : "Andy",
    "text" : "So this is true, yeah."
  },
  {
    "speaker" : "Tim",
    "text" : "Yeah. I am I embody all of you guys as I as much as I can.",
    "timestamp" : "03:54-03:57"
  },
  {
    "text" : "It's very weird, but it actually is.",
    "speaker" : "Andy",
    "timestamp" : "03:58-03:59"
  },
  {
    "timestamp" : "03:59-04:01",
    "text" : "It really it really is very strange.",
    "speaker" : "Tim"
  },
  {
    "text" : "All right, so let's talk about this documentary. Um you can find it on Apple TV if you want. Um It was called, like we said, the The Patriots Colon. Oh no, the Dynasty Call and New England Patriots, which is kind of a strange name. Um, but the the little blurb that they give is quote, go inside the franchise's 20-year journey from the unique chemistry that fields six Super Bowl wins. to the internal strife that sparked a turf war. Tom Brady, Bill Belajak, Robert Kraft, and key players reveal the road to and cost of greatness. So Tim, as somebody who's watched the whole thing, uh how do you feel that encapsulates the documentary?",
    "timestamp" : "04:03-04:44",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "04:46-04:46",
    "speaker" : "Tim",
    "text" : "Um"
  },
  {
    "text" : "I guess fair representations?",
    "speaker" : "Andy",
    "timestamp" : "04:49-04:51"
  },
  {
    "speaker" : "Tim",
    "text" : "Yeah, I guess it's a fair representation, but when you kind of get into the the thick of it, it's like Like you you can tell what message is trying to be portrayed. Like and you know, I guess with every story there has to be a protagonist and an antagonist and They make that very, very clear who is who.",
    "timestamp" : "04:51-05:12"
  },
  {
    "timestamp" : "05:12-06:02",
    "speaker" : "Andy",
    "text" : "That is what I've heard. Because um, do we want to talk about like media reaction and stuff like that now, or should we hold that off till later on? Um leave that to Greg. Let's do a little bit now. All right. Um so uh generally it got um Kind of uh a mixed reaction, let's say. Um if you look up like the scores of this, like on IMDB, it got an 8. 4 out of 10. But uh all the reviews like anybody who wrote a review gave it like one star and a negative review. Um, that it was very biased Um and kind of similar on Rotten Tomatoes, it got 100% critic rating, where as a documentary, the critics thought it was fantastic. Um, but all of the reviews uh from those critics don't say anything about football whatsoever. Um it's more."
  },
  {
    "speaker" : "Greg",
    "text" : "You can't trust Rotten Tomatoes, right? I think we if anyone that's followed like the movie industry, Rotten Tomatoes is debunk.",
    "timestamp" : "06:03-06:10"
  },
  {
    "text" : "Is it?",
    "timestamp" : "06:11-06:11",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "06:11-06:30",
    "text" : "It's terrible. It's it's absolutely horrendous. Yeah. Like there's so many movies out there now that are like the gap between the critic rating and the audience rating is so drastic that there's clearly some sort of like they're getting money from these these companies to to to kind of fluff the rating. So I would take all that with a grain of salt, whatever you see on Rotten Tomatoes."
  },
  {
    "timestamp" : "06:30-06:40",
    "speaker" : "Andy",
    "text" : "So is the viewer rating more um Representative of the actual rating because it got a hundred percent critic rating, but a fifty-three percent viewer rating."
  },
  {
    "timestamp" : "06:40-06:53",
    "speaker" : "Greg",
    "text" : "Yeah. So I mean the famous one is the Dave Chappelle stand-up, the controversial one. It was like critics had it like a 10% and fans had it like a 90%. So it's like if it is like a controversial topic too, I think that plays into it."
  },
  {
    "text" : "Yeah. Um I think there was like Tim alluded to a lot of um kind of negative reaction from fans, especially. Um and the one thing that I remember seeing from uh one of the people that has watched it, uh who is kind of one of the more impartial people, was As he was watching it saying, uh asking the question, who is this for? Who is this documentary for? Because it's a lot of behind the scenes stuff that you would think Patriots fans would like. Um, but the slant is so apparently negative that uh that turned off a lot of pages fans. But are not is this aimed towards non-pages fans who really may not give a shit what the um behind the scenes of the Patriots dynasty actually was I think it's a lot of pandering like they're they're trying to touch",
    "speaker" : "Andy",
    "timestamp" : "06:53-07:55"
  },
  {
    "timestamp" : "07:55-09:06",
    "speaker" : "Tim",
    "text" : "every like facet to you know keep everyone interested and I think w in that depending on who you are and how you feel about the Patriots Like there's a either there's not enough that covers a team, there's too much negativity. Like there's just so many ways an opinion can go based on it But I think if if you're like someone that doesn't feel one way or another about the Patriots, I think like objectively, you know, it's it's a good podcast. I mean a good documentary, but um for my taste I w wanted more. And obviously we know that I'm a sports radio drone, but There is a lot with like this first episode where the guys that were actually reporting on it, like Felger was saying, uh, like they tried to paint it out like um, oh, it was, you know. Such a tough thing uh to move away from Drew and all this stuff. And a lot of people were like, that wasn't true at all. Everyone was happy when uh we made the transition from Bledsoe to Brady because Bledsoe would just throw that like devastating uh interception at the end of the game just to to you know, ruin it for whatever comeback, you know, the Patriots might be making."
  },
  {
    "speaker" : "Andy",
    "text" : "That's fair.",
    "timestamp" : "09:07-09:08"
  },
  {
    "timestamp" : "09:08-09:25",
    "text" : "Um so what do we think it's a hit piece? Because that's a lot of the chat around Reddit. It's craft is craft is made as a hit piece against Belichick. And I think part of it stems from this like Kraft Dynasty LLC thing. Right. That's the the credits.",
    "speaker" : "Greg"
  },
  {
    "text" : "I mean I I Go ahead then I was just gonna say it's like you know it in The Godfather with uh I don't know who it is, but like it's a garage wire from the backseat to Belichick. Like It's just it it's bad. That's a setup.",
    "speaker" : "Tim",
    "timestamp" : "09:25-09:41"
  },
  {
    "text" : "I mean, I think there's I think there's probably maybe something to that craft uh dynasty LLC piece. The official word was that it's just a way for the crafts to protect the actual uh footage that the documentary people used. Um and allow them to use it, but not to actually like keep it for themselves, which makes sense. But also does that make you beholden to what you put in it, right? Um if you're uh access to this is given to you from the crafts and does that make you want to make the crafts look good which in turn is a way to make Belcheck look bad",
    "timestamp" : "09:41-10:24",
    "speaker" : "Andy"
  },
  {
    "text" : "Well I mean the way that crap comes out smell like roses and like you know if you break it down everything that was good was a wee and everything that was bad was a he so",
    "timestamp" : "10:25-10:35",
    "speaker" : "Tim"
  },
  {
    "text" : "But the the interesting piece, right, is obviously filmed over multiple years, right? So it's like they didn't know Bill was leaving. So it's not like Bill left and they're like, all right, let's release this hit piece. But I mean, obviously editing. You can do all sorts of narratives post production with editing and stuff like that. But I don't know. It feels like the intent maybe when they started was like, yeah, we'll try and make this documentary and then Once things got to where they were, they were like, all right, you know, we can uh we can maybe make it craft look a little bit better here.",
    "timestamp" : "10:37-11:11",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, and I think uh to your point about the editing, there's even like a lot of the players who participated in this, uh, Matthew Slater and Rodney Harrison, Devin McCourty all kind of said You know, I sat down for, you know, two, three, four hours of interviews, and they used, you know, two minutes of what I said and they pulled the most negative thing that I said about Belichick, and that's what they used, you know.",
    "speaker" : "Andy",
    "timestamp" : "11:12-11:38"
  },
  {
    "timestamp" : "11:39-11:50",
    "speaker" : "Greg",
    "text" : "I'd be so pissed if I had to I got to travel to New York, Harrison. He's like, I sat for six hours and they used like a three-second bit from his interview. It's like, well, why is it exactly you know?"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. So, um, yeah, so it sounds like there's been a lot of negative reaction from Patriots fans and even some people who were involved in this, um, or even people who weren't. Uh Kyle Van Nooy was asked if he uh was in it. And he said no, but thank God I wasn't because it looks like uh a hatchet job. And Dante Skarnekia said basically something similar. They asked him if he had watched it and he said, no, I'm not, I don't plan on it, um, for similar reasons. So um As somebody who is the uh resident Belichick apologist, I'm going to go into this with as much of an open mind as I can. Um that's what I've told myself. So I think with that being said, I think we'll let's jump into we're gonna do the first two episodes. Um episode one is called backup plan, and I'll read the little blurb on that. It says uh After Drew Bonzo suffers a devastating injury, Robert Kraft and Bill Belichick put the hopes of the franchise in sixth-round draft pick Tom Brady. So we'll do that one. We'll do episode two, which is titled The Snow Bowl. Uh Belchak shocks the world by doubling down on Brady. An icy showdown with Oakland Raiders redefines what's possible for the Patriots. So We're getting uh not even all the way through the 2001 season in the first two episodes that are about 45 hour hour long, something like that. Um So let's all right, let's start at the beginning, I guess. Um I was a little surprised that it just started with Kraft buying the team. And it was just like a quick blurb about the um Like from from the press conference where they're introducing him and then you just talk about, you know, they showed a couple of newspaper articles and then moved on from there. Um It was huh? Yeah, exactly. The paper the paper boy.",
    "timestamp" : "11:51-13:55"
  },
  {
    "speaker" : "Greg",
    "text" : "Um but he's a local fan, Andy.",
    "timestamp" : "13:55-13:58"
  },
  {
    "timestamp" : "13:58-14:36",
    "text" : "He is, and and I'll give him credit for that. And I will still give him credit for all that stuff about um, you know, not moving the team and and the the shrewd way that he was able to buy the team. Which I thought they would touch on more because having read the dynasty book that this is based on, like the whole like first couple chapters is on how Kraft was able to buy the team because it was actually kind of a pretty shrewd business move about, you know, buying the land and buying the parking and all this stuff, and then basically not allowing the team to be moved. And forcing them to sell to it.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "14:38-15:16",
    "text" : "Like craft in these first two episodes just strikes me as like A corporate like PR release. You know what I'm saying? And that might just be like not like him trying to be strategic, but that's just how he is all the time because he's the owner of a football team. But like All this shit about like, you know, I was a fan. I just wanted to chip. No, you didn't. You wanted to make money like any other businessman in the world. Let's be real. Let's call it what it is. And that's like, you know, that's you find that everywhere you go. Like My company. Well, we want to save lives because we're medical the No you don't. Yeah. You care about the bottom line and that's it, you know? It's true. It's true."
  },
  {
    "text" : "I I don't agree with that. I do think initially, like, yeah, he was a fan, but I think that you pushing that down my fucking throat. Time and time and time again. And now like he he just does that all the time. Whenever he's talking, like, I know this is getting away from it, but like Like the things that happen now, he's like, well, you know, as a fan and da-da-da-da. I am a fan. Hey, don't forget. Hey, no, I'm a fan too. So this affects me. Shut the fuck up. I don't care. I don't give a shit. You make way more money than I do. Spend some of that goddamn money that you had. Put it in the team.",
    "speaker" : "Tim",
    "timestamp" : "15:17-15:52"
  },
  {
    "timestamp" : "15:52-15:58",
    "speaker" : "Andy",
    "text" : "Yep. Sorry. No, that's that's fair, especially with the whole run through you baby."
  },
  {
    "text" : "It's pouring, baby.",
    "timestamp" : "15:59-16:01",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "16:01-16:06",
    "text" : "I mean especially with the the whole like uh the report card that came out about the teams and the owners and the coaches and stuff."
  },
  {
    "timestamp" : "16:07-16:14",
    "speaker" : "Tim",
    "text" : "Oh I didn't know I didn't know anything about that. Oh, you run the fucking team, but you didn't know a goddamn thing about that. You didn't know that there was no child care for your players"
  },
  {
    "text" : "Even though the the exact same report came out last year too, and they got similarly bad grades. They actually went down this year. Yep. That's bad. It's not it's not a good look. No, it's not.",
    "timestamp" : "16:14-16:24",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Um I'm glad they did that. I thought I thought that was really interesting, the report, God thank.",
    "timestamp" : "16:26-16:31"
  },
  {
    "timestamp" : "16:31-16:37",
    "speaker" : "Tim",
    "text" : "Yeah, I thought so too. I like it. And that came out in week five, and he tried to say three weeks ago that he had just heard about it."
  },
  {
    "timestamp" : "16:37-16:46",
    "text" : "Like dude, what are you talking about? Well then you're a bad owner. Yeah it's literally. Yeah. You should be like waiting for that thing to come out so you can figure out what to do.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Having said that, uh it could be worse, you could have Lamar Hunt as your owner.",
    "timestamp" : "16:46-16:51"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "16:51-16:54",
    "text" : "Who wants he actually wants to move the team to Dallas too."
  },
  {
    "text" : "Oh, I'm sure he does, but one, he's not gonna be able to move it to Dallas, but he might be able to move it somewhere.",
    "speaker" : "Andy",
    "timestamp" : "16:55-16:59"
  },
  {
    "text" : "Or art model, dude. That was gonna be one of the highest notes here, dude. There's a there's a scene in this where they're talking about Belichick back in Cleveland in the first episode and how like that all went sour and then they moved the team. And there's there's a clip there of them, some of the fans hanging Art Model in effigy. Yeah. Art Model and Bill Belichick. Yeah. Getting hung in effigy?",
    "speaker" : "Greg",
    "timestamp" : "16:59-17:25"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:25-17:33",
    "text" : "Art Modell, I get. Bill Belichick? Like Art Model's moving the team, your beloved team. Bill Belichick, he's the coach. Like he doesn't have a choice in the matter."
  },
  {
    "speaker" : "Greg",
    "text" : "Like he's just hanging anybody in effigy Andy is ridiculous.",
    "timestamp" : "17:33-17:37"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:37-17:37",
    "text" : "That's true."
  },
  {
    "timestamp" : "17:38-17:42",
    "text" : "I'm an anti-fans hanging people in effigy over football. Okay.",
    "speaker" : "Greg"
  },
  {
    "text" : "So you're telling me all this work that I put together with a Greg Brown effigy for not all.",
    "timestamp" : "17:43-17:48",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "17:50-17:59",
    "text" : "Imagine what would happen if someone did that nowadays. Oh, you got canceled so fast. Hung someone in effigy, how how like nuts the whole social media would go."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:00-18:07",
    "text" : "I'm a little surprised nobody hung Brady in effigy, to be honest. I know. Maybe we should do it. Who should we hang? Uh craft."
  },
  {
    "speaker" : "Tim",
    "text" : "Yeah. That's what I'm leaning towards.",
    "timestamp" : "18:07-18:10"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "18:10-18:24",
    "text" : "Yeah. That would go down well. Yeah, I there you go. Um yeah, I was a little surprised. by that um that Cleveland section of of Belichick."
  },
  {
    "speaker" : "Tim",
    "timestamp" : "18:26-18:34",
    "text" : "Because that just it shows you that's like Those are the the little like breadcrumbs of like, all right, here it comes."
  },
  {
    "timestamp" : "18:34-18:44",
    "text" : "Like we're gonna Yeah, it's not blatant, but it's just like yeah, you it's not factually wrong, but you yeah, you cherry pick certain things and angle it one way or another.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because I I actually just finished reading um the Belichick biography. Um By a guy who didn't actually manage to talk to Bill Belichick, but you know, whatever. Yeah. Uh it had a lot about his Cleveland stuff in there. Um and There was a lot of like Belichick had made some mistakes and whatnot, you know, first time coaching all that garbage. But I think um Like him moving on from uh Bernie Kozar and bringing uh Vinny Tessa Verdi was like surprisingly similar to this Brady Belichick, uh Brady uh Bledzo. decision. Um and it was the right one then too, but uh it's just one of those things where when he says I do what's best for the team, like the he's not saying that as like some sort of just like wrote response to shut the media up. I think that's just literally what he believes and that's just like his motivation for everything he does.",
    "timestamp" : "18:44-19:42"
  },
  {
    "text" : "Yeah, take some balls too, right? Because it it backfired on the first time and then it comes around the second time. Doesn't he have the balls to just do it again? Like say what you want. Like that took some nuts.",
    "timestamp" : "19:42-19:54",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "19:54-20:01",
    "text" : "And what was his quote? Something about uh I do a special for the team. P-E-A-M team. Like just spelling it out.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I guess he did do it again, right? With Brady on the way out. That didn't really work. Yeah. So he's one through three.",
    "timestamp" : "20:01-20:08"
  },
  {
    "timestamp" : "20:08-20:14",
    "speaker" : "Andy",
    "text" : "Uh yeah, I guess. So better than everybody else."
  },
  {
    "timestamp" : "20:15-20:20",
    "speaker" : "Tim",
    "text" : "Has this like watching these first few episodes has it changed your opinion on on Bill Belichick at all?"
  },
  {
    "timestamp" : "20:21-20:43",
    "text" : "Uh I'm actually like a little more soft on him. Same exactly. I just because I'm it you know what I thought about it too and I was like It's like when you have like a family member that's driving you crazy and you're like, I'll go and complain to my other family members and be like, this guy's driving me crazy. But if someone from the outside is like your family member sucks, I'm like, yo, fuck you, dude. No, he doesn't, you know.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "He's talking about me, I'm pretty sure.",
    "timestamp" : "20:44-20:46"
  },
  {
    "timestamp" : "20:50-21:08",
    "speaker" : "Greg",
    "text" : "You know what I mean though, right? Like some of you You're allowed to well you know what else did that when um when the those US athletes went to the the Olympics and they did like the You The kneeling thing or they were getting booed and stuff. Oh yeah. I was like, you know what? We're allowed to complain about America. You fucking Europeans are not allowed to do it, okay?"
  },
  {
    "text" : "Oh, that's fair. Yeah, I I used to do that uh when I was in England, I would get drunk and argue uh about people, uh argue with Europeans about George Bush. I'm like, no, you don't get to say shit about George Bush. I get to say shit about George Bush. That's right. But if you say shit about George Bush, we will bomb the fuck out of your country. Kick in the door. That's right Uh I will say uh this started with a bang. Uh a minute and a half in. Um There were some choice quotes from Bill Belichick. First was there's gonna be some things that aren't fucking great, which I feel like we need is just like a drop for this podcast because that's just Still Bill Balacek.",
    "timestamp" : "21:10-21:54",
    "speaker" : "Andy"
  },
  {
    "text" : "He's saying that as he's being like interviewed for the documentary?",
    "speaker" : "Tim",
    "timestamp" : "21:55-21:58"
  },
  {
    "timestamp" : "21:58-22:00",
    "speaker" : "Andy",
    "text" : "No, that was just like in the locker room."
  },
  {
    "speaker" : "Tim",
    "text" : "Oh, oh, oh.",
    "timestamp" : "22:00-22:01"
  },
  {
    "timestamp" : "22:01-22:12",
    "speaker" : "Andy",
    "text" : "Yeah, just yeah. And then the other one was uh this this was him being interviewed, I think. And it was uh how do you make history? You win. Not twice, you win again and again. Like fucking."
  },
  {
    "speaker" : "Greg",
    "text" : "He's so uncharismatic though in those interviews. Yeah.",
    "timestamp" : "22:14-22:17"
  },
  {
    "text" : "Uh I think those on purpose.",
    "timestamp" : "22:17-22:18",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Weirdly shaped, which I think it is, but what's wrong? The way he like sits back in his chair and it's like he looks extremely uncomfortable.",
    "timestamp" : "22:23-22:32"
  },
  {
    "speaker" : "Andy",
    "text" : "And on top of that, um, one of the things I noticed was, you know, they they show these like clips of, you know, back in the day, back in the early 2000s, and everybody looked younger. Except Bill Belichick. He looked exactly the fucking same. Yep. Looked the same in 2001 as he does today.",
    "timestamp" : "22:34-22:50"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "22:50-22:52",
    "text" : "Just dated clothing."
  },
  {
    "timestamp" : "22:52-23:11",
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. Uh also, yeah, speaking of his clothing, one of the things that I would down, they were showing him in Cleveland, like drawing something up on the chalkboard. And it looked like he was wearing something made out of a black trash bag. It was like a a sh like almost like a shirt or something, but it just looked like it was made out of black trash bag material."
  },
  {
    "speaker" : "Greg",
    "text" : "That's cotton, Andy. Yeah.",
    "timestamp" : "23:12-23:14"
  },
  {
    "text" : "Was it? It was it was a style.",
    "timestamp" : "23:14-23:15",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Is that Leica?",
    "timestamp" : "23:16-23:17"
  },
  {
    "speaker" : "Andy",
    "text" : "I I don't know. I'd never seen it before, but God he did not look good in that. Jesus. I mean to be fair, he's not exactly a fashion icon, but that was one of his rougher looks, which is surprising to me because he's got a lot of them.",
    "timestamp" : "23:17-23:30"
  },
  {
    "speaker" : "Tim",
    "text" : "A fashion icon. He made the hoodie. He's the hoodie.",
    "timestamp" : "23:32-23:35"
  },
  {
    "text" : "Uh yeah. But he's like an anti-icon though, or an anti-fashion icon.",
    "timestamp" : "23:36-23:39",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "23:40-23:45",
    "text" : "Well I mean it's like it's one of those things where it's like I'm not doing this to be cool and then he makes it cool.",
    "speaker" : "Tim"
  },
  {
    "text" : "Yeah, yeah, yeah. fashionable. Yeah, yeah. Good point. All right. Um I think we should probably talk a bit about Drew Bledzo because a lot of this is focused around him. I gotta say he has a great sense of humor about all of this. And again, kind of going off of Tim's question about how do you feel about Bill Belichang after watching, how do you feel about Drew Bledsoe after watching this?",
    "timestamp" : "23:46-24:15",
    "speaker" : "Andy"
  },
  {
    "text" : "I love him. Absolutely love him. I didn't love him so much as a player, if I remember correctly. I remember it was frustrating to watch, but As a guy, I can't find anything wrong with him.",
    "speaker" : "Greg",
    "timestamp" : "24:15-24:27"
  },
  {
    "timestamp" : "24:27-25:12",
    "text" : "I always remember mom talking about um how she thought Parcells ruined Drew Bledsoe. Um Because sh her thing was um Parcells wanted a downfield passing game. And I'm too young to remember if this was the case or not. So I I'm going off of what she says. Um but so Tom would basically have to, or um Drew would have to stand in the pocket and, you know, take a bunch of extra hits. And that kind of ruined his kind of what they they had touched on in this episode. It kind of ruined him later on in his career where If he saw pressure, he would just kind of like turtle on it towards the end of his Patriots. And probably, you know, the rest of his career too. Just because he'd taken so many shots.",
    "speaker" : "Andy"
  },
  {
    "text" : "But what else was he supposed to do? He couldn't run.",
    "timestamp" : "25:12-25:15",
    "speaker" : "Tim"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:15-25:41",
    "text" : "Yeah. He was no, he he was surprisingly mobile for his size, um, at least earlier on. So I remember when we first started doing this podcast, I I had started with a 2000 season. Um, and seeing him on the move was surprising, but he did a more than you remember. And he was uh shockingly effective at it for a big, you know, giraffe looking dude."
  },
  {
    "text" : "Who's his comp? Who would you comp him to? as a runner.",
    "timestamp" : "25:42-25:45",
    "speaker" : "Tim"
  },
  {
    "text" : "Ryan Tanhill.",
    "timestamp" : "25:45-25:47",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "25:48-25:53",
    "speaker" : "Tim",
    "text" : "Um I mean if the if you're saying Ryan Tanhill, that's a good he he's pretty"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "25:53-25:58",
    "text" : "effective as a yeah kind of like a a a taller, heavier Ryan Tannehill I would say."
  },
  {
    "timestamp" : "25:58-25:58",
    "text" : "Okay.",
    "speaker" : "Tim"
  },
  {
    "text" : "Like he could he could kind of lower the boom but wasn't he was kind of awkward about it, you know? Okay.",
    "timestamp" : "25:58-26:04",
    "speaker" : "Andy"
  },
  {
    "text" : "Um and I I agree with Mama Brown's take.",
    "timestamp" : "26:04-26:07",
    "speaker" : "Tim"
  },
  {
    "text" : "then yeah um but like in this they were talking about uh how oh he was talking about how uh you know when the game got towards the end and you know it was crunch time That's when things would slow down for him and uh, you know, he would get that's where he felt like he was playing at his best. Which um I think there are especially earlier in his career when he went to the Super Bowl um in '96, '97. There are examples of that. And then, you know, there are some games under Parcells where The game where I think he set the record for attempts against um Vikings. The Vikings, yeah, and that comeback win. Um so I I I could I could see that. Um And so the the documentary who I was asking the questions in the documentary was saying, you know. So it's kind of like in the uh that same category as is, you know, Tiger Woods and Michael Jordan and those kind of guys. He's like, yeah, yeah, most people put me in the same category as, you know, Tiger and Jordan.",
    "timestamp" : "26:06-27:06",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "27:09-27:11",
    "speaker" : "Tim",
    "text" : "He's got a great personality. Yeah."
  },
  {
    "text" : "Humility. But like what I liked about it too was like because it went through the whole like, you know, he gets hurt and then he's healthy again and they're not playing him. And I thought like Throughout the whole thing, they showed a lot of the interviews too, but he was very like open about being upset about it. Yeah. Yeah. Without throwing anybody under the bus or without being like No, fuck Bill Belichick, fuck Dom Brady. He still was like, I'm gonna help the team win, but I'm clearly not pleased with it, you know? Which it's a hard line to walk, but I thought he did it perfectly.",
    "speaker" : "Greg",
    "timestamp" : "27:11-27:40"
  },
  {
    "timestamp" : "27:40-27:41",
    "speaker" : "Andy",
    "text" : "Yeah, it was very classy."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, absolutely.",
    "timestamp" : "27:42-27:42"
  },
  {
    "text" : "There's no other yeah.",
    "speaker" : "Andy",
    "timestamp" : "27:43-27:44"
  },
  {
    "timestamp" : "27:44-27:45",
    "text" : "Go ahead.",
    "speaker" : "Tim"
  },
  {
    "timestamp" : "27:45-27:48",
    "speaker" : "Andy",
    "text" : "No, I was gonna say you couldn't have handled it any better. Like there's no other way to handle that better."
  },
  {
    "text" : "Yeah, because I I feel like at the time, I mean I I was only I think I was only like eight or nine years old. But w at the time I remember him I feel like he got a lot of unfair like bashing for the way that he responded because obviously his body language isn't like the most cheery but I mean, when you think about it, the guy just got paid $100 million to beat a franchise quarterback, and then, you know, he could have died, literally could have died on the field. Yes. for what happened and and I think in hindsight it looks a lot better because it's like he really and he the way that he was for Brady, he was he was",
    "timestamp" : "27:49-28:27",
    "speaker" : "Tim"
  },
  {
    "text" : "a great you know like mentor to him yeah yeah he didn't just kind of not like check he didn't check out and just you know let Brady Yeah. Flail in the wind. He he definitely. Although there was there was a quote from him, um, Tom Brady was not the guy I was worried about in preseason.",
    "speaker" : "Andy",
    "timestamp" : "28:27-28:44"
  },
  {
    "text" : "But he's saying that in retrospect too, right? Exactly, yeah, yeah. Yeah, exactly. Yeah.",
    "timestamp" : "28:46-28:54",
    "speaker" : "Greg"
  },
  {
    "text" : "He also uh had a quote when he woke up with a tube in his chest. Um, he said, well, that's not good. It's an understatement, but like you you nearly died. If they had had to give you, I remember from the actual uh the book um talking about it was his um One of his arteries got severed by I think a broken rib. It was hit so hard. Um, and his lung cavity was filling up with blood. And so uh basically if they To to get to it, they were either going to have to like try drain it with like just a little uh tube that would like pump the blood from where it wasn't supposed to be back to where it was. Um and if that didn't work, they'd have to like cut open his like chest muscles to get to it and like drain it that way. And if they had done that, basically his uh football career would have been over because he would have had to be Like recovering from that as a brower of football would have been like unbelievably difficult. So he was like inches away from never playing football again. And also dying.",
    "speaker" : "Andy",
    "timestamp" : "28:54-29:57"
  },
  {
    "speaker" : "Greg",
    "text" : "It's not that bad, dude. Two two liters of blood. That's the same amount Kelly lost giving birth to our son. That's great. Isn't that nuts? That's a lot of blood. They mentioned that. They mentioned that on the thing and I was like, oh, two liters. I remember the doctor telling me that that's a wow.",
    "timestamp" : "29:58-30:13"
  },
  {
    "timestamp" : "30:15-30:17",
    "speaker" : "Andy",
    "text" : "But that's that's a lot of blood."
  },
  {
    "text" : "Uh-huh. Ain't no documentaries about her. Uh on a more positive note. Yeah.",
    "timestamp" : "30:17-30:24",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. On a more positive note, they did talk about uh Bledsoe um ranking Tom Brady as a rookie. And somehow they managed to get a um like the the dye that they put on um like uh dollar bills and stuff at banks. Like the stuff that you don't see it until it gets wet and then it stains like for good. And so they got that and put it in Tom Brady's socks. So as soon as he started sweating, it uh turned his entire, like both his feet purple. for two weeks.",
    "timestamp" : "30:24-30:58",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "You think that actually happened?",
    "timestamp" : "30:58-31:00"
  },
  {
    "text" : "Yeah.",
    "timestamp" : "31:00-31:01",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:01-31:02",
    "speaker" : "Greg",
    "text" : "I don't."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "31:02-31:12",
    "text" : "Yeah. No, uh I've heard um stories in the past of Uh I think uh Drew Bledsoe being uh a bit of a prank kind of guy along with um Matt Light."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "31:13-31:15",
    "text" : "I bet they're too Brady Not to Brady."
  },
  {
    "text" : "Well, I bet they did to Brady. He was he was a rookie. They did they just did it to him because he was a rookie, not because he saw Brady. But he was also try-hard from the sounds of it. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "31:16-31:24"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "31:25-31:28",
    "text" : "I got a lot of I didn't think that happened out of this."
  },
  {
    "text" : "Really?",
    "timestamp" : "31:28-31:28",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "31:29-31:32",
    "text" : "Also, you want to hear my hottest? I didn't I don't think that happened."
  },
  {
    "text" : "Okay.",
    "timestamp" : "31:32-31:33",
    "speaker" : "Andy"
  },
  {
    "text" : "The craft quote, the Tom Brady walked up to me and said, I'm the best thing this franchise has ever done. I think that's fake.",
    "timestamp" : "31:33-31:41",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "31:41-31:45",
    "text" : "Uh I've heard Brady walk it back a little bit.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "31:45-31:49",
    "text" : "He's like, I don't know if that was my exact words, but yeah, exactly, dude.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. It makes for the story.",
    "timestamp" : "31:50-31:52"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "31:54-31:58",
    "text" : "Oh yeah. Like In like every interview. Interviews, yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Whenever Brady's name comes up, that's the story that he that's his go-to. Yeah. Yeah. Um, let's talk about Tom Brady then. Let's uh Segue to that, because I think you know that was the other big piece of the whole kind of thing was uh our uh centered around this um Drew Bledzo getting hurt. The teams struggle. They went 5-11 the year before. And they're 0-2 on the season to start, which I don't even think they mentioned, but that's fine. And now they're giving the reins to uh an untested guy who's never started a football game in the NFL. Uh was the fourth stringer coming in. Um but you're able to kind of see That Tom Brady wasn't the Tom Brady that we know now. And they made that blatantly clear in this episode. Um Apparently he gave a speech to the team after getting a starting job like that in week three, like before week three. He's like, believe me guys, we've got this And then they cut to Teddy Bruskey being like, oh, look at the kid, he's trying.",
    "timestamp" : "31:58-33:08"
  },
  {
    "text" : "Yeah, that's the other players were the best part of the documentary. Like Ty Law, William McLean.",
    "timestamp" : "33:08-33:13",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "33:13-33:14",
    "speaker" : "Andy",
    "text" : "Oh my god."
  },
  {
    "text" : "All their quotes were like awesome. Ty Law.",
    "timestamp" : "33:14-33:17",
    "speaker" : "Greg"
  },
  {
    "text" : "This is the NFL buddy. You're going back to the bench. Yeah. Well, because Brady came up to him like after, I don't know, whatever game it was. Not giving this job back. Yeah, and they they kind of tie a lot of lawyer more loyal and they're both just like you know whatever kid.",
    "speaker" : "Andy",
    "timestamp" : "33:18-33:32"
  },
  {
    "timestamp" : "33:33-33:37",
    "speaker" : "Greg",
    "text" : "Go get them, buddy. Yeah, exactly."
  },
  {
    "timestamp" : "33:37-33:58",
    "speaker" : "Andy",
    "text" : "Um And speaking of Ty Law, um I love the the way that they talked about uh Ty Law is he sold Tom Brady his condo. He's like, you know, young kid, just made the team, doesn't have a lot of money, so you know I sold it to him for cheap. And then they cut somebody. He's like, you said he gave me a cheap, he ripped me the fuck off. Go back and forth."
  },
  {
    "speaker" : "Greg",
    "text" : "No, he owes him $150,000.",
    "timestamp" : "33:58-34:00"
  },
  {
    "text" : "I did I did like that how it was kind of it showed like videos of him kinda like getting drunk and",
    "speaker" : "Tim",
    "timestamp" : "34:04-34:10"
  },
  {
    "timestamp" : "34:12-34:22",
    "text" : "a good time and then being one of the guys um and what the how competitive he was about the the tech mobile yes yeah or about everything literally everything which",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "34:23-34:25",
    "speaker" : "Tim",
    "text" : "Well how to stomp on the ground or whatever."
  },
  {
    "text" : "I have a hot take.",
    "speaker" : "Andy",
    "timestamp" : "34:25-34:26"
  },
  {
    "timestamp" : "34:27-34:28",
    "text" : "Fake.",
    "speaker" : "Tim"
  },
  {
    "timestamp" : "34:28-34:31",
    "speaker" : "Andy",
    "text" : "Is is Tom Brady a psychopath?"
  },
  {
    "text" : "Oh absolutely.",
    "timestamp" : "34:31-34:32",
    "speaker" : "Tim"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, probably. Like a like a legitimate like Yeah, Jordan is, right?",
    "timestamp" : "34:33-34:37"
  },
  {
    "text" : "Tiger is.",
    "timestamp" : "34:37-34:38",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "34:38-34:39"
  },
  {
    "speaker" : "Greg",
    "text" : "Like Brady.",
    "timestamp" : "34:39-34:39"
  },
  {
    "text" : "I feel like he Go ahead. You have it's just like this hyper competitive perfectionist for his entire life. Like that's I don't think that's something you can learn. I think that's just almost your brain I'm not gonna say it's broken, but it's definitely working differently than a normal person. It's um what's the word they use? Neuro, not uh not neurotypical. Yeah, neurodivergent. Thank you.",
    "timestamp" : "34:40-35:02",
    "speaker" : "Andy"
  },
  {
    "text" : "You're a little neurodivergent, Andy.",
    "speaker" : "Greg",
    "timestamp" : "35:04-35:06"
  },
  {
    "timestamp" : "35:06-35:12",
    "text" : "A little? Yeah. I'm a lot neurodivergent, but thank you, Greg. Appreciate that. Thanks for catching that for me.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yep. No problem, dude. Just keeping you honest.",
    "timestamp" : "35:12-35:15",
    "speaker" : "Greg"
  },
  {
    "text" : "I don't know. I think the how how like think about it if you have a friend like that that's like you can't play games with them because they're just They will never lose again. Let's go again. Let's go again. Like, dude, no, you lost. You lost.",
    "timestamp" : "35:16-35:31",
    "speaker" : "Tim"
  },
  {
    "timestamp" : "35:32-35:39",
    "text" : "Yeah. Yeah. How he learned he could stomp on the floor to reset the Nintendo so that he would never lose. Like, I'm not playing you again.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "35:40-35:43",
    "speaker" : "Greg",
    "text" : "There's probably a lot of people out there that are like that, but just aren't skilled enough."
  },
  {
    "text" : "Yeah, they're just not good at football or good at sports, yeah. Yeah, yeah. Yeah, I've I've known a few over the years, yeah. Um and you know you you you can be like that as a fucking coder, but you're not gonna get anywhere in life because nobody gives a shit. Like, oh I'm a better coder than you. It's like congratulations, fucking Lations. You worked 80 hours this week. I work 40. Like, yeah. Okay. That's a uh old Facebook guy, huh, Andy? Oh, he's also neurodivergent, pretty sure. No? I don't even think he's human. I think he's just sort of robot sentient being. That's what I'm saying. I think all these people, I mean Elon Musk, he's probably in that same boat. Um Bezos? Dude's a psychopath.",
    "timestamp" : "35:44-36:24",
    "speaker" : "Andy"
  },
  {
    "text" : "Um boy, are we getting political here?",
    "speaker" : "Greg",
    "timestamp" : "36:25-36:27"
  },
  {
    "text" : "Who are we talking about?",
    "timestamp" : "36:28-36:29",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "36:29-36:30",
    "text" : "Trumpy?"
  },
  {
    "text" : "I mean, I thought we were talking about successful people, but yeah, all right. Uh he's definitely a psychopath too.",
    "speaker" : "Andy",
    "timestamp" : "36:31-36:36"
  },
  {
    "timestamp" : "36:36-36:37",
    "speaker" : "Greg",
    "text" : "Oh yeah."
  },
  {
    "speaker" : "Andy",
    "text" : "Um yeah, but like all those all those like billionaires, they're they're nuts. Um I think you have to be to be the best at what you want. Uh I think I think there is some I think there is some to that because I um I don't even know looking at his history, looking at Robert Kraft's history. Um like he took over his in-law's paper business, but then took some like outrageous chances to to make it grow as fast and as quickly as it did. So I I do think there's probably some drive in him as well. Yeah. But there's also a lot of What are you saying?",
    "timestamp" : "36:37-37:22"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "37:22-37:24",
    "text" : "It's a shame I don't have that."
  },
  {
    "timestamp" : "37:25-37:31",
    "text" : "Yeah, none of us do. Uh it's not a brown family trait, which is why I'm shocked that this podcast has lasted as long as it has.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "37:32-37:35",
    "speaker" : "Tim",
    "text" : "It takes some pretty frequent breaks, so that's true."
  },
  {
    "text" : "We do now, yeah. Uh Um there was a lot of uh shots of Boston sports media in this first episode especially. Um some young looking dudes. Who no longer look young. Um Bob Ryan? He didn't look young. Who? Bob Ryan. Oh yeah, no, he didn't look young, but he I don't think he ever has. Exactly, yeah. Um, but they were yeah, there was that like round table, whatever show that was, with Bob Ryan arguing with I can't even remember who it was. Um, talking about how like I can't believe you're trying to start a quarterback controversy. Like Drew Bledsoe was definitely the start when he comes back. Like there's no question about it.",
    "timestamp" : "37:36-38:16",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "38:16-38:16"
  },
  {
    "timestamp" : "38:16-39:16",
    "speaker" : "Andy",
    "text" : "Like you're fucking typical Boston's boy. Like nothing has changed. But that's what their bread and butter was. It's like the page is gonna fail. So may as well just like stick your foot in the ground, say dig your heels in the ground and just uh You know, wait till it comes true because it always did. So this is kind of what they're used to, and this is the beginning of the change of like, oh shit, actually. Um and then they're talking about, you know, when Belichick was announced Brage's starter, we were all surprised um after that uh Rams game. Because, you know, they now that was when Bledsoe was announced that he was yeah, medically sleep to come back was to play in that game. Belichick announced that Brady would start. Um Brady threw two picks and they lost to the um The Rams at Home. And so there was. I remember from doing our podcast, there was some quote from I think it was Bob Ryan about, you know, You know, why leave the Cadillac in the garage when you know or why why are you driving the Honda around town when you have the Cadillac in the garage or something like that?"
  },
  {
    "timestamp" : "39:19-39:24",
    "text" : "I mean we also do look at that with the you know revisionist history like We know who Tom Brady is now.",
    "speaker" : "Tim"
  },
  {
    "text" : "So it was watching that game and thinking like this was a pretty good result. They lost by seven to The defending world champs. The best team of the NFL. I was like, you know what? We hung in there. You expected to lose. You're hoping you weren't losing by double digits, and they did. So like I remember thinking like that was a positive step, but they obviously framed it different here.",
    "speaker" : "Greg",
    "timestamp" : "39:24-39:46"
  },
  {
    "speaker" : "Andy",
    "text" : "Wow, Greg, are you uh is that is that a moral victory crow from you?",
    "timestamp" : "39:47-39:51"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, if you want to go truly in depth in the game, you can uh listen to our podcast.",
    "timestamp" : "39:51-39:55"
  },
  {
    "text" : "That's true, yeah.",
    "speaker" : "Andy",
    "timestamp" : "39:55-39:56"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "39:57-39:59",
    "text" : "Yeah, all these games mentioned full breakdown."
  },
  {
    "text" : "Full breakdown of all these games. That's right. Yeah.",
    "timestamp" : "40:00-40:02",
    "speaker" : "Andy"
  },
  {
    "text" : "That's right.",
    "speaker" : "Greg",
    "timestamp" : "40:02-40:02"
  },
  {
    "text" : "Um because I do I one of my early criticisms, a light criticism of this, and I understand why, but um I thought this was very light on the actual games. There was no mention. Like they they just kind of showed a couple of like they talked about um that first week that Brady was starting about how um Willie McGuinness was there. He's like, we can't give up uh any points this week, right? Um and then they they show um all the highlights of the game, but they don't actually like tell you anything about it. It's just like, oh look, here's Otis Smith returning an interception. Here's Tyler returning an interpreter. Like, oh by the way, both of those with touchdowns.",
    "speaker" : "Andy",
    "timestamp" : "40:02-40:43"
  },
  {
    "text" : "Didn't even show title.",
    "timestamp" : "40:43-40:44",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "40:44-40:47",
    "text" : "Well that's right. They didn't show Tyler. Yeah. They showed uh a sack or something.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. I was taken aback. I was appalled.",
    "speaker" : "Greg",
    "timestamp" : "40:47-40:49"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. Uh oh no, they showed the um the Brian Cox hit. And then the Otis Smith return.",
    "timestamp" : "40:50-40:55"
  },
  {
    "text" : "Antoine Smith.",
    "timestamp" : "40:56-40:57",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "40:57-41:19",
    "speaker" : "Andy",
    "text" : "And that was it. Yeah. Um, and then they cut to Belichick being like, well, you know, um, Tom was making the plays he needed to make. Which uh was converting basically every third, like he completed like seven passes and five of them were uh third down conversions for a first down. You know, I mean it's kind of like he was doing what he needed to do, but yeah, it was more than that."
  },
  {
    "timestamp" : "41:19-41:25",
    "text" : "And like wait till you get to episode three, Andy, you're gonna be like Right. Skipping games is the least of our worries.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:25-41:26",
    "text" : "Oh, I I think I've heard."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "41:26-41:30",
    "text" : "Um we talk about skipping championship seasons, bro."
  },
  {
    "timestamp" : "41:30-43:12",
    "speaker" : "Andy",
    "text" : "I know. Um So yeah, I I mean uh that was something that like I get it because if this isn't aimed at like, you know, necessarily football fans, it's aimed at like the broader audience, then you don't want to bore them with all that. But like they showed a little bit of the um Chargers game. And it was Brady's one first ever touchdown pass to Terry Glenn, who hasn't been mentioned once. Yeah. And two, it was his first comeback win, which was his third game of his career. A week after getting the doors blown off him in um Miami. So like there there's some kind of like coming into this this game against the Rams, like there was some good and there was some bad. But they're basically saying, like, oh, he hasn't done anything yet, but they're still starting him and making it seem like this was a bigger um almost a bigger deal, like Tim was saying, than it actually was at the time. Because I went back and looked at our notes that we had from that time, and there was a um a poll in the Boston Globe about this was after the Rams game, and there was a uh a poll um of who should be the starting quarterback. And Brady was favored before the game. They said uh like fans said uh 78% Said that Bray should be the starting quarterback. And after the game, 65% still said Bray should be the quarterback. Wow. So it's interesting. More than the majority thought Bray should be the quarterback after the Rams game, even though he threw two picks and they lost. So They're they kind of portrayed this in the documentary as like, oh, well, you know, nobody thought he would stick with Brady. It's like what? Actually everybody wanted him to stick with Brady. Yeah, so I I think Except for the sports media."
  },
  {
    "timestamp" : "43:12-43:33",
    "speaker" : "Tim",
    "text" : "Yeah, I think the way that they've set it up is just like that. like an ode to Drew Bloodsoe and like they they're just playing that up like he was like a son to me and this is that like and that's the stuff that irritates me about craft is Like how he tries to portray everything as like family and all that stuff, it's just like it falls on deaf ears."
  },
  {
    "timestamp" : "43:33-43:36",
    "text" : "He was like a son to me, said that everyone's a son to you, dude.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "43:36-43:40",
    "text" : "You kiss everyone, you're kissing so many dudes, it's so annoying."
  },
  {
    "text" : "I'm just gonna say dudes. It's so annoying.",
    "speaker" : "Greg",
    "timestamp" : "43:41-43:44"
  },
  {
    "text" : "Yeah, yeah, we'll have to isolate that one. Oh boy. Um I I'll just say this. Uh every place I've worked at that's had that like, you know, we're family here. It's been a terrible place to work. It's been super toxic.",
    "timestamp" : "43:44-44:03",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "44:03-44:07",
    "text" : "That's it's where you get pizza. That's where you get pizza for a company."
  },
  {
    "text" : "That's where you get it. You gotta work the weekend, but we'll get you pizza. On Saturday night.",
    "speaker" : "Greg",
    "timestamp" : "44:08-44:12"
  },
  {
    "timestamp" : "44:13-44:14",
    "text" : "Yeah, no, it's exactly what I think.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "44:15-44:17",
    "speaker" : "Tim",
    "text" : "It's pizza from the night before. It's a leftover pizza."
  },
  {
    "timestamp" : "44:17-44:36",
    "speaker" : "Andy",
    "text" : "Oh no, I I got a uh Uh I got a gift certificate to uh a Chinese food fast food place uh that didn't exist up here near me. Oh nice. Yeah, I gave it back. Uh I think it would Pan Express or something like that. Like, oh here's fifty bucks Pan Express. I'm like, I I don't have one of these in my state."
  },
  {
    "timestamp" : "44:36-44:37",
    "text" : "None in the area.",
    "speaker" : "Tim"
  },
  {
    "text" : "Yeah. Uh so I'm just gonna give this back to you and you can give it to somebody who like could use this. If what I did.",
    "timestamp" : "44:37-44:42",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "44:43-45:11",
    "text" : "That's kind of like what the appeal of Belchek was though, right? Is that it's not like it's not a family thing, right? He'll cut you tomorrow if it's in the interest of the team. But If you play well, you get the chance. Yes. And he's not going to play favorites because he likes this guy over that guy personally. You know? So I think that's that I didn't feel like they They kind of touched on it, but it's definitely evidence of how Bell or how Kraft was portraying the organization.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "45:12-47:07",
    "speaker" : "Andy",
    "text" : "I agree. And I think um I've been listening to uh Julian Elleman's podcast the last couple episodes because Yes, which we'll get to. I stole him. But he had Ernie Adams on, uh, which is a great listen. And right now is the one with Ty Law and just hearing You know, Ty Law wasn't a huge like well didn't always see eye to eye with Belichick, let's say, um, especially when it came to contracts. And so he's telling all these like contract stories and stuff and they're h hilarious. Um but at the end of it he's like I had so much respect for Bill Belichick and You know, Edelman was asking him, you know, you play for all these other teams. You play for um Marcells and Pete Carroll and like you, you know, you play for the Jets and the Chiefs, like What was it like here? And he's like, I have never been more well prepared in my entire career than when I was under Belichick. Um, with Parcells, because uh when he was with Parcels, uh Belichick was the DB's coach. And Belichick basically would tell him, you know, like if the wide receiver lines up uh outside the numbers here, he's gonna run a curl. And Tyla's like, you know, I don't want to end up on the wrong side of a highlight, right? Like uh What if he runs out and up? And he's like, I guarantee he won't. If he does, it's on me. Um, so just you know, jump on the curl. And he didn't get an inception. He's like, from then on, like, Belichick was my guy because he always put me in the right position. And so I think it's not just that, you know, the best players will start, but Belichick will put every player in the best position to be their best self. And then from that, all the best players start, you know? Which you can see in the Mike Frables of the world and whatnot. So yeah, there's not a lot of that in here. But uh if you want to hear more of it, yeah, you can listen to some other podcasts like uh you know the Pages Dynasty podcast for one or uh the ripoff of it that Julia Edelman has started Um no shade."
  },
  {
    "timestamp" : "47:07-47:09",
    "speaker" : "Tim",
    "text" : "No shade. All the shade."
  },
  {
    "timestamp" : "47:10-47:16",
    "speaker" : "Andy",
    "text" : "Exactly. No shade unless he comes on. Um All right. Let's talk about the second episode."
  },
  {
    "timestamp" : "47:16-47:19",
    "speaker" : "Greg",
    "text" : "Um I had a couple more notes on the first episode."
  },
  {
    "speaker" : "Andy",
    "text" : "All right, give them to me.",
    "timestamp" : "47:19-47:20"
  },
  {
    "speaker" : "Greg",
    "text" : "Within the first like two minutes, we had Silverface fan. You know that guy? Oh yeah. making a terrible analogy saying that in Boston when you grow up they take the pacifier out of your mouth and replace it with a yelling voice. Right. Which doesn't make any sense. You don't you don't replace an object with a also he said the pages have been terrible.",
    "timestamp" : "47:20-47:44"
  },
  {
    "text" : "all the way through, even though that's not necessarily true.",
    "timestamp" : "47:44-47:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "47:48-47:48",
    "text" : "Yeah."
  },
  {
    "text" : "Uh two other Super Bowls I went to, but you know, yeah.",
    "timestamp" : "47:48-47:51",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Um also there was a like an older clip of like, here's when the pat sucked, and it was like a guy in the fans in the stands and he was like, You want the cheerleaders to go out there and flip for you? It's like classic 80s.",
    "timestamp" : "47:51-48:05"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:06-48:11",
    "text" : "The hardest boss action you've ever heard. You want the cheerleaders to come out there with you."
  },
  {
    "speaker" : "Greg",
    "text" : "We'll get the fucking cheerleaders out there.",
    "timestamp" : "48:11-48:13"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:13-48:32",
    "text" : "Exactly. Guy, what are you doing, guy? I love that. I love that. Yeah. There was some hard Boston accents there. Yeah, I saw the same thing. Also, like they they kept interviewing, like obviously they had the silverface guy, but they had like other guys that were just like They were, you know, fans of the team. It's like w who are these people?"
  },
  {
    "speaker" : "Greg",
    "text" : "Like they're just still Burr on their dick.",
    "timestamp" : "48:32-48:34"
  },
  {
    "speaker" : "Andy",
    "text" : "They did have Bill Burr, but they had like these other guys just like I don't yeah dudes. Yeah are you famous that I don't know about or just fans and just like putting you on? I don't understand.",
    "timestamp" : "48:34-48:43"
  },
  {
    "timestamp" : "48:43-48:46",
    "text" : "They probably interviewed those guys for six hours too and then clip right.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "48:46-48:48",
    "text" : "Yeah, and that was just it.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "48:48-48:48"
  },
  {
    "text" : "Oh god. All right. Anything else from episode one? Or should we just roll right into the snowball?",
    "timestamp" : "48:48-48:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "48:56-48:57",
    "text" : "Snowball. Roll it."
  },
  {
    "timestamp" : "48:58-49:03",
    "speaker" : "Andy",
    "text" : "The snowball that is, uh, Greg, I believe you have said the one game that you would go back to to witness in person if you could."
  },
  {
    "timestamp" : "49:04-49:13",
    "speaker" : "Greg",
    "text" : "Over any other sporting event. That was that question to a lot of people. If you could go back to any historical sports game ever, which game would you go to?"
  },
  {
    "timestamp" : "49:14-49:17",
    "speaker" : "Andy",
    "text" : "I yeah, I I have a hard time coming up with one that's better than the snowball."
  },
  {
    "text" : "Yeah, even like old like oh I go to like Pele winning the World Cup, like I have no connection to that. I'm sure it'd be a cool scene, but Right, yeah, yeah You consider the environment, the snow, the emotional connection I have to the Patriots, that being the start of everything, and then they'll be on it.",
    "timestamp" : "49:18-49:35",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "49:35-49:39",
    "speaker" : "Andy",
    "text" : "It's like it's just And it being the last game in that stadium, too."
  },
  {
    "speaker" : "Greg",
    "text" : "Last game is the send off a stadium. That is the coolest Patriots game that's ever been played.",
    "timestamp" : "49:39-49:43"
  },
  {
    "text" : "Yeah, I yeah, I agree. Yeah.",
    "timestamp" : "49:44-49:46",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "No, Tim, that was I Tim, what do you got then?",
    "timestamp" : "49:47-49:50"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "49:51-49:59",
    "text" : "I mean, I I when when you add up all the factors, yeah, that's that's pretty cool, but I mean like 283. That over 283?"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, it's the Hawks Super Bowl.",
    "timestamp" : "49:59-50:01"
  },
  {
    "text" : "But like we'd already won Super Bowls at that point. Like, yeah. That one felt more like a thank God. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "50:01-50:08"
  },
  {
    "text" : "Yeah, that's that's true.",
    "speaker" : "Andy",
    "timestamp" : "50:08-50:09"
  },
  {
    "text" : "I mean it was awesome. Don't get me wrong.",
    "timestamp" : "50:10-50:11",
    "speaker" : "Greg"
  },
  {
    "text" : "No, it felt more alien because like nobody had ever done that before.",
    "timestamp" : "50:12-50:14",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, and we got so lucky in it. That's probably that's definitely a top five, right?",
    "timestamp" : "50:15-50:20"
  },
  {
    "speaker" : "Tim",
    "text" : "Oh period. Definitely. I would say that that's probably number, I would put that number two. Yeah. Because that that really is the thing that kicked everything off. It was like that's that's when I don't know. It was just like we were like untouchable. Like we kept screwing up and then we were like It just felt like, you know, it was one of those things for where, you know, like just everything that's happened in Boston sports, like the Buckner thing, that type of thing, that's how it felt. Right. That the Tuck rule happened.",
    "timestamp" : "50:20-50:51"
  },
  {
    "speaker" : "Andy",
    "text" : "And then as soon as you got overturned you're like, oh, this is this is different all of a sudden. Yeah. It's never been like this before. This isn't supposed to happen. Yeah, and then they score a touchdown right after it. And it's like what uh what wait, what? This isn't this isn't how this goes. Like the patron should have squandered that chance too.",
    "timestamp" : "50:52-51:11"
  },
  {
    "text" : "Yeah. And then the thing about The the field goals that he he kicked in the the conditions that they were is like just un it's it's still mind-boggling to me",
    "speaker" : "Tim",
    "timestamp" : "51:11-51:22"
  },
  {
    "timestamp" : "51:22-51:28",
    "speaker" : "Greg",
    "text" : "Is that is that first one to force overtime, the 48 yarder, is that the greatest kick in NFL history?"
  },
  {
    "timestamp" : "51:28-51:43",
    "speaker" : "Andy",
    "text" : "Yeah. There there has not been one that has been um on a like uh had a bigger meaning to it, like in terms of um pressure. Exactly, with with more adverse conditions, yeah."
  },
  {
    "speaker" : "Tim",
    "timestamp" : "51:44-51:44",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "51:45-51:49",
    "text" : "And then and then the legacy of it too, right? Where it ends up being the start of this whole thing."
  },
  {
    "timestamp" : "51:50-51:58",
    "text" : "Yeah. And that that kick is what's kind of like that that kick is always pointed to as like the beginning of the dynasty, right?",
    "speaker" : "Andy"
  },
  {
    "text" : "They had that uh Justin Tucker one where he set the record on the doink to be that's in like probably the the hardest of all the kicks.",
    "timestamp" : "51:58-52:08",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, but it was also like in a week twelve game against the fucking Detroit Lions. Whatever. Great, you beat the Lions. Congrats. Yep.",
    "speaker" : "Andy",
    "timestamp" : "52:08-52:16"
  },
  {
    "text" : "Yeah, Ty Law said they should take his uh military's cleat and put it on the front of a car like a Rolls Royce.",
    "speaker" : "Greg",
    "timestamp" : "52:17-52:23"
  },
  {
    "timestamp" : "52:28-52:34",
    "speaker" : "Andy",
    "text" : "They should literally bronze his foot, like his actual foot, and just like they should put Adam's foot on the hood of your car like a Rolls Royce. Yeah."
  },
  {
    "text" : "That should be honestly his foot should be at the top of that stupid lighthouse.",
    "speaker" : "Tim",
    "timestamp" : "52:35-52:39"
  },
  {
    "text" : "It up there, baby.",
    "speaker" : "Greg",
    "timestamp" : "52:41-52:42"
  },
  {
    "text" : "They should bronze it and do that.",
    "speaker" : "Tim",
    "timestamp" : "52:42-52:43"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "52:43-52:50",
    "text" : "Alright, well we're gonna reach out to Anna Vinatarius. See if we can get uh cast made of his foot and um we'll take the real thing, boy."
  },
  {
    "speaker" : "Greg",
    "text" : "I'll put it on my sacrifices have to be made, Andy.",
    "timestamp" : "52:51-52:54"
  },
  {
    "text" : "I'll put it on my car. I'm not gonna lie. That'd be great, yeah. He doesn't need it. I mean, do uh all I will say um vinoitarian these things, boys looking yoked these days. Oh yeah That dude is massive. Yeah. Well, I think his uh I feel like I remember reading like his son is like a weightlifter or something like that. And so he lifts weights with his son. Um and so he got like super into it, I think. But like, dude is jacked. Yeah.",
    "speaker" : "Andy",
    "timestamp" : "52:54-53:22"
  },
  {
    "timestamp" : "53:22-53:23",
    "text" : "Silver Fox too.",
    "speaker" : "Tim"
  },
  {
    "text" : "Yeah, oh yeah. But just like you can kind of see why uh Belchecker Marcells was like uh calling him a football player, not a kicker. It's like one of the best football players that we've had on our team at the time.",
    "timestamp" : "53:23-53:36",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "53:36-53:37",
    "text" : "Chase down Herschel Walker.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "53:37-53:39",
    "text" : "Yeah, he ran down Herschel Walker."
  },
  {
    "text" : "Yeah. If you're listening to this and you have not seen that clip, it is stop what you're doing right now and look at it. It's wild. Because it's exactly what it sounds like. Yeah. He literally ran literally chasing Herschel Walker from behind and catching him. It's insane.",
    "speaker" : "Greg",
    "timestamp" : "53:39-53:53"
  },
  {
    "timestamp" : "53:53-54:44",
    "speaker" : "Andy",
    "text" : "On a kick return. That probably should have been a touchdown. Yeah. Yeah. All right. Um, so I'm gonna get to the positives of this episode two uh first. And the biggest positive was the fact that Ernie Adams was in this. And I'm coming to realization that um I might be a younger Nee Adams because the first two clips of him talking, the first one was him throwing shade on the media. being like, oh yeah, the media likes to write. They're they're scribes. They write, but they don't actually know what they're talking about. When it came to like um the Bledsoe Brady um decisions. Like, yeah, no, we all knew what we're doing. Like it was obviously Brady and like we've been prepared for we had been seeing Brady in practice for, you know, ages. And like we saw his preparation and we we we thought he would be the guy to um To run this offense. I we were super comfortable with it. But yeah, yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Like if you're the kind of player or coach you don't know what you're talking about or something like that.",
    "timestamp" : "54:45-54:49"
  },
  {
    "timestamp" : "54:49-54:50",
    "speaker" : "Andy",
    "text" : "Which is 100% true."
  },
  {
    "text" : "Yeah.",
    "timestamp" : "54:50-54:51",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh and then the second thing was uh you was talking about Oh, they showed him getting into his um like, you know, base model Subaru from his little Boston townhouse. Uh and then turning on sports radio. And he'd be like, I turn on sports radio once every like six months and then I turn it off after 30 seconds after realizing what I've done.",
    "timestamp" : "54:51-55:12"
  },
  {
    "timestamp" : "55:12-55:13",
    "text" : "We've all been there.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. I love it. Uh so I uh it's me. I'm Uh apparently me and Ernie Abs are the same neurodivergence, I think. Uh but he also was talking about the weather. Like he was driving to the stadium and Um, you know, everybody on Talk Radio was talking about how the page didn't really have a chance because this Raiders team was the better team. And he's like, you know what? 100% true. Um and that's actually what he's he's said uh about the Rams Super Bowl as well. Um that the Rams were the better team, um, but Uh the patrons were lucky that they had played them already once, um, so they knew they didn't have to take, he said they didn't have to take a quarter to figure out what wasn't gonna work and then adjust, because they could already adjust to what didn't work in the first game. Um, which was basically they said that they were just going to I think probably what the Rams did to the Patriots in 07 was just play pass every down. They're gonna defend the pass every down just like if they ran it, great. We don't care. Give them eight yards on every run. Um, but we're just gonna play every first down as if they're gonna throw the ball, put all our best pass rushers out there and just harass the shit out of um the entire pass offense, which worked. But in this game, you're talking about how, you know, as he's driving to the um the stadium, the first flakes of snow started falling. Apparently it was the first real snowfall they had had all winter that year, which I don't remember because you know 2000 was a long time ago, but I trust Ernie Adams when he says it. Um, and so it kind of felt like fate, like the weathermen were kind of doing the patrons a solid by throwing a whole bunch of snow at this high-paced west coast team having to come all the way across the country and deal with the snow, which the Patriots are or people in New England in generally are just more used to.",
    "timestamp" : "55:13-57:03"
  },
  {
    "text" : "But even that, I mean, it dumped. Like think about how many times it's truly dumped.",
    "timestamp" : "57:04-57:08",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, during a game. It doesn't do that during a game.",
    "timestamp" : "57:08-57:11"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "57:11-57:15",
    "text" : "Three or four that come to mind where it's like, holy shit, it's snowing like crazy."
  },
  {
    "timestamp" : "57:15-57:15",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "text" : "does happen to be in this game is just like it just adds to the whole mystique of it.",
    "timestamp" : "57:16-57:20",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "57:20-57:26",
    "speaker" : "Andy",
    "text" : "And it felt like fate. And I yeah, yeah, exactly. Um football, baby."
  },
  {
    "speaker" : "Greg",
    "text" : "It's hard not to be romantic about the snowball. It's just such a fucking game.",
    "timestamp" : "57:26-57:30"
  },
  {
    "text" : "I agree. And also I thought it was interesting when they talked to Robert Kraft about the snow. He said, um, we cleared the snow um under the letter of the law, but we cleared as little as possible because we knew that it gave us an advantage. Fuck, that's no wonder I couldn't see anything in terms of like lines or anything like that.",
    "timestamp" : "57:30-57:49",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah.",
    "speaker" : "Tim",
    "timestamp" : "57:49-57:50"
  },
  {
    "speaker" : "Andy",
    "text" : "Just coming down, but yeah, they yeah, you can see the guy with the snowblowers, but they were just like literally just blowing the lines and that was it.",
    "timestamp" : "57:50-57:55"
  },
  {
    "speaker" : "Greg",
    "text" : "And now all the fields get the heaters underneath, so like One of the only times you'll ever see that anymore.",
    "timestamp" : "57:56-58:01"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Yeah. Um also uh great Ernie Adams quote, because they're talking about Drew Bledsoe. And then oh, this was the episode where they're talking about how Bledsoe had gotten hit a lot over his career. Um and that kind of caused him to freeze. And so that's kind of like, yeah, Bloodsoe might not be the guy, even though Kraft had already given him this deal once um Belchak came in and brought his guys in there like, yeah. Uh Blood Zone might not be the guy. And Ernie Adams quotes less uh he looks like a wildebeest under attack, which I think is uh pretty apropos, yeah. That's that's a very good analogy of watching Drew Bledsoe try to avoid a sack. Um he's kind of like right at the end he just kind of like gives up and just like is waiting for the inevitable of being thrown to the ground.",
    "timestamp" : "58:01-58:46"
  },
  {
    "speaker" : "Greg",
    "text" : "We used to talk about that a lot early Brady days too, the escapability factor. Yeah. Right. Where it used to be like the movement within the pocket. Like he was not athletic, but he could. keep his eyes downfield and shift and feel like the rusher from behind. Exactly. Exactly. That's like a an underrated part of his game that We talked about a lot early in his career and then it kind of like dropped off.",
    "timestamp" : "58:47-59:09"
  },
  {
    "timestamp" : "59:09-59:14",
    "speaker" : "Andy",
    "text" : "But he was I don't think it did. I I think it just it was one of those things where I don't think it skilled it."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "59:14-59:15",
    "text" : "I just think people stopped talking about it."
  },
  {
    "text" : "Yeah, I think that's what it is. Yeah. Um until",
    "timestamp" : "59:15-59:17",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Tim",
    "text" : "I th I think his knee was a you know, once he had that injury too that kind of Oh true. You know, he kinda got away from that and had to kind of like relearn all that stuff. 'Cause I think in like thirteen or fourteen he picked that right back up and it that was a big talking point again.",
    "timestamp" : "59:18-59:33"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I remember 2009 watching him be like he's just he's scared of phantom pressure, basically, through that, especially the first half of 2009, he was not the same Tom Brady in the pocket.",
    "timestamp" : "59:33-59:43"
  },
  {
    "timestamp" : "59:44-59:46",
    "text" : "That's what Mac Jones didn't have.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "59:46-59:47",
    "speaker" : "Andy",
    "text" : "Right."
  },
  {
    "timestamp" : "59:47-59:55",
    "speaker" : "Greg",
    "text" : "Yeah. There's a lot of things he doesn't like. The Mac Jones beat him against Dallas last year was like look at the tape and it's like, oh my God."
  },
  {
    "text" : "Mac Jones was Drew Bloodsoa is worst. Like that's a world of beast under attack, dude. Oh yeah. Which to be fair was. It's more like a like a ferret Under attack.",
    "speaker" : "Tim",
    "timestamp" : "59:55-01:00:07"
  },
  {
    "text" : "He was under attack for sure. Oh boy.",
    "speaker" : "Greg",
    "timestamp" : "01:00:08-01:00:10"
  },
  {
    "timestamp" : "01:00:10-01:00:11",
    "text" : "For sure.",
    "speaker" : "Tim"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:00:12-01:00:40",
    "text" : "Uh speaking of Tom Brady though, there were some good Brady quotes in here. Um This is this is the part where I kind of like came to the conclusion that he's a psychopath. Um, but there's like a video of him in high school talking about how I think I need to work on my speed a little bit. Because they're like, oh, I've got they're asking Molly, what are your what are your quote what are your uh qualities of the quarterback? He's like, well, I I think I have a pretty strong arm, but I think I need to work on my speed a little bit. Well You ran a slower 40."
  },
  {
    "text" : "Yeah, he didn't work on that, I guess.",
    "timestamp" : "01:00:40-01:00:42",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:00:42-01:00:45",
    "speaker" : "Andy",
    "text" : "You ran a slower 40 than Vince Wilfork did, but you know."
  },
  {
    "text" : "He's faster now. He's running time out than he does.",
    "speaker" : "Tim",
    "timestamp" : "01:00:45-01:00:49"
  },
  {
    "timestamp" : "01:00:49-01:01:28",
    "text" : "that yeah it's you know what it was still slower than mincil forks I was slower yep barely um But yeah, uh uh but you know, they're talking about how there was the what the five dot drill or something um that everybody hated to do and Brady like drew the five dots on his driveway so he could do it at home, like in high school, so he could get quicker feet and stuff like that. And yeah, this is all the talk about his sisters like all his older sisters were all athletic and you know they were just like Tom would be competitive about everything and if he didn't win, he would be just like fucking miserable the rest of the day. Yeah.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01:28-01:01:31",
    "speaker" : "Greg",
    "text" : "Wish I had athletic siblings. I really could have gone somewhere."
  },
  {
    "speaker" : "Andy",
    "text" : "You're I'm the only reason you went anywhere in the first place.",
    "timestamp" : "01:01:32-01:01:35"
  },
  {
    "text" : "Oh poor Greg.",
    "speaker" : "Greg",
    "timestamp" : "01:01:36-01:01:38"
  },
  {
    "timestamp" : "01:01:38-01:01:40",
    "text" : "Imagine if I had taken it easy on you.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:01:40-01:01:43",
    "speaker" : "Greg",
    "text" : "They could be making documentaries about me, Andy."
  },
  {
    "timestamp" : "01:01:43-01:01:45",
    "speaker" : "Andy",
    "text" : "Oh, don't worry, they will, Greg."
  },
  {
    "text" : "One day.",
    "timestamp" : "01:01:45-01:01:46",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "It'll be it'll be the same sort of hatchet job here. Um but there was a lot of interesting stuff about um kind of Brady in the 2001 season and how because you know the the defense was was driving this team and the success like the way the defense went the team went really Um and you saw that in that first game that Brady started where the the defense picked off or had uh two pick sixes on Peyton Manning. Um and they rolled. And Brady threw for like a hundred total passing yards. Um But they brought up an interesting point about how Brady was kind of in a trial by fire having to practice against this 2001 defense, especially with all the trash talking. They were talking about, I think it was um William McGuinness was on there talking about how um, you know, they they would just like rip on um Tom Brady after every mistake he ever made. Uh but Tylaw and Mike Vrabel were the worst to the point where Willie was saying, um, yeah, after some of the things, I'd turn to Mike Vrabel and be like, dude, that that may have been too far. And then the country for a would be like, no, I knew he could handle it. Yeah, yeah, I mean you were right, but it probably was too far as well, 'cause I can see Braille will be Brable is talking about how if they, you know, if the Titans got the Super Bowl, he cut his own dick off. So I can see how He would talk a bunch of shit if, you know, there's a rookie quarterback against him and his dominant defense. But I I'm wondering how much that had to do with because i the McGinnis was talking about how, you know, Tom was getting tougher, not just physically, but mentally, having to go against this defense every every day. Um I'm wondering how much that kind of like Almost quickened his his kind of learning uh Gerhaasa 2001 season. Um in terms of",
    "timestamp" : "01:01:46-01:03:42"
  },
  {
    "text" : "Having to go against the like you know, if you had to go against the mental fortitude or you don't.",
    "timestamp" : "01:03:43-01:03:49",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "01:03:49-01:03:58",
    "text" : "But at the same time, like I think that's a good point because it's like you're you having to go up against a Bill Belichick defense every day in practice."
  },
  {
    "timestamp" : "01:03:58-01:03:59",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Tim",
    "text" : "And you know, coming out of it.",
    "timestamp" : "01:03:59-01:04:01"
  },
  {
    "text" : "And these guys, these starters like going on the scout team, like fucking trying to knock Brady's head off. Right. Um Yeah, but it's a speed of the game, right?",
    "speaker" : "Andy",
    "timestamp" : "01:04:02-01:04:12"
  },
  {
    "text" : "Like you you get used to the speed of the game because you're playing against a real good defense. But like trash talking, like I don't know.",
    "timestamp" : "01:04:12-01:04:17",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:04:17-01:04:31",
    "speaker" : "Andy",
    "text" : "Oh yeah, no, no, no, trash. Yeah. I I just thought that was yeah, just kind of a funny picture to have Ty Law and Mike Rabel just absolutely tearing Tom Brady a new one. Yeah. Uh but yeah I go ahead."
  },
  {
    "timestamp" : "01:04:31-01:04:44",
    "speaker" : "Tim",
    "text" : "Well I was just gonna say uh like what Ty Law was talking about in that Edelman podcast, like how competitive they were about everything. Everything drinking water. Drinking water, yeah. Yeah, like that"
  },
  {
    "speaker" : "Andy",
    "text" : "And how if the scout team was uh was on the field, they just started doing wind sprints because they knew they were playing man coverage one week and they wanted to be able to he's like, I'm not the fastest guy, but I want to be able to run with him the entire fucking game.",
    "timestamp" : "01:04:44-01:04:55"
  },
  {
    "speaker" : "Tim",
    "text" : "Right. And and that just dynamic as far as that and the shit talking, all that stuff, like it that just that team was a wagon when you really fit Brady perfectly.",
    "timestamp" : "01:04:55-01:05:08"
  },
  {
    "speaker" : "Greg",
    "text" : "I got a question for you guys. So say they bring back Bloodsow after that Rams game. Do the Patriots win the Super Bowl? Because we all agree the defense was what got him there, right?",
    "timestamp" : "01:05:08-01:05:22"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "01:05:22-01:05:23"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:05:23-01:05:24",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:05:24-01:05:27",
    "text" : "Um does Bledsoe play the rest of the season?",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah, he plays out.",
    "timestamp" : "01:05:28-01:05:29",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:05:30-01:05:37",
    "text" : "I don't uh it's a tricky one, isn't it? I don't think so. Um I think part of it too if people mess, right?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:05:37-01:05:52",
    "text" : "Like they start winning games. And people start believing. And I feel like that means a lot in sports where you're like, guys, we can do this. We're we're playing well. Everyone's invested. They're like, you know, putting the extra work in. And then You know, that momentum doesn't go away if you go back to Bloods though. And he's still a good quarterback."
  },
  {
    "text" : "Yeah, but I uh uh but I think that um the defense and the rest of the team around Brady kind of Because Brady was in there and he was the inexperienced guy, everybody kind of s realized they had to step up their game to kind of bring Brady up with them. I don't buy that.",
    "speaker" : "Andy",
    "timestamp" : "01:05:53-01:06:12"
  },
  {
    "text" : "That's what they would say. They don't try harder when you're not going to be able to do it.",
    "speaker" : "Greg",
    "timestamp" : "01:06:13-01:06:16"
  },
  {
    "speaker" : "Andy",
    "text" : "No, but I I don't I don't it's not they don't try hard. It's just that I feel like it's a belief factor of like we can do it. You know that's what I'm saying. I think they all believe they were trying harder. You know what I mean? I just think that go ahead. It's just like, you know, they're putting that extra prep work or whatever. They they just kind of do that one extra thing every time because like, well, fuck you know, we we got Brady, we don't have blood so anymore. So let's just kind of Like it it's the their point of view is that it depended on them now, especially on the defensive side of things. Um And would the defense have been as dominant if they didn't have that mentality going in that, you know, well, you still got Drew Bledsoe, so it'll be fine. You know, he's he's still a competent quarterback. Maybe not, right? I don't know.",
    "timestamp" : "01:06:16-01:07:02"
  },
  {
    "timestamp" : "01:07:02-01:07:24",
    "speaker" : "Tim",
    "text" : "I mean I I think that I think that's a good point. Like they the defense did feel like, you know, were the leaders of the team. like it would be it's on our backs. I also think if you put Bledsoe back in, Bledsoe does kind of have that gunslinger mentality. Also he's not as mobile So that that's gonna lead to more sacks."
  },
  {
    "text" : "That's exactly what I was gonna say. Yeah. Yeah. He's not gonna manage the game the way the Bro Brady did in a lot of these games where The Patriots are winning 17-16, you know. But Brady didn't throw any didn't have any turnovers. So the defense was able to keep him in it.",
    "timestamp" : "01:07:26-01:07:39",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Tim",
    "text" : "Brady's more of a mistake-free kind of guy and",
    "timestamp" : "01:07:39-01:07:42"
  },
  {
    "speaker" : "Andy",
    "text" : "Especially back then, yeah.",
    "timestamp" : "01:07:43-01:07:44"
  },
  {
    "text" : "Yeah. And and you know the think about if you put Bledsoe in the snowball. What do you think happens?",
    "speaker" : "Tim",
    "timestamp" : "01:07:44-01:07:50"
  },
  {
    "speaker" : "Greg",
    "text" : "That's where that's where I was gonna go with is That the drive before the game win the the game time drive, right? Where they hadn't done shit all game. And then Brady takes them the all the way down. They just like something starts clicking and it's like, holy shit, it's clicking. He takes him all the way down, he does that run-in where he spikes it and then falls in the snow. To me, that's so vintage Brady, and what sets Brady apart is like when it's fucking we need a time Brady just figure shit out. Like I don't know for sure.",
    "timestamp" : "01:07:51-01:08:21"
  },
  {
    "speaker" : "Andy",
    "text" : "It doesn't even need to be yeah, it's rarely pretty either, at least back then.",
    "timestamp" : "01:08:22-01:08:25"
  },
  {
    "text" : "But it just worked. The last Super Bowl we won with against the Rams, right? They didn't get shit going all game. And then you're like, we need one drive here. And Brady just pulls it out of his ass and just fucking gets it done. And that was the difference to me with Brady and the rest of these really good quarterbacks, is they didn't have that. I don't know that gene, right? That like I just get it done when I need to get it done. Exactly.",
    "timestamp" : "01:08:25-01:08:46",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Tim",
    "text" : "Good. I like that question though. That's good. Question great.",
    "timestamp" : "01:08:47-01:08:49"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, thank you. Thank you. All right. That's right, right?",
    "timestamp" : "01:08:49-01:08:55"
  },
  {
    "speaker" : "Tim",
    "text" : "He's fired on also fired up. I love it. He's got rejuvenated energy with his documentary.",
    "timestamp" : "01:08:55-01:09:02"
  },
  {
    "text" : "Yeah. Yeah, I mean I don't have many more notes on this, um, just because they're literally talking about a game we all know very well. Um And I you know I was expecting to see some of the plays that like they didn't show them. Oh interesting.",
    "timestamp" : "01:09:02-01:09:17",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:09:17-01:09:27",
    "speaker" : "Tim",
    "text" : "I would have shown there was some audio that like that was in there that I I found interesting. I did like those kind of like behind the scenes, you know, Ryan Cox and Different uh players."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:09:28-01:09:29",
    "text" : "Hotel they stayed at, that was pretty interesting."
  },
  {
    "speaker" : "Tim",
    "text" : "Oh yeah, yeah, yeah. That was another uh interesting part.",
    "timestamp" : "01:09:30-01:09:32"
  },
  {
    "timestamp" : "01:09:33-01:10:40",
    "speaker" : "Andy",
    "text" : "Right. Um Yeah, but uh and also just like hearing the way Brady talked about Belichick and Belichick talked about Brady, especially like at the end where, you know, Brady's like, we're down 10 nothing. We're down by 10 points to a really good team uh in the fourth quarter in the snow. We haven't done anything on offense. And like, you know, we're like, what do we have to do? And Belishex comes over and be like, Yeah, all we need is one drive. Like we're still in this. Like just get a drive, get a touchdown. We're gonna call our best plays and let's just execute them. And he's like, and that was just like all we had to do. And uh, you know, it kind of just like shook them out of like, oh, woe is me sort of thing. And, you know, and just the two of them, the way they talk about how, you know, um I couldn't be the player I was without him. Uh pretty talking about Belichick, you know, because and even Belichick being like, uh I like Brady's preparation and what he brought every day like made me have to prepare even more than I normally would. So it was really that drove me. So it's just I think the two of them were the perfect combination of uh quarterback and head coach that like I don't think you'll see again."
  },
  {
    "speaker" : "Tim",
    "timestamp" : "01:10:41-01:10:54",
    "text" : "Yeah. There's a competition within the competition within within the competition and like yeah that was just the perfect recipe for uh the start of a dynasty."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:10:57-01:10:58",
    "text" : "Where's Troy Brown though?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:10:58-01:11:07",
    "text" : "No Troy Brown sightings too. No Troy Brown sightings. Yeah. Yeah. Because he was kind of the engine of the offense in the early 2000s. Oh yeah."
  },
  {
    "timestamp" : "01:11:07-01:11:16",
    "speaker" : "Greg",
    "text" : "Yeah, another couple unsung heroes from this game that I want to make sure get mentioned. David Patton, Jermaine Wiggins, Snowball. Massive, massive games."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:16-01:11:18",
    "text" : "Larry is a Redman."
  },
  {
    "speaker" : "Greg",
    "text" : "There he is. Oh. Yeah. There he is.",
    "timestamp" : "01:11:18-01:11:19"
  },
  {
    "timestamp" : "01:11:19-01:11:22",
    "speaker" : "Andy",
    "text" : "Two full recoveries on the podcast."
  },
  {
    "speaker" : "Greg",
    "text" : "A full game podcast. This is the one. Because there's so many like cool things that happen in this where you're like, holy shit, I forgot that happened. Yeah. And it's like Gary Rice is playing in this game. Like Right.",
    "timestamp" : "01:11:22-01:11:31"
  },
  {
    "timestamp" : "01:11:35-01:11:57",
    "speaker" : "Andy",
    "text" : "And the whole like Rich Gannon thing and his uh his um relationship with the head coach. Uh what's his name? Chucking Chucky there. Yeah. Uh his relationship with Gruden and how like deteriorated it was. They wouldn't even speak to each other on the sidelines and stuff. Like it was just bananas. Yeah. There's a lot of great storylines from that game. I agree. And Brown. Yeah."
  },
  {
    "timestamp" : "01:11:57-01:11:59",
    "text" : "All right, closing thoughts.",
    "speaker" : "Greg"
  },
  {
    "text" : "Closing thoughts. Uh so far so good. Um again, this isn't the documentary I would have put together. Um Because I would have focused more on the on the games themselves, because that's kind of what we do here. Um But so far I think it's rebalanced, but also there hasn't been a lot of new stuff for me um in this at all. I agree. I was hoping to see more behind the scenes of some of these things that um Would have been cool to see, but I guess, you know, maybe it doesn't exist or you know, maybe they just that wasn't part of the storyline like what Tim was alluding to earlier.",
    "speaker" : "Andy",
    "timestamp" : "01:11:59-01:12:39"
  },
  {
    "speaker" : "Tim",
    "timestamp" : "01:12:40-01:12:49",
    "text" : "So what would you rate the uh what would you rate episode one and episode two I don't know like 9. 5 or you know."
  },
  {
    "text" : "I give them like an eight out of ten. Seven, eight out of ten in that range.",
    "timestamp" : "01:12:49-01:12:54",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:12:54-01:13:00",
    "speaker" : "Greg",
    "text" : "Yeah. Okay. I mean it's just it's just because of the more football focused."
  },
  {
    "timestamp" : "01:13:00-01:13:12",
    "speaker" : "Andy",
    "text" : "Yeah, I mean it's just really good to see the snowball. Um but you know the first one was good to you know getting to see some of that um Belcheck in Cleveland stuff too. Um And the whole tie law lawyer alloy talking shit about Tom Brady."
  },
  {
    "text" : "Yeah. I thought it was too uh Brady Belichick centric, you know.",
    "speaker" : "Greg",
    "timestamp" : "01:13:13-01:13:17"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:18-01:13:18",
    "text" : "Yeah."
  },
  {
    "timestamp" : "01:13:18-01:13:45",
    "text" : "And Harrison mentioned that too in an interview. He's like, you know, that team was so much more than just those two guys. I thought like the the Tom versus time thing, like All right, like that's the focus of your document or documentary. Where this one I thought was gonna be more just like the Patriots in general. Obviously, Brady's a bit part of it, but I don't know. To me, I I would have liked to see more of like the other guys on this team get their OTIS.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Tim",
    "text" : "Yeah, give me some OTIS, dude.",
    "timestamp" : "01:13:46-01:13:48"
  },
  {
    "text" : "Antoine Harris.",
    "timestamp" : "01:13:48-01:13:50",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Tim",
    "text" : "To Bucky Jones. Right.",
    "timestamp" : "01:13:50-01:13:52"
  },
  {
    "text" : "Tabucky. Yeah.",
    "timestamp" : "01:13:53-01:13:54",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:13:54-01:14:14",
    "text" : "I mean, yeah, just the fact that we haven't seen Troy Brown. Yeah, David Patton, I mean, in this season, the second time they played the Colts was the only other player other than Gail Sayles to catch throw and run for a touchdown in the same game. Uh-huh. Then you mention it. Like you just you know mention it.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:14:14-01:14:23",
    "text" : "Well also my other thought is Apple TV sucks. It's such a brutal app. Can't believe I paid for this subscription."
  },
  {
    "text" : "Yeah. Well, I I got you.",
    "timestamp" : "01:14:24-01:14:25",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:14:27-01:14:29",
    "text" : "You uh compensate me for it?"
  },
  {
    "text" : "No, but I'll I'll make it so you don't have to wash the rest of them on it.",
    "timestamp" : "01:14:29-01:14:33",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:14:33-01:14:45",
    "speaker" : "Greg",
    "text" : "Oh yeah. Don't say too much, Andy. The feds will be kicking your door down. That's true. Steve Jobs coming back from the grave. Give me my nine ninety-nine motherfucker."
  },
  {
    "timestamp" : "01:14:50-01:14:54",
    "speaker" : "Andy",
    "text" : "I I can take the crafts, you know. I'm fine with it."
  },
  {
    "speaker" : "Greg",
    "text" : "I didn't think it was too heavy-handed on the uh conspiracy stuff or when he's talking about craft though. Maybe that comes later, but the first two episodes I thought were Relatively fair. I mean they gave a ball a chance to shine and they kind of talked them up.",
    "timestamp" : "01:14:54-01:15:07"
  },
  {
    "speaker" : "Andy",
    "text" : "So yeah. It's been relatively balanced so far. So yeah. Yeah. All right. Well, uh So far so good. There are ten. Ten. Yeah. We'll see how far we get.",
    "timestamp" : "01:15:07-01:15:23"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, we got a cliffhanger of Tom Brady getting his knee buckled in Pittsburgh. That's the end of it.",
    "timestamp" : "01:15:23-01:15:28"
  },
  {
    "speaker" : "Andy",
    "text" : "That's right. That's that's our episode two ended. Um And who could possibly replace him? I mean, no idea.",
    "timestamp" : "01:15:28-01:15:33"
  },
  {
    "speaker" : "Greg",
    "text" : "Who has played the victory? Is there anybody else who has played quarterback before? Dude, say what you want, but this season is so fucking miraculous. All this shit happened. It's storybook. Storybook, dude. I'm glad they spent enough time on this first season because it was like Like no other season, you know?",
    "timestamp" : "01:15:38-01:15:56"
  },
  {
    "timestamp" : "01:15:56-01:15:59",
    "speaker" : "Andy",
    "text" : "Absolutely, yeah. Especially as a way to kick off a dynasty too."
  },
  {
    "timestamp" : "01:15:59-01:16:01",
    "speaker" : "Greg",
    "text" : "It's yeah."
  },
  {
    "text" : "You can't really you could you couldn't craft it any better. Oh, I didn't even mean to do that. That was pretty good. Oh. That was an accident, but we'll pretend it was on purpose.",
    "timestamp" : "01:16:01-01:16:11",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:16:11-01:16:25",
    "speaker" : "Greg",
    "text" : "We're going to be sponsored next episode, craft ice LLC. Oh I don't think so. I don't think we gave the the ownership enough credit, you know. You know he's just a fan, right?"
  },
  {
    "text" : "God, this is so harsh on a fan. All right. Well, this has been a blast. And uh until next time, we'll see you later.",
    "speaker" : "Andy",
    "timestamp" : "01:16:29-01:16:39"
  },
  {
    "speaker" : "Greg",
    "text" : "Yep. Later. See ya. Later.",
    "timestamp" : "01:16:39-01:16:43"
  }
]