[
  {
    "speaker" : "Mom",
    "text" : "This is Christine Brown, and while I have to listen to this podcast, as my motherly duty, you have the choice not to. My sons sometimes say some naughty things when they're trying to be funny. But really, they're just being stupid. Do you still want to listen? Listen, go right ahead. I am not your mother.",
    "timestamp" : "00:00-00:17"
  },
  {
    "speaker" : "Andy",
    "text" : "Welcome back to the Pages Dynasty Podcast, the only podcast re-watching every game of the Dynasty era. Although right now we're kind of on a bit of a different tact, we are uh re-watching the rewatching of the dynasty, if you will. Uh we are currently going through the Apple TV, Apple TV Plus, I don't even know what they call themselves anymore. The documentary on Apple TV that you can find called The Dynasty Colon New England Patriots. A bit of a strange name, but that's okay. Um last episode we talked about the first two episodes. Our last episode we talked about the first two episodes of the this is gonna get complicated already. We talked about the last the first two episodes of the documentary, of which there are ten.",
    "timestamp" : "00:23-01:09"
  },
  {
    "text" : "It's like a dream within a dream, right Andy? Exactly, yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:10-01:13"
  },
  {
    "speaker" : "Steve",
    "text" : "Inception.",
    "timestamp" : "01:13-01:14"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:14-01:14",
    "text" : "So this is the same thing."
  },
  {
    "speaker" : "Andy",
    "text" : "We're dynastyceptioning.",
    "timestamp" : "01:17-01:18"
  },
  {
    "text" : "That's right.",
    "timestamp" : "01:19-01:19",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "So this week we're going to be talking about episode three and four. Episode three is uh called borrowed time. And let me give you the uh blurb from Apple TV.",
    "timestamp" : "01:20-01:32"
  },
  {
    "text" : "Well Yeah, it's fine. Let's let's go. I uh I've watched the Chiefs game from 2005. Isn't that what we're doing here? Like 2005 week, was it week 13?",
    "speaker" : "Steve",
    "timestamp" : "01:39-01:52"
  },
  {
    "text" : "You're doing the full Greg Brown, I see.",
    "timestamp" : "01:53-01:54",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:55-01:58",
    "speaker" : "Steve",
    "text" : "Where he throws where he throws three interceptions to that fucking no-name guy."
  },
  {
    "text" : "No, I don't well I don't know what you think this television show is, Steve.",
    "timestamp" : "01:59-02:05",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "02:05-02:07",
    "text" : "But it's not that it's part of the pages dynasty.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "02:08-02:09",
    "speaker" : "Mom",
    "text" : "Steve's forgot what I'm doing."
  },
  {
    "timestamp" : "02:09-02:25",
    "speaker" : "Steve",
    "text" : "Wait, does this does this does this does this documentary go game by game? It does not that's not a real documentary, is it? Yeah. Sounds like they're gonna gloss over a bunch of shit and make some shit up. That's true. Yeah. Um fucking montage it."
  },
  {
    "timestamp" : "02:26-02:37",
    "text" : "So the last episode I did say that I was trying to come into this with as much of an open mind as possible because I am a very big um Belichick supporter, I think I said.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "02:37-02:41",
    "text" : "Um and Belichickistan."
  },
  {
    "timestamp" : "02:41-03:45",
    "text" : "And from what I've heard, this is uh there are some criticisms that this is a Belichick hit piece. Um the first two episodes did not portray that, right, Craig? Um they were portrayed, yeah. Yep. I was talking about kind of the episode the first episode was about Drew Bledsoe getting hurt. The second episode was about the snowball. Um so some some pretty positive things. Um but now we're episode three and four. Episode three is called Borrowed Time And the blurb is, in the wake of 9-11, the Patriots emerge on football's biggest stage and face pressure that could unite them or tear them apart. In episode four, it's called Spygate. I'm pretty sure we all know where this is going. After three Super Bowl wins, pages are accused of videotaping and opponent sideline signals and things start to spiral. So that is what the documentary Creators are like it doesn't describe it very well. That that's that's kinda what I was trying to say. Yeah, like Yeah.",
    "speaker" : "Andy"
  },
  {
    "text" : "This the third episode is the the first Super Bowl, right? Yeah. So the fourth episode is spy gate slash oh seven.",
    "timestamp" : "03:45-03:57",
    "speaker" : "Greg"
  },
  {
    "text" : "Right. Skip over Super Bowl two and three? Dude. They just fucking gloss over that?",
    "timestamp" : "03:57-04:03",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "04:03-04:04",
    "speaker" : "Andy",
    "text" : "My first note scene."
  },
  {
    "timestamp" : "04:04-04:10",
    "text" : "Did they not cover the cheats game where he throws three picks to some fucking no-name guy in 2005?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "04:11-04:17",
    "text" : "My first notes in all bold and all caps. Yo, where the fuck is the rest of the 2003-2004 season?",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "There's literally like uh probably less than a minute of actual screen time. that they put on those two Super Bowl seasons. That's wild. They go from the first Super Bowl and then this episode's about to end and they're like, oh yeah. And then they won two more and now they're in Dynasty. It's like so it ends. It's like, what?",
    "timestamp" : "04:19-04:38"
  },
  {
    "timestamp" : "04:38-04:47",
    "speaker" : "Andy",
    "text" : "Yeah. They didn't even they didn't even I I don't think they showed any clips from the Panther Super Bowl. I think they showed I think they showed Belichick getting the um"
  },
  {
    "text" : "Gatorade bath?",
    "timestamp" : "04:47-04:48",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "04:48-04:51",
    "text" : "The Gatorade bath from the with his dad. Yeah."
  },
  {
    "timestamp" : "04:51-04:52",
    "speaker" : "Greg",
    "text" : "Yeah, yeah."
  },
  {
    "text" : "And that was it.",
    "speaker" : "Andy",
    "timestamp" : "04:52-04:53"
  },
  {
    "speaker" : "Greg",
    "text" : "And the Harrison interception. They don't show that.",
    "timestamp" : "04:53-04:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Right, right, yeah. But there's no mention of, you know, the Brady Manning, you know. Ongoing back and forth. There's no mention of the 21-game winning streak. Nothing about Bruce Gain's heart. Corey Dylan. Just nothing. Non-existent. Anton Smith doesn't exist. Right. Did we just go from the pages won the Super Bowl in 2001, SpyGate. Wait, what? How how did we get here?",
    "timestamp" : "04:56-05:22"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, that's a good what's that? Six years, five years?",
    "timestamp" : "05:22-05:27"
  },
  {
    "text" : "Yeah. And so, you know, I haven't watched any of these. Um, I'm coming in as fresh, but I have seen the talk on online about them as they were coming out. Um and one of the criticisms I saw that stuck with me is that like how uh they uh uh I understand going into like you know, the drama that happens with the Patriots, because that's what m the non fans want to see, you know, the the general hub public. That's what's going to interest them. But You can't blow up the Death Star without showing how powerful it is before you do it, you know? Like there's no payoff of like this period. No, no, no. This is someone I saw. It's a good one, right? That's why I obviously didn't come up with it. Yeah. Yeah. Because like you they didn't, I don't feel like they built up the pages of like, this is how successful they actually were. And that's why all the rest of this actually matters. That's why Spygate matters, you know? It just wasn't that. And they didn't even like touch on the fact that, you know, the pages were the good guys in 2001 as much. Because they were the underdogs and they were, you know, the Patriots coming out as a team. And they like they they talked about all that, but like it didn't transfer into this is why. There wasn't this like, oh now there's a turning point of them becoming the bad guys. It was just like, oh, so you know, they they were good, and now all of a sudden it's it's spy gate. It was it was a hard jump, I thought. But I will say I did enjoy re-watching Super Bowl 36. Against the Rams. Um and it actually works out well because I've been listening again to Elements Podcast that we don't name here because he stole the name from Greg. Uh but yeah, the one with Ty Law on. And I've listened to Ty Law, Greg? Have you have you heard it at all?",
    "speaker" : "Andy",
    "timestamp" : "05:27-07:13"
  },
  {
    "speaker" : "Greg",
    "text" : "I've seen clips of it online, but I haven't. Listen to any of the things.",
    "timestamp" : "07:13-07:16"
  },
  {
    "timestamp" : "07:18-08:17",
    "speaker" : "Andy",
    "text" : "He's awesome. He's the man. I highly recommend it. But in this one, he has some uh choice quotes too about uh how the the pick six that he had against Kurt Warner is like one of the easiest receptions he's ever had. Yeah. Like those are the ones I usually drop. Because it's just like it's too easy. Like ah there's gotta be something something wrong with this. But um Yeah, I thought there were some like uh, you know, behind the scenes stuff that I hadn't seen before. Um In terms of like they showed Will McGuinness like absolutely jawing at uh Jerome Bettis during the opening coin toss, which is really cool. Like Literally instead of like shaking hands after coin toss, you just like went up and got straight into his face. Like they were just yelling the entire time back and forth during the coin toss. It's because he was setting the stage to fucking fuck him up during the game. Yeah. It was awesome. Oh no, that wasn't even the Super Bowl, was it? That was the uh AC championship game, which again they kind of like touched on."
  },
  {
    "text" : "Um No mention of Troy Brown, Steve. No mention.",
    "timestamp" : "08:17-08:21",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "This is why I didn't watch it. I knew that. That's why I just skipped it. Hasn't even been brought up once.",
    "timestamp" : "08:22-08:27"
  },
  {
    "timestamp" : "08:27-08:49",
    "speaker" : "Andy",
    "text" : "Not even once. Nope. Nope. Yeah. No mention of him playing defensive back. God. Like that was a huge part of that two thousand four seasons. They were so injured. And then you have Troy Brown playing defensive back in That is kind of bullshit. They just you can just fast forward through two Super Bowls back to back, too. Yeah. Three and four seasons."
  },
  {
    "timestamp" : "08:52-09:00",
    "text" : "That's why this podcast will never be successful. Why? Because we're obsessed with stupid details that no one cares about.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "09:01-09:09",
    "text" : "I don't think so because the reactions, there's a lot of like negativity around this. Yeah. That that they especially that they skipped all that."
  },
  {
    "speaker" : "Greg",
    "text" : "But that's also Patriot fans if you're giving that feedback.",
    "timestamp" : "09:09-09:12"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, the the target market for this podcast and this documentary are two very different markets.",
    "timestamp" : "09:15-09:20"
  },
  {
    "text" : "Well that's the thing that I keep going back to too as well, like in even in the last episode is like who who is this for? Because non-pages fans don't really care about the behind the scenes stuff, right? Like what do they give a shit about? Like they don't like the Patriots. They've had 20 years of not liking the Pages. Why are they gonna care now? And the Patreon fans aren't gonna like it because all it is is about the drama instead of like the actual success.",
    "timestamp" : "09:20-09:43",
    "speaker" : "Andy"
  },
  {
    "text" : "Look, if Apple TV came out with a fucking six-part documentary about the fucking Jets dumpster fire of the last 20 years, fuck it, I am watching that shit. Yeah. I will sign up for Apple TV to watch that shit. But they have I don't even have an Apple device in my house. I'll go buy a fucking iPhone. And to so I can go see that shit. Like, I don't care if I would love that. That's good.",
    "timestamp" : "09:43-10:05",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "10:08-10:09",
    "speaker" : "Greg",
    "text" : "App is terrible."
  },
  {
    "text" : "Oh, it's horrendous. You can't you can't even tell which which show you're actually selecting because it doesn't highlight it well enough.",
    "speaker" : "Andy",
    "timestamp" : "10:10-10:17"
  },
  {
    "speaker" : "Steve",
    "text" : "Well like we we literally Can't watch it because you can't cast it to a Chromecast.",
    "timestamp" : "10:17-10:21"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "10:21-10:25",
    "text" : "Exactly. That's another thing. I can't watch it on the treadmill because it won't cast."
  },
  {
    "timestamp" : "10:25-10:25",
    "speaker" : "Steve",
    "text" : "Yeah."
  },
  {
    "text" : "I just have to watch it on this tiny little fucking screen on my phone. It's obnoxious.",
    "speaker" : "Greg",
    "timestamp" : "10:26-10:30"
  },
  {
    "text" : "So even if I did want to watch this thing, I couldn't watch it.",
    "speaker" : "Steve",
    "timestamp" : "10:32-10:35"
  },
  {
    "timestamp" : "10:35-10:38",
    "text" : "Yeah, well you can't because you have me as your brother.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "10:38-10:46",
    "text" : "But episode four, if you're a Patriots hater, the spygate Super Bowl lost to the Giants is probably like football porn.",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah. Yeah, I I wrote that it was hate porn. Um Like especially the way they cut this the they cut the clips up. Like it was just like it was getting battered and then cut to like a Giants fan just like orgasming on the sidelines. And then just like back and forth over and over again.",
    "timestamp" : "10:46-11:02",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "11:02-11:04",
    "speaker" : "Greg",
    "text" : "Like who's Did you think it was unfair, Andy?"
  },
  {
    "speaker" : "Andy",
    "text" : "No. It just I when I was watching this, I'm like, uh why am I watching this? This part.",
    "timestamp" : "11:05-11:11"
  },
  {
    "speaker" : "Greg",
    "text" : "It was a tough watch. I did I was watching it at dinner about 30 minutes ago. instead of listening to my wife or child. And I looked up at Kelly and I said, I'm not enjoying this.",
    "timestamp" : "11:11-11:24"
  },
  {
    "speaker" : "Steve",
    "text" : "And they need to come here and enjoy it even less. Yeah, exactly.",
    "timestamp" : "11:27-11:30"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "11:30-11:34",
    "text" : "Yeah, it was it was it wasn't great. Um"
  },
  {
    "speaker" : "Steve",
    "text" : "Well, how much time do they devote to that 2007 Super Bowl? Like what, like the screen time for the actual game?",
    "timestamp" : "11:35-11:42"
  },
  {
    "timestamp" : "11:42-11:51",
    "speaker" : "Greg",
    "text" : "Pretty decent amount. Yeah, probably half of the half of the episode four. Yeah, four years. First half is five gate, and then the second half is all the Super Bowl season."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "11:51-11:53",
    "text" : "Is each one like 16 minutes or something?"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh about 45 minutes, I think.",
    "timestamp" : "11:54-11:55"
  },
  {
    "timestamp" : "11:56-12:07",
    "text" : "Yeah. So we got like 15 seconds of Super Bowl. Two and three. Yeah. And then again, like 30 minutes of Super Bowl 2007.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah. But they also spent two full episodes on the first season.",
    "timestamp" : "12:07-12:11"
  },
  {
    "speaker" : "Andy",
    "text" : "Right.",
    "timestamp" : "12:11-12:12"
  },
  {
    "text" : "So that was kind of jarring too because they spent so much time like developing that first season. They did like an episode on the Snowbowl and the Super Bowl and the AFC Championship. And then they're like, oh yeah. And there was two more seasons. Right. Just they just mentioned it, you know? It was like you spent so much time on this one season, you almost expected that to like carry through.",
    "timestamp" : "12:12-12:33",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "12:34-12:53",
    "text" : "Right. Why they call it borrowed time, I'm not exactly sure because it's all about the 2001 Super Bowl. And then right at the end they're just like, oh, and they won a couple more. It's like, but what about and and then Splygate happens. Like, well That's actually like six years apart. Like there's other stuff that happened."
  },
  {
    "timestamp" : "12:54-13:08",
    "text" : "So what you're saying is for those listening. If they really want to relive those Super Bowls, they should go back to our podcast episodes and listen to every single game of every single season. Or just listen to Super Bowls.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "13:09-13:11",
    "text" : "Like you can listen to Super Bowl episodes.",
    "speaker" : "Andy"
  },
  {
    "text" : "Yeah. Yeah.",
    "timestamp" : "13:11-13:13",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Even just the episode.",
    "timestamp" : "13:14-13:15"
  },
  {
    "text" : "The pitch we have Kevin Falk on one of 'em. We got Matt Chatham. Matt Chatham on one of them. Yeah.",
    "speaker" : "Steve",
    "timestamp" : "13:15-13:21"
  },
  {
    "text" : "I think he was on the first one. Yeah, you're right. That was the first one. Um",
    "speaker" : "Andy",
    "timestamp" : "13:21-13:25"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "13:27-13:48",
    "text" : "All right, I have a couple notes questions for you guys from the first episode. So they went third episode? The third episode, yes, sorry. They went into the Patriots coming out as a team, right? And how inspirational that that was. Looking back, do we think that's corny or not? No, not for the time. No. No way."
  },
  {
    "speaker" : "Andy",
    "text" : "And it was a crazy trend. That was what makes it not corny. It was post-911 and it was like They were, you know, the the Patriots. They were the embodiment of America wearing red, white, and blue. And then to come out as a team is like this unifying thing where the whole country kind of been unified around this event that happened, I think The fact that it happened on the fly, I thought was pretty cool too. Like they weren't planning on doing that until they got to the tunnel and somebody at the bag's being like, Do you buy them as a team? Yeah. Do you buy that? Yeah.",
    "timestamp" : "13:48-14:15"
  },
  {
    "text" : "Then how do people know to announce them as a team?",
    "speaker" : "Greg",
    "timestamp" : "14:16-14:18"
  },
  {
    "timestamp" : "14:18-14:22",
    "text" : "Um they told they t actually told a guy at the front. Um I heard.",
    "speaker" : "Andy"
  },
  {
    "text" : "There's a guy at the front with a microphone?",
    "timestamp" : "14:22-14:24",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, there's literally a guy standing there with a microphone. Like as they go out, he announced that. He yells out their names, yeah. Yeah. I I I remember hearing it from again.",
    "timestamp" : "14:24-14:32",
    "speaker" : "Andy"
  },
  {
    "text" : "Huh? I feel like everything's choreographed in a Super Bowl.",
    "timestamp" : "14:37-14:40",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Well they've been doing it before the Super Bowl.",
    "timestamp" : "14:41-14:44"
  },
  {
    "text" : "Right? Exactly. So they would almost expect them to do it again, right? Yeah. Yeah. And they were like, well, let's decide in the tunnel. Nah, I'm not buying that. I don't know.",
    "timestamp" : "14:44-14:53",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "14:53-15:20",
    "text" : "Ty Law seemed like he had mixed emotions about it. Yeah. Or maybe that was a podcast listen to you. I don't know. But he was talking about like, you know, you you grow up wanting to be You know, be in the Super Bowl, like have your name and your number and your position announced and you run out there in front of the fans and then like all of a sudden there's a guy in the back being like, yo, let's go out as a team. He's like, fine. You know? So it wasn't like I don't think it was pre-planned, honestly. Just hearing the players talk about it."
  },
  {
    "speaker" : "Greg",
    "text" : "It was as impromptu as the uh Justin Timberlake. It was a fucking accident. I swear to God, guys. I swear to God. So the malfunction of the wardrobe, we just happen to have a thing around the nipple.",
    "timestamp" : "15:20-15:36"
  },
  {
    "text" : "Did you guys see that live?",
    "timestamp" : "15:36-15:38",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:39-15:50",
    "text" : "Yes, I remember I remember being at home and we had Tebow. Oh right. And we were like booop boo. We rewatched that shit and like and then it came out later like that was the most T Bowed moment in history.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "15:51-15:58",
    "text" : "That's when like TiVo was a verbal. You actually did a good job, Steve Brown with the TiVo noise. Well done.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "15:58-16:03",
    "speaker" : "Steve",
    "text" : "Yeah. That was like That shit was crazy. I remember we got that. It was game changing."
  },
  {
    "text" : "We had never been like the cool kids on the block with technology. You go to school, be like, yo, it's not Boys, I got that T bow.",
    "timestamp" : "16:04-16:11",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "16:13-16:17",
    "text" : "If you remember, we used to start Patriots games late. We would like wait for half an hour.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "I still do it.",
    "timestamp" : "16:18-16:19"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, and then and then start it and and fast forward the commercials.",
    "timestamp" : "16:19-16:22"
  },
  {
    "text" : "Yeah, you wait till halftime and then you can fast forward through all the commercials and then by the time half the second half starts, you can basically be caught up.",
    "timestamp" : "16:22-16:28",
    "speaker" : "Andy"
  },
  {
    "text" : "And then you'd be get pretty good at like figuring out how long commercial breaks are. And like you'd see commercials for like shows on CBS and you'd like, okay, let me like slow it down and then hit play. Yeah.",
    "timestamp" : "16:28-16:41",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "16:42-16:55",
    "speaker" : "Andy",
    "text" : "And by the time you hit play, it had already gone through like when they'd come back and were showing like clips of the stadium with the commercials over it, you know? Yeah. You got any more questions, Greg?"
  },
  {
    "speaker" : "Greg",
    "text" : "Well, I thought it was funny that Mike Marts was like talking about them coming out as a team and he was like, that was bullshit. Yeah. I wanna I wanted to shove it up their ass. I thought that was cool.",
    "timestamp" : "16:55-17:06"
  },
  {
    "text" : "Dick Mike Mars.",
    "timestamp" : "17:06-17:08",
    "speaker" : "Andy"
  },
  {
    "text" : "Is he? I don't know. I thought that was pretty funny. I thought it was stupid.",
    "speaker" : "Greg",
    "timestamp" : "17:08-17:12"
  },
  {
    "timestamp" : "17:12-17:32",
    "speaker" : "Andy",
    "text" : "And it's like, well, you know, I I haven't talked about it for for this long, but uh you know, they they were definitely cheating and uh you know I didn't want to come across as a crybaby, so that's why that's why I've held on to it for 20 fucking years, but I'll say it to this You know, this documentary. Like yeah, you you still kinda look like a crybaby, but I'm not sure. If you're not gonna be a good thing."
  },
  {
    "text" : "Cynical to me.",
    "timestamp" : "17:37-17:38",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "I think everybody was cheating, but if you ain't cheating, you ain't trying. I'm like, yeah, I don't think you believe that, Brad.",
    "timestamp" : "17:40-17:45"
  },
  {
    "speaker" : "Greg",
    "text" : "I think that's your inner demons, Annie, that you have to grapple with.",
    "timestamp" : "17:48-17:52"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "17:53-17:53",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "Um you two. Did you see the quote from U2? Yeah. Where was it? Like they're like pre-game because the whole thing was like whether Brady or Bel check or uh blood cell is gonna start.",
    "timestamp" : "17:55-18:07"
  },
  {
    "speaker" : "Andy",
    "text" : "Oh well well do we want to get into that part first about the media? All right, let me show the media real quick. Um It was all like uh Tony Kornheiser from PTI, like all quotes from him about, you know, I can't find anybody to even say New England can win the game, just how many the the Rams will win by. And talking about how the competitive state of the game is in question because it's a Patriots versus the Rams. And that this game has no juice whatsoever. So there's nothing other to write than Brady versus Bledsoe. And then they started showing clips of like, you know, everybody talking about Brain Rus Bloodsoe, including you two, like Greg was talking about.",
    "timestamp" : "18:07-18:42"
  },
  {
    "text" : "They said they wanted Bledsoe to start.",
    "speaker" : "Greg",
    "timestamp" : "18:42-18:44"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, because he had",
    "timestamp" : "18:44-18:46"
  },
  {
    "speaker" : "Greg",
    "text" : "Superior arm.",
    "timestamp" : "18:46-18:47"
  },
  {
    "text" : "Yeah, the superior arm throwing strength or something.",
    "speaker" : "Andy",
    "timestamp" : "18:47-18:50"
  },
  {
    "text" : "What the fuck is you two doing on this document? They're not even American.",
    "timestamp" : "18:50-18:54",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "18:55-18:59",
    "speaker" : "Andy",
    "text" : "Right. Oh, you could tell. You know what?"
  },
  {
    "speaker" : "Steve",
    "text" : "I think uh so Thierry Henry should start because he could kick the ball farther.",
    "timestamp" : "19:00-19:04"
  },
  {
    "speaker" : "Andy",
    "text" : "That's basically what it was. Yeah, but the American version, yeah. Uh also uh they kept cutting to like Jackie McMullen for some reason, and I I don't quite understand why she's a I love Jackie She's a basketball reporter. She has nothing to do with the Patriots. Why are we why are we interviewing her?",
    "timestamp" : "19:04-19:19"
  },
  {
    "text" : "I think her football opinions are better than most Boston sports media football opinions, if I'm being honest. Doesn't feel like that. I think McMahon's got a good history with Patriot supporting, right?",
    "timestamp" : "19:19-19:29",
    "speaker" : "Greg"
  },
  {
    "text" : "Mom? Yeah. Yeah. Yeah, of course she does. I'm not saying it's because she's a woman. I'm saying because she's a basketball reporter.",
    "timestamp" : "19:30-19:36",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "19:37-19:40",
    "text" : "Like why are we I wouldn't I wouldn't peg her as a basketball reporter.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "That's yeah, that's all she like, let's look at Wikipedia. Here we go. Uh basketball for the Wildcats, yeah. Oh shit. From 95 to 2000, you covered the NBA as a senior writer for Sports Illustrated. Okay. Larry Bird on his autobiography. Released Gino in Pursuit of Persect Perfection with Gino Oriema in 2006. New York Times bestseller when the game was ours with Magic Johnson, Larry Bird. Collaborate with NBA superstar Shaquille O'Neal to write his autobiography titled Shack Uncut My Story. Good to know he's uncut. Um correspondent on several cable television networks, regular panelists on around the horn.",
    "timestamp" : "19:41-20:26"
  },
  {
    "text" : "Are we doing a a reading of Wikipedia this episode? Apparently.",
    "speaker" : "Greg",
    "timestamp" : "20:28-20:32"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh she got she's in the the basketball hall of fame.",
    "timestamp" : "20:32-20:35"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "20:36-20:41",
    "text" : "It's the cliff notes here, Andy. Yes or no? She ever basketball"
  },
  {
    "text" : "She's not just basketball's bullshit. There's literally nothing on here about other anything other than basketball. When she suggested that the Boston Celtics should part ways with team Captain Paul Pierce. Wrote basketball love story.",
    "timestamp" : "20:41-20:57",
    "speaker" : "Andy"
  },
  {
    "text" : "Do you think she's a fair uh media member, Andy?",
    "speaker" : "Greg",
    "timestamp" : "20:58-21:02"
  },
  {
    "timestamp" : "21:03-21:07",
    "text" : "I don't know. I know I I haven't heard anything of her because she doesn't report on the Patriots in the world.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "She's not around the horn. That covers everything.",
    "timestamp" : "21:08-21:10"
  },
  {
    "timestamp" : "21:12-21:13",
    "speaker" : "Andy",
    "text" : "That show's garbage."
  },
  {
    "timestamp" : "21:14-21:25",
    "text" : "That show's sweet. No. I can't say that. To be fair, I haven't listened. I haven't watched it in about 10 years. Exactly. Yeah. Around the Horn PCI used to be my regularly scheduled programming.",
    "speaker" : "Greg"
  },
  {
    "text" : "Oh yeah, like every fucking college kid.",
    "speaker" : "Andy",
    "timestamp" : "21:25-21:27"
  },
  {
    "timestamp" : "21:29-21:33",
    "speaker" : "Steve",
    "text" : "I feel like Jackie Mack has written stories about everything. Celtics, Red Sox, Patriots, Bruins."
  },
  {
    "text" : "I know. I feel like I would have come across it at some point.",
    "speaker" : "Andy",
    "timestamp" : "21:35-21:42"
  },
  {
    "text" : "I don't know, Eddie. Can you even read?",
    "timestamp" : "21:42-21:44",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "21:45-21:51",
    "speaker" : "Andy",
    "text" : "Coming from UC, that's rich. Let's see those notes again."
  },
  {
    "text" : "All right, Nate, what else you got in the uh the Super Bowl here, this episode three?",
    "timestamp" : "21:52-21:57",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "21:57-22:44",
    "speaker" : "Andy",
    "text" : "All right. Um let's see. Uh I thought it was interesting that Tom Brady didn't party with the rest of the team after the Super Bowl. Um But because you just you know you mentioned Belichick being hung over. Yeah. Well well that was yeah, and I heard this story I think before somewhere else, but um That's bizarre to me. Yeah, that him and Brady got in the car the the day after, I think, to go back to the um the airport to go home. And Belichick comes in stinking of of alcohol and like just still drunk because he hadn't slept all night. And he sits down next to Tom and goes, well. Can you imagine Belichick drunk? Like what is that like? Awesome. It sounds like it's a bit like Mick Brown, right? Yeah. That's when you get the the the happy drunk because he sits on the bottom. Yeah, I love you."
  },
  {
    "speaker" : "Steve",
    "text" : "A lot of I love you.",
    "timestamp" : "22:44-22:45"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, Tom, you had a pretty good year. And that was his quote. And he's like, I don't think he's ever said anything nice that nice to make sense.",
    "timestamp" : "22:45-22:54"
  },
  {
    "speaker" : "Greg",
    "text" : "Um if you had asked me, I would have said he'd never touched a a drop of alcohol in his life.",
    "timestamp" : "22:54-23:00"
  },
  {
    "speaker" : "Andy",
    "text" : "Well, didn't it just come out today that he's never drank coffee?",
    "timestamp" : "23:01-23:04"
  },
  {
    "timestamp" : "23:04-23:05",
    "text" : "Doesn't drink coffee. Yeah.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "23:05-23:06",
    "speaker" : "Andy",
    "text" : "Doesn't drink coffee."
  },
  {
    "speaker" : "Greg",
    "text" : "He just doesn't seem like a guy that likes doing fun shit, you know.",
    "timestamp" : "23:07-23:10"
  },
  {
    "timestamp" : "23:11-23:32",
    "speaker" : "Andy",
    "text" : "Yeah, or just anything other than football. Yeah. Like this alcohol will take away from my football acumen, so I'm not gonna do it. Yeah. Um but I think we we should probably talk about Drew Bledzo because he's come up a lot in these first few episodes and he is an absolute class act. Like we can't do that. They what?"
  },
  {
    "speaker" : "Greg",
    "text" : "They undersold that moment of him coming in the Pittsburgh game.",
    "timestamp" : "23:33-23:36"
  },
  {
    "timestamp" : "23:36-23:43",
    "speaker" : "Steve",
    "text" : "Like they did not hype that up. Pittsburgh game? Ah see nothing about this so far makes me want to watch any of this shit."
  },
  {
    "text" : "I mean there's there's still like good clips in there. There was one where um like after camera was after oh I think it was after the Super Bowl, but um oh yeah, it was after the Super Bowl and um Some guy was trying to interview Brady like on the field after the game, and Brady just like completely ignored him to go find Drew Bledsoe to give him a hug. And just like, and then there was all these quotes from um Drew talking about how after the Pittsburgh game, you know, they had a couple of uh practices just like with both of them. And then he's like, you know, Bill called me up to his hotel room and said, you know, Tommy's ankle looks good, so we're gonna go with him. And uh his response was, I'll do whatever I can to help him to play well in this game. Like I have all year. Like that's that's a hard after saying, you know, this is a bigger bill to swallow, and it was like the most disappointed I've been in my life. Like that's it's you know, we I I know we always talk about how. Troy Brown was like the original patriot way patriot. We could almost like make an argument for Drew Bledzo too. being that selfless guy who's just giving back the team no matter what, even though like it kind of like it wasn't it didn't end his career, but it kind of put a damper on it right then, right? He went from being the first hundred million dollar guy to being a backup that just got shipped off to Buffalo. It was never the same.",
    "timestamp" : "23:43-25:11",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "25:14-25:39",
    "text" : "Started in Dallas and we had a decent career after, but yeah. Until this year? Uh yeah. I feel like I heard that recently of like we haven't picked this high since we picked Drew Bloodsaw."
  },
  {
    "text" : "I feel like Richard Seymour was high.",
    "timestamp" : "25:40-25:43",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "The only other top ten pick of Belichick's career is our current head coach.",
    "timestamp" : "25:46-25:50"
  },
  {
    "speaker" : "Greg",
    "text" : "Stat check?",
    "timestamp" : "25:59-26:00"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "26:04-26:30",
    "text" : "A couple more things while Greg's with that. Just talking about the pages way and uh Brewski in this episode actually said that's where the Patriot Way started, talking about Drew Blends on the way you handled the Super Bowl, which was pretty cool. Because it was a selfless thing. And yeah, it's hard to argue with that. I mean on the field is probably Troy Brown, but off the field, like that's Just the the way that you know they're everybody's giving everything that they have, regardless if it's on the field or not."
  },
  {
    "speaker" : "Greg",
    "timestamp" : "26:30-26:45",
    "text" : "That's uh Seymour was sixth overall, Terry Glenn seventh. Willie McGuinness fourth, Blood Soul First. McGuinness then, yeah. Irving Fryer was first in 1984. Kent Sims, never even heard of that dude."
  },
  {
    "text" : "Mm-hmm.",
    "speaker" : "Andy",
    "timestamp" : "26:45-26:46"
  },
  {
    "timestamp" : "26:47-26:56",
    "speaker" : "Greg",
    "text" : "And that's Sims Jimett, 1971. Oh yeah. Jack Concannon in 1964. First overall."
  },
  {
    "speaker" : "Andy",
    "text" : "That's pre-Super Bowl 64, isn't it? First Super Bowl in 66. Or that's 60.",
    "timestamp" : "26:56-27:01"
  },
  {
    "timestamp" : "27:01-27:07",
    "speaker" : "Greg",
    "text" : "Yeah, that's old. Mike Haynes was fifth overall. He's a legend. John Hanna, fourth overall. Yep, also a legend."
  },
  {
    "speaker" : "Steve",
    "text" : "What you're saying is we should be hype for Thursday.",
    "timestamp" : "27:08-27:10"
  },
  {
    "speaker" : "Andy",
    "text" : "Top five is not bad.",
    "timestamp" : "27:11-27:13"
  },
  {
    "timestamp" : "27:14-28:05",
    "speaker" : "Greg",
    "text" : "But the good thing about the blood cell moment, right, is you can look back and have the warm and fuzzies because of that game. Right. If he had just sat out the rest of the season and they won, it's that feeling that like he didn't contribute at all. Like he d he feels like a part of this Super Bowl season, right? Right. Like Bledsoe earned a ring because he stepped in in the AFC conference game and won the game as a big underdog. And he can always fucking have that of like, I wasn't just on a championship team, but I contributed to the team pole. Yeah, to a championship team. So like that to me was why that moment is so special. Is like it wasn't some random week 15 blowout that he got in the game, right? It's just like the one of the biggest games of the season and he comes in and he wins it. And like it's just it gives you the warm and fuzzies looking."
  },
  {
    "timestamp" : "28:10-28:31",
    "text" : "Say, you know, um despite all rumors to the the opposite. The Pagers actually have shown up to this game and will compete against the Steelers today in Pittsburgh. Right? Like they they weren't supposed to win that game either. And yeah, like you said, Drew Bledsoe came in and the first thing he did was throw that touchdown to Uh David Patton and then gave that kind of like who, me kind of shrug and looking at the sidelines.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "28:31-28:55",
    "speaker" : "Greg",
    "text" : "So sick. Also, we talk about it in the game too. I if that I remember that episode being a lot of fun. When we recorded that game. But like that moment where he like steps in, it's like the second play, he's running to the sidelines and gets hit off. Yeah. And then he just like jumps back up and starts clapping. And it's like, that's a fucking cool moment. And then we and then we found That's a cool mode. Like there's so many fucking sick parts of that."
  },
  {
    "speaker" : "Andy",
    "text" : "And they just but lost right over.",
    "timestamp" : "28:56-28:57"
  },
  {
    "speaker" : "Steve",
    "text" : "I will say though, rewatching that game, it was You come in and be like, yeah, Bledsoe won that game. And you're like, you rewatch it in full. You're like, Bledsoe didn't lose that game. He hung on. He threw that one touchdown pass. That second half was like, it was fucking butthole clenching. He didn't he didn't like play great, but like obviously the guy hadn't played since week three. You know, super serious injury. like three months ago where you almost died on the operating table.",
    "timestamp" : "28:58-29:26"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "29:28-29:56",
    "text" : "Yeah you almost you almost died. You you're injured for six weeks. Weeks, you lose your job to an unnamed rookie. You haven't played in however many months. And this guy goes down and you have like 30 seconds. To warm up, get in the game, and like get yourself like mentally in the right space to play. And two plays later, you have an exact repeat of yeah. Yeah. Yeah. Like that's head spinning territory. Like I can't even imagine what that feels like. Right."
  },
  {
    "speaker" : "Steve",
    "text" : "Imagine how different it would have been if he had been like a malcontent And yeah, cause to fit like in this day and age of being the diva quarterback and going to the media and putting out, you know you know, sources say in the press and just being a bitch about everything.",
    "timestamp" : "29:56-30:12"
  },
  {
    "speaker" : "Andy",
    "text" : "Instagram posts and stuff.",
    "timestamp" : "30:13-30:14"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Yeah, yeah. Unfollows the Patriots on Instagram. Exactly.",
    "timestamp" : "30:14-30:17"
  },
  {
    "timestamp" : "30:17-30:23",
    "text" : "Yeah. Yeah, likes a fan's thing, like starting. Yeah. Likes a comment. Yeah. Yeah.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Especially if if Brisky's over here saying like that attitude is what con you know. was the foundation of the PGS way. Do they win those of their Super Bowls? Is Belichick a successful? Blah blah blah.",
    "timestamp" : "30:23-30:33"
  },
  {
    "text" : "Right. Steve, I asked a question last week. I want to hear your opinion on it. If say like when Bledsoe got healthy. Instead of sticking with Brady, they went back to the Bledsoe. Did they win the Super Bowl? And if not, how far do they go",
    "timestamp" : "30:33-30:48",
    "speaker" : "Greg"
  },
  {
    "text" : "Well, first of all, can you say the first part again where you said you want my opinion? I want your opinion. Oh yeah. Yeah, yeah. Those are my second favorite words besides you're right, but Um but you don't hear those ones very often. So I mean I've I feel like I've been on the record before of Beljack's system gets them there and Brady has that unnatural second gear to to win in the biggest moments and step it up. So I mean they probably lose that snowball. Yeah, that's what I said too. Yeah. Look at that. Oh god. That's scary.",
    "speaker" : "Steve",
    "timestamp" : "30:49-31:25"
  },
  {
    "text" : "All right, what else we got? Super Bowl? Any notes, Andy?",
    "timestamp" : "31:31-31:34",
    "speaker" : "Greg"
  },
  {
    "text" : "Yeah, I got some. Some some choice Ernie Adams quotes. Ernie Adams is my favorite part of this so far. He's just like he's your grandpa talking about fucking old football games is great. Um Talking about the Super Bowl. We shut them out for the first fifteen minutes, then all hell broke out. That's about right. Yeah. Um and in in the podcast with Edelman he was talking about how uh, you know, during the game he didn't know of any of this, but he went back and rewashed it and heard Madden's commentary. And he's he basically thought that Madden wanted the Patriots to go to O t overtime so that they could lose in, you know, honor as an as the honorable underdog. You know, it's like, oh this is you know, they're supposed to lose. But they put up a good fight, but you know, they should lose. So, you know, they'll go to overtime and then they'll that's when they'll lose it. So I thought that was kind of like a an interesting take, and I'd never heard that before. Um like the Falcons. Yeah, yeah, yeah, that kind of feel. Um, but the other way around. Especially being like the huge underdogs too, you know. I was like, oh, you know, you you put up a good fight, but uh that's enough. Like you can lose now. Um There was also uh a bit more about Robert Kraft in this one too, um kind of him talking about how he he ended up buying the uh the team. Which I still think didn't go into a lot of detail, but um We got a guest.",
    "timestamp" : "31:34-33:02",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Oh boy.",
    "timestamp" : "33:02-33:03"
  },
  {
    "timestamp" : "33:04-33:10",
    "speaker" : "Andy",
    "text" : "He thinks it's funny. What do you think, Calvin? Talk to me about Spygate."
  },
  {
    "speaker" : "Greg",
    "text" : "Calvin, one day we'll teach you all about our Lord and Savior, Tom Brady. That's correct. All right, I'll go on mute. You can continue, Andy.",
    "timestamp" : "33:10-33:20"
  },
  {
    "speaker" : "Andy",
    "text" : "All right. Which because at the be at the uh uh last episode it started with Belichick. Um no not Belichick, uh fucking Robert Kraft buying the team, but they just like announced it on like uh they just showed a bit of the um the press conference where it happened and that was it And so they talked about him in this one, um, you know, making the right business decision, buying the stadium and the parking, like the land that the stadium was on, because that's where all the money was from, because nobody actually paid any tickets to the games. Um so money was all in the parking and it also prevented other teams from other um buyers from buying the team But he did say that he was a self-made businessman, which is kind of stretching the truth because uh he just took over his wife's uh father's business. And made some uh apparently I think he made some like super sketchy decisions that just worked out. Like went all in on these like really kind of crazy deals and they worked. And that's how he ended up like becoming this big factor in the Cardboard industry, whatever the fuck it was. Paper. Paper or cardboard, whatever. Yeah. Um Michael Scott. Right. Except um his decisions worked out.",
    "timestamp" : "33:22-34:36"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "34:37-34:48",
    "text" : "That that um The the dynasty book is probably way fucking better than this thing. Not that I've seen this thing, but that one that the same guy who wrote the Tiger Woods biography."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Andy",
    "timestamp" : "34:48-34:48"
  },
  {
    "speaker" : "Steve",
    "text" : "Jeff something or whatever. Yes. Um Benedict. Something like that, yeah. That sounds right. Either way, that covers Robert Kraft buying a team and like really cool. And I learned a lot.",
    "timestamp" : "34:48-35:00"
  },
  {
    "speaker" : "Andy",
    "text" : "from that and I was like, absolutely, and that's kind of what I thought we were gonna get. And we like to keep kind of like going to but then like just scrape the surface and like running away again.",
    "timestamp" : "35:00-35:08"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "35:08-35:26",
    "text" : "So it sounds like this documentary is just fucking bullshit. It's glossing over some of the depth stuff and showing you the shit people already know. Like Snowbowl and the fucking Super Bowl and Spygate. Like, is there anything actually like?"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "35:27-35:30",
    "text" : "New here? Greg, have you learned anything so far from these?"
  },
  {
    "timestamp" : "35:30-36:00",
    "speaker" : "Greg",
    "text" : "I thought episode four was new for me, but part of it's probably because I've gone back and watched And had podcasts on all these Super Bowls. So it's like that shit is not really new to me, even if I You know, I've seen it in the recent history in the last couple of years. And you've watched highlights of that stuff a million times over. Whereas You the bad shit I don't really we rewatch. So I found some of that kind of like, oh yeah. I guess that's how that went down."
  },
  {
    "text" : "Yeah, um I'll agree with that. Yeah, especially like yeah, these first few like that 2001 Super Bowl, like all the way through 2003, because you know, right now we're through the 2005 season. It's all kind of like fresh for us ish still. Um because like that's what we've talked about for a few years now. Like all these games we've got to do. We've been at this for five years almost Andy. Jesus Christ.",
    "timestamp" : "36:01-36:23",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "36:24-36:27",
    "speaker" : "Steve",
    "text" : "September will be five years I've been doing this podcast."
  },
  {
    "speaker" : "Andy",
    "text" : "Um thanks for bringing that up. Appreciate it. That's a long ass time. We've made it through 2004.",
    "timestamp" : "36:28-36:34"
  },
  {
    "text" : "Yeah, we're going like a one season per year. Good for us. Okay, let's go. We're getting there. Because we're doing stupid episodes like covering this bullshit ass fucking documentary. Instead of that 2005 Chiefs game where Tom Brady throws two year interceptions, some fucking no-name guy.",
    "timestamp" : "36:35-36:50",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "36:51-36:53",
    "text" : "I don't believe that you've watched that game."
  },
  {
    "speaker" : "Steve",
    "text" : "I didn't watch the game. I looked it up because I thought I might meet Tom Brady and I was like, well You know, I gotta prepare my pitch for him. That's nice. And I memorized the guy's name and I've since forgot it.",
    "timestamp" : "36:54-37:04"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "37:05-37:08",
    "text" : "I don't think you understand what memorize means, Steve."
  },
  {
    "text" : "I memorized it for like 12 hours, didn't you track?",
    "timestamp" : "37:08-37:11",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "37:14-37:16",
    "speaker" : "Andy",
    "text" : "He could have regurgitated it if he needed to at the time."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "37:16-37:20",
    "text" : "Yes, yeah. In those 12 hours I had it, I had it on lock."
  },
  {
    "text" : "Yep, that's how we used to take tests. Um I did think it was interesting when um the one quote from Robert Kraft was he turned to Jonathan at halftime when they were up, what, 14 to 3 or whatever it was. And he looked at me and said, what am I gonna say if we win? Like he hadn't prepared anything.",
    "speaker" : "Andy",
    "timestamp" : "37:20-37:40"
  },
  {
    "timestamp" : "37:41-37:41",
    "speaker" : "Greg",
    "text" : "Why?"
  },
  {
    "text" : "You think so?",
    "timestamp" : "37:42-37:43",
    "speaker" : "Andy"
  },
  {
    "text" : "My bullshit meter going off there, dude.",
    "speaker" : "Greg",
    "timestamp" : "37:44-37:47"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "37:48-37:49",
    "text" : "Wow, all right. I was trying to get it."
  },
  {
    "timestamp" : "37:49-38:00",
    "speaker" : "Greg",
    "text" : "Someone that is like an owner of a team is prepared for shit like that. They're not like, I never even considered if we win. It's a fucking game, dude. Like, you know, what do you mean you didn't consider? Literally, like everything."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:02-38:05",
    "text" : "Everything all the media coming in was about how they weren't ever gonna win."
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, I know, but then but everybody says that in football games, Andy. But everybody knows that anything can happen. And if you're the owner, you're gonna have to say something if your team wins. You're gonna think about and prepare for it, because that's what being the adult is and having a job.",
    "timestamp" : "38:05-38:18"
  },
  {
    "timestamp" : "38:18-38:29",
    "speaker" : "Steve",
    "text" : "That was also the we're we are all patriots thing, right? Like tonight we are all that's a line. That is an absolute He didn't fucking think that up on the spot. Yeah, no way he thought that up between."
  },
  {
    "timestamp" : "38:30-38:32",
    "speaker" : "Greg",
    "text" : "Scribbled that on a napkin as he was walking."
  },
  {
    "speaker" : "Steve",
    "text" : "That's a fucking line. Yeah.",
    "timestamp" : "38:34-38:36"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, well let's talk about episode four. Let's go to spygate. Let's just get this. That was good.",
    "timestamp" : "38:37-38:44"
  },
  {
    "timestamp" : "38:45-38:47",
    "text" : "That was good. Good talking about it. Alright, what's next?",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "38:48-38:50",
    "text" : "What's next weekend? Guilty."
  },
  {
    "timestamp" : "38:51-38:52",
    "speaker" : "Steve",
    "text" : "Guilty is charged."
  },
  {
    "timestamp" : "38:53-39:04",
    "speaker" : "Andy",
    "text" : "I I just want to say that uh the name Spygate is such a stupid name. Like I I just Like I always find myself, you know, getting into arguments with people, believe it or not, you know. I'm so laid back."
  },
  {
    "speaker" : "Steve",
    "text" : "Well, you are the admin of the Patriots subreddit, so that makes sense, Andy.",
    "timestamp" : "39:05-39:08"
  },
  {
    "timestamp" : "39:08-39:08",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Well, you know.",
    "timestamp" : "39:09-39:09"
  },
  {
    "speaker" : "Andy",
    "text" : "Um, but like just even saying the word spygate just feels so I don't know, child I just wish they had come up with like a better name for it, you know? The same with Deflate Gate. Like Deflate gets even worse because it's like you just wanted to put a gate on the end of something. My gate was fine.",
    "timestamp" : "39:10-39:25"
  },
  {
    "timestamp" : "39:25-39:26",
    "speaker" : "Steve",
    "text" : "The flake gate was bad."
  },
  {
    "timestamp" : "39:27-39:29",
    "speaker" : "Andy",
    "text" : "I don't know. I just wish they had come up with something I don't know."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "39:30-39:55",
    "text" : "Was this the first time they'd attached gate? to a scandal since Watergate? I thought you were gonna say ever. I was like, uh Steve, I got news for you, buddy. But like now, now everything is something gate. Everything is something my question is like before Spy Gate. Was it like whatever, whatever gate and then spygate? Or was it like the first time they're like, oh, let's take Watergate And this thing."
  },
  {
    "speaker" : "Andy",
    "text" : "No, I th I think they had people had been using gate to like put on things like that, but none of them have like can you think of another gate? It was definitely in the vernacular. Yeah, that's what I'm saying.",
    "timestamp" : "39:56-40:07"
  },
  {
    "timestamp" : "40:07-40:09",
    "speaker" : "Steve",
    "text" : "It was like nip gate."
  },
  {
    "text" : "But like I do think there were.",
    "timestamp" : "40:09-40:10",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "40:13-40:22",
    "text" : "That wasn't the thing. I can't I personally can't think of something before Spine Gate that was something gate. I got a list. Oh, we got a list of gates."
  },
  {
    "timestamp" : "40:23-40:27",
    "speaker" : "Greg",
    "text" : "It's on here. It's on the Wikipedia. Nipplegate 2004."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "40:27-40:28",
    "text" : "Obviously. But pre-2004."
  },
  {
    "text" : "2004. Yeah, that'd be Zyra, wasn't it? Oh one.",
    "timestamp" : "40:29-40:31",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. No, U2 was a one. U two was oh one. It was the uh Eagle Super Bowl.",
    "timestamp" : "40:32-40:37"
  },
  {
    "text" : "Uh",
    "timestamp" : "40:37-40:37",
    "speaker" : "Greg"
  },
  {
    "text" : "Or Panthe, uh Pantheon Super one.",
    "timestamp" : "40:38-40:40",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Gamergate, I've heard of that.",
    "timestamp" : "40:40-40:42"
  },
  {
    "text" : "Yep. But pre 2001.",
    "speaker" : "Andy",
    "timestamp" : "40:42-40:45"
  },
  {
    "timestamp" : "40:46-40:48",
    "text" : "Uh not 2007.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "What is it?",
    "timestamp" : "40:50-40:50"
  },
  {
    "timestamp" : "40:51-40:58",
    "text" : "Pressure gate. Uh British Chancellor Norman Lamont had purchased cigarettes and champagne at an off license.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "But like I was about to say, like it was used, but it it didn't blow up the way that Spygate did, I think.",
    "timestamp" : "40:59-41:04"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "41:06-41:08",
    "text" : "And now it's everything gate."
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah.",
    "timestamp" : "41:09-41:09"
  },
  {
    "text" : "Abu Ghabi gate? I don't think I've ever heard it called that. What is it? Oh no. Abu Ghraib, you know the Abu Ghraib prison thing in Iraq? Oh yeah, no. Um Yeah, these are stupid. These none of these are actually legit.",
    "speaker" : "Greg",
    "timestamp" : "41:10-41:26"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "41:26-41:27",
    "text" : "That's what I'm saying."
  },
  {
    "text" : "Yeah, I th I like it was used a lot, but like they were all can we hit some other highlights of gates though while we're on this like post-2007 gates besides the flight gate.",
    "speaker" : "Steve",
    "timestamp" : "41:27-41:36"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean Pizzagate. Really? Pizza Gate. Yeah. That was one.",
    "timestamp" : "41:38-41:43"
  },
  {
    "text" : "Did they try to make uh Robert Craft's rub and tug a gate? Was that a massage gate? Yeah, I don't know. Asi Asian what was the name of the place? Asian.",
    "timestamp" : "41:45-41:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Right. I think we might have made this famous. The gate thing. Yeah.",
    "timestamp" : "41:58-42:02"
  },
  {
    "timestamp" : "42:02-42:09",
    "speaker" : "Andy",
    "text" : "That's what I'm saying. Correct. For our Generation."
  },
  {
    "text" : "Bounty Gate.",
    "timestamp" : "42:09-42:10",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "There's another good one. Bounty Gate, yeah. Bounty Gate, yeah. That's another relevant one. Um Yeah, speaking of Spygate. Uh this episode kind of opens with this guy, Patrick Armini, I think is how you pronounce his name. Yeah, this this guy. Fucking hard. What a hard O he was, huh? He is uh he was new New Jersey State Police. What he used to do? He was uh undercover for the FBI or something like that. Um like breaking up some sort of prime ring. Um and then he after that he's like, I don't want to do this anymore. Like, you know, like you can pick wherever you want to go. So it's like I want to be the head of Metalland security. They're like, absolutely. And so this is the guy who's like, you know, they brought him the tape and he's just like, well",
    "timestamp" : "42:10-43:03"
  },
  {
    "speaker" : "Greg",
    "text" : "He referred to himself as the mayor of the Meadowlands. Right. What a dickhead. What a dickhead.",
    "timestamp" : "43:06-43:13"
  },
  {
    "timestamp" : "43:14-44:01",
    "speaker" : "Andy",
    "text" : "An absolute dickhead, yeah. Yeah. And so he uh He's the one that like they gave him the tapes. Like they confiscated the tape from whoever was doing the taping. And uh he held on. He's like, well, you know, possession is not intense of law, so I'm not giving this back to the like the page. Like, dude, that's fucking our tape. Like you can't just take it like that's fucking stealing. And he's like, well, I have it now, so there's nothing you can do. I'm giving it to the league. Um And they just like kept going back to him too. And I was like, I don't care what he has to say. Like, doesn't matter. Like he played this tiny little part in this where he's the one that like gave the tape to the league and that was it. But they kept like asking his opinion on things. Like I I I don't care what he has to say. Like he's the mayor of the Meadowlands. Like, yeah, he dude's a Jets fan. Like, of course he doesn't agree with anything."
  },
  {
    "text" : "Have you guys like been to like the area around the Meadowlands? No. I mean I've driven through it. Dude, we have one of the locations there. Fucking awful. It's like it's legit concrete everywhere and just like it's weird. There's like a shitload of power lines everywhere.",
    "timestamp" : "44:01-44:20",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "44:20-44:25",
    "text" : "Just like there's tons of chemical processing plants down there too, right? Yeah."
  },
  {
    "speaker" : "Steve",
    "text" : "Super industrial, tons of fucking concrete power lines, weird like hitchback intersections. Highways everywhere.",
    "timestamp" : "44:25-44:34"
  },
  {
    "timestamp" : "44:35-44:47",
    "speaker" : "Greg",
    "text" : "It feels like dystopian. Yeah. Where you're like, this is what the human race has done. Yeah. Go over this whole thing and put up a bunch of fucking processing plants. You're like, dude, is this district nine?"
  },
  {
    "text" : "Smoke into the air. Yeah. That's exactly what you'd expect to go through to get to a stadium that houses the jets, though, right?",
    "speaker" : "Andy",
    "timestamp" : "44:47-44:54"
  },
  {
    "text" : "Yeah, absolutely.",
    "timestamp" : "44:54-44:55",
    "speaker" : "Steve"
  },
  {
    "text" : "Feels fitting. Just it's just terrible. They're just like dumpster fires in every corner, basically.",
    "speaker" : "Andy",
    "timestamp" : "44:55-45:01"
  },
  {
    "timestamp" : "45:01-45:12",
    "speaker" : "Steve",
    "text" : "They're not as like like there's not even fucking you just let the dumpster fire burn because like what's it gonna burn? Other concrete? Right. Yeah. It's wild how much like like warmth. Zero green there is."
  },
  {
    "text" : "Yes. It is crisp. Awesome. Um",
    "speaker" : "Andy",
    "timestamp" : "45:12-45:16"
  },
  {
    "text" : "But the Patriots are guilty, right? We all agree it. We're all in alignment here on this podcast. I don't think that's ever really been the question. Yeah. Right. Which I thought was the Super Bowl taping thing, whereas like in my head I was like, I don't know if they really did it. But they definitely taped the Jets and the law is clear as can be and they cheated. Yeah.",
    "timestamp" : "45:17-45:39",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "And it's like a mis but it's like a misdemeanor.",
    "timestamp" : "45:39-45:41"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. Yeah. And it was one of those things where like it was a memo from the league, so Belichick basically just ignored it and just did what he wanted to fucking do because he'd already been doing it. Um But he knew he was cheating. We all agree with that. Yeah, yes. Okay. Yeah, I mean, and everybody did when they did it. Yeah, if I could pull them like ah well, you got me.",
    "timestamp" : "45:42-46:02"
  },
  {
    "text" : "Speeding, it's more like it's more like peeing in public. Greg has experience in this. You know, you're drunk, you got a piss, you know, everyone else is, you know, who hasn't walked up to a building and just taken a piss, you know You're like, what are you gonna do? Like kind of bathroom? Like it's late, you know? And then a cop comes up, you're like, yeah, you have your dick out in public and you're You're pissing on this public building and like, yeah, I was wrong. I shouldn't have pissed on this building. I'm sorry. I'm drunk. And then they fucking send you to prison for fucking ten years and you're like, what the fuck? Our inspectors over here being like, send that motherfucker to jail.",
    "speaker" : "Steve",
    "timestamp" : "46:03-46:43"
  },
  {
    "speaker" : "Greg",
    "text" : "You're registering as a a sex offender. Yeah, yeah. Yeah.",
    "timestamp" : "46:45-46:51"
  },
  {
    "timestamp" : "46:51-47:04",
    "speaker" : "Steve",
    "text" : "Yeah But you have me a school. It's just like it was like kind of close-ish to a school. They they actually expanded the school zone to include that. So now your infractions within the school zone. Exactly. Yep. Yeah."
  },
  {
    "timestamp" : "47:04-47:15",
    "speaker" : "Greg",
    "text" : "But they said they were in the documentary, they said they were routing it up to the to the press boxes and then relaying it to the Patriots play callers."
  },
  {
    "speaker" : "Andy",
    "text" : "I missed that part.",
    "timestamp" : "47:15-47:16"
  },
  {
    "text" : "So this is like live. It's not just like recording and then we go after the game and look and try and figure tendencies out. This was like Yes, they're videotaping and then adjusting like by play by play based on these right.",
    "speaker" : "Greg",
    "timestamp" : "47:17-47:31"
  },
  {
    "timestamp" : "47:31-48:33",
    "text" : "But like Belichick, I mean they showed Belichick uh like doing an interview with I don't know 60 minutes, what the fuck it was. Um And he's like, it's exactly the same way as if we were just like had somebody with binoculars up in the booth, like writing down what they were doing instead. Like this is just bit more convenient, that's all. And And that's sort of what it feels like. It it feels like the same thing that everybody else is doing. Like yeah, even It feels like that would be I don't know, I I feel like it's not like anybody's hiding these signals. Like the entire fucking country can see 'em because it's on nationally broadcast cylinders. And we talked about this when uh the Michigan stuff came up, right? Like they're they're really holding up these fucking huge placards. with like freaking faces on. It's like everybody can see them. It's just like, can you decode it quickly enough? And you know, I mean I don't know that video camera doing it live is gonna help any. Like unless you're if you're using the video camera to like study it later on maybe um so you can go back and watch it and you don't have to like do the handwritten stuff like I don't know I I didn't it feels like one of those things where you're not gonna get a lot out of it",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Well the real question is if it was a live feed to the booth, what was on the tape? Was there even a tape?",
    "timestamp" : "48:34-48:42"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "48:43-48:48",
    "text" : "They destroyed there were tapes because they showed clips of it in this."
  },
  {
    "text" : "So was it a tape or was it a live feature?",
    "speaker" : "Steve",
    "timestamp" : "48:49-48:51"
  },
  {
    "text" : "Or was it both?",
    "timestamp" : "48:53-48:53",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "And does like 2007 technology really That's what I thought. Would they even be able to do that now? Right?",
    "timestamp" : "48:53-49:01"
  },
  {
    "timestamp" : "49:02-49:30",
    "text" : "You can definitely do it now with like wireless, you know, streaming and the actual like technology, but just think about the logistics of like how it would have to work and who would have to communicate in such a short period of time. Yeah. Like you have to film it, you have to relay it, you have to watch it, you have to interpret it, you have to find out what works against that play. communicate that down to the field and then have the players on the field receive the call and adjust to play like that.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "49:31-50:18",
    "speaker" : "Andy",
    "text" : "I can't imagine I imagine it's it's drive to drive. So you see them like, okay, you know that when the the you know Certain people do this certain sign, they're in cover two defense. And so you know that, you know, it's uh you can put your zone beaters out there instead of playing your man beaters, you know. But Brady's always said that, or he came out recently and said, you know, if you look at the plays, um, it's really easy to tell if they're playing zone or man, and you right now you never see Uh he was pissed off about the quarterbacks never like audibling out of a play. Like, you know, if you're have a play that's calling your your man beaters and you can see that they're in zone, you never see the quarterbacks audible, they just go scramble around till something happens. He was pissed about that. So I don't even think Like knowing what the defense is doing is that big a deal because I think the offenses pretty much know anyway. Like you can tell if a team isn't."
  },
  {
    "speaker" : "Steve",
    "timestamp" : "50:19-50:21",
    "text" : "Put a guy in motion, figure it out. Yeah."
  },
  {
    "timestamp" : "50:21-50:29",
    "text" : "So how big a deal is it really, you know? So I uh I don't I don't I don't know what they got from the interview with Armin Katan was kinda sick.",
    "speaker" : "Andy"
  },
  {
    "text" : "He got Belichick bad Did you see that? Which w which Oh yeah, I saw that. He reads the fucking rule out, that'll check site. Well, I can know I misinterpreted it.",
    "timestamp" : "50:29-50:43",
    "speaker" : "Greg"
  },
  {
    "text" : "No. I do think he's like, oh well, you know, people think you're a cheater. He's like, well, I can't control what people think. I'm like, all right, that's that's a pretty good line. Um but yeah, I I think also the fact that the 2007 team went and did what they did after all the stuff was confiscated and they weren't allowed to do it anymore kind of shows you that it didn't really matter anyway, right?",
    "speaker" : "Andy",
    "timestamp" : "50:43-51:06"
  },
  {
    "text" : "The fuck you touched down was sick.",
    "timestamp" : "51:07-51:09",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Like this was this I I remember Greg like me and you were working clean and pool at this point, right? 2007. And this was a good one.",
    "timestamp" : "51:09-51:17"
  },
  {
    "text" : "I was in Cuba.",
    "speaker" : "Greg",
    "timestamp" : "51:17-51:18"
  },
  {
    "text" : "Huh?",
    "speaker" : "Andy",
    "timestamp" : "51:18-51:19"
  },
  {
    "text" : "I was in England.",
    "timestamp" : "51:19-51:20",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, you didn't watch any of these games live?",
    "timestamp" : "51:24-51:26"
  },
  {
    "text" : "Dude, I watched I rem I remember watching this Jets game via like ESPN's like play game thing where it just shows the play. Oh yeah. Describes the play.",
    "timestamp" : "51:26-51:37",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "51:37-51:39",
    "text" : "Like I couldn't actually watch it watching it.",
    "speaker" : "Mom"
  },
  {
    "text" : "And it was like it was like 45 yards past the Arm OS. And then it was like 37 yard past the R Moss. 64 yard pass our boss. I was like, is this thing broken? Have you fought real plays or are they just like fixing the one from before?",
    "speaker" : "Greg",
    "timestamp" : "51:39-51:52"
  },
  {
    "text" : "Yeah. Nope.",
    "speaker" : "Andy",
    "timestamp" : "51:52-51:53"
  },
  {
    "timestamp" : "51:54-51:55",
    "speaker" : "Greg",
    "text" : "I was like, this is fucking insanity."
  },
  {
    "timestamp" : "51:55-52:21",
    "speaker" : "Andy",
    "text" : "But yeah, like e going through it, or maybe it wasn't, I don't know. I thought it was that season, but it just it definitely felt like a a fuck you tour. Like they just They were putting their foot on the throats of anybody that got in their way. Like, you know what? You're next. And they were just like, they went into Dallas and just like scarabstomped them. They just absolutely lit them up. Um and Dallas was undefeated at the time and they were in there and they're like, oh yeah, we have a chance. They just fucking tore into business. And at that point I thought, oh shit."
  },
  {
    "speaker" : "Steve",
    "text" : "Um remember the Redskins game when they absolutely That was that might have been the peak when they absolutely I was like 45.",
    "timestamp" : "52:22-52:28"
  },
  {
    "text" : "Yeah, I remember I don't remember. I had Castle in there running for a touchdown at the end.",
    "timestamp" : "52:29-52:33",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "52:33-52:43",
    "speaker" : "Steve",
    "text" : "He was right around Halloween and I was King Arthur for Halloween. And so I wore a crown and my brady jersey to the college the next day."
  },
  {
    "speaker" : "Andy",
    "text" : "But there was some cool um Some cool like behind the scenes stuff from that season, I thought. Um where especially like about the Chargers game where the next game was the Chargers game after Deflate Gate, if you remember. And the pages came out and like they were fired the fuck up. Um, but they showed this like I don't know, this like stack of some sort of like computer equipment where um they were talking about how they were monitoring the frequencies. So that they they would listen in to the entire like game, I guess like the the headsets and stuff to see make sure the papers weren't cheating and all stuff. Like that's how detailed they were getting, which I had no idea was that much. Um, and the patient went out and just fucking blew the doors off the chargers anyway. It was like 417, 317, something like that. And then after the game, you know how they do the breakdown? They go, oh yeah, at the end. Mm-hmm. Uh so Brucey was doing it back then. And he goes, How do you feel about playing for Bill Beltrick? And then they all did that, oh yeah, it was like the loudest one I've heard. And then Steve, to your point, after the the Redskins game, they showed a clip of Belichick with like a smirk on his face. He's like, that shut shut him the fuck up. And then it's like let's handle this the way let's handle this one the way we always do. You know, we'll we'll we'll be on Wednesday, but it's not gonna be a fucking you know, uh you know, like a fucking summer camp, a YMCA summer camp. Like we're we're here and we're gonna go back to work. You just won fifty two to nothing.",
    "timestamp" : "52:46-54:13"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, all right, great. Brandon. They were like talking about the fuck you touchdown and like running the score. And his quote was I'm a bad motherfucker too, man.",
    "timestamp" : "54:14-54:26"
  },
  {
    "text" : "Each week Bill wanted to take the jugular. I appreciate his killer instinct. I'm a bad mother motherfucker too now. Yeah",
    "timestamp" : "54:29-54:36",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah, you are. He's the man. He came off great in this documentary too.",
    "timestamp" : "54:36-54:39"
  },
  {
    "text" : "He was very charismatic. Yeah, he's talking about that first game where uh like that first touchdown catch against the Jets. He's like, Tom Tom looks at me and goes, just get open. They talk about how he felt like forced gump when the like braces fell off. He's like the look on my face was exactly the same. Yeah. Cause he hadn't been able to like put it in high gear yet, 'cause you know he's been practicing, he didn't he didn't play freezes or anything. This was the first time he got unleashed. He was like It looked like he out jogged triple coverage to catch like a sixty-yard ball from Brady's. Yeah. Yeah. Yeah. So good.",
    "speaker" : "Andy",
    "timestamp" : "54:39-55:17"
  },
  {
    "text" : "And then they cut the biggest. And then he you know his his palms are behind the his his palm to palm and then he and then he pulls them laterally uh like he's splitting the defense.",
    "speaker" : "Steve",
    "timestamp" : "55:18-55:36"
  },
  {
    "speaker" : "Andy",
    "text" : "If you know, you know. Um, but after that, him talking about that play, they cut to um Josh McDowell's being like do it on the side. I mean like this is gonna be fun. Like, yeah, it was",
    "timestamp" : "55:37-55:48"
  },
  {
    "timestamp" : "55:50-55:53",
    "text" : "All right. Well, that's a good recap of 2007.",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "55:53-56:18",
    "speaker" : "Greg",
    "text" : "Ever works out that way, though. Like you get these super teams together. Even like when LeBron went to Miami, you were like Oh, this is gonna be so insane. And it like took like three months for it to like really get going. And I feel like it always happens when it's like highly like Everyone's got a huge expectation. But this walking right out the door, like the first quarter first drive game. You were like, holy shit, 30 or something."
  },
  {
    "text" : "Yeah, because it first drive they hit Welker like a bunch of times and he's got the first tattoo. The second one there's like Well we can do it that way. Or we can do it this way and moss down the down the seams like fuck all right.",
    "speaker" : "Andy",
    "timestamp" : "56:18-56:27"
  },
  {
    "timestamp" : "56:27-56:33",
    "text" : "This season. You know, we shouldn't let that Super Bowl sour how fucking sick this is",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "This season was amazing. I can't wait till we get to 2007 on the podcast because you're enjoyment. Yeah, I mean Todd the Teddy Bruske, his quotes on this were fantastic too. Um he's like, we're beating people's ass so bad that we're the bad guys. Sort of liked it though. I bet. And they're talking about like after, you know, like they go out there and they play for Bill and everything, but at the uh after the game, we celebrate and the their celebration was uh Brewski would go to his locker and he had a little fucking like iPod, like old school iPod in the like the speaker dock, you know, that they had. And he'd play another one bites the dust and they just crank that and everybody would just like rock out to another one bites the dust. Like it was it was that was the Death Star, right?",
    "timestamp" : "56:33-57:14"
  },
  {
    "timestamp" : "57:14-57:50",
    "text" : "That was a sick montage. That was the Death Star, yeah. They actually did that same montage in the Brady documentary. Did they? Uh-huh, because I watched it like four times because it gave me goosebumps in the 81. Same thing, same song, same like time point too of like the 07 season of like destroying teams. I'm not gonna get mad because it was sick and they did it again, which is sick as well. But I thought that was kind of interesting that they I don't know how that works with documentaries, whether they're that they copied the exact same line away. I don't know, but",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "57:51-58:05",
    "text" : "Yeah. I mean it's it's just history, right? So who knows? But um they did say that like a around this time, I think it was after that game, the the 2000 team was averaging 41 points per game. Like averaging 41, that's bananas."
  },
  {
    "text" : "This is what, you know, I mean the Super Bowl, whatever. Is the David uh the um Bernard Pollard knee on the first quarter of the next season was really fucking worst. Because the same team they're gonna run it back.",
    "timestamp" : "58:07-58:23",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah, I don't know.",
    "timestamp" : "58:24-58:25"
  },
  {
    "text" : "More vengeance on their mind, you know?",
    "speaker" : "Steve",
    "timestamp" : "58:25-58:27"
  },
  {
    "speaker" : "Andy",
    "text" : "Like Yeah, but there was the quote by um I don't know Scott Pioli in the in the episode three, actually, talking about um Like when you win that much, it kind of changes the way are you talking about like winning was kind of like",
    "timestamp" : "58:27-58:44"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "58:45-58:46",
    "text" : "Winning is only like a relief."
  },
  {
    "timestamp" : "58:46-58:53",
    "text" : "There's no quote was, yeah, after winning, instead of euphoria, it's just relief. And when you lost, it was just dark. It's true.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "58:54-58:55",
    "speaker" : "Greg",
    "text" : "That's what it felt like to be a fan."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "58:55-58:59",
    "text" : "Yeah, that's exactly how I felt. Exactly. Yeah. Especially around that 2007 season."
  },
  {
    "speaker" : "Steve",
    "text" : "But as it got as the games got tighter and tighter too later in the season.",
    "timestamp" : "58:59-59:02"
  },
  {
    "timestamp" : "59:03-59:06",
    "speaker" : "Andy",
    "text" : "Exactly. I got yeah, my my butthole got tighter and tighter."
  },
  {
    "text" : "But I'll never forget that Randy Moss. touchdowning in the Giants game or last game of the regular season where they tried to play, they missed it. They they just fucking ran it again. 50-yard touchdown. And they showed it like we barely missed that. Just like a call it again.",
    "speaker" : "Steve",
    "timestamp" : "59:06-59:21"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "59:21-01:00:40",
    "text" : "They showed it from the sideline angle, like where Rainy Moss caught the ball, like that's where the camera was. And you actually see Brady take an absolute shot to the chin when he releases that ball, too. Like he took a fucking hit. Yeah. Um, and I think in the dynasty book, Stephen, that you were talking about, this is supposed to be based on, which doesn't feel like it is. Um They were talking about how the Giants actually came away from this game the same way the Patriots came away from the Rams game in 01. We're like, we can hang with these guys and they don't want to play us again because we hit the shit out of them. Um, because they're talking about like they heard some they overheard some like offensive line or something talking about like that was the most physical game they played all season. Um, so they knew that they could just come in and just like do this against the Patriots, which is what happened. Almost very similar to that that 2001 season, right? Well you play best out of three pages win for sure. You play best out of ten pages and win nine of them, right? But it's that one that counts. Um the media in this one. I I remember Spygate Media being insufferable, but just kind of brought all of it back for me. There's everybody's calling Belchek arrogant at using words like hubris and you know, the stain on the league and everything. It's like, all right, I mean Oh really?"
  },
  {
    "text" : "But did Arlen did Arlen Spectre make an appearance in in this? Nope. God damn, that was my favorite part of the whole spy gay thing. Wait. Fucking spy? Huh? I thought he was fighting. No, he was fighting.",
    "timestamp" : "01:00:42-01:00:55",
    "speaker" : "Steve"
  },
  {
    "text" : "Yeah, he was back. Yeah.",
    "timestamp" : "01:00:55-01:00:57",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:00:58-01:01:01",
    "text" : "He wanted to do a legit congressional investigation."
  },
  {
    "text" : "Yeah, exactly.",
    "timestamp" : "01:01:01-01:01:02",
    "speaker" : "Andy"
  },
  {
    "text" : "And that's that point. It's like it's a misdemeanor. And like, let's just fuck in.",
    "timestamp" : "01:01:03-01:01:07",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:01:08-01:01:37",
    "speaker" : "Andy",
    "text" : "Yeah. But yeah, and then like halfway through the episode, like for at the beginning, like, oh yeah, Bellatrax, you know. should be booted from the league on then then at the end they're like, oh they're definitely going on the fear. There's no way they're like they have the best chance going. Like they completely 180. Like not even talking about the flake gate anymore or spy gate anymore. Just like Back on the Patriots nuts. It's like, well, I it's typical, but I just ugh fucking media. Especially Boston Harold."
  },
  {
    "timestamp" : "01:01:39-01:02:01",
    "text" : "This I had more problem with the deflate gate one because that one to me felt like Dude, it's a fucking PSI. You know what I'm saying? Like it's a field thing. It has and we didn't even prove it was true. Right. And everyone fucking lost their mind. This to me feels a little shadier. And it's like black and white. They cheated. We've basically admitted they cheated.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:02:01-01:02:02",
    "speaker" : "Andy",
    "text" : "Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "So to me for this one, it's like, yeah, we'll take the fucking hammer in for this. We got caught. Yeah, but it could have a big impact. If you know what other teams is calling, to me that means something in it in life NFL. If it was on if you knew their offensive play call, yeah. Yeah, if you know what they're playing if they're calling, like that's an advantage. I don't care what you say.",
    "timestamp" : "01:02:02-01:02:26"
  },
  {
    "speaker" : "Steve",
    "text" : "I have bad news guys. Yeah. I just Googled Arlen Specter to Flake Gate or Spy Gate. Yeah. ESPN. Written by Seth Wickersham. Okay. Here we go. Title Sun, comma, Ghostwriter of Late Senator Say Trump intervened to stop probe. of Peach's spygate stand scandal.",
    "timestamp" : "01:02:27-01:02:49"
  },
  {
    "text" : "Oh yeah dude no way.",
    "speaker" : "Andy",
    "timestamp" : "01:02:50-01:02:53"
  },
  {
    "timestamp" : "01:02:54-01:03:00",
    "speaker" : "Steve",
    "text" : "Did you see the latest Wickersham? 21, May 21. Did you see the latest Wickersham? This thing, yeah. This thing."
  },
  {
    "timestamp" : "01:03:01-01:03:17",
    "text" : "Where he's claiming that um Kraft basically called out the Falcons and said, you know, don't hire Belajack. Yeah. Yeah. I I've lost some respect for craft during all of this, but I I don't even know if I'll go that far. That doesn't take a lot of legitimate.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Greg",
    "text" : "Yeah.",
    "timestamp" : "01:03:18-01:03:19"
  },
  {
    "text" : "Yeah. I'm sure they had a heart to heart and I'm sure he was like, you know, I mean Belichick's tough to work with because he is. If you want to win, he's probably the guy you want. Yep. If you want to change the culture in your own.",
    "timestamp" : "01:03:19-01:03:31",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "timestamp" : "01:03:31-01:03:39",
    "text" : "And who did they go with? Like Raheem Moore or some shit? Like it was, yeah. Come on. Like they have a terrible. Terrible."
  },
  {
    "timestamp" : "01:03:40-01:03:49",
    "text" : "Talk about like calling Belichick's references like it's a fucking like we're interviewing someone like for an entry-level decision who's not taking the Super Bowl winner.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:03:50-01:03:50",
    "speaker" : "Steve",
    "text" : "Like yeah."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:03:52-01:03:55",
    "text" : "Yeah. Yeah, his references are six of them. They're sitting behind him."
  },
  {
    "text" : "Yeah, no shit. Yeah. The Giants ones too.",
    "timestamp" : "01:03:56-01:03:59",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Oh god. Um Yeah, there was some fucking choice uh newspaper things in this too, which I'm kind of glad they're going out of business now. Um The Boston Herald, John Tomas, they come out with. the um taping, the spy gate two of taping the Rams Super Bowl, like you said, Greg. And how Mike Morris, I think, has come out and like said he believes it still. And I think um Marshall Falk as well. Mm-hmm. Like, yeah, no, that sounds right. I'm pretty sure that happened because we we could tell they they knew what our plays were. I don't know. Um like I don't know. I I I I I feel I'm I chalk it up to the Rams being salty that they lost to a 14-point underdog, which I would be too, but then you look at the 2007 pages and you never hear them talk badly about the Giants at all. Right. It's always just like, yeah, we didn't do what we did.",
    "timestamp" : "01:03:59-01:04:54"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean, there wasn't any rulers that Jonathan Kraft fucking got him though, the Herald. He was like The quote that I have it here.",
    "timestamp" : "01:04:55-01:05:05"
  },
  {
    "speaker" : "Andy",
    "text" : "Uh you got the quote. If the paper was worth owning, we would have owned it. But it wasn't, so we didn't. Like well shit yeah that's that ain't bad.",
    "timestamp" : "01:05:05-01:05:16"
  },
  {
    "timestamp" : "01:05:16-01:05:24",
    "text" : "Yeah dude dying industry bro yeah Podcast, dude. We're worth owning. Podcast is where it's at.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "That's the future. Dude, nobody can own this. They can't afford it. But yeah, it did it it did go like this whole 180 from, you know, the Patriots being the good guys back in episode three winning the Super Bowl against the you know the the Rams gonna be a dynasty. um and then this being the it ended with um Michael Strahan showing the um the parade for the 2007 Giants with Michael Strahan talking over it, uh felt like the fi the good guys finally won and America like It was had been rooting against the the Patriots the this whole time that the evil had finally been defeated. Um And then it said like as it fade to black said, but the devil was not done. And it like showed the pages being introduced as a to another Super Bowl. Like, yeah. I mean, yeah.",
    "timestamp" : "01:05:24-01:06:16"
  },
  {
    "timestamp" : "01:06:17-01:06:24",
    "text" : "I mean, if you if you wouldn't, you're gonna be Hated. Like I hate the cheese. Yeah. You know.",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:06:24-01:06:25",
    "speaker" : "Andy",
    "text" : "I don't even hate them anymore."
  },
  {
    "text" : "They're uh",
    "speaker" : "Greg",
    "timestamp" : "01:06:30-01:06:30"
  },
  {
    "timestamp" : "01:06:31-01:06:32",
    "speaker" : "Andy",
    "text" : "They're just in it."
  },
  {
    "timestamp" : "01:06:32-01:06:37",
    "speaker" : "Greg",
    "text" : "But like everything Mahomes does like pisses me off now. Yeah. It wasn't like that is rookie season."
  },
  {
    "timestamp" : "01:06:37-01:06:38",
    "speaker" : "Andy",
    "text" : "That's true."
  },
  {
    "text" : "It's because they keep winning.",
    "timestamp" : "01:06:38-01:06:39",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Right. Yeah, that's fair.",
    "timestamp" : "01:06:39-01:06:41"
  },
  {
    "text" : "Um like I don't even dislike moms, if I'm being honest. I like him. Yeah. But now I see everything I see through the lens of fuck this guy, you know?",
    "timestamp" : "01:06:41-01:06:50",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah. Yeah. There's only one team I hate. Jets? Yeah, yeah. You want to talk to me. This is why this is why I'm like unique. Like the jets fucking suck, and everyone's like, why do you hate them? They suck. Shouldn't you like, you know, be ambivalent, but nope, fucking hate them.",
    "timestamp" : "01:06:50-01:07:07"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:07:07-01:07:11",
    "text" : "What do you think about Man Genie? Because they touched on that here too."
  },
  {
    "timestamp" : "01:07:11-01:07:37",
    "speaker" : "Andy",
    "text" : "They did, yeah. Yeah, I hate him. Um definitely a scumbag move Yeah, 'cause there was a lot of I think it was a very joke. You you keep all that to yourself because they're the ones that helped you come up, right? Ye It got you there. Yeah, exactly. So you just you don't you you don't spit in that"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:07:37-01:07:47",
    "text" : "Um which feels kind of like shady, right? I mean that's Hey we're cheating. Don't tell anybody we're cheating once you leave because otherwise you're gonna be like judge too."
  },
  {
    "timestamp" : "01:07:47-01:07:49",
    "text" : "Yeah, that's work though, isn't it?",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:07:49-01:08:13",
    "speaker" : "Greg",
    "text" : "I mean it's also like it's also so fucking petty to be like, well I'm playing them and they're cheating. It's like, yeah, but you were on their side like Six months ago cheating, so you can't really be like bitching and moaning about it. Yeah, you can't put yourself above them. Yeah. And like what do you think is gonna happen? Like they're just gonna be like, oh fine, yeah, you know obviously gonna hate you for the rest of your life because you fucking double cost them."
  },
  {
    "timestamp" : "01:08:15-01:08:23",
    "speaker" : "Andy",
    "text" : "Which is weird because I think Man Gini, like they didn't even touch on how close Man Gini was, but he was like I think Belichick was at his wedding or something like that. It was like a best of the wheel."
  },
  {
    "timestamp" : "01:08:23-01:08:27",
    "text" : "Yeah, they said that him and Belichick were really close. That's all they But they did mention it.",
    "speaker" : "Greg"
  },
  {
    "text" : "Right, but yeah. Um, but like I I don't think they were emphatic enough about how close I think they were like super fucking close.",
    "speaker" : "Andy",
    "timestamp" : "01:08:27-01:08:34"
  },
  {
    "text" : "We'll cover that in a future podcast episode, Andy.",
    "speaker" : "Steve",
    "timestamp" : "01:08:34-01:08:37"
  },
  {
    "timestamp" : "01:08:37-01:08:43",
    "text" : "I wish I could hear like the real honest conversation like a Belichick would have about that.",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "Yeah. Like he must have been fuming. Fuming. Well they they they kind of touch on that too about like Pioli was saying. he felt that uh Man Gini had betrayed him and he was like so close to him that it caused Belichick to kind of diss himself from everybody else who was close to him in that organization, which kind of set a bit of the tone. I'm wondering how long that went. Um and if that was like something that eventually softened and then they started winning Super Bowls again, you know? I thought that was interesting. Was that part of the drought? You know, was Belichick just wanted to do it all by himself because he couldn't trust anybody.",
    "timestamp" : "01:08:44-01:09:19"
  },
  {
    "text" : "No, I think it's just hard to win the fucking Super Bowls.",
    "speaker" : "Steve",
    "timestamp" : "01:09:22-01:09:24"
  },
  {
    "text" : "I mean that's that too. I think so too.",
    "timestamp" : "01:09:24-01:09:27",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:09:27-01:09:29",
    "speaker" : "Steve",
    "text" : "Because they're in the mix every single fucking year."
  },
  {
    "timestamp" : "01:09:29-01:10:39",
    "speaker" : "Andy",
    "text" : "So I mean yeah, and I've had you know that you you see a lot of pages hangers talking about how, you know, the pages always every Super Bowl they won they got lucky. And it's like, well, yeah, I mean i it to win a Super Bowl, it takes some luck. Every Super Bowl winner has gotten like a lucky break somewhere along the lines, right? Um, but you have to put yourself in that situation. You have to be good enough to be able to get to the playoffs. And then make folds and essentially good. Like say say say you get a call where um a fumble was ruled an incompletion. You're still losing. You still have to finish that drive, score the touchdown, and then go kick an out of the field goal in the next drive, right? Um, so like there's like yeah, there's some luck happening, but like every team has to have a bounce here or there to make it work. Um and the patients just put themselves in the position. Like they wanted to 14 straight AFC championship games and won nine of them. Like, if you can get there Like you'll take the lucky bounces to get to the next stage because like it's football and anything can happen on any given day. Look at the 2007 Super Bowl, right? 2001 Super Bowl. Even like Bernie Adams talking about like 2001 Super Bullies, like yeah, they were the better team. We just, you know, we we had a game plan and it worked. But skill level wise, we weren't there yet."
  },
  {
    "timestamp" : "01:10:40-01:10:41",
    "speaker" : "Greg",
    "text" : "Two Super Bowls for the 07."
  },
  {
    "text" : "Which ones? Yeah. So would I.",
    "speaker" : "Andy",
    "timestamp" : "01:10:43-01:10:46"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:10:47-01:11:13",
    "text" : "If I get to pick which ones. I wouldn't give up like the 28 to 3 and the Seahawks won. Right. I wouldn't give up. Would you give up both Rams? But if you told me like the second rant, yeah. Oh, both Rams went too. The first one was sick. Right. I give up the the The Rams one, the second Ram one Rams one, and either of the uh Carolina. Eagles, yeah."
  },
  {
    "text" : "All three or four, yeah. I mean, yeah, I think that's pretty Pretty much what most people would say, I would imagine. But the thing is, if you win that two thousand seven season, do Belichick and Brady stick around? If you finish the perfect seed, like what else is left?",
    "speaker" : "Andy",
    "timestamp" : "01:11:14-01:11:29"
  },
  {
    "text" : "They just keep fucking kicking dicks.",
    "timestamp" : "01:11:29-01:11:31",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:11:32-01:11:38",
    "text" : "Why bother? You beat the game. Like there's nothing else, there's nowhere higher to go. Like you just keep pulling wins."
  },
  {
    "text" : "Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:11:39-01:11:39"
  },
  {
    "timestamp" : "01:11:40-01:11:48",
    "speaker" : "Andy",
    "text" : "Maybe. But I feel like the drive's not there anymore. Like I feel like that lit a fire. Like another more of a fire. I mean obviously they sort of fire."
  },
  {
    "text" : "That's a good question. If they win in 07, do they win the three? Five, six, seven years later. I don't know.",
    "speaker" : "Steve",
    "timestamp" : "01:11:48-01:11:54"
  },
  {
    "speaker" : "Greg",
    "text" : "I mean Brit what did Brady have left to prove exactly.",
    "timestamp" : "01:11:54-01:11:57"
  },
  {
    "timestamp" : "01:11:57-01:12:22",
    "speaker" : "Steve",
    "text" : "I mean keeping up with Manning with all the but honestly I think uh at its core is how they're both wired, is like Even if they win, they they're they're ultimate competitors and they don't care. They're just gonna like, let's win it again, let's win two in a row, let's go fucking uh let's go two undefeated seasons in a row, you know? Like And that's what's made them so good at their jobs. Because they're fucking psychopaths. Yeah."
  },
  {
    "text" : "So yeah, the fucking watching the Super Bowl sucked. That was bad.",
    "timestamp" : "01:12:23-01:12:27",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:12:27-01:12:53",
    "speaker" : "Andy",
    "text" : "Although I will say, um That throw that Brady had last play, last cast, to um sideline may have been the uh best. Brady passed and nobody remembers. It went like 70 yards in the air and hit him in the fingertips in stride and just got broken up."
  },
  {
    "timestamp" : "01:12:53-01:12:57",
    "speaker" : "Greg",
    "text" : "Like that's a fucking sick if he caught that."
  },
  {
    "timestamp" : "01:12:57-01:12:58",
    "speaker" : "Andy",
    "text" : "Right."
  },
  {
    "text" : "Imagine.",
    "timestamp" : "01:12:58-01:12:59",
    "speaker" : "Greg"
  },
  {
    "speaker" : "Andy",
    "text" : "And if that's how they win, that'd be awesome. If you catch that one over time and then win it. Last second. You fucking kidding me? Like that you walk away. You walk her in the game because you can't top it. Oh shit.",
    "timestamp" : "01:12:59-01:13:11"
  },
  {
    "timestamp" : "01:13:11-01:13:13",
    "text" : "He's like, I'm really not trying to relive this.",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:13-01:13:16",
    "text" : "Alright, what's next? I felt so bad to ru for Radio. What's next?"
  },
  {
    "speaker" : "Greg",
    "text" : "It's hard. It's hard at What's next?",
    "timestamp" : "01:13:17-01:13:21"
  },
  {
    "timestamp" : "01:13:21-01:13:22",
    "speaker" : "Andy",
    "text" : "So next."
  },
  {
    "timestamp" : "01:13:22-01:13:23",
    "speaker" : "Greg",
    "text" : "Uh Aaron Hernandez."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:24-01:13:27",
    "text" : "Episode five is Torn. Episode six. The devil's not dead yet."
  },
  {
    "text" : "Are we are we still on I can't believe I'm I'm really trying to think of that 2005's Chiefs game where he throws three interceptions to that no-named Chiefs guy.",
    "speaker" : "Steve",
    "timestamp" : "01:13:28-01:13:36"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:13:37-01:13:38",
    "text" : "Can you just look it up already?"
  },
  {
    "speaker" : "Steve",
    "text" : "Yeah, let me actually look that up.",
    "timestamp" : "01:13:38-01:13:40"
  },
  {
    "timestamp" : "01:13:40-01:14:21",
    "text" : "Jesus. So one last note on this one. One quote that I thought was pretty funny. that had shades of 2001 going back to it was they had some Giants player being like, our dynasty starts today after being the Patriots. I thought, mm, nah. That didn't work out. Nope. I don't even think you made the playoffs next year. Oh boy. Well yeah. And then there was this New York Post. I clipped it. Uh uh took a screenshot of New York Post. Uh like front page said who's afraid of Tom Brady now girly man limps home because they caught him with a boot on before the Super Bowl.",
    "speaker" : "Andy"
  },
  {
    "timestamp" : "01:14:21-01:14:23",
    "speaker" : "Greg",
    "text" : "Girly man limps home, dude. Right."
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:14:23-01:14:28",
    "text" : "Girly man walk like how is this a fucking legit news? Yeah."
  },
  {
    "speaker" : "Greg",
    "text" : "I mean that's a it's a comedy newspaper, you know. The girl boy who lives home is so funny. Girl lives home.",
    "timestamp" : "01:14:36-01:14:43"
  },
  {
    "text" : "And it's just like him walking. With like you can just barely see a boot on like underneath his jeans and they have it like circled in red. Yet Steve? Come on.",
    "timestamp" : "01:14:43-01:14:55",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Greg Wesley. Okay. Yeah, he has more he has more picks than I thought. He has 29 career interceptions.",
    "timestamp" : "01:14:55-01:15:04"
  },
  {
    "timestamp" : "01:15:05-01:15:05",
    "speaker" : "Andy",
    "text" : "He's reasonable."
  },
  {
    "timestamp" : "01:15:05-01:15:09",
    "text" : "But he had three picks of Brady in the next game watching? Yeah.",
    "speaker" : "Steve"
  },
  {
    "text" : "I had no idea. Brady throws four in the game. Yeah, no. Doesn't do that often. He only did that a couple times.",
    "speaker" : "Andy",
    "timestamp" : "01:15:09-01:15:17"
  },
  {
    "text" : "I know it is. What? He's only got one G on there.",
    "speaker" : "Greg",
    "timestamp" : "01:15:17-01:15:25"
  },
  {
    "timestamp" : "01:15:26-01:15:37",
    "speaker" : "Steve",
    "text" : "Yeah, play the Chiefs two thousand through two thousand seven. 83 No 500 tackles?"
  },
  {
    "speaker" : "Andy",
    "text" : "How many 118 games? How many games do you think Brady threw four interceptions in in his career with the Patriots? Six to ten. Damn, Greg.",
    "timestamp" : "01:15:38-01:15:49"
  },
  {
    "speaker" : "Greg",
    "text" : "Six?",
    "timestamp" : "01:15:51-01:15:51"
  },
  {
    "speaker" : "Andy",
    "text" : "Six.",
    "timestamp" : "01:15:51-01:15:52"
  },
  {
    "text" : "Nice Speaking of uh Greg's that have two G's in our assholes, did you see this guy? Yeah,",
    "timestamp" : "01:15:52-01:16:01",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:16:06-01:16:06",
    "text" : "Documentary?",
    "speaker" : "Steve"
  },
  {
    "timestamp" : "01:16:07-01:16:07",
    "text" : "No, no, no.",
    "speaker" : "Andy"
  },
  {
    "text" : "He he's just in the news because he was uh being super fucking He's the Indianapolis reporter that was all over the patch for the Oh that other Greg, not not the not the Donnie King Greg. Dude, every Greg with two G's is a dickhead. That's true. Yeah.",
    "speaker" : "Greg",
    "timestamp" : "01:16:07-01:16:24"
  },
  {
    "speaker" : "Andy",
    "timestamp" : "01:16:25-01:17:00",
    "text" : "Yeah, you're absolutely right. Yeah, because what what's this what's the uh yeah, the the um bounty gate guy, Greg uh Williams? Yes, yeah. He was the uh Bills coach when they were taken the the uh the team that took that shot on Brady where his helmet popped off when he tried to slide. Yeah. You know that that clip you always see of Brady getting hit? Yeah, it's a great one. Kate Clemens. I think it was, yeah. And and that's the game where um Patton got knocked out cold, but because the ball was out, because he was touching out of bounds and touching the ball was still his. Yeah. Same team. Fucking headhunters, of course."
  },
  {
    "text" : "It's okay. Greg Doyle responded. He said, he tweeted this 23 hours ago. He said, Caitlin Clark, I'm so sorry. Today I was part of the problem.",
    "timestamp" : "01:17:00-01:17:09",
    "speaker" : "Greg"
  },
  {
    "timestamp" : "01:17:10-01:17:25",
    "speaker" : "Andy",
    "text" : "Well that's because his his account got cancelled today. His account got canceled today because he he initially posted a um a blog or an article about it. And it showed that he hadn't learned a lesson at all. He's like, oh, it's just how I talk to people. Yeah, okay."
  },
  {
    "text" : "I mean, to me, he's just fucking, yeah, he's just a weirdo. Like I don't think it was like Him trying to like get in her paper.",
    "speaker" : "Greg",
    "timestamp" : "01:17:26-01:17:32"
  },
  {
    "timestamp" : "01:17:32-01:18:00",
    "speaker" : "Andy",
    "text" : "Yeah, it's still uh no, but it was still like, yo, well you know if if you do that to me, you know, we'll we'll have a good relationship. It's like a sketch, dude. He's just an uncharismatic human. He's just yeah, he's just a He's a dick. And he's also like he's the guy that made up that um Aegis fan slash his tires uh because of his reporting on the flake gate. And it turned out that that didn't happen. Yeah, absolute loser."
  },
  {
    "text" : "That's tough.",
    "speaker" : "Steve",
    "timestamp" : "01:18:00-01:18:01"
  },
  {
    "timestamp" : "01:18:01-01:18:03",
    "speaker" : "Greg",
    "text" : "Sally looks like such a noob too."
  },
  {
    "text" : "Yeah. All right. So I think we've talked enough about this and we're going to have to save some of our sanity for the next Six episodes there's six more.",
    "timestamp" : "01:18:04-01:18:15",
    "speaker" : "Andy"
  },
  {
    "text" : "There's six more.",
    "timestamp" : "01:18:15-01:18:16",
    "speaker" : "Steve"
  },
  {
    "speaker" : "Greg",
    "text" : "Is Aaron Hernandez in the next uh thing? Yes. Uh you need to watch it, please.",
    "timestamp" : "01:18:16-01:18:22"
  },
  {
    "timestamp" : "01:18:22-01:18:30",
    "speaker" : "Steve",
    "text" : "Can you do that? Yeah, I don't have any way I desire it's really just a lack of desire."
  },
  {
    "timestamp" : "01:18:30-01:18:34",
    "text" : "Right, I know, but I have to do it. Because yeah, you have to.",
    "speaker" : "Andy"
  },
  {
    "speaker" : "Steve",
    "text" : "Why? I already know how Aaron get caught because he has cameras in his house, you know. That's why I don't have a ring camera, just in case I murder somebody.",
    "timestamp" : "01:18:34-01:18:42"
  },
  {
    "speaker" : "Greg",
    "timestamp" : "01:18:42-01:18:50",
    "text" : "Well, at the very least, can you go kill someone and have homosexual sex between the next time we record? So you can have something to talk about."
  },
  {
    "speaker" : "Andy",
    "text" : "So we need we need to have something to add to the podcast, please. Jesus.",
    "timestamp" : "01:18:50-01:18:54"
  },
  {
    "timestamp" : "01:18:55-01:18:55",
    "speaker" : "Steve",
    "text" : "All right."
  },
  {
    "text" : "Well I guess.",
    "speaker" : "Mom",
    "timestamp" : "01:18:55-01:18:56"
  },
  {
    "speaker" : "Andy",
    "text" : "Alright, I'll see you soon, Greg. We should all do that. I think there's only one thing left to say.",
    "timestamp" : "01:18:56-01:19:06"
  },
  {
    "speaker" : "Greg",
    "text" : "Tune in next week to see how much of a blubbering little bitch Greg is on the Patriots Dynasty podcast.",
    "timestamp" : "01:19:07-01:19:14"
  },
  {
    "timestamp" : "01:19:15-01:19:17",
    "speaker" : "Steve",
    "text" : "See you later. See you later."
  }
]